{
    "id": 100292,
    "old_rating": "4.46218",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon olive oil",
        "2 pounds boneless lamb shoulder, cut into 1 1/2 inch pieces",
        "1/2 teaspoon salt",
        "freshly ground black pepper to taste",
        "1 large onion, sliced",
        "2 carrots, peeled and cut into large chunks",
        "1 parsnip, peeled and cut into large chunks (optional)",
        "4 cups water, or as needed",
        "3 large potatoes, peeled and quartered",
        "1 tablespoon chopped fresh rosemary (optional)",
        "1 cup coarsely chopped leeks",
        "chopped fresh parsley for garnish (optional)"
    ],
    "nut": [
        "Calories > 609 kcal",
        "Carbs > 43.4 g",
        "Cholesterol > 109 mg",
        "Fat > 35.1 g",
        "Protein > 29.8 g",
        "Sodium > 325 mg"
    ],
    "n": "Irish Stew",
    "a": "Ita",
    "r": "0",
    "s": 6,
    "des": "\"Every Irish household has their own version of this famous dish-so here's mine. I like to add chunky pieces of parsnip for a little sweetness, and fresh rosemary gives it a distinct flavour and aroma. If you use a tougher cut of meat, you can leave it to simmer longer before adding the potatoes. Fantastic on a cold, blustery day-served with a pint of the black stuff, of course!\"",
    "ins": "Heat oil over medium heat in a large stockpot or Dutch oven. Add lamb pieces and cook, stirring gently, until evenly browned. Season with salt and pepper.\nAdd the onion, carrots, and parsnips and cook gently alongside the meat for a few minutes. Stir in the water. Cover and bring to a boil before turning the heat down to low.  Simmer for 1 hour or longer, depending on the cut of meat you used and if it is tender yet.\nStir in potatoes, and simmer for 15 to 20 minutes, before adding leeks and rosemary. Continue to simmer uncovered, until potatoes are tender but still whole. Serve piping hot in bowls garnished with fresh parsley.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "3497680.jpg",
    "o": "3497680.jpg,3383375.jpg,672276.jpg,265224.jpg,178848.jpg,178846.jpg",
    "st": "allrecipes"
}