{
    "id": 100338,
    "old_rating": "4.08571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound ground beef",
        "1/2 cup chopped onion",
        "1/2 teaspoon crushed red pepper flakes (optional)",
        "1 teaspoon dried parsley",
        "1 teaspoon dried oregano",
        "1 teaspoon garlic powder",
        "1/2 cup beef broth (optional)",
        "1 (10.75 ounce) can  cream of mushroom soup",
        "1 (10 ounce) can corn, drained",
        "2 cups cold, cooked white rice",
        "1 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 580 kcal",
        "Carbs > 44 g",
        "Cholesterol > 105 mg",
        "Fat > 30.3 g",
        "Protein > 33.6 g",
        "Sodium > 1081 mg"
    ],
    "n": "Chuck Wagon Hash",
    "a": "Dog Lovin' Mama",
    "r": "0",
    "s": 4,
    "des": "\"Chuck wagon hash is a dish that is made up of ground beef, onions, rice, corn, cream of mushroom soup, beef broth, seasonings and topped off with Cheddar cheese.  It's an easy, inexpensive, hearty meal that will have your family begging for more.  This dish is very versatile.  You can substitute shredded hash browns for the rice and/or green beans for the corn.  Let your imagination lead you to the perfect meal for your family.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace a large skillet over medium-high heat. Brown the ground beef, stirring constantly to break it up into fine pieces. When the beef is no longer pink, add the onion, and continue cooking until the onion has softened, and the beef has browned, about 5 more minutes.\nDrain excess grease from the beef, then season with pepper flakes, parsley, oregano, and garlic powder. Stir in beef broth, mushroom soup, corn, and rice. Cook for a few minutes to warm, then pour into a casserole dish.\nBake in preheated oven for 25 minutes, then sprinkle with Cheddar cheese, and continue baking for 5 minutes or until cheese melts.",
    "pt": "10 m",
    "ct": "45 m",
    "tt": "55 m",
    "i": "2963613.jpg",
    "o": "",
    "st": "allrecipes"
}