{
    "id": 10061,
    "old_rating": "4.86667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 ounces almond paste",
        "1 1/2 cups butter, softened",
        "1 cup white sugar",
        "4 eggs, separated",
        "2 cups sifted all-purpose flour",
        "1 teaspoon almond extract",
        "1/4 teaspoon salt",
        "4 drops red food coloring",
        "4 drops green food coloring",
        "1 1/2 cups apricot jam",
        "1 pound semisweet chocolate, chopped"
    ],
    "nut": [
        "Calories > 317 kcal",
        "Carbs > 38.1 g",
        "Cholesterol > 53 mg",
        "Fat > 18.1 g",
        "Protein > 3.9 g",
        "Sodium > 109 mg"
    ],
    "n": "Venetians",
    "a": "Elaine",
    "r": "0",
    "s": 28,
    "des": "\"Bar cookie consisting of three layers separated by jam filling and coated with chocolate.\"",
    "ins": "Grease 3 - 13 x 9 inch pans.  Line with wax paper.  Preheat oven to 350 degrees F (180 degrees C).\nCombine almond paste, sugar, butter, egg yolks and almond extract.  Beat for 5 minutes until light and fluffy. Beat in flour and salt.\nIn a separate bowl, beat egg whites until stiff peaks form.  With a wooden spoon, fold into the almond mixture.\nDivide dough into 3 -1 1/2 cup portions.  Add red coloring to one of the portions, and green to the another. Spread the batter in the 3 separate prepared pans (keeping the colors separate).\nBake for 15 minutes, or until edges are golden brown.  (Each layer will be 1/4 inch thick). Remove cakes from pan immediately.  Cool thoroughly.\nStack layers in a 9 x 13 inch pan, spreading apricot jam between layers (no jam on top layer). Place second 9 x 13 inch pan on top and weigh down with two 5 pound bags of sugar or flour.  Refrigerate overnight.\nMelt chocolate over hot water and spread over cake.  Allow to set.  Trim edges and cup into 1 inch squares.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "755414.jpg",
    "o": "",
    "st": "allrecipes"
}