{
    "id": 100705,
    "old_rating": "4.55769",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil",
        "1 pound lean ground turkey",
        "1 cup red bell pepper, chopped",
        "3 cloves garlic, minced",
        "1 (16 ounce) can kidney beans, rinsed and drained",
        "1 (16 ounce) can black beans, rinsed and drained",
        "1 cup rinsed and drained canned black-eyed peas",
        "1 (15 ounce) can low sodium tomato sauce",
        "1 dried habanero pepper, chopped",
        "1 cup frozen corn kernels",
        "1 tablespoon packed brown sugar",
        "1 teaspoon Worcestershire sauce",
        "1 tablespoon dried basil",
        "1 teaspoon dried sage",
        "salt to taste"
    ],
    "nut": [
        "Calories > 240 kcal",
        "Carbs > 27 g",
        "Cholesterol > 33 mg",
        "Fat > 8.2 g",
        "Protein > 16.6 g",
        "Sodium > 380 mg"
    ],
    "n": "Slow-Cooked Habanero Chili",
    "a": "Nicole",
    "r": "0",
    "s": 10,
    "des": "\"This is a thick, spicy, slow-cooked chili I adapted from another recipe. It's great for parties or cold nights! Serve topped with shredded Cheddar cheese or crumbled cornbread.\"",
    "ins": "Heat 1 tablespoon of olive oil in a large skillet over medium-high heat. Add the ground turkey and cook until no longer pink and evenly browned, about 10 minutes. Using a slotted spoon, place the cooked meat into a slow cooker, and drain any oil from the skillet.\nUsing the same skillet, heat the remaining 2 tablespoons of olive oil over medium-high heat. Stir in the red pepper and garlic; cook until tender, about 3 minutes. Stir into the slow cooker with the turkey.\nStir the kidney beans, black beans, black-eyed peas, tomato sauce, and habanero pepper into the slow cooker with the turkey mixture. Set on High and cook for 3 hours, or on Low for 7 hours.\nOne hour before the time is up, stir in the corn, brown sugar, Worcestershire sauce, basil, and sage. Continue cooking the chili for the remaining hour. Season to taste with salt.",
    "pt": "20 m",
    "ct": "8 h",
    "tt": "8 h ",
    "i": "210015.jpg",
    "o": "",
    "st": "allrecipes"
}