{
    "id": 100966,
    "old_rating": "4.37931",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/4 pounds potatoes, peeled and cut into chunks",
        "1/2 cup heavy cream",
        "3 tablespoons butter",
        "1 pinch ground nutmeg",
        "salt and pepper, to taste",
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "1 1/2 pounds leeks, sliced",
        "2 medium tomatoes - peeled, seeded, and coarsely chopped",
        "1 1/2 pounds cooked ham, thinly sliced",
        "1 egg yolk, lightly beaten",
        "1/4 cup shredded mozzarella cheese (optional)"
    ],
    "nut": [
        "Calories > 675 kcal",
        "Carbs > 50.1 g",
        "Cholesterol > 143 mg",
        "Fat > 40.8 g",
        "Protein > 28.7 g",
        "Sodium > 1572 mg"
    ],
    "n": "French Leek and Ham Shepherd's Pie",
    "a": "Rita Machado",
    "r": "0",
    "s": 6,
    "des": "\"This is a very tasty dish and a different way of making a shepherd's pie. Ham, leeks, and potatoes baked in a creamy mashed potato crust.\"",
    "ins": "Preheat oven to 375  degrees F (190 degrees C). Lightly oil a 2 quart casserole dish.\nBring a large pot of salted water to a boil.  Add potatoes and cook until tender but still firm, about 15 minutes. Drain, cool and chop. Stir in the cream, butter, nutmeg, salt, and pepper and mash until smooth.\nHeat the olive oil in a large skillet over medium heat. Cook the onion until translucent. Stir in the leek and cook another minute until the leek is soft, but not brown. Mix in the peeled tomatoes, lower the heat, and simmer five minutes, stirring occasionally until the tomatoes have lost some of their shape. Stir in the ham and season with salt and pepper.\nSpread half of the mashed potatoes on the bottom of the casserole dish. Pour in the ham and leek sauce and cover with the remaining mashed potatoes. Brush the surface of the mashed potatoes with the beaten egg yolk. Sprinkle on the shredded mozzarella. Bake in the preheated oven for 20 minutes, or until golden brown.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "975144.jpg",
    "o": "",
    "st": "allrecipes"
}