{
    "id": 10091,
    "old_rating": "4.20779",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups white sugar",
        "1 cup shortening",
        "1 tablespoon vanilla extract",
        "1 teaspoon almond extract",
        "2 eggs",
        "6 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1 teaspoon baking powder",
        "1 teaspoon salt",
        "1 cup milk"
    ],
    "nut": [
        "Calories > 214 kcal",
        "Carbs > 32.9 g",
        "Cholesterol > 13 mg",
        "Fat > 7.6 g",
        "Protein > 3.3 g",
        "Sodium > 144 mg"
    ],
    "n": "Dora's Christmas Cookies",
    "a": "Beverly Metzger",
    "r": "0",
    "s": 30,
    "des": "\"This recipe has been in my family for over 50 years.  As a child, I couldn't wait to go to my sister's house to bake these.   We would bake all one day and decorate them all day the next.  Fond memories.  Cut down on the salt if using margarine.\"",
    "ins": "Preheat oven to 350 degrees F (180 degrees C).\nMix together sugar, shortening or margarine, vanilla extract and almond extract  Cream these together until light.   Add eggs and beat well.\nCombine flour, baking soda, baking powder and salt  ( use 1/2 teas. if using margarine).  Add to sugar mixture alternately with milk, ending with flour mixture.  Dough will be quite stiff and may require mixing the last bit of flour in by hand.\nRoll out portions of dough on floured board and cut with your favorite cookie cutters.\nPlace on greased cookie sheets and bake for 10  to  12  minutes .   Test for doneness by touching lightly with your finger.  If there is no dent, they're done.  Cool and frost, decorate with colored sugars and  colored frosting..\nNote:  If you like crisp cookies, roll the dough thinner.  For more cake-like dough roll thicker and use metal cookie cutters.  Originally we used Anise oil to flavor the dough (5 to 6 drops)  in place of the vanilla and almond extracts.  But my children prefer the extracts.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "165046.jpg",
    "o": "",
    "st": "allrecipes"
}