{
    "id": 10104,
    "old_rating": "1.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (.25 ounce) package active dry yeast",
        "1 cup milk",
        "3/4 cup white sugar",
        "1/2 cup butter",
        "1 teaspoon salt",
        "5 1/4 cups all-purpose flour",
        "2 eggs",
        "1 (12 ounce) can poppyseed filling",
        "1 teaspoon lemon zest",
        "1 tablespoon lemon juice",
        "1 egg yolk",
        "1 tablespoon cold water"
    ],
    "nut": [
        "Calories > 350 kcal",
        "Carbs > 57.7 g",
        "Cholesterol > 56 mg",
        "Fat > 9.9 g",
        "Protein > 7.4 g",
        "Sodium > 233 mg"
    ],
    "n": "Hamantashen I",
    "a": "Jupiter2",
    "r": "0",
    "s": 15,
    "des": "\"A cookie traditionally made for the Jewish holiday Purim. They are often filled with a poppy seed or fruit filling.\"",
    "ins": "Soften yeast in 1/4 cup warm water.  Heat milk, sugar, butter or margarine and salt until the sugar dissolves; cool to lukewarm.  Stir in 2 eggs.  Stir in yeast mixture and 2 cups of the flour, beat well.  Stir in enough of the rest of the flour to make a moderately stiff dough.\nKnead on floured surface till smooth, and shape into a ball.  Place dough into a greased  bowl  and cover with a towel.  Let rise until doubled, then divide in half.\nTo make Filling:  Combine the poppy seeds with the lemon peel and lemon juice and mix well.  Set aside.\nRoll each half of the risen dough into a 17 x 12 inch rectangle.  Cut into 4 inch circles.  Put about 1/2 Tablespoon of the filling on each circle.  Moisten the edges, bring the sides together and pinch, forming a triangle.  Place on a greased cookie sheet and cover.  Let the dough rise again until doubled.\nBrush with egg yolk mixed with water, then bake at 350 degrees F (180 degrees C) for  15 to 20 minutes.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}