{
    "id": 10158,
    "old_rating": "4.66912",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter, softened",
        "3/4 cup white sugar",
        "3 eggs",
        "2 teaspoons almond extract",
        "3 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/2 cup chopped candied cherries",
        "1/2 cup mini semi-sweet chocolate chips",
        "1/2 cup chopped white chocolate"
    ],
    "nut": [
        "Calories > 114 kcal",
        "Carbs > 16.6 g",
        "Cholesterol > 23 mg",
        "Fat > 4.6 g",
        "Protein > 1.9 g",
        "Sodium > 55 mg"
    ],
    "n": "Chocolate Cherry Biscotti",
    "a": "Jennifer Wall",
    "r": "0",
    "s": 36,
    "des": "\"These are one of my favorites. I make them every holiday season. They are great for mailing and keep for weeks!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a large cookie sheet.\nIn a large bowl, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the almond extract. Combine the flour and baking powder; stir into the creamed mixture until just blended. Mix in candied cherries and mini chocolate chips.\nWith lightly floured hands, shape dough into two 10 inch long loaves. Place rolls 5 inches apart on the prepared cookie sheet; flatten each to 3 inch width.\nBake for 20 to 25 minutes, or until set and light golden brown. Cool 10 minutes. Using a serrated knife, cut loaves diagonally into 1/2 inch slices.  Arrange slices cut side down on ungreased cookie sheets.\nBake for 8 to 10 minutes, or until bottoms begin to brown. Turn, and bake an additional 5 minutes, or until browned and crisp. Cool completely. Melt white chocolate in the microwave, stirring every 20 to 30 seconds until smooth. Drizzle cookies with melted white chocolate. Store in tightly covered container.",
    "pt": "25 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "5400.jpg",
    "o": "2438157.jpg,1828422.jpg,589173.jpg,529635.jpg,459226.jpg",
    "st": "allrecipes"
}