{
    "id": 10185,
    "old_rating": "4.18182",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "1/2 cup molasses",
        "1/4 cup packed dark brown sugar",
        "2 tablespoons corn oil",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon baking soda",
        "2 cups all-purpose flour"
    ],
    "nut": [
        "Calories > 57 kcal",
        "Carbs > 10.3 g",
        "Cholesterol > 2 mg",
        "Fat > 1.5 g",
        "Protein > 0.7 g",
        "Sodium > 24 mg"
    ],
    "n": "Moravian Spice Cookies",
    "a": "Pam",
    "r": "0",
    "s": 36,
    "des": "\"Crisp, spicy wafer.\"",
    "ins": "Melt butter or margarine over low heat until the butter turns light brown.  Add molasses, brown sugar and oil, stirring to melt the sugar. Transfer to a mixing bowl and let cool for 5 minutes.\nAdd cinnamon, ginger, cloves, allspice and baking soda.  Mix well.  Add flour, 1/2 cup at a time, and beat until just blended.\nPut the dough onto a large sheet of plastic wrap; flatten it into a disk and wrap it up. Let dough rest at room temperature for 1 to 2 hours before rolling. NOTE:  Dough can be made up to three days in advance and stored in the refrigerator. Bring to room temperature before rolling.\nPreheat oven to 350 degrees F (180 degrees C).  Lightly grease cookie sheets.\nDivide dough in half and rewrap the unused portion.  Roll out the dough on a floured surface as thin as possible, less than 1/16 inch.  Cut out cookies with a small 2-inch cutter and place them about 1/4 inch apart on the prepared baking sheets.\nBake one sheet at a time for 8 to 10 minutes or until the cookies are crisp and just beginning to brown on the edges. Transfer to a wire rack to cool.  Repeat with remaining dough.  Store the cookies in an airtight container for up to 3 weeks.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "541356.jpg",
    "o": "",
    "st": "allrecipes"
}