{
    "id": 10238,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 ounce almond paste",
        "3 egg whites",
        "3/4 cup white sugar",
        "1/2 teaspoon almond extract",
        "1 pinch salt",
        "9 (1 ounce) squares semisweet chocolate",
        "1/2 cup unsalted butter",
        "3 egg yolks",
        "3 tablespoons rum",
        "6 (1 ounce) squares German sweet chocolate"
    ],
    "nut": [
        "Calories > 131 kcal",
        "Carbs > 13.7 g",
        "Cholesterol > 29 mg",
        "Fat > 8.4 g",
        "Protein > 1.6 g",
        "Sodium > 21 mg"
    ],
    "n": "Sarah Bernhardts",
    "a": "Marge",
    "r": "0",
    "s": 30,
    "des": "\"I have many recipes in my files. This one was given to me at a cookie exchange. It is quite long, but worth the effort.  If you'd rather, you can substitute rum extract for the rum.\"",
    "ins": "Preheat oven to 350 degrees F (180 degrees C).\nTo make Macaroons:   Line 2 baking sheets with ungreased foil. In large bowl combine almond paste, egg whites, sugar, almond extract and salt.  Beat with mixer at medium until well blended.\nSpoon into pastry bag with #8 star tip. Press batter into 1 1/4 inch rounds.  Bake 10-15 minutes, until pale golden.  Remove foil to wire racks to cool.  Carefully remove cookies and place on waxed paper lined pans.\nTo Make Filling:   While cookies are baking; melt 9 squares semisweet chocolate in double boiler. Remove from heat and beat in 1/2 cup butter.  Add egg yolks and rum until smooth.  Let stand until slightly thickened, (about 1/2 hour), stirring occasionally.  Spread 1 teaspoon filling on bottom of each macaroon.  Refrigerate filling side up on pan until firm, about 1 hour.\nTo Make Glaze:   Work with small quantities of chocolate at a time.  Melt sweet cooking chocolate in double boiler until smooth.  Remove from heat.  Test chocolate, it should feel lukewarm.  Dip cookies filling side down rotating to coat completely.  Place on waxed paper and refrigerate until set.  Store tightly covered in refrigerator.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}