{
    "id": 102585,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 tablespoons olive oil or butter",
        "1 small onion, cut into small dice",
        "2 ounces prosciutto or 4 ounces ham, cut into small dice ",
        "2 cups arborio rice",
        "1/2 cup dry white wine",
        "4 cups chicken broth",
        "2 cups water",
        "1 cup grated Parmesan cheese",
        "1 cup frozen regular (not petite) green peas",
        "2 tablespoons chopped fresh parsley",
        "1 pinch Salt and ground black pepper"
    ],
    "nut": [
        "Calories > 464 kcal",
        "Carbs > 66.5 g",
        "Cholesterol > 20 mg",
        "Fat > 13.7 g",
        "Protein > 13.5 g",
        "Sodium > 482 mg"
    ],
    "n": "Easy-Bake Risotto",
    "a": "USA WEEKEND columnist Pam Anderson",
    "r": "0",
    "s": 6,
    "des": "\"No more upper-body workout: You don't have to keep stirring this classic Italian rice dish.\"",
    "ins": "Adjust oven rack to middle position, and heat oven to 450 degrees.\nHeat oil or butter in a heavy-bottom Dutch oven or large ovenproof saucepan over medium-high heat. Add onion and prosciutto or ham; saute until tender, 4 to 5 minutes.\nStir in rice (can be removed from heat and covered for up to 2 hours in advance), then add wine, and simmer until the liquid has almost evaporated. Turn off heat. Add broth and water. Cover the pot with a sheet of heavy-duty foil, pressing the foil down so it's concave and rests on the broth. Place a lid over the pot to ensure an even tighter seal.\nSet pot in oven; cook for 25 minutes. Remove from oven. Use a potholder to remove lid and foil. Remembering that the handles are hot, set pot on low heat.\nStir mixture, adding water if necessary, until rice is cooked and a little chewy at the center, the liquid is creamy, and the flavors of the new ingredients have melded in, about 5 minutes. Stir in 1 cup of Parmesan cheese, peas and/or parsley. Adjust seasonings, including salt and pepper, to taste.\nSpoon into shallow soup plates, sprinkling each serving with shaved Parmesan.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "1927406.jpg",
    "o": "",
    "st": "allrecipes"
}