{
    "id": 102815,
    "old_rating": "4.07895",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon butter",
        "1 cup thinly sliced onion",
        "2 (10 ounce) packages chopped frozen spinach, thawed and squeezed dry",
        "1/4 teaspoon freshly grated nutmeg",
        "1/2 teaspoon salt",
        "1 1/2 pounds haddock fillets",
        "1 (14.5 ounce) can diced Italian plum tomatoes, juices reserved",
        "1/2 teaspoon dried thyme",
        "1/4 teaspoon dried tarragon",
        "1 tablespoon butter",
        "1 tablespoon minced onion",
        "1 teaspoon cornstarch"
    ],
    "nut": [
        "Calories > 183 kcal",
        "Carbs > 9.2 g",
        "Cholesterol > 76 mg",
        "Fat > 5.4 g",
        "Protein > 25.8 g",
        "Sodium > 466 mg"
    ],
    "n": "Baked Haddock with Spinach and Tomatoes",
    "a": "Mia",
    "r": "0",
    "s": 6,
    "des": "\"Delicious baked haddock with spinach, diced tomatoes, smothered in a rich, tangy tomato sauce.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Lightly butter a 2-quart casserole or baking dish large enough to hold haddock fillets in a single layer.\nMelt 1 tablespoon of the butter in a skillet over medium heat and cook the onion slices, stirring occasionally, until soft, about 5 minutes. Stir in spinach and nutmeg  and cook for about 3 minutes.\nArrange haddock fillets in baking dish. Spoon equal portions of the spinach mixture between the fillets. Spoon drained tomatoes around fillets and sprinkle with the thyme, tarragon and salt.\nBake, uncovered, for 20 to 25 minutes or until fish flakes easily with a fork.\nWhile fish is baking, make the sauce. If necessary add enough water to reserved tomato liquid to make 1 cup.  In the skillet, melt the remaining 1 tablespoon butter over medium heat. Stir in the minced onion and cook until soft, about 5 minutes. Add 3/4 cup of the tomato juice to the onions. Bring mixture to a boil. Whisk the cornstarch into the remaining 1/4 cup juice, then add to the skillet. Reduce heat and simmer, stirring, until sauce thickens slightly. Pour sauce over baked fillets and serve.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "1495467.jpg",
    "o": "",
    "st": "allrecipes"
}