{
    "id": 103054,
    "old_rating": "4.53409",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (4 pound) boneless pork shoulder roast, trimmed",
        "3 tablespoons chili powder",
        "1 cup chopped onions",
        "4 cups water",
        "2 (16 ounce) jars salsa",
        "2 (10 ounce) cans diced tomatoes with green chilies, undrained"
    ],
    "nut": [
        "Calories > 291 kcal",
        "Carbs > 13.4 g",
        "Cholesterol > 99 mg",
        "Fat > 13.9 g",
        "Protein > 29.2 g",
        "Sodium > 862 mg"
    ],
    "n": "Pork Chile Rojo (Pulled Pork with Red Chile Sauce)",
    "a": "Diyeana",
    "r": "0",
    "s": 8,
    "des": "\"My grandmother called this recipe 'Pork Chili Verde' when she originally told me about it. But...it's red, not green. I'm not sure if she saw a recipe that called for green salsa and she put in the red or if it was really called something else. Whatever the story, I've made it a couple of times now and absolutely love it. It gets better every time! Slow cooking the roast in an oven roasting bag makes the meat so tender!  Serve the pork with tortillas or hard taco shells.\"",
    "ins": "Place the pork roast into an oven roasting bag set inside a slow cooker. Sprinkle the chili powder over the roast and arrange onions on top of the roast. Loosely close the top of the bag with a nylon tie. Use scissors to cut 3 vents, 1-inch long in the top of the bag. Pour the water into the bottom of the slow cooker, around the bag, so that it is at least 1 inch deep.\nCover and cook the pork on Low for 6 to 8 hours.\nRemove the pork and onions from the bag and place in a large Dutch oven; reserve 3/4 cup of liquid from the bag. Shred the pork by pulling it apart using two forks. Stir the salsa, tomatoes, and cooking liquid in with the shredded pork.\nBring to a boil over high heat, then reduce the heat to low. Cover and simmer for 1 hour, stirring occasionally.",
    "pt": "15 m",
    "ct": "9 h",
    "tt": "9 h ",
    "i": "286757.jpg",
    "o": "",
    "st": "allrecipes"
}