{
    "id": 103140,
    "old_rating": "4.55",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds firm white fish, such as monkfish, cut into 2-inch pieces",
        "1/2 pound medium shrimp, peeled and deveined",
        "salt and pepper to taste",
        "3 tablespoons dende oil (red palm oil), or canola",
        "1 onion, cut into 1/2-inch pieces",
        "1 tablespoon minced garlic",
        "2 tomatoes, seeded and diced",
        "1 red bell pepper, chopped",
        "2 long, hot peppers, seeded and chopped",
        "1/2 cup fish stock",
        "1/4 cup chopped fresh cilantro",
        "1 bunch green onions, diced",
        "2 bay leaves",
        "1 1/2 teaspoons hot pepper sauce (e.g. Tabascoâ„¢), or to taste",
        "1/2 cup coconut milk"
    ],
    "nut": [
        "Calories > 442 kcal",
        "Carbs > 17.6 g",
        "Cholesterol > 143 mg",
        "Fat > 21 g",
        "Protein > 46.5 g",
        "Sodium > 268 mg"
    ],
    "n": "Seafood Mocequa",
    "a": "BRENTBUNTIN",
    "r": "0",
    "s": 4,
    "des": "\"Traditional Brazilian seafood dish based on coconut milk and fish broth, served over rice or with farofa (cooked manioc meal).  You may use a variety of white fish as long as they are firm.  There is an oil called dende that is used in Brazil, but hard to find outside the country. Try looking in a Brazilian or Latino store.\"",
    "ins": "Toss fish and shrimp together with salt and pepper to taste; set aside. Heat dende oil in a large skillet over medium heat. Stir in onions and cook until softened and translucent. Add the garlic, and continue cooking until the onions turn golden brown.\nStir in tomato and cook for 5 minutes, then stir in the red and hot peppers; continue cooking until softened. Pour in fish stock, cilantro, green onions, bay leaves, and hot sauce. Bring to a simmer over medium-high heat, then reduce heat to medium, and simmer until reduced by 1/4.\nPour in the coconut milk, then stir in fish. Simmer until the fish is firm and opaque. Serve immediately",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "3400075.jpg",
    "o": "",
    "st": "allrecipes"
}