{
    "id": 10343,
    "old_rating": "4.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups honey",
        "2 1/4 cups packed brown sugar",
        "3 eggs",
        "1 tablespoon lemon zest",
        "3 tablespoons lemon juice",
        "8 1/4 cups all-purpose flour",
        "1 1/2 teaspoons baking soda",
        "1 tablespoon ground cinnamon",
        "1 1/2 teaspoons ground allspice",
        "1 1/2 teaspoons ground nutmeg",
        "1 teaspoon ground cloves",
        "1 cup chopped candied citron",
        "1 cup chopped pecans",
        "2 cups sliced almonds",
        "1 1/2 cups white sugar",
        "3/4 cup water",
        "1/3 cup sifted confectioners' sugar"
    ],
    "nut": [
        "Calories > 154 kcal",
        "Carbs > 32.3 g",
        "Cholesterol > 7 mg",
        "Fat > 2.4 g",
        "Protein > 2.1 g",
        "Sodium > 36 mg"
    ],
    "n": "Lebkuchen II",
    "a": "Robin J.",
    "r": "0",
    "s": 84,
    "des": "\"A traditional German Christmas cookie.\"",
    "ins": "Bring honey to a boil in a large Dutch oven; remove from heat, and cool slightly.  Stir in brown sugar, beaten eggs, lemon rind, and juice.\nCombine flour, baking soda, and spices in a large mixing bowl; gradually add to honey mixture, stirring well.  Stir in citron and chopped pecans, blending well.  Cover and chill overnight.\nPreheat oven to 400 degrees F (200 degrees C).\nShape dough into 1-inch balls; place 2 inches apart on greased cookie sheets.  Gently press ball to 1/4-inch thickness with bottom of a glass dipped in cool water.  Gently press an almond slice in the center of each cookie.  Bake for about 10 minutes.  Remove cookie sheets from oven.  Brush glaze over cookies and remove to wire racks to cool.\nTo Make Glaze:  Combine 1 1/2 cups sugar and water in a small heavy saucepan; cook over low heat, stirring until sugar dissolves.  Cook over high heat, without stirring, until mixture reaches thread stage (230 degrees F ).  Remove from heat; stir in confectioners'  sugar, mixing well.  Place over low heat, if necessary, to maintain basting consistency.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}