{
    "id": 103535,
    "old_rating": "4.82246",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "2 tablespoons lime juice",
        "2 cloves garlic, minced",
        "4 tuna steaks",
        "1 fresh mango - peeled, pitted, and chopped",
        "1/4 cup finely chopped red bell pepper",
        "1/2 Spanish onion, finely chopped",
        "1 green onion, chopped",
        "2 tablespoons chopped fresh cilantro",
        "1 jalapeno pepper, seeded and minced",
        "2 tablespoons lime juice",
        "1 1/2 teaspoons olive oil",
        "2 tablespoons paprika",
        "1 tablespoon cayenne pepper",
        "1 tablespoon onion powder",
        "2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "1 teaspoon dried thyme",
        "1 teaspoon dried basil",
        "1 teaspoon dried oregano",
        "1 tablespoon garlic powder",
        "4 tablespoons olive oil"
    ],
    "nut": [
        "Calories > 458 kcal",
        "Carbs > 18.3 g",
        "Cholesterol > 77 mg",
        "Fat > 24.7 g",
        "Protein > 42.1 g",
        "Sodium > 1233 mg"
    ],
    "n": "Blackened Tuna Steaks with Mango Salsa",
    "a": "AcadiaBoi",
    "r": "0",
    "s": 4,
    "des": "\"This delicious and simple dish will make your dinner guests think you're a true gourmet chef! It works great with fresh or frozen fish.\"",
    "ins": "Whisk together the olive oil, lime juice, and garlic in a bowl. Rub the tuna steaks with the mixture. Place the steaks in a sealable container and chill in refrigerator 3 hours.\nCombine the mango, bell pepper, Spanish onion, green onion, cilantro, and jalapeno pepper in a bowl; stir. Add the lime juice and 1 1/2 teaspoons olive oil and toss to combine. Chill in refrigerator 1 hour.\nStir together the paprika, cayenne pepper, onion powder, salt, pepper, thyme, basil, oregano, and garlic powder in a bowl. Remove the tuna steaks from the refrigerator and gently rinse with water and then dip each side of each steak in the spice mixture to coat.\nHeat 2 tablespoons olive oil in a large skillet over medium heat. Gently lay the tuna steaks into the hot oil. Cook the tuna on one side for 3 minutes; remove to a plate. Pour the remaining 2 tablespoons olive oil into the skillet and let it get hot. Lay the tuna with the uncooked side down into the skillet and cook another 3 minutes; remove from heat immediately.\nSpoon about 1/2 cup of the mango salsa onto each of 4 plates. Lay the tuna steaks atop the salsa and serve immediately.",
    "pt": "45 m",
    "ct": "10 m",
    "tt": "3 h ",
    "i": "4482089.jpg",
    "o": "4482089.jpg,4451581.jpg,4025669.jpg,3702317.jpg,3400056.jpg,3229079.jpg",
    "st": "allrecipes"
}