{
    "id": 103802,
    "old_rating": "4.5098",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 (4 ounce) wild salmon fillets",
        "3 teaspoons olive oil",
        "4 (12 inch) squares of parchment paper",
        "1 blood orange, sliced into rounds",
        "1 lemon, sliced into rounds",
        "1 lime, sliced into rounds",
        "1 bunch fresh dill weed",
        "1/2 teaspoon lemon pepper"
    ],
    "nut": [
        "Calories > 273 kcal",
        "Carbs > 10.2 g",
        "Cholesterol > 67 mg",
        "Fat > 16.1 g",
        "Protein > 23.7 g",
        "Sodium > 131 mg"
    ],
    "n": "Citrus Salmon in Parchment",
    "a": "BenevolentEmpress",
    "r": "0",
    "s": 4,
    "des": "\"My mom taught me this trick for baking fish while keeping the moisture and flavors in. It is nearly foolproof and adapts easily; substitute regular oranges or other citrus, herbs and oils to your taste. Parchment paper is available in most grocery stores.\"",
    "ins": "Preheat the oven to 450 degrees F (220 degrees C).\nBrush each piece of salmon on both sides with a light coating of olive oil. Fold each sheet of parchment in half and use scissors to round out the corners so that it is almost a circle. Open the sheets back up.\nPlace the salmon fillets skin side down onto the center of each piece of parchment. Sprinkle with lemon pepper, then place a sprig of dill onto each fillet. Cover with one slice of orange, one slice of lemon and one slice of lime per serving. You may add more to taste. Lay another sprig or two of dill over the citrus slices.\nFold each piece of parchment up and over the fillets. Holding both edges of the parchment together, roll the edge down making several folds as you go until the fish fillets are tightly sealed in their packets. Place packets on a baking sheet.\nBake for 12 to 15 minutes in the preheated oven, or until fish is able to be flaked with a fork. You may need to open one of the packets to check. To serve, place packets onto serving plates and use scissors to cut an X in the center, being careful not to cut the food.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "25 m",
    "i": "1133069.jpg",
    "o": "3420388.jpg,1133064.jpg,737228.jpg,708569.jpg,618783.jpg,179848.jpg",
    "st": "allrecipes"
}