{
    "id": 103884,
    "old_rating": "4.27273",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup unsalted macadamia nut pieces",
        "1 cup packed fresh cilantro leaves",
        "1/2 cup chopped green onions",
        "3 tablespoons minced fresh ginger",
        "1 tablespoon minced garlic",
        "1 lemon, zested and juiced",
        "3/4 cup macadamia nut oil, or more as needed",
        "Kosher salt to taste",
        "4 tablespoons olive oil",
        "8 (6 ounce) salmon fillets, with skin",
        "16 large (U-10) scallops, tendon removed",
        "kosher salt to taste"
    ],
    "nut": [
        "Calories > 530 kcal",
        "Carbs > 5.4 g",
        "Cholesterol > 90 mg",
        "Fat > 39.4 g",
        "Protein > 39.4 g",
        "Sodium > 267 mg"
    ],
    "n": "Pan Seared Salmon and Scallops with Macadamia-Cilantro Pesto",
    "a": "Ryan Nomura",
    "r": "0",
    "s": 8,
    "des": "\"Try to get wild Alaskan king salmon if it's in season. But any salmon will do, just make sure it's fresh. However, if there are no good quality scallops available, just omit them.\"",
    "ins": "Prepare macadamia-cilantro pesto by placing macadamia nuts, cilantro, green onion, ginger, garlic, lemon juice, lemon zest, and macadamia nut oil into the bowl of a blender. Puree until smooth, adding more oil if needed; season to taste with kosher salt.\nHeat two very large skillets over medium-high heat with two tablespoons of oil each until smoking. Season the salmon and scallops to taste with kosher salt. Sear salmon fillets, meat-side down, until golden and crispy, about 5 minutes. Flip over, and cook on the skin-side 5 minutes to desired doneness. Place seared salmon onto serving plates, then sear the scallops until golden brown, 2 to 3 minutes per side.\nTo serve, spoon some of the macadamia-cilantro pesto over the salmon, and garnish with two seared scallop pieces.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "40 m",
    "i": "3573836.jpg",
    "o": "",
    "st": "allrecipes"
}