{
    "id": 103915,
    "old_rating": "4.27907",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 tablespoons vegetable oil, divided",
        "1/2 teaspoon cumin seed",
        "1 small onion, quartered then sliced",
        "2 serrano chile peppers, minced",
        "1 teaspoon ginger paste",
        "2 teaspoons ground coriander",
        "1/4 teaspoon paprika",
        "1/2 teaspoon turmeric powder",
        "1/2 teaspoon cayenne pepper",
        "1/2 teaspoon garam masala",
        "2 medium baking potatoes, peeled and cut into 1 inch pieces",
        "1 teaspoon salt",
        "1/2 head cauliflower, cut into florets",
        "2 teaspoons lemon juice"
    ],
    "nut": [
        "Calories > 141 kcal",
        "Carbs > 17.8 g",
        "Cholesterol > 0 mg",
        "Fat > 7.3 g",
        "Protein > 2.8 g",
        "Sodium > 408 mg"
    ],
    "n": "Aloo Gobi",
    "a": "LUNACITY",
    "r": "0",
    "s": 6,
    "des": "\"Traditional Indian dish made of spiced cauliflower and potatoes. This dish is steamed and then fried in oil making it intentionally dry and somewhat crispy. WARNING: This dish is extremely spicy, which is the way I like it. However, if you don't like your food that spicy, feel free to cut down on the serrano pepper and/or cayenne pepper. Also, I would recommend serving this with a side of raita or plain yogurt to cool the mouth down after eating.\"",
    "ins": "Heat 2 tablespoons of oil over medium-high heat in a large pot.  Fry the cumin seeds for a few seconds until they turn golden brown and begin to pop.  Reduce heat to medium, stir in the onion, and cook until lightly browned.  Stir in serrano pepper and ginger, fry for 1 minute.  Season with coriander, paprika, turmeric, cayenne, and garam masala; cook for 30 seconds until fragrant.\nStir in potatoes and salt, cover and cook for 5 to 7 minutes.  Add the cauliflower, cover, and cook until the cauliflower steams in it's own juices until it's tender, about 20 minutes.  Stir in lemon juice, then pour the remaining 1 tablespoon of oil around the edges of the pot.  Increase heat to medium-high and fry for 3 to 5 minutes to brown, stirring gently to avoid mashing the cauliflower.",
    "pt": "30 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "404067.jpg",
    "o": "1454362.jpg,1128545.jpg,723551.jpg,723546.jpg,272489.jpg,172516.jpg",
    "st": "allrecipes"
}