{
    "id": 104452,
    "old_rating": "4.27273",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons brown sugar",
        "1/2 cup water",
        "10 bananas, peeled and sliced lengthwise",
        "2 cups whole wheat flour",
        "2 cups toasted wheat germ",
        "3 cups rolled oats",
        "1 cup packed brown sugar",
        "1 cup light margarine",
        "1 tablespoon cinnamon"
    ],
    "nut": [
        "Calories > 451 kcal",
        "Carbs > 82.5 g",
        "Cholesterol > 0 mg",
        "Fat > 11.2 g",
        "Protein > 11.1 g",
        "Sodium > 126 mg"
    ],
    "n": "Brazilian Whole Banana Pie",
    "a": "Cacau",
    "r": "0",
    "s": 12,
    "des": "\"This whole banana pie is a hit in Brazil, mainly in the city of Rio de Janeiro. Almost all the ingredients are natural, except for the margarine. It is also made with whole grains, which contribute for a good health. It supplies a lot of energy and the bananas give an extra dose of potassium. That is why this pie is consumed by athletes and people who practice sports in general. Besides, it is simply delicious!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nSprinkle 3 tablespoons of brown sugar over the bottom of a small saucepan or skillet. Cook over medium heat until melted. Stir in water until sugar is completely dissolved. Heat to between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface. Pour the syrup into a round baking dish or deep dish pie plate and spread to coat the bottom.\nMake a layer of bananas on top of the melted sugar. In a medium bowl, stir together the whole wheat flour, wheat germ, oats and 1 cup of brown sugar. Mix in the margarine using your hands, pinching it into small pieces to make a crumbly dough. Sprinkle half of this over the bananas in the dish and pat down. Top with the remaining bananas and sprinkle with about half of the cinnamon. Spread the rest of the dough over the bananas and pat the pie smooth. Sprinkle remaining cinnamon over the top.\nBake for 45 minutes in the preheated oven, until the pie topping is toasted and a toothpick inserted into the center comes out clean.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "16376.jpg",
    "o": "",
    "st": "allrecipes"
}