{
    "id": 104414,
    "old_rating": "4.51429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "20 pounds frozen cleaned chitterlings, thawed",
        "1 large baking potato",
        "2 large onions, peeled and halved",
        "1 green bell pepper, chopped",
        "3 cloves garlic",
        "3 stalks celery, with leaves",
        "1 cup apple cider vinegar",
        "2 tablespoons salt",
        "1 bay leaf",
        "1 teaspoon Creole seasoning to taste",
        "1 teaspoon red pepper flakes, or to taste"
    ],
    "nut": [
        "Calories > 494 kcal",
        "Carbs > 6.9 g",
        "Cholesterol > 548 mg",
        "Fat > 40.3 g",
        "Protein > 25.6 g",
        "Sodium > 947 mg"
    ],
    "n": "Creole Chitterlings (Chitlins)",
    "a": "NYGHTSONG",
    "r": "0",
    "s": 16,
    "des": "\"There are some recipes that are called Southern however, the Creole and Cajun culture in itself cooks different than the rest of the south. I believe this simple recipe does the heritage justice.\"",
    "ins": "Clean the chitterlings by removing all the specks and fat with specks on them. Rinse in several changes of salted water. Place them in a large pot and fill with enough water to cover. Bring to a boil, drain, rinse and fill with enough water to cover again.\nReturn to the heat and add the potato, onions, green pepper, garlic, celery and vinegar. Season with salt, bay leaf, Creole seasoning and red pepper flakes. Cover and simmer over medium heat for 3 to 4 hours. Chitterlings should appear clear to white in color.\nCut the chitterlings into 1 inch pieces and return to the pot. Pour out most of the cooking liquid. Discard the potato, onions, celery and bay leaf. Heat the chitterlings through and serve with your favorite side dishes. Store the leftovers in the refrigerator. Like so many other great soul food dishes, chitlins taste even better after the flavor has soaked in for a few hours.",
    "pt": "20 m",
    "ct": "6 h",
    "tt": "6 h ",
    "i": "895964.jpg",
    "o": "",
    "st": "allrecipes"
}