{
    "id": 10531,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/3 cup sour cream",
        "1 egg yolk, beaten",
        "1 teaspoon vanilla extract",
        "1 1/2 cups all-purpose flour",
        "1/4 cup white sugar",
        "3/4 cup butter",
        "1 tablespoon butter",
        "2 apple - peeled, cored, and chopped",
        "1/4 cup raisins",
        "1 tablespoon brown sugar",
        "1 teaspoon apple pie spice"
    ],
    "nut": [
        "Calories > 114 kcal",
        "Carbs > 11.6 g",
        "Cholesterol > 26 mg",
        "Fat > 7.2 g",
        "Protein > 1.2 g",
        "Sodium > 47 mg"
    ],
    "n": "Apple Half Moons",
    "a": "Rosina",
    "r": "0",
    "s": 24,
    "des": "\"Short Cut - try using chunky applesauce in place of apples. Or go wild with fruit preserves!\"",
    "ins": "Stir together to blend, sour cream, egg yolk and vanilla extract. In a large bowl stir together flour and sugar. Cut in 3/4 cup butter or margarine until like coarse crumbs. Mix in sour cream mixture until well blended.\nDivide dough in half and chill until easy to handle (3 hours or so).\nTo Make Filling:  In small saucepan, melt the 1 tablespoon margarine. Add apples, raisins, brown sugar and spice and cook, stirring occasionally, until apples are fork tender. Remove excess liquid and cool.\nRoll each piece of dough to about 1/8 inch thickness and cut with 2-1/2 inch round cookie cutter. Place rounds 1/2 inch apart on ungreased cookie sheet.  Place (skimpy) teaspoon of filling on each round and fold in half. Seal edges with fork.\nBake at 350 degrees F (175 degrees C) for 10-12 minutes or until light brown. Remove and cool.  Drizzle with lemon sugar icing made with 1/2 cup powdered sugar, 1 teaspoon lemon juice (fresh), 1 tablespoon water.  Mix until of drizzling consistency. If too thick, add a little more water, if too thin, a little more confectioners' sugar.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "675322.jpg",
    "o": "",
    "st": "allrecipes"
}