{
    "id": 105409,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup uncooked short-grain white rice",
        "1 tablespoon vegetable oil",
        "6 cups water",
        "1 cube pork bouillon cube",
        "2 cups char siu (Chinese roast pork), diced",
        "6 green onions, chopped",
        "2 cups water",
        "2 preserved duck eggs (century eggs), peeled and diced"
    ],
    "nut": [
        "Calories > 174 kcal",
        "Carbs > 15.8 g",
        "Cholesterol > 92 mg",
        "Fat > 5 g",
        "Protein > 15.6 g",
        "Sodium > 220 mg"
    ],
    "n": "Pork and Century Egg Rice Congee",
    "a": "Lea Eats",
    "r": "0",
    "s": 8,
    "des": "\"This traditional Chinese breakfast rice porridge is filling, cheap, warming, and oh so good.  I like my rice well broken down and therefore use a short-grain rice and a longer cooking time. I hope you enjoy! Serve hot in small bowls, garnished with a drop of oyster sauce, chopped scallion greens, and small slices of yau ja gwai (fried chinese bread stick, or chinese crullers).\"",
    "ins": "Rinse the rice in several changes of cold water. Drain completely in a mesh strainer and place into a large pot. Stir the vegetable oil into the rice and set aside for 10 minutes.\nStir 6 cups of water, the bouillon cube, char siu, and green onion into the rice. Bring to a boil over high heat; reduce heat to medium-low, cover, and simmer 1 1/2 hours. Stir frequently as the rice cooks to help break the rice grains apart and keep it from burning on the bottom.\nStir in the remaining 2 cups of water and the century egg. Continue cooking another 1 1/2 hours, stirring frequently until the congee reaches your desired consistency. The congee is ready when the individual grains of rice are no longer discernable and have thickened the soup.",
    "pt": "20 m",
    "ct": "3 h",
    "tt": "3 h ",
    "i": "788113.jpg",
    "o": "",
    "st": "allrecipes"
}