{
    "id": 10545,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package cream cheese, softened",
        "1/2 cup butter, softened",
        "2 cups all-purpose flour",
        "1 cup white sugar",
        "1/3 cup milk",
        "1/2 pound ground walnuts",
        "1/3 cup confectioners' sugar for decoration"
    ],
    "nut": [
        "Calories > 83 kcal",
        "Carbs > 7.9 g",
        "Cholesterol > 8 mg",
        "Fat > 5.4 g",
        "Protein > 1.3 g",
        "Sodium > 23 mg"
    ],
    "n": "Aunt Mamie's",
    "a": "Rosina",
    "r": "0",
    "s": 60,
    "des": "\"A cookie that is rolled around a nut filling and cut AFTER baking.\"",
    "ins": "Beat together cream cheese and margarine until well blended.  Add flour, mixing well. Shape into a ball, cover and chill for 2 hours.\nIn saucepan over medium heat, cook sugar and milk, stirring occasionally until milk boils and sugar is dissolved.  Add the ground nuts.  Remove from heat and let cool until mixture is of spreading consistency.\nRoll out chilled dough on lightly floured surface to a rectangle about 18 X 12 inches.  Cut in half lengthwise.  Spread each piece with milk/nut filling and roll up like a jelly-roll, starting from the long side.\nCut each roll in half. Place seam side down on ungreased cookie sheets (two on a baking sheet).  Leaving roll's shape intact, cut into slices 1/2 inch thick almost to the bottom of the roll.\nBake at 350 degrees F (175 degrees C) for 15 to 20 minutes or till done. Remove from sheet and sprinkle with confectioners' sugar. Cool on racks. Cut cookies all the way through. Refrigerate or freeze. Re-sprinkle with confectioners' sugar before serving.\nVariations:   A) In place of milk/sugar/nut filling, spread with ground filberts and red raspberry preserves.  B)  Before rolling, sprinkle chopped chocolate chips over milk/sugar/nuts filling.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "3201414.jpg",
    "o": "",
    "st": "allrecipes"
}