{
    "id": 10593,
    "old_rating": "4.55224",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 1/4 cups all-purpose flour",
        "2 1/2 teaspoons baking powder",
        "1/2 cup butter, softened",
        "1 cup white sugar",
        "3 eggs",
        "2 teaspoons lemon zest",
        "1 teaspoon almond extract",
        "1/2 cup toasted almonds, finely chopped",
        "1 egg white"
    ],
    "nut": [
        "Calories > 104 kcal",
        "Carbs > 14.7 g",
        "Cholesterol > 22 mg",
        "Fat > 4.1 g",
        "Protein > 2.2 g",
        "Sodium > 60 mg"
    ],
    "n": "D'Amaretti Biscotti",
    "a": "Rosina",
    "r": "0",
    "s": 36,
    "des": "\"Toasted almond and lemon zest biscotti for any occasion. Try these variations: Use 1/2 teaspoon of either vanilla or anise extract instead of the almond extract; substitute chopped filberts for almonds; toss in half a cup of mini semi-sweet chocolate chips.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease baking sheet.\nCombine flour and baking powder; set aside.  In a large bowl, cream together  butter and sugar until light and fluffy. Beat in the eggs one at a time, then stir in the lemon zest and almond extract. Stir in the flour mixture until smooth, then stir in the chopped almonds.\nDivide dough in two. Shape each portion into a loaf about 12 inches long and 2 inches wide.  Place loaves onto the cookie sheet about 4 inches apart, and flatten slightly. Beat egg white until foamy, and brush over tops of loaves.\nBake 20 to 25 minutes, or until light brown. Cool on baking sheet for about an hour.\nPreheat oven to 325 degrees F (165 degrees C). Cut baked loaves diagonally into 1/2 inch thick slices. Lay slices cut side down on the baking sheet.\nBake 10 minutes, or until crisp. Cool on wire rack. Make several days before serving. Store in a paper bag to soften slightly. For longer storage place in a sealed container.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "2 h",
    "i": "3649.jpg",
    "o": "",
    "st": "allrecipes"
}