{
    "id": 106030,
    "old_rating": "4.67802",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cloves garlic, minced",
        "1 teaspoon kosher salt",
        "1 pound ground lamb",
        "3 tablespoons grated onion",
        "3 tablespoons chopped fresh parsley",
        "1 tablespoon ground coriander",
        "1 teaspoon ground cumin",
        "1/2 tablespoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon cayenne pepper",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon ground black pepper",
        "28 bamboo skewers, soaked in water for 30 minutes"
    ],
    "nut": [
        "Calories > 35 kcal",
        "Carbs > 0.6 g",
        "Cholesterol > 11 mg",
        "Fat > 2.3 g",
        "Protein > 2.9 g",
        "Sodium > 78 mg"
    ],
    "n": "Kofta Kebabs",
    "a": "SRKELZ",
    "r": "0",
    "s": 28,
    "des": "\"These kebabs have 6 different kinds of spices; the first time I smelled them I knew immediately that I had to find the recipe.  The most affordable way to purchase the spices is in bulk at either a health food store or an Asian or Middle-Eastern market.  They are very good! Serve with yogurt, flat bread, lettuce, tomato and cucumber.\"",
    "ins": "Mash the garlic into a paste with the salt using a mortar and pestle or the flat side of a chef's knife on your cutting board. Mix the garlic into the lamb along with the onion, parsley, coriander, cumin, cinnamon, allspice, cayenne pepper, ginger, and pepper in a mixing bowl until well blended. Form the mixture into 28 balls. Form each ball around the tip of a skewer, flattening into a 2 inch oval; repeat with the remaining skewers. Place the kebabs onto a baking sheet, cover, and refrigerate at least 30 minutes, or up to 12 hours.\nPreheat an outdoor grill for medium heat, and lightly oil grate.\nCook the skewers on the preheated grill, turning occasionally, until the lamb has cooked to your desired degree of doneness, about 6 minutes for medium.",
    "pt": "45 m",
    "ct": "5 m",
    "tt": "1 h ",
    "i": "4507744.jpg",
    "o": "4507744.jpg,4485523.jpg,4307170.jpg,4056324.jpg,3931355.jpg,3775452.jpg",
    "st": "allrecipes"
}