{
    "id": 106232,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "4 (8 ounce) beef tenderloin filets",
        "Kosher salt and freshly ground black pepper, to taste",
        "3 tablespoons unsalted butter",
        "2 tablespoons minced fresh ginger",
        "1 tablespoon minced fresh garlic",
        "1/2 cup thinly sliced fresh shiitake mushrooms",
        "3 tablespoons sake",
        "2 tablespoons mirin (sweetened rice wine)",
        "1 tablespoon finely chopped garlic chives",
        "3/4 cup unsalted butter"
    ],
    "nut": [
        "Calories > 872 kcal",
        "Carbs > 5.2 g",
        "Cholesterol > 229 mg",
        "Fat > 76.9 g",
        "Protein > 34.7 g",
        "Sodium > 189 mg"
    ],
    "n": "Pan Roasted Beef Tenderloin with Ginger-Shiitake Brown Butter",
    "a": "Ryan Nomura",
    "r": "0",
    "s": 4,
    "des": "\"Complex Asian flavors pair well with tender filet mignon.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nHeat olive oil in a large ovenproof skillet over high heat until lightly smoking. Season filets to taste with salt and pepper. Sear until golden brown on both sides, about 3 minutes per side. Transfer to oven, and cook to desired doneness, about 12 minutes for medium-rare. When done, allow steaks to rest out of the pan for 5 minutes.\nMeanwhile, melt 3 tablespoons butter in a saucepan over medium-high heat. Stir in ginger and garlic, and cook until translucent and aromatic, but not browned, about 1 1/2 minutes. Add shiitake mushrooms and cook 3 to 4 minutes, until softened. Pour in the sake and mirin and simmer until reduced by half. Melt the remaining 3/4 cup butter, then reduce heat to medium-low, and cook until the butter browns, 6 to 8 minutes. Once browned, season to taste with salt and pepper, and stir in the chives. Spoon sauce over steaks to serve.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "1083084.jpg",
    "o": "",
    "st": "allrecipes"
}