{
    "id": 106852,
    "old_rating": "4.73913",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 eggplants, cut into 1/2-inch slices",
        "1 tablespoon salt",
        "2 (6 ounce) skinless, boneless chicken breast halves",
        "all-purpose flour for dusting",
        "2 eggs, beaten",
        "1 cup seasoned bread crumbs",
        "4 tablespoons olive oil",
        "3 cloves garlic, peeled, or more to taste",
        "2 tablespoons red wine vinegar",
        "2 tablespoons extra-virgin olive oil",
        "1 (12 ounce) jar roasted red peppers, sliced",
        "salt and pepper to taste",
        "6 (6-inch) pita breads"
    ],
    "nut": [
        "Calories > 492 kcal",
        "Carbs > 60.2 g",
        "Cholesterol > 94 mg",
        "Fat > 18.4 g",
        "Protein > 23 g",
        "Sodium > 1754 mg"
    ],
    "n": "Eggplant, Roasted Pepper and Chicken Pitas",
    "a": "~marie~",
    "r": "0",
    "s": 6,
    "des": "\"Mmmmm!! My mouth waters just thinking of this! An Israeli Jewish lady taught this to my grandmother several years ago, and our entire family fell in love with it. It was so good, we served it for a small catered event,  and it was a hit. This is for you if you enjoy Middle Eastern cuisine.\"",
    "ins": "Sprinkle sliced eggplant with salt and allow to drain in a colander for 20 minutes. Meanwhile, preheat a grill for medium-high heat (see Cook's Note).\nPound chicken breasts between two sheets of plastic wrap to a thickness of 1/4-inch. Dredge with flour, shake off excess, dip into beaten egg, then press into seasoned bread crumbs to coat.\nHeat 2 tablespoons of olive oil in a skillet over medium-high heat. Add chicken breasts and cook until golden brown. Set aside.\nWipe eggplant dry with a paper towel. If grilling, brush slices with remaining 2 tablespoons olive oil. Grill until tender and well marked.\nCrush garlic with a mortar and pestle with a pinch of salt. Whisk together garlic, red wine vinegar, and extra-virgin olive oil. Slice grilled eggplant into strips and toss with roasted peppers and balsamic dressing; season to taste with salt and pepper.\nTo assemble, heat pita breads on the grill until hot and marked. Slice chicken into strips and place into warm pitas along with marinated eggplant and red peppers.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "448225.jpg",
    "o": "",
    "st": "allrecipes"
}