{
    "id": 106940,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cedar plank",
        "6 (5 ounce) mahi mahi fillets",
        "1 cup bottled teriyaki sauce",
        "2 mangos - peeled, seeded and diced",
        "1/2 red bell pepper, seeded and chopped",
        "4 green onions, chopped",
        "1 tablespoon chopped fresh cilantro",
        "1 jalapeno pepper, seeded and chopped",
        "salt and pepper to taste",
        "1/2 teaspoon garlic powder",
        "1 teaspoon fresh lime juice",
        "1 teaspoon lemon juice",
        "2 teaspoons olive oil",
        "1 teaspoon chipotle seasoning",
        "1 teaspoon red pepper flakes",
        "1 teaspoon hot-pepper sauce"
    ],
    "nut": [
        "Calories > 232 kcal",
        "Carbs > 21.3 g",
        "Cholesterol > 104 mg",
        "Fat > 2.9 g",
        "Protein > 29.9 g",
        "Sodium > 2007 mg"
    ],
    "n": "Fish on a Plank",
    "a": "Kathleen White",
    "r": "0",
    "s": 6,
    "des": "\"The delicate flavors of the fish are richly enhanced by the sweet tang of the wood planks. The mango salsa gives it a spicy flair. Just about any fish will work--I have used tilapia and it turns out well. This is great served with rice pilaf.\"",
    "ins": "In a medium bowl, combine the mangos, bell pepper, green onion, cilantro and jalapeno pepper. Season with salt, pepper, garlic powder and lime juice. Stir together then cover and refrigerate until serving to blend the flavors.\nSoak the plank in water for at least 2 hours, longer if possible.  Place the mahi mahi fillets in a shallow dish and coat with teriyaki sauce. Cover, and marinate for at least 1 hour.\nPrepare a grill for indirect heat. If using charcoal, arrange and light coals under one half of the grill. Sprinkle lemon juice over the fish fillets and season with chipotle seasoning, red pepper flakes and hot pepper sauce. Place the fillets on the plank.\nPlace the plank on the grill over direct heat. Cover and cook for 10 minutes. Move the plank with the fish over to indirect heat (the cooler part of the grill), cover and cook for 10 more minutes or until fish can be flaked with a fork. Top fillets with mango salsa and serve hot.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "1015568.jpg",
    "o": "4482777.jpg,2276454.jpg,2181992.jpg,639626.jpg,361967.jpg,39906.jpg",
    "st": "allrecipes"
}