{
    "id": 108257,
    "old_rating": "4.41463",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 duck breast halves",
        "1 pinch salt",
        "1 pinch cayenne pepper",
        "1 pinch ground black pepper",
        "1/2 cup chicken stock",
        "2 tablespoons honey",
        "2 tablespoons soy sauce",
        "2 tablespoons rice wine",
        "1 tablespoon grated fresh ginger",
        "1 tablespoon tomato sauce",
        "1 pinch chili powder",
        "1 teaspoon lime juice"
    ],
    "nut": [
        "Calories > 159 kcal",
        "Carbs > 21.3 g",
        "Cholesterol > 38 mg",
        "Fat > 3.4 g",
        "Protein > 8.4 g",
        "Sodium > 1144 mg"
    ],
    "n": "Duck with Honey, Soy, and Ginger",
    "a": "Ollie Martin",
    "r": "0",
    "s": 2,
    "des": "\"These duck breasts are the nicest I've ever cooked. You'll find yourself putting your knife and fork down between mouthfuls. And it's also very quick and extremely easy to make. I enjoy serving these duck breasts with roasted seasonal vegetables.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nUse a sharp knife to score across the duck breasts 4 times through the skin and fat but just barely to the meat. Rub the skin with salt, cayenne, and black pepper.\nPreheat an ovenproof skillet over medium-high heat. Lay the breasts in the skillet skin-side down and fry until the skin is brown and crisp, about 5 minutes. Use a spoon to carefully discard any excess fat from the bottom of the skillet. Turn the breasts over and cook for 1 minute.\nPlace the skillet into the preheated oven and roast until the internal temperature of the thickest part of the breasts reach 160 degrees F (71 degrees C) for well done, or  the breasts reach desired doneness.\nRemove the duck breasts from the skillet and cover with foil. Set aside to rest. Pour off excess fat from the skillet. Place the stock, honey, soy sauce, rice wine, ginger, tomato sauce, chili powder, and lime juice in the skillet. Whisk the sauce over high heat, bring to a boil and cook until the sauce thickens, about 2 minutes. Slice the duck breasts thinly, arrange on serving plates, and pour the sauce over the top.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "4488391.jpg",
    "o": "4463529.jpg,2313698.jpg,1093849.jpg,1091328.jpg,1080475.jpg,876821.jpg",
    "st": "allrecipes"
}