{
    "id": 10886,
    "old_rating": "1",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 3/4 cups white sugar",
        "1 cup unsalted butter",
        "4 eggs",
        "1 1/2 cups milk",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon lemon extract",
        "2 1/2 cups cake flour",
        "2 1/2 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "4 cups confectioners' sugar",
        "1/2 cup boiling water",
        "1 (1 ounce) square bittersweet chocolate",
        "1 teaspoon light corn syrup"
    ],
    "nut": [
        "Calories > 661 kcal",
        "Carbs > 115.6 g",
        "Cholesterol > 105 mg",
        "Fat > 18.9 g",
        "Protein > 8.6 g",
        "Sodium > 157 mg"
    ],
    "n": "Black and White Cookies II",
    "a": "Lori DeLosh",
    "r": "0",
    "s": 12,
    "des": "\"Big cookies frosted with half chocolate and half white frosting.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Spray 2 baking sheets with nonstick spray, or line with parchment paper.\nIn large mixing bowl, combine sugar and butter. Mix by machine or hand until fluffy. Add eggs, milk and vanilla and lemon extracts, and mix until smooth.\nIn medium bowl, combine cake flour, all-purpose flour, baking powder, and salt. Stir until mixed. Add dry mixture to the wet in batches, stirring well after each addition.\nUsing a soup spoon, place heaping spoonfuls of the dough 2 inches apart on the baking sheets. Bake until edges begin to brown, 18 to 20 minutes. Cool completely.\nPlace confectioners' sugar in large mixing bowl. Gradually stir in enough boiling water to the sugar to make a thick, spreadable mixture\nPut half the frosting in the top half of a double-boiler. Add the chocolate and corn syrup, and set over simmering water. Warm the mixture, stirring, until chocolate is melted and frosting is smooth. Turn off the heat, but leave chocolate frosting over hot water to keep it spreadable. With a brush, coat half of the top of each cookie with chocolate frosting, and the other half with white frosting. Let dry, and store in an airtight container.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}