{
    "id": 108982,
    "old_rating": "4.10526",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Marinade:",
        "4 skinless, boneless chicken breast halves",
        "1 lemon, juiced",
        "2 teaspoons lemon pepper",
        "2 teaspoons Italian seasoning",
        "salt and pepper",
        "Lemon Cream Sauce:",
        "1/2 cup butter",
        "1/2 large yellow onion, minced",
        "1/4 cup white wine",
        "2 tablespoons all-purpose flour",
        "1 cup heavy cream",
        "1 cup milk",
        "1 lemon, juiced"
    ],
    "nut": [
        "Calories > 602 kcal",
        "Carbs > 12.3 g",
        "Cholesterol > 208 mg",
        "Fat > 48.8 g",
        "Protein > 27.2 g",
        "Sodium > 494 mg"
    ],
    "n": "Chicken with Buttery Lemon Cream Sauce",
    "a": "Chelsey Wolnowski",
    "r": "0",
    "s": 4,
    "des": "\"This is a rich and delish dish I created when playing with different cream sauce recipes. I came up with this, and it's been a favorite ever since. If you are lucky enough to have any leftovers, it's great the next day too. Serve over pasta with some nice crusty bread and a big green salad.\"",
    "ins": "Place chicken breasts in a oven proof baking dish. Squeeze the juice of one lemon over the chicken, and season with lemon pepper, Italian seasoning, and salt and pepper. Cover with plastic wrap, and marinate in the refrigerator for 2 hours or overnight.\nPreheat an oven to 350 degrees F (175 degrees C).\nMelt butter in large saucepan over medium-high heat. Add onions and white wine; cook and stir until the onions are soft.  Lower the heat to medium; whisk in the flour.  Gradually whisk heavy cream into the flour mixture. Stir in the milk and remaining lemon juice. Pour the cream sauce directly over the chicken breasts in the baking dish.\nCover baking dish with aluminum foil. Cook the chicken breasts until no longer pink in the center and the juices run clear, about 30 to 40 minutes. An instant-read thermometer inserted into the center of a chicken piece should read at least 165 degrees F (74 degrees C).",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "3 h",
    "i": "214320.jpg",
    "o": "",
    "st": "allrecipes"
}