{
    "id": 109033,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup molasses",
        "3 tablespoons lard",
        "1/2 teaspoon salt",
        "1/2 cup boiling water",
        "1 cup raisins",
        "2 1/4 cups all-purpose flour",
        "1 teaspoon ground ginger",
        "1 teaspoon baking soda",
        "Sweet Milk Icing:",
        "1 1/2 cups brown sugar",
        "1/2 cup cream",
        "1 tablespoon butter"
    ],
    "nut": [
        "Calories > 382 kcal",
        "Carbs > 76.6 g",
        "Cholesterol > 19 mg",
        "Fat > 8.2 g",
        "Protein > 3.1 g",
        "Sodium > 232 mg"
    ],
    "n": "Molasses Sweetbread",
    "a": "Lisa Hayes",
    "r": "0",
    "s": 12,
    "des": "\"This is my grandmother's recipe for molasses raisin bread from the Maritimes.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).  Lightly grease and flour a 9-inch cake pan.\nIn a large bowl, mix together the molasses, lard, salt, and raisins.  Stir in the boiling water until smooth.  Sift together the flour, ground ginger and baking soda.  Stir the flour into the molasses mixture until smooth.  Pour the batter into the prepared pan,\nBake 1 hour in the preheated oven or until a toothpick inserted into the center comes out clean.  Cool to room temperature on a wire rack before removing from the pan.\nWhile the cake is baking, prepare the icing by simmering together the brown sugar and cream in a saucepan over medium heat.  Heat to between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface.  Pour the syrup into a bowl, add the butter, and beat with an electric mixer until the mixture begins to thicken, then set aside and allow to cool.\nOnce the frosting and cake are both cool, spread the icing on the cake and serve.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}