{
    "id": 109155,
    "old_rating": "1",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons clarified butter",
        "4 (4 ounce) veal cutlets, patted dry",
        "Salt and pepper, to taste",
        "2 tablespoons clarified butter",
        "1 onion, finely chopped",
        "1 carrot, finely chopped",
        "10 juniper berries, finely crushed",
        "1/3 cup diced ham",
        "1 cup bread crumbs",
        "3 sprigs fresh basil, coarsely chopped ",
        "2 tablespoons chopped fresh parsley",
        "2 cups beef broth",
        "1 cup dry white wine such as Riesling",
        "4 teaspoons lemon juice"
    ],
    "nut": [
        "Calories > 473 kcal",
        "Carbs > 25.8 g",
        "Cholesterol > 141 mg",
        "Fat > 22.5 g",
        "Protein > 29.6 g",
        "Sodium > 957 mg"
    ],
    "n": "Kalbskotelett (Veal Cutlet)",
    "a": "Catrin",
    "r": "0",
    "s": 4,
    "des": "\"German cooking is not just Brats and Kraut! This is a delicious, regional dish from the area of Germany that borders Belgium. I'm German and it's one of my family's favorites. Serve with fresh baguette and a salad with vinaigrette.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat a heavy skillet over high heat until hot.  Melt 2 tablespoons of clarified butter to coat.  Sear the cutlets on both sides until golden brown, but not completely cooked.  Remove, and season to taste with salt and pepper.  Place into an ovenproof casserole dish, and set aside.\nMelt another 2 tablespoons of clarified butter in the skillet over medium heat.  Stir in the finely chopped onion and carrot.  Cook, stirring occasionally until softened; about 5 minutes. Place into a bowl, and stir in the crushed juniper berries and diced ham.  Fold in the bread crumbs, basil, and parsley; set aside.\nPour the beef broth, white wine, and lemon juice over the veal.  Sprinkle the breadcrumb mixture evenly overtop.\nCover the casserole dish and bake in preheated oven for 40 minutes.",
    "pt": "25 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}