{
    "id": 109334,
    "old_rating": "3.98333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (8 ounce) package dried flat rice noodles",
        "3 tablespoons fish sauce",
        "1/4 cup fresh lime juice",
        "1 tablespoon white sugar",
        "2 tablespoons oyster sauce",
        "1 1/2 tablespoons Asian chile pepper sauce, divided",
        "1/4 cup chicken stock",
        "1/4 cup vegetable oil",
        "1 tablespoon chopped garlic",
        "8 ounces medium shrimp - peeled and deveined",
        "8 ounces skinless, boneless chicken breast halves - cut into 1 inch cubes",
        "2 eggs, beaten",
        "3 cups bean sprouts",
        "6 green onions, chopped into 1 inch pieces",
        "2 tablespoons chopped unsalted dry-roasted peanuts",
        "1/4 cup chopped fresh cilantro",
        "1 lime, cut into 8 wedges",
        "2 cups bean sprouts"
    ],
    "nut": [
        "Calories > 743 kcal",
        "Carbs > 83.1 g",
        "Cholesterol > 281 mg",
        "Fat > 27.8 g",
        "Protein > 41.5 g",
        "Sodium > 1592 mg"
    ],
    "n": "A Pad Thai Worth Making",
    "a": "Fatty Arbuckle",
    "r": "0",
    "s": 3,
    "des": "\"The wonderful national noodle dish of Thailand, it is now served in many trendy restaurants. It can be adjusted to your taste, add ingredients that you like and make it as spicy or tart as you want to. It is also great as a basis for a stir fry of leftovers. This is a recipe for those who like it HOT, if you can't handle the heat, go easy on the chile sauce.\"",
    "ins": "Fill a large bowl with hot tap water and place the noodles in it to soak for 20 minutes.\nIn a small bowl, stir together the fish sauce, lime juice, sugar, oyster sauce, 2 teaspoons of the chile sauce and chicken stock. Set aside.\nHeat a wok or large skillet over high heat and add vegetable oil. When the oil is hot, stir in garlic and cook for about 10 seconds. Add shrimp and chicken; cook, stirring constantly until shrimp is opaque and chicken is cooked through, 5 to 7 minutes.\nMove everything in the wok out to the sides and pour the eggs in the center. Cook and stir the eggs until firm. Add the noodles to the wok and pour in the sauce. Cook, stirring constantly, until the noodles are tender. Add a bit more water if needed to finish cooking the noodles. Stir in 3 cups of  bean sprouts and green onions. Remove from the heat and garnish with chopped peanuts. Taste for seasoning, adjusting the spice or lime juice if needed.\nServe garnished with fresh cilantro and remaining bean sprouts and lime wedges on the side.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "4488400.jpg",
    "o": "4512666.jpg,4469003.jpg,3969821.jpg,3865781.jpg,3826730.jpg,3697079.jpg",
    "st": "allrecipes"
}