{
    "id": 109841,
    "old_rating": "4.06667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Meat Layer:",
        "1 tablespoon butter",
        "1 onion, chopped",
        "3 pounds lean ground beef",
        "3/4 cup water",
        "1 (6 ounce) can tomato paste",
        "1 1/2 teaspoons salt",
        "1/4 teaspoon pepper",
        "2 tablespoons ground allspice",
        "1 teaspoon ground nutmeg",
        "1 teaspoon ground cinnamon",
        "2 eggs, beaten",
        "Macaroni Layer:",
        "1 pound uncooked macaroni",
        "2 eggs, beaten",
        "1 cup grated Parmesan cheese, divided",
        "1/2 cup butter, melted",
        "Cream Sauce Layer:",
        "4 eggs, well beaten",
        "3/4 cup half-and-half",
        "1 cup grated Parmesan cheese",
        "1 tablespoon all-purpose flour",
        "1/2 teaspoon salt",
        "ground nutmeg to taste"
    ],
    "nut": [
        "Calories > 430 kcal",
        "Carbs > 27.8 g",
        "Cholesterol > 180 mg",
        "Fat > 23 g",
        "Protein > 27.5 g",
        "Sodium > 690 mg"
    ],
    "n": "Pastitsio",
    "a": "Eleanor J. Froehlich",
    "r": "0",
    "s": 15,
    "des": "\"Pastitsio is a layered Greek casserole of macaroni and seasoned ground lamb, topped with a thick cream sauce.  This version substitutes beef in place of the lamb to suit American tastes.\"",
    "ins": "Melt 1 tablespoon of butter in a large skillet over medium-high heat.  Stir in onion and cook until it begins to soften, about 3 minutes.  Stir in the ground beef, and cook until crumbly and no longer pink.  Pour in the water and tomato paste.  Season with salt, pepper, allspice, nutmeg, and cinnamon; cover, and simmer for 5 minutes.  Remove from heat, adjust salt to taste, then refrigerate until cold.  Once cold, remove any congealed fat, and thoroughly mix with 2 beaten eggs, and set aside.\nPreheat oven to 400 degrees F (200 degrees C).\nBring a large pot of lightly salted water to a boil. Add macaroni and cook for 8 to 10 minutes or until al dente; drain, and rinse under cold water to cool.  Mix the macaroni in 2 beaten eggs until well coated.\nEvenly spread half of the macaroni mixture into a 11x14x2 inch baking pan, sprinkle with 1/2 cup of the grated parmesan cheese, and drizzle with 1/2 cup of melted butter.  Spread the meat mixture overtop, then finish with the remaining macaroni.  Sprinkle the macaroni with another 1/2 cup of Parmesan cheese, and drizzle with 1/2 cup of melted butter.\nWhisk together 4 beaten eggs with the half-and-half, 1 cup of Parmesan cheese, flour, and salt; whisk until well blended.  Pour the cream mixture evenly over top of the pastitsio, and sprinkle with nutmeg.\nCover the pan with foil, and bake in the preheated oven for 15 minutes.  Remove the foil, and bake until the top has turned golden brown, about 30 minutes.  Remove from oven, and allow to stand for 15 minutes before serving.",
    "pt": "45 m",
    "ct": "1 h ",
    "tt": "6 h ",
    "i": "717398.jpg",
    "o": "",
    "st": "allrecipes"
}