{
    "id": 109895,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon crushed saffron threads",
        "1 cup boiling water",
        "1 cup fresh bread crumbs",
        "1/4 cup butter, melted",
        "1 (16 ounce) package ziti pasta",
        "2 teaspoons vegetable oil",
        "1 small onion, diced",
        "1 head cauliflower, chopped into bite size pieces",
        "salt and pepper to taste",
        "1/2 cup golden raisins",
        "1/4 cup pine nuts"
    ],
    "nut": [
        "Calories > 484 kcal",
        "Carbs > 78.3 g",
        "Cholesterol > 20 mg",
        "Fat > 13.6 g",
        "Protein > 14.4 g",
        "Sodium > 238 mg"
    ],
    "n": "Saffron Scented Cauliflower Pasta",
    "a": "Jill Ottignon",
    "r": "0",
    "s": 6,
    "des": "\"Scandinavian flavors of saffron and golden raisins flavor this cauliflower and small pasta dish. Crispy, toasted bread crumbs lend a light crunch for contrast.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nStir the saffron threads into the boiling water, and cover.  Set aside to steep for several minutes while proceeding with the recipe.\nToss the bread crumbs together with the melted butter, and lay out evenly on a cookie sheet.  Bake in the preheated oven until golden and crispy, about 20 minutes.\nMeanwhile, bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nWhile the pasta is cooking, heat 2 teaspoons of vegetable oil in a skillet over medium heat.  Stir in the onion, and cook until softened, about 3 minutes.  Add the chopped cauliflower and saffron water; season to taste with salt and pepper.  Increase heat to medium-high and simmer, uncovered, until the cauliflower has softened, about 10 minutes.  Stir in the raisins, pine nuts, and cooked ziti. Pour into a serving dish and sprinkle with browned bread crumbs.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "1453773.jpg",
    "o": "",
    "st": "allrecipes"
}