{
    "id": 109840,
    "old_rating": "4.37037",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 ounces country style white bread, cut into 1 inch cubes",
        "3 tablespoons garlic flavored olive oil",
        "1/2 teaspoon coarse salt",
        "1 (15 ounce) can garbanzo beans, rinsed and drained",
        "2 cups red or yellow teardrop tomatoes, halved",
        "1/3 cup chopped green bell pepper",
        "1/3 cup chopped red bell pepper",
        "1 small red onion, cut into 3/4 inch slices",
        "10 kalamata olives, pitted and halved",
        "1/3 cup basil pesto",
        "1/4 cup balsamic vinegar",
        "1 tablespoon minced fresh rosemary",
        "1/4 teaspoon black pepper",
        "4 ounces crumbled goat cheese",
        "1 head green or red leaf lettuce",
        "1/4 cup toasted pine nuts"
    ],
    "nut": [
        "Calories > 264 kcal",
        "Carbs > 24.5 g",
        "Cholesterol > 12 mg",
        "Fat > 15 g",
        "Protein > 8.8 g",
        "Sodium > 452 mg"
    ],
    "n": "Italian Panzanella Bread Salad",
    "a": "josephinecooks",
    "r": "0",
    "s": 10,
    "des": "\"Italy's famous bread salad is usually associated with Tuscany, but my husband's father emigrated from Sicily, so I made up this version of bread salad using the flavors of Sicilian cuisine.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nToss the bread cubes with the olive oil to evenly coat.  Sprinkle with salt, and toss again.  Spread the cubed bread evenly over a baking sheet, and bake in the preheated oven until golden brown, about 12 minutes.  Remove from oven and allow to cool completely.\nToss together the garbanzo beans, tomatoes, peppers, onion, and kalamata olives in a large bowl.  In a separate bowl, whisk together the pesto, balsamic vinegar, rosemary, and pepper.  Toss the tomatoes with the pesto mixture, and let stand at room temperature for 30 minutes to 1 hour.\nTo serve, toss the toasted bread cubes and goat cheese with the tomato mixture.  Line a serving platter with a few lettuce leaves.  Shred the remaining lettuce, and mound in the center of the platter.  Spoon the bread mixture over the lettuce, and sprinkle with toasted pine nuts.",
    "pt": "40 m",
    "ct": "12 m",
    "tt": "1 h ",
    "i": "944141.jpg",
    "o": "437388.jpg,414771.jpg,249297.jpg,248381.jpg,159070.jpg,21887.jpg",
    "st": "allrecipes"
}