{
    "id": 109914,
    "old_rating": "4.50146",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Sauerkraut Filling:",
        "2 tablespoons butter",
        "1/3 cup chopped onion",
        "1 1/2 cups sauerkraut, drained and minced",
        "salt and pepper to taste",
        "Potato Filling:",
        "3 tablespoons butter",
        "1/2 cup chopped onion",
        "2 cups cold mashed potatoes",
        "1 teaspoon salt",
        "1 teaspoon white pepper",
        "Dough:",
        "3 egg",
        "1 (8 ounce) container sour cream",
        "3 cups all-purpose flour",
        "1/4 teaspoon salt",
        "1 tablespoon baking powder"
    ],
    "nut": [
        "Calories > 253 kcal",
        "Carbs > 33.2 g",
        "Cholesterol > 68 mg",
        "Fat > 10.6 g",
        "Protein > 6.4 g",
        "Sodium > 698 mg"
    ],
    "n": "Pierogi (Polish Dumplings)",
    "a": "TAB",
    "r": "0",
    "s": 12,
    "des": "\"This recipe has been a family favorite passed on from generation to generation. We traditionally make these for Christmas, but they can be made for any special event. There's some work involved, but the outcome is rewarding! After the perogies have boiled, they can be fried in some butter and onions or served with sour cream.\"",
    "ins": "To prepare the sauerkraut filling, melt the butter in a skillet over medium heat.  Stir in the onion, and cook until translucent, about 5 minutes.  Add the drained sauerkraut and cook for an additional 5 minutes.  Season to taste with salt and pepper, then remove to a plate to cool.\nFor the mashed potato filling, melt the butter in a skillet over medium heat.  Stir in the onion, and cook until translucent, about 5 minutes.  Stir into the mashed potatoes, and season with salt and white pepper.\nTo make the dough, beat together the eggs and sour cream until smooth.  Sift together the flour, salt, and baking powder; stir into the sour cream mixture until dough comes together.  Knead the dough on a lightly floured surface until firm and smooth.  Divide the dough in half, then roll out one half to 1/8 inch thickness.  Cut into 3 inch rounds using a biscuit cutter.\nPlace a small spoonful of the mashed potato filling into the center of each round.  Moisten the edges with water, fold over, and press together with a fork to seal.  Repeat procedure with the remaining dough and the sauerkraut filling.\nBring a large pot of lightly salted water to a boil. Add perogies and cook for 3 to 5 minutes or until pierogi float to the top. Remove with a slotted spoon.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "4508335.jpg",
    "o": "4508335.jpg,4499708.jpg,4364869.jpg,4047170.jpg,2958521.jpg,2885394.jpg",
    "st": "allrecipes"
}