{
    "id": 109921,
    "old_rating": "4.2381",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 eggs",
        "1 (14 ounce) can sweetened condensed milk",
        "1 (12 fluid ounce) can evaporated milk",
        "1 (15 ounce) can coconut milk",
        "1 1/2 cups whole milk",
        "1 teaspoon vanilla extract",
        "1 cup white sugar"
    ],
    "nut": [
        "Calories > 333 kcal",
        "Carbs > 40.3 g",
        "Cholesterol > 116 mg",
        "Fat > 15.9 g",
        "Protein > 9.6 g",
        "Sodium > 127 mg"
    ],
    "n": "Coconut Flan",
    "a": "Viveca DelGiorno",
    "r": "0",
    "s": 12,
    "des": "\"My grandmother used to make this recipe in Ecuador, it's been in the family for many years. I'm the only one who continues to make this recipe in my family.   It's the easiest dessert that you can make.  I love it and I hope you will too.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace the sugar in a nonstick skillet, and slowly melt over low heat without stirring.  Shake the pan by it's handle to mix, but do not stir with a spoon. When the sugar has melted, pour into a 3 quart glass baking dish, coating the bottom.\nIn a large bowl, beat the eggs with an electric mixer until smooth.  Pour in the condensed milk, evaporated milk, coconut milk, whole milk, and vanilla; mix until well blended, about 2 minutes. Pour the egg mixture over the sugar in the pan.  Place the pan inside of a larger dish and set in the oven. Fill the outer pan with water to 1 inch deep.\nBake for 1 hour in the preheated oven, or until a toothpick inserted in the center comes out clean. Remove the flan from the water bath, and refrigerate until cold, 4 hours to overnight.\nTo serve, run a knife around the edges of the dish to loosen the flan, then invert onto a serving dish.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "4 h ",
    "i": "2126304.jpg",
    "o": "2996784.jpg,2250096.jpg,1119859.jpg,1114676.jpg,646480.jpg,208432.jpg",
    "st": "allrecipes"
}