{
    "id": 109925,
    "old_rating": "4.55401",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (8 ounce) skinless, boneless chicken breast halves",
        "2 tablespoons minced garlic",
        "1 medium onion, chopped",
        "3 cups water",
        "1 tablespoon chicken bouillon granules",
        "4 fresh poblano chilies",
        "1 (8 ounce) container sour cream",
        "2 tablespoons olive oil",
        "10 (6 inch) corn tortillas",
        "1 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 443 kcal",
        "Carbs > 31.1 g",
        "Cholesterol > 87 mg",
        "Fat > 21.5 g",
        "Protein > 32.1 g",
        "Sodium > 478 mg"
    ],
    "n": "Poblano Chile Enchiladas a la Gringa",
    "a": "Olga Gonzalez",
    "r": "0",
    "s": 5,
    "des": "\"Prepare for your taste buds to jump for joy!\"",
    "ins": "Place the chicken breasts, garlic, onion, water, and chicken bouillon into a saucepan.  Bring to a boil, then reduce heat to medium-low and simmer for 40 minutes.  When finished, remove the chicken to a plate to cool.  Measure out 1 cup of the chicken broth and discard the rest.\nRoast the poblano chiles over an open flame, or underneath a broiler until the skin has blackened on all sides.  Place the chiles into a plastic bag, or a bowl covered with plastic wrap, and allow to steam as they cool, about 30 minutes.  When cool, peel the blackened skin off of the pepper, and remove the seeds and membrane.\nPlace the reserved chicken broth into a blender along with the roasted poblanos and sour cream.  Puree until smooth and set aside.\nHeat the olive oil in a skillet over medium heat.  Fry the tortillas one at a time until softened and beginning to crisp.  Place onto a plate and set aside.  Pour the pureed poblano mixture into the skillet and simmer for 10 minutes.  While the sauce is cooking, slice the cooled chicken breasts into 1/4 inch strips.\nUsing tongs, dip a tortilla into the sauce, coating both sides.  Place some of the chicken in the center of the tortilla, roll tightly, then place on a serving dish with the seam side down. Repeat with remaining tortillas.  Spoon any remaining sauce over top of the enchiladas, then sprinkle with the shredded mozzarella cheese.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "829703.jpg",
    "o": "4483188.jpg,4036299.jpg,3291068.jpg,3123088.jpg,3117350.jpg,3084232.jpg",
    "st": "allrecipes"
}