{
    "id": 110056,
    "old_rating": "4.28571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup jellied cranberry sauce",
        "1/4 cup orange marmalade",
        "1/4 cup fresh lime juice",
        "1/4 cup fresh orange juice",
        "1/4 cup vegetable oil",
        "2 tablespoons lemon flavored vodka",
        "4 skinless, boneless chicken breast halves",
        "3/4 teaspoon salt",
        "3/4 teaspoon lemon pepper",
        "1 (10 ounce) bag European blend salad greens",
        "1/2 cup dried cranberries",
        "2 cups diced orange segments",
        "2 tablespoons orange zest strips"
    ],
    "nut": [
        "Calories > 439 kcal",
        "Carbs > 48.8 g",
        "Cholesterol > 68 mg",
        "Fat > 15.5 g",
        "Protein > 29.6 g",
        "Sodium > 634 mg"
    ],
    "n": "Grilled Chicken Salad Cosmopolitan",
    "a": "Janice",
    "r": "0",
    "s": 4,
    "des": "\"This whimsical and delicious chicken salad was inspired by the famous Cosmopolitan cocktail.  The cranberry-citrus mixture is used in two ways - one portion to marinate the chicken and the remainder as a salad dressing.  The crisp and clean flavor combinations create a light and healthy yet totally satisfying salad that enhances the chicken.  An indoor grill pan may be used to cook the chicken, if preferred.\"",
    "ins": "In a small saucepan over low heat, combine the cranberry sauce and orange marmalade. Warm and stir until melted and well blended. Remove from the heat and stir in the lime juice, orange juice and vegetable oil. Remove 1/2 cup of the mixture and set aside in the refrigerator for later.\nAllow the mixture to cool then stir in the lemon vodka and transfer to a large resealable bag. Season the chicken pieces with salt and lemon pepper; place them into the bag with the marinade. Seal the bag and marinate in the refrigerator for at least 1 hour, turning occasionally.\nPreheat a grill for medium heat. Remove the chicken from the plastic bag, discarding the marinade.\nPlace the chicken pieces on the preheated grill and cook for 4 to 5 minutes on each side, or until firm and no longer pink in the center. If you have a meat thermometer, it should measure 160 degrees F (70 degrees C) when measured in the thickest part. Remove chicken to a cutting board and allow to rest for about 5 minutes.\nWhile the chicken is resting, combine the salad greens, cranberries, and orange segments. Pour the reserved citrus marinade over the salad and toss lightly to coat. Divide the salad between four serving plates. Slice each piece of chicken crosswise into 1/2 inch strips. Arrange over the tops of the salads and sprinkle with orange zest strips.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "21891.jpg",
    "o": "",
    "st": "allrecipes"
}