{
    "id": 11014,
    "old_rating": "4.68421",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups unbleached all-purpose flour",
        "1/3 cup rolled oats",
        "1 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 cup crunchy peanut butter",
        "1 cup packed brown sugar",
        "1/2 cup unsalted butter",
        "1/4 cup honey",
        "1 egg",
        "1 teaspoon vanilla extract",
        "5 (1 ounce) squares semisweet chocolate"
    ],
    "nut": [
        "Calories > 416 kcal",
        "Carbs > 48.6 g",
        "Cholesterol > 36 mg",
        "Fat > 22.9 g",
        "Protein > 8.6 g",
        "Sodium > 271 mg"
    ],
    "n": "Peanut Butter Cookies with Chocolate Chunks",
    "a": "Stephanie",
    "r": "0",
    "s": 12,
    "des": "\"The addition of honey, oats and chocolate chunks in this recipe makes a terrific interpretation of the All-American Peanut Butter Cookie!\"",
    "ins": "Mix flour, oats, baking soda, and salt in medium bowl.\nUsing an electric mixer, beat peanut butter, brown sugar, butter, honey, egg, and vanilla in large bowl until well blended.  Stir dry ingredients into the peanut butter mixture in 2 additions.  Stir in chopped chocolate.\nCover and refrigerate until dough is firm and no longer sticky, about 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).  Butter 2 heavy large baking sheets.\nWith hands, roll 1 heaping tablespoonful of dough for each cookie into 1 3/4 inch diameter ball.  Arrange cookies on prepared baking sheets, spacing 2 1/2 inches apart.\nBake cookies until puffed, beginning to brown on top and still very soft to touch, about 12 minutes.  Cool cookies on baking sheets for 5 minutes.  Using metal spatula, transfer cookies to rack and cool completely. (Can be made 2 days ahead.  Store in airtight container at room temperature.)",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "429345.jpg",
    "o": "4530046.jpg,4506697.jpg,2414563.jpg,183455.jpg,181165.jpg,172448.jpg",
    "st": "allrecipes"
}