{
    "id": 110418,
    "old_rating": "4.73077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "12 cherry tomatoes",
        "salt and black pepper to taste",
        "1/4 cup olive oil",
        "1 bay leaf, crumbled",
        "1/4 cup pine nuts",
        "2/3 pound thin green beans, trimmed",
        "1 (5 ounce) package arugula leaves",
        "6 fresh basil leaves, torn into pieces",
        "1 tablespoon red wine vinegar",
        "2 tablespoons whole-grain mustard",
        "2 cloves garlic, minced",
        "1/2 teaspoon honey",
        "1/4 cup olive oil",
        "6 ounces crumbled feta cheese"
    ],
    "nut": [
        "Calories > 448 kcal",
        "Carbs > 11.9 g",
        "Cholesterol > 38 mg",
        "Fat > 40.9 g",
        "Protein > 10.3 g",
        "Sodium > 823 mg"
    ],
    "n": "Feta and Slow-Roasted Tomato Salad with French Green Beans",
    "a": "Andypoc",
    "r": "0",
    "s": 4,
    "des": "\"A lovely fresh salad to accompany hot lamb dishes or simply to serve as salad with a BBQ.\"",
    "ins": "Preheat an oven to 225 degrees F (110 degrees C).\nSlice the cherry tomatoes in half, and arrange them, cut sides up, on a baking sheet. Sprinkle them with salt, pepper, and the bay leaf; drizzle with 1/4 cup olive oil.\nBake the tomatoes until they are shriveled and dry on the outside, but a little moist inside, about 2 hours.\nToast the pine nuts in a small pan over medium-low heat, gently shaking the pan as they toast, until beginning brown and fragrant, 2 to 3 minutes; set aside.\nBring a saucepan of water to a boil; cook the green beans in the boiling water until bright green but still crisp, about 3 minutes. Drain and rinse immediately with cold water.\nCombine the roasted tomatoes, toasted pine nuts, green beans, arugula, and basil in a salad bowl. Whisk together the red wine vinegar, mustard, garlic, honey, and 1/4 cup olive oil in a bowl, and pour the dressing over the salad. Stir in the crumbled feta cheese just before serving.",
    "pt": "17 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "269701.jpg",
    "o": "",
    "st": "allrecipes"
}