{
    "id": 11070,
    "old_rating": "3.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup butter",
        "3 (1 ounce) squares bittersweet chocolate",
        "1/2 cup white sugar",
        "1 teaspoon vanilla extract",
        "1 egg, beaten",
        "1/2 cup all-purpose flour",
        "1/4 cup butter",
        "1/2 cup white chocolate chips",
        "1/2 cup white sugar",
        "1 teaspoon vanilla extract",
        "1 egg, beaten",
        "1/2 cup all-purpose flour"
    ],
    "nut": [
        "Calories > 159 kcal",
        "Carbs > 19.8 g",
        "Cholesterol > 32 mg",
        "Fat > 8.2 g",
        "Protein > 1.9 g",
        "Sodium > 45 mg"
    ],
    "n": "Two Tone Brownies",
    "a": "Penny",
    "r": "0",
    "s": 20,
    "des": "\"A white and dark chocolate combo to suit everyone's tastes.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).  Lightly brush an 8 inch square tin with melted butter or oil.  Line the base with baking paper, extending over two sides.\nStir 1/4 cup butter or margarine and dark chocolate in the top of a double boiler until just melted. Using a wooden spoon, beat 1/2 cup sugar, vanilla extract, and 1 egg in a medium bowl until combined.  Stir in the melted chocolate mixture.  Add 1/2 cup flour, stirring until just combined; don't over beat.\nStir 1/4 cup butter or margarine and white chocolate in the top of a double boiler until just melted. Using a wooden spoon, beat 1 /2 cup sugar, vanilla extract and 1 egg in a second bowl until combined.  Stir in the white chocolate mixture.  Add 1/2 cup flour, stirring until just combined; don't over beat.\nDrop large spoonfuls of the mixtures alternately and evenly, next to one another, in a single layer, in the tin. Gently smooth the surface, without combining the mixtures.\nBake for 35 minutes, or until firm.   Allow to cool in the tin before cutting into small squares.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "44798.jpg",
    "o": "",
    "st": "allrecipes"
}