{
    "id": 110714,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "9 tablespoons brown sugar, divided",
        "2 tablespoons butter",
        "1/4 cup water",
        "2 tablespoons tequila or dark rum (optional)",
        "3 (10 inch) flour tortillas",
        "2 large bananas, peeled and sliced in coins",
        "3 tablespoons chopped walnuts",
        "toothpicks, for securing tortillas",
        "2 cups vegetable oil",
        "3 cups premium vanilla ice cream"
    ],
    "nut": [
        "Calories > 493 kcal",
        "Carbs > 64.4 g",
        "Cholesterol > 39 mg",
        "Fat > 23.7 g",
        "Protein > 6.3 g",
        "Sodium > 309 mg"
    ],
    "n": "Burrito Bananas Foster",
    "a": "USA WEEKEND Pam Anderson",
    "r": "0",
    "s": 6,
    "des": "\"Get out the frying pan: Bananas Foster gets a glamorous update that plays off what I call the fried ice cream effect. Bananas, brown sugar and walnuts are folded in a flour tortilla and fried. The tortilla crisps up, and the sugar dissolves into sauce. Top the Breezy Burrito Bananas Foster with a two-minute sauce for a dessert that rivals the Big Easy original.\"",
    "ins": "In a small saucepan, bring 6 Tbs. of brown sugar and the butter and water to a boil. Stir in liquor; simmer to blend flavors, about 1 minute. Remove from heat, and set aside.\nPlace one flour tortilla on a work surface. Place 1?3 of the banana slices just below the center, forming the fruit into a log; sprinkle with 1 Tb. brown sugar and 1 Tb. walnuts. Fold both sides of the tortilla over the filling, then fold bottom of the tortilla over the filling and roll it over to form a packet. Secure with toothpicks.  Repeat with remaining tortillas, bananas, sugar and nuts. (You can make ahead to this point and hold at room temperature for 1 hour.)\nMeanwhile, warm oil in a Dutch oven set over medium heat until it reaches 350 degrees on a candy or deep-fry thermometer. Add all three stuffed tortillas. Fry, turning once, until golden brown, about 2 minutes on each side.\nTransfer to paper towels, lightly blot surface oil, remove toothpicks and halve on the diagonal with a serrated knife.\nSpoon 1 Tb. butter sauce in the bottom of each of six shallow bowls. Place half a tortilla and 1?2 cup of ice cream in each pool of sauce. Drizzle with remaining sauce, and serve immediately.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}