{
    "id": 111004,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "7 cups water",
        "1 3/4 cups white vinegar",
        "1 1/4 cups white sugar",
        "1 teaspoon whole pickling spices",
        "5 tablespoons pickling salt",
        "10 cloves garlic, peeled",
        "10 (1/4 inch x 3 inch) strips peeled fresh horseradish root",
        "40 small pickling cucumbers"
    ],
    "nut": [
        "Calories > 35 kcal",
        "Carbs > 8.6 g",
        "Cholesterol > 0 mg",
        "Fat > 0.1 g",
        "Protein > 0.7 g",
        "Sodium > 701 mg"
    ],
    "n": "Blue Ribbon Horseradish Pickles",
    "a": "SHAWN",
    "r": "0",
    "s": 50,
    "des": "\"Spicy pickles with a hint of horseradish will set your pickles head and shoulders above the rest. You will get raves on these pickles! I always get asked to make more or bring more to work. These are worth a try! This makes a really crisp, great tasting pickle!\"",
    "ins": "Soak the cucumbers in ice cold water for 2 to 3 hours.\nSterilize 5 (1 quart) jars with lids and rings and keep hot.\nIn a large pot, combine the water, vinegar, sugar and pickling spices. Stir to dissolve sugar and bring to a boil.\nWhile the mixture is heating up, place the following things into each jar: 1 tablespoon of salt, 2 cloves of garlic, 2 strips of horseradish, and a few sprigs of dill. Trim the ends from the cucumbers and make a slit in the skin of each one so the brine can soak in and any air can get out. Pack the cucumbers into the jars. Pour the boiling brine into the jars to within 1/2 inch of the rims. Seal with lids and rings.\nBring the water to a boil in the pot where you sterilized the jars. Place the jars into the water and turn off the heat. Let them sit in there until the water is cool. Test the jars for a good seal by pressing on the center of the lid. Refrigerate any unsealed jars.",
    "pt": "3 h",
    "ct": "20 m",
    "tt": "3 h ",
    "i": "3296119.jpg",
    "o": "",
    "st": "allrecipes"
}