{
    "id": 11111,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup packed brown sugar",
        "1/4 cup white sugar",
        "3/4 cup wheat germ",
        "1 cup quick cooking oats",
        "1/2 cup dried cherries",
        "1/2 cup golden raisins",
        "2/3 cup flaked coconut",
        "1 cup all-purpose flour",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt"
    ],
    "nut": [
        "Calories > 197 kcal",
        "Carbs > 40.7 g",
        "Cholesterol > 0 mg",
        "Fat > 2.4 g",
        "Protein > 4.3 g",
        "Sodium > 167 mg"
    ],
    "n": "Oatmeal Fruit Cookie Mix In A Jar",
    "a": "Verushka",
    "r": "0",
    "s": 12,
    "des": "\"Oatmeal Fruit Cookie Mix in a jar. The layers of different ingredients make a very attractive and once baked very tasty gift. If you can't locate dried cherries you can substitute dried cranberries or chopped dried apricots.\"",
    "ins": "Mix the flour, baking soda and salt together.\nStarting with the brown sugar layer the ingredients in a 1 liter sized glass jar in the order given. Ending with the flour mixture.\nAttach a card with the following directions:   Oatmeal Fruit Cookies  1. Preheat the oven to 350 degrees F (175 degrees C). Line one baking sheet with parchment paper.  2. Empty the contents of the jar into a large bowl. Using a wooden spoon blend the mixture until well combined.  3. Using you hands work in 1/2 cup softened butter or margarine until the mixture resembles coarse crumbs.  4. Beat 1 egg with 1 teaspoon vanilla and 1/4 cup milk. Still using your hands or a wooden spoon blend the egg mixture into the dough until well combined.  5. Drop teaspoon sized mounds 2 inches apart onto the prepared baking sheet. Bake at 350 degrees F (175 degrees C) for 10 to 14 minutes or until the edges are lightly browned. Place cookies on a rack to finish cooling. Makes approximately 2 dozen cookies.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "319601.jpg",
    "o": "",
    "st": "allrecipes"
}