{
    "id": 11135,
    "old_rating": "4.41463",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1 1/2 cups all-purpose flour",
        "2 teaspoons ground ginger",
        "1 teaspoon ground cloves",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground allspice",
        "1 cup packed brown sugar"
    ],
    "nut": [
        "Calories > 137 kcal",
        "Carbs > 31 g",
        "Cholesterol > 0 mg",
        "Fat > 0.3 g",
        "Protein > 2.6 g",
        "Sodium > 101 mg"
    ],
    "n": "Gingerbread Cookie Mix in a Jar",
    "a": "Staci",
    "r": "0",
    "s": 18,
    "des": "\"Gingerbread Cookie Mix layered in a one quart canning jar. Great Christmas gift. Place a circle of gingerbread fabric between lid and ring and tie a gingerbread man cookie cutter onto jar with ribbon!\"",
    "ins": "Mix 2 cups of the flour with the baking soda and baking powder. Mix the remaining 1 1/2 cups flour with the ginger, cloves, cinnamon, and allspice. In a 1 quart, wide mouth canning jar, layer the ingredients starting with the flour and baking powder mixture, then the brown sugar, and finally the flour and spice mixture. Pack firmly between layers.\nAttach a card to the jar with the following directions:  Gingerbread Cookies  1.  Empty contents of jar into a large mixing bowl. Stir to blend together. Mix in 1/2 cup softened butter or margarine, 3/4 cup molasses, and 1 slightly beaten egg. Dough will be very stiff, so you may need to use your hands. Cover, and refrigerate for 1 hour.  2.  Preheat oven to 350 degrees F (175 degrees C).  3.  Roll dough to 1/4 inch thick on a lightly floured surface. Cut into shapes with a cookie cutter. Place cookies on a lightly greased cookie sheet about 2 inches apart.  4.  Bake for 10 to 12 minutes in preheated oven. Decorate as desired.",
    "pt": "20 m",
    "ct": "",
    "tt": "",
    "i": "26464.jpg",
    "o": "",
    "st": "allrecipes"
}