{
    "id": 111368,
    "old_rating": "4.16346",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup ricotta cheese",
        "1 teaspoon Italian seasoning",
        "1/4 teaspoon salt",
        "1/4 cup grated Parmesan cheese",
        "1/2 cup shredded mozzarella cheese",
        "1/2 cup chopped pepperoni",
        "1/4 cup finely chopped fresh mushrooms",
        "1/4 cup finely chopped green bell pepper",
        "2 tablespoons finely chopped onion",
        "1 (8 ounce) can refrigerated crescent roll dough",
        "1 (14 ounce) jar pizza sauce"
    ],
    "nut": [
        "Calories > 513 kcal",
        "Carbs > 34.8 g",
        "Cholesterol > 53 mg",
        "Fat > 30.7 g",
        "Protein > 21.2 g",
        "Sodium > 1786 mg"
    ],
    "n": "Pinwheel Italian Calzones",
    "a": "Lisa Smith",
    "r": "0",
    "s": 4,
    "des": "\"Once you try these mini calzones, you may never go back to fixing the large ones again!  These calzones come together in a snap, and are a great way to sneak a few veggies into your kid's diet.  The best part is they are small so it makes it easy for little hands to pick up and eat. Plus they taste like pizza and there's even a dipping sauce!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a medium bowl, stir together the ricotta cheese, Italian seasoning, salt, Parmesan cheese, mozzarella cheese, pepperoni, mushrooms, green pepper and onion. Set aside.\nUnroll the crescent roll dough and separate into 4 rectangles. Press the remaining perforations together to seal. Spread the filling evenly onto the rectangles. Roll up the filling inside the dough starting at the short side. Slice each finished roll into four slices, and place cut side down onto a baking sheet.\nBake for 10 to 12 minutes in the preheated oven, until lightly browned. While the pinwheels are baking, warm the pizza sauce. Serve the pinwheels with pizza sauce in small cups for dipping.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "4519924.jpg",
    "o": "4519924.jpg,4047569.jpg,4038793.jpg,2340928.jpg,1708482.jpg,537951.jpg",
    "st": "allrecipes"
}