{
    "id": 111469,
    "old_rating": "2.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "2 1/2 pounds ground beef chuck",
        "2 large onions, chopped",
        "4 cloves garlic, chopped",
        "6 stalks celery, chopped",
        "6 carrots, chopped",
        "3 tablespoons ground cinnamon",
        "2 tablespoons dried basil",
        "1 tablespoon dried oregano",
        "salt and ground black pepper to taste",
        "2 (10 ounce) packages frozen chopped spinach, thawed and drained",
        "1 (14.5 ounce) can Italian-style diced tomatoes",
        "1 cup shredded sharp Cheddar cheese",
        "1 (8 ounce) box elbow macaroni",
        "1 (8 ounce) package thin spaghetti"
    ],
    "nut": [
        "Calories > 649 kcal",
        "Carbs > 60.2 g",
        "Cholesterol > 107 mg",
        "Fat > 27.8 g",
        "Protein > 40.1 g",
        "Sodium > 381 mg"
    ],
    "n": "Best Bresslin' Pasta Casserole Done Cincinnati Style",
    "a": "RUTH'S CRAVINGS",
    "r": "0",
    "s": 8,
    "des": "\"This delicious casserole recipe has taken me a few years to perfect. This is a bit of a different twist to your average baked pasta casserole. Do not let the diverse list of ingredients fool you. Kids love it too! This freezes nicely.\"",
    "ins": "Heat the olive oil in a large skillet over medium-high heat. Cook and stir the beef, onion, garlic, celery, and carrots in the hot oil until the vegetables are tender, about 10 minutes. While cooking, season with cinnamon, basil, oregano, salt, and pepper. Add the spinach, tomatoes, and 1/2 of the Cheddar cheese. Bring to a gentle boil; reduce heat to medium-low, cover, and simmer for 1 hour.\nPreheat an oven to 350 degrees F (175 degrees C).\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the macaroni and spaghetti, and return to a boil. Cook the pasta until not quite cooked through, about 5 minutes. Drain well in a colander set in the sink.\nCombine the drained pasta and the ground beef mixture in a large casserole dish. Top with the remaining Cheddar cheese. Cover the dish. Bake in the preheated oven until the cheese is completely melted, about 20 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "891946.jpg",
    "o": "",
    "st": "allrecipes"
}