{
    "id": 111766,
    "old_rating": "4.15385",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups butter, softened",
        "2 cups peanut butter",
        "2 cups white sugar",
        "2 cups brown sugar",
        "4 eggs",
        "4 teaspoons vanilla extract",
        "6 cups all-purpose flour",
        "2 teaspoons baking soda",
        "2 teaspoons baking powder",
        "1 teaspoon salt",
        "24 fun size bars chocolate-coated caramel-peanut nougat candy",
        "1/2 cup white sugar, for sprinkling"
    ],
    "nut": [
        "Calories > 633 kcal",
        "Carbs > 79 g",
        "Cholesterol > 74 mg",
        "Fat > 32 g",
        "Protein > 11.3 g",
        "Sodium > 516 mg"
    ],
    "n": "Peanut Butter \"Snickerdoodles\"",
    "a": "Jamie",
    "r": "0",
    "s": 24,
    "des": "\"I grew up thinking that a snickerdoodle involved an actual Snickers, and a white cookie with cinnamon sugar was called something else. I have been educated, but the name still sticks. These are large peanut butter cookies with your favorite fun size candy bar stuffed in the middle. \"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line baking sheets with parchment paper, and set aside.\nBeat together the butter, peanut butter, 2 cups white sugar, and brown sugar in a large bowl, stirring until well mixed and creamy. Mix in the vanilla extract and eggs.\nIn a separate bowl, whisk together the flour, baking soda, baking powder, and salt. Mix the flour mixture, one cup at a time, into the butter mixture, and stir until you have a smooth dough.\nScoop up 1/4 cup of dough per cookie, and form it into a ball around a fun size candy bar. Set the balls onto a baking sheet at least 6 inches apart, and flatten each ball with a fork in a cross-hatch pattern, making sure the cookie dough is still fully covering the candy bar. Sprinkle each cookie with about 1/2 teaspoon white sugar.\nBake the cookies in the preheated oven until the cookies are slightly browned around the edges, 12 to 14 minutes.",
    "pt": "40 m",
    "ct": "12 m",
    "tt": "52 m",
    "i": "1060362.jpg",
    "o": "",
    "st": "allrecipes"
}