{
    "id": 11203,
    "old_rating": "4.73004",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup unsalted butter",
        "1 1/2 cups white sugar",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "2 cups all-purpose flour",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon kosher salt",
        "2/3 cup unsweetened cocoa powder",
        "1 cup chopped walnuts",
        "2 cups semisweet chocolate chips"
    ],
    "nut": [
        "Calories > 265 kcal",
        "Carbs > 31.3 g",
        "Cholesterol > 36 mg",
        "Fat > 15.9 g",
        "Protein > 3.5 g",
        "Sodium > 75 mg"
    ],
    "n": "Chocolate Chocolate Chip Cake Cookies",
    "a": "Chef Doogie",
    "r": "0",
    "s": 24,
    "des": "\"Soft, chewy, chocolaty chocolate chip cookies that are positively childishly yummy!  These are a finals pick-me-up for our college student daughter.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large mixing bowl, cream together the butter and sugar until light and fluffy. This should take about 10 minutes! Add the eggs one at a time and mix to incorporate. Add the vanilla and mix thoroughly.\nIn a 1 gallon plastic food bag, place the all-purpose flour, baking soda, kosher salt and cocoa powder.  Seal the bag and massage the ingredients to combine.  The mixture will appear homogenous with no separate ingredients showing.\nAdd the flour and cocoa mix to the creamed butter and sugar. Mix together until the dough appears completely combined - about 3 minutes. Add all the walnuts and chocolate chips and stir them into the dough. Drop by two teaspoonfuls onto an ungreased cookie sheet. Or roll into balls, place about two inches apart on the sheet, and flatten slightly with your fingers.\nBake for 11 minutes at 350 degrees F (175 degrees C). The cookies will appear to be just barely firm with a sheen to their surfaces.  Allow to cool on the sheet for about one minute before removing to a cooling rack to cool completely.  Store in airtight containers.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2947.jpg",
    "o": "4479576.jpg,2663674.jpg,1118234.jpg,969716.jpg,932091.jpg,761427.jpg",
    "st": "allrecipes"
}