{
    "id": 11202,
    "old_rating": "4.35294",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup white sugar",
        "3/4 cup packed brown sugar",
        "3/4 cup butter flavored shortening",
        "2 eggs",
        "2 tablespoons milk",
        "1 teaspoon baking soda",
        "1 teaspoon baking powder",
        "1 teaspoon salt",
        "1 teaspoon ground cinnamon",
        "1 teaspoon vanilla extract",
        "1 cup all-purpose flour",
        "3 cups quick cooking oats",
        "1 cup chopped walnuts",
        "1 cup dried cherries"
    ],
    "nut": [
        "Calories > 113 kcal",
        "Carbs > 14.5 g",
        "Cholesterol > 8 mg",
        "Fat > 5.5 g",
        "Protein > 1.8 g",
        "Sodium > 90 mg"
    ],
    "n": "Oatmeal Cherry Walnut Cookies",
    "a": "Chef Doogie",
    "r": "0",
    "s": 48,
    "des": "\"Old-fashioned caramelized sugar oatmeal cookies like my Grandma in Abilene, Kansas used to make, updated with Dried Tart Cherries and crunchy walnuts. Yumm!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nIn a mixer bowl, combine the white sugar, brown sugar and shortening. Beat until smooth and creamy. Add the eggs one at a time mixing well after each one. Beat mixture until well combined.\nMix in the milk, baking soda, baking powder, salt, cinnamon and vanilla to the egg mixture. Beat for one minute. Add the flour and mix until incorporated. Add the walnuts and mix again. Add the oats one cup at a time, mixing well after each addition. Stir in the dried tart cherries and mix just until they are distributed evenly.\nDrop heaping tablespoonfuls of batter about 2 inches apart on ungreased cookie sheets. Do not shape them, they will spread evenly during the baking process. Bake at 350 degrees F (175 degrees C) for 12 to 13 minutes. The tops of the cookies should just turn a light golden brown. Remove the cookies from the oven and let sit on the sheets for about 5 minutes before moving the cookies to cooling racks. Let cookies cool to room temperature than place in airtight containers for storage.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2641418.jpg",
    "o": "",
    "st": "allrecipes"
}