{
    "id": 11213,
    "old_rating": "4.42975",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter",
        "1 1/2 cups confectioners' sugar",
        "1 egg",
        "1 teaspoon vanilla extract",
        "2 1/2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1 teaspoon cream of tartar",
        "1/4 teaspoon salt"
    ],
    "nut": [
        "Calories > 37 kcal",
        "Carbs > 4.4 g",
        "Cholesterol > 7 mg",
        "Fat > 2 g",
        "Protein > 0.4 g",
        "Sodium > 34 mg"
    ],
    "n": "Classic Butter Cookies I",
    "a": "Sally",
    "r": "0",
    "s": 96,
    "des": "\"Great tasting buttery cookies with many options for baking.\"",
    "ins": "Cream the butter in a large mixing bowl, gradually add the sugar and beat until light and fluffy. Beat in the egg and vanilla.\nCombine the flour, baking soda, cream of tartar and salt. Add the flour mixture to the creamed mixture.\nFor all the types of cookie shapes preheat oven to 400 degrees F (205 degrees C) before baking. Bake all cookies on an ungreased cookie sheet.\nShape the dough in one of the following ways: Roll out the chilled dough and cut with cookie cutters. Sprinkle with colored sugar if desired. Bake for 6 to 8 minutes.\nOR: Form dough into logs 2 inches in diameter and slice 1/8 inch thick when chilled. Sprinkle with chopped nuts, if desired, and bake for 7 to 9 minutes.\nOR:  Shape into balls and bake. Balls may be rolled in sugar mixed with cinnamon if desired. Bake for 10 to 12 minutes.\nOR:  Put unchilled dough into a cookie press and press into desired shapes chill shaped cookies before baking. Bake chilled cookies for 8 to 10 minutes.\nOR:  Add 1 cup chopped walnuts and 1/2 cup flour to dough. Chill then shape into balls and bake for 8 to10 minutes. Roll still warm cookies in confectioners' sugar. Once cool sprinkle chilled cookies with more confectioners' sugar.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2972949.jpg",
    "o": "",
    "st": "allrecipes"
}