{
    "id": 112281,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 cups macadamia nut pieces",
        "1 cup unsweetened coconut flakes",
        "2 (9 inch) refrigerated pie crusts",
        "1 1/2 cups semi-sweet chocolate chips",
        "3 eggs, slightly beaten",
        "2 teaspoons vanilla extract",
        "1 cup light corn syrup",
        "1 cup white sugar",
        "3 tablespoons margarine or butter, melted"
    ],
    "nut": [
        "Calories > 707 kcal",
        "Carbs > 82.3 g",
        "Cholesterol > 56 mg",
        "Fat > 42.9 g",
        "Protein > 7.2 g",
        "Sodium > 273 mg"
    ],
    "n": "Hawaiian Chocolate Macadamia Nut Tart",
    "a": "BRANDY20001",
    "r": "0",
    "s": 10,
    "des": "\"The niu (coconut) really adds to this easy, modern, Hawaiian desert.  This is frequently served in lieu of pecan pie during the holidays.  It can be served warm with vanilla ice cream or cold with whipping cream, and can be made a day in advance of your Hawaiian feast!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nToast macadamia nut pieces, and coconut flakes in separate pans in the preheated oven until golden brown, about 8 minutes. Remove to cool.\nPress one of the pie crusts onto the bottom of a 12 to 14-inch fluted tart pan. Cut the remaining pie crust into strips, and use it to fill in the edges of the tart pan, ensuring that the crust is completely sealed. Gently press the chocolate chips into the pie crust, and set aside.\nIn a large bowl, whisk together the eggs, vanilla, and corn syrup until smooth. Stir in the sugar, margarine, macadamia nuts, and coconut flakes. Pour over pie crust.\nBake in preheated oven until a knife inserted halfway between the center and the edge of the crust comes out clean, 50 to 55 minutes. Cool completely on a wire rack.",
    "pt": "10 m",
    "ct": "58 m",
    "tt": "1 h ",
    "i": "2892514.jpg",
    "o": "",
    "st": "allrecipes"
}