{
    "id": 11237,
    "old_rating": "4.73333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups butter",
        "2 cups brown sugar",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "1 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "3 cups all-purpose flour",
        "2/3 cup chopped pecans",
        "2 teaspoons vanilla extract",
        "3 1/2 cups confectioners' sugar",
        "1/2 cup hot water"
    ],
    "nut": [
        "Calories > 144 kcal",
        "Carbs > 19.2 g",
        "Cholesterol > 22 mg",
        "Fat > 7.2 g",
        "Protein > 1 g",
        "Sodium > 93 mg"
    ],
    "n": "Brown Butter Cookies",
    "a": "Heather",
    "r": "0",
    "s": 60,
    "des": "\"Using butter (NOT margarine) is essential for the success of this rich, but highly addictive cookie!  You may need as little as 3 cups confectioners' sugar for the icing; just stop adding it when you've reached the desired consistency.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat butter over medium heat for 5 minutes or so, until it turns nut brown in color. The foaming and bubbling is part of the browning process, but watch it carefully so that you don't burn the butter. Remove from heat, and cool slightly. Reserve 1/2 cup of the butter for the frosting.\nPour remaining browned butter into a large mixing bowl. Beat browned butter with brown sugar until the butter is no longer hot. Mix in eggs, 2 teaspoons vanilla, baking soda, baking powder, and salt. Beat thoroughly.  Mix in flour and chopped pecans. Drop tablespoons of dough onto ungreased baking sheets.\nBake for 10 minutes in the preheated oven, or until light brown around the edges. Cool.\nIn a medium bowl, mix the reserved 1/2 cup browned butter with 2 teaspoons vanilla, confectioners' sugar, and hot water. Beat until smooth, and use to frost cooled cookies.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "744345.jpg",
    "o": "4507922.jpg,4425173.jpg,4302581.jpg,4299910.jpg,4096005.jpg,4004079.jpg",
    "st": "allrecipes"
}