{
    "id": 112351,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 ounces sliced bacon",
        "16 meaty squirrel legs",
        "Salt and pepper, to taste",
        "1/2 cup all-purpose flour",
        "1/2 cup cornstarch",
        "2 eggs",
        "2 tablespoons milk",
        "1 cup thinly sliced onions",
        "2 tablespoons minced garlic",
        "2 tablespoons minced shallot",
        "1 cup chicken stock",
        "1 bay leaf",
        "1 teaspoon minced fresh thyme"
    ],
    "nut": [
        "Calories > 416 kcal",
        "Carbs > 33.8 g",
        "Cholesterol > 203 mg",
        "Fat > 14.2 g",
        "Protein > 36 g",
        "Sodium > 590 mg"
    ],
    "n": "Squirrel Legs",
    "a": "whitetaildeer17",
    "r": "0",
    "s": 4,
    "des": "\"This is my own recipe for the greatest tasting squirrel legs. This gourmet recipe makes a great main dish on any occasion.\"",
    "ins": "Cook the bacon in a large skillet over medium heat until crispy; drain on paper towels, cool and crumble; set aside.  Reserve grease in the skillet.\nWhile the bacon is cooking, season the squirrel with salt and pepper, and set aside.  In a resealable bag, mix together flour and cornstarch.  Whisk together eggs and milk until smooth.  Dredge the squirrel in the flour mixture, shake off excess flour, then dip into egg mixture, shaking off excess egg.  Dredge again in the flour, and set aside.\nPour all but two tablespoons of bacon fat from the skillet, and place over medium-high heat.  When the fat is hot, cook the squirrel pieces until golden brown, 3 to 4 minutes per side, then set aside.\nTurn heat down to medium; add the onions, garlic, and shallot and cook for 3 minutes, until soft.  Pour in the chicken stock, and add the bay leaf and minced thyme.  Increase heat to medium-high and bring to a simmer.  Add the squirrel, return to a simmer, cover, then turn heat to medium-low.  Cook until very tender, about 30 minutes.\nRemove the squirrel legs to a serving platter and spoon the sauce over them. Sprinkle with crumbled bacon and serve.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}