{
    "id": 11244,
    "old_rating": "4.125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2/3 cup almonds",
        "1 3/4 cups cake flour",
        "2 teaspoons ground ginger",
        "1 teaspoon baking powder",
        "1 cup unsalted butter",
        "1 cup packed brown sugar",
        "6 tablespoons white sugar",
        "2 tablespoons orange zest",
        "1 egg yolk",
        "1/2 teaspoon vanilla extract",
        "2/3 cup coarsely chopped pistachios"
    ],
    "nut": [
        "Calories > 265 kcal",
        "Carbs > 29.8 g",
        "Cholesterol > 38 mg",
        "Fat > 15.4 g",
        "Protein > 3.6 g",
        "Sodium > 52 mg"
    ],
    "n": "Ginger Biscotti with Pistachios",
    "a": "J. Storm",
    "r": "0",
    "s": 18,
    "des": "\"Try substituting macadamia nuts for pistachios.\"",
    "ins": "Grease and flour one large baking sheet.\nFinely grind the almonds with the flour, ginger and baking powder in a food processor.\nBeat the butter, brown sugar and white sugar until light and well blended. Add the grated orange peel, egg and vanilla and beat well. Mix in the dry ingredients and beat until just blended. Stir in the pistachios.\nDivide the dough in half. Using floured hands, roll each half on a lightly floured surface into a 1/2 inch log. Arrange logs on the prepared baking sheet, spacing 4 inches apart. Cover with plastic wrap and refrigerate for about 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Brush dough logs with beaten egg and sprinkle with 2 teaspoons white sugar. Bake logs until deep golden brown and firm to the touch, about 30 minutes. Let logs cool for 10 minutes.\nReduce oven temperature to 300 degrees F (150 degrees C).\nUsing a serrated knife cut logs crosswise into 1/2 inch thick slices. Arrange sliced cut side down on baking sheet. Bake at 300 degrees F (150 degrees C) until deep golden on top, about 12 minutes. Turn biscotti over and bake other side until deep golden, about 12 minutes. Transfer biscotti to a rack and cool completely. Store in airtight container at room temperature.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "21481.jpg",
    "o": "",
    "st": "allrecipes"
}