{
    "id": 11279,
    "old_rating": "4.14286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/4 cups all-purpose flour",
        "1/4 teaspoon salt",
        "1 cup white sugar",
        "3/4 cup butter, softened",
        "1 egg",
        "1 teaspoon vanilla extract",
        "1 teaspoon almond extract",
        "assorted colors of paste food coloring",
        "4 tablespoons prepared vanilla frosting",
        "1/4 cup yellow decorator sugar"
    ],
    "nut": [
        "Calories > 120 kcal",
        "Carbs > 17 g",
        "Cholesterol > 18 mg",
        "Fat > 5.3 g",
        "Protein > 1.2 g",
        "Sodium > 61 mg"
    ],
    "n": "Rainbows",
    "a": "DARBYANNE",
    "r": "0",
    "s": 30,
    "des": "\"A 4-colored cookie dough that is shaped into a log and sliced to form rainbows.\"",
    "ins": "Cream the butter and sugar together until light and fluffy. Beat in the egg, vanilla and almond extracts. Gradually add the flour and salt. Beat at low speed until well blended.\nDivide dough into 10 equal sections. Combine 4 sections of he dough with red paste-type coloring until smooth. Combine 3 sections of the dough with green coloring until smooth. Combine 2 sections of the dough with yellow coloring until smooth, and combine remaining dough with blue coloring. Wrap each section of dough in plastic wrap and refrigerate for 30 minutes.\nShape blue dough into an 8-inch log. Shape yellow dough into 8x3-inch rectangle; place on waxed paper. Place blue log in center of yellow rectangle and fold yellow edges up around blue log, pinching to form seal. Roll to form smooth log. Roll green dough into 8x5-inch rectangle. Place yellow log in center, pinch edges of green to seal; roll smooth. Roll red dough into 8x7-inch rectangle. Place green log in center, pinch edges of red to seal and roll smooth. Wrap in plastic wrap and refrigerate 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease or line baking sheets with parchment paper.\nCut log in half length-wise. Cut each half into 1/4 inch slices. Place slices 1 inch apart on prepared baking sheets.\nBake at 350 degrees F (175 degrees C) for 8 to 12 minutes. (Do not brown.) Cool on cookie sheets 1 minute. Remove to wire racks and let cool completely. Pipe small amount of white frosting on bottom corner of each cookie to resemble a cloud. Sprinkle with yellow decorating sugar. Let stand until frosting is set.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "9510.jpg",
    "o": "",
    "st": "allrecipes"
}