{
    "id": 112868,
    "old_rating": "4.6087",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 red bell peppers, seeded and cut into quarters",
        "1 (32 ounce) carton chicken broth",
        "1 large potato, peeled and coarsely chopped",
        "1 quart half-and-half cream",
        "1 teaspoon salt",
        "1/4 teaspoon cayenne pepper to taste",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon dried basil",
        "1 pound cooked crabmeat, flaked"
    ],
    "nut": [
        "Calories > 352 kcal",
        "Carbs > 19.5 g",
        "Cholesterol > 121 mg",
        "Fat > 19.8 g",
        "Protein > 23.7 g",
        "Sodium > 1458 mg"
    ],
    "n": "Roasted Red Pepper and Crab Soup",
    "a": "Gail L. Harris",
    "r": "0",
    "s": 6,
    "des": "\"Although this is not a typical traditional holiday recipe, it has become a Christmas day buffet favorite in our family. Several years ago, we decided to forgo our traditional big sit-down dinner for a buffet because of everyone's increasingly different visiting/family obligations on that day. Everyone could eat whenever or if they chose to. I'd had this soup, which I loved, at several different restaurants over time. Through trial and error, I came up with my own recipe, which has been a hit.  I serve it with a dollop of creme fraiche.\"",
    "ins": "Set the oven to broil, and preheat for 5 minutes.\nPlace the red bell pepper quarters skin-side up on a broiler pan or baking sheet.  Broil until the skins have blackened, then place them in a brown paper bag, or in a covered bowl and allow them to steam for approximately 10 minutes to loosen the skins.\nOnce the skins have loosened, peel them off and discard.  Coarsely chop the peeled, roasted peppers, and place into a large saucepan along with the chicken broth and chopped potato.  Bring to a boil over high heat, then add the half-and-half, salt, cayenne pepper, garlic powder, and basil.  Return to a boil, then reduce heat to medium and simmer for 45 minutes.\nOnce the potatoes have softened, puree the soup in batches in a blender until smooth.  Pour the pureed soup into another saucepan and stir in the crab.  Heat over medium heat to warm through, about 5 minutes.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "75181.jpg",
    "o": "",
    "st": "allrecipes"
}