{
    "id": 11361,
    "old_rating": "4.49618",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups white sugar",
        "1 cup butter, softened",
        "15 ounces ricotta cheese",
        "2 teaspoons vanilla extract",
        "2 eggs",
        "4 cups all-purpose flour",
        "2 tablespoons baking powder",
        "1 teaspoon salt",
        "1 1/2 cups confectioners' sugar",
        "3 tablespoons milk"
    ],
    "nut": [
        "Calories > 180 kcal",
        "Carbs > 27.6 g",
        "Cholesterol > 28 mg",
        "Fat > 6.5 g",
        "Protein > 3.2 g",
        "Sodium > 202 mg"
    ],
    "n": "Ricotta Cheese Cookies",
    "a": "LindaK",
    "r": "0",
    "s": 36,
    "des": "\"These soft Italian-style cookies are a hit with everyone. The ricotta  keeps them moist, and the recipe yields a large batch, which is great  since the baked cookies freeze so well. Do not freeze the unbaked  dough.  You can decorate them with chopped candied cherries, colored sugar or candy sprinkles.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nIn a large bow, with the mixer a low speed, beat the sugar and butter until combined. Increase speed to high and beat until light and fluffy (about 5 minutes). Reduce speed to medium and beat in the ricotta, vanilla and eggs.\nReduce speed to low. Add flour, baking powder and salt; beat until dough forms.\nDrop dough by level tablespoons, about 2 inches apart; onto the prepared baking sheets. Bake at 350 degrees F (175 degrees C) for about 15 minutes or until cookies are very lightly golden (cookies will be soft). With spatula, remove cookies to wire rack to cool.\nWhen cookies are cool, prepare icing. In small bowl, stir confectioners' sugar and milk until smooth. With small spreader, spread icing on cookies; place a candied cherry piece on top of each cookie or sprinkle with colored sugar or candy sprinkles.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "701628.jpg",
    "o": "4479343.jpg,4079950.jpg,3975714.jpg,3837058.jpg,3596565.jpg,3403323.jpg",
    "st": "allrecipes"
}