{
    "id": 11468,
    "old_rating": "4.38462",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/3 cup butter",
        "1/2 cup shortening",
        "3/4 cup white sugar",
        "1 egg",
        "1 tablespoon milk",
        "1 teaspoon vanilla extract",
        "3 drops red food coloring",
        "1/3 cup mini semi-sweet chocolate chips",
        "1 1/2 cups confectioners' sugar",
        "2 tablespoons water",
        "3 drops green food coloring"
    ],
    "nut": [
        "Calories > 223 kcal",
        "Carbs > 31.1 g",
        "Cholesterol > 19 mg",
        "Fat > 10.5 g",
        "Protein > 2 g",
        "Sodium > 134 mg"
    ],
    "n": "Watermelon Cookie",
    "a": "Linda",
    "r": "0",
    "s": 18,
    "des": "\"Sugar cookies that look like little slices of watermelon!!\"",
    "ins": "Combine flour, baking powder and salt in a small mixing bowl.\nBeat butter and shortening with an electric mixer at medium speed until fluffy; gradually add sugar, beating well.  Stir in egg, milk, and vanilla. Gradually add flour mixture  to creamed mixture, mixing well. Add a small amount of red food coloring to color dough as desired, beating until blended.  Shape dough into a ball; cover and chill at least 3 hours.\nPreheat oven to 375 degrees F (190 degrees C).\nDivide dough in half; store one portion in refrigerator.  Roll remaining portion to 1/4 inch thickness on a lightly floured surface. Cut dough with a 3-inch round cookie cutter; cut circle in half.  Place on an ungreased cookie sheet.  Press several chocolate mini chocolate chips in each cookie. Repeat with remaining dough.\nBake for 8 to 10 minutes (do not brown).  Cool on wire racks.\nMake frosting: Combine powdered sugar and water, mixing until smooth.  Add a small amount of green food coloring, mixing until blended.  Dip round edge of each cookie in green frosting, and place cookie on wax paper until frosting is firm.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "93990.jpg",
    "o": "4503097.jpg,3712607.jpg,1319335.jpg,916381.jpg,540379.jpg,534945.jpg",
    "st": "allrecipes"
}