{
    "id": 11567,
    "old_rating": "4.19048",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "1/2 cup confectioners' sugar",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1 cup butter",
        "7 tablespoons ice water",
        "2 tablespoons milk",
        "25 individually wrapped caramels, unwrapped",
        "1/2 cup flaked coconut",
        "1 egg",
        "1 tablespoon water"
    ],
    "nut": [
        "Calories > 185 kcal",
        "Carbs > 23.4 g",
        "Cholesterol > 29 mg",
        "Fat > 9.3 g",
        "Protein > 2.5 g",
        "Sodium > 133 mg"
    ],
    "n": "Pasteles - Argentinean Caramel Filled Crescents",
    "a": "CLIPSET",
    "r": "0",
    "s": 24,
    "des": "\"Argentinean caramel-filled crescents. A sweet treat that's worth the effort.\"",
    "ins": "In a large bowl, stir together the flour, confectioners' sugar, baking powder, and salt. Cut in the butter with a pastry blender or by hand until mixture forms pea sized lumps. Add ice water, 1 tablespoon at a time; tossing the mixture with a fork until dough comes together. Divide dough into 2 pieces, cover, and refrigerate for at least 1 hour.\nIn a small saucepan, combine the caramels and milk over low heat, stirring constantly. Stir in the coconut , remove from heat, and allow to cool.\nPreheat oven to 400 degrees F (200 degrees C). Grease cookie sheets.\nOn a lightly floured surface, roll out dough to 1/8 inch thickness. Cut out circles with a 3 inch round cookie cutter. Beat the egg and 1 tablespoon of water together in a cup. Moisten the edge of the cookie round with the egg mixture, and place 1/2 teaspoon of the caramel mixture in the center.  Fold the circle over in half and press the edges with a fork to seal.\nPlace the cookies onto the prepared baking sheet and brush the tops with the egg mixture. With a knife cut three slits across the top of each cookie. Bake 15 to 20 minutes, until golden brown. Remove cookies to wire racks to cool. Store at room temperature. These cookies do not freeze well.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "75048.jpg",
    "o": "",
    "st": "allrecipes"
}