{
    "id": 11581,
    "old_rating": "4.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter, room temperature",
        "2 1/2 cups white sugar",
        "2 teaspoons vanilla extract",
        "8 eggs",
        "7 teaspoons baking powder",
        "8 cups all-purpose flour",
        "2 teaspoons anise extract",
        "3 teaspoons anise seed",
        "1 cup chopped walnuts (optional)",
        "2 egg yolks, lightly beaten"
    ],
    "nut": [
        "Calories > 145 kcal",
        "Carbs > 21.6 g",
        "Cholesterol > 40 mg",
        "Fat > 5.3 g",
        "Protein > 3 g",
        "Sodium > 89 mg"
    ],
    "n": "Anise Walnut Biscotti",
    "a": "Michele Flannery",
    "r": "0",
    "s": 60,
    "des": "\"This recipe was given to me by my Grandmother Nancy (Saccuzzo). She was a great little Italian Nana. She taught me how to cook and was an inspiration in my life. Enjoy with your favorite red wine or coffee.\"",
    "ins": "Preheat oven to 375 degrees F ( 190 degrees C ).\nIn a large bowl, cream together butter and sugar  Gradually add the vanilla and eggs while mixing. Sift together the flour and baking powder; stir into the egg mixture. For plain biscotti, do not add anything else (see Cook's Note). Stir in the anise extract and anise seed. Add walnuts if desired.\nWet or grease your hands and shape dough out into 4 logs as long as your baking sheet will allow. Pat each one to about 3/4 inch in height, and 3 inches wide. Brush with beaten egg yolks.\nBake in the preheated oven for 15 minutes, until golden brown. Slice logs at an angle, cutting pieces into 1/2 to 3/4-inch wide cookies. Place slices back onto the cookie sheet, standing upright, if possible; leave a gap between the slices. Return to the oven and bake until cookies are dry and lightly toasted, about 10 minutes more.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "598425.jpg",
    "o": "",
    "st": "allrecipes"
}