{
    "id": 12020,
    "old_rating": "4.07692",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound spaghetti",
        "3/4 cup margarine",
        "1 onion, chopped",
        "1 (28 ounce) can whole peeled tomatoes",
        "1/2 teaspoon salt",
        "3 tablespoons all-purpose flour",
        "1 cup milk",
        "1 cup heavy whipping cream",
        "15 large black olives, halved",
        "1 (4.5 ounce) can sliced mushrooms",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 729 kcal",
        "Carbs > 71.7 g",
        "Cholesterol > 63 mg",
        "Fat > 42.4 g",
        "Protein > 16.9 g",
        "Sodium > 968 mg"
    ],
    "n": "Veggie Spaghetti",
    "a": "Nancy R",
    "r": "0",
    "s": 6,
    "des": "\"Both kids and adults like this one. You probably have most of the ingredients in your pantry already...and if you don't have cream, use 2 cups of milk. A great dish to freeze and serve at a later time. If you like a spicier tomato sauce, feel free to add your own Italian spices: garlic, basil, oregano, green pepper, etc ...\"",
    "ins": "In a large skillet melt 1/2 cup margarine over medium heat. Stir in onion, chopped tomatoes, and salt; simmer for 1/2 hour.\nMeanwhile, in a large pot with boiling salted water cook pasta until al dente. Drain. Place cooked spaghetti in the bottom of a greased 9x13 inch baking dish.\nIn a small saucepan melt 3 tablespoons of margarine over medium heat. Take off heat and quickly stir in 3 tablespoons of flour to make a paste. Return to heat and slowly stir in the milk. Cook on low, stirring often, until thick. Add heavy cream and continue to cook until slightly thickened.\nPour simmered tomato mix over top of spaghetti. Sprinkle on olive halves and mushrooms. Pour cream sauce on top. Sprinkle with grated Parmesan cheese.\nBake in a preheated 350 degree F (175 degrees C) oven for 30 minutes.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2532042.jpg",
    "o": "",
    "st": "allrecipes"
}