{
    "id": 12112,
    "old_rating": "4.64336",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups all-purpose flour",
        "1 teaspoon salt",
        "2/3 cup shortening",
        "6 tablespoons cold water"
    ],
    "nut": [
        "Calories > 132 kcal",
        "Carbs > 11.9 g",
        "Cholesterol > 0 mg",
        "Fat > 8.7 g",
        "Protein > 1.6 g",
        "Sodium > 146 mg"
    ],
    "n": "Pie Crust I",
    "a": "Brenda",
    "r": "0",
    "s": 16,
    "des": "\"This recipe can be halved to make one crust.  Note: use 3 - 4 tablespoons of cold water when making only one crust.\"",
    "ins": "Mix flour and salt in a large bowl.  Cut in shortening with a pastry blender until mixture is completely blended and appears crumbly.\nMix in water, 1 tablespoon at a time, by lightly tossing with a fork.  Add only enough water to form mixture into a ball.  The dough will be sticky and tough if to much water is added, and it will crack and tear when rolled if too little is added.\nDivide the dough into 2 balls, and roll each out into a circle 1 inch larger than the inverted pie plate.\nFollow these directions for a filled pie.  Fold one circle of dough in half, and gently lift.  Place into pie plate and unfold.  Add filling to pie plate.  Fold second circle of dough in half.  Gently place over filling, and unfold.  With a table knife, cut off excess crust evenly so that 1/2  to 1 inch  extends beyond the edge of the pie plate.  Fold under the excess dough so that it is even with the edge of the pie plate.  Flute the edge of the crust.  Cut slits in top crust for steam to escape.\nFollow these directions for 2 prebaked pie shells.  Fold circle of dough in half, and gently lift.  Place into pie plate and unfold.  Either prick the entire surface of dough with a fork, or weight the bottom of the crust with pie weights while baking.  Pie weights can be uncooked rice, dried beans, small clean pebbles, or small balls sold as pie weights.",
    "pt": "20 m",
    "ct": "",
    "tt": "",
    "i": "4507347.jpg",
    "o": "1061356.jpg,763831.jpg,637125.jpg,448148.jpg,439634.jpg,439633.jpg",
    "st": "allrecipes"
}