{
    "id": 12126,
    "old_rating": "4.80251",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 egg whites",
        "1 1/4 cups white sugar",
        "1 teaspoon vanilla extract",
        "1 teaspoon lemon juice",
        "2 teaspoons cornstarch",
        "1 pint heavy cream",
        "6 kiwi, peeled and sliced"
    ],
    "nut": [
        "Calories > 373 kcal",
        "Carbs > 42.1 g",
        "Cholesterol > 82 mg",
        "Fat > 22.3 g",
        "Protein > 3.7 g",
        "Sodium > 52 mg"
    ],
    "n": "Easy Pavlova",
    "a": "Rosina",
    "r": "0",
    "s": 8,
    "des": "\"In this elegant dessert, a crisp white meringue layer is filled with whipped cream and fresh fruit. To keep your meringue from being flat and grainy, try beating egg whites until stiff but not dry. Overbeaten egg whites lose volume and deflate when folded into other ingredients. Also, when beating in sugar, beat in about 1 tablespoon at a time, beating well between each addition. Then beat until meringue is thick, white and glossy. Be absolutely sure not a particle of grease or egg yolk gets into the whites.\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C). Line a baking sheet with parchment paper. Draw a 9-inch circle on the parchment paper.\nIn a large bowl, beat egg whites until stiff but not dry. Gradually add in the sugar, about 1 tablespoon at a time, beating well after each addition. Beat until thick and glossy. Gently fold in vanilla extract, lemon juice, and cornstarch.\nSpoon mixture inside the circle drawn on the parchment paper. Working from the center, spread mixture toward the outside edge, building edge slightly. This should leave a slight depression in the center.\nBake for 1 hour. Cool on a wire rack.\nIn a small bowl, beat heavy cream until stiff peaks form; set aside. Remove the paper, and place meringue on a flat serving plate. Fill the center of the meringue with whipped cream, and top with kiwifruit slices.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "2 h",
    "i": "4527154.jpg",
    "o": "4527154.jpg,4507321.jpg,4504065.jpg,4488003.jpg,4486626.jpg,4486625.jpg",
    "st": "allrecipes"
}