{
    "id": 12138,
    "old_rating": "4.77778",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 egg whites",
        "1/8 teaspoon cream of tartar",
        "1 cup white sugar",
        "1 tablespoon cornstarch",
        "2 teaspoons distilled white vinegar",
        "1 1/4 cups heavy cream, chilled",
        "1 teaspoon vanilla extract",
        "2 teaspoons confectioners' sugar",
        "4 passion fruits"
    ],
    "nut": [
        "Calories > 254 kcal",
        "Carbs > 30 g",
        "Cholesterol > 51 mg",
        "Fat > 13.8 g",
        "Protein > 3.7 g",
        "Sodium > 58 mg"
    ],
    "n": "Pavlova Deluxe",
    "a": "Rosina",
    "r": "0",
    "s": 8,
    "des": "\"A pavlova is a fresh fruit dessert with a meringue crust and cream filling. The 'deluxe' in this recipe refers to the passion fruit, which can be pricey. Passion fruit is a round, purple fruit resembling a kiwi, but larger. When ripe it appears shriveled. You can also use kiwi, about 8, instead of passion fruit.\"",
    "ins": "Preheat oven to 400 degrees F (205 degrees C).  Grease interior of 8 inch springform pan and dust lightly with cornstarch.\nBeat egg whites, preferably in a glass or ceramic bowl, until stiff and glossy.  Make sure egg whites have absolutely no contact with grease (fresh or residual), or even a speck of yolk.  Combine cream of tartar, white sugar, and cornstarch; gradually beat in to the egg whites.  Sprinkle vinegar over egg white mixture, then fold it in very gently.\nPile meringue into prepared pan.  Spread to the sides leaving a slight depression in the center.  Place in preheated oven.  Close the oven door, and immediately turn oven down to 250 degrees F (120 degrees C).  Bake for 75 to 90 minutes.  Open oven door, but leave meringue in the oven for  15 more minutes.  Remove meringue to a draft free spot.  Very carefully remove rim of springform pan, and allow meringue to cool completely.  There may be a slight sinking in the center.  Carefully remove meringue from pan base, and place on serving platter.\nWhip cream, vanilla extract, and confectioners' sugar until thick and firm.  Gently spread over the meringue.\nRemove the pulp from the passion fruit, and spoon over cream.  If using kiwi, peel and slice the fruit; arrange slightly overlapping slices in a pleasing design.  Chill until serving time.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "8033.jpg",
    "o": "772705.jpg,772690.jpg,772688.jpg,636368.jpg,432716.jpg,369200.jpg",
    "st": "allrecipes"
}