{
    "id": 12162,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup white sugar",
        "2 tablespoons all-purpose flour",
        "1 teaspoon salt",
        "2 cups milk",
        "4 egg yolks",
        "2 tablespoons unsalted butter",
        "2 teaspoons vanilla extract",
        "1 1/2 cups raisins, coarsely chopped",
        "1/4 teaspoon cream of tartar",
        "6 tablespoons white sugar",
        "3 egg whites",
        "1 (9 inch) pie crust, baked and cooled"
    ],
    "nut": [
        "Calories > 405 kcal",
        "Carbs > 71.6 g",
        "Cholesterol > 115 mg",
        "Fat > 11.6 g",
        "Protein > 6.6 g",
        "Sodium > 446 mg"
    ],
    "n": "Raisina (Funeral Pie)",
    "a": "Kevin Ryan",
    "r": "0",
    "s": 8,
    "des": "\"This is the classic Amish funeral pie. It is quickly made anytime of the year.\"",
    "ins": "Beat the yolks in a bowl on medium speed for about 2 minutes.  Whisk together 1 cup of sugar, the flour and the salt.  Slowly add the sugar and flour mixture to the yolks.  Beat this mixture until it falls in ribbons from the beater blade.  Scald the milk; add it very slowly beating all the time.\nPour yolk mixture into a saucepan. Add the butter or margarine to the saucepan. Cook while stirring, over medium heat, until the custard thickens; this will take 3 to 5 minutes.  Do not let boil.   Remove from heat, and add the vanilla and the raisins.  Cover immediately with plastic wrap.\nBeat the egg whites to stiff peaks.  Beat in, slowly, 6 tablespoons sugar and cream of tartar.  Make sure the filling is still hot, and pour filling into the crust. Top right away with the meringue; spread to the edges.\nBake at 325 degrees F (165 degrees C) for 20 to 25 minutes, or until browned.  Cool pie on wire rack.  Serve warm or at room temperature.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "256549.jpg",
    "o": "",
    "st": "allrecipes"
}