{
    "id": 12360,
    "old_rating": "4.39416",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups all-purpose flour",
        "4 tablespoons unsalted butter, cubed",
        "5 tablespoons shortening",
        "1/2 teaspoon salt",
        "3 tablespoons ice water"
    ],
    "nut": [
        "Calories > 207 kcal",
        "Carbs > 17.9 g",
        "Cholesterol > 15 mg",
        "Fat > 14 g",
        "Protein > 2.5 g",
        "Sodium > 147 mg"
    ],
    "n": "Flaky Food Processor Pie Crust",
    "a": "Charlotte",
    "r": "0",
    "s": 8,
    "des": "\"This is a basic white flaky pie crust, made in the food processor.  The secret to good crust is to have everything very cold and to handle it as little as possible.  Use frozen or almost frozen lard, butter, and/or shortening as your fat and ice water, and then chill the dough well before rolling.   Process the dough as little as possible and use only the amount of water needed to allow YOU to form it into a ball, not the machine.\"",
    "ins": "Measure the flour into the processor with the regular blade attached.  Add the unsalted butter, cut into cubes, and shortening, cut into cubes. (Your fat should be frozen or very cold. You may vary the proportions, or use some lard, but the total should be 9 tablespoons.) Add salt.  Pulse three times with three counts per pulse to lightly mix the ingredients.\nWith the motor running, pour ice water into the workbowl just until the dough just starts to get noticeably crumbly.  Don't wait until it is a big clump or it will be way too wet and will turn out tough.\nStop the machine, dump the crumbly dough into a bowl, and gather the dough into a ball with your hand.  you can squeeze it a bit to make it stick together. If it just won't form a ball, add a tiny bit more water.  (Note that if you are making crust in the food processor, you will use less water than most recipes call for.)\nWrap your dough ball in wax paper or plastic wrap and chill it about 30 minutes in the refrigerator.  Roll it out on a cool surface if you can.  Then follow your pie recipe for baking.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2652538.jpg",
    "o": "1079322.jpg,1069102.jpg,925349.jpg,871658.jpg,861923.jpg,241256.jpg",
    "st": "allrecipes"
}