{
    "id": 12374,
    "old_rating": "4.35714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (11 ounce) package pie crust mix",
        "1 (6 ounce) package Canadian-style bacon",
        "1 cup shredded Cheddar cheese",
        "4 eggs",
        "1/4 cup milk",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 660 kcal",
        "Carbs > 42.5 g",
        "Cholesterol > 238 mg",
        "Fat > 41.8 g",
        "Protein > 27.9 g",
        "Sodium > 1430 mg"
    ],
    "n": "Bacon and Egg Breakfast Tarts",
    "a": "JJOHN32",
    "r": "0",
    "s": 4,
    "des": "\"Perfect selection for a brunch, but also convenient enough for serving on a weekday. Instead of Canadian bacon, try using 1/2 cup diced cooked ham or 1/2 cup crumbled cooked bacon. Place 2 tablespoons of meat into each pastry cup.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nPrepare pastry for a one crust pie as directed on package.  Divide pastry into 4 equal parts.  Roll each part into a 6 inch circle on a well floured, cloth covered board with a floured, cloth covered rolling pin.  Fit pastry over backs of large muffin cups (3 x 1 1/2 inch), or 6 ounce custard cups; make pleats so pastry will fit closely.  If using individual pie pans or tart pans, cut circles 1 inch larger than inverted pans, and fit into pans.  Prick surface.  Place tarts on an ungreased cookie sheet.\nBake until light brown, about 8 to 10 minutes.  Cool 5 minutes, and carefully remove from cups.  Reduce oven temperature to 350 degrees F (175 degrees C).\nPlace 2  bacon slices in the bottom of each pastry cup.  Sprinkle cheese over the meat, making slight well in centers.  Break 1 egg into each.  Add 1 tablespoon milk into each tart.  Sprinkle with nutmeg and pepper.  Place tarts on an ungreased cookie sheet\nBake until eggs are soft cooked, about 15 to 20 minutes.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}