{
    "id": 12384,
    "old_rating": "4.62708",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Pastry for a Double-Crust Pie:",
        "2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "2/3 cup shortening, chilled",
        "6 tablespoons cold water",
        "Three-Berry Filling:",
        "1 cup fresh strawberries, halved",
        "2 cups fresh raspberries",
        "1 1/2 cups fresh blueberries",
        "1/2 cup white sugar",
        "3 tablespoons cornstarch"
    ],
    "nut": [
        "Calories > 361 kcal",
        "Carbs > 48 g",
        "Cholesterol > 0 mg",
        "Fat > 17.7 g",
        "Protein > 3.8 g",
        "Sodium > 147 mg"
    ],
    "n": "Three Berry Pie",
    "a": "Jenn Hall",
    "r": "0",
    "s": 8,
    "des": "\"In this recipe you can use blackberries instead of raspberries. Frozen fruit may be used instead of fresh.\"",
    "ins": "Combine the flour and salt. Using a pastry blender, cut in the shortening until the pieces are the size of small peas. Sprinkle 1 tablespoon of the water over part of the mixture, then gently toss with a fork. Push moistened portion to the side of the bowl. Repeat, using 1 tablespoon of water at a time, until all is moistened. Divide the dough in half. Form each half into a ball and flatten slightly. Wrap in plastic and refrigerate for at least 30 minutes.\nTransfer one piece of dough to a lightly floured surface. Roll the dough from the center to the edges to form a 12-inch circle. Wrap the crust around the rolling pin. Unroll it onto a 9-inch pie plate. Ease the crust into the pie plate, being careful not to stretch it. Trim the bottom crust evenly with the rim of the pie plate, and return the pastry-lined pie plate to the refrigerator.\nIn a large mixing bowl, stir together the sugar and cornstarch. Add the strawberries, raspberries, and  blueberries; gently toss until berries are coated. Allow fruit mixture to stand for about 15 minutes.\nPreheat the oven to 375 degrees F (190 degrees C). Place a baking sheet in the oven to preheat.\nRoll out the remaining pastry for the top crust. Stir the berry mixture and pour the filling into the pastry-lined pie plate. Place the top crust over the pie and trim the edges, leaving a 1/2-inch overhang. Fold the top crust under the bottom crust, pressing lightly to seal. Crimp the edges of the crust and cut vents in the top to allow steam to escape. To prevent over-browning, cover the edge of the pie with foil.\nBake in the preheated oven on the baking tray for 25 minutes. Remove the foil.\nBake for an additional 20 to 30 minutes, or until the filling is bubbling and the crust is golden. Cool on a wire rack.",
    "pt": "45 m",
    "ct": "45 m",
    "tt": "3 h",
    "i": "4538124.jpg",
    "o": "4538124.jpg,4531321.jpg,4530003.jpg,4530002.jpg,4483167.jpg,4467903.jpg",
    "st": "allrecipes"
}