{
    "id": 12498,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/8 cups all-purpose flour",
        "salt to taste",
        "3/8 cup butter",
        "1/8 cup lard",
        "3 tablespoons cold water",
        "1 pound Red Leicester cheese, shredded",
        "1 small onion, chopped",
        "salt and pepper to taste",
        "1 teaspoon Worcestershire sauce",
        "2 teaspoons prepared mustard",
        "3 eggs, beaten",
        "2 tomatoes, chopped",
        "1 egg, beaten"
    ],
    "nut": [
        "Calories > 500 kcal",
        "Carbs > 28.4 g",
        "Cholesterol > 179 mg",
        "Fat > 33.5 g",
        "Protein > 21.2 g",
        "Sodium > 458 mg"
    ],
    "n": "Red Leicester Pie",
    "a": "Steve Hibbert",
    "r": "0",
    "s": 8,
    "des": "\"This is a Cheese Pie that you can uses as a basis for your own variations. You could put a thin layer of pickle on the pie base before filling. Another popular variation in our family is the addition of maple cured bacon: the cheese, bacon and maple flavours produce a rich and tasty pie.  It's so simple, even I can manage it!\"",
    "ins": "Stir together flour and salt.  Cut in butter and lard until the texture resembles bread crumbs.  Stir in cold water 1 tablespoon at a time until you are able to gather the dough into a ball.  Wrap in cling film, and place in the refrigerator for an hour.  Do not skip the resting of the pastry, as it is vital.\nRoll out one third of the dough into a circle large enough to cover the top of the pie.  Cut out a circle in the middle, using a mug/cup as a guide, to make a ring.  Put four small cuts radiating out from the circle in the centre of the pastry, to allow the crust to expand without cracking.  Recombine the off cuts with the rest of the pastry.  Roll out the rest of the pastry to fit the base and the sides of a greased pie tin.  Trim off the edges to make a neat pie.\nPrick the pastry in the tin with a fork, and brush with beaten egg.  Bake at 375 degrees F (190 degrees C) for about 10 minutes.\nCombine grated cheese, onion, 3 eggs, Worcestershire sauce, and salt and pepper.  Stir well, then add the tomatoes and the mustard.  Thoroughly combine the mix, and fill the baked pie casing with it.  Put the circular piece of pastry over the top of the pie, and squeeze the top to the base where they meet.  Brush the top of the pie with beaten egg.\nPlace the pie one shelf above the middle.  Bake at 375 degrees F (190 degrees C) for 45 minutes.  Cover the top of the pie with foil, and cook for another 7 minutes.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}