{
    "id": 12508,
    "old_rating": "3.86538",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "2/3 cup shortening",
        "6 tablespoons water",
        "2 1/2 cups peeled, cored and sliced apples",
        "1 cup white sugar",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1 yellow onion",
        "1 green bell pepper",
        "1 tablespoon olive oil",
        "8 ounces tomato paste",
        "1/2 cup water",
        "1 tablespoon distilled white vinegar",
        "1 pound lean steak, cut into 1 inch cubes"
    ],
    "nut": [
        "Calories > 415 kcal",
        "Carbs > 49.7 g",
        "Cholesterol > 24 mg",
        "Fat > 19.7 g",
        "Protein > 11.3 g",
        "Sodium > 312 mg"
    ],
    "n": "Empanadas I",
    "a": "Andrea",
    "r": "0",
    "s": 10,
    "des": "\"This is a fairly quick and easy recipe for empanadas. A friend recently gave it to me, and my whole family loved them!!! Just about any kind of fruit, including melon, is fine. Or make the meat filling by using your favorite type of meat. Make one of the fillings or double the dough and make both!\"",
    "ins": "To make dough: In a medium mixing bowl, combine flour and salt. Cut in the shortening till pieces are the size of small peas. Add a small amount of water to slightly moisten. Form dough into a ball. Roll out the dough to about 1/8 inch thick and cut into 4-inch circles. Lightly flour both sides of circles.\nTo make fruit filling: In a saucepan combine fruit, sugar, cinnamon, and nutmeg. Heat over medium heat until hot, thoroughly mixing.\nTo make meat filling: In a medium skillet saute the onion and green pepper in olive oil. Add tomato paste, water, and vinegar, and cook for 20 minutes. Add meat and coat thoroughly with the sauce.\nPlace a large spoonful of one of the above mixtures to the center of a dough circle. Place another circle on top. Fasten the two circles together by pressing the edges with a fork. These may then be baked in a preheated 350 degrees F (175 degrees C) until golden brown.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "200268.jpg",
    "o": "",
    "st": "allrecipes"
}