{
    "id": 125488,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon olive oil",
        "1 1/2 teaspoons whole fennel seeds",
        "3 cloves garlic, minced",
        "1 red bell pepper, cut into thin strips",
        "3/4 cube fish bouillon, crushed",
        "1/2 lemon, juiced",
        "2 tablespoons dry white wine",
        "1 head baby bok choy, cleaned and sliced",
        "salt and black pepper to taste",
        "1 1/2 teaspoons fennel seeds, crushed",
        "1 (8 ounce) tuna steak",
        "1 tablespoon olive oil"
    ],
    "nut": [
        "Calories > 304 kcal",
        "Carbs > 11.4 g",
        "Cholesterol > 51 mg",
        "Fat > 15.5 g",
        "Protein > 29.1 g",
        "Sodium > 406 mg"
    ],
    "n": "Tasty Tuna Steak",
    "a": "Patrick.P.",
    "r": "0",
    "s": 2,
    "des": "\"Did a jasmine rice with this. Tossed 1 chopped onion in the water and with half a cube of fish stock inside the water when water is boiling.\"",
    "ins": "Heat 1 tablespoon of olive oil in a skillet over medium heat. Stir in 1 1/2 teaspoons of whole fennel seeds, and cook until they bubble and begin to pop, about 30 seconds. Stir in the garlic and red bell pepper; cook and stir for 2 minutes. Stir in the fish bouillon until dissolved, then add the lemon juice, white wine, and bok choy. Cook and stir until the bok choy is tender, about 5 minutes.\nMeanwhile, combine some salt and pepper with the crushed fennel seeds on a plate. Press the tuna steak into the salt mixture on both sides. Heat the remaining tablespoon of olive oil in a separate skillet over high heat. Place the tuna steak in the skillet, and cook until browned on both sides and cooked to your desired degree of doneness, about 45 seconds per side for rare.\nCut the tuna into 1/4-inch thick slices and arrange onto a serving platter. Top with the bok choy mixture to serve.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "20 m",
    "i": "2014342.jpg",
    "o": "",
    "st": "allrecipes"
}