{
    "id": 125520,
    "old_rating": "4.52941",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 ounces blanched slivered almonds",
        "1/4 cup sesame seeds",
        "5 slices bacon",
        "1/4 cup white sugar",
        "2 tablespoons distilled white vinegar",
        "1 teaspoon monosodium glutamate (such as Ac'centÂ®)",
        "1/2 cup vegetable oil",
        "1/2 teaspoon minced garlic",
        "2 heads leaf lettuce - rinsed, dried and torn into bite-size pieces",
        "1 cup chow mein noodles"
    ],
    "nut": [
        "Calories > 295 kcal",
        "Carbs > 13.6 g",
        "Cholesterol > 6 mg",
        "Fat > 24.5 g",
        "Protein > 6.6 g",
        "Sodium > 242 mg"
    ],
    "n": "Soccer Salad",
    "a": "Laura",
    "r": "0",
    "s": 8,
    "des": "\"The origin of this salad's unusual name is unknown, but it's a definite crowd pleaser.  Every time I bring it to a potluck or other event, I'm asked to share the recipe.\"",
    "ins": "Preheat an oven to 325 degrees F (165 degrees C).\nSpread the almonds and sesame seeds onto an ungreased baking sheet.\nBake in the preheated oven until the almonds are just turning golden brown, about 8 minutes. Set aside to cool completely. Meanwhile, place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate, cool, and crumble.\nCook the bacon in a large, deep skillet over medium-high heat until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate and allow to cool; crumble.\nMake the dressing by shaking the sugar, vinegar, monosodium glutamate, vegetable oil, and garlic in a glass jar with a sealable lid until mixed. Combine the cooled almonds, sesame seeds, crumbled bacon, lettuce, and chow mein noodles in a bowl. Pour the dressing overtop and gently toss until coated.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "1 h",
    "i": "332006.jpg",
    "o": "",
    "st": "allrecipes"
}