{
    "id": 125583,
    "old_rating": "3.98387",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup water",
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon salt",
        "1 tablespoon olive oil",
        "1 teaspoon cayenne pepper",
        "1 teaspoon garlic salt",
        "1 1/2 teaspoons crushed dried basil",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 283 kcal",
        "Carbs > 49.1 g",
        "Cholesterol > 4 mg",
        "Fat > 5.5 g",
        "Protein > 8.6 g",
        "Sodium > 1358 mg"
    ],
    "n": "Exquisite Yeastless Focaccia",
    "a": "Julia",
    "r": "0",
    "s": 4,
    "des": "\"This recipe for focaccia was given to me by my best friend, who is Italian.  It's incredibly simple, with only a few ingredients for the bread, and very versatile.  I love it because there's no yeast, and it's just so easy to make!  You can top it off with vegetables when there are about 5 minutes left on the baking time, or you can just season it with herbs and Parmesan cheese--my personal favorite.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Grease a 9x13 inch baking pan.\nPour water into the bowl of an electric mixer fitted with a dough hook. Sift together flour, baking powder, and salt, and add to the water. Mix on medium speed until dough forms a ball.  (Or, stir together water, flour, baking powder, and salt in large mixing bowl.  Turn dough out onto floured surface and knead until it forms a ball.)\nPlop dough into greased baking pan. Using oiled fingers, spread dough to 1/2-inch thickness.  Dough will be sticky and elastic.  It does not have to be perfectly even, but make sure there are no holes.   Rub the top and sides of dough with olive oil.   Season with cayenne, garlic salt, and basil.\nBake in preheated oven for 20 minutes.  Remove from oven; sprinkle with Parmesan cheese and return to oven.  Bake until just golden, or about 5 minutes.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "35 m",
    "i": "84266.jpg",
    "o": "4531469.jpg,4172342.jpg,3582697.jpg,3050716.jpg,2615137.jpg,2128606.jpg",
    "st": "allrecipes"
}