{
    "id": 125658,
    "old_rating": "4.52161",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "12 corn tortillas",
        "vegetable oil for pan-frying",
        "3 cooked boneless skinless chicken breast halves, shredded",
        "10 ounces shredded Monterey Jack cheese",
        "3/4 cup minced onion",
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "2 cups chicken broth",
        "1 cup sour cream",
        "1 (4 ounce) can chopped green chiles, drained",
        "2 ounces shredded Monterey Jack cheese",
        "1/2 cup chopped green onions",
        "1/2 cup chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 797 kcal",
        "Carbs > 33.2 g",
        "Cholesterol > 172 mg",
        "Fat > 51.9 g",
        "Protein > 49.8 g",
        "Sodium > 1013 mg"
    ],
    "n": "Chicken Enchiladas with Creamy Green Chile Sauce",
    "a": "aaronspool",
    "r": "0",
    "s": 6,
    "des": "\"Chicken- and cheese-filled corn tortillas baked under a creamy sauce infused with hot green chiles. Adjust the amount of chopped chiles to suit your taste!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nHeat 2 tablespoons of oil in a skillet over medium-high heat. Fry tortillas (one at a time) for 5 seconds on each side to soften and make them pliable. Add more oil to pan as needed. Drain between layers of paper towel and keep warm.\nDivide chicken, 10 ounces of Monterey Jack cheese, and onion among the 12 tortillas. Roll up each tortilla and place seam side down in a greased baking pan.\nMelt the butter in a saucepan over medium heat. Add the flour and whisk until mixture begins to boil. Slowly add the broth, stirring with a whisk until thickened. Mix in the sour cream and chiles, heat thoroughly but do not boil, stirring occasionally. Pour mixture over the enchiladas.\nBake in pre-heated oven for 20 minutes or until heated through. Top with remaining Monterey Jack cheese and bake for 5 more minutes. Garnish with chopped green onions and cilantro.",
    "pt": "35 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "368726.jpg",
    "o": "4479789.jpg,4479788.jpg,4472851.jpg,4459914.jpg,4293952.jpg,3839808.jpg",
    "st": "allrecipes"
}