{
    "id": 12618,
    "old_rating": "4.80837",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (18 ounce) package refrigerated sugar cookie dough",
        "1 (8 ounce) package cream cheese, softened",
        "1 (8 ounce) container frozen whipped topping, thawed",
        "2 cups sliced fresh strawberries",
        "1/2 cup white sugar",
        "1 pinch salt",
        "1 tablespoon cornstarch",
        "1/2 cup orange juice",
        "2 tablespoons lemon juice",
        "1/4 cup water",
        "1/2 teaspoon orange zest"
    ],
    "nut": [
        "Calories > 535 kcal",
        "Carbs > 62.9 g",
        "Cholesterol > 49 mg",
        "Fat > 30 g",
        "Protein > 5.5 g",
        "Sodium > 405 mg"
    ],
    "n": "Fruit Pizza II",
    "a": "Kay Craft",
    "r": "0",
    "s": 8,
    "des": "\"A fruit covered cookie crust that is shaped like a pizza. Try using star fruit, peaches, bananas, kiwi, orange slices, blueberries, and pineapples.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Slice cookie dough and arrange on greased pizza pan, overlapping edges. Press dough flat into pan. Bake for 10 to 12 minutes. Allow to cool.\nIn a large bowl, soften cream cheese, then fold in the whipped topping. Spread over cooled crust. You can chill for a while at this point, or continue by arranging the fruit.\nBegin with strawberries, sliced in half. Arrange in a circle around the outside edge. Continue with fruit of your choice, working towards the middle. If bananas are used, dip them in lemon juice so they don't darken. Then make a sauce to spoon over fruit.\nIn a saucepan, combine sugar, salt, corn starch, orange juice, lemon juice and water. Cook and stir over medium heat. Bring to a boil, and cook for 1 or 2 minutes, until thickened.  Remove from heat, and add grated orange rind. Allow to cool, but not set up. Spoon over fruit. Chill for two hours, then cut into wedges and serve.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "4539661.jpg",
    "o": "4539661.jpg,4532505.jpg,3920732.jpg,3862476.jpg,3847195.jpg,3847190.jpg",
    "st": "allrecipes"
}