{
    "id": 126134,
    "old_rating": "3.8125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 butternut squash, halved and seeded",
        "1 small pumpkin, halved and seeded",
        "3 tablespoons vegetable oil",
        "1 onion, chopped",
        "2 celery ribs, chopped",
        "1 tablespoon ground cinnamon",
        "1 teaspoon ground nutmeg",
        "1/2 teaspoon ground cloves",
        "4 cubes  vegetable bouillon",
        "5 cups boiling water",
        "3 medium carrots, peeled and chopped",
        "1 large sweet potato, peeled and diced",
        "salt to taste",
        "1 (12 fluid ounce) can evaporated milk",
        "1/4 cup fresh orange juice"
    ],
    "nut": [
        "Calories > 134 kcal",
        "Carbs > 22 g",
        "Cholesterol > 7 mg",
        "Fat > 4.6 g",
        "Protein > 3.4 g",
        "Sodium > 90 mg"
    ],
    "n": "Orange Vegetables Soup",
    "a": "OLENAJOY",
    "r": "0",
    "s": 16,
    "des": "\"This soup is made from orange-colored vegetables: pumpkin, butternut squash, carrots, and sweet potatoes.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPlace the squash and pumpkin in a large baking dish. Pour about 1-inch of water into the dish and cover with aluminum foil.\nBake in preheated oven until the squash and pumpkin are tender, 1 hour to 1 hour and 15 minutes.\nHeat the oil in a stockpot over medium heat. Combine the onion, celery, cinnamon, nutmeg, and cloves in the hot oil and cook and stir 3 to 5 minutes. Crumble the vegetable bouillon into the onion mixture; stir. Slowly add the boiling water to the mixture while stirring. When the water returns to a boil, add the carrots and sweet potato; season with salt; cover and cook until the potato and carrots are tender, 20 to 25 minutes; remove from heat. Scrape the flesh from the baked squash and pumpkin and add to the soup. Allow soup to cool for 15 minutes.\nLadle batches of the soup into a blender or food processor and blend on high until smooth. Repeat until all soup has been blended. Return blended soup to stockpot over medium heat. Stir in the evaporated milk and orange juice. Cook soup until entirely heated, 10 to 15 minutes.",
    "pt": "1 h",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "149178.jpg",
    "o": "",
    "st": "allrecipes"
}