{
    "id": 12624,
    "old_rating": "4.15686",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1 cup shortening",
        "1/2 teaspoon salt",
        "5 tablespoons ice water",
        "1 cup packed brown sugar",
        "1 egg",
        "1/2 tablespoon butter",
        "1/2 teaspoon vanilla extract",
        "1 tablespoon hot water",
        "1/2 cup flaked coconut",
        "1/2 cup chopped walnuts",
        "1/2 cup raisins"
    ],
    "nut": [
        "Calories > 371 kcal",
        "Carbs > 41 g",
        "Cholesterol > 17 mg",
        "Fat > 22.3 g",
        "Protein > 3.7 g",
        "Sodium > 121 mg"
    ],
    "n": "Canadian Butter Tarts",
    "a": "Valerie Hatfield-Ringrose",
    "r": "0",
    "s": 12,
    "des": "\"This recipe is adapted by Valerie Hatfield-Ringrose from the best of several recipes, plus her own additions.  It has been made and perfected many times over the years.  The tarts are the classic runny type, one of the few true Canadian concoctions.\"",
    "ins": "Fill a cup with ice and water.  Sift the flour and salt into a bowl.  Cut in the shortening to make pea-size pieces.  Add the tablespoons of ice water from the cup until dough holds together.  Form the dough into a ball.  The dough is now complete.  Put it into a plastic bag or wrap it up and refrigerate for at least 15 minutes.\nRoll the dough between two sheets of waxed paper.  Cut the shells using a large glass or your smallest pot.  You should have about 12 shells when finished.  Put these shells into a greased muffin or tart pan.\nPreheat oven to 350 degrees F (175 degrees C)\nPut walnuts and coconut on baking pan and roast for 5-10 minutes, until brown. Remove from oven and set temperature to 450 degrees F (230 degrees C).\nFill the bottom of each tart shell with about 10 raisins each.\nWhisk together sugar, egg, butter, vanilla and hot water.  Add coconut and walnuts.  Pour mixture into tart shells, filling 2/3 full and no more.\nBake in 450 degrees F (230 degrees C) oven for 10-12 minutes or until golden brown.  Let cool before attempting to remove.  Makes 12 tarts.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2008106.jpg",
    "o": "2961267.jpg,2008096.jpg,1990726.jpg,1964884.jpg,758247.jpg,676521.jpg",
    "st": "allrecipes"
}