{
    "id": 12637,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (9 inch) pie crust, baked",
        "6 egg yolks, beaten",
        "5 tablespoons white sugar",
        "1/4 cup sifted cornstarch",
        "2 cups milk",
        "1 vanilla bean, halved",
        "2 tablespoons butter, diced",
        "3 ounces white chocolate, melted",
        "8 ripe bananas",
        "1 lemon, juiced",
        "1 pint whipping cream",
        "1 fluid ounce white chocolate liqueur",
        "1 fluid ounce banana liqueur",
        "12 ounces white chocolate",
        "2 teaspoons unsweetened cocoa powder, for garnish"
    ],
    "nut": [
        "Calories > 870 kcal",
        "Carbs > 87.9 g",
        "Cholesterol > 259 mg",
        "Fat > 53.8 g",
        "Protein > 11.2 g",
        "Sodium > 234 mg"
    ],
    "n": "Elegant White Chocolate Banana Cream Pie",
    "a": "MARBALET",
    "r": "0",
    "s": 8,
    "des": "\"Best if eaten the same day it is made.\"",
    "ins": "To Make White Chocolate Pastry Cream: In a medium bowl, whisk together egg yolks and sugar until pale yellow. Whisk in cornstarch.  In a medium saucepan, heat milk and vanilla bean to just below the boiling point. Slowly whisk a small amount of hot milk into egg yolk mixture, then stir egg yolk mixture back into pan. Bring to a boil over low heat, stirring constantly.\nStir in butter, then strain mixture through a sieve. Place plastic wrap over the surface of mixture to keep a skin from forming.  Allow to cool slightly, then stir in melted white chocolate. Chill pastry cream.\nSlice bananas and toss with the lemon juice to keep from discoloring. Set aside.\nIn a large bowl, whip chilled whipping cream until stiff peaks form. Fold into pastry cream, then fold in bananas and liqueurs. Fill tart shell with banana cream filling.\nTop generously with white chocolate curls, then dust with cocoa. Serve soon after assembling so crust doesn't get soggy.\nTo make white chocolate curls,  carefully draw a vegetable peeler across the broad, flat surface of a room-temperature (about 80 degrees) chunk of white chocolate to make large, thin curls. Refrigerate until ready to use.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "591937.jpg",
    "o": "",
    "st": "allrecipes"
}