{
    "id": 12652,
    "old_rating": "3.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 cups chopped watermelon rind",
        "1 1/3 cups dried cranberries",
        "3/4 cup chopped walnuts",
        "1/3 cup distilled white vinegar",
        "1/2 cup white sugar",
        "2 teaspoons pumpkin pie spice",
        "1 teaspoon all-purpose flour",
        "1/4 teaspoon salt",
        "1 recipe pastry for a 9 inch double crust pie",
        "1/2 cup confectioners' sugar",
        "2 teaspoons orange zest",
        "1 teaspoon orange juice"
    ],
    "nut": [
        "Calories > 459 kcal",
        "Carbs > 63.3 g",
        "Cholesterol > 0 mg",
        "Fat > 22.4 g",
        "Protein > 4.9 g",
        "Sodium > 308 mg"
    ],
    "n": "Watermelon Harvest Pie",
    "a": "Lisa Olson",
    "r": "0",
    "s": 8,
    "des": "\"Made with the rind of the watermelon. Let the hogs go hungry tonight!\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nPlace watermelon rind in a saucepan and cover with water and bring this to a boil. Reduce the heat; simmer uncovered for about 10 minutes or until the rind becomes tender and translucent. Remove from heat and drain.\nPlace cooked watermelon rind in a large bowl and add the cranberries, walnuts and vinegar. Combine the sugar, pumpkin pie spice, flour, and the salt. Add this to the rind mixture and stir well.\nLine a 9 inch pie plate with bottom pastry, trim the pastry even with the edge. Add the filling. Roll out the remaining pastry and make a lattice crust. Seal and flute edges.\nCover pie with aluminum foil and bake at 425 degrees F (175 degrees C) for 20-25 minutes. Remove the foil, and bake for another 20-25 minutes or until the crust is golden brown.\nIn a small bowl, combine confectioners sugar, orange rind and orange juice. Stir to combine, and spoon over hot pie. Cool on a wire rack.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "3690409.jpg",
    "o": "",
    "st": "allrecipes"
}