{
    "id": 12665,
    "old_rating": "4.3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups chopped onions",
        "4 cloves garlic, minced",
        "1/4 cup olive oil",
        "6 cups fresh mushrooms, sliced",
        "10 ounces spinach - rinsed, stemmed, and dried",
        "3 eggs",
        "1 1/2 cups ricotta cheese",
        "1 1/2 cups grated Parmesan cheese",
        "1 cup sour cream",
        "1/2 cup bread crumbs",
        "1/4 cup chopped fresh parsley",
        "1/2 cup butter, melted",
        "1 (16 ounce) package phyllo dough",
        "2 teaspoons sesame seeds"
    ],
    "nut": [
        "Calories > 820 kcal",
        "Carbs > 61.5 g",
        "Cholesterol > 187 mg",
        "Fat > 51.4 g",
        "Protein > 30.3 g",
        "Sodium > 1123 mg"
    ],
    "n": "Mushroom, Spinach and Cheese Torta",
    "a": "Christine",
    "r": "0",
    "s": 6,
    "des": "\"Phyllo dough layered with spinach and ricotta. Poppy seeds may be used in place of sesame seeds.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nSaute onion and garlic in oil in large saucepan until onion is translucent.  Add mushrooms and spinach and continue cooking until mushrooms have released their juices and spinach has wilted.  Continue cooking until liquid has evaporated.  Remove from heat.\nBeat eggs slightly in large bowl.  Add ricotta and parmesan, sour cream, bread crumbs and parsley to eggs. Drain excess liquid from vegetables, then add to cheese mixture.  Stir until well blended.\nBrush some of melted butter on large baking sheet. Count out 6 phyllo leaves and carefully lift them up and lay flat on buttered baking sheet.\nSpread filling over middle of leaves, leaving a 3 inch border all around.  Brush edges with butter.\nOn top of the filling, lay down 2 leaves of phyllo at a time, brushing top leaf with butter each time.  After 4 pairs, fold corners of all phyllo leaves up over filling, and brush with butter.\nLay down 2 more pairs of leaves, buttering top leaf of each pair.  Tuck edges under torta, corners first, then sides.  Sprinkle top with sesame or poppy seeds.\nBake at 375 degrees F (190 degrees C) for 50 minutes or until filling is set and phyllo is crisp and golden.  Allow to rest 10 minutes before slicing.",
    "pt": "40 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "54075.jpg",
    "o": "",
    "st": "allrecipes"
}