{
    "id": 12664,
    "old_rating": "4.36364",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "24 sheets phyllo dough",
        "4 cups cooked white rice",
        "1 clove garlic, minced",
        "3 cups cubed cooked lamb",
        "1 lemon, juiced",
        "2 potatoes, peeled and quartered",
        "4 hard-cooked eggs, quartered",
        "2 tablespoons lemon zest",
        "2 tablespoons chopped fresh parsley",
        "2 tablespoons chopped fresh mint leaves",
        "1 1/2 cups crumbled feta cheese",
        "1/2 cup olive oil",
        "1 cup beef broth",
        "1 tablespoon chopped fresh oregano",
        "1/2 teaspoon ground black pepper",
        "1 egg, beaten",
        "1/2 cup butter, melted"
    ],
    "nut": [
        "Calories > 543 kcal",
        "Carbs > 43.4 g",
        "Cholesterol > 172 mg",
        "Fat > 29.4 g",
        "Protein > 25.8 g",
        "Sodium > 575 mg"
    ],
    "n": "Kreatopita Argostoli",
    "a": "Christine L.",
    "r": "0",
    "s": 12,
    "des": "\"A spicy Greek dish made with lamb and feta cheese in a phyllo pastry.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Bring a large pot of salted water to a boil.  Add potatoes and cook until tender but still firm, about 15 minutes. Drain, cool and chop.\nLightly brush a 9x13 inch pan with melted butter. Place 1 phyllo sheet in pan and lightly brush with butter. Continue adding phyllo sheets for a total of 12, brushing each one lightly with butter (you don't need to completely cover each phyllo sheet with butter).\nSpread cooked rice over phyllo, then sprinkle with minced garlic. Add lamb in an even layer, and sprinkle with lemon juice. Place 1 cup diced potatoes over lamb.\nArrange quarters of eggs, then sprinkle with parsley, mint and lemon zest. Add crumbled feta cheese.\nPour on olive oil and beef broth. Sprinkle with oregano and pepper. Finally, add beaten egg.\nTop with remaining 12 phyllo sheets brushed lightly with melted butter.\nBake for 40 to 50 minutes at 325 degrees F (165 degrees C). during the last 10 minutes, raise the temperature to 350 degrees F (175 degrees C). Remove from the oven and cool on a rack for 15 minutes. Cut into diamonds or squares and serve warm.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "113271.jpg",
    "o": "",
    "st": "allrecipes"
}