{
    "id": 12677,
    "old_rating": "4.62927",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 small sugar pumpkin",
        "3/4 cup packed brown sugar",
        "1 1/4 teaspoons ground cinnamon",
        "1 teaspoon ground ginger",
        "1 teaspoon ground nutmeg",
        "1/4 teaspoon ground cloves",
        "1/8 teaspoon ground allspice",
        "1/2 teaspoon salt",
        "2/3 cup real maple syrup",
        "1 1/4 cups half-and-half cream",
        "1 teaspoon all-purpose flour",
        "3 eggs",
        "1 (9 inch) unbaked pie shell"
    ],
    "nut": [
        "Calories > 356 kcal",
        "Carbs > 54.5 g",
        "Cholesterol > 84 mg",
        "Fat > 14 g",
        "Protein > 5.5 g",
        "Sodium > 313 mg"
    ],
    "n": "Pumpkin Maple Pie Supreme",
    "a": "CAROLEALANA",
    "r": "0",
    "s": 8,
    "des": "\"The first pumpkin pies were nothing like we make today. The most available sweetener was maple syrup, REAL maple syrup. I decided to try adding that to these pies and what a difference! This is my husband's favorite pie, using actual pumpkins that we grow. Using REAL maple syrup is key to the flavor. For extra special times, I serve with maple-sweetened whipped cream.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C)\nCut up pumpkin, and remove seeds. Place in large baking pan, and cover with foil or lid. Bake for 1 hour, or until very tender. Remove from oven, and set aside to cool. Reduce oven temperature to 350 degrees F (175 degrees C).\nScrape pumpkin into a food processor; puree until smooth. Measure 1 1/2 cups pumpkin puree. In a large bowl, mix together 1 1/2 cups pumpkin, brown sugar, cinnamon, ginger, nutmeg, cloves, allspice, and salt. Stir in maple syrup, half-and-half, and flour. Mix in eggs one at a time. Pour filling into unbaked pie shell.\nBake at 350 degrees F (175 degrees C) for 1 hour, or until center is set.",
    "pt": "30 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "752593.jpg",
    "o": "4469329.jpg,4365845.jpg,4204051.jpg,2892607.jpg,2721861.jpg,2710068.jpg",
    "st": "allrecipes"
}