{
    "id": 12678,
    "old_rating": "4.69782",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup cake flour",
        "3/4 cup all-purpose flour",
        "1 teaspoon white sugar",
        "1/2 teaspoon salt",
        "1/8 teaspoon baking powder",
        "4 tablespoons unsalted butter",
        "5 tablespoons shortening",
        "1 egg yolk",
        "2 teaspoons distilled white vinegar",
        "3 cubes  ice",
        "1/2 cup cold water"
    ],
    "nut": [
        "Calories > 222 kcal",
        "Carbs > 20 g",
        "Cholesterol > 41 mg",
        "Fat > 14.5 g",
        "Protein > 2.7 g",
        "Sodium > 155 mg"
    ],
    "n": "Baker's Secret Pie Crust",
    "a": "CAROLEALANA",
    "r": "0",
    "s": 8,
    "des": "\"I used to be challenged by pie crusts.  After 27 plus years of experimenting, this is the MOST successful recipe that I have developed. If using salted butter, reduce salt to 1/4 teaspoon.\"",
    "ins": "Measure butter & shortening onto a plate, put into freezer for about 20 minutes.\nMeasure cake flour, all-purpose flour, sugar, salt and baking powder into the bowl of a food processor.  Pulse for a few seconds to mix.\nTake 1/2 of the cold butter and 1/2 of the cold shortening, put into processor with dry ingredients and pulse off and on for about 1 minute.  Scrape down twice while doing this.\nTake remainder of the cold butter & cold shortening and cut in very briefly with the processor, leaving visible pea-sized chunks.  Do not over process at this stage!\nIn a measuring cup, mix egg yolk and vinegar together, add ice cubes and water.  Let this get chilled, about 3 to 4 minutes.\nRemove mixed flours and shortening from processor, put into a large mixing bowl.  Sprinkle approximately 4 to 5 tablespoons of this egg, water, vinegar mixture, a little at a time, mixing gently with a fork. The key to this is, you do not want a wet dough, and you do not want to overmix.\nPlace this dough into plastic wrap or plastic bag, chill in refrigerator for a few minutes. (May also be frozen for a few weeks at this stage for future use).\nRemove from refrigerator and roll out. This makes absolutely the BEST pie crusts.  I have won County Fair competitions with this pie crust. Double for making a 2-crust pie.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2650246.jpg",
    "o": "4528810.jpg,4031779.jpg,3713022.jpg,3384238.jpg,2076692.jpg,1850982.jpg",
    "st": "allrecipes"
}