{
    "id": 12680,
    "old_rating": "4.52586",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "For the Pastry:",
        "2 cups all-purpose flour",
        "1/2 cup shortening, chilled",
        "1 teaspoon salt",
        "1/2 cup cold water",
        "For the Apple Filling:",
        "2 apples",
        "1/4 cup white sugar, or to taste",
        "1/8 teaspoon ground cinnamon, or to taste",
        "oil for frying"
    ],
    "nut": [
        "Calories > 755 kcal",
        "Carbs > 34.9 g",
        "Cholesterol > 0 mg",
        "Fat > 68.2 g",
        "Protein > 3.3 g",
        "Sodium > 292 mg"
    ],
    "n": "Fried Apple Pies",
    "a": "Melissa",
    "r": "0",
    "s": 8,
    "des": "\"Little fried apple pies.\"",
    "ins": "Sift flour and salt together. Cut in the shortening with a pastry blender until the mixture resembles coarse crumbs. Add cold water 1 tablespoon at a time and mix with fork. When the flour mixture is moistened, gather it into a ball, wrap it in plastic, and refrigerate for 30 minutes.\nPeel and dice the apples and place them in a saucepan. Combine the sugar and cinnamon; pour over the apples and toss to coat. Cook, covered, in a saucepan on low heat. Cook until soft, then mash with fork to form a thick applesauce. Allow to cool.\nTransfer the dough to a lightly floured work surface. Roll the dough out to 1/8 inch thick and cut rounds with a large cookie cutter (4 inches in diameter).\nIn each round, place 1 heaping tablespoon fruit.  Moisten edges with cold water, fold in half, and press edge with a fork to seal. Repeat with the remaining pastry and filling.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nFry the pies, a few at a time, 2 to 3 minutes on each side; cook until the crust is golden brown. Drain on paper towels.",
    "pt": "45 m",
    "ct": "15 m",
    "tt": "1 h",
    "i": "218224.jpg",
    "o": "4466307.jpg,4461144.jpg,4096304.jpg,3716105.jpg,3449583.jpg,3386526.jpg",
    "st": "allrecipes"
}