{
    "id": 12683,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Brownie Crust:",
        "1 (13 ounce) package brownie mix",
        "2 eggs",
        "1/2 cup vegetable oil",
        "1/4 cup water",
        "Filling:",
        "1 tablespoon hot water",
        "1 tablespoon instant coffee powder",
        "1 (8 ounce) package cream cheese, softened",
        "1 (7 ounce) jar marshmallow cream",
        "6 ounces small soft chocolate covered mints",
        "1 cup whipping cream"
    ],
    "nut": [
        "Calories > 637 kcal",
        "Carbs > 72.4 g",
        "Cholesterol > 89 mg",
        "Fat > 37.5 g",
        "Protein > 6.3 g",
        "Sodium > 266 mg"
    ],
    "n": "Chocolate Mint Candy Pie",
    "a": "MARBALET",
    "r": "0",
    "s": 8,
    "des": "\"A minty, chocolaty, and creamy pie. Try it in the summer as cool and refreshing dessert. Garnish as desired with chocolate shavings or more Junior MintsÂ®.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch round cake pan.\nPrepare brownie mix according to package directions (see Editor's Note) and bake as directed, about 30 minutes. Set aside to cool.\nIn a large bowl, dissolve the coffee powder in the water. Add the cream cheese and beat with an electric mixer until smooth. Blend in the marshmallow cream.\nMelt the mints by placing them in a microwave-safe bowl. Heat on High for 1 1/2 to 2 minutes; stir until smooth. (Or place mints in small saucepan and stir over low heat until melted).\nStir the melted mints into the cream cheese mixture. As the chocolate cools, it will form slivers in the filling mixture. Whip the cream until medium-stiff peaks form.\nFold the whipped cream into the filling mixture and spread it over the cooled crust. Loosely cover, place into the refrigerator and chill for several hours or overnight.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "1 d ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}