{
    "id": 12719,
    "old_rating": "4.21053",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon canola oil",
        "1 onion, finely diced",
        "1 stalk celery, chopped",
        "1 green bell pepper, chopped",
        "1 teaspoon crushed red pepper",
        "1 tablespoon butter",
        "1/4 cup all-purpose flour",
        "1/2 teaspoon salt",
        "cracked black pepper to taste",
        "2 1/2 cups fish stock",
        "1 cup beer",
        "1 pound large shrimp - peeled and deveined"
    ],
    "nut": [
        "Calories > 256 kcal",
        "Carbs > 14.5 g",
        "Cholesterol > 180 mg",
        "Fat > 7.2 g",
        "Protein > 27.9 g",
        "Sodium > 963 mg"
    ],
    "n": "New Orleans Shrimp",
    "a": "SYLVIABC",
    "r": "0",
    "s": 4,
    "des": "\"Great New Orleans style spicy shrimp.  I like it hot, and add fresh, hot red peppers.  Serve over rice.  Crusty bread and ice cold beer are good accompaniments.  This is one of my favorite dishes.\"",
    "ins": "Pour oil into a large, heavy skillet; place over medium high heat.  Heat oil until hot, but not smoking.  Reduce heat to low, and add onion, celery, and green pepper.  If using diced hot peppers, stir in now.  Saute until the onion is soft; be careful not to burn onion.  Remove vegetables from skillet, and wipe out excess liquid with paper towel.\nReturn pan to heat.  Melt butter in pan: let bubble, but do not allow butter to burn.  Sprinkle flour over butter, and stir with wire whisk.  Whisk in salt and black pepper.  Whisking constantly, brown flour mixture until dry; this should take about 3 to 5 minutes.  Do not allow roux to burn.\nSlowly whisk in hot fish stock .   Increase heat slightly.  Gradually whisk in beer; keep whisking until gravy thickens.  Stir in vegetables.  If gravy is too thick, gradually stir in warm water to dilute.\nStir shrimp into gravy.  Cook until pink, about 2 to 3 minutes.  Remove from heat, and serve.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "1942395.jpg",
    "o": "",
    "st": "allrecipes"
}