{
    "id": 12738,
    "old_rating": "3.70588",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/3 cup vegetable oil",
        "1/2 cup all-purpose flour",
        "1 large onion, diced",
        "1 cup small, peeled shrimp",
        "3 cups water",
        "2 tablespoons finely chopped green bell pepper",
        "2 tablespoons minced celery",
        "1 tablespoon chopped fresh parsley",
        "1/2 teaspoon salt",
        "1/4 tablespoon ground black pepper"
    ],
    "nut": [
        "Calories > 271 kcal",
        "Carbs > 16.4 g",
        "Cholesterol > 49 mg",
        "Fat > 19.1 g",
        "Protein > 8.7 g",
        "Sodium > 344 mg"
    ],
    "n": "Audry's Shrimp Stew",
    "a": "Merwin Chambers",
    "r": "0",
    "s": 4,
    "des": "\"This is a recipe taught to my by my mother-in-law, Audry Falgout.  It has a great flavor and for being a South Louisiana recipe in well seasoned but not overly seasoned.  The darker you cook your roux, the deeper the flavor. This may seem like a long time to cook shrimp but it works. In our family it is typically served over hot cooked rice with potato salad on the side.\"",
    "ins": "Make the Roux: In a heavy bottomed sauce pan, over medium heat, heat oil until hot but not smoking.  Add flour all at once and stir constantly until the roux is golden brown.  (Note: do not cook the roux too fast.  If black flecks appear, the roux is burned and you must discard and start over. It may take 45 minutes to 1 hour to make the roux. The end result is worth the time.)\nAdd the onion to the roux and cook, stirring constantly, until onion is soft and light brown.\nLower heat to simmer and add the shrimp and cook for about 10 minutes. Slowly stir in the water.  Raise heat to medium and continue cooking until the stew reaches a boil. Stir in the green bell pepper, celery, parsley, salt and pepper.\nTurn heat down to a simmer and cook for about 30 to 40 minutes to blend flavors.  Taste and adjust seasonings.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}