{
    "id": 12773,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds cooked lobster tails - peeled, shredded and chilled",
        "1 medium head garlic",
        "1/2 large onion",
        "salt to taste",
        "1/3 cup extra virgin olive oil",
        "2 large red bell peppers",
        "1 large portobello mushroom, chopped",
        "1/2 lemon, juiced",
        "1 tablespoon fennel seed",
        "1 tablespoon ketchup",
        "1 tablespoon cider vinegar",
        "ground black pepper to taste",
        "4 cups mixed salad greens"
    ],
    "nut": [
        "Calories > 449 kcal",
        "Carbs > 19.7 g",
        "Cholesterol > 130 mg",
        "Fat > 24.6 g",
        "Protein > 37.8 g",
        "Sodium > 736 mg"
    ],
    "n": "Lobster Salad with Red Devil Dressing",
    "a": "LADOLCEVITA",
    "r": "0",
    "s": 4,
    "des": "\"This recipe features lobster, the 'Queen of the Sea'. The intensity of the richness of lobster is only amplified by the unique taste of it's dressing.  Laid on a bed of fresh salad greens, it's a great summertime luncheon meal.\"",
    "ins": "Preheat oven to broil.  Position rack in the center of the oven.  Lightly oil a baking sheet.\nCut off top of garlic, place on  a square of aluminum foil.  Drizzle with 1 teaspoon olive oil, and sprinkle with a pinch of salt on top.  Wrap in foil, and place on baking sheet.  Prepare onion in the same manner.\nPlace baking sheet in the center of the oven, and bake garlic and onion for 15 minutes.  Place red bell peppers on sheet; broil for 15 minutes, turning to blacken all sides.  Remove peppers only, and place in a brown paper bag.  Place mushroom on baking sheet, and broil for 15 minutes.  Remove mushroom, onion, and garlic from oven.  Set vegetables aside until cool enough to handle.\nPeel and remove seeds from peppers; place in blender, discarding seeds and peel.  Squeeze garlic and onion from skins; add to blender, discarding skins.  Coarsely chop mushroom; add to blender along with remaining olive oil, lemon juice, fennel, ketchup, and vinegar.   Blend until smooth.  Season to taste with salt and ground black pepper.\nPlace shredded lobster meat in the center of a large bed of salad greens.  Pour dressing around lobster meat.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "37293.jpg",
    "o": "",
    "st": "allrecipes"
}