{
    "id": 127877,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon sugar-based curing mixture (such as MortonÂ® Tender QuickÂ®)",
        "1 tablespoon dark brown sugar",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon onion powder",
        "1/4 teaspoon whole mustard seed",
        "1/8 teaspoon freshly ground black pepper",
        "1/8 teaspoon crushed red pepper flakes",
        "1/8 teaspoon liquid smoke",
        "1 pound lean venison roast, trimmed of all fat and sinew"
    ],
    "nut": [
        "Calories > 86 kcal",
        "Carbs > 2.5 g",
        "Cholesterol > 53 mg",
        "Fat > 1.7 g",
        "Protein > 14.3 g",
        "Sodium > 1189 mg"
    ],
    "n": "Minnesota Whitetail Jerky",
    "a": "Jeff P.",
    "r": "0",
    "s": 6,
    "des": "\"Sweet and hot venison jerky is perfect for a snack while hiking, camping, fishing, etc.\"",
    "ins": "Combine curing mixture, sugar, garlic powder, onion powder, mustard seed, ground pepper, red pepper, and liquid smoke in a large bowl.  Mix until evenly blended, and set aside.\nSlice venison with the grain into strips 3/16-inch thick, and 2-inches wide. Add to curing mixture and gently mix together until every slice is coated with curing mix.  Place into a plastic bag, squeeze out all air, and seal; or place into a glass or plastic bowl and cover.  Refrigerate for at least 18 hours to cure.\nTurn oven to 150 degrees F (65 degrees C). Spray two wire racks with cooking spray, and place onto cookie sheets.\nSqueeze excess liquid from the venison, and lay the strips onto the prepared wire racks, making sure the pieces do not touch each other.  Place the jerky into the oven, and cook until dried, 3 to 8 hours, depending on the temperature of your oven.\nYou can tell the meat is done when it no longer bends and you could break off a piece with ease, but the meat should not be so dry as to be crisp and break.  It is better to be less dry than over dried, because you can finish it by letting it air dry to perfection. Do not worry about color changes of the jerky, it will get lighter and harder as it continues to dry over time. Jerky can be frozen or kept in sealed containers in the refrigerator.",
    "pt": "20 m",
    "ct": "3 h",
    "tt": "21 h ",
    "i": "2301328.jpg",
    "o": "",
    "st": "allrecipes"
}