{
    "id": 128953,
    "old_rating": "4.73684",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups balsamic vinegar",
        "2 tablespoons minced garlic",
        "1 tablespoon chopped fresh thyme",
        "1 cup olive oil",
        "1 pork tenderloin, cut into 2 inch pieces",
        "1/2 cup butter",
        "1/4 cup packed brown sugar",
        "1 apple, thinly sliced",
        "1/4 cup dried cherries",
        "1 tablespoon minced fresh ginger root",
        "1 pinch ground cinnamon",
        "1 pinch ground nutmeg"
    ],
    "nut": [
        "Calories > 536 kcal",
        "Carbs > 45.4 g",
        "Cholesterol > 110 mg",
        "Fat > 31.3 g",
        "Protein > 19.3 g",
        "Sodium > 239 mg"
    ],
    "n": "Marinated Pork Medallions with a Ginger-Apple Compote",
    "a": "adam",
    "r": "0",
    "s": 4,
    "des": "\"Fresh pork medallions are marinated in a balsamic vinegar and garlic blend and topped with a fresh, homemade ginger-apple compote.\"",
    "ins": "Puree the balsamic vinegar, garlic, and thyme in a blender until mixed. With the blender running, slowly pour in the olive oil until thickened and incorporated. Pour the marinade into a resealable plastic bag. Add the pork pieces, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 30 minutes.\nPreheat an outdoor grill for medium heat, and lightly oil the grate. Remove the pork from the marinade, and shake off excess. Discard the remaining marinade.\nCook the pork on the preheated grill until no longer pink in the center, about 10 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Once cooked, remove from the grill, cover with aluminum foil, and allow to rest for 5 to 10 minutes before slicing.\nWhile the pork is cooking, melt the butter in a saucepan over medium heat. Stir in the brown sugar until it begins to simmer. Add the apples, cherries, ginger, cinnamon, and nutmeg. Cook and stir until the apple is tender, about 5 minutes. Serve the sliced pork topped with the apple compote.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "1 h",
    "i": "294764.jpg",
    "o": "",
    "st": "allrecipes"
}