{
    "id": 129016,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds processed cheese food (such as VelveetaÂ®), cubed",
        "1 teaspoon condensed cream of mushroom soup",
        "1/2 cup butter, divided",
        "2 onions, chopped",
        "1 green bell pepper, chopped",
        "1 tablespoon minced garlic",
        "3 pounds peeled crawfish tails",
        "1 teaspoon cayenne pepper, or to taste",
        "salt and ground black pepper to taste",
        "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TELÂ®)"
    ],
    "nut": [
        "Calories > 199 kcal",
        "Carbs > 4.5 g",
        "Cholesterol > 97 mg",
        "Fat > 13.4 g",
        "Protein > 15.1 g",
        "Sodium > 566 mg"
    ],
    "n": "Easy Cheesy Crawfish Dip",
    "a": "CHASSY",
    "r": "0",
    "s": 25,
    "des": "\"This is a great dish for parties, weddings, or even for a snack at home. Really easy and fast. Works really well in a slow cooker. Great with your favorite chips or crackers.\"",
    "ins": "Place the processed cheese and 1 teaspoon of cream of mushroom soup into a slow cooker. Turn the slow cooker to High and set aside.\nMelt half of the butter in a large skillet over medium heat. Stir in the onion and green pepper; cook and stir until the onion has softened and turned translucent, about 10 minutes. Scrape the onion mixture into a bowl and set aside. Melt the remaining butter in the skillet along with the garlic. Once the garlic begins to sizzle and is aromatic, add the crawfish tails, and season with cayenne pepper, salt and pepper. Cook and stir until the crawfish is hot, then stir into the onion and pepper mixture.\nPlace the crawfish mixture into a food processor, and process until the mixture is finely ground, or to your desired consistency. Stir the crawfish mixture into the slow cooker along with the can of diced tomatoes. Cover, and continue to cook 45 minutes, stirring occasionally. Once hot, set the slow cooker to Low until ready to serve.",
    "pt": "35 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}