{
    "id": 129000,
    "old_rating": "4.41667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package multigrain tortilla chips",
        "1 red bell pepper, diced",
        "1 orange bell pepper, diced",
        "1 bunch green onions, chopped",
        "1 avocado - peeled, pitted, and diced",
        "1/2 pineapple, peeled and cut into 1/2-inch dice",
        "8 thick slices bacon",
        "3/4 cup Caribbean jerk marinade",
        "1 pound cooked shrimp, peeled and deveined",
        "1/2 pound shredded Monterey Jack cheese",
        "1 bunch fresh cilantro, chopped"
    ],
    "nut": [
        "Calories > 1268 kcal",
        "Carbs > 108.4 g",
        "Cholesterol > 299 mg",
        "Fat > 68.9 g",
        "Protein > 59 g",
        "Sodium > 2809 mg"
    ],
    "n": "Caribbean Nachos",
    "a": "Smarz325",
    "r": "0",
    "s": 4,
    "des": "\"This recipe combines spicy, sweet, and salty with a definite Caribbean flair. The multigrain chips make it a heartier and healthier dish, and add a wonderful nutty flavor. Chicken can be subbed for the shrimp, but increase the cooking time as necessary. Serve with sour cream and picante salsa.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nLayer the chips on a tray or cookie sheet. Arrange the red pepper, orange pepper, onion, avocado, and pineapple on top of the chips.\nPlace bacon in a large, deep skillet. Cook over medium-high heat until evenly crisp; drain on a plate lined with paper towels. Chop the bacon and sprinkle over the nachos.\nPour the jerk marinade into a saucepan over medium heat. Cook, stirring continually, until the marinade reduces to a thick sticky consistency, about 3 minutes. Add the shrimp and stir to coat; cook until the shrimp are hot. Scatter the shrimp over the nachos; top with Monterrey Jack cheese and cilantro.\nPlace the nachos in the oven until the cheese is melted, about 7 minutes.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "1037191.jpg",
    "o": "4515992.jpg,4500050.jpg,4498483.jpg,4469101.jpg,4466941.jpg,3795507.jpg",
    "st": "allrecipes"
}