{
    "id": 129443,
    "old_rating": "4.47368",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Cake:",
        "2/3 cup milk",
        "3 drops apple cider vinegar",
        "1 cup white sugar",
        "2/3 cup packed brown sugar",
        "2/3 cup vegetable oil",
        "1/4 cup butter, melted",
        "1/2 teaspoon vanilla extract",
        "1 cup canned pumpkin puree",
        "2 cups all-purpose flour",
        "1/2 cup regular rolled oats ",
        "1 1/4 teaspoons baking powder",
        "1 1/4 teaspoons baking soda",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/8 teaspoon ground cloves",
        "1/2 cup chopped walnuts",
        "Frosting:",
        "1 (16 ounce) container cream cheese frosting",
        "1/4 teaspoon ground cinnamon"
    ],
    "nut": [
        "Calories > 418 kcal",
        "Carbs > 54.5 g",
        "Cholesterol > 8 mg",
        "Fat > 21.7 g",
        "Protein > 3.1 g",
        "Sodium > 269 mg"
    ],
    "n": "Made Me Love Pumpkin Cake",
    "a": "Jessica B.",
    "r": "0",
    "s": 16,
    "des": "\"This is a tweak on my mom's banana-oatmeal cake that I made it for an early Thanksgiving dinner. I tried a piece to see how it came out and I love it! It tastes like a spice cake. I dislike pumpkin as a rule, but this cake is another story. Topped with cinnamon cream cheese frosting, it's sooo tasty! I can't wait to see if the rest of my family likes it as much as I do. I've also made this recipe using applesauce instead of pumpkin and it's just as good.  This recipe calls for no eggs or salt.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish. Pour the milk into a small bowl, and stir in the vinegar. Set aside.\nMix the flour together with rolled oats, baking powder, baking soda, cinnamon, nutmeg, and cloves in a bowl.\nBeat the white sugar, brown sugar, vegetable oil, butter, milk mixture, and vanilla together in a mixing bowl until smooth and well blended. Add the pumpkin and beat again until smooth. Gradually stir in the flour mixture until evenly blended. Mix in the walnuts. Pour the batter into the prepared baking dish.\nBake in preheated oven until the top is golden brown and a toothpick inserted in the center comes out clean, about 45 minutes. Cool on a rack.\nMeanwhile, mix the frosting with 1/4 teaspoon cinnamon in a bowl. When the cake is completely cool, spread over the top.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4170958.jpg",
    "o": "",
    "st": "allrecipes"
}