{
    "id": 130268,
    "old_rating": "4.46667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Dough:",
        "1 teaspoon white sugar",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "1 (.25 ounce) package active dry yeast",
        "2 tablespoons olive oil",
        "1 1/2 teaspoons kosher salt",
        "3 cups all-purpose flour, divided",
        "Filling:",
        "1 cup ricotta cheese",
        "2 cups shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese, or to taste",
        "1 (4 ounce) package sliced pepperoni",
        "1 tablespoon chopped fresh parsley",
        "1/2 teaspoon Italian seasoning",
        "1/2 cup sliced black olives (optional)",
        "1/2 green bell pepper, cut into strips (optional)",
        "1/2 cup sliced fresh mushrooms (optional)",
        "1 egg",
        "1 tablespoon water"
    ],
    "nut": [
        "Calories > 241 kcal",
        "Carbs > 23 g",
        "Cholesterol > 39 mg",
        "Fat > 11.1 g",
        "Protein > 11.9 g",
        "Sodium > 534 mg"
    ],
    "n": "Spooky Calzone Snake",
    "a": "prttimecook",
    "r": "0",
    "s": 14,
    "des": "\"I came up with this idea for Halloween. I baked it in an S shape after combining an egg yolk with food coloring (I made several colors with several yolks) and painted to make a colorful striped snake.  I used various food items to make a tongue, nostrils, and eyes (olives, peppercorns, fruit roll-up, etc). It was a hit with the kids! Serve with spaghetti sauce for dipping.\"",
    "ins": "Dissolve the sugar in the warm water in the bowl of a stand mixer fitted with a dough hook. Sprinkle the yeast over the water, and let stand for 5 minutes until the yeast softens and begins to form a creamy foam. Stir in the oil, salt, and 2 cups of flour, and mix on Low until the mixture forms a wet dough. With the machine running, add 1 cup of flour, 1/4 cup at a time, and knead until the dough pulls away from the sides of the bowl into a ball. Knead for 3 to 5 more minutes, until the dough is smooth and elastic.\nLightly oil a large bowl, then place the dough in the bowl and turn to coat with oil. Cover with a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) until doubled in volume, about 1 hour.\nCombine the ricotta, mozzarella, and Parmesan cheeses, pepperoni, parsley, Italian seasoning, olives, green pepper, and mushrooms in a large bowl, and set aside.\nPreheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nPunch down the dough, and roll it out into a long, flat strip about 9 inches wide by 30 inches long. Spoon the filling mixture down the center of the dough strip, leaving about 1 inch on all sides for sealing. Pull edges of the dough together; pinch to seal and form a long, filled roll. Place the roll, seam side down, onto the parchment paper in a snakey \"S\" shape, and tuck the ends underneath to seal. Beat the egg in a bowl with 1 tablespoon of water, and brush the egg wash over the calzone.\nBake in the preheated oven for 30 to 35 minutes, until the calzone is golden brown. Let cool for 5 minutes before cutting into individual slices.",
    "pt": "30 m",
    "ct": "35 m",
    "tt": "2 h ",
    "i": "4539520.jpg",
    "o": "4539520.jpg,4091884.jpg,4085650.jpg,4076942.jpg,4036006.jpg,3089710.jpg",
    "st": "allrecipes"
}