{
    "id": 130619,
    "old_rating": "4.44681",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter",
        "1/2 cup all-purpose flour",
        "3 cups milk",
        "6 tablespoons grated Parmesan cheese",
        "1 egg, beaten",
        "2 tablespoons heavy cream",
        "salt and pepper to taste",
        "2 pounds sliced roasted turkey",
        "1 tomato, thinly sliced",
        "8 slices white bread, toasted",
        "1/4 cup grated Parmesan cheese",
        "8 slices crispy bacon"
    ],
    "nut": [
        "Calories > 1039 kcal",
        "Carbs > 48 g",
        "Cholesterol > 329 mg",
        "Fat > 52.3 g",
        "Protein > 89.5 g",
        "Sodium > 1267 mg"
    ],
    "n": "Original Hot Brown",
    "a": "BIKEMAMA96",
    "r": "0",
    "s": 4,
    "des": "\"This recipe originally came from the Brown Hotel in Louisville, KY. I have altered it based on how I have had it served in restaurants in Louisville. This is a good way to use leftover turkey from Thanksgiving and my husband looks forward to it every year.\"",
    "ins": "Melt the butter in a saucepan over medium heat. Stir in flour with a whisk or fork, and continue to cook and stir until it begins to brown slightly. Gradually whisk in the milk so that no lumps form, then bring to a boil, stirring constantly. Mix in 6 tablespoons of Parmesan cheese and then stir in the beaten egg to thicken. Do not allow the sauce to boil once the egg has been mixed in. Remove from the heat and stir in the cream.\nPreheat the oven's broiler. For each hot brown, place two slices of toast into the bottom of an individual sized casserole dish. Cover with a liberal amount of roasted turkey and tomato slices. Spoon sauce over the top of each one and sprinkle with some of the remaining Parmesan cheese.\nPlace the dishes under the broiler and cook until the top is speckled brown, about 5 minutes. Remove from the broiler and arrange two slices of bacon in a cross shape on top of each sandwich. Serve immediately.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "894858.jpg",
    "o": "3038554.jpg,2894957.jpg,2886787.jpg,2527693.jpg,1761889.jpg,637002.jpg",
    "st": "allrecipes"
}