{
    "id": 130995,
    "old_rating": "4.22222",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 pounds cubed beef stew meat",
        "1 onion, diced",
        "1 (12 fluid ounce) can pale ale or lager beer",
        "2 cloves garlic, minced",
        "1/2 teaspoon dried thyme",
        "1 1/2 teaspoons chopped fresh parsley",
        "2 tablespoons Worcestershire sauce",
        "salt and pepper to taste",
        "2 cups peeled and cubed potatoes",
        "1 1/2 cups quartered fresh mushrooms",
        "1 tablespoon all-purpose flour",
        "1 pastry for double-crust pie"
    ],
    "nut": [
        "Calories > 473 kcal",
        "Carbs > 32.4 g",
        "Cholesterol > 47 mg",
        "Fat > 28.7 g",
        "Protein > 17.5 g",
        "Sodium > 319 mg"
    ],
    "n": "Steak and Ale Pie with Mushrooms",
    "a": "Mrs. L",
    "r": "0",
    "s": 8,
    "des": "\"Beef and mushrooms simmer in a rich ale sauce before going into a hearty, flavorful pie guaranteed to warm you up on cold winter evenings.\"",
    "ins": "Place the beef stew meat, onion, and ale in a large saucepan. Simmer over low heat until the meat is tender, about 30 minutes.\nPreheat the oven to 400 degrees F (200 degrees C).\nSeason the beef with garlic, thyme, parsley, Worcestershire sauce, salt and pepper. Mix in the potatoes and mushrooms. Cover and simmer over medium heat until potatoes are just tender enough to pierce with a fork, 10 to 15 minutes. Whisk a small amount of the sauce together with the flour in a small bowl, and stir into the beef. Simmer until slightly thickened.\nFit one pie crust into the bottom and up the sides of a 9 inch pie plate. Spoon the hot beef mixture into the crust and top with the remaining pie crust. Cut slits in the top crust to vent steam and crimp the edges to seal them together.\nBake in preheated oven until the crust is golden brown and gravy is bubbling, 35 to 40 minutes.",
    "pt": "45 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "2793611.jpg",
    "o": "",
    "st": "allrecipes"
}