{
    "id": 131459,
    "old_rating": "4.26316",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup chocolate cookie crumbs",
        "3 tablespoons white sugar",
        "1/4 cup butter, melted",
        "4 (8 ounce) packages cream cheese, softened",
        "2 tablespoons all-purpose flour",
        "1/4 teaspoon salt",
        "1 3/4 cups white sugar",
        "1/2 cup sour cream",
        "2 1/2 teaspoons vanilla extract, divided",
        "3 eggs",
        "1/2 teaspoon peppermint extract",
        "2 dashes red food coloring",
        "1/2 cup crushed peppermint candies"
    ],
    "nut": [
        "Calories > 545 kcal",
        "Carbs > 52.4 g",
        "Cholesterol > 143 mg",
        "Fat > 34.5 g",
        "Protein > 8.3 g",
        "Sodium > 378 mg"
    ],
    "n": "Candy Cane Cheesecake",
    "a": "CARRIELOVESKEITH",
    "r": "0",
    "s": 12,
    "des": "\"You can vary what you top this festive cheesecake with: crushed candy canes are a must, but you can spread whipped cream on top before sprinkling with candy canes, or drizzle with some melted chocolate chips. Please add your comments as you find ways to improve this recipe!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 9-inch springform pan.\nCombine the cookie crumbs and 3 tablespoons sugar in a bowl. Drizzle the melted butter into the mixture while stirring until evenly moistened. Press the mixture into the bottom of the prepared pan.\nBake in preheated oven until set, about 10 minutes; set aside to cool. Reduce oven temperature to 300 degrees F (150 degrees C).\nCombine the cream cheese, flour, and salt in a large bowl. Beat with an electric hand mixer on lowest speed until smooth and fluffy. Add the 1 3/4 cup sugar, sour cream, and 1 1/2 teaspoon vanilla and beat until incorporated. Stir in the eggs one at a time, stopping and scraping down the sides of the bowl between each one.\nDivide the mixture evenly into two separate bowls. In one bowl, stir in 1 teaspoon vanilla. In the other bowl, add the peppermint extract  and the red food coloring and mix until you get a reddish-pink color. Add more coloring as needed. Alternate layers of 1 cup each of the white and pink onto the cooled crust until all the filling is used.\nBake in the preheated oven until the filling is mostly set. The center will jiggle slightly when the pan is shaken and the edges will be slightly puffed, 60 to 70 minutes.\nSprinkle the crushed candies evenly over the cheesecake and gently press into the top. Allow to cool on a rack to room temperature. Cover loosely and refrigerate overnight before serving.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 d ",
    "i": "942890.jpg",
    "o": "",
    "st": "allrecipes"
}