{
    "id": 131591,
    "old_rating": "4.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup whole cranberries",
        "1/2 cup fresh orange juice",
        "1 tablespoon orange zest",
        "2 tablespoons white sugar",
        "3/4 cup cashew halves",
        "6 cups chopped cooked turkey",
        "2 celery ribs, diced ",
        "3/4 cup mayonnaise, or to taste",
        "2 tablespoons applesauce",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon ground dried sage",
        "1/4 teaspoon dried thyme",
        "ground black pepper, to taste"
    ],
    "nut": [
        "Calories > 288 kcal",
        "Carbs > 8.4 g",
        "Cholesterol > 58 mg",
        "Fat > 18.4 g",
        "Protein > 22.2 g",
        "Sodium > 274 mg"
    ],
    "n": "Festive Fall Turkey Salad",
    "a": "Jason N - Home Chef",
    "r": "0",
    "s": 12,
    "des": "\"I created this recipe to use leftover holiday turkey. It's a classic bound salad using mayonnaise and celery, but it also includes fresh cranberries, orange juice and cashews. Although new to our menu, it has become a holiday favorite. My family requests I make my own turkey before Thanksgiving so I can serve this salad as an appetizer at our holiday feast. I hope you will find it as enjoyable as we do. Enjoy it on rolls, in wraps, or as a spread with crackers.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Line a baking pan with aluminum foil.\nPlace the cranberries, orange juice, orange zest, and sugar into a pan. Bring to a boil, and cook, stirring occasionally, until almost all the liquid has cooked away, about 5 minutes. Remove from the heat, and cool.\nPlace cashews on prepared baking pan. Roast in preheated oven until golden brown, 10 to 12 minutes. Remove, and cool.\nMix the turkey together in a large bowl with the celery, mayonnaise, applesauce, salt, sage, thyme, and pepper until evenly blended. Fold in the cranberry mixture. Refrigerate at least 2 hours before serving.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "2 h ",
    "i": "146168.jpg",
    "o": "",
    "st": "allrecipes"
}