{
    "id": 131688,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup butter",
        "3 Granny Smith apples - peeled, cored and chopped",
        "3/4 cup butter at room temperature",
        "1 tablespoon honey",
        "1/2 cup white sugar",
        "1/2 cup packed brown sugar",
        "2 eggs",
        "2 cups all-purpose flour",
        "2 teaspoons baking soda",
        "2 teaspoons ground cinnamon",
        "1 teaspoon pumpkin pie spice",
        "1 teaspoon ground cloves",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon salt",
        "1/2 cup milk",
        "1/2 cup chopped walnuts",
        "1 egg white",
        "1 teaspoon ground cinnamon",
        "1/2 cup chopped walnuts",
        "1 tablespoon brown sugar",
        "1/2 cup butter, softened",
        "1 cup confectioners' sugar",
        "1 (8 ounce) package cream cheese, softened",
        "1 teaspoon vanilla extract",
        "1 (20 ounce) can apple pie filling"
    ],
    "nut": [
        "Calories > 918 kcal",
        "Carbs > 99.1 g",
        "Cholesterol > 170 mg",
        "Fat > 56.1 g",
        "Protein > 10.8 g",
        "Sodium > 784 mg"
    ],
    "n": "Excellent Apple Gingerbread",
    "a": "Izabela",
    "r": "0",
    "s": 8,
    "des": "\"This is a traditional Polish Christmas gingerbread with apple filling. Believe me, it is excellent and easy to make!\"",
    "ins": "Melt 1/4 cup of butter in a large skillet over medium heat. Add the apples; cook and stir until tender. Set aside and allow to cool.\nPreheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9 inch round cake pans.\nIn a large bowl, mix 3/4 cup of butter, honey, brown sugar and white sugar until light and fluffy using an electric mixer. Beat in the eggs one at a time, mixing each one until blended. Combine the flour, baking soda, cinnamon, pumpkin pie spice, cloves, ginger and salt; stir into the batter, alternating with the milk. Stir in the walnuts and cooked apples just until evenly distributed. Divide evenly between the prepared pans and spread evenly.\nBake the cake in the preheated oven until a toothpick inserted in the center comes out clean, about 30 minutes. Cool the cakes on a wire rack. Keep the oven on for the walnuts.\nTo make the candied walnuts for the top of the cake, whip the egg whites in a clean bowl until foamy. Stir in the brown sugar, cinnamon and walnuts. Spread the nuts out on a baking sheet.\nBake in the preheated oven until toasted and fragrant, about 10 minutes. Cool completely before using.\nTo make the frosting, mix together the butter, confectioners' sugar and cream cheese until smooth. Place one layer of cake on a serving plate and spread with a thin layer of the cream cheese icing. Top with most of the apple filling and spread evenly. Place the other layer of cake on top with the bottom facing up. Spread remaining cream cheese icing over the top and sides. Decorate the top with remaining apple filling and sprinkle with candied walnuts.",
    "pt": "50 m",
    "ct": "40 m",
    "tt": "3 h ",
    "i": "339531.jpg",
    "o": "",
    "st": "allrecipes"
}