{
    "id": 131873,
    "old_rating": "3.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups canola oil for deep frying",
        "3 pounds chicken wings, tips removed and wings cut in half at joint",
        "1 tablespoon garlic salt",
        "1 cup cornstarch",
        "2 eggs, beaten",
        "1/2 cup cider vinegar",
        "1/4 cup pineapple juice",
        "1/4 cup ketchup",
        "1 cup honey",
        "1 tablespoon soy sauce",
        "2 tablespoons toasted sesame seeds",
        "2 green onions, thinly sliced"
    ],
    "nut": [
        "Calories > 567 kcal",
        "Carbs > 71.8 g",
        "Cholesterol > 110 mg",
        "Fat > 23.1 g",
        "Protein > 20.5 g",
        "Sodium > 1249 mg"
    ],
    "n": "Hawaiian Chicken Wings",
    "a": "Luv2bake",
    "r": "0",
    "s": 6,
    "des": "\"Everybody loves this tangy Hawaiian-style chicken.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Heat oil in deep-fryer to 375 degrees F (190 degrees C). Line a baking sheet with aluminum foil, and spray with nonstick cooking spray.\nToss chicken wings with garlic salt, and set aside for 10 minutes. Place cornstarch in a large plastic bag; toss the wings, a few at a time until coated. Shake off excess cornstarch, then dip into beaten egg. Shake wings in cornstarch again, then fry until golden brown in deep fryer. Drain on a paper towel-lined plate.\nStir together vinegar, pineapple juice, ketchup, honey, and soy sauce in a saucepan over medium-high heat. Once the sauce comes to a simmer, place the chicken wings in a bowl, pour all but 1/2 cup of the sauce overtop, and toss to coat. Reserve remaining sauce to for basting.\nPlace chicken wings on prepared baking sheet. Bake in preheated oven for 30 minutes, then baste with remaining sauce, turn, and bake for an additional 20 minutes.\nTo serve, place wings on serving platter, and sprinkle with sesame seeds and green onions.",
    "pt": "30 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "328148.jpg",
    "o": "",
    "st": "allrecipes"
}