{
    "id": 13230,
    "old_rating": "4.58065",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons minced garlic",
        "1 onion, sliced into thin rings",
        "1 1/2 tablespoons butter",
        "3 (10.5 ounce) cans condensed chicken broth",
        "2 (10.5 ounce) cans condensed beef broth",
        "1 teaspoon ground black pepper",
        "1 (1 ounce) package au jus gravy mix",
        "2 cups croutons",
        "8 slices Swiss cheese"
    ],
    "nut": [
        "Calories > 442 kcal",
        "Carbs > 19.1 g",
        "Cholesterol > 73 mg",
        "Fat > 26.6 g",
        "Protein > 31.4 g",
        "Sodium > 3589 mg"
    ],
    "n": "Quickie French Onion Soup",
    "a": "Sionell",
    "r": "0",
    "s": 4,
    "des": "\"My family loves French Onion Soup.  My friend gave me this wonderful recipe so we could have great French onion soup at home. The best part is I do not have to slave over a stove all day to make this quickie soup. To make this recipe make sure you have four soup crocks, since each serving is broiled in its own bowl.  One last hint, fried minced garlic is available at a local Asian grocery stores or you can saute your own.\"",
    "ins": "In a small skillet over medium heat, cook garlic until just golden.  Set aside.\nIn a skillet, cook sliced onions in butter, over medium low heat, until a caramel color is reached (any onion that is burned during this process should be discarded).  Set aside.\nCombine chicken and beef broth in a 2 quart saucepan. Add fried garlic, fresh ground pepper and sauteed onions. Bring the soup mixture to a boil and then simmer over low heat for 15 minutes.  Stir in the packaged gravy mix and simmer for another 10 minutes.\nTurn on oven broiler and divide soup evenly among 4 oven safe soup crocks.  Place several croutons on the top of the soup followed by two slices of Swiss cheese on top of the croutons.  Make sure that the cheese does not sink into the soup. Place soup crocks on a cookie sheet and place under the broiler.  Broil until the cheese is golden brown and bubbling.  Let cool slightly before serving.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "50 m",
    "i": "2520828.jpg",
    "o": "",
    "st": "allrecipes"
}