{
    "id": 13240,
    "old_rating": "2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 pound diced bacon",
        "2 small onion, chopped",
        "12 cups water",
        "3 carrots, chopped",
        "4 (6.5 ounce) cans minced clams",
        "2 1/4 cups clam juice",
        "4 potatoes, peeled and cubed",
        "1 teaspoon kosher salt",
        "2 (14.5 ounce) cans stewed tomatoes",
        "1 1/2 teaspoons ground black pepper",
        "4 large stalks  celery, chopped",
        "1 cup ketchup",
        "4 cups whole milk",
        "1 1/2 cups dry potato flakes"
    ],
    "nut": [
        "Calories > 213 kcal",
        "Carbs > 22.1 g",
        "Cholesterol > 38 mg",
        "Fat > 7.6 g",
        "Protein > 14.4 g",
        "Sodium > 556 mg"
    ],
    "n": "Westcoast Style Clam Chowder",
    "a": "William Anatooskin",
    "r": "0",
    "s": 20,
    "des": "\"A clam chowder soup to be enjoyed.  Uncle Bill's Tips:  Fresh baby clams can be used instead of canned clams.  In order to do this you will need 4 pounds of baby clams in the shell.  First, steam clams in 2 1/2 cups water until they open. (Discard any clams that don't open.)  Save the liquid and pour through a very fine sieve to remove any particles.  Extract clams from the shell and add to soup; as directed in the recipe.  You can also use the left over liquid in place of clam juice.\"",
    "ins": "In medium skillet lightly fry bacon over medium heat; drain off fat and discard.  Add onions to bacon and saute approximately 3 minutes.  Do not brown.\nIn a large stock pot add water and bring to boil.  Once boiling add carrots, baby clams (including liquid), clam juice, potatoes, salt and pepper.\nUsing a food processor or blender, puree tomatoes.  Add to stock pot along with bacon-onion mixture and bring to boil.\nReduce heat and simmer for 30 minutes or until carrots and potatoes are tender.  Do not overcook.\nStir in celery and ketchup and cook for another 5 minutes.\nSlowly add milk, stirring constantly while bringing  just to boiling.\nFinally, add instant potato flakes and cook for 3 minutes.\nAdjust seasoning to taste. If soup is not to your desired thickness add more instant potato flakes, about 2 tablespoons at a time.\nRemove soup from heat and let sit for about 15 minutes before serving.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}