{
    "id": 132411,
    "old_rating": "4.40625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 teaspoon minced garlic",
        "1 portobello mushroom cap, cut into 1/2-inch slices",
        "1 large red bell pepper, cut into strips",
        "8 asparagus spears, trimmed",
        "1/2 teaspoon seasoned salt",
        "1/2 teaspoon dried oregano",
        "4 (6 ounce) skinless, boneless chicken breast halves",
        "1 (10.5 ounce) can cream of mushroom soup",
        "1 cup milk"
    ],
    "nut": [
        "Calories > 342 kcal",
        "Carbs > 13.8 g",
        "Cholesterol > 102 mg",
        "Fat > 13.3 g",
        "Protein > 40.7 g",
        "Sodium > 709 mg"
    ],
    "n": "Chicken and Portobello Rollups",
    "a": "Arthur Marania",
    "r": "0",
    "s": 4,
    "des": "\"Asparagus, portobello mushrooms and red pepper slices are wrapped in a breast of chicken and smothered to your liking of cream of mushroom soup.\"",
    "ins": "Heat olive oil in a skillet over medium heat. Stir in garlic, and cook until it begins to turn golden brown, about 1 minute. Add the mushroom, red pepper, and asparagus; season with seasoned salt and oregano, then gently cook until softened. Pour mixture onto a plate, and allow to cool.\nPreheat oven to 375  degrees F (190 degrees C). Spray a small, glass baking dish with cooking spray and set aside.\nPlace each chicken breast between two sheets of plastic wrap, and pound to 1/4-inch thick. Evenly divide the portobello, red pepper, and asparagus among the flattened chicken breasts. Roll up and secure with toothpicks. Place into prepared baking dish.\nBake chicken in preheated oven until no longer pink, about 30 minutes. Meanwhile, stir together cream of mushroom soup and milk in a saucepan over medium-high heat. Bring to a simmer, then reduce heat to low, and keep warm while chicken cooks.\nTo serve, remove toothpicks from chicken, slice each in half at an angle, and place onto a serving platter or individual plates. Ladle cream of mushroom soup overtop.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "4470471.jpg",
    "o": "",
    "st": "allrecipes"
}