{
    "id": 13246,
    "old_rating": "4.47887",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 skinless, boneless chicken breast halves - pounded thin",
        "3 tablespoons olive oil",
        "1 onion, chopped",
        "3 cloves garlic, minced",
        "1 pound chopped tomatillos",
        "2 jalapeno peppers, seeded and minced",
        "4 cups chicken stock",
        "1/4 teaspoon cayenne pepper",
        "1/2 teaspoon hot pepper sauce",
        "2 tablespoons chopped fresh cilantro",
        "1/4 cup sour cream (optional)",
        "salt to taste",
        "ground black pepper to taste"
    ],
    "nut": [
        "Calories > 159 kcal",
        "Carbs > 7.4 g",
        "Cholesterol > 27 mg",
        "Fat > 10.1 g",
        "Protein > 10.5 g",
        "Sodium > 43 mg"
    ],
    "n": "Tomatillo Soup",
    "a": "Holly",
    "r": "0",
    "s": 6,
    "des": "\"This is a great soup that can be spiced up or tamed down depending on your individual taste.  Keep in mind that you if can not purchase fresh tomatillos at your local grocery store you can substitute with canned tomatillos, drained and chopped. Try garnishing with sour cream, as indicated in the recipe. Top with a leaf of cilantro.\"",
    "ins": "Heat oil over high heat in a large saucepan or Dutch oven. Saute chicken in oil until both sides are browned, approximately 2 minutes per side.  Remove the chicken, and set aside.\nAdd onions and garlic to saucepan, and saute until golden.  Stir in the tomatillos, jalapeno peppers, and broth.  Bring to a boil.  Reduce heat, cover the pot, and simmer for about 15 minutes.\nPuree vegetables in batches in a blender or food processor.   Return to pot, and reheat.  At this point taste the soup; if not piquant enough, add cayenne pepper or pepper sauce.\nSlice the chicken into thin slices, and  then shred.  Stir into soup.  Season to taste with salt and pepper.\nWhen ready to serve, stir in the minced cilantro and ladle into bowls.  Put a dollop of sour cream on top of each portion, and let it melt a bit.  Top each dollop with a single cilantro leaf, and serve immediately.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "483412.jpg",
    "o": "4502436.jpg,4481306.jpg,4469855.jpg,4290642.jpg,4046099.jpg,4042221.jpg",
    "st": "allrecipes"
}