{
    "id": 13262,
    "old_rating": "4.1",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup margarine",
        "1 onion, chopped",
        "10 cups water",
        "2 large carrots, chopped",
        "5 potatoes, peeled and cubed",
        "1/2 cup pearl barley",
        "2 (14.5 ounce) cans fat-free chicken broth",
        "1 cup penne pasta",
        "3 stalks celery, chopped, with leaves",
        "4 tablespoons chicken bouillon powder",
        "1 red bell pepper, diced",
        "1 green bell pepper, chopped",
        "1/2 teaspoon ground white pepper",
        "1 1/2 cups cauliflower florets, broken into bite size pieces",
        "3/8 cup chopped fresh parsley",
        "3/4 teaspoon dried thyme",
        "3 tablespoons all-purpose flour",
        "2 cups whole milk",
        "2 tablespoons soy sauce"
    ],
    "nut": [
        "Calories > 170 kcal",
        "Carbs > 23.4 g",
        "Cholesterol > 4 mg",
        "Fat > 6.4 g",
        "Protein > 5.6 g",
        "Sodium > 740 mg"
    ],
    "n": "Potato Penne Soup",
    "a": "William Anatooskin",
    "r": "0",
    "s": 18,
    "des": "\"A very tasty, light creamy potato, penne and vegetable soup.  An excellent variety of ingredients to suit all tastes.\"",
    "ins": "In a large saute pan, melt margarine, add onions and cook over medium heat until translucent.   Reduce heat to low.\nIn a large stock pot, add water and bring to a boil.  Add carrots, potatoes, pearl barley, and cook for 10 minutes.  Add chicken broth, penne, celery (including leaves), chicken soup base, red bell pepper and green bell pepper and  bring back to a boil.  Reduce heat and cook for 15 minutes.\nAdd white pepper, cauliflower florets, parsley, thyme and cook for an additional 5 minutes.\nIn a food processor or blender, puree 3 cups of all-ready cooked soup and return to stock pot.\nIn a small mixing bowl, mix together flour and 3/4 cup whole milk; blend well.  Add flour mixture to the cooked onions and mix well.  Gradually add remainder of milk, stirring constantly until soup is heated through.\nAdd onion mixture to soup and stir.  Add soy sauce and bring  to a  boil.  Adjust seasonings to taste and serve soup hot.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}