{
    "id": 132633,
    "old_rating": "4.7",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup graham cracker crumbs",
        "3 tablespoons white sugar",
        "3 tablespoons butter, melted",
        "4 (8 ounce) packages cream cheese, softened",
        "1 cup white sugar",
        "3 tablespoons all-purpose flour",
        "4 eggs",
        "1 cup eggnog",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 453 kcal",
        "Carbs > 31.7 g",
        "Cholesterol > 164 mg",
        "Fat > 32.9 g",
        "Protein > 9.3 g",
        "Sodium > 319 mg"
    ],
    "n": "Kim's Eggnog Cheesecake",
    "a": "BRIMAT143",
    "r": "0",
    "s": 12,
    "des": "\"This is a wonderful cheesecake. The eggnog doesn't overpower the cheesecake and the cheesecake doesn't overpower the eggnog. The result is sinfully smooth and delicious!\"",
    "ins": "Lightly grease a 9-inch springform pan. Combine the graham cracker crumbs, 3 tablespoons white sugar, and butter in a bowl and mix until evenly moistened; press into the bottom of the prepared pan.\nCream together the cream cheese and 1 cup sugar using an electric mixer. Add the flour and beat until smooth. Mix in the eggs with the mixer switched to low. Pour in the eggnog and vanilla; continue beating until just blended. Stop the mixer and scrape the bottom of the bowl occasionally. Pour the mixture over the crust.\nFill a shallow dish with some hot water and place on bottom rack of the oven. Put cheesecake on the middle rack of the oven. Turn oven heat to 200 degrees F (95 degrees C). Do not preheat oven.\nBake the cheesecake until the center is set, about 3 hours 15 minutes. Turn oven off. Allow cheesecake to cool in the oven, about 3 hours. Chill in refrigerator overnight.",
    "pt": "20 m",
    "ct": "3 h",
    "tt": "3 h ",
    "i": "154540.jpg",
    "o": "4033838.jpg,1870034.jpg,1870028.jpg,1075751.jpg,1074755.jpg,740056.jpg",
    "st": "allrecipes"
}