{
    "id": 132745,
    "old_rating": "4.51724",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup mayonnaise",
        "2 tablespoons whole grain Dijon mustard",
        "2 tablespoons chopped fresh dill",
        "2 tablespoons chopped fresh tarragon",
        "1 teaspoon lemon juice",
        "1 teaspoon finely grated lemon zest",
        "1 teaspoon minced garlic",
        "1/2 teaspoon soy sauce",
        "Hot pepper sauce to taste",
        "Salt and white pepper to taste",
        "2 (5 ounce) wild salmon fillets",
        "8 slender asparagus spears, trimmed",
        "1 teaspoon vegetable oil",
        "4 lemon wedges for garnish"
    ],
    "nut": [
        "Calories > 523 kcal",
        "Carbs > 11.6 g",
        "Cholesterol > 94 mg",
        "Fat > 39.8 g",
        "Protein > 31.1 g",
        "Sodium > 722 mg"
    ],
    "n": "Parchment Salmon Packages with Asparagus",
    "a": "Lizzie Mac",
    "r": "0",
    "s": 2,
    "des": "\"These elegant packets look complicated, yet are quite simple to prepare. A seasoned salmon fillet is placed onto asparagus spears and wrapped in parchment paper using a French cooking method known as 'en papillote'. For maximum effect, snip the packets open at the dinner table, so the diner is presented with the wonderful, concentrated aromas! Serve with rice or fingerling potatoes.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nStir together mayonnaise, mustard, dill, tarragon, lemon juice, lemon zest, garlic, and soy sauce; season to taste with hot sauce, and salt and pepper. Sprinkle the salmon fillets with salt and pepper, then spread on all sides with the mayonnaise mixture; set aside.\nCut two 12 to 14-inch squares from a roll of parchment paper. Fold each piece in half along the longer side and cut a half-heart shape away from the fold, just like you did in elementary school to make valentines. Open the paper hearts and smear the top-side of each sheet with a little vegetable oil, and place 4 asparagus spears onto one side. Place the salmon, skin-side down, on top of the asparagus spears.\nFold the parchment paper over the salmon (like closing a book). Roll the edges inwards to seal, leaving you with a secure packet. Place the packets onto a baking sheet.\nBake in preheated oven until the parchment has turned golden brown and a kitchen thermometer inserted into the salmon reaches 125 degrees F (52 degrees C), 6 to 10 minutes.\nTo serve, place unopened packets onto dinner plates accompanied by the lemon wedges. Use kitchen shears to snip open the packets at the dinner table, to release the aroma the moment before eating!",
    "pt": "15 m",
    "ct": "8 m",
    "tt": "23 m",
    "i": "619611.jpg",
    "o": "",
    "st": "allrecipes"
}