{
    "id": 132864,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups eggnog",
        "4 egg yolks",
        "1/4 cup white sugar",
        "3 ounces mascarpone cheese, softened",
        "1 dash ground nutmeg (optional)",
        "1 dash ground cinnamon (optional)",
        "1 teaspoon vanilla extract (optional)"
    ],
    "nut": [
        "Calories > 367 kcal",
        "Carbs > 30.8 g",
        "Cholesterol > 306 mg",
        "Fat > 23.7 g",
        "Protein > 9 g",
        "Sodium > 88 mg"
    ],
    "n": "Eggnog Creme Brulee",
    "a": "Brian M Jones",
    "r": "0",
    "s": 4,
    "des": "\"I have been making creme brulee for my wife for quite some time and one day she asked me, 'Honey, is it possible to make creme brulee out of eggnog? I think that would be so yummy.' So, I bought some eggnog and set about finding out if it is possible, and it is. You can also take the same recipe and pour it into a prepared pie crust for an eggnog custard pie. It's a lot less work and hassle than individual ramekins.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Place 4 ramekins or custard cups into a shallow baking dish, and fill the dish with water to half-way up the sides of the ramekins.\nPour the eggnog into a pan over medium heat. Cook and stir occasionally until the mixture simmers, about 10 minutes.\nMeanwhile, place the egg yolks and sugar into a mixing bowl; beat until light colored and frothy. Stir in the mascarpone until well blended and smooth. Whisk 1/4 cup of the heated eggnog mixture into the eggs. Gradually whisk the remaining eggnog into the eggs. Pour the mixture through a fine sieve to remove any egg strands. If desired, stir in the nutmeg, cinnamon, and vanilla. Pour into the prepared ramekins, dividing evenly.\nBake in preheated oven until custard has set, 30 to 45 minutes. Centers should wiggle slightly when shaken, but not be soupy.\nRemove from oven and cool 30 minutes; refrigerate at least 3 hours before serving.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "4 h ",
    "i": "1921753.jpg",
    "o": "",
    "st": "allrecipes"
}