{
    "id": 132951,
    "old_rating": "4.13636",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 quart heavy cream",
        "1/2 cup white sugar",
        "2 teaspoons vanilla extract",
        "9 egg yolks",
        "1/2 cup chocolate chips",
        "2 tablespoons white sugar, or as needed"
    ],
    "nut": [
        "Calories > 778 kcal",
        "Carbs > 35.2 g",
        "Cholesterol > 525 mg",
        "Fat > 69.5 g",
        "Protein > 7.8 g",
        "Sodium > 74 mg"
    ],
    "n": "Easy Chocolate Creme Brulee",
    "a": "LSNEED62",
    "r": "0",
    "s": 6,
    "des": "\"What can be better than silky smooth creme brulee with rich chocolate?  You don't even need to water-bath this version! Use heart-shaped ramekins for a Valentines Day treat.  This so easy and delicious, you'll look like a professional chef! For an elegant presentation, top with a few raspberries and a mint sprig.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Set 6 (6 ounce) ramekins on a baking sheet.\nPour cream, sugar, and vanilla into a saucepan, and place over medium heat. Stir to dissolve the sugar, and heat until it begins to simmer, then remove from heat. Place egg yolks in a large bowl, and slowly whisk in the hot cream mixture, about 2 tablespoons at a time, until you have added approximately a cup of cream to the yolks. At this point, pour in the remaining cream, and whisk until smooth. Stir in the chocolate chips, and set aside for 5 minutes.\nStir the mixture until the chocolate is smooth and evenly distributed. Pour into ramekins, and bake in preheated oven until the center is just set, 15 to 20 minutes. Remove from oven, and allow to cool for 45 minutes, then place into the refrigerator, and chill until cold, about 6 hours.\nPlace oven rack in topmost position. Turn oven to Broil.\nSprinkle the tops of each creme brulee with sugar until evenly coated, gently pour off excess sugar. Place ramekins onto a baking sheet, and place under the broiler until the sugar bubbles and turns a light caramel brown. Serve immediately.",
    "pt": "5 m",
    "ct": "30 m",
    "tt": "7 h ",
    "i": "812954.jpg",
    "o": "",
    "st": "allrecipes"
}