{
    "id": 133021,
    "old_rating": "4.41414",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 ounces elbow macaroni",
        "2 tablespoons light olive oil",
        "2 tilapia fillets",
        "1 tablespoon lemon juice",
        "1/8 teaspoon dried oregano",
        "1 pinch dried basil",
        "1 pinch dried cilantro",
        "1 pinch salt and ground black pepper",
        "For the pasta:",
        "1 tablespoon light olive oil",
        "1/4 cup freshly grated Parmesan cheese",
        "1 teaspoon lemon juice",
        "1 pinch garlic powder",
        "1 pinch dried basil",
        "1 pinch dried oregano",
        "1 pinch dried cilantro (optional)",
        "1 pinch salt and ground black pepper"
    ],
    "nut": [
        "Calories > 555 kcal",
        "Carbs > 44.8 g",
        "Cholesterol > 50 mg",
        "Fat > 26.3 g",
        "Protein > 34.8 g",
        "Sodium > 618 mg"
    ],
    "n": "Pan Seared Lemon Tilapia with Parmesan Pasta",
    "a": "vo0do0",
    "r": "0",
    "s": 2,
    "des": "\"Citrusy tilapia, served with a cheesy but light pasta.\"",
    "ins": "Bring a saucepan of lightly salted water to a boil over medium heat, stir in the macaroni, and return to a boil. Cook the macaroni uncovered, stirring occasionally, until it is cooked through but still firm to the bite, about 8 minutes. Drain well.\nMeanwhile, heat 2 tablespoons of olive oil in a skillet over medium heat. Sprinkle both sides of the tilapia fillets with lemon juice, oregano, basil, cilantro, salt, and pepper, and lay the fillets in the heated skillet, making sure they don't touch. Sear the fillets for 2 to 4 minutes on each side, until the fish is golden brown on the outside, and opaque and flaky inside.\nReturn the hot, cooked macaroni to the saucepan, and stir in 1 tablespoon of olive oil to coat the pasta. Sprinkle on the Parmesan cheese, stir to mix, and stir in 1 teaspoon of lemon juice, the garlic powder, basil, oregano, cilantro, salt, and pepper. Divide the pasta between two plates, and top each with a tilapia fillet.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "25 m",
    "i": "381618.jpg",
    "o": "4470860.jpg,4095841.jpg,4055561.jpg,4005283.jpg,3724869.jpg,3179619.jpg",
    "st": "allrecipes"
}