{
    "id": 133033,
    "old_rating": "4.41071",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter, softened",
        "3 tablespoons all-purpose flour",
        "1 tablespoon mustard powder",
        "3 cups cubed fully cooked ham",
        "8 ounces Cheddar cheese, cubed",
        "3 cups cubed day old French bread",
        "4 eggs, beaten",
        "3 cups milk",
        "1 dash hot pepper sauce",
        "3 tablespoons butter, melted",
        "1/2 cup freshly grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 357 kcal",
        "Carbs > 19.8 g",
        "Cholesterol > 121 mg",
        "Fat > 21.9 g",
        "Protein > 19.9 g",
        "Sodium > 857 mg"
    ],
    "n": "French Ham Cheese and Egg Fondue Casserole",
    "a": "SheasLounge",
    "r": "0",
    "s": 12,
    "des": "\"This delicate dish loaded with ham, cheese and bread cubes in an egg mixture is perfect for brunch or supper. Light and fluffy casserole that is sure to please your guests. Goes great with some fresh fruit and blueberry muffins! Another plus is you make it day ahead, so you have more time out of the kitchen!\"",
    "ins": "Generously grease a 9x13-inch glass baking dish with softened butter. Stir together flour and mustard powder. Place ham and Cheddar cubes in a large mixing bowl, sprinkle with flour mixture, and toss until evenly coated. Add bread cubes and toss to mix. In a separate bowl, whisk together eggs, milk, and hot pepper sauce.\nPour 1/3 of the bread mixture into the prepared baking dish and smooth out to form a layer. Drizzle with 1 tablespoon of butter, and sprinkle with 1/3 of the Parmesan cheese. Repeat twice more to form three layers. Pour egg mixture overtop, cover with plastic wrap, and refrigerate 8 hours to overnight.\nThe next morning, remove casserole from refrigerator, remove plastic wrap, and allow to stand at room temperature for 30 minutes. Preheat oven to 350 degrees F (175 degrees C).\nBake uncovered in preheated oven until the eggs have set, and the top is golden brown and crispy, about 1 hour.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "10 h",
    "i": "2262666.jpg",
    "o": "",
    "st": "allrecipes"
}