{
    "id": 13397,
    "old_rating": "4.26829",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package dried navy beans",
        "1 (10 ounce) meaty ham bone or smoked pork hocks",
        "10 cups water",
        "1 (8 ounce) box elbow macaroni",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "3 cloves garlic, minced",
        "1 (16 ounce) can diced tomatoes",
        "2 stalks celery, diced",
        "1 carrot, diced",
        "1/2 teaspoon red pepper flakes, or to taste",
        "1 cup water",
        "salt and pepper to taste",
        "2 tablespoons chopped fresh parsley"
    ],
    "nut": [
        "Calories > 333 kcal",
        "Carbs > 59.9 g",
        "Cholesterol > 0 mg",
        "Fat > 3.1 g",
        "Protein > 17.1 g",
        "Sodium > 150 mg"
    ],
    "n": "Pasta e Fagioli III",
    "a": "Leo J. Lagrotte",
    "r": "0",
    "s": 8,
    "des": "\"There are many recipes for this traditional Italian mainstay, usually served as a meal. Here's another that is slightly different.  If you are in a hurry, substitute the dried beans with 3 (16 ounce) cans white, navy, great northern, or cannelini beans. Serve with a salad and crusty Italian bread.\"",
    "ins": "Place navy beans, ham bone, and 10 cups of water into a large saucepan or Dutch oven. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until the beans are tender, from 1 1/2 to 2 hours.\nMeanwhile, bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente. Drain, rinse with cold water to chill, then set aside.\nOnce beans are nearly ready, heat olive oil in a Dutch oven over medium heat. Stir in onion and garlic, cook until the onion has softened and turned translucent, about 5 minutes. Stir in tomatoes, celery, carrot, red pepper flakes, and 1 cup of water; bring to a simmer, then reduce heat to medium-low and cook until the carrot has softened, about 10 minutes. While the tomato mixture simmers, remove the ham bone from the beans. Separate the meat from the bone; dice the meat, and discard the bone.\nTo finish the soup, stir the beans, cooked macaroni, and diced ham into the tomato mixture; add additional water if needed to make a chunky soup. Season to taste with salt and pepper; simmer until the macaroni and beans are both quite tender, from 5 to 15 minutes. Stir in chopped parsley before serving.",
    "pt": "20 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "1651227.jpg",
    "o": "",
    "st": "allrecipes"
}