{
    "id": 13426,
    "old_rating": "4.34184",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cinnamon Croutons:",
        "3 tablespoons butter, softened",
        "1 tablespoon brown sugar",
        "1/4 teaspoon ground cinnamon",
        "4 slices whole wheat bread",
        "Soup:",
        "1 cup chopped onion",
        "2 tablespoons butter, melted",
        "2 (14.5 ounce) cans chicken broth",
        "1 (15 ounce) can pumpkin puree",
        "1 teaspoon salt",
        "1/4 teaspoon ground cinnamon",
        "1/8 teaspoon ground ginger",
        "1/8 teaspoon ground black pepper",
        "1 cup heavy whipping cream"
    ],
    "nut": [
        "Calories > 322 kcal",
        "Carbs > 20.2 g",
        "Cholesterol > 83 mg",
        "Fat > 25.4 g",
        "Protein > 5.1 g",
        "Sodium > 1313 mg"
    ],
    "n": "Cream of Pumpkin Soup",
    "a": "Thomas",
    "r": "0",
    "s": 6,
    "des": "\"A creamy pumpkin soup for autumn. This soup is smooth and flavorful, and the addition of ginger lends a sweet and spicy flavor to a traditional seasonal dish. The cinnamon croutons are lovely and make the soup reminiscent of pumpkin pie.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). To make the croutons, combine softened butter, brown sugar, and cinnamon. Spread butter mixture  evenly over one side of each bread slice. Place bread, buttered side up, on a baking sheet. Bake 8 to 10 minutes, or until bread is crisp and topping is bubbly. Cut each slice of bread into 8 small triangles or squares.\nSaute onion in butter in a medium saucepan until tender. Add 1 can chicken broth; stir well. Bring to a boil; cover, reduce heat, and simmer 15 minutes.\nTransfer broth mixture into the container of a blender or processor. Process until smooth.\nReturn mixture to saucepan. Add remaining can of broth, pumpkin, salt, ground cinnamon, ground ginger, and ground pepper; stir well. Bring to a boil; cover, reduce heat, and simmer 10 minutes more, stirring occasionally.\nStir in whipping cream and heat through. Do not boil. Ladle into individual soup bowls. Top each serving with Cinnamon Croutons.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "497671.jpg",
    "o": "4468869.jpg,4376873.jpg,3165190.jpg,2794339.jpg,2683838.jpg,1633456.jpg",
    "st": "allrecipes"
}