{
    "id": 134291,
    "old_rating": "4.13333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (4 ounce) boneless pork loin chops",
        "1/2 teaspoon salt, or to taste",
        "1/2 teaspoon pepper",
        "3 tablespoons all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon freshly grated nutmeg",
        "1 pinch ground allspice",
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "1 cup apple cider",
        "2 tablespoons cornstarch",
        "1/2 cup chicken broth",
        "1/2 cup half-and-half or cream"
    ],
    "nut": [
        "Calories > 589 kcal",
        "Carbs > 36.6 g",
        "Cholesterol > 115 mg",
        "Fat > 34.5 g",
        "Protein > 31.9 g",
        "Sodium > 1299 mg"
    ],
    "n": "Pork Loin Chops in Apple Cream",
    "a": "Kathy Midkiff Goins",
    "r": "0",
    "s": 2,
    "des": "\"A simple twist on an old Shaker dish. Pork chops are browned, then simmered in an apple cider infusion and finished in half-and-half or cream.  Makes a great dinner for two, simple to prepare, hearty enough for him, but delicious by any standards. Can substitute chicken breasts for the pork loin chops.\"",
    "ins": "Season pork chops on all sides with 1/2 teaspoon salt, and 1/2 teaspoon pepper; set aside. Combine the flour, 1/2 teaspoon salt, 1/2 teaspoon pepper, nutmeg, and allspice in a plastic bag. Toss pork with seasoned flour to coat, and shake off excess.\nHeat butter and olive oil in a skillet over medium-high heat until lightly smoking. Sear pork until golden brown on each side, about 3 minutes per side. Pour in apple cider and bring to a boil. Turn heat to medium-low, cover, and simmer until pork is fork tender, 15 to 20 minutes. Remove pork and keep warm; increase heat to medium-high. Dissolve cornstarch in the chicken broth, and stir into simmering cider; cook for a minute or two until thickened. Stir in the half-and-half and simmer until hot. Serve sauce over the pork chops.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "626718.jpg",
    "o": "",
    "st": "allrecipes"
}