{
    "id": 134319,
    "old_rating": "3.28571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "2 tablespoons lard",
        "1 cup whole milk",
        "1 egg, well beaten",
        "1 cup queso chanco (or Swiss cheese or Havarti), cut into 1/2-inch cubes"
    ],
    "nut": [
        "Calories > 343 kcal",
        "Carbs > 39 g",
        "Cholesterol > 57 mg",
        "Fat > 13.8 g",
        "Protein > 14.8 g",
        "Sodium > 287 mg"
    ],
    "n": "Empanadas Fritas de Queso",
    "a": "damasio",
    "r": "0",
    "s": 8,
    "des": "\"These empanadas use queso chanco, but a good substitute is a mixture of Swiss and Havarti. I usually bake mine, but they are really good fried. I serve these with a chile-Chile sauce.\"",
    "ins": "Sift the flour, baking powder, and salt into a large mixing bowl. Combine the lard and milk in a saucepan, and heat until the milk is hot. Pour the hot milk into the flour mixture, and stir until a dough forms. Turn out onto a floured surface, and knead until smooth and elastic. Cover, and allow to rest for 15 minutes.\nPreheat oven to 375  degrees F (190 degrees C).\nRoll the dough out on a floured surface 1/4-inch thick. Cut into 4-inch rounds. Brush the outer edges of each circle with beaten egg, and fill with a small mound of cheese. Fold each circle in half to form a half-moon; press the edges with your fingers or a fork to seal. Place the empanadas onto a parchment paper-lined baking sheet. Brush the tops with remaining egg.\nBake in preheated oven until golden-brown, about 20 minutes.\nAlternatively, the empanadas may be deep fried in 375 degrees F (190 degrees C) oil. If deep frying, do not brush the outsides of the empanadas with egg. Drain on paper towels.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "55 m",
    "i": "146932.jpg",
    "o": "",
    "st": "allrecipes"
}