{
    "id": 134313,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (3 1/2) pound chicken",
        "3 tablespoons fresh lime juice",
        "Salt and pepper to taste",
        "Cayenne pepper, or other ground chile to taste",
        "2 tablespoons butter, softened (for spreading)",
        "1 onion, cut into wedges",
        "5 cloves garlic, peeled",
        "2 large stalks celery, cut into chunks",
        "1 (750 milliliter) bottle Chilean Sauvignon Blanc or Chardonnay",
        "2 tablespoons butter",
        "1/4 cup finely chopped shallots",
        "1 tablespoon minced garlic",
        "1/2 cup brandy"
    ],
    "nut": [
        "Calories > 518 kcal",
        "Carbs > 10.5 g",
        "Cholesterol > 92 mg",
        "Fat > 24.9 g",
        "Protein > 25.6 g",
        "Sodium > 147 mg"
    ],
    "n": "Pollo Borracho",
    "a": "damasio",
    "r": "0",
    "s": 6,
    "des": "\"This luscious, satisfying chicken dish gains its richness from a sauce of shallots and brandy.\"",
    "ins": "Rinse the chicken thoroughly, and pat dry. Rub the skin and cavity with the lime juice, then sprinkle with salt, pepper, and cayenne; set aside for 15 minutes to let the flavors soak in.\nSmear the chicken evenly with the softened butter, and stuff the cavity with onion, garlic, and celery.  Place into a pot that is just big enough to hold the chicken, breast-side up. Pour in the bottle of wine, cover the pan, and bring to a boil over high heat. Reduce the heat to medium-low, and gently simmer the chicken until tender, 1 to 1 1/2-hours.\nWhen the chicken has cooked, remove it, and continue simmering the broth. Melt 2 tablespoons of butter in a saucepan over medium heat. Stir in the shallots and garlic, cook until the shallots soften, and turn translucent. Strain the chicken broth through a fine mesh sieve, and add to the shallots.\nPour in the brandy, and bring to a boil over high heat. Reduce heat to medium, then simmer for 10 to 15 minutes. While the sauce is simmering, remove the vegetables from the cavity of the chicken and discard. Remove the breast meat, legs, and any other meat remaining on the bones.\nTo serve, cut the breast into 1/2-inch thick slices, and separate the legs into drumsticks and thighs. Arrange the chicken on a serving dish, and bathe with the sauce.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "33650.jpg",
    "o": "",
    "st": "allrecipes"
}