{
    "id": 13462,
    "old_rating": "4.80841",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 (11 ounce) containers refrigerated soft bread stick dough",
        "1 egg",
        "1 tablespoon water"
    ],
    "nut": [],
    "n": "Cornucopia",
    "a": "Becky",
    "r": "0",
    "s": 1,
    "des": "\"An easy Cornucopia centerpiece for your Thanksgiving table. Fill the cornucopia with the assorted raw vegetables directly on table and let them spill out of opening  NOTE- To prevent this center-piece from absorbing atmospheric moisture, the baked cornucopia cone can be sprayed with shellac or clear enamel. If treated in this manner, the cornucopia will be inedible but can be preserved and re-used.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly spray a 17x14 inch (or lager) cookie sheet with non-stick cooking spray.\nTear off a 30x18 inch sheet of heavy duty aluminum foil. Fold it in half to 18x15 inch. Roll diagonally to form a hollow cone, about 18 inches long with a diameter of 5 inches at the widest end (Cornucopia opening). Fasten end with clear tape. Stuff cone with crumpled regular foil until form is rigid. Bend tail of cone up then down at end. Spray outside of cone with non-stick cooking spray. Place on cookie sheet.\nBeat the egg with the water to make a glaze. Open and unroll the first can of breadstick dough on work surface. Separate breadsticks. Begin by wrapping one breadstick around tip of cone. Brush end of next breadstick with Glaze and press to attach to end of first breadstick. Continue spiral-wrapping cone, slightly overlapping dough until there are 3 breadsticks left.\nPinch one end of the 3 breadsticks together, then braid. Brush bread around opening of cornucopia with glaze. Gently press on braid. Brush entire cornucopia with glaze.\nBake at 350 degrees F (175 degrees C) for 45 minutes or until bread is a rich brown. (If parts start to darken too much, cover them with pieces of foil.)\nRemove from oven and let cool completely on cookie sheet on a wire rack. Carefully remove foil when cool. (If freezing, leave foil in bread for support. Remove when thawed.)",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4204854.jpg",
    "o": "4204854.jpg,3761291.jpg,3087016.jpg,3086971.jpg,2918617.jpg,2915286.jpg",
    "st": "allrecipes"
}