{
    "id": 13511,
    "old_rating": "3.77778",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground turkey",
        "1 clove garlic, minced",
        "3/4 cup fresh bread crumbs",
        "1/2 cup finely diced onion",
        "3 tablespoons chopped, toasted pine nuts",
        "1/2 cup chopped fresh parsley",
        "1 egg, lightly beaten",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "4 tablespoons olive oil",
        "1 (16 ounce) package ziti pasta",
        "1 1/2 cups mozzarella cheese, shredded",
        "1 cup grated Romano cheese",
        "6 cups tomato sauce",
        "1 pint part-skim ricotta cheese"
    ],
    "nut": [
        "Calories > 691 kcal",
        "Carbs > 66.2 g",
        "Cholesterol > 122 mg",
        "Fat > 29.8 g",
        "Protein > 40.4 g",
        "Sodium > 1795 mg"
    ],
    "n": "Baked Ziti with Turkey Meatballs",
    "a": "Christine L.",
    "r": "0",
    "s": 8,
    "des": "\"Turkey soup is not enough. Something different for that leftover turkey.\"",
    "ins": "In a bowl, stir together turkey, garlic, bread crumbs, onion, pine nuts, parsley, egg, salt and pepper. Form into meatballs about 1 inch in diameter.\nIn a large heavy skillet, heat 2 tablespoons oil over moderately high heat until hot but not smoking. Cook half of meatballs, shaking skillet, until browned and cooked through, about 4 minutes.  Transfer meatballs to paper towels to drain.  Brown remaining meatballs in remaining 2 tablespoons oil in same manner.\nPreheat oven to 375 degrees F (190 degrees C).   Oil a 3 to 4 quart gratin dish.\nBring a large pot of salted water to a boil.   Add the pasta, and cook until just al dente, about 8 minutes.  Drain.\nIn a small bowl, toss together mozzarella and Romano cheese.\nSpoon about 1 1/2 cups tomato sauce and half the meatballs into prepared dish, and spoon half the pasta on top.  Spread half remaining sauce and half cheese mixture over pasta.  Top with remaining meatballs, and drop dollops of ricotta over meatballs.  Spread remaining pasta over ricotta, and top with remaining sauce and cheese mixture.  Bake in middle of oven for 30 to 35 minutes, or until golden.  Let stand 10 minutes before serving.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "4451901.jpg",
    "o": "",
    "st": "allrecipes"
}