{
    "id": 13529,
    "old_rating": "4.61111",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "7 cups low-sodium chicken broth",
        "3 pounds potatoes, peeled and cubed",
        "1 1/2 pounds rutabagas, peeled and cubed",
        "1 1/4 pounds parsnips, peeled and cut into 1 1/2 inch pieces",
        "8 cloves garlic",
        "1 bay leaf",
        "1 teaspoon dried thyme",
        "3/4 cup butter, softened",
        "3 onions, thinly sliced",
        "salt to taste",
        "ground black pepper to taste"
    ],
    "nut": [
        "Calories > 361 kcal",
        "Carbs > 49 g",
        "Cholesterol > 44 mg",
        "Fat > 16.2 g",
        "Protein > 8 g",
        "Sodium > 229 mg"
    ],
    "n": "Mashed Potato, Rutabaga, And Parsnip Casserole With Caramelized Onions",
    "a": "Christine L.",
    "r": "0",
    "s": 9,
    "des": "\"This is great with Apricot Glazed Turkey and Green Beans With Walnuts And Walnut Oil.  This dish can be made one day ahead. The broth made in this recipe can be used as stock for turkey soup.\"",
    "ins": "Combine chicken broth, potatoes, rutabagas, parsnips, cloves, bay leaf, and thyme in a large pot. Bring to a boil.  Reduce heat, and cover partially.  Simmer until vegetables are very tender, about 30 minutes. Drain.\nTransfer vegetables to large bowl. Add 1/2 cup butter or margarine . Use an electric mixer, beat mixture until mashed but still chunky.  Season with salt and pepper. Transfer mashed vegetables to a buttered 13 x 9 x 2 inch baking dish.\nMelt remaining 1/4 cup butter or margarine in a heavy large skillet over medium-high heat. Add sliced onions.  Saute until beginning to brown, about 5 minutes.  Reduce heat to medium-low.  Saute until onions are tender and golden brown, about 15 minutes.  Season with salt and pepper.  Spread onions evenly over mashed vegetables. Casserole can be prepared up to 1 day ahead.  Cover and refrigerate.\nPreheat oven to 375 degrees F (190 degrees C).  Bake, uncovered, for 25 minutes, or until heated through and top begins to crisp.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "4472362.jpg",
    "o": "",
    "st": "allrecipes"
}