{
    "id": 13522,
    "old_rating": "4.70408",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 cups white bread cubes",
        "1 pound sweet Italian sausage, casings removed",
        "1/4 cup butter",
        "6 cups coarsely chopped leeks",
        "2 tart green apples - peeled, cored and chopped",
        "2 cups chopped celery",
        "4 teaspoons poultry seasoning",
        "2 teaspoons dried rosemary, chopped",
        "1 cup dried cranberries",
        "1 1/3 cups chicken broth",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 359 kcal",
        "Carbs > 41.5 g",
        "Cholesterol > 39 mg",
        "Fat > 17.5 g",
        "Protein > 9.9 g",
        "Sodium > 839 mg"
    ],
    "n": "Cranberry, Sausage and Apple Stuffing",
    "a": "Ibby",
    "r": "0",
    "s": 12,
    "des": "\"A mellow stuffing that pairs up perfectly with the Roast Turkey with Maple Herb Butter and Gravy.  If leeks are not available, substitute 4 cups chopped onions.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spread bread cubes in a single layer over two baking sheets. Bake until slightly dry, about 15 minutes.\nIn a large skillet over medium heat, cook sausage, crumbling coarsely, for about 10 minutes or until evenly brown. Drain off grease, and transfer sausage to a large bowl.\nMelt butter in the skillet; add leeks, apples, celery, and poultry seasoning. Cook, stirring frequently, for about 10 minutes. Stir in the rosemary and dried cranberries.\nMix leek mixture and bread cubes with sausage in bowl. Lightly mix chicken broth into stuffing to moisten; season with salt and black pepper. Spoon stuffing into turkey, packing loosely.\nBake remaining stuffing in a buttered baking dish, covered, at 350 degrees F (175 degrees C) for about 45 minutes.  Uncover, and bake another 15 minutes to brown top.",
    "pt": "35 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}