{
    "id": 13549,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds chestnuts",
        "2 cups butter",
        "2 cups minced onion",
        "2 cups minced celery",
        "10 cups dried bread crumbs",
        "1 teaspoon dried thyme",
        "1 teaspoon dried marjoram",
        "1 teaspoon dried savory",
        "1 teaspoon dried rosemary",
        "12 pounds whole turkey, neck and giblets removed",
        "salt and freshly ground black pepper to taste"
    ],
    "nut": [
        "Calories > 1103 kcal",
        "Carbs > 76.3 g",
        "Cholesterol > 262 mg",
        "Fat > 51.2 g",
        "Protein > 79.4 g",
        "Sodium > 838 mg"
    ],
    "n": "Roast Turkey With Tasty Chestnut Stuffing",
    "a": "Christine L.",
    "r": "0",
    "s": 16,
    "des": "\"Simple but seriously yummy.\"",
    "ins": "With a sharp knife cut a cross on the flat side of each chestnut. Simmer, covered with water, in a saucepan for 5 minutes. Drain. While hot, remove the shells and inner brown skins. Cover with fresh water. Boil for 20 to 30 minutes until tender. Drain. Chop coarsely.\nTo prepare the stuffing, melt the butter in a medium saucepan over medium heat. Stir in onions and celery, and cook until tender.  Thoroughly mix in bread crumbs and chestnuts. Season with thyme, marjoram, savory, and rosemary.\nPreheat oven to 350 degrees F (175 degrees C).\nWash turkey with cold water, and pat dry.  Rub salt and pepper into body cavities.  Loosely spoon stuffing into body cavities. Close skin with skewers or kitchen twine, and tie drumsticks together. Place turkey on a rack in a medium roasting pan.\nRoast turkey 3 1/2 to 4 1/2 hours in the preheated oven, until internal temperature of thigh reaches 180 degrees F (80 degrees C) and stuffing reaches 165 degrees F (75 degrees C). A foil tent may be placed over the turkey during the last half of roasting time to avoid over browning. Remove from oven, place on platter, and allow the turkey to stand for 20 minutes before carving.",
    "pt": "45 m",
    "ct": "4 h ",
    "tt": "5 h ",
    "i": "925501.jpg",
    "o": "",
    "st": "allrecipes"
}