{
    "id": 13622,
    "old_rating": "4.74016",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds Granny Smith apples",
        "1 cup white sugar",
        "1/2 cup brown sugar",
        "2 teaspoons ground cinnamon",
        "1/2 cup all-purpose flour",
        "2 tablespoons butter",
        "1 tablespoon white sugar",
        "1 recipe pastry for a 9 inch double crust pie"
    ],
    "nut": [
        "Calories > 492 kcal",
        "Carbs > 81 g",
        "Cholesterol > 8 mg",
        "Fat > 18.3 g",
        "Protein > 3.9 g",
        "Sodium > 257 mg"
    ],
    "n": "Aunt Carol's Apple Pie",
    "a": "Jo Ann Taylor",
    "r": "0",
    "s": 8,
    "des": "\"Everyone in the family has something that they're the best at making. I make the best cookies, my sister, Carol, makes the best pies in the whole world!...no competition in our family! This recipe includes an ingredient called free-flowing brown sugar. This is a non-clumping or caking version of ordinary brown sugar. It has a lower moisture content then the traditional one, which makes it free flowing much like granulated sugar. It is available at most specialty supermarket. If it is not available in your part of the world, use regular brown sugar and make sure it is broken up, free of clumps. Macintosh or Granny Smith apples are the best choices for apple pie because they are the least mushy apples.\"",
    "ins": "Peel and slice apples. Toss with sugars, cinnamon and flour. Set aside.\nRoll crust to make slightly larger to fit 10-inch glass pie pan. Fit bottom crust in pie pan. Turn in apple mixture and dot with butter. Put crust on top and crimp edges of crust together.\nPreheat oven to 450 degrees F (230 degrees C).\nWet hands with water and dampen top of pie. Sprinkle with additional sugar. Puncture top of pie with fork so the steam can escape.\nBake for 15 minutes in preheated oven. Reduce heat to 350 degrees F (175 degrees C) and continue baking for about 45 minutes more, until crust is golden brown. It's a good practice to place a piece of aluminum foil slightly larger than the pie under the pie plate to catch overflows. Serve warm.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "925400.jpg",
    "o": "4471586.jpg,4216725.jpg,4033106.jpg,4031804.jpg,4018290.jpg,4015310.jpg",
    "st": "allrecipes"
}