{
    "id": 136454,
    "old_rating": "4.22222",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter",
        "1/2 cup finely chopped onion",
        "1/2 cup water",
        "1 (8 ounce) can tomato sauce",
        "4 cups unsifted all-purpose flour (divided)",
        "2 tablespoons white sugar",
        "1 1/2 teaspoons salt",
        "3 (.25 ounce) packages active dry yeast",
        "1 egg, at room temperature",
        "1/4 teaspoon vegetable oil",
        "1/2 pound sharp Cheddar cheese, shredded",
        "1 egg, at room temperature",
        "1 teaspoon water"
    ],
    "nut": [
        "Calories > 164 kcal",
        "Carbs > 18.2 g",
        "Cholesterol > 36 mg",
        "Fat > 7.7 g",
        "Protein > 5.6 g",
        "Sodium > 287 mg"
    ],
    "n": "Cheddar Rolls",
    "a": "MOLLYSMAMA",
    "r": "0",
    "s": 24,
    "des": "\"These unique rolls are easy-cheesy. The tomato sauce adds a bit of tang and turns the dough an orange color. I use my heavy-duty electric mixer for this, so I don't have to knead it by hand. Also, with the extra yeast, dough can be refrigerated for up to 24 hours before forming and baking.\"",
    "ins": "Heat the butter in a skillet over medium-low heat; stir in the onion, and cook until translucent, about 5 minutes. Pour in the water and tomato sauce, stir to combine, and bring the mixture to lukewarm temperature, about 110 degrees F/45 degrees C).\nCombine 1 cup of flour, sugar, salt, and yeast in the work bowl of a stand mixer, and pour the tomato sauce mixture into the bowl. Mix on low for 2 minutes to make a loose spongy dough, then beat in 1 egg and 1 more cup of flour. Beat for 2 minutes on high speed to develop the gluten, and stir in the remaining 2 cups of flour. Let the machine knead the dough on high speed until it is smooth and elastic (or knead by hand for about 10 minutes).\nLightly spray or wipe the top of the dough with vegetable oil, cover the mixer bowl with a cloth, and let the dough rise until doubled, about 2 hours.\nPunch down the dough, cut it in half, and place one half on a floured work surface. Cover the other piece of dough with a cloth to prevent drying out. Roll the first piece of dough out into a rectangle about 9x12 inches, and cut the rectangle into 12 squares about 3 inches on a side.\nGrease a baking sheet, or line with parchment paper. Place about 2 teaspoons of shredded Cheddar cheese in the center of each square, and fold the squares into triangles, enclosing the filling. Pinch the edges tightly closed, and place filled rolls on the prepared baking sheet while you fill the rest. Repeat with the other piece of dough, to make about 24 rolls. Cover the rolls with a cloth, and let stand until doubled, about 1 hour.\nPreheat an oven to 375 degrees F (190 degrees C).  Beat 1 egg in a bowl with 1 teaspoon of water, and set aside.\nBrush each roll with the egg wash, and bake in the preheated oven until the tops are browned and the cheese has melted, about 15 minutes.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "3 h ",
    "i": "301949.jpg",
    "o": "",
    "st": "allrecipes"
}