{
    "id": 136566,
    "old_rating": "4.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter, softened",
        "2 cups white sugar",
        "8 eggs",
        "2 teaspoons baking soda",
        "2 tablespoons water",
        "2 cups seedless blackberry jam",
        "3 1/2 cups all-purpose flour",
        "1 1/2 teaspoons ground cloves",
        "2 teaspoons ground nutmeg",
        "1 tablespoon ground cinnamon",
        "1 teaspoon salt",
        "1 cup buttermilk",
        "1 cup chopped black walnuts (optional)",
        "1/2 cup golden raisins (optional)"
    ],
    "nut": [
        "Calories > 685 kcal",
        "Carbs > 106.6 g",
        "Cholesterol > 165 mg",
        "Fat > 25.6 g",
        "Protein > 11.6 g",
        "Sodium > 583 mg"
    ],
    "n": "Georgia's Tennessee Jam Cake",
    "a": "Amy",
    "r": "0",
    "s": 12,
    "des": "\"This rich holiday dessert was invented by my grandmother and is a tradition in our house over Christmas.  These ingredients were originally the authentic thing -- homemade jam, buttermilk out of the churn, and walnuts you gather and crack yourself.  Now we use purchased items, but the cake is just as good. Frost with homemade caramel frosting, or your favorite cream cheese frosting.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Grease three 8 or 9 inch round cake pans and set aside.\nIn a large bowl, beat butter and sugar until light and fluffy. Add eggs one at a time, mixing until each one is blended in. Dissolve the baking soda in the water; stir into the batter along with the blackberry jam. Combine the flour, cloves, nutmeg, cinnamon and salt; stir into the batter by hand, alternating with the buttermilk. Fold in the black walnuts and raisins if using. Divide the batter equally between the three pans, and spread in an even layer.\nBake in the preheated oven until the top of the cakes spring back when lightly touched, about 35 minutes. Cool in the pans until cool enough to handle, then invert the cakes over a wire rack and remove pans to cool completely.",
    "pt": "25 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "963865.jpg",
    "o": "",
    "st": "allrecipes"
}