{
    "id": 136587,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 (0.6 ounce) cakes compressed fresh yeast",
        "1 cup warm milk (110 degrees F/45 degrees C)",
        "1/2 cup melted butter",
        "2 eggs",
        "1 1/2 teaspoons salt",
        "2 teaspoons white sugar",
        "4 cups all-purpose flour, or as needed",
        "1 cup milk",
        "1 tablespoon cornstarch",
        "2 eggs",
        "2 tablespoons white sugar",
        "1 teaspoon vanilla extract",
        "1 beaten egg",
        "3/4 cup confectioners' sugar",
        "1 tablespoon hot water",
        "2 tablespoons cocoa powder"
    ],
    "nut": [
        "Calories > 214 kcal",
        "Carbs > 30.9 g",
        "Cholesterol > 67 mg",
        "Fat > 7.4 g",
        "Protein > 5.9 g",
        "Sodium > 262 mg"
    ],
    "n": "Fastelavnsboller (Fastelavn Buns)",
    "a": "mobygirl",
    "r": "0",
    "s": 18,
    "des": "\"Traditional Danish buns with a custard-type cream and chocolate icing are always eaten by children on Fastelavn, which falls around Shrove Tuesday.\"",
    "ins": "Dissolve yeast in the warm milk in a small bowl; allow to stand for a few minutes until it becomes foamy. Whisk together the butter, 2 eggs, salt, 2 teaspoons sugar, and yeast mixture until the sugar has dissolved. Stir in flour to form a smooth dough. Cover with a cloth and allow to rise in a warm place until doubled in bulk, about 30 minutes.\nMeanwhile, whisk together 1 cup of milk with the cornstarch in a small saucepan. Cook over medium heat until very hot and steaming, but not quite simmering. Whisk 2 eggs together with 2 tablespoons sugar in a bowl until well beaten. Slowly whisk in half of the hot milk mixture, adding it about 2 tablespoons at a time until incorporated. Stir the egg mixture into the saucepan of milk, and cook gently until thickens and begins to bubble. Remove from heat and stir in vanilla extract. Set the filling aside to cool.\nPreheat oven to 425 degrees F (220 degrees C), and line 2 baking sheets with parchment paper.\nPunch down the dough, and divide it into two pieces. Roll each piece into a 12x12 inch square, and cut each square into 9 equal pieces about 4 inches on a side. Place about 1 tablespoon of the filling into the center of each piece, and fold a corner across over the filling. Fold the opposite corner across and seal the corners over the filling. Fold the two remaining corners across the filling and seal to make a tidy packet enclosing the filling.\nPlace the filled buns, folded sides down, on the prepared baking sheets, and brush each bun with beaten egg. Bake in the preheated oven for 15 minutes, until the buns are golden brown, and let cool.\nStir together the confectioners' sugar, hot water, and cocoa powder in a bowl, and spread the icing onto each bun.  Refrigerate leftover buns.",
    "pt": "1 h",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "216329.jpg",
    "o": "",
    "st": "allrecipes"
}