{
    "id": 13675,
    "old_rating": "4.68613",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups apple cider",
        "1/3 cup real maple syrup",
        "2 1/2 tablespoons chopped fresh thyme",
        "2 tablespoons chopped fresh marjoram",
        "1 1/2 teaspoons grated lemon zest",
        "3/4 cup butter, softened",
        "salt and pepper to taste",
        "1 (12 pound) whole turkey, neck and giblets reserved",
        "2 cups chopped onion",
        "1 1/2 cups chopped celery",
        "1 1/2 cups chopped carrots",
        "3 cups chicken broth",
        "1/4 cup all-purpose flour",
        "1 bay leaf",
        "1/2 cup apple brandy"
    ],
    "nut": [
        "Calories > 875 kcal",
        "Carbs > 21.4 g",
        "Cholesterol > 296 mg",
        "Fat > 43.2 g",
        "Protein > 91.9 g",
        "Sodium > 571 mg"
    ],
    "n": "Maple Roast Turkey",
    "a": "Christine L.",
    "r": "0",
    "s": 12,
    "des": "\"This is the perfect turkey. The maple adds a sweet flavor that is just divine. A family favorite! Substitute 2 teaspoons dried marjoram if fresh marjoram is not available.\"",
    "ins": "Combine apple cider and maple syrup in a saucepan, and bring to a boil over medium-high heat. Continue cooking until reduced to 1/2 cup, then remove pan from heat. Stir in 1 tablespoon thyme, 1 tablespoon marjoram, and lemon zest. Stir in butter until melted, and season with salt and pepper. Cover, and refrigerate until cold.\nPreheat oven to 375 degrees F (190 degrees C). Place rack in lower third of oven.\nPlace turkey on a rack set in a  roasting pan. Reserve 1/4 cup maple butter for gravy, and rub the remaining maple butter under the skin of the breast and over the outside of turkey. Arrange onion, celery, carrots turkey neck and giblets around the turkey. Sprinkle 1 tablespoon thyme and 1 tablespoon marjoram over vegetables. Pour 2 cups broth into pan.\nRoast turkey for 30 minutes in the preheated oven. Reduce oven temperature to 350 degrees F (175 degrees C). Cover entire turkey loosely with foil. Continue roasting for about 2 1/2 hours, or until a meat thermometer inserted into thickest part of thigh registers 180 degrees F (85 degrees C). Transfer turkey to platter, and let stand 30 minutes.\nStrain the pan juices into a large measuring cup, and then remove any excess fat.  Add enough chicken broth to pan juices to measure 3 cups. Transfer liquid to a saucepan, and bring to boil. In a small bowl, mix 1/4 cup maple butter and 1/3 cup flour until smooth. Whisk flour and butter mixture into broth mixture. Stir in remaining thyme and the bay leaf. Boil until reduced to sauce consistency, stirring occasionally, about 10 minutes. Mix in apple brandy, if desired. Season with salt and pepper to taste.",
    "pt": "1 h",
    "ct": "3 h ",
    "tt": "6 h ",
    "i": "4209891.jpg",
    "o": "2889057.jpg,1870537.jpg,1755518.jpg,1747629.jpg,1678015.jpg,510578.jpg",
    "st": "allrecipes"
}