{
    "id": 13699,
    "old_rating": "4.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups white sugar",
        "1 cup butter, softened",
        "6 eggs, beaten",
        "3 cups all-purpose flour",
        "1/4 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 cup sour cream",
        "1/4 cup apricot brandy",
        "1 teaspoon lemon zest",
        "1 cup white sugar",
        "1/2 cup peach schnapps",
        "1 cup water",
        "1 teaspoon lemon zest",
        "1 cup apricot preserves",
        "1/2 cup apricot brandy",
        "1 teaspoon lemon zest",
        "1/2 cup almonds"
    ],
    "nut": [
        "Calories > 751 kcal",
        "Carbs > 114.4 g",
        "Cholesterol > 142 mg",
        "Fat > 25.2 g",
        "Protein > 8.6 g",
        "Sodium > 289 mg"
    ],
    "n": "Apricot Brandy and Peach Schnapps Pound Cake",
    "a": "Judy Cambell",
    "r": "0",
    "s": 12,
    "des": "\"A large and moist cake with a fruity kick! Be sure and add it to your holiday dessert table!\"",
    "ins": "Butter and flour one angle food tube cake pan. Preheat oven to 325 degrees F (175 degrees C).\nIn a mixing bowl, cream together butter and sugar for 5 minutes.  Add eggs one at a time.  Beat well.  Sift flour with soda and salt;  add sour cream and brandy ending with flour. Bake for 1 hour 15 minutes.\nPrepare the syrup in a sauce pan by combining the sugar, peach flavored liqueur, water and lemon zest. Boil for 1 minute.\nTurn cake out onto plate and punch holes in bottom of cake with ice pick or something similar.  Slowly pour all of syrup into holes until cake is penetrated and syrup is absorbed.  Immediately turn cake right side up onto serving plate.\nPrepare the topping/glaze by combining the apricot preserves, apricot brandy and  lemon zest in a sauce pan and boiling for 1 minute. Drizzle over top of cake.  Place sliced almonds on top of glaze along with a little lemon zest if desired.\nServe the cake with sliced fresh peaches and coat with 1/2 cup citrus juice.  Add one basket blueberries and mix together.  Pour 1/2 cup peach flavored liqueur and 1/2 cup simple syrup over fruit. (simple syrup made from 1/2 cup sugar boiled in 1 cup water for 1 minute and cooled)",
    "pt": "40 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1004816.jpg",
    "o": "",
    "st": "allrecipes"
}