{
    "id": 137650,
    "old_rating": "4.58741",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 ounces brown lentils",
        "1/4 cup olive oil",
        "1 tablespoon minced garlic",
        "1 onion, minced",
        "1 large carrot, chopped",
        "1 quart water",
        "1 pinch dried oregano",
        "1 pinch crushed dried rosemary",
        "2 bay leaves",
        "1 tablespoon tomato paste",
        "salt and ground black pepper to taste",
        "1 teaspoon olive oil, or to taste",
        "1 teaspoon red wine vinegar, or to taste (optional)"
    ],
    "nut": [
        "Calories > 357 kcal",
        "Carbs > 40.3 g",
        "Cholesterol > 0 mg",
        "Fat > 15.5 g",
        "Protein > 15.5 g",
        "Sodium > 57 mg"
    ],
    "n": "Greek Lentil Soup (Fakes)",
    "a": "Diana Moutsopoulos",
    "r": "0",
    "s": 4,
    "des": "\"Fakes (pronounced 'Fah-kehs') is a staple in the Greek kitchen, and an especially filling meal. It is traditionally served with a drizzle of olive oil and lots of vinegar. Though the vinegar is of course optional, try it. It lifts the lentils and adds another dimension of flavor!\"",
    "ins": "Place lentils in a large saucepan; add enough water to cover by 1 inch. Bring water to a boil and cook until tender, about 10 minutes; drain.\nHeat olive oil in a saucepan over medium heat. Add garlic, onion, and carrot; cook and stir until the onion has softened and turned translucent, about 5 minutes. Pour in lentils, 1 quart water, oregano, rosemary, and bay leaves. Bring to a boil. Reduce heat to medium-low, cover, and simmer for 10 minutes.\nStir in tomato paste and season with salt and pepper. Cover and simmer until the lentils have softened, 30 to 40 minutes, stirring occasionally. Add additional water if the soup becomes too thick. Drizzle with 1 teaspoon olive oil and red wine vinegar to taste.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4472580.jpg",
    "o": "4472580.jpg,4471603.jpg,3116083.jpg,2887521.jpg,2612328.jpg,2364598.jpg",
    "st": "allrecipes"
}