{
    "id": 137658,
    "old_rating": "4.80137",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 cups all-purpose flour",
        "1/4 cup white sugar",
        "1 teaspoon salt",
        "1 (.25 ounce) envelope active dry yeast",
        "1 egg",
        "1/4 cup melted butter",
        "1 1/4 cups warm milk (110 degrees F/45 degrees C)",
        "1 teaspoon vanilla extract",
        "melted butter for brushing",
        "1 teaspoon ground cinnamon",
        "1/3 cup brown sugar"
    ],
    "nut": [
        "Calories > 198 kcal",
        "Carbs > 32.7 g",
        "Cholesterol > 25 mg",
        "Fat > 5.3 g",
        "Protein > 4.5 g",
        "Sodium > 190 mg"
    ],
    "n": "Kalacs (Hungarian Cinnamon Swirl Bread)",
    "a": "wisweetp",
    "r": "0",
    "s": 16,
    "des": "\"My husband's aunt passed along this super-easy recipe for this Hungarian sweet bread, and I made a couple of revisions to my family's taste.  Cinnamon, poppy seed, or walnuts are a traditional filling.  Her recipe is for cinnamon, but one of my favorite ways is to break from tradition and use a cocoa/sugar/butter/vanilla mixture.  It's delicious, especially when the leftovers are toasted and buttered!\"",
    "ins": "Place flour, white sugar, salt, and yeast into the bowl of a stand mixer. In a bowl, whisk together egg, melted butter, warm milk, and vanilla extract; pour into the flour mixture. Using dough hook attachment, mix on low until the flour is moistened and a dough forms, then increase speed to medium, and continue kneading until smooth and elastic, 4 to 5 minutes.\nPlace dough into a greased bowl, cover, and allow to rise in a warm place until doubled in bulk, about 1 1/2 hours.\nPunch down dough, turn out onto a floured work surface, and divide into 2 equal pieces. Roll each piece into a 1/3 inch thick rectangle. Brush each square with melted butter. Mix together cinnamon and brown sugar in a small bowl, then sprinkle evenly over the two rectangles.\nRoll each firmly into a log, pinch the ends closed, and tuck them underneath. Place each into a greased, glass loaf pan. Cover, and allow to rise in a warm place until doubled in bulk, about 45 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBrush the tops of the loaves with melted butter, then bake in preheated oven until loaves are golden brown, and sound hollow when tapped, about 30 minutes.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "3 h ",
    "i": "373951.jpg",
    "o": "4538182.jpg,4517599.jpg,4517598.jpg,3835120.jpg,2189003.jpg,2127288.jpg",
    "st": "allrecipes"
}