{
    "id": 137791,
    "old_rating": "2.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (4 ounce) fillets tilapia",
        "12 asparagus spears, trimmed",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "2 green onions, chopped",
        "Sauce:",
        "2/3 cup white wine",
        "1 1/2 teaspoons cornstarch",
        "2 tablespoons lemon juice",
        "1/4 teaspoon dried basil",
        "1/8 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 167 kcal",
        "Carbs > 5.7 g",
        "Cholesterol > 41 mg",
        "Fat > 1.6 g",
        "Protein > 24.6 g",
        "Sodium > 345 mg"
    ],
    "n": "Tilapia Asparagus Bundles With White Wine Sauce",
    "a": "s3nt4rmh3aven",
    "r": "0",
    "s": 4,
    "des": "\"I wanted to cook my family a healthy meal of fish and vegetables. I had tilapia and asparagus on hand so I decided to cook these!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking pan.\nWrap each tilapia fillet around 3 spears of asparagus and secure with wooden toothpicks.  Season the fish with salt and pepper, then place in prepared baking pan.  Cover with foil and bake for 10 minutes.\nRemove the foil and sprinkle the chopped green onion over the fish. Return the pan, uncovered, to the oven to bake for an additional 5 to 10 minutes, or until fish flakes easily with a fork.\nWhile the fish is baking, heat the wine in a small saucepan over medium heat.  In a small bowl, combine the cornstarch and lemon juice and whisk until there are no visible clumps.  Add the cornstarch mixture to the white wine, cooking and stirring to prevent lumps.  Add the dried basil and black pepper and continue to cook for 2 minutes or until the sauce is thickened.\nTo serve, remove the toothpicks from the tilapia fillets and spoon sauce over top.",
    "pt": "5 m",
    "ct": "20 m",
    "tt": "25 m",
    "i": "683750.jpg",
    "o": "",
    "st": "allrecipes"
}