{
    "id": 137946,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 onion, finely chopped",
        "2 cups Arborio rice",
        "1/2 cup white wine",
        "1 quart reduced-sodium chicken broth, warmed",
        "1/4 cup chile-garlic flavored butter",
        "12 ounces medium shrimp, peeled and deveined, tails left on",
        "1 carrot, cut into thin strips",
        "1/3 cup pine nuts",
        "1/4 cup sliced black olives",
        "1 large red chile pepper, minced",
        "ground black pepper to taste"
    ],
    "nut": [
        "Calories > 765 kcal",
        "Carbs > 99.2 g",
        "Cholesterol > 151 mg",
        "Fat > 25.6 g",
        "Protein > 27.2 g",
        "Sodium > 437 mg"
    ],
    "n": "Prawn and Pine Nut Risotto",
    "a": "phuong",
    "r": "0",
    "s": 4,
    "des": "\"A delicious concoction of prawns and pine nuts with a hint of chile pepper. The addition of carrots give a little added crunch and color. If you take your time and stir constantly, you'll end up with the creamiest, tastiest risotto ever!\"",
    "ins": "Heat olive oil in a large saucepan over medium heat. Stir in the onion and cook until softened and translucent, about 3 minutes. Stir in Arborio rice until well coated in oil; continue cooking until both the onion and rice begin to turn golden-brown, about 8 minutes.\nPour in the white wine and stir until evaporated. Pour in 1/3 of the hot chicken broth; stir constantly as the risotto simmers and slowly absorbs the broth, about 8 minutes. Add half of the remaining broth, and continue stirring until absorbed, about another 8 minutes.\nStir in chile-garlic butter, shrimp, carrot, pine nuts, black olives, and red chile pepper until the butter has melted. Stir in the remaining chicken broth, and again stir constantly until absorbed, about 8 minutes. Season to taste with black pepper.\nAt this point, taste the rice; it should be slightly firm and totally delicious. If it is still a little crunchy, stir in some hot water and continue cooking until it reaches the desired tenderness.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "820640.jpg",
    "o": "",
    "st": "allrecipes"
}