{
    "id": 138016,
    "old_rating": "4.39301",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound broccoli florets",
        "3 tablespoons finely grated Parmesan cheese",
        "1 teaspoon brown sugar",
        "2 tablespoons olive oil",
        "1 teaspoon red pepper flakes",
        "1/4 teaspoon kosher salt",
        "1/8 teaspoon freshly ground black pepper"
    ],
    "nut": [
        "Calories > 81 kcal",
        "Carbs > 6.2 g",
        "Cholesterol > 2 mg",
        "Fat > 5.6 g",
        "Protein > 3.2 g",
        "Sodium > 144 mg"
    ],
    "n": "Brilliant Sauteed Broccoli",
    "a": "Aaron Geiger",
    "r": "0",
    "s": 6,
    "des": "\"If you want a slightly original restaurant-quality broccoli at any point within three days, this is the recipe you want! This is also great for entertaining guests with a large amount of food, and you want to shave some time without looking like you cut corners. This recipe shows how you can shock your greens to stay brilliant, while making a presentation that says you really care about your food.\"",
    "ins": "Fill a pot with water and bring to a boil. Fill a large bowl or pot with half ice and half water. When the water comes to a boil, add the broccoli florets using a strainer with a handle if possible. Allow the broccoli to cook for 1 to 2 minutes until just tender. Immediately remove from the boiling water, using the strainer or draining, and transfer to bowl of ice to stop the cooking process. Immerse the broccoli completely in the ice water for a minute or two. Remove and place in a dish that has been lined with paper towels. This part can be done up to two days in advance.\nIn a cup or small bowl, mix together the Parmesan cheese and brown sugar; set aside.\nHeat the oil in a large skillet over medium-high heat. Throw in the broccoli and season with red pepper flakes, salt and pepper. Stir to coat the broccoli, then cook and stir for 1 to 2 minutes. Remove from the heat and dust with the Parmesan cheese mixture.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "25 m",
    "i": "1117117.jpg",
    "o": "3954362.jpg,3935373.jpg,3851745.jpg,3462236.jpg,2432904.jpg,1968083.jpg",
    "st": "allrecipes"
}