{
    "id": 13814,
    "old_rating": "4.4466",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 pound sliced fresh mushrooms",
        "3 stalks celery, diced",
        "2 onions, chopped",
        "1 (20 ounce) loaf French or Italian bread, cut into 1 inch cubes",
        "1 (16 ounce) package herb-seasoned stuffing mix",
        "4 eggs, beaten",
        "2 (14 ounce) cans chicken broth",
        "2 teaspoons rubbed sage",
        "2 teaspoons dried thyme",
        "2 tablespoons garlic powder",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 263 kcal",
        "Carbs > 44.8 g",
        "Cholesterol > 48 mg",
        "Fat > 4.8 g",
        "Protein > 10.3 g",
        "Sodium > 1006 mg"
    ],
    "n": "Grandma Ruth's Stuffing",
    "a": "Ilene F.",
    "r": "0",
    "s": 16,
    "des": "\"This is a very basic and simple stuffing recipe that my Grandma Ruth was famous for.  You can easily replace the eggs with an egg substitute with no noticeable taste difference.  My family does not, but you can easily add cooked bulk sausage to this stuffing. For a moist stuffing made outside of the bird, add additional chicken stock and cover with foil while baking. Remove foil for the last 20 minutes to crisp up the top.\"",
    "ins": "Heat oil in a large skillet over medium heat. Saute the mushrooms, celery, and onions until softened.\nDampen the fresh bread cubes (not the stuffing mix), then squeeze out any excess water.\nIn a large bowl, combine the mushroom mixture, bread cubes, stuffing mix, eggs, and 1 can chicken broth. Season with sage, thyme, garlic powder, salt, and pepper, and mix well. The stuffing should have a rather paste-like consistency.  Mix in additional chicken broth as necessary.\nLoosely pack stuffing inside turkey cavity before roasting.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "152053.jpg",
    "o": "",
    "st": "allrecipes"
}