{
    "id": 13824,
    "old_rating": "4.8125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 gallons peanut oil for frying, or as needed",
        "1 (12 pound) whole turkey, neck and giblets removed",
        "1/4 cup Creole seasoning",
        "1 white onion"
    ],
    "nut": [
        "Calories > 603 kcal",
        "Carbs > 1.5 g",
        "Cholesterol > 228 mg",
        "Fat > 33.6 g",
        "Protein > 68.8 g",
        "Sodium > 571 mg"
    ],
    "n": "Deep-Fried Turkey",
    "a": "Tim and Meredith",
    "r": "0",
    "s": 16,
    "des": "\"This is an awesome Cajun recipe. Deep-frying makes the turkey crispy on the outside and super juicy on the inside (even the white meat). It also leaves the heat outside! You can deep-fry the turkey in either peanut or vegetable oil, your choice. We use a 26 quart aluminum pot with a drain basket.\"",
    "ins": "In a large stockpot or turkey fryer, heat oil to 400 degrees F (200 degrees C). Be sure to leave room for the turkey, or the oil will spill over.  Layer a large platter with food-safe paper bags.\nRinse turkey, and thoroughly pat dry with paper towels. Rub Creole seasoning over turkey inside and out. Make sure the hole at the neck is open at least 2 inches so the oil can flow freely through the bird.\nPlace the whole onion and turkey in drain basket. The turkey should be placed in basket neck end first. Slowly lower basket into hot oil to completely cover turkey.  Maintain the temperature of the oil at 350 degrees F (175 degrees C), and cook turkey for 3 1/2 minutes per pound, about 45 minutes.\nCarefully remove basket from oil, and drain turkey. Insert a meat thermometer into the thickest part of the thigh; the internal temperature must be 180 degrees F (80 degrees C). Finish draining turkey on the prepared platter.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4207931.jpg",
    "o": "4207931.jpg,3217071.jpg,1896891.jpg,759280.jpg,742704.jpg,742703.jpg",
    "st": "allrecipes"
}