{
    "id": 13881,
    "old_rating": "3.98485",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 red bell pepper",
        "1 zucchini",
        "1 small eggplant",
        "1 large sweet onion",
        "3/4 cup frozen broad beans",
        "1 (14.5 ounce) can diced tomatoes",
        "2 tablespoons balsamic vinegar",
        "1 cup couscous",
        "1 cup vegetable stock"
    ],
    "nut": [
        "Calories > 317 kcal",
        "Carbs > 59.2 g",
        "Cholesterol > 0 mg",
        "Fat > 4.5 g",
        "Protein > 10.7 g",
        "Sodium > 326 mg"
    ],
    "n": "Grilled Vegetables in Balsamic Tomato Sauce with Couscous",
    "a": "Christopher O'Hearn",
    "r": "0",
    "s": 4,
    "des": "\"The sweetness of grilled vegetables is balanced by a tart tomato sauce, which mixes perfectly with simple couscous.  Preferably use a heavy grill pan.  If you don't have one you can use a baking tray beneath an oven grill, or even roast the vegetables in a hot oven and then transfer them to a pan for the last part. But you will get more of the char-grill flavor if you use a pan. If you want to make more or less couscous, just use the same quantity of water as couscous.  This dish keeps well, as the flavor of the vegetables seems to grow stronger.  It is just as nice served lightly warmed for lunch as hot for a dinner, or use it as a cold dish in a selection of salads.\"",
    "ins": "Remove the seeds from the pepper, and chop into strips about 1 to 2 inches long.  Cut the eggplant crossways into rounds about 1/3 to 1/2 inch thick, and cut each one into 6 to 8 even chunks.  Peel the onion, and chop into 8 portions.  Trim the zucchini, and cut into thick slices.\nHeat grill pan over a high heat with a generous splash of olive oil.  When it is very hot, add all the vegetables to the pan.  Press down occasionally to get grill lines across them. Turn occasionally to prevent burning.  Cook for about 15 minutes, or until the vegetables are evenly browned and cooked through.\nStir broad beans into the vegetables.  Add chopped tomatoes, and vinegar.  Simmer for a few minutes while the couscous is prepared.\nPlace couscous into a medium bowl.  Add boiling vegetable stock, and stir with a fork. Keep lifting the couscous occasionally to prevent it sticking.  It only takes 2 to 3 minutes to become soft. Place couscous in a large bowl or serving platter, and serve the vegetables on top.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "93355.jpg",
    "o": "",
    "st": "allrecipes"
}