{
    "id": 139276,
    "old_rating": "4.22951",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon olive oil",
        "1/2 onion, chopped fine",
        "1 teaspoon minced garlic",
        "1 cup quinoa",
        "1/2 cup white wine",
        "1 3/4 cups chicken broth",
        "2 teaspoons balsamic vinegar",
        "1 teaspoon chopped fresh thyme",
        "1 tablespoon olive oil",
        "1 (8 ounce) package sliced mushrooms",
        "4 teaspoons balsamic vinegar",
        "1/4 cup white wine",
        "1/4 cup chicken broth",
        "1 teaspoon chopped fresh thyme",
        "salt and pepper to taste",
        "1 (10 ounce) bag washed spinach leaves",
        "1/4 cup crumbled goat cheese"
    ],
    "nut": [
        "Calories > 433 kcal",
        "Carbs > 47.3 g",
        "Cholesterol > 10 mg",
        "Fat > 16.5 g",
        "Protein > 15.7 g",
        "Sodium > 167 mg"
    ],
    "n": "Robin's Quinoa with Mushrooms and Spinach",
    "a": "Robin B.",
    "r": "0",
    "s": 3,
    "des": "\"I do pilates over my lunch break a couple of times a week, and this is the perfect thing to eat after it. It's way better than the usual lean-cuisine, and way better for you. Plus, it's super-cheap to make and you get three lunches out of it, easily.\"",
    "ins": "Heat olive oil in a saucepan over medium heat. Add onion and garlic, cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in quinoa until well blended.\nPour in 1/2 cup white wine and cook, stirring, until absorbed by the quinoa, about 30 seconds. Stir in 1 3/4 cups chicken broth, 2 teaspoons balsamic vinegar, and 1 teaspoon chopped thyme. Bring to a boil over medium-high heat, then reduce heat to medium-low, cover, and simmer until the quinoa is tender, about 15 minutes.\nMeanwhile, heat 1 tablespoon olive oil in a skillet over medium-high heat. Add the mushrooms and cook until lightly browned, about 5 minutes. Pour in 4 teaspoons balsamic vinegar, 1/4 cup white wine, 1/4 cup chicken stock, and 1 teaspoon chopped thyme. Reduce heat to medium-low, cover, and simmer until the mushrooms soften, about 5 minutes.\nOnce the quinoa has cooked, stir in the mushroom mixture, and season to taste with salt and pepper. Remove quinoa from the heat and stir in spinach leaves, which will wilt. Transfer to a serving dish and sprinkle with crumbled goat cheese.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "368520.jpg",
    "o": "3145339.jpg,3120577.jpg,1612016.jpg,1355551.jpg,188988.jpg,88860.jpg",
    "st": "allrecipes"
}