{
    "id": 139581,
    "old_rating": "4.18182",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 large onions, cut into 1/4 inch wide strips",
        "14 fillets Swedish anchovies, or regular anchovies",
        "6 potatoes, peeled and cut into strips",
        "1 1/2 cups heavy cream",
        "2 tablespoons dry bread crumbs",
        "1 tablespoon melted butter"
    ],
    "nut": [
        "Calories > 326 kcal",
        "Carbs > 33.9 g",
        "Cholesterol > 71 mg",
        "Fat > 18.9 g",
        "Protein > 6.8 g",
        "Sodium > 307 mg"
    ],
    "n": "Jansson's Temptation (Janssons Frestelse)",
    "a": "WOLSELEY",
    "r": "0",
    "s": 8,
    "des": "\"Who Jansson is, we may never know, but this meal is an absolute must on a cold and frigid evening. You might be put off by the inclusion of anchovies, but you will be really surprised at how well the saltiness of the fish works in this dish. If the anchovies are a definite 'no', then substitute smoked salmon. It won't have the same saltiness in each bite, but the salmon can be just as delicious in its own right. This is the one recipe that I  get requests for after parties and there is always an amusing display of disbelief afterwards when the inclusion of anchovies is revealed.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Butter a 9x13 inch baking dish.\nSpread onions evenly onto the bottom of the prepared baking dish. Evenly distribute anchovies on top of the onions. Place potatoes on top of the anchovies, then pour in heavy cream. Mix bread crumbs together with the melted butter, then sprinkle overtop of the potatoes.\nPlace onto a baking sheet to catch any cream which bubbles over. Bake in preheated oven until the potatoes have softened, the cream has reduced, and the dish has turned deep golden brown, about 45 minutes.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "808816.jpg",
    "o": "",
    "st": "allrecipes"
}