{
    "id": 139542,
    "old_rating": "4.84211",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup milk",
        "1 cup water",
        "3 tablespoons butter",
        "1/2 cup light molasses",
        "1/3 cup white sugar",
        "1 tablespoon grated orange zest",
        "1 tablespoon fennel seed",
        "1 tablespoon anise seed",
        "1 tablespoon caraway seed",
        "1 tablespoon cardamom",
        "1 teaspoon salt",
        "2 (.25 ounce) packages active dry yeast",
        "1/4 cup warm water (110 degrees F/45 degrees C)",
        "2 cups rye flour",
        "5 cups all-purpose flour",
        "3 tablespoons butter, melted"
    ],
    "nut": [
        "Calories > 287 kcal",
        "Carbs > 53.5 g",
        "Cholesterol > 13 mg",
        "Fat > 5.5 g",
        "Protein > 6.4 g",
        "Sodium > 189 mg"
    ],
    "n": "Danish Spiced Rye Bread (Sigtebrod)",
    "a": "WOLSELEY",
    "r": "0",
    "s": 16,
    "des": "\"This is a traditional Danish rye bread made easy with the use of a bread machine. (It can be made using traditional methods, of course.) The bread is highly spiced so makes a perfect accompaniment for Danish open faced sandwiches (smorebrod) and is usually seen served on a Christmas holiday table.  Perfect for those people who like a spiced twist to their daily bread.\"",
    "ins": "Heat milk in a medium saucepan until scalding and small bubbles are forming around the edges, but just before the milk reaches a boil. Remove pan from heat and stir in the water, butter, molasses, sugar, orange zest, anise seed, caraway seed, cardamom and salt; allow to step and cool 30 minutes at room temperature.\nIn a bread maker, stir the yeast into the warm water and let sit for 5 minutes. Pour the cooled milk and spice mixture into the bread machine with the yeast mixture. Add the flour to the bread machine. Run the bread machine on the dough cycle.\nGrease two 9x5 inch loaf pans. When the dough cycle is complete, remove the dough from the machine, divide in half, form into 2 loaves, and place in the prepared loaf pans. Cover and allow to rise for 30 minutes, or until your finger leaves a small dent when you poke the loaves.\nPreheat oven to 375  degrees F (190 degrees C).\nBake the loaves until they sound hollow when tapped on the bottom,  35 to 40 minutes. Brush the hot loaves with melted butter; cool before serving.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "3 h ",
    "i": "1109174.jpg",
    "o": "",
    "st": "allrecipes"
}