{
    "id": 139652,
    "old_rating": "4.41935",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons butter",
        "4 onion, sliced and separated into rings",
        "1 tablespoon white wine vinegar",
        "1/2 teaspoon ground dried thyme",
        "6 large baking potatoes, peeled and cubed",
        "1 tablespoon Dijon mustard",
        "2 tablespoons prepared horseradish, or to taste",
        "salt and cracked black pepper to taste",
        "1/4 cup softened butter",
        "3/4 cup half-and-half"
    ],
    "nut": [
        "Calories > 381 kcal",
        "Carbs > 60.8 g",
        "Cholesterol > 35 mg",
        "Fat > 13.1 g",
        "Protein > 7.7 g",
        "Sodium > 209 mg"
    ],
    "n": "Caramelized Onion and Horseradish Smashed Potatoes",
    "a": "brightlightz",
    "r": "0",
    "s": 8,
    "des": "\"Caramelized onions give this incredible side dish a subtle sweetness, and the addition of horseradish gives it a little attitude! They make an absolutely fabulous side dish to prime rib, and have become a tradition every year at family holiday gatherings! To save time, the caramelized onions can be made ahead of time and refrigerated, then warmed before adding to the potatoes.\"",
    "ins": "Melt 3 tablespoons butter in a large skillet over medium-high heat. Add the onions and cook for 5 minutes. Reduce heat to medium, and continue cooking, stirring frequently, until the onions have softened, and achieved a deep brown color, 15 to 25 minutes. Stir in vinegar and thyme, and cook for 5 minutes more.\nWhile the onions are cooking, place cubed potatoes in large pot and cover with salted water. Bring to a boil, then reduce heat to medium-low, cover, and simmer until the potatoes can be pierced easily with a fork, about 20 minutes. Drain the potatoes in a colander, and allow to steam for a minute.\nTo finish the dish, transfer the potatoes to a serving bowl, and use a potato masher to mix with Dijon mustard, horseradish, salt and cracked black pepper until smooth. Mix in softened butter, caramelized onions, and half-and-half until onions are distributed evenly.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "3898777.jpg",
    "o": "2417189.jpg,973408.jpg,957481.jpg,938671.jpg,730063.jpg,723961.jpg",
    "st": "allrecipes"
}