{
    "id": 139726,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "1 (16 ounce) can refried beans",
        "1 teaspoon dried oregano",
        "1/2 teaspoon ground cumin",
        "1 (8 ounce) package manicotti shells, uncooked ",
        "1 1/4 cups water",
        "1 (16 ounce) jar picante sauce",
        "1 cup sour cream",
        "1/2 cup shredded Monterey Jack cheese",
        "chopped green onions for garnish"
    ],
    "nut": [
        "Calories > 480 kcal",
        "Carbs > 44.9 g",
        "Cholesterol > 77 mg",
        "Fat > 21.9 g",
        "Protein > 26.3 g",
        "Sodium > 826 mg"
    ],
    "n": "Microwave Mexican Manicotti",
    "a": "Jody Campos Dowling",
    "r": "0",
    "s": 6,
    "des": "\"This is a wonderful recipe a friend of the family made for us for dinner when I was a kid. It's easy to make since it's cooked in the microwave.\"",
    "ins": "Grease a microwave-safe 9x12 inch baking dish, and set aside.\nHeat a skillet over medium-high heat, and cook and stir the beef until crumbly, evenly browned, and no longer pink, about 10 minutes. Drain and discard any excess grease.\nMix together the cooked ground beef, refried beans, oregano, and cumin in a bowl. Spoon the mixture into uncooked manicotti shells, and place the filled shells into the baking dish. Combine the water and picante sauce in a bowl, and pour over the shells.\nCover the dish with microwave-safe plastic wrap, cut a few holes in the wrap with a knife to vent, and microwave on High power for 10 minutes. Carefully pull back the plastic wrap to avoid steam, and turn the shells over with tongs. Replace the plastic and microwave an additional 15 to 20 minutes on Medium power, until the shells are cooked and the liquid has been absorbed.\nPull off the plastic wrap, and spoon sour cream over the shells. Sprinkle with Monterey Jack cheese and chopped green onions for garnish.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "2429762.jpg",
    "o": "",
    "st": "allrecipes"
}