{
    "id": 13981,
    "old_rating": "4.36382",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 eggplant, cut into 3/4 inch slices",
        "1 1/2 tablespoons salt",
        "8 tablespoons olive oil",
        "8 ounces ricotta cheese",
        "6 ounces shredded mozzarella cheese",
        "1/2 cup grated Parmesan cheese",
        "1 egg, beaten",
        "1/2 cup chopped fresh basil",
        "4 cups pasta sauce"
    ],
    "nut": [
        "Calories > 369 kcal",
        "Carbs > 23.5 g",
        "Cholesterol > 53 mg",
        "Fat > 24.7 g",
        "Protein > 14.1 g",
        "Sodium > 2075 mg"
    ],
    "n": "Eggplant Parmesan I",
    "a": "Karen",
    "r": "0",
    "s": 8,
    "des": "\"This makes a delicious entree served with a salad and garlic bread.\"",
    "ins": "Sprinkle both sides of the eggplant slices with salt. Place slices in a colander, and place a dish underneath the colander to capture liquid that will sweat out of the eggplant. Allow to sit for 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C). In a medium bowl, mix the ricotta, mozzarella cheese and 1/4 cup Parmesan cheese. Mix in egg and basil.\nRinse the eggplant in cold water until all salt is removed. In a large skillet, heat 4 tablespoons olive oil over medium heat. Place one layer of eggplant in the pan, brown each side. Repeat with remaining eggplant slices, using additional oil if necessary.\nIn a 9x13 inch baking dish, evenly spread 1 1/2 cups of spaghetti sauce. Arrange a single layer of  eggplant slices on top of the sauce. Top the eggplant with 1/2 of the cheese mixture. Repeat layering process until all the eggplant and cheese mixture is used. Pour remaining sauce on top of layers, and sprinkle with remaining Parmesan cheese.\nBake 30 to 45 minutes in the preheated oven, until sauce is bubbly.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "3407991.jpg",
    "o": "3407991.jpg,2664501.jpg,2614085.jpg,2255321.jpg,1411890.jpg,807187.jpg",
    "st": "allrecipes"
}