{
    "id": 139890,
    "old_rating": "4.53644",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (14 pound) roast-ready prime rib roast (ribs cut off and tied to roast)",
        "3/4 cup all-purpose flour",
        "2 teaspoons freshly ground black pepper",
        "2 teaspoons salt",
        "2 teaspoons paprika",
        "1 teaspoon onion powder",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon celery seed"
    ],
    "nut": [
        "Calories > 870 kcal",
        "Carbs > 5.7 g",
        "Cholesterol > 171 mg",
        "Fat > 73.4 g",
        "Protein > 43.5 g",
        "Sodium > 458 mg"
    ],
    "n": "Restaurant-Style Prime Rib Roast",
    "a": "Barbara Conrad",
    "r": "0",
    "s": 14,
    "des": "\"This rib roast recipe took years to formulate. It makes the most out of this cut of meat. It is perfect for any special occasion.\"",
    "ins": "Remove prime rib from refrigerator and allow the meat to come to room temperature, about 3 hours depending on the size of the roast.\nPreheat oven to 425 degrees F (220 degrees C). Line a roasting pan with aluminum foil.\nUnwrap the roast and place onto roasting pan; blot with paper towels. Sift together flour, pepper, salt, paprika, onion powder, garlic powder, and celery seed into a small bowl. Coat the roast all over with the flour mixture.\nRoast in preheated oven until cooked to your desired degree of doneness; about 4 1/2 hours (20 minutes a pound) for medium-rare. Roast to an internal temperature of 120 degrees F (49 degrees C)  for medium-rare; 130 degrees F (54 degrees C) for medium; or 140 degrees F (60 degrees C) for well done.\nWhen the roast has finished cooking, take it out of the oven, and cover with aluminum foil. Allow to rest in a warm spot for 30  minutes to 1 hour before slicing.",
    "pt": "10 m",
    "ct": "2 h",
    "tt": "5 h ",
    "i": "4472790.jpg",
    "o": "4472790.jpg,4373141.jpg,4372402.jpg,3638053.jpg,3027826.jpg,2223561.jpg",
    "st": "allrecipes"
}