{
    "id": 139992,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 cups all-purpose flour",
        "1 cup white sugar",
        "2 tablespoons baking powder",
        "1 teaspoon salt",
        "1 (15 ounce) package raisins",
        "1 1/2 (12 fluid ounce) cans evaporated milk",
        "2 cups dark molasses",
        "1 teaspoon vanilla extract",
        "3/4 cup lard, melted"
    ],
    "nut": [
        "Calories > 487 kcal",
        "Carbs > 92.5 g",
        "Cholesterol > 16 mg",
        "Fat > 10.5 g",
        "Protein > 7.7 g",
        "Sodium > 308 mg"
    ],
    "n": "Canadian Boiled Dumpling",
    "a": "Amy Michano",
    "r": "0",
    "s": 20,
    "des": "\"This traditional native Canadian dessert is made with raisins and molasses. This size dumpling feeds many, it is usually sliced thinly and served by itself or with a bit of butter. The original recipe is from Mathilda Michano. Enjoy!\"",
    "ins": "Stir together flour, sugar, baking powder, salt, and raisins in a large bowl until evenly blended. Whisk together milk, molasses, and vanilla extract in a separate bowl, and set aside. Use your hands to work the melted lard into the flour mixture until coarse and crumbly. Mix in the molasses mixture until a wet, sticky dough is achieved.\nPlace a heatproof ceramic plate in the bottom of a large pot and fill with water. Bring to a boil over high heat.\nScrape dough into the center of a clean, 2x2 foot cotton cloth. Bring the corners and sides of the cloth around the dough, and tie the pouch closed with strong kitchen twine, leaving about 1 1/2 inches of room for the dough to expand at the top.\nCarefully place dumpling into boiling water, making sure it is immersed. Cover, and return to a boil. Reduce heat to medium-low, and simmer gently for 3 1/2 hours.\nAfter 3 1/2 hours, carefully remove dumpling from the simmering water, and remove the cotton cloth. Place onto a plate and allow to cool. Serve warm or cold.",
    "pt": "15 m",
    "ct": "3 h ",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}