{
    "id": 139971,
    "old_rating": "4.60526",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 bunch beets - trimmed, leaving 1 inch of stems attached, greens washed and reserved",
        "2 tablespoons olive oil, divided",
        "1 small onion, halved and thinly sliced",
        "sea salt (optional)",
        "fresh-ground black pepper"
    ],
    "nut": [
        "Calories > 111 kcal",
        "Carbs > 11.6 g",
        "Cholesterol > 0 mg",
        "Fat > 6.9 g",
        "Protein > 1.9 g",
        "Sodium > 161 mg"
    ],
    "n": "Beets and Greens",
    "a": "Carolyn Bunkley",
    "r": "0",
    "s": 4,
    "des": "\"Roasted beet pieces nestled among their sauteed greens makes a beautiful, delicious side dish.  If yellow beets are available, double the recipe using a bunch of red and a bunch of yellow -- gorgeous!  My brother spent 50 years hating beets, but he loves them prepared this way.  I think these go especially well with pork or chicken.  This recipe can easily be doubled, tripled, or expanded to whatever amount you need without adding very much to the preparation time.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil.\nRub the beets with 1 tablespoon of olive oil and place onto prepared baking sheet. Place in preheated oven, and bake until the beets can be easily pierced with a fork, 20 to 60 minutes depending on size. When done, allow to cool on the baking sheet until cool enough to handle, then remove and discard the skin, and cut the beets into wedges or slices.\nMeanwhile, cut the beet greens in to 1/4 inch wide ribbons. Heat the remaining tablespoon of olive oil in a large skillet over medium heat. Add the onion; cook and stir until it begins to turn golden brown, about 10 minutes. Once the onions have begun to caramelize, stir in the beet greens and cook until they wilt. Add the beet slices and continue cooking until heated through. Season with sea salt and pepper before serving.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "1024225.jpg",
    "o": "4526807.jpg,4526805.jpg,4522249.jpg,4267084.jpg,1024948.jpg,414353.jpg",
    "st": "allrecipes"
}