{
    "id": 140032,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large sweet potato",
        "1 cup frozen mixed vegetables, thawed",
        "1 banana",
        "1/2 cup raisins",
        "1 cup diced apples",
        "1 1/2 cups quick-cooking oatmeal, corn flakes, granola, or similar cereal"
    ],
    "nut": [],
    "n": "Sweet Potato Bird Balls",
    "a": "Sandi",
    "r": "0",
    "s": 80,
    "des": "\"These are an excellent staple to have; when you need a quick treat, just defrost a few of these balls. Aside from softening the sweet potato in the microwave, this recipe does not require you to do any cooking at all. It's a relatively simple recipe you can make that will provide with a big batch of treats that freeze well. The fresh fruits and/or vegetables are especially nutritious for your bird, and the cereal give the balls a pleasant crunch.\"",
    "ins": "Pierce the skin of the sweet potato several times with a paring knife or skewer. Place into the microwave, and cook on High power until the potato is tender, 5 to 9 minutes, turning the potato over halfway through cooking. When done, allow to cool until cool enough to handle.\nPeel the potato and place into a large mixing bowl. Add the vegetables, banana, raisins, apples, and oatmeal. Mix using an electric mixer on high speed until the vegetables have been reduced to tiny pieces and the mixture is thoroughly combined. If the mixture is too dry, add a little water until soft enough to roll into balls.\nLine a baking sheet with parchment or waxed paper. Roll the mixture into marble-sized balls and place onto baking sheet. Feed Polly a couple now, then place the baking sheet into the freezer, and freeze solid. Once frozen, remove treats from parchment paper and store in a resealable plastic bag. Defrost treats before serving.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}