{
    "id": 14016,
    "old_rating": "4.58491",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 cannelloni noodles",
        "5 cloves garlic, minced",
        "5 shallots, chopped",
        "2 tablespoons olive oil",
        "1 cup dry sherry",
        "2 cups heavy whipping cream",
        "salt and pepper to taste",
        "1 onion, chopped",
        "1 cup fresh sliced mushrooms",
        "1 zucchini, chopped",
        "1 small eggplant, diced",
        "2 roasted red bell peppers, diced",
        "1 teaspoon dried basil",
        "1 teaspoon dried oregano",
        "3/4 cup ricotta cheese",
        "1 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 455 kcal",
        "Carbs > 30 g",
        "Cholesterol > 97 mg",
        "Fat > 30.8 g",
        "Protein > 12.7 g",
        "Sodium > 319 mg"
    ],
    "n": "Vegetable Stuffed Cannelloni",
    "a": "Jill",
    "r": "0",
    "s": 8,
    "des": "\"Delicious cannelloni stuffed with an array of vegetables, Parmesan, and ricotta cheese! Serve with a big green salad.  Tasty!\"",
    "ins": "In a large pot of salted water, parboil cannelloni. (Parboiling is partially cooking the noodles in boiling water; they will finish cooking when baked.)\nMeanwhile, cook 2 cloves garlic and 2 shallots in 1 tablespoon olive oil in a medium saucepan over medium heat for 30 seconds. Pour in sherry, raise heat to high, and reduce liquid by half. Stir in cream, and reduce until there is about 1 1/2 cups liquid. Remove from heat, and season with salt and pepper to taste. Set cream sauce aside.\nIn a large skillet, heat one tablespoon olive oil over medium heat. Cook onion, 3 shallots, 3 cloves garlic, mushrooms, zucchini, and eggplant in olive oil until all vegetables are tender. Transfer to a large bowl. Stir in red peppers, basil, oregano, ricotta, and Parmesan cheese. Season to taste with salt and  pepper.  Set filling aside.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease one 9x13 inch baking dish.  Stuff vegetable/cheese filling into cannelloni.  Place in prepared baking dish, and cover with cream sauce.\nBake in preheated oven for 25 minutes.",
    "pt": "45 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "18741.jpg",
    "o": "",
    "st": "allrecipes"
}