{
    "id": 14033,
    "old_rating": "4.67857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound celery",
        "1 1/2 pounds sweet onions",
        "1 pound carrots, cut into 1 inch pieces",
        "1 pound tomatoes, cored",
        "1 pound green bell pepper, cut into 1 inch pieces",
        "1/2 pound turnips, cubed",
        "2 tablespoons olive oil",
        "3 cloves garlic",
        "3 whole cloves",
        "1 bay leaf",
        "6 whole black peppercorns",
        "1 bunch fresh parsley, chopped",
        "1 gallon water"
    ],
    "nut": [
        "Calories > 133 kcal",
        "Carbs > 23.3 g",
        "Cholesterol > 0 mg",
        "Fat > 4 g",
        "Protein > 3.5 g",
        "Sodium > 131 mg"
    ],
    "n": "World's Greatest Vegetable Broth",
    "a": "Tom West",
    "r": "0",
    "s": 8,
    "des": "\"This makes a broth that is slightly thick with a rich color and full flavor.  The broth can be frozen in one or one and a half cup blocks for later use. This recipe also leaves you with a bowl full of delicious cooked vegetables, I love to snack on them cold.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nRemove leaves and tender inner parts of celery and set aside.\nToss onions, carrots, tomatoes, bell peppers and turnips with olive oil. Place vegetables in a roasting pan and place them in the 450 degrees F (230 degrees C) oven. Stir the vegetable every 15 minutes. Cook until all of the vegetables have browned and the onions start to caramelize, this will take over one hour.\nPut the browned vegetables, celery, garlic, cloves,  bay leaf, pepper corns, Italian parsley and water into a large stock pot. Bring to a full boil. Reduce heat to simmer. Cook uncovered until liquid is reduced by half.\nPour the broth through a colander, catching the broth in a large bowl or pot. The liquid caught in the bowl or pot is your vegetable broth it can be used immediately or stored for later use. Although the vegetables are no longer necessary for your broth they are delicious to eat hot or cold, don't waste them!",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2648610.jpg",
    "o": "",
    "st": "allrecipes"
}