{
    "id": 14034,
    "old_rating": "3.96774",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon butter",
        "2 cloves garlic, minced",
        "4 1/3 cups water",
        "1 cup stone ground cornmeal",
        "1/2 teaspoon salt",
        "1 1/3 cups fresh corn kernels",
        "freshly ground black pepper",
        "2 tablespoons grated Parmesan cheese",
        "1/2 bunch kale",
        "1 tablespoon olive oil",
        "1 tomato, sliced",
        "3 ounces goat cheese"
    ],
    "nut": [
        "Calories > 690 kcal",
        "Carbs > 88.5 g",
        "Cholesterol > 53 mg",
        "Fat > 31.1 g",
        "Protein > 23.9 g",
        "Sodium > 1250 mg"
    ],
    "n": "Pan-fried Polenta with Corn, Kale and Goat Cheese",
    "a": "jen",
    "r": "0",
    "s": 2,
    "des": "\"This is a gourmet polenta recipe as it uses kale and goat cheese.\"",
    "ins": "In a medium saucepan, heat the butter over medium heat. Add the garlic and stir constantly for 1 minute; don't let the garlic brown. Add 3 cups of the water, and bring it to a boil.\nWhile the water heats, whisk together in a bowl the cornmeal, salt, and 1 cup water to make a smooth mixture.\nWhen the water in the saucepan comes to a boil, pour the mixture into it. Whisk constantly for 3 minutes to prevent lumps from forming. Turn the heat to low. Cook for 40 minutes, stirring with a wooden spoon every 10 minutes. Stir in the corn kernels and cook the polenta 5 minutes more. Stir in the pepper and Parmesan cheese.   Pour the polenta into a lightly oiled 8x8 inch pan and smooth the top with a spatula. Chill the polenta in a refrigerator for 1 hour.\nWhile the polenta is cooling, cut away the stems and center stalks of the kale. Cut the leaves into 3-inch pieces.\nCut the chilled polenta into 4 large triangles. Heat the olive oil in a large non-stick skillet over medium-high heat. When the oil begins to smoke, carefully add the polenta triangles. Fry the polenta until it is golden brown on the underside, then turn the polenta over and cook it until it is golden brown on the other side. Arrange the polenta on a baking sheet.\nPreheat the broiler on your oven.\nPlace the kale and 1/3 cup water into the skillet that was just used to fry the polenta. Cover the skillet and cook the kale over a medium-high heat for 4 minutes.\nPlace the tomato slices on top of the polenta triangles. Sprinkle the goat cheese on top of the tomato slices. Broil  the polenta until the cheese melts and the tomatoes begin to cook.\nArrange the kale on a serving platter. Place the hot polenta triangles on top of the kale and serve immediately.",
    "pt": "1 h",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "1785228.jpg",
    "o": "",
    "st": "allrecipes"
}