{
    "id": 140593,
    "old_rating": "3.63636",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (16 ounce) bags fresh spinach, rinsed and stemmed",
        "1/4 cup butter",
        "4 tablespoons all-purpose flour",
        "2 1/2 cups hot milk",
        "1 pinch ground nutmeg",
        "salt and pepper to taste",
        "2 tablespoons butter",
        "1/2 cup Gruyere cheese, shredded",
        "paprika to taste"
    ],
    "nut": [
        "Calories > 380 kcal",
        "Carbs > 21.7 g",
        "Cholesterol > 76 mg",
        "Fat > 26.7 g",
        "Protein > 17.5 g",
        "Sodium > 517 mg"
    ],
    "n": "Gruyere Spinach Casserole",
    "a": "Jackie",
    "r": "0",
    "s": 4,
    "des": "\"This delicious combination of fresh spinach and Gruyere cheese especially compliments beef entrees.  It's easy to prepare. I've not yet made this without everyone loving it!  I don't add the salt as I find the cheese makes it salty enough.\"",
    "ins": "Place the spinach over boiling water in a pot fitted with a steamer basket, and steam 2 to 3 minutes, until wilted. Remove spinach to a colander and cool with cold water.  Once cool to the touch, squeeze as much moisture from the spinach as possible.\nIn a saucepan, begin making a white sauce by heating 1/4 cup of butter over medium heat.  Once melted, stir in the flour and cook for one minute.  Then add half of the milk and whisk.  Once incorporated, add the rest of the milk, the nutmeg and salt and pepper to taste.  Bring the mixture to a boil, reduce to low and allow to simmer for eight to ten minutes, stirring frequently until sauce has thickened.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source. Chop the cooled spinach and spread evenly into a lightly buttered, shallow baking dish. Place small dabs of the remaining butter on top of the spinach. Season lightly with salt, pepper and paprika. Pour white sauce over spinach.  Sprinkle Gruyere cheese evenly over the top.\nPlace in oven under broiler for ten minutes, or until top is browned.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "993597.jpg",
    "o": "",
    "st": "allrecipes"
}