{
    "id": 14066,
    "old_rating": "4.1",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 tablespoons olive oil",
        "1 1/2 cups chopped onion",
        "2 cloves garlic, minced",
        "2 red bell peppers, chopped",
        "1/4 cup almonds",
        "2 teaspoons balsamic vinegar",
        "1/2 teaspoon salt",
        "freshly ground black pepper",
        "1/8 teaspoon cayenne pepper",
        "4 cups broccoli florets",
        "1 pound penne pasta",
        "1/3 cup grated Parmesan cheese",
        "1/2 cup fresh basil leaves, cut into thin strips"
    ],
    "nut": [
        "Calories > 685 kcal",
        "Carbs > 101 g",
        "Cholesterol > 6 mg",
        "Fat > 23.2 g",
        "Protein > 23.7 g",
        "Sodium > 435 mg"
    ],
    "n": "Penne with Red Pepper Sauce and Broccoli",
    "a": "jessica",
    "r": "0",
    "s": 4,
    "des": "\"A delicious combination of red pepper sauce, fresh basil, almonds, broccoli florets, and pasta.\"",
    "ins": "Heat 2 tablespoons of the olive oil over medium heat in a large skillet. Add the onions and saute them for about 5 minutes until they soften; stirring occasionally. Lower the heat a bit and add the garlic and red pepper. Continue to cook the vegetables, stirring often for 15 minutes.\nIn a food processor or blender, chop the almonds fine. Add the pepper-onion mixture, the vinegar, and the remaining olive oil;  blend all to a puree. Add the salt, black pepper, and cayenne. Blend briefly to incorporate them.\nArrange a vegetable steamer over water in a saucepan. Bring the water to a boil, and add the broccoli. Cover the pan, and cook the broccoli over medium heat for 5 minutes or a bit longer, until it is tender as you like. Keep it warm.\nCook the pasta in a large pot of salted boiling water until it is just tender. Drain the pasta, and return it to the pot.\nPour the red pepper sauce, the Parmesan cheese, the broccoli, and the basil into the pot of penne. Heat the contents over medium heat until the pasta is very hot. Mix well. Add more salt and pepper to taste if necessary. Serve the pasta immediately.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "1116568.jpg",
    "o": "3808366.jpg,3466268.jpg,2439120.jpg,2187363.jpg,218844.jpg,211452.jpg",
    "st": "allrecipes"
}