{
    "id": 14062,
    "old_rating": "4.14815",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 quart water",
        "1/2 cup stone ground cornmeal",
        "1/2 cup quinoa",
        "1/2 teaspoon salt",
        "2 tablespoons olive oil",
        "2 cups minced onion",
        "1 large portobello mushroom, chopped",
        "3 cloves garlic, minced",
        "2 (14.5 ounce) cans stewed tomatoes",
        "1/4 cup sherry",
        "1/2 teaspoon crushed red pepper flakes (optional)",
        "1 teaspoon dried oregano",
        "salt and pepper to taste",
        "3 cups chopped green onions",
        "1/2 cup grated Parmesan cheese",
        "1/4 cup shaved Parmesan cheese"
    ],
    "nut": [
        "Calories > 395 kcal",
        "Carbs > 56.8 g",
        "Cholesterol > 13 mg",
        "Fat > 13.7 g",
        "Protein > 15.1 g",
        "Sodium > 1090 mg"
    ],
    "n": "Soft Polenta with Spicy Tomato Sauce",
    "a": "jen",
    "r": "0",
    "s": 4,
    "des": "\"Polenta should be served soft from the pot, or chilled and then pan-fried. Wild mushrooms, cheese, fresh herbs, and olives are good additions to this grain. If you can get a hold of it, try ricotta salata in place of the Parmesan cheese. If you don't want to use quinoa, you can simply use an equivalent amount of cornmeal in its place.\"",
    "ins": "In a small bowl whisk together 2 cups water with the cornmeal, quinoa and salt. Bring the remaining 2 cups water to a boil in a heavy saucepan. Stir the cornmeal mixture into the boiling water, and continue stirring. Be careful! The polenta may spit and sputter and the hot bits of polenta can burn. Turn the heat to very low and cook the polenta for 40 minutes; stirring with a wooden spoon every 10 minutes.\nMake the tomato sauce while the polenta cooks: Heat olive oil in a large saucepan over medium heat, add the onions. Cook the onions for about 5 minutes, stirring often, until they have softened. Stir in the chopped mushrooms and the garlic, saute for 5 minutes. Then add the tomatoes, sherry, chili flakes and oregano. When the sauce comes to a boil turn the heat to low. Simmer the sauce for 30 minutes; season with salt and pepper.\nWhen the polenta has cooked for 40 minutes, sprinkle the green onions and grated cheese into the polenta. Stir well. Mound the polenta on plates, make a well in the center of each mound and ladle in the tomato sauce. Garnish with the shaved cheese.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "263047.jpg",
    "o": "",
    "st": "allrecipes"
}