{
    "id": 140601,
    "old_rating": "4.64444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups brown rice",
        "3 cups water",
        "2 large potatoes, grated",
        "4 large carrots, grated",
        "2 large celery stalks, chopped",
        "6 pounds ground beef",
        "8 eggs",
        "1 dash salt",
        "1/4 cup olive oil",
        "1 1/2 cups regular rolled oats"
    ],
    "nut": [],
    "n": "Poochie Meat Cakes",
    "a": "Shelly H",
    "r": "0",
    "s": 36,
    "des": "\"I have 4 dogs, ranging from 5 yrs - 17 yrs old (Terriers of all sizes).  After the big dog food scare, I didn't want to take chances so I tried to figure out a healthy recipe for them, something that had all the nutrients and fat they needed. This is what I came up with and my dogs absolutely loved it! The nice thing about this recipe is that it can be eaten by the humans as well.\"",
    "ins": "Preheat oven to 400 degrees F (205 degrees C). Grease 36 cups of 3 large muffin tins.\nIn a medium saucepan, combine the rice with water. Bring to a boil over high heat, uncovered, and cook 10 minutes. Reduce heat to low, cover, and simmer 20 minutes. Remove from heat, let cool several minutes, then fluff with a fork and set aside.\nIn a large bowl, combine the potatoes, carrots, celery, ground beef, and eggs. Mix ingredients together using your hands or a sturdy spoon. Add salt, olive oil, rolled oats, and rice; mix well.\nFill each muffin cup with some of the meat mixture, and pat down the to make it firm. Bake 45 minutes, or until surface feels set. Cool on a rack 10 minutes or longer.\nRemove the meat cakes by turning the muffin tin upside down over a sheet of aluminum foil. Tap each muffin cup to release the cake. Refrigerate or freeze in sealed plastic bags. NOTE: Do not feed to dogs while still hot.",
    "pt": "35 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "3560674.jpg",
    "o": "",
    "st": "allrecipes"
}