{
    "id": 14078,
    "old_rating": "3.94444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/2 tablespoons soy sauce",
        "3 tablespoons sake",
        "2 tablespoons balsamic vinegar",
        "2 teaspoons white sugar",
        "3 tablespoons water",
        "2 teaspoons cornstarch",
        "1 tablespoon canola oil",
        "2 tablespoons dark sesame oil",
        "2 cloves garlic, sliced",
        "6 whole dried red chile peppers, seeded and diced",
        "1 tablespoon minced fresh ginger root",
        "1 medium head bok choy, cut into 1 1/2 inch strips",
        "20 fresh shiitake mushrooms, stemmed and quartered",
        "8 green onions, halved lengthwise",
        "2 (9 ounce) packages fresh rice noodles",
        "2 tablespoons sesame seeds, toasted"
    ],
    "nut": [
        "Calories > 486 kcal",
        "Carbs > 77.5 g",
        "Cholesterol > 0 mg",
        "Fat > 13.3 g",
        "Protein > 10.5 g",
        "Sodium > 728 mg"
    ],
    "n": "Rice Noodles with Shiitakes, Choy, and Chiles",
    "a": "jen",
    "r": "0",
    "s": 4,
    "des": "\"A delicious twist on noodles if you are getting tired of the spaghetti routine. If you can't find fresh rice noodles, cooked dried rice noodles work just fine. Dried rice noodles, as well as fresh rice noodles, can be found in many supermarkets as well as Asian markets. You can use sherry in place of the sake, and Chinese black vinegar in place of the balsamic, if you like.\"",
    "ins": "In a small bowl, whisk together the soy sauce, sake or sherry, vinegar, sugar, water and cornstarch. In a large skillet or wok heat the oils over high heat. When the oil is nearly smoking, add the garlic and hot peppers. Take the skillet or wok off the heat after 10 seconds.\nReduce the heat to medium-high and return the skillet or wok to the heat. Add the ginger, bok choy, shiitakes, and green onions; cook for 3 minutes over high heat, stirring constantly. Add the fresh or soaked rice noodles and the soy sauce mixture; cook 2 minutes more or until the noodles are hot and tender. Serve the noodles immediately, topped with the toasted sesame seeds.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "702308.jpg",
    "o": "",
    "st": "allrecipes"
}