{
    "id": 141047,
    "old_rating": "4.37037",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 eggs",
        "1 cup milk",
        "1/2 cup heavy cream",
        "1 tablespoon vanilla extract",
        "1 teaspoon ground nutmeg",
        "1 (16 ounce) loaf cinnamon bread with raisins, cut into 1-inch cubes",
        "2 Granny Smith apples - peeled, cored, and sliced",
        "1 cup brown sugar",
        "1 teaspoon ground cinnamon",
        "1/4 cup melted butter",
        "1 Granny Smith apple - peeled, cored, and diced"
    ],
    "nut": [
        "Calories > 312 kcal",
        "Carbs > 43 g",
        "Cholesterol > 118 mg",
        "Fat > 12.5 g",
        "Protein > 8.3 g",
        "Sodium > 222 mg"
    ],
    "n": "Apple-Raisin Breakfast Bread Pudding",
    "a": "TOVARK77",
    "r": "0",
    "s": 12,
    "des": "\"You might call this baked French toast, or you might call it breakfast bread pudding, but everyone will agree it is simple, sweet, and delicious. I have found kids and adults enjoy it and it is wonderful for brunch and/or a potluck.\"",
    "ins": "Beat the eggs in a mixing bowl. Whisk in the milk, cream, vanilla extract, and nutmeg until evenly blended. Fold in the bread cubes and set aside until the bread soaks up the egg mixture, about 5 minutes. Place the sliced apples into a mixing bowl and sprinkle with brown sugar, cinnamon, and melted butter; toss to evenly coat. Grease a 9x13-inch baking dish and arrange the apple slices evenly into the bottom of the prepared baking dish; spoon the bread mixture over top. Cover the dish with aluminum foil and refrigerate overnight.\nPreheat an oven to 375 degrees F (190 degrees C).\nSprinkle the diced apple over the bread pudding and cover again with the aluminum foil. Bake in the preheated oven until the bread is no longer soggy, about 40 minutes. Remove the foil and set the oven to Broil; broil until golden brown on top, about 5 minutes. Remove and let stand 5 to 10 minutes before serving.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "9 h ",
    "i": "2722546.jpg",
    "o": "",
    "st": "allrecipes"
}