{
    "id": 141024,
    "old_rating": "4.48837",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup sorghum flour",
        "1/2 cup tapioca flour",
        "1/2 cup rice flour",
        "1 cup cocoa powder, sifted",
        "1 1/2 tablespoons xanthan gum",
        "2 1/2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "3/4 cup butter at room temperature",
        "3/4 cup (packed) dark brown sugar",
        "1 cup white sugar",
        "3 eggs",
        "2 egg yolks",
        "2 teaspoons vanilla extract",
        "1 1/2 cups buttermilk",
        "5 ounces chocolate chips",
        "1/2 cup sour cream",
        "1/2 teaspoon vanilla extract",
        "1 tablespoon heavy cream"
    ],
    "nut": [
        "Calories > 430 kcal",
        "Carbs > 60.3 g",
        "Cholesterol > 118 mg",
        "Fat > 20.8 g",
        "Protein > 6.5 g",
        "Sodium > 395 mg"
    ],
    "n": "Gluten-Free Chocolate Cake with Semi-Sweet Chocolate Icing",
    "a": "Gluten Free Mommy",
    "r": "0",
    "s": 12,
    "des": "\"A delicious gluten-free chocolate cake!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan and set aside.\nIn a medium bowl, sift together the sorghum, tapioca, and rice flours with the cocoa powder, xanthan gum, baking powder, and baking soda.\nIn a large mixer bowl, cream the butter until light and fluffy. Slowly beat in the brown and white sugars; whip until fluffy. Beat in the eggs and egg yolks one at a time. Add the vanilla. On low speed, alternately combine the buttermilk with the flour mixture. Pour batter into prepared pan.\nBake in preheated oven for 30 to 35 minutes, or until a toothpick inserted into the center of the cake comes out clean. Cool in pan.\nTo make the icing, in the top of a double boiler over medium high heat, melt the chocolate chips (or use microwave). Remove from heat and cool until warm. Stir in the sour cream and vanilla; add heavy cream. Stir in additional heavy cream to make desired consistency. Once the cake is thoroughly cool, spread a thin layer of frosting over the top.",
    "pt": "35 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "67400.jpg",
    "o": "",
    "st": "allrecipes"
}