{
    "id": 141067,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 potatoes, peeled and sliced 1/4 inch thick",
        "2 onions, peeled and thinly sliced",
        "5 sprigs rosemary, leaves stripped and finely chopped",
        "1/4 cup extra virgin olive oil",
        "salt and freshly ground black pepper to taste",
        "1 (4 pound) rabbit, cleaned and cut into pieces",
        "1 onion, diced",
        "1 tablespoon chopped green olives",
        "10 leaves fresh sage",
        "1 teaspoon chopped fresh marjoram",
        "6 baby artichokes, tips trimmed and tough outer leaves removed",
        "1 teaspoon tomato paste",
        "1 bunch fresh parsley, minced",
        "salt and freshly ground black pepper to taste"
    ],
    "nut": [
        "Calories > 732 kcal",
        "Carbs > 53.1 g",
        "Cholesterol > 173 mg",
        "Fat > 26.9 g",
        "Protein > 68 g",
        "Sodium > 362 mg"
    ],
    "n": "Seared Rabbit with Rosemary Potatoes",
    "a": "IMANKAY",
    "r": "0",
    "s": 6,
    "des": "\"I'm Palestinian and my mother would cook this for special guests. A very exotic twist to cooking rabbit with sage, olives, artichokes and served alongside rosemary potatoes.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nToss potatoes and 2 sliced onions with rosemary and olive oil in a large bowl.  Season to taste with salt and pepper; spread into a large, shallow baking dish.\nBake potatoes in the preheated oven until tender, about 45 minutes.\nMeanwhile, heat olive oil in a large skillet over high heat.  Cook rabbit pieces, turning once, until brown on both sides, about 10 minutes.  Add the remaining onion, olives, sage, and marjoram and cook for 2 minutes.  Reduce heat to medium-low, cover and simmer for 30 minutes.\nStir artichokes, tomato paste and parsley into skillet with rabbit.  Replace cover and simmer until artichokes are tender, about 15 minutes.  Serve with rosemary potatoes.",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "2580401.jpg",
    "o": "",
    "st": "allrecipes"
}