{
    "id": 141009,
    "old_rating": "4.34286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups buttermilk",
        "2 tablespoons hot pepper sauce",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1 teaspoon onion powder",
        "1 teaspoon garlic powder",
        "20 chicken wings, separated at joints, tips discarded",
        "3 cups cornflakes cereal, crushed",
        "1/2 cup all-purpose flour",
        "1/2 cup cornmeal",
        "salt and black pepper to taste",
        "1 cup honey",
        "1 tablespoon crushed red pepper flakes"
    ],
    "nut": [
        "Calories > 680 kcal",
        "Carbs > 97.8 g",
        "Cholesterol > 81 mg",
        "Fat > 19.6 g",
        "Protein > 32 g",
        "Sodium > 918 mg"
    ],
    "n": "Super Crunch Oven Cooked Honey Dipped Wings",
    "a": "Boomdog02",
    "r": "0",
    "s": 5,
    "des": "\"These wings are coated in cornflake crumbs, oven fried and drizzled with spicy honey.  They are hot, crispy and addicting...best of all, not fried, so they're better for you. GET LOTS OF NAPKINS (AND MAYBE A BIB) AND ENJOY!\"",
    "ins": "Whisk together the buttermilk, hot pepper sauce, 1 teaspoon salt, 1 teaspoon black pepper, onion powder, and garlic powder in a bowl; pour into a resealable plastic bag. Add the chicken wings, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator 12 to 24 hours.\nPreheat an oven to 400 degrees F (200 degrees C). Grease two baking sheets with nonstick cooking spray.\nCombine the crushed cornflakes, flour, cornmeal, and salt and pepper to taste in a bowl. Remove the chicken wings from the marinade, and squeeze off excess. Discard the remaining marinade. Press the wings into the cornflake mixture and place onto the prepared baking sheets. Spray the top of the wings with nonstick cooking spray.\nBake in the preheated oven until the meat is no longer pink and is pulled easily from the bone, 30 to 40 minutes. While the chicken is cooking, stir together the honey and red pepper flakes in a small saucepan over medium heat until the honey thins. Keep warm until the wings are ready. Once the chicken has cooked, place the wings into a large mixing bowl and drizzle with the honey sauce. Toss until evenly coated. Now you will have a big pile of hot, crunchy, spicy, sticky wings.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "13 h",
    "i": "800689.jpg",
    "o": "",
    "st": "allrecipes"
}