{
    "id": 14100,
    "old_rating": "4.05455",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 ounces cream cheese, softened",
        "1/2 cup fresh cilantro leaves",
        "salt and pepper to taste",
        "3 tablespoons butter",
        "8 eggs"
    ],
    "nut": [
        "Calories > 320 kcal",
        "Carbs > 1.7 g",
        "Cholesterol > 426 mg",
        "Fat > 28.5 g",
        "Protein > 14.9 g",
        "Sodium > 288 mg"
    ],
    "n": "Herbed Cream Cheese Omelet",
    "a": "jen",
    "r": "0",
    "s": 4,
    "des": "\"Somehow, when cream cheese is mixed with herbs and melted in an omelet, it acquires a wonderful taste that you wouldn't associate with cream cheese.\"",
    "ins": "Mix the cream cheese with the cilantro in a bowl, adding salt and pepper to taste.\nHeat one-quarter of the butter in a well-seasoned omelet pan or 8 inch non-stick frying pan over medium-high heat. When the butter is hot and bubbling, swirl it around in the pan.\nJust before the butter begins to brown, beat 2 of the eggs and pour into pan. Lower the heat.\nAfter 10 seconds or so, the omelet will coagulate. Push the omelet to one side of the pan with a spoon or spatula, and let the raw egg run over the cleared skillet. Repeat this one more time, then take the skillet off the heat.\nDab one quarter of the herbed cream cheese along the middle of the omelet from one side to the other. Season the omelet with additional salt and pepper to taste. If it has not completely set, place the pan over medium heat for a half minute longer. When the omelet is set, slide it from the pan onto a plate so that the omelet rolls up and the herbed cream cheese runs along the length of the roll. Serve it right away. Make three more omelets the same way, making sure the pan and butter get good and hot before adding the beaten eggs. Serve each one as soon as it is cooked.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "204247.jpg",
    "o": "",
    "st": "allrecipes"
}