{
    "id": 14111,
    "old_rating": "4.15152",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 small heads cauliflower",
        "salt to taste",
        "2 tablespoons unsalted butter",
        "1 onion, chopped",
        "1 clove garlic, minced",
        "4 cups vegetable broth",
        "1 pinch ground nutmeg",
        "1 1/2 cups milk",
        "2 cups shredded white Cheddar cheese",
        "freshly ground black pepper"
    ],
    "nut": [
        "Calories > 411 kcal",
        "Carbs > 25.6 g",
        "Cholesterol > 69 mg",
        "Fat > 22 g",
        "Protein > 22.7 g",
        "Sodium > 1417 mg"
    ],
    "n": "Cauliflower and White Cheddar Cheese Soup",
    "a": "Maryanne",
    "r": "0",
    "s": 5,
    "des": "\"A creamy cauliflower and cheddar soup. Instead of the cauliflower you can also use broccoli, corn kernels or even pumpkin.\"",
    "ins": "Cut cauliflower heads into florets.\nFill a large saucepan 3/4 full with water, salt the water lightly and bring water to a boil. Add 1/2 of the cauliflower florets to the boiling water; boil until tender. Drain well.\nMelt butter in a 4 quart soup pot over a medium-low heat. Saute the onion and garlic in the butter until the onion is tender. Pour in the vegetable stock and unboiled cauliflower florets. Mix in nutmeg and bring the mixture  to a boil; boil until cauliflower is tender. Remove pot from heat to cool.\nUse an electric blender to blend the soup-onion-cauliflower mixture until smooth (blend the mixture 2 cups at a time).  Place the blended soup back in the 4 quart soup pot and heat over a medium-low heat. Pour milk into the pot and stir well. When the mixture is simmering, mix in the cooked florets and 1 1/2 cup of cheese. Stir until cheese melts and the soup has thickened. Serve hot, season with sprinkles of cheese and black pepper to taste. .",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2825130.jpg",
    "o": "",
    "st": "allrecipes"
}