{
    "id": 141125,
    "old_rating": "4.52427",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds ground beef",
        "1/4 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "3 tablespoons barbeque sauce",
        "1/2 teaspoon garlic powder",
        "1/2 pound bacon, cut into 1/4 inch pieces",
        "1 medium onion, finely chopped",
        "3/4 cup shredded Cheddar cheese",
        "6 hamburger buns, split"
    ],
    "nut": [
        "Calories > 670 kcal",
        "Carbs > 26.8 g",
        "Cholesterol > 166 mg",
        "Fat > 38.8 g",
        "Protein > 50.1 g",
        "Sodium > 933 mg"
    ],
    "n": "Easy Bacon, Onion and Cheese Stuffed Burgers",
    "a": "AmyThompson",
    "r": "0",
    "s": 6,
    "des": "\"Wonderful stuffed burger that can be easily changed to suit different tastes.  My kids who normally don't have onions on their burgers REALLY enjoyed these.  We served with french fries and root beer floats!\"",
    "ins": "In a large mixing bowl, mix together the ground beef, salt, black pepper, barbeque sauce and garlic powder using your hands. Taking a small handful at a time (approximately 1/4 pound), shape into 12 patties. Lay patties out on a cookie sheet and cover with plastic wrap; place patties in the refrigerator.\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown, about 5 minutes. Remove bacon from skillet with a slotted spoon and drain on paper towels. Turn the heat down to medium and pan fry the onions in the remaining bacon drippings until soft and translucent and just beginning to brown. Mix together onions and bacon in a small bowl.\nPrepare a grill or large skillet for medium heat.\nAs the grill heats, pull beef patties out of the refrigerator; top 6 of the patties with 1- 1/2 tablespoons of the bacon and onion mixture each, and sprinkle with shredded cheese. Top each with one of the remaining patties and press the edges together to seal.\nGrill or pan fry the stuffed and sealed patties until cooked through, 2 to 3 minutes per side. Serve on hamburger buns with condiments of your choice.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "35 m",
    "i": "419203.jpg",
    "o": "2580546.jpg,2411157.jpg,1107116.jpg,853288.jpg,683275.jpg,640154.jpg",
    "st": "allrecipes"
}