{
    "id": 14121,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup garbanzo beans",
        "2 cups plain yogurt",
        "1 teaspoon grated fresh ginger",
        "1/2 teaspoon chili powder",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon ground coriander seed",
        "1/4 teaspoon rock salt",
        "1/4 teaspoon ground black pepper",
        "salt to taste",
        "1 large potato - peeled, boiled and mashed",
        "32 thin wheat crackers",
        "1/4 cup green chutney",
        "1/4 cup sweet and sour chutney",
        "1/2 cup red onion, minced",
        "1/2 cup chopped fresh cilantro",
        "1/2 cup crushed potato chips"
    ],
    "nut": [
        "Calories > 379 kcal",
        "Carbs > 64 g",
        "Cholesterol > 7 mg",
        "Fat > 9.5 g",
        "Protein > 12.2 g",
        "Sodium > 516 mg"
    ],
    "n": "Chaat - Dahi Batata Puri",
    "a": "Rani",
    "r": "0",
    "s": 4,
    "des": "\"Chaat is a broad term that encompasses many different dishes. This recipe is made of yogurt and potatoes and other chaat sauces. You may need to make a trip to an Indian grocery store to stock up on spherical 'puris' (also called as pani-puri puris), 'sev', green chutney, and a sweet and sour chutney. I have tried here to give as many substitutions as possible, if you are unable to go to an Indian grocery store. However, you will definitely lose the authentic taste if you make substitutions. If you can find them, use black salt in place of the rock salt, spherical puris in place of the wheat crackers, and plain sev in place of the crushed potato chips.\"",
    "ins": "Boil the garbanzo beans in water for about 30 minutes or until  tender when pierced with a fork; drain well.\nBeat the yogurt together with the following: fresh grated ginger, chili powder, cumin powder, coriander powder, rock salt or black salt, black pepper and salt.\nSeason the mashed potato with salt.\nBreak each puri gently with a fork to create a tiny opening on the top. Arrange the puris in 4 plates, 8 in each plate. Or, if using wheat crackers arrange them on a platter or plates. Place the potatoes on top of each cracker. Place about 1 tablespoon of potato in each puri or on each cracker. Place a few garbanzo beans on top of the potato. Spoon the spiced yogurt on top. Spoon green chutney  and sweet and sour chutney on top of it.  Garnish with the chopped onion, cilantro, and sev on top. Serving tip: I like to set up a number of small bowls with each of the above condiments, so that each person can add whatever they want to, according to their taste and preferences.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "1133714.jpg",
    "o": "",
    "st": "allrecipes"
}