{
    "id": 141258,
    "old_rating": "4.77215",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2/3 cup toasted slivered almonds",
        "1 cup graham cracker crumbs",
        "1/4 cup white sugar",
        "1 pinch salt",
        "1/4 cup butter, melted",
        "4 egg yolks",
        "1 (14 ounce) can sweetened condensed milk",
        "1/2 cup key lime juice",
        "3/4 cup cold heavy cream",
        "1/2 teaspoon grated lime zest"
    ],
    "nut": [
        "Calories > 456 kcal",
        "Carbs > 47.3 g",
        "Cholesterol > 165 mg",
        "Fat > 26.9 g",
        "Protein > 8.7 g",
        "Sodium > 177 mg"
    ],
    "n": "Phoenician's Key Lime Pie",
    "a": "Arlette Therese Abdallah",
    "r": "0",
    "s": 8,
    "des": "\"When I moved from Lebanon to Florida spring of 1999, I brought with me my love for cooking and search for new recipes. The famous key lime pie was new to me. It was a friend's best dessert, and he used to buy it from Costco every time we go for shopping. I tasted the pie at several places, but they were missing that wow flavor. I kept playing with the recipe, and the right flavor is found. I live now in North Bay, Ontario, and we only get the Key Limes twice a year, so sometimes I substitute with fresh lime juice. I hope you all enjoy!!\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).\nPulse the almonds in a food processor until finely ground. Combine the almonds with the graham cracker crumbs, sugar, and salt. Pour in the melted butter and mix until evenly moistened. Press into a 9-inch pie plate.\nBake the crust in the preheated oven until golden brown, 10 to 13 minutes.\nWhile the crust is baking, beat the egg yolks in a bowl with the condensed milk, cream, and lime zest. Whisk in the lime juice a little at a time to thicken the custard. Pour the custard into the pie crust and return to the oven.\nBake in the oven for 15 minutes to help the custard begin to set. Cool to room temperature on a wire rack before covering loosely with plastic wrap and refrigerating overnight.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "10 h ",
    "i": "940760.jpg",
    "o": "4536394.jpg,4536392.jpg,4536315.jpg,3915374.jpg,3121869.jpg,3121868.jpg",
    "st": "allrecipes"
}