{
    "id": 141401,
    "old_rating": "3.86364",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup finely chopped apple",
        "1/8 teaspoon apple pie spice",
        "4 skinless, boneless chicken breast halves",
        "4 thin slices prosciutto",
        "1/2 teaspoon apple pie spice",
        "1 tablespoon butter",
        "1 tablespoon all-purpose flour",
        "2/3 cup milk",
        "1 dash ground black pepper"
    ],
    "nut": [
        "Calories > 208 kcal",
        "Carbs > 5.9 g",
        "Cholesterol > 78 mg",
        "Fat > 8.4 g",
        "Protein > 25.9 g",
        "Sodium > 224 mg"
    ],
    "n": "Apple and Prosciutto Stuffed Chicken Breast",
    "a": "Jessica C",
    "r": "0",
    "s": 4,
    "des": "\"This is a yummy take on stuffed chicken breast. The prosciutto and apple compliment each other nicely!\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).  Grease an ovenproof baking dish; set aside.\nCombine chopped apple and the 1/8 teaspoon apple pie spice in a small bowl; set aside.\nPlace the chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the chicken with the smooth side of a meat mallet to a thickness of 1/4 inch. Place one slice of prosciutto on each chicken breast. Place 1/4 of the apple mixture on each chicken breast. Roll up each breast and secure with a toothpick. Sprinkle the 1/2 teaspoon apple pie spice all over outside of chicken breasts and place into the prepared baking dish.\nBake the chicken breasts, uncovered, in the preheated oven until no longer pink in the center and the juices run clear, about for 25-30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nWhen chicken is almost done, melt butter in a small saucepan over medium heat. Whisk in flour to make a smooth paste. Whisk in milk and pepper; bring to a boil. Cook and stir until thickened and bubbly, about 5 minutes. Serve sauce over chicken.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "139014.jpg",
    "o": "",
    "st": "allrecipes"
}