{
    "id": 141783,
    "old_rating": "3.56098",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1 cup butter, softened",
        "1 cup confectioners' sugar",
        "2 eggs, room temperature",
        "1 teaspoon vanilla extract",
        "1/2 cup milk, room temperature"
    ],
    "nut": [
        "Calories > 279 kcal",
        "Carbs > 22.9 g",
        "Cholesterol > 87 mg",
        "Fat > 19.8 g",
        "Protein > 3.1 g",
        "Sodium > 223 mg"
    ],
    "n": "Victoria Sponge Cake",
    "a": "Caroline Victoria",
    "r": "0",
    "s": 10,
    "des": "\"A Victoria Sponge was the favorite sponge cake of Queen Victoria, and has since become a tried-and-true recipe for tea-time sponge cakes. Victoria Sponges are generally filled with jam, and are undecorated on the top, but you can serve each piece with a dollop of whipped cream, or shake some powdered sugar over the top if you'd like.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease an 8-inch springform pan.\nSift the flour and baking powder into a medium bowl and set aside.\nBeat butter and sugar with an electric mixer until light and fluffy. The mixture should be noticeably lighter in color. Add room-temperature eggs one at a time, allowing each egg to blend into butter mixture before adding the next. Beat in vanilla. Pour in the flour mixture alternately with the milk, mixing until just incorporated. Pour batter into prepared pan.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, about 20 minutes. Cool the cake in the pan for 10 minutes, then turn the cake out onto a wire rack to cool completely.\nThis cake can be served as is, just dusted with confectioners' sugar. Alternately, cut the cake in half horizontally and sandwich the layers together with jam or custard.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "57104.jpg",
    "o": "4442760.jpg,4331047.jpg,2976978.jpg,2370783.jpg,2272877.jpg,1112445.jpg",
    "st": "allrecipes"
}