{
    "id": 141774,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (12 ounce) container Spamâ„¢ luncheon meat, diced",
        "3/4 cup button mushrooms, chopped",
        "1/2 head red leaf lettuce, rinsed and torn",
        "1 cup baby spinach leaves",
        "2 eggs",
        "1/2 cup crumbled feta cheese",
        "1 tablespoon finely grated Parmesan cheese",
        "1 tablespoon finely chopped salted peanuts",
        "4 tablespoons chopped dill",
        "8 anchovy fillets",
        "4 tablespoons Ranch dressing",
        "1 cup croutons, purchased or homemade"
    ],
    "nut": [
        "Calories > 1061 kcal",
        "Carbs > 25.6 g",
        "Cholesterol > 384 mg",
        "Fat > 85.4 g",
        "Protein > 49 g",
        "Sodium > 4162 mg"
    ],
    "n": "Spamâ„¢-a-licious Not-So-Caesar Salad",
    "a": "Jemma",
    "r": "0",
    "s": 2,
    "des": "\"My partner and I invented this recipe by accident one afternoon, when we thought there was 'no food left'! Don't underestimate the Spamâ„¢ - although it's average uncooked, when cooked it is almost undistinguishable from crispy bacon. Give it a try!\"",
    "ins": "Heat a large skillet over medium-high heat. Fry the meat in the preheated skillet until it is golden brown and crispy. Remove from skillet and drain on paper towels. Cook the mushrooms in the same skillet until softened. Remove from skillet and set aside. Crack the eggs into the skillet and cook while stirring until they are cooked through and scrambled. Turn off the heat.\nDivide the red leaf lettuce and baby spinach leaves between two large salad bowls. Top the salad greens with the fried luncheon meat, mushrooms and scrambled eggs. Sprinkle both salads with crumbled feta cheese, Parmesan cheese, chopped peanuts, and dill. Arrange the anchovy fillets across the top of the salads and drizzle two tablespoons of Ranch dressing on each serving. Garnish with croutons.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "4459892.jpg",
    "o": "",
    "st": "allrecipes"
}