{
    "id": 141991,
    "old_rating": "4.65753",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups chicken broth",
        "1 (10 ounce) box couscous",
        "3/4 cup olive oil",
        "1/4 cup fresh lemon juice",
        "2 tablespoons white balsamic vinegar",
        "1/4 cup chopped fresh rosemary leaves",
        "salt and ground black pepper to taste",
        "2 large cooked skinless, boneless chicken breast halves, cut into bite-size pieces",
        "1 cup chopped English cucumber",
        "1/2 cup chopped sun-dried tomatoes",
        "1/2 cup chopped pitted kalamata olives",
        "1/2 cup crumbled feta cheese",
        "1/3 cup chopped fresh Italian parsley",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 645 kcal",
        "Carbs > 44 g",
        "Cholesterol > 68 mg",
        "Fat > 38.8 g",
        "Protein > 29.4 g",
        "Sodium > 792 mg"
    ],
    "n": "Rosemary Chicken Couscous Salad",
    "a": "Shayna",
    "r": "0",
    "s": 6,
    "des": "\"This is a wonderful summer salad. Fresh herbs keep the salad light, while the chicken and feta cheese make it hearty enough to serve for a main meal. Use as a side dish by omitting the chicken and adding chopped artichoke hearts. The salad also works wonderfully with grilled salmon or chicken.\"",
    "ins": "Place chicken stock in a saucepan and bring to a boil over medium-high heat. Stir in couscous. Remove pan from the heat; cover, and let stand for 5 minutes. Fluff couscous with a fork. Cool for 10 minutes.\nMeanwhile, make the dressing by combining the olive oil, lemon juice, and vinegar in the bowl of a blender or food processor; mix on low until mixture thickens. Stir in rosemary. Season to taste with salt and pepper.\nCombine the chicken, cucumber, sun-dried tomatoes, and olives in a large bowl. Stir in the couscous, Feta cheese, and parsley. Season to taste with salt and pepper. Toss the salad with half the dressing. Taste, and add more dressing as desired, or, if making the salad in advance, add additional dressing just before serving.",
    "pt": "35 m",
    "ct": "10 m",
    "tt": "45 m",
    "i": "2132477.jpg",
    "o": "",
    "st": "allrecipes"
}