{
    "id": 141992,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) can pineapple chunks - drained with juice reserved",
        "2 teaspoons rice wine vinegar",
        "2 tablespoons soy sauce",
        "1 teaspoon olive oil",
        "1 teaspoon vanilla-flavored vodka",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon brown sugar",
        "1/2 teaspoon white sugar",
        "1 (1 1/2-pound) beef sirloin steak, cut into 1/4-inch strips",
        "1 1/2 cups water",
        "1/2 cup long grain white rice",
        "2 tablespoons olive oil"
    ],
    "nut": [
        "Calories > 1140 kcal",
        "Carbs > 58.5 g",
        "Cholesterol > 228 mg",
        "Fat > 67.5 g",
        "Protein > 70 g",
        "Sodium > 1092 mg"
    ],
    "n": "Pineapple Steak Stir Fry",
    "a": "Maryann S.",
    "r": "0",
    "s": 2,
    "des": "\"I was sitting around one day and had a craving for warm pineapple and steak. A recipe was born! This recipe is really easy to double up on, but watch the sugar if you do.\"",
    "ins": "Stir together 1/3 cup reserved pineapple juice, rice wine vinegar, soy sauce, olive oil, vanilla vodka, ginger, brown sugar, and white sugar in a mixing bowl until blended. Adjust the sugar to taste.\nPlace the steak strips in a large, resealable plastic bag. Pour in the pineapple juice mixture and seal the bag. Turn the bag gently to evenly coat steak with the marinade. Refrigerate 3 to 4 hours.\nBring water to a boil in a saucepan over medium-high heat. Add the rice and stir. Reduce heat, cover and simmer 20 minutes.\nHeat 2 tablespoons olive oil in a skillet over medium heat. Remove steak strips from marinade and place in the skillet. Cook and stir the steak strips until browned and no longer pink, about 2 minutes per side. Remove from the heat, cover and keep warm.\nPlace the pineapple chunks in a separate skillet. Cook over medium heat until slightly soft and heated through, about 4 minutes. To serve, divide the rice between two bowls, top with steak strips and pineapple chunks, and toss briefly.",
    "pt": "15 m",
    "ct": "28 m",
    "tt": "3 h ",
    "i": "2843185.jpg",
    "o": "",
    "st": "allrecipes"
}