{
    "id": 142001,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 1/2 pounds potatoes, peeled and cut into 1/2-inch dice",
        "1 1/2 pounds haddock fillets",
        "1 1/4 cups milk",
        "1 bunch green onions, minced",
        "1 cup creme fraiche",
        "salt and pepper to taste",
        "3 ounces Emmentaler cheese, finely shredded"
    ],
    "nut": [
        "Calories > 530 kcal",
        "Carbs > 52.8 g",
        "Cholesterol > 136 mg",
        "Fat > 21.2 g",
        "Protein > 34.6 g",
        "Sodium > 261 mg"
    ],
    "n": "Fluffy Haddock and Potato Pie",
    "a": "Patches",
    "r": "0",
    "s": 6,
    "des": "\"This filling recipe is best enjoyed on a cold day. Great served with peas or broccoli and some crusty bread. This dish can also be prepared with cod fillets, and is delicious prepared with a mixture of both cod and haddock. If available, use Maris Piper or King Edward potatoes.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nBring potatoes to a boil in a large pot of salted water.  Cook until tender enough to insert a fork, but still firm, about 15 minutes. Drain and move to a large bowl.\nMeanwhile, place the haddock in a large saucepan over medium heat.  Pour the milk over the fish and then sprinkle with the green onions.  Cover and bring to a boil.  Reduce heat to low and simmer until the fish flakes easily with a fork.\nTransfer haddock to a plate. Remove the bones and skin and discard. Pour the milk mixture over the diced potatoes; beat until smooth.  Blend in the creme fraiche. Season with salt and pepper. Gently fold the haddock into the mixture along with half of the shredded Emmentaler cheese. Spoon the mixture into a large, shallow baking dish.  Sprinkle the remaining Emmentaler cheese over the top\nBake in preheated oven until the surface has turned golden brown, about 15 minutes.  Serve immediately.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "374923.jpg",
    "o": "",
    "st": "allrecipes"
}