{
    "id": 14211,
    "old_rating": "4.31373",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package macaroni",
        "4 eggs",
        "1 cup mayonnaise",
        "1/2 cup sour cream",
        "1 teaspoon salt, or to taste",
        "1/4 teaspoon ground black pepper, or to taste",
        "1/4 teaspoon ground mustard",
        "2 tablespoons sweet pickle juice",
        "2 tablespoons celery seed",
        "1 cup chopped celery",
        "1/2 cup chopped red onion",
        "1/2 cup pimento-stuffed green olives",
        "1/4 cup chopped sweet pickle",
        "2 carrots, grated",
        "1 green bell pepper, chopped"
    ],
    "nut": [
        "Calories > 689 kcal",
        "Carbs > 66.7 g",
        "Cholesterol > 146 mg",
        "Fat > 40.3 g",
        "Protein > 16.2 g",
        "Sodium > 1120 mg"
    ],
    "n": "Macaroni Salad",
    "a": "Linda",
    "r": "0",
    "s": 6,
    "des": "\"This recipe is easily multiplied for a crowd. Everyone in my family asks me to bring this to our functions. I even make it for weddings.  Sometimes I use a mixture of different kinds of pasta, especially if I only have a little of this kind or that.  Depending on what type of macaroni used, more dressing may be required.  The recipe calls for red onion, but sweet onion is great, too.\"",
    "ins": "Cook pasta in a large pot of boiling water until al dente. Drain; rinse with cold water. Set aside.\nMeanwhile, place eggs in a saucepan, and fill with enough cold water to cover eggs completely by about 1 inch. Bring water to a boil. Cover, remove from heat, and let eggs stand in hot water for 20 minutes. Immediately remove from hot water and cool in an ice water bath. When cool enough to handle, peel and chop eggs.\nIn a medium bowl, mix together mayonnaise, sour cream, dry mustard, sweet pickle juice, and celery seed. Season with salt and black pepper.\nIn a large bowl, combine drained pasta, celery, onion, olives, sweet pickles, carrots, green pepper, and chopped eggs. Stir in dressing, and mix well. Refrigerate before serving.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "236817.jpg",
    "o": "3680442.jpg,3619240.jpg,3507543.jpg,3465988.jpg,3372991.jpg,2182974.jpg",
    "st": "allrecipes"
}