{
    "id": 142193,
    "old_rating": "3.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness",
        "2 eggs, lightly beaten",
        "1 cup all-purpose flour",
        "2 cups bread crumbs",
        "salt and pepper to taste",
        "1 teaspoon cayenne pepper",
        "1 tablespoon olive oil",
        "4 tablespoons butter, divided",
        "3 cloves garlic, minced",
        "1 (10 ounce) package frozen Brussels sprouts, thawed and diced",
        "2 tablespoons all-purpose flour",
        "3/4 cup water",
        "2 tablespoons lemon juice",
        "1 (16 ounce) can navy beans, drained",
        "1 tablespoon white sugar",
        "1/4 cup grated Parmesan cheese",
        "1 teaspoon salt",
        "ground black pepper to taste",
        "1 tablespoon chopped fresh parsley, for garnish",
        "2 tablespoons grated Parmesan cheese for topping"
    ],
    "nut": [
        "Calories > 871 kcal",
        "Carbs > 100.4 g",
        "Cholesterol > 203 mg",
        "Fat > 27.7 g",
        "Protein > 55.4 g",
        "Sodium > 1808 mg"
    ],
    "n": "Breaded Chicken Limone",
    "a": "Navy S.",
    "r": "0",
    "s": 4,
    "des": "\"At a highly-rated Italian restaurant chain I ordered the Veal Limone with Tuscan Beans and Escarole. It was amazing, but a bit pricey. So I made my own recipe with easier-to-find and affordable ingredients: chicken breasts, navy beans, and Brussels sprouts.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nSeason flour, eggs, and bread crumbs with salt and pepper. Mix cayenne pepper into the flour only. Dip each breast into flour, then into the beaten eggs, and then into the bread crumbs, coating evenly. Place onto a greased cookie sheet. Bake for 15 minutes on each side or until brown and crispy.\nWhile chicken bakes, heat oil and 2 tablespoons of the butter in a skillet over medium heat. Add garlic and Brussels sprouts and stir until garlic releases its fragrance and sprouts are heated through, about 2 minutes.\nStir in the flour. Then add the water, lemon juice, drained beans, and sugar. Stir over medium heat until sauce thickens, about 8 minutes. Add additional water if sauce is too thick. Remove from the heat and stir in remaining butter, 1/4 cup Parmesan cheese, salt and pepper.\nPlace each piece of chicken onto a serving plate. Spoon the sauce over it and garnish with chopped parsley and remaining Parmesan cheese.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "169903.jpg",
    "o": "",
    "st": "allrecipes"
}