{
    "id": 14228,
    "old_rating": "4.28736",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large russet potato, peeled and quartered",
        "1 large sweet potato, peeled and quartered",
        "1 cup corn",
        "1 teaspoon prepared Dijon-style mustard",
        "2 tablespoons fresh lime juice",
        "3 tablespoons chopped fresh cilantro",
        "1 clove garlic, minced",
        "3 tablespoons canola oil",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 cucumber, halved lengthwise and chopped",
        "1/2 red onion, thinly sliced",
        "1/4 cup finely chopped peanuts"
    ],
    "nut": [
        "Calories > 231 kcal",
        "Carbs > 27.8 g",
        "Cholesterol > 0 mg",
        "Fat > 12.6 g",
        "Protein > 4.6 g",
        "Sodium > 290 mg"
    ],
    "n": "Caribbean Sweet Potato Salad",
    "a": "jessica",
    "r": "0",
    "s": 5,
    "des": "\"This is a 90's potato salad - a new and improved, redone, much better potato salad. Not only does it have a sweet potato, in addition to a Russet potato, but it also contains corn, cucumber, and peanuts!  Corn oil will do if you don't have canola.\"",
    "ins": "Place the Russet potato pieces into a large saucepan, and cover with salted water. Bring to a boil, turn the heat down, and simmer for 10 minutes. Add the sweet potato, and cook about 15 minutes more. Remove a piece of each potato, and cut it in half to see if it is cooked enough. Once the potatoes are tender, add corn kernels; cook another 30 seconds. Drain through a colander. Fill the saucepan with cold water, and drop vegetables into water.  Cool for 5 minutes, and drain.\nIn a large bowl, whisk together mustard, lime juice, cilantro, and garlic.  Slowly whisk in oil.  Mix in salt and black pepper.\nCut cooled potatoes into 1 inch cubes, and add to dressing along with cucumber, and red onion. Toss well.  Serve at room temperature or chilled.  Toss the peanuts in just before serving.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "35395.jpg",
    "o": "2288586.jpg,2265861.jpg,1030299.jpg,215740.jpg,126694.jpg,41833.jpg",
    "st": "allrecipes"
}