{
    "id": 142594,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "For cake:",
        "1 1/4 cups self-rising flour",
        "1 teaspoon baking powder",
        "3/4 cup sugar",
        "1/4 cup water",
        "1 egg",
        "2 tablespoons golden syrup or corn syrup",
        "For mixed fruits:",
        "5 cups Granny Smith apples - cored, peeled and chopped",
        "1/2 cup sugar",
        "1/2 pint fresh or frozen blueberries",
        "1/2 pint fresh or frozen raspberries",
        "1/2 pint fresh or frozen blackberries",
        "For fruit syrup:",
        "1/2 cup blueberry nectar",
        "2 tablespoons cherry preserves",
        "2 tablespoons golden syrup or corn syrup",
        "For jam spread:",
        "1 1/2 tablespoons raspberry jam",
        "For meringue:",
        "3 egg whites",
        "1 pinch salt",
        "1 cup sugar"
    ],
    "nut": [
        "Calories > 425 kcal",
        "Carbs > 103.3 g",
        "Cholesterol > 20 mg",
        "Fat > 1 g",
        "Protein > 4.8 g",
        "Sodium > 349 mg"
    ],
    "n": "Forest Fruits Cloud Pudding",
    "a": "clionabrennan",
    "r": "0",
    "s": 8,
    "des": "\"This English-style pudding tastes like a burst of summer. It combines soft, succulent summer berries with moist sweet sponge cake and a crisp light meringue topping. Mouthwatering!!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease bottom and sides of a 9x5x3-inch loaf pan; dust lightly with flour.\nSift together the flour and baking powder. In a separate bowl, mix together 3/4 cup sugar, 1/4 cup water, the egg, and 2 tablespoons of golden syrup in a mixing bowl. Add the sifted dry ingredients. Beat with an electric mixer at medium speed until smooth, about 1 minute. Pour mixture into prepared loaf pan.\nBake for 45 minutes until a toothpick inserted into the center comes out clean. Cool for 10 minutes before removing from pan to a wire rack to cool completely.\nPlace apples and 1/2 cup sugar into a saucepan and add cold water to almost cover the apples. Bring to a boil; reduce heat and simmer uncovered until tender, 7 to 10 minutes. Drain. Stir the berries (drained, if using frozen) into the apple mixture, cover, and set aside.\nIn a small bowl, whisk together the blueberry nectar, cherry preserves, and 2 tablespoons of golden syrup. Set aside.\nCut cake into 8 slices, about 1 inch thick. Spread each slice with 1/2  teaspoon raspberry jam. Arrange slices on the bottom of an 8-inch square baking pan or casserole, jam side up. Drizzle the fruit syrup over the slices. Spoon the mixed fruit over the top. Set aside.\nReduce oven temperature to 300 degrees F (150 degrees C).\nAdd egg whites to a large glass or metal bowl and whisk until foamy. Add a pinch of salt. While continuing to whisk, gradually incorporate 1 cup of sugar, and continue to whip until stiff peaks form. Spread the meringue over the fruit to the edges of the pan.\nBake for 30 minutes until meringue is golden brown.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}