{
    "id": 142636,
    "old_rating": "3.92308",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 chicken wings, tips removed and wings cut in half at joint",
        "2 cloves cloves garlic, peeled and coarsely chopped",
        "1/2 onion, cut into chunks",
        "1/4 cup soy sauce",
        "1/4 cup Asian fish sauce",
        "2 tablespoons fresh lemon juice",
        "2 tablespoons sesame oil",
        "1 teaspoon salt",
        "1 teaspoon freshly ground black pepper",
        "1 tablespoon garlic powder",
        "1 tablespoon white sugar"
    ],
    "nut": [
        "Calories > 716 kcal",
        "Carbs > 9.1 g",
        "Cholesterol > 213 mg",
        "Fat > 50.9 g",
        "Protein > 53 g",
        "Sodium > 2781 mg"
    ],
    "n": "Vietnamese Golden Chicken Wings",
    "a": "Nelson_Huynh",
    "r": "0",
    "s": 4,
    "des": "\"This is a fantastic Vietnamese dish that's great for absolutely any occasion, from weeknight dinners, to parties and BBQs, or even a night in front of the television! The chicken wings have succulent flavour and soft tasty meat that melts away in your mouth. They're crispy on the outside, but soft inside and guaranteed to be a success. They've never failed to impress!\"",
    "ins": "Place the chicken wings, garlic, and onion into a large bowl. Pour in soy sauce, fish sauce, lemon juice, and sesame oil. Season with salt, pepper, garlic powder, and sugar; toss together until well coated. Cover and refrigerate 2 hours to overnight.\nPreheat oven to 400 degrees F (200 degrees C). Line a 9x13 inch baking dish with aluminum foil.\nRemove wings from marinade, reserving extra. Arrange wings in a single layer over bottom of prepared dish. Bake in preheated oven, turning once and brushing with reserved marinade, until deep, golden brown and meat juices run clear, approximately 30 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "4468715.jpg",
    "o": "4468712.jpg,2971795.jpg,2914950.jpg,646980.jpg,209453.jpg,97316.jpg",
    "st": "allrecipes"
}