{
    "id": 142690,
    "old_rating": "4.35897",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 eggs, lightly beaten",
        "2 cups heavy cream",
        "1 cup freshly grated Parmesan cheese",
        "1 (16 ounce) package penne pasta",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "1/2 pound sliced pancetta, chopped",
        "1/2 teaspoon ground nutmeg",
        "1/2 cup pine nuts, toasted",
        "1/2 teaspoon salt",
        "1 teaspoon black pepper",
        "3/4 cup chopped Italian flat leaf parsley",
        "1/2 cup freshly grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 838 kcal",
        "Carbs > 62 g",
        "Cholesterol > 264 mg",
        "Fat > 53.4 g",
        "Protein > 31.2 g",
        "Sodium > 871 mg"
    ],
    "n": "Classic Carbonara with Pancetta",
    "a": "KMOMMYZ",
    "r": "0",
    "s": 6,
    "des": "\"This is the classic version of carbonara I grew up eating. Serve it piping hot tossed with extra Parmesan cheese and chopped Italian parsley.\"",
    "ins": "Whisk together the eggs, cream, and 1 cup of Parmesan cheese in a bowl. Blend thoroughly, and set aside.\nBring a large pot of lightly salted water to a boil. Add the pasta, and cook until al dente, or for 8 to 10 minutes. Drain pasta, then return it to the pot (off of the heat), and cover to keep warm.\nMeanwhile, heat the olive oil over medium heat in a large skillet; add the onion and cook until transparent, about 8 minutes. Remove onion from the skillet; place in a bowl, and cover to keep warm.\nUsing the same skillet, cook the pancetta over medium heat until browned, tossing with nutmeg. Drain on paper towels.\nCombine the pasta, onion, pancetta, pine nuts, salt, and pepper in the same large skillet over low heat. Slowly stir in the egg-cream mixture, tossing gently so the eggs don't scramble. Cook until just heated through. Remove from heat and toss with parsley and remaining 1/2 cup Parmesan cheese. Serve immediately.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "185588.jpg",
    "o": "",
    "st": "allrecipes"
}