{
    "id": 142948,
    "old_rating": "4.60338",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds beef round steak, cut into thin strips",
        "1/4 cup soy sauce",
        "2 tablespoons Worcestershire sauce",
        "2 tablespoons liquid smoke",
        "2 tablespoons brown sugar",
        "2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "1 teaspoon meat tenderizer",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "1 teaspoon paprika"
    ],
    "nut": [
        "Calories > 137 kcal",
        "Carbs > 4.5 g",
        "Cholesterol > 31 mg",
        "Fat > 7.9 g",
        "Protein > 11.6 g",
        "Sodium > 934 mg"
    ],
    "n": "Doc's Best Beef Jerky",
    "a": "Doc the WV Gourmet",
    "r": "0",
    "s": 10,
    "des": "\"I have been making jerky for years. This is my recipe concocted by trial and error. Everyone who has tried it says it is the 'best jerky' they have ever had! My dehydrator is designed for jerky. It takes me about 4 hours to dry the meat. This could also be done in the oven or using other dehydrators. Please check your manual for correct times as each machine is different. I hope you enjoy this jerky as much as me and my family do.\"",
    "ins": "Place beef strips in the bottom of a large bowl.  Pour soy sauce, Worcestershire sauce, liquid smoke, brown sugar, salt, pepper, meat tenderizer, garlic powder, onion powder, and paprika over beef.  Mix to assure all the meat is evenly coated.  Cover and marinate in the refrigerator for 8 hours or overnight.\nRemove meat from bowl and place between two pieces of plastic wrap; pound to 1/8-inch thickness.\nArrange the meat strips on the tray of a dehydrator and dry at your dehydrator's highest setting until done to your liking, at least 4 hours. Store in an airtight container or resealable bags.",
    "pt": "20 m",
    "ct": "4 h",
    "tt": "12 h ",
    "i": "4468132.jpg",
    "o": "4468132.jpg,4153212.jpg,4153163.jpg,1464916.jpg,1344813.jpg,780419.jpg",
    "st": "allrecipes"
}