{
    "id": 143090,
    "old_rating": "4.77027",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons light soy sauce",
        "1/8 teaspoon white sugar",
        "2 teaspoons potato starch",
        "1 teaspoon sesame oil",
        "ground black pepper to taste",
        "1 pound pork loin, cut into 1-inch cubes",
        "1 cup water",
        "2 tablespoons white vinegar",
        "1/4 cup ketchup",
        "1/4 cup white sugar",
        "1 pinch salt",
        "2 teaspoons potato starch",
        "1 dash red food coloring",
        "1 egg, beaten",
        "1 cup potato starch",
        "2 cups peanut oil for frying",
        "1 green bell pepper, cut into large chunks",
        "2 cayenne peppers, sliced",
        "4 slices canned pineapple, chopped",
        "2 cloves garlic, sliced",
        "2 green onions, sliced"
    ],
    "nut": [
        "Calories > 588 kcal",
        "Carbs > 59.5 g",
        "Cholesterol > 118 mg",
        "Fat > 28 g",
        "Protein > 25.2 g",
        "Sodium > 402 mg"
    ],
    "n": "Hong Kong Sweet and Sour Pork",
    "a": "BETSYLINDSEY",
    "r": "0",
    "s": 4,
    "des": "\"This recipe requires three quick frying steps to seal in the crispy texture of the pork. Serve with rice or noodles for a filling meal.\"",
    "ins": "Whisk together the soy sauce, sugar, 2 teaspoons potato starch, sesame oil, and black pepper in a large bowl.  Mix the pork into the marinade and turn until all the pork is covered. Allow to rest for 15 minutes.\nTo make the sauce, whisk together the water, vinegar, ketchup, 1/4 cup sugar, salt, 2 teaspoons potato starch, and red food coloring in a separate bowl. Set aside.\nDip the pork pieces in the beaten egg, then dredge in the 1 cup potato starch.  Use your hand to press the starch onto the pork, assuring a consistent coating.\nHeat the peanut oil in a wok over medium-high heat to a temperature of 375 degrees F (190 degrees C).\nFry the pork pieces in the hot oil until crisp and light brown, 4 to 5 minutes. Remove the pork from the oil and drain, keeping the oil hot.  Return the drained pork pieces to the hot oil for 30 seconds more.  Remove and drain again. Pour off all but 1 tablespoon of oil from the wok.\nHeat 1 tablespoon of reserved oil in the wok over medium heat. Cook the green bell pepper, cayenne pepper, pineapple, garlic, and green onion in the heated oil for about 5 minutes.  Add the sauce and stir until it thickens.  Stir in the pork and toss until the pork is coated with sauce.  Remove from heat and serve.",
    "pt": "40 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "3275231.jpg",
    "o": "",
    "st": "allrecipes"
}