{
    "id": 143161,
    "old_rating": "4.3625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 ounces rotini pasta",
        "1 pound ground beef",
        "1/2 pound bulk mild Italian sausage",
        "3/4 cup chopped onion",
        "1/4 cup chopped celery",
        "1 clove garlic, minced",
        "1 tablespoon minced green bell pepper",
        "salt and pepper to taste",
        "1 (14.4 ounce) can diced tomatoes",
        "1 (15 ounce) can tomato sauce",
        "2 cups shredded Italian cheese blend",
        "1 1/2 cups shredded sharp Cheddar cheese"
    ],
    "nut": [
        "Calories > 648 kcal",
        "Carbs > 39.7 g",
        "Cholesterol > 120 mg",
        "Fat > 36.6 g",
        "Protein > 40.2 g",
        "Sodium > 1332 mg"
    ],
    "n": "Johnny Marzetti Casserole",
    "a": "KC",
    "r": "0",
    "s": 6,
    "des": "\"Kids love this buffet-ready casserole dish. My mother-in-law used to make a simpler version of this for my husband when he was growing up. This version pushes the flavor profile a bit. I prefer to have this dish sit overnight before baking as the flavors improve and the pasta absorbs some of the sauce so the consistency is just right.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add pasta and cook until just al dente, 6 to 8 minutes; drain. Run cold water over the pasta to stop pasta from cooking further. Set aside.\nMeanwhile, cook the ground beef and sausage until completely browned and crumbled, 7 to 10 minutes. Mix in the onion, celery, garlic, and pepper; continue to cook and stir another 5 minutes. Season with salt and pepper. Remove from heat and stir in tomatoes and tomato sauce. Allow to cool five minutes.\nLightly grease a large casserole dish. Spread the pasta over the bottom of the dish. Sprinkle the Italian cheese blend over the pasta. Pour the meat mixture over the pasta and cheese. Cover dish with heavy aluminum foil. Bake in preheated oven for 45 minutes; remove foil and sprinkle Cheddar cheese evenly over the casserole. Continue baking until Cheddar cheese has melted, about 5 minutes. Rest for 10 minutes before serving.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "199533.jpg",
    "o": "4509845.jpg,4161674.jpg,3219302.jpg,3193526.jpg,2595424.jpg,2162354.jpg",
    "st": "allrecipes"
}