{
    "id": 143146,
    "old_rating": "4.68293",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (4 ounce) links hot Italian sausage",
        "1 red bell pepper, halved and seeded",
        "1 small onion, peeled and cut in half crosswise",
        "2 teaspoons olive oil",
        "salt and pepper to taste",
        "1 tablespoon olive oil",
        "4 (6 inch) sandwich rolls, split and toasted"
    ],
    "nut": [
        "Calories > 631 kcal",
        "Carbs > 56.2 g",
        "Cholesterol > 61 mg",
        "Fat > 33.7 g",
        "Protein > 27 g",
        "Sodium > 1219 mg"
    ],
    "n": "Festival-Style Grilled Italian Sausage Sandwiches",
    "a": "carina",
    "r": "0",
    "s": 4,
    "des": "\"These delicious grilled sausage sandwiches are my attempt to duplicate the ones I ate when I was growing up and attended Italian street festivals in the North End of Boston. They come together really quickly, and make a great summer lunch. Choose hot or mild sausages as you prefer.\"",
    "ins": "Preheat an outdoor grill for medium heat. Lightly oil grate, and set 4 inches from the heat.\nPierce the sausages in a few places with a fork, and set aside. Slice off the bottoms of the onion halves so they will sit flat on the grill. Brush the bell pepper and onion halves with 2 teaspoons of olive oil.\nPlace the sausages, onions, and peppers on the preheated grill. Cook and turn the sausages until well browned and juices run clear. Cook vegetables until tender and peppers are slightly charred. Remove vegetables and sausages from the grill.\nPlace the peppers in a paper bag, close, and cool slightly. Remove and discard the charred skin from the peppers; slice peppers into strips. Slice the onion halves. Place salt and pepper to taste, and 1 tablespoon olive oil in a bowl. Add the peppers and onions, and toss until evenly coated. To serve, place sausages in sandwich rolls, and top with the pepper and onion mixture.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "963779.jpg",
    "o": "2475131.jpg,1263548.jpg,963778.jpg,877537.jpg,877370.jpg,698802.jpg",
    "st": "allrecipes"
}