{
    "id": 143336,
    "old_rating": "4.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup graham cracker crumbs",
        "3 tablespoons butter, melted",
        "3 tablespoons white sugar",
        "3 eggs, separated",
        "1 (8 ounce) package cream cheese, softened",
        "1 cup white sugar",
        "1/8 teaspoon salt",
        "1 cup heavy cream",
        "1 (10 ounce) package frozen raspberries, partially thawed"
    ],
    "nut": [
        "Calories > 450 kcal",
        "Carbs > 46.7 g",
        "Cholesterol > 153 mg",
        "Fat > 27.8 g",
        "Protein > 5.9 g",
        "Sodium > 235 mg"
    ],
    "n": "Frozen Raspberry Swirl Cheesecake Squares",
    "a": "LMLSCA",
    "r": "0",
    "s": 8,
    "des": "\"This frozen raspberry-cream cheese dessert is spectacular and can be made ahead since it is served frozen.\"",
    "ins": "Preheat oven to 375  degrees F (190 degrees C). Thoroughly grease a 7x11x2 inch baking pan, and set aside.\nStir together the graham cracker crumbs, melted butter, and sugar in a bowl until well blended. Press the mixture into the bottom of the prepared pan.\nBake the graham cracker crust in preheated oven until golden, about 8 minutes.\nIn a separate bowl, beat the egg yolks on high speed until thick and lemon colored. Add the softened cream cheese, sugar, and salt. Beginning on low speed and increasing to high, beat until smooth.\nPlace the egg whites in a large bowl, and beat until stiff peaks form. Gently fold the egg whites into the cream cheese mixture.\nPlace the heavy cream in a bowl, and beat until stiff. Gently fold the whipped cream into the cream cheese mixture.\nPlace the raspberries in a blender. Cover, and blend on low speed until berries soften. Swirl half the berries into the cream cheese mixture. Spread the cream cheese mixture evenly over the crust.\nSpoon the remaining raspberries on top of the cream cheese mixture. Use a knife to swirl the berries into the cream cheese, making a red and white swirl pattern.\nCover the pan tightly with foil or freezer wrap. Place in freezer for at least 3 hours. When ready to serve, let stand 30 minutes before cutting into squares.",
    "pt": "25 m",
    "ct": "",
    "tt": "",
    "i": "39463.jpg",
    "o": "",
    "st": "allrecipes"
}