{
    "id": 143362,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil",
        "3 onions, sliced",
        "1 (28 ounce) can whole peeled tomatoes",
        "1 (15 ounce) can tomato sauce",
        "1 1/2 teaspoons salt",
        "1/4 teaspoon ground black pepper",
        "2 pounds green cabbage, cored, and cut into 3 inch chunks",
        "2 pounds lean ground beef",
        "2 eggs",
        "1 onion, finely chopped",
        "2 tablespoons instant white rice",
        "3 tablespoons water",
        "1 1/2 teaspoons salt",
        "1/4 teaspoon ground black pepper",
        "3 tablespoons fresh lemon juice",
        "1/3 cup golden raisins",
        "1 tablespoon honey",
        "1/2 cup packed brown sugar, or to taste"
    ],
    "nut": [
        "Calories > 347 kcal",
        "Carbs > 34.7 g",
        "Cholesterol > 92 mg",
        "Fat > 15.2 g",
        "Protein > 20.4 g",
        "Sodium > 1117 mg"
    ],
    "n": "Grandma Elaine's Unstuffed Sweet and Sour Cabbage",
    "a": "Chef Daddy Pete",
    "r": "0",
    "s": 10,
    "des": "\"This is a family heirloom recipe that has been handed down through the ages. My mother taught it to me, and I tweaked it to its current form. I have eaten all kinds of 'stuffed' cabbage and this recipe beats them all. It's sweet, sour, and comforting. The flavors are even better the second day. This dish also freezes well.\"",
    "ins": "Place the vegetable oil into a large pot over medium heat. Stir in the sliced onions, and cook until transparent, about 5 minutes. Add the tomatoes and tomato sauce, using a spoon to slightly chop the whole tomatoes. Season with 1 1/2 teaspoons salt and 1/4 teaspoon pepper. Cover, and simmer for 20 minutes, stirring occasionally. Stir the cabbage into the tomatoes. Cover, and simmer 1 hour until the cabbage is tender and mixes easily with the tomatoes.\nPlace the ground beef, eggs, finely chopped onion, rice, water, additional 1 1/2 teaspoons salt, and 1/4 teaspoon pepper in a mixing bowl. Mix together with hands until thoroughly blended. Add additional rice if mixture is too moist. Form into golf ball-sized meatballs. Place meatballs on a plate, and refrigerate 20 minutes to firm.\nPlace meatballs on the surface of the tomato mixture. Cover and simmer over medium heat until the meatballs are firm and cooked through, about 15 minutes. Gently stir the meatballs into the tomato mixture. Cover the pot and continue to simmer 45 minutes more. Stir in the lemon juice, and taste for seasoning, adding additional lemon juice if required. Stir in the raisins, and honey. Add the brown sugar, a little at a time, tasting after each addition. Cook mixture over medium heat 15 minutes more.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "3 h ",
    "i": "390101.jpg",
    "o": "",
    "st": "allrecipes"
}