{
    "id": 143360,
    "old_rating": "4.09091",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup ripe strawberries - cleaned, hulled and diced",
        "1 teaspoon vanilla extract",
        "1/2 cup light cream",
        "2 cups all-purpose flour",
        "1/3 cup white sugar",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground nutmeg",
        "1 1/2 teaspoons lemon zest",
        "6 tablespoons cold unsalted butter"
    ],
    "nut": [
        "Calories > 255 kcal",
        "Carbs > 34.6 g",
        "Cholesterol > 32 mg",
        "Fat > 11.5 g",
        "Protein > 3.6 g",
        "Sodium > 393 mg"
    ],
    "n": "Fresh Strawberry Scones",
    "a": "Annie Y.",
    "r": "0",
    "s": 8,
    "des": "\"This delicious, irresistible recipe makes a perfect snack and breakfast treat!\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper.\nPlace diced strawberries on paper towels to absorb liquid. Combine the cream with the vanilla extract in a small pitcher, and set aside.\nWhisk the flour, sugar, baking powder, salt, nutmeg, and lemon zest together in a mixing bowl. Cut the cold butter into chunks and add to the flour mixture. Use a pastry blender to cut in butter until mixture resembles coarse, pea-sized crumbs. Stir in strawberries, and gently toss ingredients. Make a hole in the middle of the flour mixture; pour cream mixture into the hole. Quickly stir dough together until just blended. Allow dough to rest 2 minutes.\nTurn dough out onto a lightly floured work surface; and knead until smooth and satiny, 4 to 5 minutes. Transfer dough to prepared baking sheet and pat into an 8-inch round. Use a serrated knife to cut the round into 8 wedge-shaped pieces. Separate wedges on the baking sheet, leaving at least 1/2 inch space between each.\nBake in preheated oven until tops are light brown and crusty, 16 to 18 minutes. Transfer to a wire rack, and cool 20 minutes before serving.",
    "pt": "20 m",
    "ct": "16 m",
    "tt": "56 m",
    "i": "3643872.jpg",
    "o": "4538051.jpg,4497555.jpg,4480468.jpg,3692018.jpg,2438666.jpg,2273787.jpg",
    "st": "allrecipes"
}