{
    "id": 143462,
    "old_rating": "3.53125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 pound medium shrimp - peeled and deveined",
        "2 tablespoons olive oil",
        "salt and ground black pepper to taste",
        "1/4 cup shredded napa cabbage",
        "2 tablespoons shredded carrot",
        "3 cloves garlic, minced",
        "1 tablespoon grated fresh ginger",
        "2 tablespoons teriyaki sauce",
        "2 tablespoons fresh lime juice",
        "4 (8 inch) round sheets rice paper",
        "1/2 cup chunky peanut butter",
        "2 tablespoons teriyaki sauce",
        "2 tablespoons sesame oil",
        "2 tablespoons hot sauce",
        "3 cloves garlic, minced",
        "salt and ground black pepper to taste",
        "1 tablespoon grated fresh ginger"
    ],
    "nut": [
        "Calories > 388 kcal",
        "Carbs > 17.2 g",
        "Cholesterol > 43 mg",
        "Fat > 30.3 g",
        "Protein > 15.5 g",
        "Sodium > 1156 mg"
    ],
    "n": "Shrimp Summer Rolls with Asian Peanut Sauce",
    "a": "Austin Geraldson",
    "r": "0",
    "s": 4,
    "des": "\"These shrimp summer rolls are great, and taste even better if you want to oven-bake or fry them as well. It only takes about 20 minutes to make, so it is much quicker than take out. These come highly recommended, you may want to make a double batch.\"",
    "ins": "Preheat an outdoor grill or grill pan for medium-high heat.\nPlace the shrimp in a bowl and toss with olive oil and salt and black pepper.\nGrill the shrimp on the preheated grill until opaque, 2 minutes per side. Remove from the grill and set aside.\nCombine the cabbage, carrot, garlic, 1 tablespoon ginger, teriyaki sauce, and lime juice in a bowl, stir well.\nWorking with one at a time, wet rice paper with water and lay out on a clean surface. Place a quarter of the cabbage mixture in the center of the paper, top with a quarter of the shrimp. Shape the filling into a log shape and roll the rice paper around the filling, tucking the ends in as you go. Repeat with the remaining rice papers.\nWhisk together the peanut butter, teriyaki sauce, sesame oil, hot sauce, garlic, 1 tablespoon ginger, salt and pepper. Slice the rolls in half on an angle, and serve with the peanut sauce on the side.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "25 m",
    "i": "662710.jpg",
    "o": "",
    "st": "allrecipes"
}