{
    "id": 143611,
    "old_rating": "4.35135",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons corn oil",
        "1 pound flank steak",
        "1 large Spanish onion, thinly sliced",
        "4 large cloves garlic, chopped",
        "5 Roma tomatoes, chopped",
        "1/2 teaspoon salt",
        "2 teaspoons black pepper, or to taste",
        "1 1/2 teaspoons ground cumin",
        "2 1/2 cups water",
        "2 cubes beef bouillon, crumbled"
    ],
    "nut": [
        "Calories > 236 kcal",
        "Carbs > 9.2 g",
        "Cholesterol > 36 mg",
        "Fat > 15.6 g",
        "Protein > 15.4 g",
        "Sodium > 770 mg"
    ],
    "n": "Colombian Stewed Flank",
    "a": "wifeyluvs2cook",
    "r": "0",
    "s": 4,
    "des": "\"This wonderful dish has so much flavor. It reminds me of the great flavors of Colombian cooking. Slow-cooked, simmered steak makes this dish so tender and juicy! If you desire some heat, like I do, add a jalapeno pepper. You can also substitute beer for half the water for another variation on the flavor. Serve over rice or with tortillas.\"",
    "ins": "Heat the corn oil in a skillet over medium heat. Gently lie the steak in the oil and cook each side until brown. Remove the steak to a plate. Add the onions, garlic, tomatoes, salt, pepper, and cumin to the skillet; cook and stir until the onions are tender. Return the steak to the skillet. Pour the water into the skillet. Stir in the crumbled bouillon. Bring the water to a boil and drop the heat to low; cover. Allow to simmer until the meat easily pulls apart with a fork, about 2 hours.\nRemove the steak to a cutting board. Use two forks to shred the meat. Transfer to a serving plate.  Pour the onion and tomato mixture from the skillet over the shredded beef.",
    "pt": "25 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "2116882.jpg",
    "o": "2556374.jpg,1829819.jpg,1829767.jpg,127791.jpg,127788.jpg,119254.jpg",
    "st": "allrecipes"
}