{
    "id": 143652,
    "old_rating": "4.43243",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/4 cups water",
        "1 cup milk",
        "1 tablespoon butter",
        "1 cup quick-cooking polenta",
        "1 cup grated Parmesan cheese",
        "2 fresh basil leaves, chopped",
        "salt and ground black pepper to taste",
        "1 tablespoon butter, chilled and cut into pieces",
        "2 tomatoes, sliced",
        "1/2 cup grated Parmesan cheese",
        "2 fresh basil leaves, chopped"
    ],
    "nut": [
        "Calories > 428 kcal",
        "Carbs > 37.5 g",
        "Cholesterol > 56 mg",
        "Fat > 21.1 g",
        "Protein > 22.4 g",
        "Sodium > 1110 mg"
    ],
    "n": "Baked Polenta with Fresh Tomatoes and Parmesan",
    "a": "rjohl",
    "r": "0",
    "s": 4,
    "des": "\"This recipe is a perfect way to highlight and use fresh summer tomatoes.  It makes a great side dish for grilled chicken or pork chops.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C). Grease an 8x8 inch baking dish.\nPlace the water, milk, and butter in a saucepan and bring to a boil over medium-high heat. Add the polenta and stir with a wooden spoon until thickened, about 5 minutes. Remove from heat and stir in 1 cup Parmesan cheese and 2 chopped basil leaves; season with salt and pepper to taste. Transfer the polenta to the prepared baking dish and arrange the remaining chilled pieces of butter over the top.\nBake the polenta in the preheated oven until bubbly and beginning to brown, 15 to 20 minutes. Remove from the oven.\nDecoratively arrange the slices of tomato over the top of the polenta, spread the remaining basil leaves over the tomatoes, and sprinkle with 1/2 cup Parmesan cheese.\nReturn to the oven and bake until the tomatoes are warm and the Parmesan cheese is bubbly, 5 to 10 minutes.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "1103015.jpg",
    "o": "3907724.jpg,3907708.jpg,3724925.jpg,3286784.jpg,1116970.jpg,1098301.jpg",
    "st": "allrecipes"
}