{
    "id": 144020,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound boneless, skinless chicken breasts, trimmed, cut into 2-inch pieces",
        "1/4 teaspoon kosher salt",
        "1/4 teaspoon freshly ground pepper",
        "1 tablespoon canola oil",
        "2 large green bell peppers, thinly sliced",
        "1 large onion, halved and thinly sliced",
        "2 teaspoons hot or sweet paprika",
        "1/2 cup dry white wine",
        "1 1/2 cups canned crushed tomatoes",
        "1/2 cup reduced-sodium chicken broth",
        "1 tablespoon lemon juice",
        "1/4 cup reduced-fat sour cream",
        "2 tablespoons chopped fresh parsley"
    ],
    "nut": [
        "Calories > 260 kcal",
        "Carbs > 16.7 g",
        "Cholesterol > 65 mg",
        "Fat > 8.3 g",
        "Protein > 25.8 g",
        "Sodium > 316 mg"
    ],
    "n": "Sofia's Chicken Paprikash",
    "a": "Breana Lai",
    "r": "0",
    "s": 4,
    "des": "\"Brilliant red paprika, the main seasoning in Hungarian cooking, gives this light version of chicken paprikash its color. Vary the heat by using hot, sweet or a combination of paprikas.\"",
    "ins": "Sprinkle chicken with salt and pepper. Heat oil in a large skillet over medium-high heat. Add chicken and cook, turning occasionally, until browned, 3 to 5 minutes. Transfer to a plate.\nAdd bell peppers and onion to the pan and cook, covered, over medium heat, stirring occasionally, until softened, about 5 minutes. Add paprika and cook, stirring, until fragrant, about 30 seconds. Add wine; increase heat to medium-high and cook, stirring, until mostly evaporated, about 1 1/2 minutes. Add tomatoes, broth and lemon juice; bring to a boil. Return the chicken and any accumulated juices to the pan; reduce heat to a lively simmer. Spoon some sauce over the chicken and cook, turning occasionally, until the sauce is reduced and the chicken is cooked through, 6 to 8 minutes.\nRemove from the heat and stir in sour cream. Serve sprinkled with parsley.",
    "pt": "40 m",
    "ct": "",
    "tt": "",
    "i": "1322579.jpg",
    "o": "",
    "st": "allrecipes"
}