{
    "id": 144499,
    "old_rating": "4.55",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (1 1/2 pound) pork tenderloins",
        "1 tablespoon garlic salt",
        "1/2 teaspoon fresh-ground black pepper",
        "2 tablespoons olive oil",
        "3 cloves garlic, chopped",
        "3 shallots, peeled and sliced",
        "1 red bell pepper, seeded and thinly sliced",
        "1/2 cup chicken stock",
        "1/2 cup brandy",
        "3 sprigs fresh thyme",
        "1 small fresh rosemary sprig",
        "1 1/2 cups hot pepper jelly",
        "2 tablespoons olive oil",
        "1 1/4 cups crumbled Gorgonzola cheese"
    ],
    "nut": [
        "Calories > 518 kcal",
        "Carbs > 43.8 g",
        "Cholesterol > 102 mg",
        "Fat > 18.4 g",
        "Protein > 32.7 g",
        "Sodium > 1076 mg"
    ],
    "n": "Pork Tenderloin with Pepper Jelly and Gorgonzola",
    "a": "Rosemary Smith",
    "r": "0",
    "s": 8,
    "des": "\"This is a recipe I acquired years ago and modified to suit my family's taste. It is simpler to make than it sounds; great for company. An absolute favorite of our family!\"",
    "ins": "Sprinkle pork tenderloins with garlic salt and pepper. Allow to stand at room temperature for 30 minutes.\nPreheat oven to 425 degrees F (220 degrees C).\nHeat 2 tablespoons of olive oil in a saucepan over medium heat. Stir in garlic, shallots, and red pepper; cook and stir until the onions have softened and turned translucent, about 10 minutes. Add chicken stock, brandy, thyme, and rosemary. Increase heat to medium-high, and simmer until the sauce has reduced by 1/3, about 5 minutes. Remove the thyme and rosemary sprigs, and stir in the hot pepper jelly until melted; set aside.\nMeanwhile, heat remaining 2 tablespoons of olive oil in a skillet over high heat until it just begins to smoke. Add pork, and cook until golden brown on all sides, about 5 minutes. Remove pork and place into a roasting pan.\nRoast pork in preheated oven until a thermometer inserted into the center registers 145 degrees F (63 degrees C), about 10 minutes. Once done, place pork onto a plate and cover with foil; allow to rest for 5 minutes.\nTo serve, remove peppers and onions from the sauce, and spread out onto a serving platter. Slice pork diagonally into 1-inch slices and arrange over the peppers. Pour 1/2 cup of the brandy sauce over the pork, and sprinkle with 3/4 cup of Gorgonzola cheese. Serve remaining sauce and cheese in separate serving dishes on the side.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "536593.jpg",
    "o": "",
    "st": "allrecipes"
}