{
    "id": 145067,
    "old_rating": "4.44262",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 eggs, beaten",
        "1 cup honey",
        "1 cup packed brown sugar",
        "1/2 cup canola oil",
        "1 teaspoon vanilla extract",
        "2 cups whole wheat flour",
        "4 cups all-purpose flour",
        "2 tablespoons ground cinnamon",
        "2 teaspoons baking powder",
        "2 teaspoons baking soda",
        "2 teaspoons salt",
        "4 cups grated zucchini",
        "1 cup chopped walnuts (optional)"
    ],
    "nut": [
        "Calories > 190 kcal",
        "Carbs > 30.6 g",
        "Cholesterol > 31 mg",
        "Fat > 6.4 g",
        "Protein > 4.1 g",
        "Sodium > 242 mg"
    ],
    "n": "Whole Wheat Zucchini Bread",
    "a": "Sallie Hagen",
    "r": "0",
    "s": 36,
    "des": "\"I took an old favorite and juiced it up by cutting the white sugar completely, replacing with honey and brown sugar to reduce the total sweetener by half.  I also cut the oil back to 25 percent and introduced one-third whole wheat flour.  The results are in; it's even better than the original! I like to use the huge zucchini that didn't get picked on time, as long as it's still green and healthy.  This is a large batch recipe, but you can easily cut it in half.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Grease three 8x4 inch loaf pans and set aside.\nIn a large bowl, whisk together the eggs, honey, brown sugar, oil and vanilla. Combine the whole wheat flour, all-purpose flour, cinnamon, baking powder, baking soda and salt; stir into the wet ingredients until moistened. Gently stir in the zucchini and walnuts until evenly distributed. Divide batter evenly between the prepared pans.\nBake for 50 to 60 minutes in the preheated oven, or until a knife inserted into the crown comes out clean. Cool in the pan until cool enough to touch, then turn out onto a wire rack to cool completely. Wrap in plastic wrap or store in a plastic bag when cool.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "3933255.jpg",
    "o": "",
    "st": "allrecipes"
}