{
    "id": 145272,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "9 ounces zapallo squash",
        "4 1/4 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1 teaspoon salt",
        "10 tablespoons butter, melted",
        "2 cups canola oil for pan-frying"
    ],
    "nut": [
        "Calories > 286 kcal",
        "Carbs > 35.6 g",
        "Cholesterol > 25 mg",
        "Fat > 13.8 g",
        "Protein > 4.9 g",
        "Sodium > 369 mg"
    ],
    "n": "Chilean-Style Sopaipillas",
    "a": "Makka",
    "r": "0",
    "s": 12,
    "des": "\"This is a traditional Chilean snack, or maybe an appetizer. The truth is that it's a snack eaten during winter time, especially when it rains. It is typical to arrive home after walking through the rainy streets of Santiago and sit down to have a cup of tea and eat a couple of sopaipillas. You can also eat ones sold by street vendors, but they usually don't taste as good as home-made ones. If you can't find zapallo, pumpkin is a good substitute.\"",
    "ins": "Peel, seed, and cut the zapallo into chunks. Place in a saucepan, cover with water, and bring to a boil over medium-high heat. Cook until zapallo is soft and easily pierced with a fork, 15 to 20 minutes. Drain and allow to cool slightly.\nMix the flour, baking soda, and salt together in a mixing bowl, and set aside. Stir  together the squash and melted butter. Stir the flour mixture into the butter mixture until blended. Turn the dough out onto a lightly floured surface and knead until soft and satiny, adding a little more flour if necessary. Cover dough with a towel and allow to rest 15 minutes.\nRoll out the dough to 1/8 inch thick, and cut into 3 inch diameter circles. Poke each circle a few times with a fork to make holes and prevent rising.\nPour vegetable oil into a large, deep skillet and heat over medium-high heat until hot, 385 degrees F (195 degrees C). Place several of the dough circles into hot oil; cook until lightly browned,  3 to 4 minutes. Drain on paper towels. Cook remainder of dough circles in batches.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "1 h",
    "i": "1045991.jpg",
    "o": "",
    "st": "allrecipes"
}