{
    "id": 14539,
    "old_rating": "4.63112",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon ground cumin",
        "1 tablespoon chili powder",
        "1 tablespoon paprika",
        "salt and pepper to taste",
        "3 pounds baby back pork ribs",
        "1 cup barbeque sauce"
    ],
    "nut": [
        "Calories > 441 kcal",
        "Carbs > 16.9 g",
        "Cholesterol > 117 mg",
        "Fat > 30 g",
        "Protein > 24.6 g",
        "Sodium > 582 mg"
    ],
    "n": "Prize Winning Baby Back Ribs",
    "a": "BONNIE Q.",
    "r": "0",
    "s": 6,
    "des": "\"A foolproof, simple recipe for the most tender, delectable ribs you've ever had. Follow the directions exactly, and success is guaranteed!\"",
    "ins": "Preheat a gas grill for high heat, or arrange charcoal briquettes on one side of the barbeque. Lightly oil the grate.\nIn a small jar, combine cumin, chili powder, paprika, salt, and pepper. Close the lid, and shake to mix.\nTrim the membrane sheath from the back of each rack. Run a small, sharp knife between the membrane and each rib, and snip off the membrane as much as possible. Sprinkle as much of the rub onto both sides of the ribs as desired. To prevent the ribs from becoming too dark and spicy, do not thoroughly rub the spices into the ribs. Store the unused portion of the spice mix for future use.\nPlace aluminum foil on lower rack to capture drippings and prevent flare-ups. Lay the ribs on the top rack of the grill (away from the coals, if you're using briquettes). Reduce gas heat to low, close lid, and leave undisturbed for 1 hour. Do not lift the lid at all.\nBrush ribs with barbecue sauce, and grill an additional 5 minutes. Serve ribs as whole rack, or cut between each rib bone and pile individually on a platter.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4537377.jpg",
    "o": "4537377.jpg,4531987.jpg,4528187.jpg,4520973.jpg,3871149.jpg,3768208.jpg",
    "st": "allrecipes"
}