{
    "id": 145444,
    "old_rating": "4.69355",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 teaspoon olive oil",
        "1/2 cup diced onion",
        "2 pounds ground lamb",
        "1 egg",
        "1 cup bread crumbs",
        "1 clove garlic, minced",
        "4 1/2 teaspoons salt",
        "1 tablespoon ground black pepper",
        "4 ounces soft goat cheese",
        "1 tablespoon extra-virgin olive oil",
        "1 tablespoon chopped fresh basil leaves",
        "1 tablespoon chopped fresh oregano"
    ],
    "nut": [
        "Calories > 484 kcal",
        "Carbs > 15.8 g",
        "Cholesterol > 147 mg",
        "Fat > 31 g",
        "Protein > 33.7 g",
        "Sodium > 2071 mg"
    ],
    "n": "Goat Cheese Stuffed Lamb Burgers",
    "a": "LeeleeCooks",
    "r": "0",
    "s": 6,
    "des": "\"I love making these flavorful lamb burgers stuffed with creamy, delicious goat cheese. I use basil and oregano in mine, but feel free to use your favorite herbs and spices, this recipe is very forgiving. Using fresh rosemary in the goat cheese filling will give the burgers a real Greek flavor. Serve the burgers on hamburger buns or pita bread with tzatziki sauce, or on their own with a Greek salad.\"",
    "ins": "Heat 1 teaspoon of olive oil in a small skillet over medium heat. Cook and stir the onions in the oil until soft and translucent, about 5 minutes.\nGently knead together the softened onions, lamb, egg, bread crumbs, garlic, salt, and pepper. Divide the mixture into 6 parts and roll into balls, then cover and refrigerate until ready to use.\nMix together the goat cheese, extra-virgin olive oil, basil, and oregano until well combined; cover and chill for 5 minutes.\nPreheat an outdoor grill for medium-high heat.\nWorking with one portion of meat at a time, make an indentation in the center of the ball with your thumb. Fill the indentation with a heaping tablespoon of the goat cheese mixture. Gently pull and form the meat patty around the cheese filling, making a burger-shaped patty. Repeat with each ball of the lamb mixture.\nGrill the patties on the preheated grill until no longer pink in the center and well done, about 8 minutes per side.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "40 m",
    "i": "571380.jpg",
    "o": "",
    "st": "allrecipes"
}