{
    "id": 145520,
    "old_rating": "4.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups all-purpose flour",
        "2 teaspoons ground cardamom",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1 cup white sugar",
        "1/8 teaspoon salt",
        "2 teaspoons grated orange zest",
        "1/3 cup butter, softened",
        "2/3 cup half-and-half",
        "2 eggs"
    ],
    "nut": [
        "Calories > 79 kcal",
        "Carbs > 11.9 g",
        "Cholesterol > 20 mg",
        "Fat > 3.1 g",
        "Protein > 1.3 g",
        "Sodium > 31 mg"
    ],
    "n": "Orange Cardamom Krumkake",
    "a": "Caiti Ann",
    "r": "0",
    "s": 30,
    "des": "\"I decided to try a new recipe with a little more flavor than the traditional one I've been using. This one was definitely a hit. The krumkake turned out nicely crisp with a surprising orange spice flavor. My krumkake iron is electric and took a little over a minute to cook each one, but traditional irons will vary according to how hot it is.\"",
    "ins": "Grease the krumkake iron with oil or vegetable spray. Heat iron over medium low heat. You should only need to grease the iron once. If using an electric krumkake iron, follow manufacturer's directions for preheating.\nSift the flour, cardamom, ginger, cinnamon, and nutmeg into a large bowl. Stir the sugar, salt, and orange zest into the flour mixture until evenly blended.\nPlace the butter and half-and-half into a microwavable bowl. Cover and cook in  microwave until warm, about 25 seconds. Cool slightly. Whisk the eggs, one at a time, into to the half-and-half mixture. Stir the cream mixture into the flour mixture until well blended.\nUsing preheated krumkake iron, place 1 tablespoon of batter onto each krumkake mold, using a second spoon to scrape off the batter. Close the krumkake iron, and cook until the iron stops steaming and the cookies are golden brown, 30 to 60 seconds. Carefully peel the krumkake cookie from the iron and while still hot, and wrap around a wooden krumkake cone to make the traditional cone shape. Hold in place until set, about 10 seconds, remove and cool completely on waxed paper. Repeat with remaining batter.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "315909.jpg",
    "o": "",
    "st": "allrecipes"
}