{
    "id": 145816,
    "old_rating": "4.14286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups boiling water",
        "2 cups crushed shredded wheat cereal",
        "1 teaspoon salt",
        "1/4 cup molasses",
        "3 tablespoons butter",
        "2 tablespoons active dry yeast",
        "1/2 cup warm water",
        "1 cup whole wheat flour",
        "1 cup rye flour",
        "1/2 cup flax seed",
        "3 cups all-purpose flour, or as needed"
    ],
    "nut": [
        "Calories > 149 kcal",
        "Carbs > 27 g",
        "Cholesterol > 4 mg",
        "Fat > 3.2 g",
        "Protein > 4.2 g",
        "Sodium > 112 mg"
    ],
    "n": "Light and Grainy Wheat, Rye, and Flax Seed Bread",
    "a": "Abrux",
    "r": "0",
    "s": 24,
    "des": "\"Good for getting into whole wheat and grains, this bread is very light, rather chewy and moist, excellent for sandwiches, and easy to slice.\"",
    "ins": "Pour boiling water over shredded wheat cereal in a large mixing bowl. Stir in the salt, molasses, and butter; let cool to about 100 degrees F (40 degrees C), about 15 minutes. Grease two 9x5 inch loaf pans.\nSprinkle the yeast over the 1/2 cup of warm water in a small bowl. The water should be no more than 100 degrees F (40 degrees C). Let stand for 5 minutes until the yeast softens and begins to form a creamy foam.\nStir the yeast mixture into the cooled cereal mixture. Beat in the whole wheat flour, rye flour, and flax seed. Beat in the all-purpose flour. Turn the dough out onto a lightly floured surface and knead until smooth and elastic but not stiff, about 10 minutes.\nLightly oil a large bowl, then place the dough in the bowl and turn to coat with oil. Cover with a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) until doubled in volume, about 1 hour.\nDeflate the dough and turn it out onto a lightly floured surface. Use a knife to divide the dough into two equal pieces. Form the dough into 2 loaves, and place the loaves into the prepared pans. Cover with a damp cloth and let rise until doubled in volume, about 30 minutes.\nMeanwhile, preheat oven to 325 degrees F (165 degrees C).\nBake in the preheated oven until the top is golden brown and the bottom of the loaf sounds hollow when tapped, about 50 minutes.",
    "pt": "40 m",
    "ct": "50 m",
    "tt": "2 h ",
    "i": "437389.jpg",
    "o": "",
    "st": "allrecipes"
}