{
    "id": 14597,
    "old_rating": "4.50442",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "1 pound ground pork",
        "1 onion, chopped",
        "1 teaspoon salt",
        "black pepper to taste",
        "1 teaspoon chopped fresh parsley",
        "1/2 cup cooked brown rice",
        "1 1/4 teaspoons garlic salt",
        "2 (10.75 ounce) cans condensed tomato soup",
        "27 ounces sauerkraut, drained",
        "1 (29 ounce) can diced tomatoes",
        "1 medium head cabbage",
        "5 slices bacon",
        "2 tablespoons white sugar",
        "3 cups water"
    ],
    "nut": [
        "Calories > 556 kcal",
        "Carbs > 31.6 g",
        "Cholesterol > 101 mg",
        "Fat > 36.5 g",
        "Protein > 25.9 g",
        "Sodium > 2096 mg"
    ],
    "n": "Slovak Stuffed Cabbage",
    "a": "Kelly Berenger",
    "r": "0",
    "s": 8,
    "des": "\"I received this recipe from my grandmother. It was passed down to her from her grandmother.  This can be made ahead of time and frozen for a few days prior to cooking. Enjoy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Bring a pot of water to a boil.\nMix beef and pork together.  Stir in onion, cooked rice, parsley, salt, pepper, garlic salt and 1/2 can of tomato soup. Mix well.\nCore head of cabbage, place in boiling water and boil until partly cooked. Separate leaves and trim stems. Reserve about 24 to 32 whole leaves. Cut remaining leaves and line the bottom of  large roasting pan.\nLightly pack a small handful of the meat mixture and place in the center of a cabbage leaf. Fold top part of leaf over mixture, then fold in the sides and roll until mixture is completely encased.  Lay rolls on top of torn cabbage leaves in pan. Place sauerkraut evenly over rolls. Lay bacon on top of sauerkraut. Sprinkle with 1 to 2 tablespoons of sugar. Mix chopped tomatoes and soup with water and pour over rolls. Add additional water to reach top of cabbage rolls.\nBake at 350 degrees F (175 degrees C) for 1 1/2 hours or until cooked through.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "1102439.jpg",
    "o": "3330764.jpg,3228148.jpg,1778727.jpg,1107471.jpg,437725.jpg,240280.jpg",
    "st": "allrecipes"
}