{
    "id": 146044,
    "old_rating": "4.53571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound ground pork",
        "1 onion, diced",
        "1 bell pepper, diced",
        "1 tablespoon olive oil",
        "1 large zucchini, cubed",
        "2 medium yellow squash, cut in one-inch cubes",
        "1 tablespoon minced garlic",
        "2 (14.5 ounce) cans chopped canned tomatoes",
        "1 tablespoon dried parsley",
        "1 tablespoon dried oregano",
        "1 tablespoon salt",
        "1 tablespoon ground black pepper",
        "1 1/4 cups crushed crackers",
        "1 1/4 cups grated Parmesan cheese",
        "1 (16 ounce) package shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 599 kcal",
        "Carbs > 33.9 g",
        "Cholesterol > 83 mg",
        "Fat > 37.7 g",
        "Protein > 31.8 g",
        "Sodium > 2442 mg"
    ],
    "n": "Summery Ratatouille",
    "a": "Kiss1frog",
    "r": "0",
    "s": 8,
    "des": "\"In this recipe, abundant summer vegetables and ground pork are simmered together, then baked with cheese. My kids actually eat their veggies! Serve the dish with noodles or rice to make a meal.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a large casserole dish.\nPlace the ground pork in a large skillet and cook over medium heat, stirring to crumble, until evenly browned. Remove meat from skillet with a slotted spoon, reserving drippings, and place in a bowl. Add the onion and bell pepper to the skillet, and cook over medium heat until translucent and tender. Place in bowl with the ground pork.\nAdd the olive oil to the same large skillet, swirling to coat pan. Stir in zucchini, yellow squash, and garlic; cook over medium heat until tender, about 4 minutes. Mix in the tomatoes, parsley, oregano, salt, and pepper; simmer over medium heat for 10 minutes. Stir in the sausage and onions; simmer 5 minutes more.\nMix the cracker crumbs and Parmesan cheese together in a bowl. Set aside.\nSpread half the vegetable-sausage mixture over the bottom of the prepared dish. Sprinkle with the mozzarella. Spread remaining vegetable sausage mixture over the cheese. Top evenly with the cracker crumb and Parmesan cheese mixture.\nBake in preheated oven until top is golden brown, about 30 minutes.",
    "pt": "30 m",
    "ct": "59 m",
    "tt": "1 h ",
    "i": "972009.jpg",
    "o": "",
    "st": "allrecipes"
}