{
    "id": 146193,
    "old_rating": "4.14286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups white sugar",
        "1 cup butter, softened",
        "5 eggs",
        "1/4 cup cold brewed coffee",
        "2 tablespoons unsweetened cocoa powder",
        "1 cup buttermilk",
        "1 teaspoon baking soda",
        "2 1/2 cups all-purpose flour",
        "1 cup butter, softened",
        "1 (16 ounce) package confectioners' sugar, sifted",
        "1/4 cup cold brewed coffee",
        "1/4 cup unsweetened cocoa powder",
        "2 teaspoons vanilla extract"
    ],
    "nut": [
        "Calories > 824 kcal",
        "Carbs > 111.7 g",
        "Cholesterol > 192 mg",
        "Fat > 40.3 g",
        "Protein > 8.2 g",
        "Sodium > 450 mg"
    ],
    "n": "Granny's Mahogany Cake and Frosting",
    "a": "Alice Mayo Edelhauser",
    "r": "0",
    "s": 10,
    "des": "\"This recipe, which is over 100 years old, was one of my grandmother's (she raised 11 children and three grandchildren) favorites. Anytime I serve this cake I get requests for the recipe.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease and flour three 9 inch round cake pans.\nPlace the sugar and butter in a mixing bowl, and beat until light colored and smooth. Beat in the eggs one at a time. Stir the coffee and cocoa into the egg mixture until well blended. Measure the buttermilk, and remove 1 tablespoon, placing it in a separate small bowl, and set aside. Stir the remaining buttermilk into the egg mixture, beating until smooth.\nStir the baking soda into 1 tablespoon buttermilk until smooth, and mix into the egg mixture. Stir in the flour, beating until smooth. Pour the batter evenly into the prepared cake pans.\nBake in preheated oven until a toothpick or small knife inserted into the center comes out clean, about 30 minutes. Remove from the oven, and cool in the pans about 15 minutes before turning out onto a wire rack to cool completely.\nTo make the frosting, beat 1 cup butter until smooth and creamy. Gradually sift in the confectioners' sugar, and beat until smooth. Stir in the coffee, cocoa, and vanilla until well blended.\nPlace one cake layer on a serving plate. Spread top with about 1/5 frosting. Place the second layer on top of the first, and frost. Repeat with the third layer. Use remaining frosting to frost top and sides.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "1227662.jpg",
    "o": "",
    "st": "allrecipes"
}