{
    "id": 14624,
    "old_rating": "4.56522",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup soy sauce",
        "1/4 cup real maple syrup",
        "6 cloves garlic, minced",
        "1 tablespoon grated fresh ginger",
        "1 teaspoon mustard powder",
        "1/2 teaspoon sesame oil",
        "1/4 teaspoon hot pepper sauce",
        "1/2 cup beer",
        "4 (10 ounce) beef rib eye steaks"
    ],
    "nut": [
        "Calories > 467 kcal",
        "Carbs > 18.8 g",
        "Cholesterol > 100 mg",
        "Fat > 27.1 g",
        "Protein > 33.6 g",
        "Sodium > 1894 mg"
    ],
    "n": "Rib Eye Steaks with a Soy and Ginger Marinade",
    "a": "William Anatooskin",
    "r": "0",
    "s": 4,
    "des": "\"This is a great marinade for steaks, and is wonderful for beef strips for stir-frys.\"",
    "ins": "In a medium size mixing bowl, combine soy sauce, maple syrup, garlic, ginger root, mustard powder, sesame oil, and Tabasco sauce; mix well to blend.  Now add beer, and stir lightly to mix.\nPrepare steaks by scoring any fatty outside areas on steak with a knife, (this prevents the steaks from curling when barbecuing).  Place steaks in a casserole dish, and pour marinade over.  Using a fork, punch holes in steaks so that the marinade penetrates into the steaks.  Turn steaks over, and repeat punching holes.\nCover with clear wrap or foil, and let marinate in the refrigerator for at least 1 hour or longer. You can also refrigerate and marinate overnight.\nPrepare and preheat barbecue to high heat.  Place steaks directly on grill and sear one side for about 15 seconds. Turn steaks over and cook for about 5 minutes, then turn over and cook for another 5 minutes for medium-rare, depending on thickness.  Test for doneness by cutting into the middle of the steak.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "2704.jpg",
    "o": "4524917.jpg,3590439.jpg,2140553.jpg,590820.jpg,219339.jpg,71797.jpg",
    "st": "allrecipes"
}