{
    "id": 14627,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup plain yogurt",
        "1/4 teaspoon salt",
        "1 jalapeno pepper, seeded and minced",
        "3 tablespoons chopped fresh parsley",
        "3 slices whole wheat bread",
        "3 eggs, beaten",
        "1 tablespoon Worcestershire sauce",
        "1 1/2 cups dried bread crumbs",
        "1 cup French-fried onions",
        "3 cloves garlic, minced",
        "2 tablespoons minced fresh ginger root",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon coarsely crushed coriander seed",
        "4 tablespoons chopped fresh parsley",
        "1 jalapeno pepper, seeded and minced",
        "2 pounds ground beef",
        "3 cups vegetable oil for frying"
    ],
    "nut": [
        "Calories > 382 kcal",
        "Carbs > 17.4 g",
        "Cholesterol > 84 mg",
        "Fat > 28.1 g",
        "Protein > 13.6 g",
        "Sodium > 329 mg"
    ],
    "n": "Ugandan Kabobs",
    "a": "William Anatooskin",
    "r": "0",
    "s": 16,
    "des": "\"This recipe is not difficult to make, even though it has quite a number of ingredients.  It's a great party appetizer. This recipe can be found in my cookbook \"From Uncle Bill's Kitchen\".\"",
    "ins": "In a mixing bowl, mix together yogurt, salt, small jalapeno pepper, and  3 tablespoons chopped parsley. Set dipping sauce aside.\nSoak bread slices in water for 3 minutes.  Remove from water, and squeeze out excess moisture.  Crumble into a large bowl. Mix in eggs and Worcestershire sauce. Mix in dried bread crumbs, fried onions, garlic, ginger, ground cumin, crushed coriander seed, 4 tablespoons parsley, and large jalapeno pepper.  Add ground beef, and work in with your hands until well mixed.\nRoll mixture into balls the size of walnuts.\nHeat 3 cups of oil in a large, deep, heavy bottomed frying pan until piping hot, about 375 degrees F (190 degrees C).  Cook meatballs a few at a time in hot oil until brown and crispy, about 3 to 4 minutes.  To check for doneness, cut one in half to see if cooked through; it should be cooked in the center.  Remove from oil using a slotted spoon, and place on a plate lined with paper towels to drain.  Insert a toothpick into each meatball for serving and dipping.  Serve hot or cold with dipping sauce.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "4537184.jpg",
    "o": "",
    "st": "allrecipes"
}