{
    "id": 146303,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup butter",
        "1 cup finely chopped onions",
        "1/2 cup chopped green bell pepper",
        "1/4 cup chopped green onions",
        "3 cloves garlic, minced",
        "1 cup evaporated milk",
        "1 (8 ounce) package processed cheese, cubed",
        "1/2 teaspoon butter",
        "2 (16 ounce) packages cooked and peeled whole crawfish tails",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon garlic powder",
        "1 teaspoon Cajun seasoning",
        "2 cups vegetable oil for frying",
        "20 brown and serve pistolette rolls"
    ],
    "nut": [
        "Calories > 221 kcal",
        "Carbs > 18.2 g",
        "Cholesterol > 69 mg",
        "Fat > 10.7 g",
        "Protein > 13 g",
        "Sodium > 435 mg"
    ],
    "n": "Crawfish Pistolettes",
    "a": "jjelli1",
    "r": "0",
    "s": 20,
    "des": "\"Pistolette bread is fried and then stuffed with a delicious, cheesy, crawfish mixture! To reheat, place pistolettes in a sheet pan and heat in oven at 200F for 20 minutes.\"",
    "ins": "Melt 1/4 cup of butter in a saucepan over medium heat. Stir in the chopped onion, bell pepper, green onions, and garlic. Cook and stir until the onion has softened and turned translucent, about 5 minutes. Pour in the evaporated milk and bring to a simmer. Stir in the processed cheese until melted. Reduce the heat to low, and keep the sauce warm.\nMeanwhile, melt 1/2 teaspoon of butter in a large skillet over medium heat. Add the crawfish tails and season with salt, pepper, garlic powder, and Cajun seasoning. Cook and stir until the tails are hot and beginning to curl, 3 to 5 minutes. Stir the crawfish tails into the cheese sauce, and cook for 5 minutes.\nHeat oil in a large skillet to 350 degrees F (175 degrees C).\nCook the pistolette rolls in the hot oil until golden brown on all sides. Remove to a paper towel lined plate to cool. Once cool enough to handle, cut a slit in one end of each roll, then use the handle of a spoon to create a pocket in the roll. Stuff the rolls with the crawfish mixture and serve immediately.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "550657.jpg",
    "o": "",
    "st": "allrecipes"
}