{
    "id": 146467,
    "old_rating": "4.44262",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (14 ounce) can sweetened condensed milk",
        "1 cup graham cracker crumbs",
        "1/2 cup butter, melted",
        "4 bananas",
        "1 1/2 cups whipping cream",
        "2 tablespoons confectioners' sugar",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 519 kcal",
        "Carbs > 51.4 g",
        "Cholesterol > 108 mg",
        "Fat > 33.5 g",
        "Protein > 6.3 g",
        "Sodium > 225 mg"
    ],
    "n": "Banana-Dulce de Leche Pie (Banana-Caramel Pie)",
    "a": "mapaf",
    "r": "0",
    "s": 8,
    "des": "\"This is a great dessert. You may substitute commercial caramel ice cream topping for the dulce de leche for a quicker preparation, but the homemade dulce de leche is worth the work and time.\"",
    "ins": "To make dulce de leche, place the unopened can of sweetened condensed milk in a saucepan, and add enough water to cover half-way up the can. Place the saucepan over medium-high heat and bring to a boil. Cook for 3 hours, adding more water as necessary. Remove from heat and cool.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine the graham cracker crumbs with the butter in a mixing bowl until evenly blended. Press the crumb mixture evenly into a 9 inch pie plate.\nBake pie crust in preheated oven until lightly browned, 10-15 minutes. Remove from oven, and cool on a wire rack.\nOpen the can of dulce de leche, and pour half, or about 3/4 cup, over the pie crust. Slice the bananas and arrange half in a layer over the dulce de leche filling. Pour the remaining dulce de leche over the bananas. Top with remaining banana slices.\nPour the whipping cream into a mixing bowl, and beat until soft peaks form. Add the sugar and vanilla extract; continue beating until stiff peaks form. Spoon the whipped cream over the bananas. Chill at least 1 hour before serving.",
    "pt": "20 m",
    "ct": "",
    "tt": "",
    "i": "103272.jpg",
    "o": "911706.jpg,672195.jpg,426095.jpg,196725.jpg,138954.jpg,56175.jpg",
    "st": "allrecipes"
}