{
    "id": 14653,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 pounds round steak, cut into thin strips on the diagonal",
        "2 onions, cut into 1/3-inch slices",
        "3 teaspoons salt",
        "ground black pepper to taste",
        "2 tablespoons Hungarian sweet paprika",
        "4 cups water",
        "4 bay leaves",
        "4 tablespoons vegetable oil",
        "4 dried shiitake mushrooms",
        "4 prunes, pitted and chopped",
        "1 teaspoon wildflower honey",
        "2 cloves garlic, halved"
    ],
    "nut": [
        "Calories > 443 kcal",
        "Carbs > 11.4 g",
        "Cholesterol > 97 mg",
        "Fat > 29.9 g",
        "Protein > 31.8 g",
        "Sodium > 1254 mg"
    ],
    "n": "Bitkas",
    "a": "Andrzej J.",
    "r": "0",
    "s": 6,
    "des": "\"This is traditional Polish beef dish. I recommend preparing it in the evening, do the first cooking step, go to bed, and finish on the day after. The dish is time consuming, but all your guests will pronounce you the king of the cooks!\"",
    "ins": "Cut the beef  into slices about 1/3 inch thick. With a meat mallet, hammer all the slices flat until they are 1/3 of their original thickness. Sprinkle each slice generously with salt, pepper, and paprika on one side only. Put 2 or 3 beef slices on a plate, with seasoning side up, and put some onion slices on top. Add layers of beef and onion until all the meat is out. Wrap the plate with plastic wrap or foil; set aside for one hour at room temperature, or overnight in the refrigerator.\nPour water into a Dutch oven, and bring to a boil. Reduce heat to simmer, and add bay leaves.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat oil in a large heavy skillet over medium high heat. Separate onions from bitkas. Reserve half of the onions, and discard the rest. Fry bitkas 3 at a time for 20 seconds on each side. Transfer fried meat into boiling water. When all the meat is added, reduce the heat and keep meat submerged in hot water.\nChop the reserved onion coarsely. Saute in the beef drippings over medium heat. Drain, reserving drippings, and add onions along with mushrooms, prunes, honey and garlic to the meat. Skim fat from drippings, and add to the meat.\nTransfer the pot to the oven. Roast for one hour in the preheated oven. Turn the heat off, and then let the pot cool down slowly in the oven for approximately 2 hours. Repeat the heating cycle 3 times. After 20 minutes in the oven take the pot out, and fish out the mushrooms; cut into 1/8 inch wide stripes, and return to the pot.\nDuring the cooking period, take the pot out every 20 minutes and rearrange the bitkas. Check that nothing sticks to the bottom; normally nothing does. Check water level. If necessary, add some boiling water. Usually I have to add about 1/2 cup boiling water in the beginning of each heating cycle. During last heating cycle, check the sauce for seasoning. Season to taste.",
    "pt": "30 m",
    "ct": "9 h",
    "tt": "10 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}