{
    "id": 146731,
    "old_rating": "4.74324",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 teaspoon olive oil",
        "4 cloves garlic, minced",
        "1/2 onion, grated",
        "1/2 cup bourbon",
        "1/4 cup cider vinegar",
        "2 cups ketchup",
        "1/4 cup Worcestershire sauce",
        "1 tablespoon liquid smoke flavoring",
        "1 chipotle pepper in adobo sauce, minced",
        "1 teaspoon adobo sauce from canned chipotle peppers",
        "1/4 cup brown sugar",
        "4 (6 ounce) skinless, boneless chicken breast halves",
        "2 tablespoons grill seasoning, or to taste",
        "4 slices bacon, cut in half",
        "4 thick slices red onion",
        "1 teaspoon olive oil",
        "4 slices provolone cheese"
    ],
    "nut": [
        "Calories > 697 kcal",
        "Carbs > 59.1 g",
        "Cholesterol > 127 mg",
        "Fat > 21.9 g",
        "Protein > 49.5 g",
        "Sodium > 3457 mg"
    ],
    "n": "Smoky Mountain Chipotle Chicken",
    "a": "Janine",
    "r": "0",
    "s": 4,
    "des": "\"You will love this recipe if like your meals packed with intense flavor! This chicken has a smoky, spicy, sweet taste that my family raves about. We hope you and yours enjoy it also!\"",
    "ins": "Heat 1 teaspoon olive oil in a large skillet over medium heat. Add garlic and onion; cook and stir until the onion softens and turns translucent, about 5 minutes. Pour in the bourbon, and simmer for 10 minutes. Have a lid ready to cover the skillet in case the bourbon catches fire.\nPour in the cider vinegar, ketchup, Worcestershire sauce, liquid smoke, minced chipotle pepper, adobo sauce, and brown sugar. Bring to a boil, then reduce heat to medium-low, and simmer 15 minutes. Pour sauce into a bowl, and refrigerate until no longer hot, about 30 minutes.\nSeason chicken breasts with grill seasoning, and place into a shallow glass dish. Pour all but 1 cup of the cooled sauce over the chicken breasts, and turn to coat. Refrigerate remaining sauce. Cover the chicken and refrigerate 2 hours. Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown and crispy. Drain on a paper towel-lined plate, and set aside.\nPreheat an outdoor grill for medium-high heat.\nDrain marinade from the chicken and discard. Cook chicken on preheated grill, basting with reserved sauce, until the chicken is no longer pink in the center, and the juices run clear, about 10 minutes per side. Meanwhile, brush onion slices with 1 teaspoon olive oil. Secure the rings with toothpicks to keep them from falling apart. Grill over indirect heat until soft, about 15 minutes.\nTo serve, place chicken onto serving plates and top with a slice grilled onion, 2 slices of bacon and then a slice of  provolone cheese. Remove toothpicks before serving.",
    "pt": "35 m",
    "ct": "50 m",
    "tt": "3 h ",
    "i": "255725.jpg",
    "o": "",
    "st": "allrecipes"
}