{
    "id": 146710,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup raw mung beans",
        "5 potatoes, peeled and quartered",
        "1/4 teaspoon salt",
        "1 tablespoon canola oil",
        "1 onion, peeled and chopped",
        "2 carrots, sliced",
        "2 stalks celery, sliced",
        "5 button mushrooms, sliced",
        "2 cups vegetable stock",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 174 kcal",
        "Carbs > 36.2 g",
        "Cholesterol > 0 mg",
        "Fat > 0.8 g",
        "Protein > 6.9 g",
        "Sodium > 224 mg"
    ],
    "n": "Mung Bean Stew",
    "a": "sarahhouston",
    "r": "0",
    "s": 8,
    "des": "\"This a delicious and nutritious vegan recipe. It's also great for anyone with a wheat or dairy allergy.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPlace the mung beans in a saucepan and cover with water. Bring to a boil over medium-high heat, and cook for 10 minutes. Lower heat to medium, and simmer until soft, about 10 minutes. Drain beans into a strainer and rinse under cold water. Set aside.\nMeanwhile, place the potatoes in saucepan, cover with water, and stir in 1/4 teaspoon salt. Bring to a boil over medium-high heat, and cook just until potatoes begin to soften when pierced with a fork, about 10 minutes. Drain, and set aside.\nHeat the oil in a skillet over medium heat. Add the onion; cook and stir until transparent, about 5 minutes. Add the carrots, celery, and mushrooms. Cook and stir until the vegetables are tender, about 5 minutes. Pour in the stock, and add salt and pepper to taste. Cook vegetable mixture 5 minutes more. Combine with the mung beans and potatoes in an oven-proof casserole. Cover with a lid.\nBake in preheated oven until mixture bubbles, about 30 minutes.",
    "pt": "30 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "664481.jpg",
    "o": "",
    "st": "allrecipes"
}