{
    "id": 146881,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/4 cups all-purpose flour",
        "1 1/4 teaspoons baking soda",
        "1 teaspoon ground ginger",
        "1 teaspoon ground cinnamon",
        "1 dash ground nutmeg",
        "1 teaspoon ground allspice",
        "1 egg",
        "1/2 cup warm water",
        "1/3 cup white sugar",
        "1/3 cup molasses",
        "1/3 cup melted butter",
        "1/4 cup confectioners' sugar",
        "1 cup sweetened whipped cream"
    ],
    "nut": [
        "Calories > 257 kcal",
        "Carbs > 39 g",
        "Cholesterol > 49 mg",
        "Fat > 10.3 g",
        "Protein > 3.2 g",
        "Sodium > 276 mg"
    ],
    "n": "Ginger and Cream Cake Roll",
    "a": "Anna",
    "r": "0",
    "s": 8,
    "des": "\"I hate ginger, but I love this sweet, tangy roll! It's great as a dessert, but also perfect for brunches or tea parties.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a 10x15 inch jellyroll pan with parchment paper and lightly grease. Sift together flour, baking soda, ginger, cinnamon, nutmeg, and allspice.\nBeat together egg and water in a large bowl, then whisk in white sugar, and molasses. Fold in the sifted dry ingredients until smooth, then pour batter into prepared pan.\nBake in preheated oven until the cake springs back to the touch, about 15 minutes. When done, remove from oven, and allow to cool for 15 minutes. Then cover pan with a moistened towel, and refrigerate until cold, about 2 hours.\nTo assemble, remove cake from the jelly roll pan, and invert onto a fresh sheet of parchment paper; remove and discard the old parchment paper. Sprinkle evenly with confectioners' sugar, then spread evenly with whipped cream. Roll up from narrow end to narrow end, forming a firm spiral log. Wrap in the parchment paper and chill until ready to serve.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}