{
    "id": 14711,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 1/2 pounds pork tenderloin",
        "2 cloves garlic, minced",
        "15 oil-cured black olives, pitted",
        "1 teaspoon prepared mustard",
        "salt and pepper to taste",
        "1 red bell pepper, halved and deseeded",
        "4 fresh mushrooms",
        "1 onion, thinly sliced",
        "1 tablespoon browning sauce"
    ],
    "nut": [
        "Calories > 532 kcal",
        "Carbs > 5.7 g",
        "Cholesterol > 258 mg",
        "Fat > 17.1 g",
        "Protein > 83.3 g",
        "Sodium > 656 mg"
    ],
    "n": "Italian-Style Pork Tenderloin",
    "a": "Richard",
    "r": "0",
    "s": 4,
    "des": "\"This pork tenderloin is quick and easy to prepare ahead of time. One of my favorite recipes. You can make this recipe on the grill or bake it in your oven.\"",
    "ins": "Slice the pork tenderloin open the long way. Spread the mustard, minced garlic and chopped olives in the roast. Sprinkle with salt and pepper all-over, to taste. Tie the loin at 1-inch intervals to shape evenly into a roll. Refrigerate and marinate loin for 24 hours.\nTo Grill: Prepare grill for high heat.\nUsing a generous amount of heavy-duty foil, lay the sliced red pepper on the bottom. Put the marinated tenderloin on top. Paint the surface with browning sauce and place the onion slices and mushrooms on top. Seal the foil, making a little tent on top.\nGrill the pork for about 20 minutes or until it has reached an internal temperature of 145 degrees F (63 C). Remove from heat and allow the meat to rest for 10 minutes before slicing.\nTo Bake: Preheat oven to 375 degrees F (190 degrees C).\nLay the sliced red pepper on the bottom of a roasting pan. Put the marinated tenderloin on top. Paint the surface with browning sauce and place the onion slices and mushrooms on top. Cover and bake in the preheated oven for 30 minutes or until the internal temperature reaches 145 degrees F (63 degrees C). Let stand for 10 minutes before carving.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "1 d ",
    "i": "43459.jpg",
    "o": "",
    "st": "allrecipes"
}