{
    "id": 147160,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (12 ounce) package buckwheat soba noodles",
        "2 tablespoons extra-virgin olive oil",
        "16 bay scallops, cleaned and patted dry",
        "8 cloves garlic, minced",
        "4 ripe tomatoes, diced",
        "2 red bell peppers, diced",
        "1 teaspoon dried basil",
        "8 pitted Kalamata olives, sliced",
        "2 tablespoons Dijon mustard",
        "1 pinch salt (optional)"
    ],
    "nut": [
        "Calories > 457 kcal",
        "Carbs > 77.3 g",
        "Cholesterol > 15 mg",
        "Fat > 10 g",
        "Protein > 20.5 g",
        "Sodium > 1062 mg"
    ],
    "n": "Warm Buckwheat Noodles with Scallops in Tomato-Pepper Sauce",
    "a": "maplewood",
    "r": "0",
    "s": 4,
    "des": "\"The minimally bitter buckwheat noodles add a special zest to the favorite scallop-tomato combination, perfectly matched by the delicate yet strong French mustard and accented by powerful Greek olives.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Add soba noodles and cook for 6 to 8 minutes, until al dente. Drain and rinse with a little cool water to stop the cooking. The noodles should remain warm.\nMeanwhile, heat olive oil in a large skillet over medium-high heat. Place scallops into the hot skillet, and cook until golden brown without moving them in the pan, about 1 minute. Turn the scallops over, and cook until golden brown on the other side, 1 minute more. Remove from the pan and set aside.\nStir in the minced garlic, and cook until garlic begins to turn golden brown, about 30 seconds. Add the tomatoes, bell pepper, and basil. Cook and stir until the peppers soften and the tomatoes begin to release their juices. Stir in the Kalamata olives, Dijon mustard, and reserved scallops. Season with salt, and simmer over medium-low heat for 1 minute to allow the flavors to infuse. Place warm noodles onto serving plates and top with scallop mixture to serve.",
    "pt": "20 m",
    "ct": "7 m",
    "tt": "27 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}