{
    "id": 147218,
    "old_rating": "3.86957",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup white sugar, divided",
        "2 1/2 teaspoons dry yeast",
        "3/4 cup warm water",
        "1 1/2 teaspoons ground cinnamon",
        "2 eggs",
        "3/4 cup applesauce",
        "1/2 teaspoon salt",
        "4 1/2 cups all-purpose flour",
        "2 tablespoons honey",
        "1/2 cup raisins"
    ],
    "nut": [
        "Calories > 240 kcal",
        "Carbs > 50.6 g",
        "Cholesterol > 31 mg",
        "Fat > 1.4 g",
        "Protein > 6.5 g",
        "Sodium > 112 mg"
    ],
    "n": "Heavenly Cinnamon Rolls",
    "a": "Goodeats",
    "r": "0",
    "s": 12,
    "des": "\"A great substitute for those heavy, buttery cinnamon roll recipes. This one will blow you away. Just remember that the dough before the first rising may be a bit sticky, but not adding any more flour at this point guarantees a fluffy masterpiece.\"",
    "ins": "Stir 1 tablespoon of the sugar and the yeast into the warm water in a small bowl. The water should be no more than 100 degrees F (40 degrees C). Let stand for 5 minutes until the yeast softens and begins to form a creamy foam. Whisk together the cinnamon and 2 tablespoons sugar in a small bowl; set aside.\nBeat together the eggs, applesauce, salt, and the remaining 1 tablespoon of sugar in a large bowl. Stir in the yeast mixture. Beat in half of the flour mixture until no dry spots remain. Stir in the remaining flour, a 1/2 cup at a time, mixing well after each addition to form a sticky dough. Turn it out onto a lightly floured surface and knead until fairly smooth but still sticky, about 8 minutes.\nLightly oil a large bowl, then place the dough in the bowl and turn to coat with oil. Cover with a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) for 30 minutes. Grease a 9x13 inch baking pan.\nDeflate the dough and turn it out onto a lightly floured surface. Roll the dough into a 16x20 inch rectangle. Spread the honey over the dough; sprinkle evenly with the cinnamon sugar and raisins. Beginning with the long side, roll the dough tightly into a log shape, and pinch to seal the seam. Cut into 12 equal size pieces. Place the rolls into the prepared pan cut side up. Cover the pan with a damp cloth and let rise until doubled in volume, about 30 minutes.\nPreheat an oven to 350 degrees F (175 degrees C).\nBake in the preheated oven until golden brown, about 30 minutes.",
    "pt": "45 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "391840.jpg",
    "o": "",
    "st": "allrecipes"
}