{
    "id": 147305,
    "old_rating": "4.63025",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package medium seashell pasta",
        "6 tablespoons butter",
        "1 tablespoon olive oil",
        "1 tablespoon chopped fresh parsley",
        "1 clove garlic, chopped",
        "1 (10 ounce) package sliced fresh button mushrooms",
        "1 bunch asparagus, trimmed and cut into 1 inch pieces",
        "salt and pepper to taste",
        "1/2 teaspoon onion powder",
        "1 pound scallops, rinsed and patted dry",
        "1/4 cup milk",
        "1 (8 ounce) container mascarpone cheese",
        "2 tablespoons butter"
    ],
    "nut": [
        "Calories > 714 kcal",
        "Carbs > 63.2 g",
        "Cholesterol > 134 mg",
        "Fat > 37.8 g",
        "Protein > 35.3 g",
        "Sodium > 360 mg"
    ],
    "n": "Scallops Mascarpone",
    "a": "Andy Smith",
    "r": "0",
    "s": 6,
    "des": "\"A light seafood dishes that pleases the taste buds and the eyes!\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Add pasta, and cook for 7 to 9 minutes, until al dente.\nMelt 6 tablespoons of butter with the olive oil in a large skillet over medium heat. Mix in the parsley and garlic and cook for a couple of minutes until fragrant. Add the mushrooms and asparagus and season with salt, pepper and onion powder; cook, stirring occasionally until asparagus is tender, about 5 minutes depending on the thickness. Place the scallops in the pan, and cook briefly on each side until lightly browned and the center is cooked through, about 3 minutes per side. Remove from the heat when scallops are just finished.\nMeanwhile, in a small saucepan, combine the milk, mascarpone cheese and remaining butter. Cook over medium heat, stirring, until sauce is warm and butter is completely melted and blended in. Stir this sauce into the scallops and vegetables along with the pasta and serve immediately.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "4539061.jpg",
    "o": "2783135.jpg,2315311.jpg,2199444.jpg,1688045.jpg,930663.jpg,45412.jpg",
    "st": "allrecipes"
}