{
    "id": 14756,
    "old_rating": "4.35714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 pounds pork spareribs",
        "2 medium onions, cut into wedges",
        "1 medium onion, finely chopped",
        "6 tablespoons soy sauce",
        "1/4 teaspoon ground black pepper",
        "6 whole star anise pods",
        "1 tablespoon vegetable oil",
        "1 tablespoon grated fresh ginger",
        "1/2 cup honey",
        "2 tablespoons brown sugar",
        "1 tablespoon Worcestershire sauce",
        "1 tablespoon lemon juice"
    ],
    "nut": [
        "Calories > 773 kcal",
        "Carbs > 19.4 g",
        "Cholesterol > 198 mg",
        "Fat > 59.3 g",
        "Protein > 39.3 g",
        "Sodium > 710 mg"
    ],
    "n": "Filipino Ribs",
    "a": "CHRISTYJ",
    "r": "0",
    "s": 11,
    "des": "\"Spareribs glazed with the sweet, tangy taste of the Philippines. One of the honey coating ingredients, star anise, is native to China; it is a star-shaped, dark brown pod that contains a pea-sized seed in each of its eight segments. Star anise is available at all Asian markets as well as many general grocery stores.\"",
    "ins": "Place ribs in a 5 to 6 quart stock pot with the 2 wedged onions, 4 tablespoons of the soy sauce, pepper and star anise. Bring all to a boil. Reduce heat to medium low, cover and let simmer in meat juices until ribs are tender when pierced, about 1 1/4 hours. Stir occasionally.\nMeanwhile, heat oil in a medium skillet over medium heat. Add remaining chopped onion and saute, stirring often, until onion is soft. Blend in the ginger, honey, sugar, Worcestershire sauce, lemon juice and remaining 2 tablespoons of soy sauce. Cook all together, stirring, until well blended. Remove from heat.\nPreheat oven to 400 degrees F (200 degrees C).\nUsing tongs, remove ribs from stock pot and arrange in a single layer in an 11x16 inch baking dish. Brush evenly with the honey mixture and bake in the preheated oven, basting often with pan drippings, about 30 minutes or until ribs are well glazed.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "421829.jpg",
    "o": "4420916.jpg,3957038.jpg,3923810.jpg,3889047.jpg,3875572.jpg,3861415.jpg",
    "st": "allrecipes"
}