{
    "id": 14782,
    "old_rating": "4.24324",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup vegetable oil",
        "3 pounds pork shoulder, cubed",
        "3 tablespoons achiote (annatto) seeds",
        "2 cups chopped onion",
        "2 cups chopped fresh cilantro",
        "12 cloves garlic, crushed",
        "2 tablespoons salt",
        "1 teaspoon ground black pepper",
        "2 (8 ounce) cans tomato sauce",
        "1 (15 ounce) can pigeon peas, drained",
        "15 ounces black olives, pitted and halved",
        "8 cups uncooked calrose rice, rinsed",
        "9 cups water"
    ],
    "nut": [
        "Calories > 615 kcal",
        "Carbs > 71.7 g",
        "Cholesterol > 48 mg",
        "Fat > 27.6 g",
        "Protein > 18.6 g",
        "Sodium > 1112 mg"
    ],
    "n": "Gandule Rice",
    "a": "B. Mason",
    "r": "0",
    "s": 20,
    "des": "\"A Puerto Rican dish with local Hawaiian flavor. Labor intensive, but also delicious. One ingredient, pigeon pea, is Native to Africa and is also called 'Congo pea' and 'no-eyed pea'; achiote seeds are slightly musky-flavored seeds of the annatto tree, available whole or ground in East Indian, Spanish and Latin American markets. Buy whole seeds when they're a rusty red color; brown seeds are old and flavorless. Achiote seeds are also called 'annatto' which, in its paste and powder form, is used in the United States to color butter, margarine, cheese and smoked fish.\"",
    "ins": "Heat 2 tablespoons of the oil in a large saucepan over medium high heat. Add pork and brown in oil. Meanwhile, place remaining oil in a small saucepan over medium heat and add achiote seeds. Heat until oil becomes very dark orange/red. Remove from heat and set aside.\nTo the browned pork add the onion, cilantro, garlic, salt and pepper. Cook to reduce veggies, then add the tomato sauce, pigeon peas and olives. Mix well. Strain achiote/oil mixture into pork mixture and stir together. Reduce heat to low and let simmer for 10 minutes.\nAdd uncooked rice and water to pork mixture; stir well. Raise temperature to high, cover saucepan and bring all to a boil. Stir again, reduce heat to low and cover; let cook on low about 10 minutes. Remove cover, stir again, replace cover and cook another 10 minutes; stir again. Remove from heat and allow to stand 15 minutes.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "245702.jpg",
    "o": "4523468.jpg,3053550.jpg,2054320.jpg,1102985.jpg,58989.jpg,22700.jpg",
    "st": "allrecipes"
}