{
    "id": 148543,
    "old_rating": "4.64463",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 Italian sausage links, casings removed",
        "1 pound lean ground beef",
        "1 tablespoon olive oil",
        "1 yellow onion, chopped",
        "2 cloves garlic, chopped",
        "1 (14.5 ounce) can whole peeled tomatoes",
        "1 (15 ounce) can tomato sauce",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 teaspoon dried basil",
        "1/4 cup chopped fresh oregano",
        "1 bay leaf",
        "1 (16 ounce) package uncooked spaghetti",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 439 kcal",
        "Carbs > 47.5 g",
        "Cholesterol > 53 mg",
        "Fat > 16.5 g",
        "Protein > 24.5 g",
        "Sodium > 985 mg"
    ],
    "n": "Camp David Spaghetti with Italian Sausage",
    "a": "hungryguy",
    "r": "0",
    "s": 8,
    "des": "\"I was shown this recipe by a Navy chef who served this to presidents at Camp David, MD. I have served it to my family many times, and it is certainly fit for a president. Best with a garden salad and crusty garlic bread.\"",
    "ins": "Slice the sausages lengthwise, leaving them attached along one side. Spread them out flat in a large skillet. Cook over medium heat for 15 minutes, turning once, until the sausages are browned and cooked through. Remove from skillet and set aside.\nPlace the ground beef, olive oil, onion, and garlic in the skillet, and cook and stir over medium heat for about 10 minutes, until the onion is translucent and the beef is browned and crumbly. Drain all but 2 tablespoons of fat. Stir in the tomatoes, tomato sauce, salt, pepper, basil, oregano, and bay leaf. Simmer uncovered over low heat for 1 hour, stirring occasionally, until the flavors have blended. Remove the bay leaf.\nPreheat the oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil, drop in the pasta, and cook for 8 to 10 minutes, stirring occasionally, until tender. Drain the pasta, and mix it into the sauce.\nPlace servings of hot pasta with sauce on oven-safe plates, place a cooked, opened sausage over each serving, and sprinkle with Parmesan cheese. Place plates in the preheated oven for 5 to 10 minutes, until the cheese has melted and begun to brown.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "403394.jpg",
    "o": "4528550.jpg,4506802.jpg,4487190.jpg,3285832.jpg,2498926.jpg,1132478.jpg",
    "st": "allrecipes"
}