{
    "id": 148864,
    "old_rating": "4.56164",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound skinless, boneless chicken thighs, cut into 1/2 inch strips",
        "1 clove garlic, minced",
        "2 teaspoons minced fresh ginger root",
        "1 tablespoon fish sauce",
        "2 teaspoons peanut oil",
        "4 shallots, minced",
        "2 teaspoons minced garlic",
        "2 teaspoons minced fresh ginger root",
        "2 small red chile peppers, seeded and minced",
        "1/2 cup crunchy peanut butter",
        "1 3/4 cups coconut milk",
        "2 teaspoons soy sauce",
        "2 teaspoons brown sugar",
        "1 1/2 tablespoons fish sauce",
        "1 1/2 tablespoons lime juice",
        "12 wooden skewers, soaked in water for 1 hour"
    ],
    "nut": [
        "Calories > 619 kcal",
        "Carbs > 23.3 g",
        "Cholesterol > 70 mg",
        "Fat > 47.7 g",
        "Protein > 31.1 g",
        "Sodium > 1076 mg"
    ],
    "n": "Chicken Satay with Homemade Peanut Sauce",
    "a": "HANZOtheRAZOR",
    "r": "0",
    "s": 4,
    "des": "\"This simply marinated chicken tastes just delicious, especially when paired with this spicy peanut sauce for dipping or basting. Fish sauce STINKS, do not let this stop you, the end result is a beautiful flavor!\"",
    "ins": "Toss chicken, garlic, ginger, and 1 tablespoon fish sauce in a bowl until the chicken is coated in the marinade. Cover, and marinate for 1 hour.\nWhile the chicken is marinating, heat the peanut oil in a skillet over medium heat. Stir in shallots, garlic, ginger, and chile peppers. Cook and stir until the shallot begins to turn golden brown, about 7 minutes. Reduce heat to low, and stir in peanut butter, coconut milk, soy sauce, brown sugar, 1 1/2 tablespoons fish sauce, and lime juice until blended. Simmer very gently for 10 minutes, then remove from heat and keep warm.\nPreheat an outdoor grill for medium-high heat and lightly oil grate. Thread chicken onto skewers.\nGrill chicken skewers on preheated grill until no longer pink in the center, about 3 minutes per side. Serve with warm peanut sauce.",
    "pt": "30 m",
    "ct": "26 m",
    "tt": "1 h ",
    "i": "593784.jpg",
    "o": "",
    "st": "allrecipes"
}