{
    "id": 148850,
    "old_rating": "3.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup beef broth",
        "1/2 cup dry red wine",
        "1 1/2 cups sliced mushrooms",
        "1/4 cup finely chopped shallot",
        "3 cloves garlic, crushed",
        "3 teaspoons fresh lemon juice",
        "3 teaspoons Worcestershire sauce",
        "1/4 teaspoon salt, or to taste",
        "1 pinch ground black pepper, or to taste",
        "2 teaspoons chopped fresh parsley",
        "2 teaspoons all-purpose flour",
        "1 tablespoon butter",
        "1 pound trimmed beef tenderloin, slightly pounded"
    ],
    "nut": [
        "Calories > 228 kcal",
        "Carbs > 6.4 g",
        "Cholesterol > 63 mg",
        "Fat > 10.8 g",
        "Protein > 20.4 g",
        "Sodium > 352 mg"
    ],
    "n": "Less-Butter Steak Diane",
    "a": "Heidi-Ho",
    "r": "0",
    "s": 4,
    "des": "\"I LOVE Steak Diane, but most of the recipes I find are made with way too much butter and/or olive oil. I wanted a lighter version, but with the same amazing flavor. So, after experimenting a bit, this is what I came up with. I think it is even better than those buttery, fatty versions. This recipe also yields lots of yummy gravy, so it's great with mashed potatoes.\"",
    "ins": "Pour the beef broth and wine into a large skillet, and stir in the mushrooms, shallot, garlic, lemon juice, and Worcestershire sauce. Simmer over medium heat , stirring frequently, until the mushrooms reduce in size, about 20 minutes. Season to taste with salt and pepper.\nSkim off 2 tablespoons liquid from the mushroom mixture, and pour into a small bowl. Whisk in the flour and blend to make a smooth paste. Stir the flour mixture into the mushroom mixture. Cook and stir as sauce thickens. Repeat as desired , adding small amounts of more flour to make a thicker sauce. Stir in the parsley. Pour the sauce into a pan, and keep warm until needed.\nUsing the same skillet, melt the butter over medium heat. Place the tenderloin in the skillet, and cook over medium-high heat, turning once, until desired degree of doneness. Serve with mushroom sauce.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "4174792.jpg",
    "o": "",
    "st": "allrecipes"
}