{
    "id": 148852,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Cake:",
        "3 cups all-purpose flour",
        "1 teaspoon salt",
        "1 teaspoon baking soda",
        "2 teaspoons ground cinnamon",
        "3 eggs",
        "1 1/2 cups vegetable oil",
        "2 teaspoons vanilla extract",
        "2 cups white sugar",
        "3 cups Granny Smith apples, thinly sliced",
        "3/4 cup chopped pecans",
        "3/4 cup chopped black walnuts",
        "Topping:",
        "1 cup brown sugar",
        "1/2 cup milk",
        "1/2 cup butter",
        "1 teaspoon vanilla extract",
        "Icing:",
        "1 teaspoon mayonnaise",
        "1 teaspoon vanilla extract",
        "2 cups confectioners' sugar"
    ],
    "nut": [
        "Calories > 847 kcal",
        "Carbs > 102.7 g",
        "Cholesterol > 68 mg",
        "Fat > 47 g",
        "Protein > 7.9 g",
        "Sodium > 384 mg"
    ],
    "n": "Mountain Apple Cake",
    "a": "Heather Smith Robles",
    "r": "0",
    "s": 12,
    "des": "\"Does this cake catch your eye? It is not only beautiful, but melts in your mouth it is so moist! It's a must try for any apple lover, I have done several variations, such as adding raisins, mango, and even bananas, and they have all come out great! Just play around with the recipe, adding your favorites, and it's sure to be a hit with your family!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Sift together flour, salt, baking soda, and cinnamon; set aside. Grease and flour an 8 inch Bundt pan.\nWhisk together eggs, oil, and 2 teaspoons vanilla extract until smooth. Mix in sifted dry ingredients until moistened, then fold in sliced apples, pecans, and walnuts. Pour batter into prepared Bundt pan.\nBake cake in preheated oven until golden brown on top, and a toothpick inserted in the center comes out clean, about 1 1/2 hours. Stir together brown sugar, milk, butter, and 1 teaspoon vanilla extract in a saucepan. Simmer for 2 minutes, then pour over cake in the Bundt pan as soon as it comes out of the oven. Allow cake to cool in pan set over a wire rack until it is room temperature, about 4 hours.\nWhisk together mayonnaise, 1 teaspoon vanilla extract, and confectioners' sugar until smooth. Unmold cake and place onto a serving plate, spread icing over the top.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "6 h",
    "i": "44303.jpg",
    "o": "",
    "st": "allrecipes"
}