{
    "id": 148803,
    "old_rating": "4.61538",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (10 ounce) package frozen puff pastry shells",
        "2 tablespoons butter",
        "1 1/2 pounds skinless, boneless chicken breast meat - cubed",
        "2 (10.5 ounce) cans chicken broth",
        "2 teaspoons chicken soup base",
        "1/4 teaspoon dried thyme leaves",
        "1/4 cup chopped fresh parsley",
        "2 tablespoons butter, softened",
        "3 tablespoons all-purpose flour",
        "1 (4 ounce) can mushroom pieces, drained",
        "1 (10 ounce) package frozen mixed peas and carrots",
        "1/2 cup heavy cream",
        "1/4 cup toasted sliced almonds"
    ],
    "nut": [
        "Calories > 522 kcal",
        "Carbs > 27.6 g",
        "Cholesterol > 109 mg",
        "Fat > 33.1 g",
        "Protein > 30.6 g",
        "Sodium > 1203 mg"
    ],
    "n": "Chicken Pot Pie Soup with Toasted Almonds",
    "a": "Lisa",
    "r": "0",
    "s": 6,
    "des": "\"I love pot pies, and this recipe turns out so yummy, I always get compliments when I make it.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Place frozen puff pastry shells, top-side-up on an ungreased baking sheet 2 inches apart.\nBake shells in preheated oven until puffed and golden-brown, 20 to 25 minutes. Remove to cool on a wire rack.\nMeanwhile, melt 2 tablespoons of butter in a large pot over medium heat. Stir in the cubed chicken, and cook, until firmed and no longer pink in the center, about 10 minutes. Remove chicken meat and set aside.\nPour in the chicken broth and bring to a boil over high heat. Reduce heat to medium, and whisk in the chicken soup base, thyme, and parsley. Mix together the softened butter and flour in a small bowl to form a paste. Whisk this paste into the simmering soup, and cook 10 minutes or until thickened.\nStir in the cooked chicken, mushroom pieces, peas and carrots, cream, and toasted almonds. Return soup to a simmer, and cook a few minutes until hot. Ladle soup into serving bowls, and top with puff pastry to serve.",
    "pt": "25 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "277458.jpg",
    "o": "",
    "st": "allrecipes"
}