{
    "id": 148983,
    "old_rating": "4.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Syrup:",
        "3/4 cup water",
        "3/4 cup white sugar",
        "1/4 cup orange juice",
        "1 1/2 cups honey",
        "1 tablespoon ground cinnamon",
        "Pastry:",
        "3/4 cup white sugar",
        "1/2 teaspoon ground cinnamon",
        "1/8 teaspoon ground nutmeg",
        "2 cups ground walnuts",
        "1 (16 ounce) package phyllo dough",
        "1 1/2 cups melted butter"
    ],
    "nut": [
        "Calories > 211 kcal",
        "Carbs > 27.5 g",
        "Cholesterol > 20 mg",
        "Fat > 11.3 g",
        "Protein > 1.7 g",
        "Sodium > 115 mg"
    ],
    "n": "Grecian Baklava",
    "a": "schwintosky",
    "r": "0",
    "s": 36,
    "des": "\"This is a great baklava recipe I've developed after eating many different types and styles of baklava. It's certainly worth the time it takes and makes a great breakfast or dessert.\"",
    "ins": "Make the syrup by bringing the water, 3/4 cup sugar, orange juice, honey, and 1 tablespoon cinnamon to a boil in a saucepan over medium-high heat. Reduce heat to medium-low and simmer 10 minutes. Remove from heat and allow to cool to room temperature.\nPreheat an oven to 325 degrees F (165 degrees C). Butter a 10x15 inch baking dish.\nStir together 3/4 cup sugar, 1/2 teaspoon cinnamon, nutmeg, and ground walnuts until evenly blended; set aside.\nPress 2 sheets of phyllo into the prepared dish and brush with melted butter. Continue adding phyllo sheets brushed with butter two at a time until you have 12 sheets total. Sprinkle 1/3 of the walnut mixture evenly over the phyllo, then add another 6 sheets, buttering between every two. Sprinkle 1/2 of the remaining walnut mixture evenly over the phyllo; top with another 6 buttered phyllo sheets. Finally, sprinkle the remaining walnut mixture onto the phyllo. Place the remaining phyllo on top of the baklava, buttering every two sheets. Brush the remaining butter onto the top of the baklava.\nBake in the preheated oven until the phyllo is golden brown and crispy, about 1 hour. Remove from the oven; pour the cooled syrup over the hot baklava. Cool to room temperature before cutting into 1-inch squares or diamonds to serve.",
    "pt": "45 m",
    "ct": "1 h ",
    "tt": "3 h",
    "i": "4460091.jpg",
    "o": "",
    "st": "allrecipes"
}