{
    "id": 149194,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil",
        "1 onion, halved and sliced",
        "2 mangos - peeled, seeded, and cubed",
        "2 tablespoons lemon juice",
        "1 tablespoon white sugar",
        "1/4 teaspoon ground ginger",
        "1/8 teaspoon ground cinnamon",
        "1/8 teaspoon ground mace",
        "4 skinless, boneless chicken breast halves - cut in half lengthwise",
        "salt and pepper to taste",
        "1 tablespoon vegetable oil",
        "1/4 cup chopped pecans"
    ],
    "nut": [
        "Calories > 331 kcal",
        "Carbs > 25 g",
        "Cholesterol > 67 mg",
        "Fat > 14.9 g",
        "Protein > 26 g",
        "Sodium > 62 mg"
    ],
    "n": "Mango-Pecan Chicken",
    "a": "morble",
    "r": "0",
    "s": 4,
    "des": "\"The recipes I found for mango chicken seemed to overwhelm the mangoes with citrus juices. Here's my version, which I believe keeps the flavor of fresh mango in focus. Garnish with a sprig of fresh parsley and serve with plain white rice.\"",
    "ins": "Heat 1 tablespoon vegetable oil in a large saucepan over medium heat. Add onion; cook and stir until the onion softens and turns translucent, about 5 minutes. Add mangos, lemon juice, sugar, ginger, cinnamon, and mace. Bring to a simmer and cook for 5 minutes, stirring constantly. Turn heat to low, cover, and allow to cook 5 minutes more.\nWhile the mango sauce is simmering, season chicken breasts with salt and pepper to taste. Heat remaining 1 tablespoon vegetable oil in a large skillet over medium heat. Add chicken, and cook on both sides until nicely browned, and the chicken is no longer pink in the center, about 8 minutes per side.\nTo serve, place one or two pieces of chicken onto each serving plate. Spoon mango sauce over the top, and sprinkle with pecans.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "1356682.jpg",
    "o": "",
    "st": "allrecipes"
}