{
    "id": 149240,
    "old_rating": "4.54545",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large, maple grilling plank",
        "4 (6 ounce) boneless pork loin chops, about 2 inches thick",
        "2 tablespoons butter",
        "1 onion, chopped",
        "1 tablespoon chopped garlic",
        "1 stalk celery, chopped",
        "2 cups fresh spinach leaves",
        "1 (14.5 ounce) can chicken broth",
        "2 cups garlic seasoned croutons",
        "1/2 cup shredded Italian cheese blend",
        "2 tablespoons freshly grated Parmesan cheese",
        "2 teaspoons fresh rosemary, chopped",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 344 kcal",
        "Carbs > 15.9 g",
        "Cholesterol > 83 mg",
        "Fat > 19.5 g",
        "Protein > 27.5 g",
        "Sodium > 435 mg"
    ],
    "n": "Maple Plank-Grilled Italian Stuffed Pork Chops",
    "a": "yankeesfan",
    "r": "0",
    "s": 4,
    "des": "\"Thick pork chops stuffed with spinach, croutons, and Italian cheeses are grilled on a maple plank. Delicious! I serve these with steamed broccoli and glasses of chilled Riesling.\"",
    "ins": "Preheat outdoor grill for medium-high heat. Prepare a maple grilling plank by soaking in water according to manufacturer's directions.\nPlace the pork chops on a clean, flat surface, and cut from one side through the middle to within one-half inch of the other side. Open the two sides and spread them out like an open book. Set aside until needed.\nMelt the butter in a large skillet over medium-high heat. Stir in the onion, garlic, and celery; cook and stir until the onion is soft and transparent, about 5 minutes. Add the spinach, and cook until wilted, 3 to 5 minutes. Pour in the chicken broth, and add the croutons: stir until croutons absorb the broth. Remove from heat, and stir in the Italian cheese blend and the Parmesan cheese. Spoon the vegetable-cheese mixture into the pockets of each pork chop. Close one side of the pork chop over the filling. Place pork chops on the prepared grilling plank. Sprinkle with fresh rosemary, and season with salt and pepper to taste.\nCover and grill, turning once, until pork chops are no longer pink in the center and juices run clear, about 30 minutes.",
    "pt": "20 m",
    "ct": "38 m",
    "tt": "58 m",
    "i": "85514.jpg",
    "o": "",
    "st": "allrecipes"
}