{
    "id": 149514,
    "old_rating": "4.76471",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups chicken broth",
        "1/2 teaspoon saffron threads, crumbled",
        "1 1/2 cups Arborio rice",
        "sea salt and pepper to taste",
        "1/4 cup extra-virgin olive oil",
        "1 onion, minced",
        "3 cloves garlic, minced",
        "1 cup white wine",
        "2 cups chopped fresh spinach",
        "2 tablespoons butter",
        "1 1/2 cups grated Parmesan cheese",
        "8 ounces mozzarella cheese, cut into 1/2 inch cubes",
        "2 cups all-purpose flour",
        "2 eggs, lightly beaten",
        "2 cups seasoned bread crumbs",
        "vegetable oil for deep frying"
    ],
    "nut": [
        "Calories > 617 kcal",
        "Carbs > 66.4 g",
        "Cholesterol > 71 mg",
        "Fat > 27.2 g",
        "Protein > 21.2 g",
        "Sodium > 861 mg"
    ],
    "n": "Spinach Arancini",
    "a": "NM Dawn",
    "r": "0",
    "s": 10,
    "des": "\"I used to live in Sicily, and these were a favorite of mine! 'Arancini' means 'Little Oranges' in Italian, named so because the little breaded rice balls resemble small oranges so much. While so many versions include only cheeses and meats, this version is a delightful combination of white cheese and spinach.  We love it! This can be made the night or a couple of days ahead of time, and cooked at the last minute for a surprising treat for guests. I like to serve mine on a bed of fresh Radicchio. Some people enjoy dipping them into Marinara or sour cream based dips.  Enjoy!\"",
    "ins": "Bring 4 cups chicken broth and saffron threads to a boil in a saucepan over high heat. Stir in Arborio rice, return to a boil, then reduce heat to medium-low, cover, and simmer until the rice is tender, yet still a little firm, about 16 minutes.\nHeat olive oil in a large saucepan over medium heat. Stir in onion, and cook for one minute, then stir in garlic, and continue cooking until the onion has softened and turned translucent, about 3 minutes. Stir in wine, spinach, and butter, and bring to a boil. Reduce heat to medium-low, and fold in cooked rice and Parmesan cheese; cook a few minutes until the mixture is a little stiff. Spread onto a baking sheet, and cool in the refrigerator until completely cold, 4 hours to overnight.\nOnce the rice mixture has cooled, form the arancini by enclosing a cube of mozzarella cheese in about 3 tablespoons of the rice to form a 1 inch ball; set aside. When you have finished making the balls, place flour, eggs, and bread crumbs into separate, shallow bowls. One-by-one, gently roll the arancini in the flour to coat, then shake off excess. Dip into beaten egg, then roll in bread crumbs; set aside.\nHeat the oil in a deep-fryer or electric skillet to 350 degrees F (175 degrees C).\nDeep fry the arancini 5 or 6 at a time in the hot oil until golden brown, about 4 minutes. Be sure to roll the arancini around with a metal spoon as they cook so they are evenly browned on all sides. Drain on paper towels, and serve hot.",
    "pt": "45 m",
    "ct": "40 m",
    "tt": "5 h ",
    "i": "621722.jpg",
    "o": "",
    "st": "allrecipes"
}