{
    "id": 149780,
    "old_rating": "4.14583",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons garlic, minced",
        "1/2 teaspoon prepared horseradish",
        "1 teaspoon hot pepper sauce",
        "1 teaspoon dried thyme",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "2 teaspoons Cajun seasoning",
        "2 tablespoons olive oil",
        "2 tablespoons malt vinegar",
        "2 pounds beef eye of round roast"
    ],
    "nut": [
        "Calories > 148 kcal",
        "Carbs > 1.1 g",
        "Cholesterol > 36 mg",
        "Fat > 9.7 g",
        "Protein > 13.4 g",
        "Sodium > 311 mg"
    ],
    "n": "Cajun Roast Beef",
    "a": "JUSTCYN",
    "r": "0",
    "s": 8,
    "des": "\"Not being from the Gulf Coast but living here now, I love the Cajun Roast Beef you can get in the delis right alongside the regular. Distinctively garlicky, I wanted to try roasting it in my own kitchen but found few recipes. Here's my version. It's not spicy, but it has the garlic and thyme that meld to make the savory, regional flavor. We like to serve the beef on toasted rolls with garlic mayonnaise.\"",
    "ins": "Stir the garlic, horseradish, hot pepper sauce, thyme, salt, pepper, Cajun seasoning, olive oil, and malt vinegar together in a bowl until thoroughly blended.\nPierce the beef roast all over with a meat fork. Place the roast in a large, resealable plastic bag. Spoon in  the marinade and turn the roast so it's well coated. Refrigerate overnight, turning occasionally if desired.\nWhen ready to cook, place the roast in a slow cooker along with any remaining marinade. Do not add water. Roast on Low for 8 to 10 hours, or until desired doneness. For medium-rare, a meat thermometer should read 135 degrees F (57 degrees C). Remove from the slow cooker to a serving plate, and allow to rest 15 minutes before slicing across the grain.",
    "pt": "15 m",
    "ct": "8 h",
    "tt": "16 h ",
    "i": "219734.jpg",
    "o": "",
    "st": "allrecipes"
}