{
    "id": 149738,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package rotini pasta, uncooked",
        "2 tablespoons butter",
        "3 tablespoons extra-virgin olive oil",
        "2 cups broccoli florets, finely chopped",
        "2 tablespoons all-purpose flour",
        "1 cup chicken broth",
        "1 cup milk",
        "salt and pepper to taste",
        "1/8 teaspoon chipotle chile powder (optional)",
        "2 cups Cheddar cheese, shredded",
        "1/4 cup onion, finely diced",
        "1 pound ground chicken",
        "1 cup sour cream (optional)"
    ],
    "nut": [
        "Calories > 781 kcal",
        "Carbs > 65.6 g",
        "Cholesterol > 125 mg",
        "Fat > 38.3 g",
        "Protein > 42.1 g",
        "Sodium > 470 mg"
    ],
    "n": "Creamy Chicken and Broccoli Casserole",
    "a": "Jill P",
    "r": "0",
    "s": 6,
    "des": "\"This casserole is a hit with my whole family. Even my children enjoy eating their broccoli with this homemade meal.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Add rotini pasta and cook until al dente, 7 to 10 minutes. Drain, cover, and set aside until needed.\nMelt butter in a saucepan over medium-high heat, and stir in 1 tablespoon olive oil. Add 1 cup broccoli; toss and cook just until tender, about 5 minutes. Sprinkle broccoli with flour, and cook 1 minute. Stir in the chicken broth, and bring to a boil. Pour in the milk, and stir to blend. Season with salt, pepper, and chipotle pepper powder, if desired. Reduce heat to medium, and simmer mixture until sauce thickens, 8 to 10 minutes. Mix in 1 cup Cheddar cheese and stir until melted. Remove from heat.\nHeat the remaining 2 tablespoons olive oil in another large skillet over medium-high heat. Stir in the onion, ground chicken, and remaining 1 cup of broccoli. Cook and stir until chicken is evenly browned and no longer pink, about 10 minutes. Season to taste with salt and pepper. Reduce heat, and cook until liquid is reduced, about 5 minutes.\nPreheat oven broiler to High. Lightly grease 9x13 inch baking dish.\nToss the pasta with the broccoli sauce until evenly blended. Stir in the sour cream, if desired. Stir the broccoli sauce mixture into the chicken mixture. Spoon into the prepared baking dish. Top with remaining 1 cup Cheddar cheese.\nCook under preheated broiler until cheese melts and browns around the edges, 3 to 5 minutes.",
    "pt": "15 m",
    "ct": "39 m",
    "tt": "54 m",
    "i": "1553834.jpg",
    "o": "4529115.jpg,4508061.jpg,4476488.jpg,4467202.jpg,3998677.jpg,3487465.jpg",
    "st": "allrecipes"
}