{
    "id": 149756,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup chopped fresh cilantro",
        "1/4 cup chopped fresh parsley",
        "1/4 cup chopped fresh mint",
        "4 cloves garlic, minced",
        "1/4 cup chopped Moroccan preserved lemon",
        "1 tablespoon olive oil",
        "ground black pepper to taste",
        "1 (7 bone) rack of lamb, trimmed and frenched",
        "1/4 cup slivered kalamata olives",
        "1 red bell pepper, thinly sliced"
    ],
    "nut": [
        "Calories > 425 kcal",
        "Carbs > 5.1 g",
        "Cholesterol > 95 mg",
        "Fat > 35 g",
        "Protein > 21.6 g",
        "Sodium > 1027 mg"
    ],
    "n": "Lamb Chops with Preserved Lemon (Moroccan Style)",
    "a": "Craig Nanango",
    "r": "0",
    "s": 4,
    "des": "\"The preserved lemon in this extremely tasty dish brings out the full flavor of the lamb! I serve these lamb chops on a bed of couscous, with tabbouleh as a side dish. Enjoy with a wine of your choice, keeping in mind that this dish is quite spicy and has the tang of the preserved lemon. Personally I'd prefer a medium white such as chardonnay or even a Mosel. A mild to sweet red wine would also be great.\"",
    "ins": "Stir cilantro, parsley, and mint together in a small saucepan. Remove half of the herb mixture, and set aside. Stir the garlic, lemon, olives, olive oil, and black pepper into the remaining herbs. Spread 2 tablespoons of this mixture onto the lamb rack. Wrap the exposed bones with aluminum foil to keep them from burning. Stir the olives and bell pepper into the reserved mixture and keep warm over low heat.\nPreheat an outdoor grill for medium heat.\nCook the lamb rack on the preheated grill until cooked to desired degree of doneness, about 4 minutes per side for medium-rare. Baste occasionally with the warmed relish. Once cooked, remove from grill, and allow to rest for 5 minutes before slicing into individual chops.\nTo serve, arrange lamb chops on a platter, spoon some of the warmed relish over them, and sprinkle with the reserved chopped herbs.",
    "pt": "35 m",
    "ct": "15 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}