{
    "id": 149844,
    "old_rating": "4.64706",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 heads   Belgian endive, trimmed",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "1 cup milk",
        "1 cup grated Gruyere cheese, divided",
        "2 teaspoons grated Parmesan cheese",
        "1/4 teaspoon ground nutmeg, or amount to taste",
        "salt and ground black pepper to taste",
        "8 slices deli-style ham",
        "1/4 cup chopped fresh parsley"
    ],
    "nut": [
        "Calories > 207 kcal",
        "Carbs > 20.4 g",
        "Cholesterol > 29 mg",
        "Fat > 10.1 g",
        "Protein > 12.8 g",
        "Sodium > 259 mg"
    ],
    "n": "Belgian Endive au Gratin",
    "a": "gaidgin",
    "r": "0",
    "s": 8,
    "des": "\"Belgian endive (called 'witloof' in Dutch or 'chicon' in Belgian French) has an ivory-white head with pale yellow-edged, closely wrapped leaves, a mildly bitter flavor, and tender juicy texture.\"",
    "ins": "Lightly grease a baking dish.\nBring a large pot of lightly salted water to a boil over medium-high heat. Place the endives into the water. Cover, and cook until tender, 5 to 10 minutes.\nPlace the butter into a saucepan, and melt over medium heat. Whisk in the flour, and stir until the mixture becomes paste-like and golden brown. Gradually whisk the milk into the flour mixture, whisking constantly until thick and smooth. Stir in 3/4 cup Gruyere cheese, Parmesan cheese, nutmeg, salt, and  pepper until well blended. Cook gently over medium-low heat for 10 minutes, stirring frequently.\nPreheat an oven broiler to low.\nDrain the endives. Wrap each endive with a slice of ham, and place into the prepared baking dish. Pour the cheese sauce over the endives. Sprinkle with the remaining 1/4 cup Gruyere cheese and parsley.\nCook the endives under preheated broiler until cheese is golden brown and sauce bubbles, about 10 minutes.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "4099227.jpg",
    "o": "",
    "st": "allrecipes"
}