{
    "id": 149837,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup regular rolled oats",
        "2/3 cup almonds",
        "1/4 cup vegetable oil",
        "1/2 cup butter, room temperature",
        "1/4 cup molasses",
        "1/4 cup turbinado sugar",
        "1 egg",
        "1 teaspoon baking soda",
        "1 1/4 cups whole wheat flour",
        "1/4 cup unsweetened dried coconut",
        "1 cup unsweetened carob chips"
    ],
    "nut": [
        "Calories > 130 kcal",
        "Carbs > 12.7 g",
        "Cholesterol > 14 mg",
        "Fat > 8 g",
        "Protein > 2.5 g",
        "Sodium > 93 mg"
    ],
    "n": "Molasses Carob Chip Cookies",
    "a": "B. Maitreya",
    "r": "0",
    "s": 30,
    "des": "\"A rich-tasting natural alternative to the usual peanut-butter chocolate chip cookie, this recipe calls for natural sweeteners and whole grains in place of refined white flour and white sugar. You'll find these ingredients in the natural food aisle of large grocery stores or your local health food store, and buy organic wherever possible. YOU are worth the effort to collect these ingredients and try this cookie! Substitute cashews or peanuts for almonds, if desired.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease 2 baking sheets.\nPlace oats into the bowl of a food processor. Process until finely chopped. Pour ground oats back into measuring cup, and add more oats to make a full cup. Set aside.\nPlace almonds and vegetable oil into the bowl of a food processor. Process until smooth and paste-like. Scrape almond mixture into a mixing bowl. Add the butter, molasses, turbinado sugar, and egg to the mixing bowl with the nut mixture; beat ingredients together until well blended. Stir in baking soda, oats, whole wheat flour, coconut, and carob chips, and blend thoroughly. Drop by teaspoonfuls 2 inches apart on prepared baking sheets.\nBake in preheated oven until tops set and look dry, about 7 minutes. Remove from oven and transfer to racks to cool.",
    "pt": "20 m",
    "ct": "7 m",
    "tt": "27 m",
    "i": "3696194.jpg",
    "o": "",
    "st": "allrecipes"
}