{
    "id": 149950,
    "old_rating": "4.45455",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 slices bacon",
        "1 teaspoon olive oil",
        "1 teaspoon garlic, minced",
        "1 pinch red pepper flakes, or to taste",
        "3 tomatoes - peeled, seeded and chopped",
        "5 artichoke hearts, drained and chopped",
        "1/4 cup chopped kalamata olives",
        "1 tablespoon capers, rinsed and drained",
        "salt and pepper to taste",
        "2 cups uncooked rigatoni pasta",
        "2 ounces crumbled feta cheese, for topping",
        "1/4 cup chopped fresh flat-leaf parsley, for garnish"
    ],
    "nut": [
        "Calories > 534 kcal",
        "Carbs > 67.8 g",
        "Cholesterol > 40 mg",
        "Fat > 20.7 g",
        "Protein > 22.2 g",
        "Sodium > 1261 mg"
    ],
    "n": "Rigatoni alla Puttanesca e Arrabbiata",
    "a": "Kelly",
    "r": "0",
    "s": 2,
    "des": "\"A combination of Puttanesca and Arrabbiata sauces, plus a few added ingredients, this dish makes a great main course. It's also fun to experiment with this recipe. I used rigatoni, but any pasta would work well.\"",
    "ins": "Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain on paper towels, and crumble into large pieces.\nMeanwhile, bring a large pot of lightly salted water to a boil. Add the rigatoni pasta and cook until al dente, about 13 minutes. Drain, and place pasta into a large bowl.\nPlace olive oil in another skillet, and heat over medium-high heat. Stir in the garlic, and cook until fragrant, about 1 minute. Mix in the bacon, red pepper flakes, tomatoes, artichokes, olives, and capers. Cook and stir until heated through, about 5 minutes. Season to taste with salt and pepper.\nAdd bacon-vegetable mixture to pasta, and toss until evenly mixed. Divide between two serving plates. Sprinkle with feta cheese, and garnish with parsley. Serve immediately.",
    "pt": "25 m",
    "ct": "18 m",
    "tt": "43 m",
    "i": "943450.jpg",
    "o": "",
    "st": "allrecipes"
}