{
    "id": 149902,
    "old_rating": "2.90909",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound ground beef sirloin",
        "1 tablespoon Worcestershire sauce",
        "1/2 cup buffalo wing sauce",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon sea salt",
        "1 teaspoon garlic powder",
        "2 tablespoons olive oil",
        "1/2 cup sweet onion, sliced",
        "1/4 cup barbeque sauce",
        "4 hamburger buns, split",
        "1/4 cup Additional ketchup",
        "1/2 cup grated Asiago cheese",
        "8 slices cooked bacon"
    ],
    "nut": [
        "Calories > 795 kcal",
        "Carbs > 40.5 g",
        "Cholesterol > 135 mg",
        "Fat > 48 g",
        "Protein > 48.4 g",
        "Sodium > 3414 mg"
    ],
    "n": "Kerry's Asiago Cheese Hamburger",
    "a": "CALLY5",
    "r": "0",
    "s": 4,
    "des": "\"This burger is savory, moist, and slightly spicy with the sumptuous flavor of Asiago cheese. I made this up for my husband's birthday. It is always a challenge between us to cook the best burger. I think mine is in the lead so far. Do you agree?\"",
    "ins": "Mix the beef, Worcestershire sauce, buffalo wing sauce, pepper, salt, and garlic powder in a large bowl. Form mixture into four patties. Place the patties on a plate; cover. Refrigerate for at least 1 hour.\nPreheat an outdoor grill for high heat.\nHeat the olive oil in a skillet over medium-high heat. Cook and stir the onion in the olive oil until translucent, about 5 minutes; set aside.\nCook the beef patties on the preheated grill on one side for about 5 minutes; brush the top of each burger with 1 tablespoon of barbeque sauce; flip. Cook burgers until well done, or the internal temperature reaches 180 degrees F (85 degrees C), about five minutes more.\nPlace one burger on the bottom half of each bun. Top each burger with cooked onions, ketchup, Asiago cheese, and bacon slices; sandwich with top of bun and serve.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "836141.jpg",
    "o": "",
    "st": "allrecipes"
}