{
    "id": 15001,
    "old_rating": "3.96",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (4 pound) whole chicken",
        "salt and pepper to taste",
        "1/2 cup hot pepper jelly",
        "1 cup butter"
    ],
    "nut": [
        "Calories > 988 kcal",
        "Carbs > 17.5 g",
        "Cholesterol > 308 mg",
        "Fat > 76.3 g",
        "Protein > 56.7 g",
        "Sodium > 437 mg"
    ],
    "n": "Sweet and Spicy Baked Chicken",
    "a": "Angie",
    "r": "0",
    "s": 6,
    "des": "\"Tastes great and looks good, too. Uses hot pepper jelly and butter as a basting sauce; this bird really is both sweet AND spicy! (Note: Watch the bird closely during baking; the sugar in the jelly makes it a beautiful rich, brown color but can also burn it! If the bird is browning too quickly, cover with an aluminum foil tent and continue baking. Test for doneness by cutting into the thigh or wiggling the leg to see if the bone moves easily.)\"",
    "ins": "To Prepare Chicken: Remove giblets and set aside for another use. Rinse chicken in cold water and pat dry with paper towels. Pull front skin down over neck cavity and tuck under chicken. Fold wings under breast, and tie legs and tail together securely with kitchen twine or string.\nPreheat oven to 400 degrees F (200 degrees C).\nPlace chicken on rack in roasting pan. Season with salt and pepper to taste. Melt jelly and 1/2 cup butter or margarine together in a small saucepan or in the microwave. Melt the remaining 1/2 cup butter or margarine separately.\nBake chicken in preheated oven for 15 minutes. Reduce heat to 375 degrees F (190 degrees C) and baste with melted plain butter or margarine. Bake for another 30 minutes, basting often with the plain butter or margarine. Then baste liberally with the melted jelly/butter mixture and bake for another 15 minutes. Remove from oven and allow to cool 10 minutes before cutting and serving.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "604214.jpg",
    "o": "",
    "st": "allrecipes"
}