{
    "id": 150246,
    "old_rating": "3.96429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 tablespoons vegetable oil",
        "salt and pepper to taste",
        "3 (6 ounce) flat iron steaks",
        "3 shallots, thinly sliced",
        "6 cloves garlic, peeled",
        "4 cups sliced white mushrooms",
        "1/4 cup balsamic vinegar",
        "3/4 cup full-bodied red wine"
    ],
    "nut": [
        "Calories > 567 kcal",
        "Carbs > 18.1 g",
        "Cholesterol > 116 mg",
        "Fat > 33.6 g",
        "Protein > 39.6 g",
        "Sodium > 128 mg"
    ],
    "n": "Flat Iron Steak with Mushrooms",
    "a": "your mom",
    "r": "0",
    "s": 3,
    "des": "\"Pan seared flat iron steaks are served with mushrooms and shallots in a balsamic red wine sauce. I like these steaks because they are tender, but not so lean that they get tough if you over cook them.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nHeat the oil in a large skillet over medium heat. Cut the flat iron steak into individual portions if needed. Season with salt and pepper on both sides. Fry the steaks until browned on each side, 2 to 3 minutes per side. Remove from the skillet and place in an oven proof dish. Set steaks in the oven to continue cooking.\nAdd shallots and whole cloves of garlic to the hot skillet. Cook and stir over medium heat until shallots are starting to brown. Add mushrooms to the pan; cook and stir until they shrink some, 5 to 10 minutes.\nPour the balsamic vinegar into the pan with the mushrooms and stir to remove any bits that are stuck to the bottom of the skillet. Pour in the red wine and simmer for a few minutes over medium heat.\nReturn the steaks to the skillet and cook until the internal temperature reaches 135 degrees to 140 degrees F (60 degrees C), about 5 minutes if at all. Remove the whole pan from the heat and let stand until steaks reach an internal temperature of 145 degrees F (63 degrees C), or your desired degree of doneness.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "791972.jpg",
    "o": "",
    "st": "allrecipes"
}