{
    "id": 150362,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound baking potatoes, peeled and diced",
        "1 pinch ground nutmeg",
        "4 teaspoons butter",
        "1 egg yolk",
        "1 cup vegetable oil for frying",
        "1/3 cup freshly grated Parmesan cheese",
        "1/3 cup frozen chopped spinach, thawed and drained",
        "1/2 cup all-purpose flour",
        "3 eggs, beaten",
        "1 tablespoon peanut oil",
        "1 1/3 cups dry bread crumbs"
    ],
    "nut": [
        "Calories > 289 kcal",
        "Carbs > 33.8 g",
        "Cholesterol > 119 mg",
        "Fat > 12.7 g",
        "Protein > 10.2 g",
        "Sodium > 264 mg"
    ],
    "n": "Potato and Spinach Croquettes",
    "a": "Tonmere",
    "r": "0",
    "s": 7,
    "des": "\"Yummy fried croquettes are made with potatoes, spinach and Parmesan cheese.\"",
    "ins": "Place the potatoes into a saucepan and fill with enough water to cover. Bring to a boil, then reduce the heat and simmer until tender enough to easily pierce with a fork. Drain and toss gently over low heat for a minute to completley dry out. Press them through a sieve or just mash with a potato masher until smooth. Season with salt, pepper and nutmeg. Mix in the butter and egg yolk, then spread out on a tray to cool.\nPreheat the oil in a deep-fryer to 365 degrees F (180 degrees C). The oil is the proper temperature when a cube of bread browns in about 15 seconds.\nIn a large bowl, mix together the Parmesan cheese and spinach. Blend in the mashed potatoes. On a floured surface, using floured hands, roll small handfuls of the mixture into cylinders about 3/4 inch thick and 2 1/2 inches long. Tap the ends to flatten.\nSeason 1/2 cup of flour with salt and pepper and place on a tray. In a shallow bowl, whisk together the eggs and peanut oil. Place the bread crumbs into a separate shallow bowl. Roll the croquettes in seasoned flour, then dip into the egg and then coat with bread crumbs.\nFry the croquettes a few at a time, so they have some room in between, until golden brown, 5 to 6 minutes. Carefully remove from the oil using a slotted spoon and drain on crumpled paper towels.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "1019674.jpg",
    "o": "",
    "st": "allrecipes"
}