{
    "id": 150725,
    "old_rating": "4.51351",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 stalk celery, chopped",
        "3 carrots, peeled and chopped",
        "1 parsnip, peeled and diced",
        "1 small rutabaga, chopped",
        "1/4 cup frozen green peas",
        "1 pound ground lamb",
        "1 onion, chopped",
        "1 clove garlic, chopped",
        "1 (8 ounce) can tomato sauce",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon dried thyme",
        "1/4 teaspoon dried sage",
        "1/2 cup milk, or as needed",
        "3 cups prepared mashed potatoes",
        "2 tablespoons grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 476 kcal",
        "Carbs > 51.4 g",
        "Cholesterol > 84 mg",
        "Fat > 18.1 g",
        "Protein > 27.5 g",
        "Sodium > 1529 mg"
    ],
    "n": "Whitechapel Shepherd's Pie",
    "a": "G.G.",
    "r": "0",
    "s": 4,
    "des": "\"This comfort food casserole is guaranteed to warm you over. It originates from eating establishments that serve those seeking respite from the streets of London. It's so hearty, you won't even realize its mostly vegetables.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nPlace the celery, carrots, parsnip, rutabaga, and peas into a large saucepan and fill with 1 inch of water. Bring to a boil, cover, and steam for 15 minutes, or until vegetables are tender.\nMeanwhile, crumble the ground lamb into a large skillet set over medium heat. Add onion and garlic; cook and stir until lamb is no longer pink. Drain off any grease. Stir in the steamed vegetables and tomato sauce. Season with salt, pepper, thyme and sage. Transfer everything to a greased 7x11 inch baking dish.\nMix enough milk into the mashed potatoes to make them spreadable. Spread them over the top of the casserole and garnish with a sprinkling of Parmesan cheese.\nBake for 25 minutes in the preheated oven, until the top is browned and the casserole is heated through.",
    "pt": "45 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "71599.jpg",
    "o": "4090604.jpg,1880955.jpg,744965.jpg,744964.jpg,744963.jpg,140341.jpg",
    "st": "allrecipes"
}