{
    "id": 150817,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "30 eggs",
        "1 cup white sugar",
        "1 cup light brown sugar",
        "1 cup dark brown sugar",
        "1 tablespoon allspice",
        "1 teaspoon ground mace",
        "1 teaspoon ground ginger",
        "1 teaspoon ground cloves",
        "1 tablespoon freshly ground nutmeg",
        "1 tablespoon freshly ground cinnamon stick",
        "1/2 cup pure vanilla extract",
        "1 teaspoon Angostura bitters",
        "1 cup bourbon or blended whiskey",
        "1 (750 milliliter) bottle dark rum",
        "1 (750 milliliter) bottle almond-flavored liqueur, such as Amaretto",
        "1 (750 milliliter) bottle brandy",
        "6 quarts heavy cream"
    ],
    "nut": [],
    "n": "New Orleans Creole Eggnog",
    "a": "AUNTIESGRISGRIS",
    "r": "0",
    "s": 48,
    "des": "\"This eggnog is great for a crowd during the holiday season. It's very rich so a little goes a long way. Usually, 4 to 6 ounces per person is enough for a serving. The best part is that you can alter the liquors you like or make it without any liquor, too. Use brandy, or substitute Calvados, Cognac, Frangelico, Godiva, or Praline. Have a 4 gallon bowl or container handy to mix the eggnog, and plan to make this 30 days before your party so it seasons well.\"",
    "ins": "Beat the eggs with the white sugar, and light and dark brown sugars in a stand mixer until completely blended. Strain the mixture through a fine mesh sieve into a bowl. Stir in the allspice, mace, ginger, cloves, nutmeg, cinnamon, and vanilla.\nPour the bitters, bourbon, rum, almond-flavored liqueur, and brandy into a large, 4 gallon bowl or food safe bucket. Stir in the egg mixture until thoroughly blended. Pour in the heavy cream and continue stirring. Divide into smaller containers and refrigerate. Shake or stir the containers 2 to 4 times each day for 30 days.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}