{
    "id": 15093,
    "old_rating": "4.6057",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup white sugar",
        "2 tablespoons all-purpose flour",
        "3 tablespoons cornstarch",
        "1/4 teaspoon salt",
        "1 1/2 cups water",
        "2 lemons, juiced and zested",
        "2 tablespoons butter",
        "4 egg yolks, beaten",
        "1 (9 inch) pie crust, baked",
        "4 egg whites",
        "6 tablespoons white sugar"
    ],
    "nut": [
        "Calories > 298 kcal",
        "Carbs > 49.7 g",
        "Cholesterol > 110 mg",
        "Fat > 10.3 g",
        "Protein > 4.4 g",
        "Sodium > 229 mg"
    ],
    "n": "Grandma's Lemon Meringue Pie",
    "a": "Emilie S.",
    "r": "0",
    "s": 8,
    "des": "\"This is a very fun recipe to follow, because Grandma makes it sweet and simple. This pie is thickened with cornstarch and flour in addition to egg yolks, and contains no milk.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nTo Make Lemon Filling: In a medium saucepan, whisk together 1 cup sugar, flour, cornstarch, and salt. Stir in water, lemon juice and lemon zest. Cook over medium-high heat, stirring frequently, until mixture comes to a boil. Stir in butter. Place egg yolks in a small bowl and gradually whisk in 1/2 cup of hot sugar mixture. Whisk egg yolk mixture back into remaining sugar mixture. Bring to a boil and continue to cook while stirring constantly until thick. Remove from heat. Pour filling into baked pastry shell.\nTo Make Meringue: In a large glass or metal bowl, whip egg whites until foamy. Add sugar gradually, and continue to whip until stiff peaks form. Spread meringue over pie, sealing the edges at the crust.\nBake in preheated oven for 10 minutes, or until meringue is golden brown.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "4540039.jpg",
    "o": "4540039.jpg,4539059.jpg,4539058.jpg,4539053.jpg,4536876.jpg,4535840.jpg",
    "st": "allrecipes"
}