{
    "id": 150942,
    "old_rating": "4.21538",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil",
        "1/4 pound sliced fresh mushrooms",
        "1/4 pound snow peas",
        "1 (8 ounce) can sliced water chestnuts, drained",
        "1/4 pound sliced bok choy",
        "salt and black pepper to taste",
        "1 tablespoon vegetable oil",
        "1 teaspoon minced garlic",
        "1 teaspoon minced fresh ginger root",
        "3/4 cup skinless, boneless chicken breast meat - thinly sliced",
        "1 teaspoon white wine",
        "1/4 teaspoon white sugar",
        "1/4 cup chicken broth",
        "1 tablespoon cornstarch",
        "2 tablespoons water"
    ],
    "nut": [
        "Calories > 174 kcal",
        "Carbs > 13.2 g",
        "Cholesterol > 25 mg",
        "Fat > 8.4 g",
        "Protein > 12 g",
        "Sodium > 48 mg"
    ],
    "n": "Moo Goo Gai Pan II",
    "a": "Bao Le",
    "r": "0",
    "s": 4,
    "des": "\"While you may see this dish frequently at American Chinese restaurants, it is actually a true Cantonese dish. This is the Americanized version that will duplicate what you're used to eating for take-out. You can substitute sherry and soy sauce for the white wine to make a version with brown sauce.\"",
    "ins": "Heat 1 tablespoon of vegetable oil in a wok or large skillet over high heat. Stir in the mushrooms, snow peas, water chestnuts, and bok choy; season to taste with salt and pepper. Cook and stir until the vegetables are just tender, about 5 minutes. Remove the vegetables from the wok and wipe the wok clean.\nHeat the remaining 1 tablespoon of vegetable oil in the wok. Stir in the garlic and ginger; cook a few seconds until the garlic begins to turn golden brown. Stir in the chicken and cook until the chicken is no longer pink, about 5 minutes. Add the wine, sugar, and chicken broth; bring to a boil. Dissolve the cornstarch in the water and stir into the simmering sauce. Once the sauce returns to a simmer, stir until thick and clear, about 30 seconds. Return the vegetables to the wok and toss until hot and coated with the sauce.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "431473.jpg",
    "o": "4507966.jpg,4478798.jpg,3663648.jpg,3457635.jpg,2249442.jpg,1761298.jpg",
    "st": "allrecipes"
}