{
    "id": 151061,
    "old_rating": "4.60241",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound hot Italian sausage links",
        "1 (16 ounce) package rigatoni pasta",
        "1 (24 ounce) jar marinara sauce",
        "1 bulb fennel, trimmed and thinly sliced",
        "1 roasted red bell pepper, chopped",
        "1/2 yellow onion, chopped",
        "1/4 cup chopped fresh basil leaves",
        "2 cloves garlic, minced",
        "salt and pepper to taste",
        "1 cup shredded mozzarella cheese",
        "1/2 cup grated Parmesan cheese",
        "1/2 cup grated Asiago cheese"
    ],
    "nut": [
        "Calories > 499 kcal",
        "Carbs > 57.3 g",
        "Cholesterol > 52 mg",
        "Fat > 19.4 g",
        "Protein > 24.5 g",
        "Sodium > 1021 mg"
    ],
    "n": "Baked Rigatoni with Italian Sausage and Fennel",
    "a": "Boog",
    "r": "0",
    "s": 8,
    "des": "\"This is a deliciously sweet and spicy baked rigatoni recipe that I whipped up, and thought I'd share.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Add pasta and cook until almost tender, about 10 minutes.\nFry the sausages in a large skillet over medium heat, turning frequently until cooked through, about 15 minutes. Remove from the skillet, cool slightly and slice into rounds. Add the garlic, fennel and onion to the skillet and season with salt  and pepper. Cook and stir for about 5 minutes, then add the roasted red peppers, basil, sliced sausage and pasta sauce. Heat through over low heat until warmed.\nCombine the pasta with the sauce and vegetables in a 9x13 inch baking dish. Spread the mozzarella, Parmesan and Asiago cheeses over the top. Garnish with a few fennel leaves left from the bulb. Cover with aluminum foil.\nBake for 30 minutes in the preheated oven, then remove the aluminum foil. Set the oven to broil, and cook for another 5 minutes or until cheese is browned.",
    "pt": "25 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "423553.jpg",
    "o": "3699476.jpg,3601413.jpg,3453978.jpg,1796488.jpg,1543501.jpg,1100111.jpg",
    "st": "allrecipes"
}