{
    "id": 151514,
    "old_rating": "4.12",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "CriscoÂ® Original No-Stick Cooking Spray",
        "1 (18.25 ounce) package PillsburyÂ® Reduced Sugar Devils Food Cake",
        "2 large eggs",
        "2/3 cup CRISCOÂ® Canola Oil",
        "1 3/4 cups milk, divided",
        "1 (1 ounce) package sugar free, fat free instant vanilla pudding mix",
        "1 (8 ounce) package cream cheese, softened",
        "1 teaspoon imitation banana extract",
        "1 (8 ounce) container sugar free frozen whipped topping, thawed",
        "1 (11.75 ounce) jar Smucker'sÂ® Sugar Free Hot Fudge Spoonable Ice Cream Topping",
        "2 large bananas",
        "1 teaspoon lemon juice"
    ],
    "nut": [
        "Calories > 511 kcal",
        "Carbs > 64.7 g",
        "Cholesterol > 54 mg",
        "Fat > 28 g",
        "Protein > 6.6 g",
        "Sodium > 556 mg"
    ],
    "n": "Chocolate Banana Cream Cake",
    "a": "SMUCKER'SÂ®",
    "r": "0",
    "s": 12,
    "des": "\"Devil's food cake is layered with bananas and a creamy pudding mixture then drizzled with chocolate for a rich and elegant dessert.\"",
    "ins": "Heat oven to 350 degrees F. Spray bottom of a 9-inch round springform pan with no-stick cooking spray.\nBlend cake mix, eggs, oil and 3/4 cup milk in a medium bowl until moistened. Beat with an electric mixer on medium speed for 2 minutes. Spread batter evenly into prepared pan. Bake 38-42 minutes. Cool completely.\nBlend pudding mix with 1 cup cold milk. In another bowl, beat cream cheese until fluffy. Mix in pudding and banana extract. Blend in whipped topping. Remove 1 cup and reserve. Stir 2/3 cup fudge topping in small bowl until of spreading consistency. Slice bananas 1/4-inch thick. Dip 3 slices in lemon juice. Cover and reserve for garnish.\nRemove cake from pan. Cut in half horizontally. Cover bottom layer with fudge topping. Top with sliced bananas and remaining 3 cups pudding mixture. Cover with top cake layer. Spread 1 cup reserved pudding onto center of cake. Place 2 tablespoons fudge topping into a corner of a 1-quart resealable bag. Knead. Cut small corner off bag. Drizzle fudge topping over top of cake. Refrigerate at least 1 hour. Garnish with reserved banana slices just before serving.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "987780.jpg",
    "o": "1368149.jpg,1120168.jpg,594407.jpg,353087.jpg,330435.jpg,330423.jpg",
    "st": "allrecipes"
}