{
    "id": 151826,
    "old_rating": "4.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 carrots, peeled and grated",
        "2 apples - peeled, cored, and grated",
        "1 cup raisins (optional)",
        "1 cup fine bread crumbs",
        "1 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "2 teaspoons ground cinnamon",
        "1 teaspoon baking soda",
        "1 teaspoon salt",
        "1 teaspoon ground nutmeg",
        "1 teaspoon ground allspice",
        "2/3 cup butter",
        "1/2 cup white sugar",
        "4 eggs"
    ],
    "nut": [
        "Calories > 303 kcal",
        "Carbs > 43.6 g",
        "Cholesterol > 89 mg",
        "Fat > 12.8 g",
        "Protein > 5.7 g",
        "Sodium > 558 mg"
    ],
    "n": "Apple and Carrot Christmas Pudding",
    "a": "rosie",
    "r": "0",
    "s": 12,
    "des": "\"This is just like traditional Christmas pudding, but with less fat. The house smells great all day long. It's wonderful served with rum or cranberry sauce. For variations, try lemon or chocolate sauce. You can also line the mold with pecan halves or cranberries before filling. Be creative and add Christmas decorations to the plate before serving. The sky is the limit.\"",
    "ins": "Combine the carrots, apples, raisins, and bread crumbs in a bowl. Sift together the flour, baking powder, cinnamon, baking soda, salt, nutmeg, and allspice in a separate small bowl. Cream together the butter, sugar, and eggs in a separate large bowl; stir in the flour mixture. Add the carrot mixture and mix well. Transfer mixture to a lightly-greased, 2-quart mold.\nPlace a steamer rack in the bottom of a large, deep pot. Set the filled mold on top of the steamer rack. Pour enough water into the bottom of the pot to cover the bottom 2/3 of the mold. Bring to a boil over medium heat. Reduce heat to low; cover. Simmer for 2 hours 45 minutes, adding water occasionally to maintain the water level. Remove from water and allow to cool 10 minutes before turning out of mold onto a plate.",
    "pt": "30 m",
    "ct": "2 h ",
    "tt": "3 h ",
    "i": "3039395.jpg",
    "o": "",
    "st": "allrecipes"
}