{
    "id": 151997,
    "old_rating": "4.42373",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup olive oil",
        "1 medium onion, chopped",
        "1 tablespoon minced garlic",
        "1 teaspoon cumin seeds",
        "1 (15 ounce) can diced tomatoes",
        "1 (15 ounce) can coconut milk",
        "2 tablespoons ground coriander",
        "1 tablespoon salt",
        "1 tablespoon ground turmeric",
        "1 tablespoon cayenne pepper",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground ginger",
        "1 teaspoon ground cardamom",
        "3 large Yukon Gold potatoes, peeled and cubed",
        "1 medium head cauliflower, chopped into bite size pieces",
        "1 (15 ounce) can garbanzo beans, drained",
        "2 tablespoons garam masala"
    ],
    "nut": [
        "Calories > 622 kcal",
        "Carbs > 64 g",
        "Cholesterol > 0 mg",
        "Fat > 39.2 g",
        "Protein > 13.1 g",
        "Sodium > 2172 mg"
    ],
    "n": "Alicia's Aloo Gobi",
    "a": "Alicia",
    "r": "0",
    "s": 4,
    "des": "\"This is hands down the easiest and most delicious curry I have ever made. It's my own personal twist on Aloo Gobi, a traditionally dry Indian dish consisting of potatoes and cauliflower. The coconut milk adds the extra sauciness; my favorite part of curry. Serve with basmati rice or, better, with breads such as roti, naan, or pita.\"",
    "ins": "Heat oil in a large pot on medium-high heat and add onion. Cook until softened, about 4 minutes, then stir in garlic and cumin. Continue to cook until onion begins to brown.\nStir in tomatoes and coconut and  the coriander, salt, turmeric, cayenne pepper, cinnamon, ginger, and cardamom. Stir until mixture begins to boil, then put in the potatoes, cauliflower, and garbanzo beans. Blend well. Reduce heat to low and cover.\nSimmer until the potatoes are tender, 45 minutes to an hour (this will depend on the size of the potato chunks). Sprinkle in the garam masala, stir, and cook for an additional 5 minutes.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4528819.jpg",
    "o": "4122808.jpg,3604848.jpg,2825486.jpg,2693346.jpg,2216654.jpg,1559242.jpg",
    "st": "allrecipes"
}