{
    "id": 152103,
    "old_rating": "4.63636",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 medium zucchini, cut into chunks",
        "4 3/4 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1 1/2 teaspoons baking soda",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons ground cinnamon",
        "1 1/2 teaspoons ground nutmeg",
        "1 1/2 teaspoons ground cloves",
        "1 1/2 cups vegetable oil",
        "6 eggs",
        "4 cups white sugar"
    ],
    "nut": [
        "Calories > 242 kcal",
        "Carbs > 35.7 g",
        "Cholesterol > 31 mg",
        "Fat > 10.2 g",
        "Protein > 3 g",
        "Sodium > 184 mg"
    ],
    "n": "Zucchini Bread, Pumpkin Style",
    "a": "Paula Coley",
    "r": "0",
    "s": 36,
    "des": "\"Although I love zucchini bread, I wanted a new way to prepare it. After some thought I decided to try preparing it pumpkin bread style, since they are both in the squash family. I boiled my zucchini (skins attached), and then pureed it. It is so similar to pumpkin bread in texture, and the taste... it is out of this world. \"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Grease and flour 3 9x5 inch loaf pans, and set aside.\nPlace the zucchini chunks into a saucepan, and cover with water. Bring to a boil and cook until the zucchini are tender, about 5 minutes. Drain the zucchini, place them in a blender, and blend until they are pureed, about 2 minutes. Let the zucchini puree cool for about 10 minutes.\nMix the flour, baking powder, baking soda, salt, cinnamon, nutmeg, and cloves in a bowl, and stir to eliminate lumps.\nPlace the zucchini puree in a large bowl, and whisk in the oil, eggs, and sugar. Beat in the flour mixture to form a thick batter.\nDivide the batter evenly among the prepared loaf pans, and bake in the preheated oven until the tops are lightly browned and the loaves spring back when gently pressed, 45 minutes to 1 hour. A toothpick inserted into the center should come out clean. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "2534073.jpg",
    "o": "",
    "st": "allrecipes"
}