{
    "id": 15220,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups sunflower seeds",
        "1 cup all-purpose flour",
        "2 tablespoons ground black pepper",
        "14 boneless chicken thighs",
        "1 tablespoon olive oil",
        "1 (16 ounce) container sour cream",
        "1 (10.75 ounce) can  condensed cream of chicken soup",
        "1 (10.75 ounce) can  condensed cream of mushroom soup"
    ],
    "nut": [
        "Calories > 611 kcal",
        "Carbs > 20.7 g",
        "Cholesterol > 166 mg",
        "Fat > 43.3 g",
        "Protein > 33.5 g",
        "Sodium > 652 mg"
    ],
    "n": "Mystery Prize Chicken",
    "a": "Adam Pack",
    "r": "0",
    "s": 8,
    "des": "\"This rich, crunchy chicken is both easy and tasty! Serve hot over rice, if desired.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPut sunflower seeds and about 1/4 cup of the flour into a blender or food processor. Blend until some of the seeds are completely pulverized into flour, but some of the pieces are still large enough to be crunchy. Pour this mixture in a shallow dish or bowl and add the remaining 3/4 cup flour and the ground black pepper. Mix together.\nDredge the chicken in the flour mixture. Heat oil in a large skillet over medium high heat. Add the coated chicken and brown for about 1 to 2 minutes on each side. (Note: You're not cooking the chicken with this step, just 'crunchifying' the flour and sealing in the juices so that the chicken stays tender while cooking). Lay browned chicken pieces in a 9x13 inch baking dish.\nIn a medium bowl, mix together sour cream, cream of chicken soup and cream of mushroom soup. Pour this mixture over the chicken, making sure that it gets under and around all of the chicken pieces. Top with any remaining sunflower seed mixture.\nBake at 350 degrees F (175 degrees C) for 1 hour or until chicken is cooked through and juices run clear.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}