{
    "id": 15233,
    "old_rating": "4.39286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package lasagna noodles",
        "1 pound pork sausage",
        "2 pounds ricotta cheese",
        "3 (26 ounce) jars spaghetti sauce",
        "1 pound grated Parmesan cheese",
        "1 pound shredded mozzarella cheese",
        "1/2 pound spinach, rinsed and chopped"
    ],
    "nut": [
        "Calories > 575 kcal",
        "Carbs > 38.7 g",
        "Cholesterol > 87 mg",
        "Fat > 33.4 g",
        "Protein > 29.8 g",
        "Sodium > 1262 mg"
    ],
    "n": "Deadly Delicious Lasagna",
    "a": "Paul Kahl",
    "r": "0",
    "s": 18,
    "des": "\"This is possibly the most fattening, but also most delicious, lasagna ever!\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and lay noodles on a paper towel.\nIn a large skillet over medium heat, cook sausage, spicing to taste, until no longer pink, and reserve.\nIn a large bowl, mix the ricotta and 2 jars of spaghetti sauce. In a medium bowl, mix the Parmesan and mozzarella cheeses.\nStir all but one cup of the cheese mixture into the ricotta mixture; stir in the sausage and chopped spinach.\nPreheat oven to 425 degrees F (220 degrees C).\nCoat the bottom of a 9x13 inch baking dish with a thin layer of spaghetti sauce. Lay 3 to 4 noodles lengthwise and side by side; then lay 3 to 4 noodles overlapping and in a staggered pattern on top.\nAdd a generous layer of the sausage/cheese; repeat layers twice, until they have reach 1/2 inch from the top of the baking dish. Layer noodles on top of the lasagna and coat in the last jar of spaghetti sauce. Cover with last cup of cheese mixture and bake in preheated oven for 45 minutes or until golden brown. Slice and serve, and then see a dietician... It's deadly.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "12432.jpg",
    "o": "",
    "st": "allrecipes"
}