{
    "id": 152329,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon sesame oil",
        "1/2 cup soy sauce",
        "4 cloves garlic, chopped",
        "6 tablespoons honey",
        "1/4 teaspoon minced fresh ginger root",
        "4 large skinless, boneless chicken breast halves - cut into 1 inch strips",
        "1 (16 ounce) package spaghetti",
        "2 tablespoons butter, divided",
        "1 pinch salt and black pepper to taste",
        "1 onion, sliced"
    ],
    "nut": [
        "Calories > 890 kcal",
        "Carbs > 116.4 g",
        "Cholesterol > 154 mg",
        "Fat > 15.9 g",
        "Protein > 68.1 g",
        "Sodium > 1974 mg"
    ],
    "n": "Sweet Garlic Chicken",
    "a": "gourmet flossie",
    "r": "0",
    "s": 4,
    "des": "\"Requires preparing ahead of time, but very simple and well worth it! If you are a garlic fan, use 6-8 cloves of garlic for an extra kick!\"",
    "ins": "Whisk together the  sesame oil, soy sauce, garlic, honey, and ginger in a large glass or ceramic bowl. Add the chicken breast and toss to evenly coat. Cover the bowl with plastic wrap, and marinate in the refrigerator for 8 hours.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the spaghetti, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 12 minutes. Drain well in a colander set in the sink. Stir in 1 tablespoon of butter and season with salt and pepper.\nHeat the remaining 1 tablespoon of butter in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Remove the chicken from the marinade, and shake off excess, then add to the skillet. Discard the remaining marinade. Cook the chicken breast strips until no longer pink in the center, about 10 minutes. Serve chicken over spaghetti.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "8 h ",
    "i": "210632.jpg",
    "o": "",
    "st": "allrecipes"
}