{
    "id": 152572,
    "old_rating": "4.62857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 large eggplants, halved lengthwise",
        "1/4 cup olive oil",
        "1 pound ground lamb",
        "1 small onion, chopped",
        "1/2 green bell pepper, chopped",
        "3 cloves garlic, minced",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "1 teaspoon ground black pepper",
        "1 1/4 cups marinara sauce",
        "1 (8 ounce) package crumbled feta cheese",
        "2 eggs, beaten",
        "1/2 cup dry bread crumbs",
        "1/2 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 782 kcal",
        "Carbs > 46.8 g",
        "Cholesterol > 230 mg",
        "Fat > 49.3 g",
        "Protein > 41.2 g",
        "Sodium > 1247 mg"
    ],
    "n": "Eggplant Stuffed with Lamb and Feta",
    "a": "C Laughlin",
    "r": "0",
    "s": 4,
    "des": "\"Eggplant halves are stuffed with a flavorful mixture of lamb, feta, and spices. Complete this meal with a green salad and crusty bread - easy enough for any day of the week!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nBrush the cut surfaces of the eggplant halves with half of the olive oil. Place cut-side-up onto the baking sheet, and place into the oven. Bake the eggplant for 30 minutes until tender. Once done, remove and allow to cool slightly. Scoop out the flesh, leaving the shells 1/2 inch thick. Remove as many of the seeds as you can, then coarsely chop the flesh, and place into a large mixing bowl.\nMeanwhile, heat the remaining olive oil in a skillet over medium-high heat. Add the ground lamb, and cook for a few minutes until it begins to crumble. Stir in the onion, bell pepper, garlic, cinnamon, allspice, and black pepper. Cook until the onion has softened, and the lamb is no longer pink, about 5 minutes. Place the meat mixture into the bowl with the eggplant, and stir in the marinara sauce, feta cheese, eggs, and bread crumbs until well mixed.\nEvenly divide the lamb mixture into the eggplant shells, then return the eggplant to the oven. Bake for 10 minutes, then sprinkle with the mozzarella, and reduce the oven temperature to 375 degrees F (190 degrees C). Bake until the filling has set, and the mozzarella has turned golden brown, about 25 minutes more.",
    "pt": "35 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1013701.jpg",
    "o": "4536327.jpg,3350200.jpg,2879468.jpg,2403408.jpg,1077632.jpg,486224.jpg",
    "st": "allrecipes"
}