{
    "id": 152952,
    "old_rating": "4.47059",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup unsalted butter",
        "3/4 cup white sugar",
        "3 eggs",
        "1 teaspoon vanilla extract",
        "3 1/4 cups pastry flour",
        "1 teaspoon ground cinnamon",
        "1 teaspoon baking powder",
        "1 teaspoon instant espresso powder",
        "2 teaspoons grated orange zest",
        "1/2 cup chocolate chips",
        "1/2 cup dried apricots",
        "1/2 cup dried cranberries",
        "1/2 cup slivered almonds",
        "1 egg white, lightly beaten"
    ],
    "nut": [
        "Calories > 150 kcal",
        "Carbs > 25.4 g",
        "Cholesterol > 28 mg",
        "Fat > 5 g",
        "Protein > 3.3 g",
        "Sodium > 33 mg"
    ],
    "n": "Espresso Biscotti",
    "a": "Sophia Candrasa",
    "r": "0",
    "s": 24,
    "des": "\"These biscotti make a good Christmas gift! The combination of fruits, nuts, chocolate chips, and spices are prefect for any holiday season.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a cookie sheet or line it with parchment paper.\nCream together butter and sugar in a bowl until light and fluffy. Beat in eggs and vanilla.\nSift together the flour, cinnamon, and baking powder in a separate bowl. Mix dry ingredients into the egg mixture. Stir in the espresso powder, orange zest, chocolate chips, dried apricots, dried cranberries and almonds.\nShape dough into two equal logs approximately 12 inches long by 2 inches diameter. Place logs on baking sheet, and flatten out to about 1 inch thickness. Brush the log with egg wash.\nBake in the preheated oven until edges are golden and the center is firm, about 35 to 40 minutes. Remove from oven to cool on the pans. When loaves are cool enough to handle, use a serrated knife to slice the loaves diagonally into 1/2 inch thick slices.  Return the slices to the baking sheet.\nReduce oven temperature to 325 degrees F (165 degrees C). Bake until they start turning light brown, 15 to 20 minutes. Cool completely, and store in an airtight container at room temperature.",
    "pt": "25 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1823218.jpg",
    "o": "",
    "st": "allrecipes"
}