{
    "id": 153192,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large baking potato",
        "1 teaspoon vegetable oil",
        "1/2 teaspoon salt",
        "1 teaspoon butter",
        "3 tablespoons canned pizza sauce",
        "1/2 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 525 kcal",
        "Carbs > 70.4 g",
        "Cholesterol > 47 mg",
        "Fat > 17.9 g",
        "Protein > 21.9 g",
        "Sodium > 1811 mg"
    ],
    "n": "Kitchenless Pizza-Tato",
    "a": "Orange Crush",
    "r": "0",
    "s": 1,
    "des": "\"This is one of my favorite baked potato recipes adapted for small appliances when a full kitchen isn't available.  Great for students or those waiting on their kitchen to finally finish being remodeled.  It's fluffy on the inside, crispy on the outside and topped with pizza sauce and cheese.  It's tasty, cheap, quick, and easy.  You'll need a toaster oven and a microwave.\"",
    "ins": "Poke the potato a few times with a fork. Place the potato on a plate in the microwave. Cook at full power for 6 minutes, then let rest for 2 minutes.\nWhile the potato is cooking, preheat a toaster oven to 400 degrees F (200 degrees C). Coat the potato with oil and sprinkle with salt. Place the potato into the toaster oven so that it is sitting directly on the rack.\nBake for 10 minutes in the preheated toaster oven. Remove the potato and place it on the tray that comes with the toaster oven. Make a cut lengthwise that is about 1/4 of the way through the potato. It should pop open without splitting in half. Press the ends together slightly to open it up more and use a fork to fluff the interior while mixing in the butter. Spoon Pizza sauce over the potato and top with mozzarella cheese.\nReturn the potato (on the tray) to the toaster oven and cook for 10 more minutes, or until cheese is golden brown.",
    "pt": "5 m",
    "ct": "25 m",
    "tt": "32 m",
    "i": "699809.jpg",
    "o": "",
    "st": "allrecipes"
}