{
    "id": 15339,
    "old_rating": "4.53333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups vanilla wafer crumbs",
        "6 tablespoons butter, melted",
        "14 ounces individually wrapped caramels, unwrapped",
        "1 cup semisweet chocolate chips",
        "1 (5 ounce) can evaporated milk",
        "3 (1.4 ounce) bars chocolate covered English toffee",
        "4 (8 ounce) packages cream cheese",
        "1 1/2 cups white sugar",
        "4 eggs",
        "2 egg yolks",
        "2 tablespoons all-purpose flour",
        "1/3 cup heavy whipping cream",
        "2 teaspoons vanilla extract",
        "3 (1.4 ounce) bars chocolate covered toffee, chopped"
    ],
    "nut": [
        "Calories > 924 kcal",
        "Carbs > 97 g",
        "Cholesterol > 219 mg",
        "Fat > 56.5 g",
        "Protein > 13.3 g",
        "Sodium > 537 mg"
    ],
    "n": "Toffee Chunk Cheesecake",
    "a": "BUCHKO",
    "r": "0",
    "s": 12,
    "des": "\"This takes a little time to put together but the cake is the reward all in itself!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, combine wafer crumbs with the melted margarine. Mix well. Press onto the bottom and half-way up the side of 9 inch springform pan. Bake for 10 minutes in preheated oven. Allow to cool.\nIncrease oven temperature to 400 degrees F (200 degrees C). In a saucepan over low heat, melt the caramels together with the chocolate chips and evaporated milk stir until smooth and pour into crust. Break candy bars into small pieces. Sprinkle over the caramel layer.\nBeat cream cheese until smooth. Add sugar and flour; beat until smooth. Add eggs, then yolks, one at a time. Blend in heavy cream and vanilla. Pour over caramel and toffee layers. Wrap outside of pan with foil.\nSet in a large pan that has been filled with 1 inch of hot water. Bake at 400 degrees F (200 degrees C) for 15 minutes; reduce oven to 225 degrees F (110 degrees C) and bake 1 hour. Remove from water. Cool to room temperature, then chill overnight in the refrigerator. Top with 3 more Heath Bar candy bars that have been chopped.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "405.jpg",
    "o": "4469301.jpg,303998.jpg,257379.jpg,239318.jpg,109394.jpg,56575.jpg",
    "st": "allrecipes"
}