{
    "id": 15358,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (4 pound) whole chicken",
        "3 cloves garlic, chopped",
        "6 tablespoons minced shallots",
        "1 cup onion, chopped",
        "2 slices fresh ginger root, chopped",
        "3 tablespoons oyster sauce",
        "1 tablespoon dark soy sauce",
        "2 tablespoons light soy sauce",
        "1 tablespoon ketchup",
        "1 tablespoon hot chile sauce",
        "1 teaspoon chili powder",
        "1/4 cup cucumber slices, for garnish"
    ],
    "nut": [
        "Calories > 326 kcal",
        "Carbs > 6.8 g",
        "Cholesterol > 82 mg",
        "Fat > 19.7 g",
        "Protein > 29.2 g",
        "Sodium > 493 mg"
    ],
    "n": "Michelle's Roast Chicken",
    "a": "Michelle Chen",
    "r": "0",
    "s": 6,
    "des": "\"This is my own invention. Since this is an Asian influenced dish, it goes well with a bed of steaming rice rather than bread.  I like to serve this with some sliced cucumber and a light chicken soup/broth.  You can carve the bones off and cut the chicken into small pieces before serving or simply serve it whole (and let others do the carving for you!)  It doesn't need any sauce at all.  You can save the juice from baking for stir fry other green vegetables or as a dipping sauce for those who like a stronger taste!\"",
    "ins": "Prick chicken all over with a fork to create openings for the seasonings to penetrate. In a small bowl combine the garlic, shallots, onion, ginger, oyster sauce, dark soy sauce, light soy sauce, ketchup, chili sauce and chili powder. Mix together.\nPlace chicken in a 9x13 inch baking dish and rub the sauce mixture into the chicken. Cover and refrigerate. Marinate for at least 4 hours or overnight if possible.\nPreheat oven to 425 degrees F (220 degrees C).\nRemove cover and roast chicken in preheated oven for 30 minutes. Turn to the other side and roast for another 30 minutes, or until chicken is cooked through, golden in colour and juices run clear. Baste frequently with marinade while roasting. Serve with sliced cucumbers.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "187252.jpg",
    "o": "",
    "st": "allrecipes"
}