{
    "id": 153790,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound lean ground beef",
        "4 cloves garlic, minced, divided",
        "1/4 cup finely chopped onion, divided",
        "salt and pepper to taste",
        "3 roma (plum) tomatoes, diced",
        "1 teaspoon dried parsley",
        "1/2 teaspoon ras el hanout (optional)",
        "1/2 cup water"
    ],
    "nut": [
        "Calories > 424 kcal",
        "Carbs > 5.3 g",
        "Cholesterol > 114 mg",
        "Fat > 31.5 g",
        "Protein > 27.8 g",
        "Sodium > 111 mg"
    ],
    "n": "Algerian Kefta (Meatballs)",
    "a": "jacqueline senouci",
    "r": "0",
    "s": 3,
    "des": "\"This simple meatball dish is delicious, rich, and fresh. It was taught to me by my Algerian husband, one of his favorites from home. The tomato sauce can be used for anything and the amounts of flavors can be adjusted. I like a lot of garlic and pepper. I have also found halal hamburger to be much leaner and lighter than regular. You can find it at international food stores and halal butcher shops in bigger cities. Serve this dish with a French baguette.\"",
    "ins": "Combine the ground beef with half of the minced garlic and a tablespoon of chopped onion. Mix with your hands until fully incorporated. Shape the meat mixture into 1 1/2-inch oblong patties; you should have 12 to 14 meatballs.\nHeat a skillet over medium-high heat. Brown the patties in batches until they are crispy on both sides and are no longer pink in the center, about 10 minutes. Set the meatballs aside in a rimmed serving dish and repeat with the remaining patties.\nReduce the heat to medium and stir in the remaining chopped onion. Add salt and pepper. Cook the onions in the drippings, stirring constantly, until the onion has softened and turned translucent, about 5 minutes. Stir in the remaining half of the garlic and cook for 30 seconds.\nStir in the roma tomatoes, dried parsley, ras el hanout, and water. Cook until the tomatoes are soft, about 5 minutes. Pour the tomato sauce over the meatballs and serve.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}