{
    "id": 15396,
    "old_rating": "3.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 ounces ground pork",
        "4 ounces ground beef",
        "1 1/2 teaspoons Italian seasoning",
        "1 teaspoon garlic powder",
        "1/2 small onion, shredded",
        "1 tablespoon dried parsley",
        "1/4 cup grated Parmesan cheese",
        "salt and pepper to taste",
        "1 (15 ounce) can black olives, drained",
        "2 eggs",
        "2 cups Italian-style dried bread crumbs",
        "2 cups vegetable oil"
    ],
    "nut": [
        "Calories > 778 kcal",
        "Carbs > 25 g",
        "Cholesterol > 72 mg",
        "Fat > 71.2 g",
        "Protein > 12.4 g",
        "Sodium > 1069 mg"
    ],
    "n": "C and L's Stuffed Black Olives",
    "a": "qweenbee53",
    "r": "0",
    "s": 8,
    "des": "\"This is a great party appetizer, or a really good family snack. Serve with marinara sauce. There is often a bit of the meat mixture left over, so you may want to use more olives than I have recommended in this recipe.\"",
    "ins": "In a large skillet over medium high heat, cook ground beef and ground pork until evenly browned.\nDrain meats. Mix in Italian seasoning, garlic powder, onion, parsley flakes, Parmesan cheese, and salt and pepper. Continue cooking over medium high heat 1 to 2 minutes, until thoroughly blended.\nBeat eggs in a small bowl. Place Italian-style dried bread crumbs in a small bowl. Stuff the olives with the meat mixture. Dip the stuffed olives into the eggs, then into the bread crumb mixture. Place coated olives on a flat surface and let them sit for 10 minutes.\nHeat vegetable oil in the deep fryer or large, heavy saucepan to 375 degrees F (190 degrees C). Repeat the process of dipping each olive into the egg and bread mixture.\nIn small batches, fry the olives 1 to 2 minutes, or until golden brown. Drain on paper towels.",
    "pt": "25 m",
    "ct": "10 m",
    "tt": "35 m",
    "i": "2029553.jpg",
    "o": "",
    "st": "allrecipes"
}