{
    "id": 153927,
    "old_rating": "4.64",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 skinless, boneless chicken breast halves",
        "salt and pepper to taste",
        "2 tablespoons butter",
        "1 small onion, chopped",
        "1/2 green bell pepper, seeded and chopped",
        "2 chicken livers, trimmed and chopped",
        "2 cloves garlic, minced",
        "1 teaspoon dried sage",
        "1 cup chicken broth",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "4 cups cornbread crumbs",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "1/2 cup water"
    ],
    "nut": [
        "Calories > 370 kcal",
        "Carbs > 26.4 g",
        "Cholesterol > 138 mg",
        "Fat > 14.7 g",
        "Protein > 31.6 g",
        "Sodium > 946 mg"
    ],
    "n": "Stuffed Chicken Breasts with Cornbread Dressing",
    "a": "carina",
    "r": "0",
    "s": 6,
    "des": "\"This is a quick and easy meal if you have leftover cornbread on hand, or use a packaged mix.  The chicken livers are optional, but do give this an authentic Southern flair!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nCut a pocket into the side of each piece of chicken, going to within 1/2 inch of each edge. Season chicken pieces with salt and pepper; set aside.\nMelt the butter in a large saucepan over medium heat. Add the onion, bell pepper and chicken livers; cook and stir until onion is tender, about 5 minutes. Add the garlic and sage; cook and stir until fragrant, about 1 minute more. Pour in the chicken broth and season with salt and pepper. Bring to a boil, then remove from the heat. Gently stir in the cornbread crumbs and set aside until cool enough to handle.\nSpoon some of the stuffing into the pocket of each piece of chicken. Arrange them in a 9x13 inch baking dish. Spoon any leftover stuffing into the pan to surround the chicken. Stir together the condensed chicken soup and water; pour over the top off the chicken. Cover with a lid or aluminum foil.\nBake in the preheated oven for 45 minutes. Remove the aluminum foil and bake for an additional 10 minutes, or until the center of the stuffed breasts has reached 160 degrees F (70 degrees C) and the chicken has browned on top.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "95759.jpg",
    "o": "",
    "st": "allrecipes"
}