{
    "id": 15415,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 prepared 8 inch pastry shell, baked and cooled",
        "For the Custard:",
        "1/3 cup cold milk",
        "1 (.25 ounce) package unflavored gelatin",
        "4 egg yolks",
        "5 tablespoons white sugar",
        "2 teaspoons vanilla extract",
        "For the Swiss Meringue:",
        "4 egg whites",
        "1/8 teaspoon salt",
        "1/8 teaspoon cream of tartar",
        "3 tablespoons white sugar",
        "2 cups heavy whipping cream",
        "1/4 cup brandy",
        "2 tablespoons apricot jam, melted",
        "1 3/4 cups shredded coconut"
    ],
    "nut": [
        "Calories > 472 kcal",
        "Carbs > 33.1 g",
        "Cholesterol > 185 mg",
        "Fat > 33.1 g",
        "Protein > 6.5 g",
        "Sodium > 227 mg"
    ],
    "n": "Toasted Coconut Cream Pie",
    "a": "econo1943",
    "r": "0",
    "s": 8,
    "des": "\"This pie is made especially heavenly by the addition of brandy and apricot glaze.\"",
    "ins": "Pour the milk into a small bowl. Sprinkle the gelatin over the milk and set it aside to soften.\nCombine the egg yolks and 5 tablespoons sugar in a heat-proof mixing bowl. Beat with a hand mixer or a whisk until the mixture is thick and lemon-colored. Set the bowl over a pot of simmering water on the stove and cook, stirring constantly, about 5 minutes. The mixture should feel hot to the touch and have reached 145 degrees F (63 degrees C) on an instant-read thermometer.\nMix in the gelatin and milk and stir until the gelatin is completely dissolved. Remove from heat. Pour into a large bowl and stir in the vanilla extract. Set aside.\nCombine the egg whites, cream of tartar, and 1/3 cup sugar in a heat-proof mixing bowl. Whisk the mixture slightly, just to break up the egg whites. Set the bowl over a pot of simmering water on the stove. Heat the mixture, whisking constantly, until the egg white mixture is hot to the touch and has reached 145 degrees F (63 degrees C) on an instant-read thermometer. Immediately remove the bowl from the heat and whip with an electric mixer until the meringue forms soft peaks.\nFold the meringue into the custard mixture. Allow it to cool to room temperature.\nBrush the bottom and sides of the baked pastry shell with melted apricot jam.\nWhip the cream until soft peaks form. Add the brandy and continue to whip until medium-stiff peaks form. Fold the whipped cream into the custard and spoon it into the pie shell. Refrigerate for 6 hours or overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nSpread the coconut on a baking sheet and toast it in the oven until lightly browned, 3 to 5 minutes. Sprinkle coconut over the pie before serving.",
    "pt": "35 m",
    "ct": "35 m",
    "tt": "1 d ",
    "i": "2149973.jpg",
    "o": "",
    "st": "allrecipes"
}