{
    "id": 154183,
    "old_rating": "4.70755",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package lasagna noodles",
        "1/2 pound ground pork sausage",
        "1/2 pound ground beef",
        "1 clove garlic, minced",
        "1 (28 ounce) can diced tomatoes",
        "1 (8 ounce) can tomato sauce",
        "1 tablespoon dried parsley",
        "1/2 teaspoon dried basil",
        "1/2 teaspoon dried oregano",
        "1 pinch white sugar",
        "1 (16 ounce) container sour cream",
        "3 eggs, lightly beaten",
        "3/4 cup grated Parmesan cheese",
        "1/2 cup chopped pitted green olives",
        "2 teaspoons salt",
        "1/4 teaspoon ground black pepper",
        "2 (12 ounce) packages shredded mozzarella cheese, divided"
    ],
    "nut": [
        "Calories > 670 kcal",
        "Carbs > 31.2 g",
        "Cholesterol > 189 mg",
        "Fat > 42 g",
        "Protein > 41.3 g",
        "Sodium > 2106 mg"
    ],
    "n": "Grandma's Best Ever Sour Cream Lasagna",
    "a": "e.oliver365",
    "r": "0",
    "s": 8,
    "des": "\"This is my grandma's famous recipe, except that I use sour cream instead of the traditional cheeses (a trick I picked up from my mother-in-law).  She always made it for birthday dinners and special occasions.  This makes a large amount.  I halve it when making it for my boyfriend and myself. It's very cheesy - sometimes I add a little extra tomato sauce.  Enjoy!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the lasagna noodles, and return to a boil. Cook, uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain.\nHeat a large skillet over medium-high heat and cook and stir the sausage, ground beef, and garlic until the meat is crumbly, evenly browned, and no longer pink. Drain any excess grease. Stir in the diced tomatoes, tomato sauce, parsley, basil, oregano, and sugar. Bring to a boil over high heat, then reduce the heat to medium-low, and simmer, stirring occasionally, until the sauce is thickened, about 30 minutes.\nStir together the sour cream, eggs, Parmesan cheese, green olives, salt, black pepper, and 1/2 of the mozzarella cheese in a bowl.\nTo assemble the lasagna, spread a thin layer of the meat sauce evenly over the bottom of a 9x13 inch baking pan. Cover with 1/3 of the lasagna noodles, 1/3 of the remaining meat sauce, 1/3 of the sour cream mixture. Repeat this layering 2 more times. Sprinkle the remaining mozzarella cheese evenly over the lasagna.\nBake in the preheated oven until the sauce is bubbly and the top is golden brown, about 30 minutes.",
    "pt": "40 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1001130.jpg",
    "o": "4294056.jpg,3100184.jpg,2978934.jpg,2941032.jpg,2602692.jpg,2511009.jpg",
    "st": "allrecipes"
}