{
    "id": 15431,
    "old_rating": "4.10959",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound cubed beef stew meat",
        "1 tablespoon vegetable oil",
        "1 onion, thinly sliced",
        "1 (6 ounce) can tomato paste",
        "1 (14.5 ounce) can low fat, low sodium beef broth",
        "1 cup chopped carrots",
        "3 potatoes, cubed",
        "1 sprig fresh rosemary",
        "1 teaspoon dried thyme",
        "1 bay leaf",
        "1/4 teaspoon crushed red pepper flakes",
        "10 ounces button mushrooms, quartered",
        "1 (10 ounce) package frozen green peas, thawed"
    ],
    "nut": [
        "Calories > 367 kcal",
        "Carbs > 36.9 g",
        "Cholesterol > 65 mg",
        "Fat > 11.1 g",
        "Protein > 31.1 g",
        "Sodium > 370 mg"
    ],
    "n": "Beef and Vegetable Stew",
    "a": "Marianne",
    "r": "0",
    "s": 6,
    "des": "\"This variation of beef stew is hearty, easy to make and low in fat. You can substitute venison for the beef. If you want to stretch out the recipe, try serving over cooked noodles.\"",
    "ins": "Remove any bits of fat from the meat. Heat the oil in a large pot over medium high heat. Saute the meat in the oil for 10 minutes, or until browned on all sides. Remove meat and set aside.\nAdd the onion and tomato paste to the pot and saute over medium heat for 5 minutes, or until onion is tender, stirring often. Return the meat to the skillet along with the beef broth, combining with the onion and tomato paste mixture. Reduce heat to low, cover and simmer for 1 to 1 1/2 hours, or until meat is tender.\nAdd the carrots, potatoes, rosemary, thyme, bay leaf and crushed red pepper flakes and simmer, covered, for another 45 minutes. (Note: It may be necessary to add some water if the stew seems too thick.)\nFinally, add the mushrooms and the peas and allow stew to heat through, about another 10 to 15 minutes.  Remove bay leaf and rosemary sprig before serving.",
    "pt": "15 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}