{
    "id": 154388,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup light brown sugar",
        "1/4 cup butter",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon Chinese five-spice powder",
        "4 acorn squash, halved and seeded",
        "1/4 cup butter",
        "1 cup minced yellow onion",
        "1 cup minced celery",
        "1 cup minced red bell pepper",
        "1 tablespoon minced garlic",
        "2 quarts seafood stock",
        "1 cup heavy cream",
        "1 cup thinly sliced fresh basil",
        "1 teaspoon ground nutmeg",
        "sea salt and white pepper to taste",
        "2 (16 ounce) packages cooked and peeled whole crawfish tails"
    ],
    "nut": [
        "Calories > 334 kcal",
        "Carbs > 30 g",
        "Cholesterol > 130 mg",
        "Fat > 17.4 g",
        "Protein > 17.1 g",
        "Sodium > 397 mg"
    ],
    "n": "Roasted Acorn Squash and Crawfish Bisque",
    "a": "Chef Q",
    "r": "0",
    "s": 12,
    "des": "\"Fall acorn squash roasted with warm spices, butter, and brown sugar. Finished with fresh basil and Louisiana Crawfish tails.\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nCombine the brown sugar with 1/4 cup butter, cinnamon, and five spice powder in a microwave safe bowl. Cook in the microwave on High until the butter has completely melted. Place the acorn squash cut side up onto the aluminum foil; brush with the brown sugar mixture.\nBake in the preheated oven until the squash is tender and golden brown, about 1 1/2 hours. Remove from the oven, allow to cool, and scoop out and reserve the flesh.\nMelt the remaining 1/4 cup of butter in a large pot over medium heat. Stir in the onion, celery, and bell pepper. Cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the acorn squash, garlic, and seafood stock. Bring to a boil over high heat; reduce heat to medium-low and simmer 30 minutes.\nStir the cream and basil into the simmering soup; season with nutmeg, salt, and white pepper. Pour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot. Once pureed, add the crawfish tails, and simmer a few minutes until hot.",
    "pt": "40 m",
    "ct": "2 h ",
    "tt": "3 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}