{
    "id": 154844,
    "old_rating": "4.79167",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 cups cubed, day-old sourdough bread",
        "1 1/2 pounds bulk pork sausage",
        "2 tablespoons butter",
        "2 cups diced onion",
        "2 cups diced celery",
        "sea salt and pepper to taste",
        "2 Golden Delicious apples - peeled, cored and diced",
        "1 1/2 cups dried cranberries",
        "1 cup toasted walnuts, chopped",
        "1/4 cup chopped fresh sage",
        "2 tablespoons chopped fresh rosemary",
        "1 tablespoon chopped fresh thyme",
        "1 cup chopped fresh parsley",
        "2 eggs",
        "2 cups chicken stock",
        "1/2 cup melted butter"
    ],
    "nut": [
        "Calories > 329 kcal",
        "Carbs > 32.3 g",
        "Cholesterol > 53 mg",
        "Fat > 18.3 g",
        "Protein > 10.8 g",
        "Sodium > 676 mg"
    ],
    "n": "Sausage, Apple, and Cranberry Dressing",
    "a": "Alan Dorchak",
    "r": "0",
    "s": 20,
    "des": "\"This is an very flavorful recipe that works great for any special occasion, especially Thanksgiving.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nSpread the bread cubes in a thin layer onto two or more baking sheets. Bake in the preheated oven until the bread cubes have toasted evenly, 5 to 7 minutes. Stir once as the bread bakes. Once toasted, place the bread cubes into a very large mixing bowl and set aside.\nHeat a large skillet over medium-high heat and stir in the pork sausage. Cook and stir until crumbly, evenly browned, and no longer pink. Drain the sausage and add to the bread cubes.\nMelt 2 tablespoons of butter in the same skillet over medium heat. Stir in the onion and celery, and cook until the onion has softened and turned translucent, about 5 minutes. Season to taste with sea salt and pepper, and scrape into the bowl with the bread cubes. Stir in the apples, cranberries, walnuts, sage, rosemary, thyme, and parsley. Whisk the eggs in a bowl along with the chicken stock, and pour over the bread mixture along with 1/2 cup of melted butter. Stir well until the bread cubes have absorbed the chicken stock. Pack into the prepared 9x13 inch baking dish and cover with aluminum foil.\nBake in the preheated oven for 30 minutes, then remove the aluminum foil, and stir the stuffing. Return to the oven and continue baking until golden brown on top, about 15 minutes more.",
    "pt": "1 h",
    "ct": "1 h",
    "tt": "2 h",
    "i": "742469.jpg",
    "o": "",
    "st": "allrecipes"
}