{
    "id": 15500,
    "old_rating": "4.26042",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon butter",
        "1 cup white rice",
        "1 (14.5 ounce) can chicken broth",
        "3 boneless chicken breast halves, boiled and cubed",
        "1 pound Monterey Jack cheese",
        "1 (11 ounce) can sweet corn, drained",
        "1 (24 ounce) jar green enchilada sauce",
        "24 (6 inch) corn tortillas"
    ],
    "nut": [
        "Calories > 647 kcal",
        "Carbs > 64.1 g",
        "Cholesterol > 101 mg",
        "Fat > 29.4 g",
        "Protein > 33.3 g",
        "Sodium > 500 mg"
    ],
    "n": "Green Sauce Enchiladas",
    "a": "smooch",
    "r": "0",
    "s": 8,
    "des": "\"These are the best chicken enchiladas you will ever have! I created this recipe one day by accident, and it's now a family favorite. Try it, you won't be disappointed!\"",
    "ins": "In a large skillet, saute rice with butter or margarine. Add chicken broth and simmer over low heat for 15 to 20 minutes, or until rice is cooked and tender. Let cool.\nPreheat oven to 350 degrees F (175 degrees C).\nCube 3/4 pound of the cheese; shred the remaining 1/4 pound cheese and set aside. Combine chicken, 3/4 pound cubed cheese, corn, cooled rice and 1/4 cup sauce in a large bowl. Mix together. Warm tortillas in the microwave for 2 minutes and spread another 1/4 cup sauce in the bottom of a 9x13 inch baking dish.\nPlace a little of the chicken mixture on each tortilla and roll up. Place filled tortillas (as many as will fit) in the baking dish. Sprinkle with 1/4 pound shredded cheese and top with any remaining sauce, pouring evenly over all. (Freeze remaining tortillas for future green sauce enchiladas!)\nBake at 350 degrees F (175 degrees C) for 30 minutes.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "546116.jpg",
    "o": "3507910.jpg,3497338.jpg,2759547.jpg,2251423.jpg,427495.jpg,219272.jpg",
    "st": "allrecipes"
}