{
    "id": 155184,
    "old_rating": "4.70621",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/2 pounds skinless, boneless chicken breast halves",
        "4 tablespoons vegetable oil, divided",
        "1 onion, chopped",
        "3 cloves garlic, minced",
        "2 1/2 quarts chicken broth",
        "3 cups water",
        "1 teaspoon crumbled dried oregano",
        "2 teaspoons salt",
        "4 tablespoons chili powder, or to taste",
        "3 cups white hominy, rinsed and drained",
        "10 tostada shells"
    ],
    "nut": [
        "Calories > 226 kcal",
        "Carbs > 18 g",
        "Cholesterol > 59 mg",
        "Fat > 6.2 g",
        "Protein > 24.2 g",
        "Sodium > 697 mg"
    ],
    "n": "Easy Chicken Posole",
    "a": "Dorothy Denise Garcia",
    "r": "0",
    "s": 10,
    "des": "\"This easy-to-make chicken and hominy soup is one of many great Mexican Christmas traditions, or simply delicious whenever you want to eat something warm and comforting. It's garnished with thinly sliced radishes, shredded lettuce, finely chopped onion, chopped cilantro, and lime wedges, which diners add to the soup as they please.\"",
    "ins": "Heat 2 tablespoons canola oil in a deep skillet over medium-high heat. Add chicken breasts, and cook until no longer pink and juices run clear, about 20 minutes. Remove from skillet, drain, and cool. When completely cooled, shred chicken with a fork.\nHeat remaining 2 tablespoons canola oil in the same skillet over medium-high heat. Cook and stir onion and garlic until soft and transparent, about 5 minutes. Return shredded chicken to the skillet. Stir in the chicken broth, water, oregano, salt, and chili powder. Reduce heat to low, cover, and cook about 90 minutes. Stir in the hominy and cook until tender, about 15 minutes more. Taste to adjust seasonings, adding more salt and chili powder, if desired. Serve in soup bowls with1 tostada shell per serving. Garnish as desired.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "1126562.jpg",
    "o": "4499624.jpg,4464035.jpg,4462174.jpg,4462173.jpg,4289430.jpg,4093130.jpg",
    "st": "allrecipes"
}