{
    "id": 155114,
    "old_rating": "3.96694",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon baking soda",
        "1 teaspoon salt",
        "1 1/3 cups butter",
        "1 cup packed brown sugar",
        "2/3 cup white sugar",
        "2 eggs, beaten",
        "1 1/2 teaspoons vanilla extract",
        "1 drop red food coloring, or as needed",
        "1 drop green food coloring, or as needed"
    ],
    "nut": [
        "Calories > 76 kcal",
        "Carbs > 10.2 g",
        "Cholesterol > 14 mg",
        "Fat > 3.6 g",
        "Protein > 0.9 g",
        "Sodium > 71 mg"
    ],
    "n": "Christmas Pinwheel Cookies",
    "a": "Gitano",
    "r": "0",
    "s": 72,
    "des": "\"This recipe was handed down by my 'Baba' (Ukrainian for 'grandmother'). She originally just made a chocolate and plain pinwheel cookie, but I adapted it easily to create a very colorful variety that my kids and husband adore at Christmas time!\"",
    "ins": "Sift the flour, baking powder, baking soda, and salt together into a bowl. Resift again into another bowl.\nBeat the butter with the brown and white sugars in a mixing bowl until light and fluffy. Beat in the eggs and vanilla until smooth. Gradually stir in the flour mixture until evenly blended. Gather the dough into a ball, and divide into two equal parts. Place one half in a second bowl. Add red food coloring to the dough in one bowl, and green food coloring to the dough in the other bowl. Use a fork or wooden spoon to blend the food coloring into the dough until evenly blended. Add additional drops of food coloring to make the desired shade.\nRoll out the red dough to 1/4 inch (5mm) thickness. Roll out the green dough to 1/4 inch (5mm) thickness, and place on top of the red dough. Beginning on one edge, roll the doughs to make a log so the two colors spiral inside each other. Wrap the log in waxed paper, then in a cotton towel, and refrigerate at least 8 hours.\nPreheat oven to 400 degrees F (200 degrees C). Lightly grease 2 baking sheets.\nUnwrap the dough log, and place on a clean, lightly floured surface. Slice the log into rounds 1/8 inch (3 mm) thick, and place on prepared baking sheets.\nBake in preheated oven until set, 5 to 6  minutes. Watch carefully to prevent edges from browning. Remove from oven, and cool on racks.",
    "pt": "25 m",
    "ct": "5 m",
    "tt": "8 h ",
    "i": "319681.jpg",
    "o": "2994998.jpg,2954769.jpg,1815576.jpg,1784367.jpg,1784358.jpg,1076525.jpg",
    "st": "allrecipes"
}