{
    "id": 15520,
    "old_rating": "3.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (9 inch) pie shell",
        "1 1/2 cups all-purpose flour",
        "1/2 cup packed brown sugar",
        "3 tablespoons butter flavored shortening",
        "1 egg, beaten",
        "1 cup unsulfured molasses",
        "3/4 cup cold water",
        "1 teaspoon baking soda",
        "3/4 cup boiling water",
        "1/2 cup semisweet chocolate chips"
    ],
    "nut": [
        "Calories > 439 kcal",
        "Carbs > 76.5 g",
        "Cholesterol > 23 mg",
        "Fat > 14 g",
        "Protein > 4.4 g",
        "Sodium > 289 mg"
    ],
    "n": "Chocolate Shoofly Pie",
    "a": "COCINERO99",
    "r": "0",
    "s": 8,
    "des": "\"A heavenly delicious Shoofly Pie with a gooey bittersweet chocolate bottom to it. I must give credit to a person I've never met, Ms. Ivy Smink, for her recipe for Shoofly Pie. I've had many a Shoofly Pie before. This is the most authentic in flavor that I've ever tasted. God Bless her for sharing it with us. Serve this pie with homemade vanilla bean ice cream and a hot cup of coffee or tea, snuggled up by the fireplace with someone you love. It's like going to heaven, yet it's a devilish good time.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nIn a small bowl, mix together flour and brown sugar. Cut in shortening until mixture resembles coarse crumbs. Set aside 1 cup of this mixture for topping the pie.\nIn a large bowl, combine egg, molasses, cold water, and remaining crumb mixture. Mix thoroughly. Dissolve baking soda in boiling water and add to molasses mixture. Mix well.\nSpread chocolate chips across bottom of pastry-lined pie pan. Pour filling over chocolate chips. Sprinkle reserved crumb mixture over top.\nBake in preheated oven for 45 to 55 minutes, until filling is set.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}