{
    "id": 15532,
    "old_rating": "4.64444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 egg whites",
        "1 pinch salt",
        "1 cup white sugar",
        "1 tablespoon cornstarch",
        "1 teaspoon lemon juice",
        "1 1/4 cups heavy whipping cream",
        "1/2 cup confectioners' sugar",
        "1 pint fresh strawberries"
    ],
    "nut": [
        "Calories > 186 kcal",
        "Carbs > 25.3 g",
        "Cholesterol > 34 mg",
        "Fat > 9.3 g",
        "Protein > 1.6 g",
        "Sodium > 56 mg"
    ],
    "n": "The Best Pavlova",
    "a": "Virginia",
    "r": "0",
    "s": 12,
    "des": "\"Australian dessert with a meringue base, topped with fresh cream and fruit. This is a recipe that I have experimented with and all my friends and family say it's the best pavlova they've ever tasted!\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C). Line a sheet pan with parchment paper. Draw a 9 inch circle on the parchment. An easy way to do this is to draw around the outside of a 9 inch pan with a pencil.\nIn a large bowl, beat egg whites on high speed until soft peaks form. Add 3/4 cup of the sugar gradually, while continuing to whip. Make sure sugar is completely dissolved.  Mix together the remaining 1/4 cup sugar with the cornstarch; lightly fold into meringue with lemon juice.\nSpread a layer of meringue to fit circle on parchment, approximately 1/4 inch thick.  With remainder of mixture, pipe or spoon swirls around the edges to form a shallow bowl shape.\nBake at 300 degrees F (150 degrees C) for 1 hour. Turn off oven, but leave meringue in oven for an additional 30 minutes. When cool, the meringue should be hard on the outside, and slightly moist on the inside.\nIn a large bowl, combine the cream and half a cup of confectioners sugar, and whip until thickened. Decorate with fruit of your choice; strawberries are excellent.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "37836.jpg",
    "o": "4510143.jpg,3501950.jpg,3420433.jpg,3168954.jpg,2616273.jpg,1168081.jpg",
    "st": "allrecipes"
}