{
    "id": 15566,
    "old_rating": "4.21739",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 skinless, boneless chicken breast halves",
        "2 tablespoons chicken bouillon granules",
        "2 cups hot water",
        "3 eggs",
        "2 tablespoons chopped fresh parsley",
        "1 teaspoon ground cinnamon",
        "2 teaspoons white sugar",
        "1 (17.5 ounce) package frozen puff pastry, thawed",
        "salt and pepper to taste",
        "1/4 cup butter, melted"
    ],
    "nut": [
        "Calories > 908 kcal",
        "Carbs > 58.8 g",
        "Cholesterol > 201 mg",
        "Fat > 63.5 g",
        "Protein > 25.8 g",
        "Sodium > 1028 mg"
    ],
    "n": "B'stilla",
    "a": "flute",
    "r": "0",
    "s": 4,
    "des": "\"A delicious chicken pie with a subtle difference - found on my travels in the Middle East and North Africa. Makes a good buffet dish. Make sure bouillon is strongly flavored.\"",
    "ins": "Preheat oven to 360 degrees F (180 degrees C).\nPlace chicken breasts in a small saucepan and cover with bouillon and water. Poach over medium-low heat, just below the boiling point. Cook 8 to 10 minutes, until no longer pink in center. Dice chicken. Reserve bouillon.\nIn a small bowl, whisk eggs with 1/2 cup reserved bouillon and chopped parsley. In a separate bowl, mix together cinnamon and sugar.\nRoll out one sheet of pastry into a 12 inch square. Cut other sheet of pastry in half and roll out into two 8 inch squares. Fit 12 inch square of pastry into a 9 inch pie pan.\nSpread half of diced chicken evenly across bottom of pastry. Pour half of egg mixture over chicken. Sprinkle with half of cinnamon and sugar mixture, then with salt and pepper. Cover with one 8 inch square of pastry. Cover pastry square with remaining chicken, egg mixture, and cinnamon and sugar. Sprinkle with more salt and pepper. Cover with remaining pastry square. Fold edges of bottom pastry over top of pie. Brush with melted butter or margarine.\nBake in preheated oven for 40 minutes, until golden brown. Serve lukewarm or cold.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "2274446.jpg",
    "o": "",
    "st": "allrecipes"
}