{
    "id": 155869,
    "old_rating": "4.45455",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Dark Chocolate Layer",
        "3 (1.55 ounce) bars dark chocolate, coarsely chopped",
        "1 cup miniature marshmallows",
        "1/4 cup milk",
        "1 pinch salt",
        "1/2 teaspoon vanilla extract",
        "1/2 cup heavy cream",
        "1 (9 inch) prepared graham cracker crust",
        "Milk Chocolate Layer",
        "3 (1.55 ounce) bars milk chocolate, coarsely chopped",
        "1 cup miniature marshmallows",
        "1/4 cup milk",
        "1 pinch salt",
        "1/2 teaspoon vanilla extract",
        "1/2 cup heavy cream",
        "1 (8 ounce) tub chocolate whipped topping, thawed",
        "1 (8 ounce) tub whipped topping, thawed",
        "1/4 cup miniature semi-sweet chocolate chips, for garnish (optional)"
    ],
    "nut": [
        "Calories > 647 kcal",
        "Carbs > 64.5 g",
        "Cholesterol > 49 mg",
        "Fat > 40.7 g",
        "Protein > 4.8 g",
        "Sodium > 328 mg"
    ],
    "n": "Triple Chocolate Cream Pie",
    "a": "dragonkitty",
    "r": "0",
    "s": 8,
    "des": "\"A no-bake pie exclusively for dedicated chocolate lovers! My family loves homemade chocolate cream pie for our Christmas dinner. I created this one and nothing has been the same since! Refrigerate the pie until ready to serve. It may also be frozen.\"",
    "ins": "To make the dark chocolate layer, place the dark chocolate, miniature marshmallows, milk, and salt into the top of a double boiler over medium heat. Stir until chocolate melts and mixture is smooth. Remove from the heat, and stir in the vanilla. Allow to cool, stirring occasionally.\nBeat the heavy cream in a bowl until soft peaks form. Fold the whipped cream into the dark chocolate mixture until evenly blended. Spoon the mixture into the prepared graham cracker crust. Spread 1/2 chocolate whipped topping over the dark chocolate layer. Refrigerate at least 30 minutes.\nMeanwhile, make the milk chocolate layer by placing the milk chocolate, miniature marshmallows, milk, and salt into the top of a double boiler over medium heat. Stir until chocolate melts, and mixture is smooth. Remove from the heat, and stir in the vanilla. Allow to cool, stirring occasionally.\nBeat the remaining 1/2 cup heavy cream in a bowl until soft peaks form. Fold the whipped cream into the milk chocolate mixture until evenly blended. Pour the mixture over chocolate topping layer. Spread the remaining chocolate whipped topping over the milk chocolate layer. Spoon the whipped topping over the chocolate topping. If desired, garnish with miniature chocolate chips.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}