{
    "id": 155996,
    "old_rating": "4.31111",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups confectioners' sugar",
        "1 1/4 cups butter, softened",
        "1 teaspoon peppermint extract",
        "1 teaspoon vanilla extract",
        "1 egg",
        "3 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 cup white sugar, or as needed",
        "1 cup finely crushed peppermint candy",
        "3 tablespoons milk"
    ],
    "nut": [
        "Calories > 111 kcal",
        "Carbs > 18.1 g",
        "Cholesterol > 13 mg",
        "Fat > 4 g",
        "Protein > 0.8 g",
        "Sodium > 58 mg"
    ],
    "n": "Peppermint Snowballs",
    "a": "J_Andrews",
    "r": "0",
    "s": 60,
    "des": "\"This is a great-tasting cookie and it's always very pretty on the Christmas table!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease baking sheets, or line with parchment paper.\nBeat 1 1/2 cups confectioners' sugar with the butter, peppermint extract, vanilla extract, and egg in a mixing bowl at Medium speed until well blended and creamy, 2 to 3 minutes. Reduce speed to Low, and gradually mix in the flour, baking powder, and salt until well blended, 1 to 2 minutes. Stir in 1/2 cup crushed peppermint candy using a wooden spoon.\nPlace the white sugar in a shallow bowl. Roll a small amount of cookie dough between your hands to make 3/4 inch diameter balls. Roll in sugar. Place 1 inch apart on prepared baking sheets.\nBake in preheated oven until light brown, 10 to 12 minutes. Remove and cool on racks.\nMeanwhile, to make the glaze, stir the remaining 1 1/2 cups confectioners sugar together with the milk in a bowl until smooth. Drizzle cooled cookies with the glaze, and sprinkle immediately with the remaining crushed peppermint candy.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "755810.jpg",
    "o": "",
    "st": "allrecipes"
}