{
    "id": 156301,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/4 cups dried soybeans",
        "14 fluid ounces water",
        "1 1/2 teaspoons liquid nigari"
    ],
    "nut": [
        "Calories > 259 kcal",
        "Carbs > 17.5 g",
        "Cholesterol > 0 mg",
        "Fat > 11.6 g",
        "Protein > 21.2 g",
        "Sodium > 4 mg"
    ],
    "n": "Nona's Tableside Homemade Soft Tofu",
    "a": "rinshinomori",
    "r": "0",
    "s": 4,
    "des": "\"Although somewhat similar to silken (soft) tofu since no weight is placed on tofu to extract liquid, this type of tofu is not quite silken in texture. If is much softer and fluffier than silken and does not have the crisp form cutting quality of silken tofu. Simmering cut tofu for 5 minutes firms up tofu for later cooking.\"",
    "ins": "Soak the dry beans in water for at least 12 hours. Drain the beans. You want to end up with 14 ounces of soaked beans.\nPlace a colander inside a larger bowl. Line the colander with a few layers of cheesecloth or a cotton towel. Use a blender to blend the beans with 14 fluid ounces of water. Pour into a nonstick saucepan and bring to a boil. Stir frequently. As soon as it comes to a boil, reduce the heat to low; simmer and stir for about 3 minutes.\nPour the soybean mixture into the lined colander. Gather the edges and twist the solids in a ball to wring out all of the liquid. I use a can to help press out all of the soy milk. You will need 3 cups of the soy milk, (24 fluid ounces). If you don't have enough, pour some more hot water over the soybean solids (okara) until you have enough.\nPour the soymilk into a saucepan. Heat to 170 to 175 degrees F (75 to 80 degrees C).\nAt the table, have a container ready that is about 4 inches deep and 4 to 6 inches across to make the tofu in. You can use any container that is big enough to hold the milk, but if it is too big, it will be more difficult to form the tofu.\nMeasure the nigari into the container at the table first. Pour the hot soy milk into the container. No stirring is necessary as the act of pouring the liquid in stirs it enough to form the tofu. Wait for 3 to 5 minutes for the tofu to form. You can serve immediately, or refrigerate for later use.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "37 m",
    "i": "248374.jpg",
    "o": "",
    "st": "allrecipes"
}