{
    "id": 15635,
    "old_rating": "4.6069",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/3 cups graham cracker crumbs",
        "3/4 cup chopped walnuts",
        "3/4 cup packed brown sugar",
        "1 1/2 teaspoons ground cinnamon",
        "2/3 cup butter, melted",
        "1 (18.25 ounce) package yellow cake mix",
        "1 cup water",
        "1/4 cup vegetable oil",
        "3 eggs",
        "1 cup confectioners' sugar",
        "1 1/2 teaspoons vanilla extract",
        "1/2 teaspoon butter flavored extract (optional)"
    ],
    "nut": [
        "Calories > 258 kcal",
        "Carbs > 32.8 g",
        "Cholesterol > 37 mg",
        "Fat > 13.4 g",
        "Protein > 2.7 g",
        "Sodium > 217 mg"
    ],
    "n": "Graham Streusel Coffee Cake",
    "a": "Judy Blum Ryan",
    "r": "0",
    "s": 24,
    "des": "\"A graham cracker and nut streusel swirls through this quick, cake mix fix-up. Our family has been making and enjoying this delicious cake for many years. This is wonderful with a cup of hot tea!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan. Make the streusel: In a medium bowl, combine the graham cracker crumbs, nuts, brown sugar and cinnamon. Stir in the melted butter. Set aside.\nIn a large mixing bowl, combine the cake mix, water, oil, and eggs. Beat on low speed with an electric mixer just until moistened. Beat on medium speed for 2 minutes longer. Spread 1/2 of the batter into a greased 9x13 inch pan. Sprinkle on 1/2 of the streusel mixture. Carefully spread the remaining 1/2 of the cake batter over the streusel, and sprinkle with the remaining streusel.\nBake for 35 to 40 minutes or until a toothpick inserted comes out clean. Cool slightly, then drizzle with the powdered sugar icing.  Best if served warm.  Makes 12 to 16 servings.\nTo make the Icing:  In a small bowl, combine confectioners sugar with vanilla and butter flavoring. Add a few drops of water until you achieve drizzling consistency.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "1504539.jpg",
    "o": "972111.jpg,968438.jpg,951925.jpg,951924.jpg,865187.jpg,735927.jpg",
    "st": "allrecipes"
}