{
    "id": 156439,
    "old_rating": "4.63636",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package elbow macaroni",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "1 (12 fluid ounce) can evaporated milk",
        "1/2 cup water",
        "1 pinch red pepper flakes, or to taste",
        "1 pinch ground nutmeg, or to taste",
        "salt and pepper to taste",
        "1/2 cup canned garbanzo beans, rinsed and drained",
        "1/2 cup dry bread crumbs",
        "1/4 cup grated Parmesan cheese",
        "1 cup mashed sweet potatoes",
        "1 cup sour cream",
        "2 cups shredded, yellow sharp Cheddar cheese, divided",
        "1/2 cup shredded, white extra-sharp Cheddar cheese, divided",
        "2 tablespoons butter"
    ],
    "nut": [
        "Calories > 624 kcal",
        "Carbs > 65.6 g",
        "Cholesterol > 81 mg",
        "Fat > 29.5 g",
        "Protein > 24 g",
        "Sodium > 544 mg"
    ],
    "n": "Good For You Macaroni and Cheese",
    "a": "Dianne",
    "r": "0",
    "s": 8,
    "des": "\"Using the best of all the ideas out there, this mac n' cheese incorporates old-style methods with hidden veggies and a crunchy, new topping that will please both kids and adults.  I like to use 'smart' pasta that has calcium and fiber.  It's too good to be good for you!\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the macaroni, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still very firm to the bite, about 5 minutes. Drain well in a colander set in the sink, and rinse with cold water until cold; set aside.\nMeanwhile, melt 2 tablespoons of butter in a large saucepan over medium-low heat. Whisk in the flour, and stir until the mixture becomes paste-like and light golden brown, about 5 minutes. Gradually whisk the evaporated milk and water into the flour mixture, and bring to a simmer over medium heat. Season to taste with red pepper flakes, nutmeg, salt, and pepper. Cook and stir until the mixture is thick and smooth, 10 to 15 minutes.\nPreheat an oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nPlace the garbanzo beans into a blender. Cover, and puree until smooth. Scrape the puree into a small bowl and stir in the bread crumbs and Parmesan cheese; set aside.\nOnce the sauce has thickened, whisk in the sweet potatoes and sour cream; return to a simmer. Whisk in half of the yellow and white Cheddar cheeses until melted. Stir in the macaroni until well coated with the sauce, then pour half into the prepared baking dish. Sprinkle the remaining Cheddar cheeses overtop, then cover with the remaining macaroni. Smooth the top, then dot with the garbanzo bean mixture and the remaining 2 tablespoons of butter.\nBake in the preheated oven until the sauce is bubbly, and the top is golden brown, 30 to 40 minutes. Allow the dish to rest for 5 minutes before serving.",
    "pt": "25 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "203721.jpg",
    "o": "",
    "st": "allrecipes"
}