{
    "id": 156500,
    "old_rating": "4.39362",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds ground beef",
        "2 small dill pickles, minced",
        "1 small onion, minced",
        "2 tablespoons grated Parmesan cheese",
        "1 tablespoon mayonnaise",
        "1 tablespoon ketchup",
        "1 teaspoon minced garlic",
        "salt and pepper to taste",
        "2 tablespoons olive oil",
        "2 tablespoons all-purpose flour",
        "1 pound frozen bread dough, thawed",
        "8 slices American cheese",
        "1 tablespoon melted butter"
    ],
    "nut": [
        "Calories > 1037 kcal",
        "Carbs > 62.2 g",
        "Cholesterol > 202 mg",
        "Fat > 55.5 g",
        "Protein > 67 g",
        "Sodium > 1958 mg"
    ],
    "n": "Hidden Cheeseburger",
    "a": "VINCE317",
    "r": "0",
    "s": 4,
    "des": "\"I decided to try this recipe I had thought up and we loved it!\"",
    "ins": "Combine the ground beef, pickles, onion, Parmesan cheese, mayonnaise, ketchup, garlic, salt, and pepper in a bowl. Form the mixture into 4 patties.\nHeat the olive oil in a skillet over medium heat. Cook the hamburger patties in the hot oil until the burgers are cooked to your desired degree of doneness, 8 to 10 minutes for well done.\nLine a baking sheet with parchment paper, and set aside. Cover a flat surface with the flour. Divide the bread dough into 4 even pieces; roll each piece into a flattened rectangle on the floured surface at least twice the size of the American cheese slices. Place one slice of American cheese on each piece of dough; top each with one of the cooked patties and another slice of American cheese. Fold the dough over the top of the meat and cheese. Pinch the dough around the edges to seal completely. Arrange on the prepared baking sheet with the seam side facing downward. Brush the tops with the melted butter; move to a warm area and allow to rise for 20 minutes.\nPreheat an oven to 425 degrees F (220 degrees C).\nBake in the preheated oven until the bread has browned, about 20 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "803456.jpg",
    "o": "",
    "st": "allrecipes"
}