{
    "id": 156795,
    "old_rating": "3.90909",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 1/2 pounds skinless, boneless chicken breast halves, diced",
        "1 red onion, chopped",
        "1 green bell pepper, chopped",
        "2 cloves garlic, minced",
        "1 (18 ounce) bottle barbeque sauce",
        "1 (8 ounce) package phyllo dough",
        "1 stick unsalted butter",
        "4 cups shredded Cheddar cheese",
        "1 tablespoon Italian seasoning"
    ],
    "nut": [
        "Calories > 462 kcal",
        "Carbs > 27.4 g",
        "Cholesterol > 102 mg",
        "Fat > 27.2 g",
        "Protein > 26.2 g",
        "Sodium > 938 mg"
    ],
    "n": "Barbeque Chicken Pasagna",
    "a": "Fred Norris",
    "r": "0",
    "s": 12,
    "des": "\"This is a unique recipe I created, that combines the idea of a bbq chicken pizza that is layered like a lasagna. I have won first place with this recipe. I hope you enjoy it!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nHeat 2 tablespoons olive oil in a large skillet over medium-high heat.  Cook chicken in the oil until lightly browned, about 5 minutes.  Stir the onion, green bell pepper, garlic, and barbecue sauce into the skillet.  Cook and stir until vegetables are tender, 5 to 6 minutes.\nRemove phyllo dough from package and unfold onto a baking sheet. Cover with a damp kitchen towel to prevent the dough from drying out.  Melt the butter in a small saucepan.  Use a pastry brush to grease a 9x13 inch baking dish with the butter. Place 4 sheets of phyllo dough in bottom of the prepared pan; brush top of phyllo with butter.  Spread a thin layer of chicken mixture on the top of the phyllo; sprinkle layer with cheese.  Place 2 sheets of phyllo dough on top of the cheese; brush with butter.  Continue layering chicken mixture, cheese, and buttered phyllo until chicken mixture is gone.  Top final layer of chicken with cheese and 2 sheets of phyllo dough, brush top with butter, and sprinkle with remaining cheese and Italian seasoning.\nBake in the preheated oven until hot and bubbly, about 30 to 35 minutes.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "562716.jpg",
    "o": "",
    "st": "allrecipes"
}