{
    "id": 15706,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup raisins",
        "1/4 cup Scotch whiskey",
        "7 (1 ounce) squares German sweet chocolate, chopped",
        "1/2 cup butter",
        "3 egg yolks",
        "3 egg whites",
        "2/3 cup white sugar",
        "4 1/2 tablespoons cake flour",
        "2/3 cup finely ground almonds",
        "1 pinch salt",
        "3 (1 ounce) squares German sweet chocolate, chopped",
        "3 tablespoons confectioners' sugar",
        "3 tablespoons butter"
    ],
    "nut": [
        "Calories > 366 kcal",
        "Carbs > 34 g",
        "Cholesterol > 79 mg",
        "Fat > 24.5 g",
        "Protein > 4.9 g",
        "Sodium > 127 mg"
    ],
    "n": "Chocolate Scotch Whiskey Cake",
    "a": "MARBALET",
    "r": "0",
    "s": 12,
    "des": "\"Made with German's sweet chocolate, raisins, whiskey and almonds. Best if made a day in advance, and it gets better the longer it sits.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). In a small bowl, combine raisins and scotch whiskey and set aside. Cut a round of parchment paper the size of the bottom of the cake pan. Butter the sides of the pan and one side of the paper. Then lay the paper, butter side up, in the pan and dust thoroughly with flour.\nPlace 7 ounces chocolate in the top of a double boiler with 3 tablespoons of water. Stir until melted and smooth. Remove from heat and stir in 1/2 cup butter in small pieces. In a large bowl, beat the egg yolks with the sugar until the mixture is a pale creamy yellow. Combine with the chocolate mixture. In a small bowl, combine the flour and the ground almonds and add to the batter. Stir in the raisins and whiskey.\nIn a clean large bowl, whip the egg whites with a pinch of salt until they are stiff but not dry.  Stir a third of the egg whites into the chocolate mixture to lighten it, then fold all back into the remaining egg whites. Pour the cake mixture into the pan.\nBake at 375 degrees F (190 degrees C) for 20 minutes. The outside should be firm, but the center  should remain moist. Let the cake sit for 10 minutes in the pan, then unmold it on a cake rack and let it cool for a few hours or overnight. Peel off the paper before icing it.\nTo make the frosting:  Melt 3 ounces chocolate in the top of a double boiler. Stir in the confectioners sugar and then 3 tablespoons butter a little at a time. Blend well and spread immediately on the cake. Allow icing to set for about half an hour before serving the cake.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "1045310.jpg",
    "o": "",
    "st": "allrecipes"
}