{
    "id": 15724,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 pounds apples - peeled, cored and sliced",
        "4 teaspoons lemon juice",
        "3/4 cup white sugar",
        "3/4 cup packed brown sugar",
        "1 teaspoon ground cinnamon",
        "5 cups all-purpose flour",
        "4 teaspoons white sugar",
        "2 teaspoons salt",
        "1/2 teaspoon baking powder",
        "1 1/2 cups shortening",
        "2 egg yolks",
        "1/4 cup water, or as needed",
        "2 cups sifted confectioners' sugar",
        "1 teaspoon vanilla extract",
        "2 tablespoons butter, melted",
        "4 tablespoons milk"
    ],
    "nut": [
        "Calories > 439 kcal",
        "Carbs > 68.9 g",
        "Cholesterol > 24 mg",
        "Fat > 17.5 g",
        "Protein > 3.9 g",
        "Sodium > 259 mg"
    ],
    "n": "Farm Apple Pie",
    "a": "Brenda",
    "r": "0",
    "s": 20,
    "des": "\"A large apple pie that can be eaten with your hands.  My aunt used to make it for our family gatherings.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Place apples in a bowl, and toss with lemon juice.\nMix 3/4 cup white sugar and 3/4 cup brown sugar with cinnamon, set aside.\nIn a large bowl, mix flour, 4 teaspoons sugar, salt, and baking powder.  Cut in shortening.  Beat egg yolks in a 1 cup measuring cup, add water to make 1 cup. Stir into flour mixture to form the pastry.\nDivide pastry in about half.  Use the larger portion for the bottom crust.  Roll out bottom crust to fit the bottom and extended up and over the sides of jelly roll pan (pan is about 10 X 15 inches). Place crust in the pan.\nAlternate layers of apples and sugar mixture on the bottom crust.\nRoll out the top crust slightly larger than the jelly roll pan, and place on top of the apple filling.  Turn the extended top crust under the bottom crust at the edges and pinch to seal.  Make small slits in top crust to allow steam to escape.\nBake at 400 degrees F (200 degrees C) for 50 minutes or until the top crust is browned.\nTo make glaze, combine confectioners sugar, vanilla, butter, and milk until mixture has consistency of a glaze. Drizzle glaze over the top of the pie while it is still warm.  Cut into squares to serve.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "635611.jpg",
    "o": "",
    "st": "allrecipes"
}