{
    "id": 15723,
    "old_rating": "4.42308",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter",
        "2 cups white sugar",
        "3 cups all-purpose flour",
        "6 eggs",
        "2 teaspoons baking powder",
        "1 cup warm milk (110 degrees F/45 degrees C)",
        "1/2 teaspoon baking soda",
        "1 tablespoon fresh lemon juice",
        "1/4 cup blanched slivered almonds",
        "2 tablespoons white sugar"
    ],
    "nut": [
        "Calories > 447 kcal",
        "Carbs > 61.2 g",
        "Cholesterol > 135 mg",
        "Fat > 19.7 g",
        "Protein > 7.7 g",
        "Sodium > 287 mg"
    ],
    "n": "Vaselopita - Greek New Years Cake",
    "a": "Paul Menikos",
    "r": "0",
    "s": 12,
    "des": "\"Traditional Greek New Years Day bread.  Served as a coffee cake for breakfast.  Also the person who receives the quarter inside gets good luck for 1 year!\"",
    "ins": "Preheat oven to  350 degrees F (175 degrees C). Generously grease a 10 inch round cake pan.\nIn a medium bowl, cream the butter and sugar together until light. Stir in the flour and mix until the mixture is mealy. Add the eggs one at a time, mixing well after each addition. Combine the baking powder and milk, add to the egg mixture, mix well. Then combine the lemon juice and baking soda, stir into the batter. Pour into the prepared cake pan.\nBake for 20  minutes in the preheated oven. Remove and sprinkle the nuts and sugar over the cake, then return it to the oven for 20 to 30 additional minutes, until cake springs back to the touch. Gently cut a small hole in the cake and place a quarter in the hole. Try to cover the hole with sugar. Cool cake on a rack for 10 minutes before inverting onto a plate.\nServe cake warm. Each person in the family gets a slice starting with the youngest. The person who gets the quarter in their piece, gets good luck for the whole year!",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "326838.jpg",
    "o": "4410953.jpg,3062707.jpg,1896147.jpg,1083117.jpg,770732.jpg,324672.jpg",
    "st": "allrecipes"
}