{
    "id": 15739,
    "old_rating": "4.65125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1 teaspoon salt",
        "3/4 cup shortening",
        "6 tablespoons cold water",
        "1 teaspoon distilled white vinegar",
        "4 eggs, lightly beaten",
        "1/4 cup packed brown sugar",
        "1/4 cup white sugar",
        "1/2 teaspoon salt",
        "1 cup light corn syrup",
        "2 tablespoons butter, melted",
        "1 teaspoon vanilla extract",
        "1 cup chopped pecans",
        "1 tablespoon bourbon (optional)",
        "1/3 cup packed brown sugar",
        "3 tablespoons butter",
        "3 tablespoons honey",
        "1 1/2 cups pecan halves"
    ],
    "nut": [
        "Calories > 848 kcal",
        "Carbs > 88.8 g",
        "Cholesterol > 112 mg",
        "Fat > 53.6 g",
        "Protein > 9.6 g",
        "Sodium > 553 mg"
    ],
    "n": "Honey Crunch Pecan Pie",
    "a": "Sarah Spaugh",
    "r": "0",
    "s": 8,
    "des": "\"This is the winner of First Place in the Nut Category, as well as winner of the Best of Show award for the American Pie Council's 2000 National Pie Championship.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nTo Make Crust: In a medium bowl, mix together flour and 1 teaspoon salt. Cut in shortening until mixture is crumbly. Gradually add water and vinegar. Cut together until mixture will hold together. Press dough into a ball and flour each side lightly. Wrap in plastic and chill for 20 minutes. Roll out between wax paper into a circle 1/8 inch thick and press into 9 inch pie pan.\nTo Make Filling: In a large bowl, combine eggs, 1/4 cup brown sugar, white sugar, 1/2 teaspoon salt, corn syrup, melted butter, vanilla extract, and chopped pecans. Add bourbon if desired. Mix well. Spoon mixture into unbaked pie shell.\nBake in preheated oven for 15 minutes. Remove and cover edges of pastry with aluminum foil. Return to oven for 20 minutes.\nTo Make Topping: Combine 1/3 cup brown sugar, butter or margarine, and honey in a medium saucepan. Cook over low heat, stirring occasionally, until sugar dissolves - about 2 minutes. Add pecans. Stir just until coated. Spoon topping evenly over pie.\nKeep foil on edges of pastry and return pie to oven for an additional 10 to 20 minutes, until topping is bubbly and golden brown. Cool to room temperature before serving.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "2 h ",
    "i": "2898253.jpg",
    "o": "4459259.jpg,4227217.jpg,4206991.jpg,4193407.jpg,2876909.jpg,1882106.jpg",
    "st": "allrecipes"
}