{
    "id": 15764,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package phyllo dough",
        "1/2 cup butter, melted",
        "1 tablespoon olive oil",
        "1 onion, finely diced",
        "1 clove garlic, crushed",
        "2 skinless, boneless chicken breast halves - cut into cubes",
        "2 tablespoons chopped crystallized ginger",
        "2 tablespoons capers",
        "2 (8 ounce) containers creme fraiche",
        "1 dash hot chile sauce, or to taste",
        "1 teaspoon ground curry powder, or to taste",
        "salt and pepper to taste",
        "1 (16.5 ounce) can pitted dark sweet cherries, drained",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 761 kcal",
        "Carbs > 56.6 g",
        "Cholesterol > 173 mg",
        "Fat > 53 g",
        "Protein > 19.5 g",
        "Sodium > 662 mg"
    ],
    "n": "Chicken-Cherry Pie",
    "a": "Ruth",
    "r": "0",
    "s": 6,
    "des": "\"Sounds strange, but makes a wonderful casserole style pie.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Lightly grease a 1-quart casserole dish.\nUnroll phyllo dough and lay a slightly damp dishtowel over it. Carefully lift one sheet of dough from stack and fit into greased casserole dish. Brush sheet of dough very lightly with melted butter or margarine. Repeat process with 9 more sheets of phyllo dough. Keep unused dough covered with damp towel as much as possible, to prevent drying out. Cover phyllo-lined dish with plastic wrap and set aside.\nPlace a medium-size skillet over medium heat. Pour olive oil into pan. Saute onion until limp, approximately 5 minutes. Add garlic and chicken, and saute until chicken is browned on the outside and cooked through.\nAdd ginger, capers, creme fraiche, chili sauce, curry powder, and salt and pepper to skillet. Stir in cherries, then taste to check seasoning. Simmer until cherries are heated through.\nRemove plastic wrap from casserole dish and pour in chicken mixture. Cover mixture with a sheet of phyllo dough. Brush very lightly with melted butter or margarine. Repeat process with 9 more sheets of phyllo. Brush top layer of phyllo with butter or margarine, then sprinkle with parmesan cheese.\nBake in preheated oven for 35 to 40 minutes, until golden brown.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}