{
    "id": 15772,
    "old_rating": "3.82143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/2 cups low fat, low sodium chicken broth",
        "3 onions, diced",
        "6 cups diced whole-grain bread",
        "1 tablespoon paprika",
        "1/4 cup egg substitute",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 67 kcal",
        "Carbs > 10.7 g",
        "Cholesterol > < 1 mg",
        "Fat > 1.1 g",
        "Protein > 3.9 g",
        "Sodium > 165 mg"
    ],
    "n": "Basic Bread Stuffing",
    "a": "Robyn Webb",
    "r": "0",
    "s": 12,
    "des": "\"This is a basic bread stuffing for a 12 pound turkey; it also includes seven variations. Preparation time is 20 minutes. This recipe is from The WEBB Cooks, articles and recipes by Robyn Webb, courtesy of the American Diabetes Association.\"",
    "ins": "In a skillet over medium-high heat, heat 1/2 cup of the chicken broth. Add the onions and cook for 10 minutes until onions have softened.\nIn a bowl, combine the cooked onions, remaining broth, bread, paprika, egg substitute and salt and pepper. Mix well.\nPlace mixture inside the cavity of a turkey or place it in a casserole dish. If stuffing is to be baked separately from the turkey, place stuffing in a preheated 350-degree oven and bake for 45 minutes.\nVariations include - Herb Stuffing: Add 1 tablespoon mixed chopped sage, rosemary, and parsley. Fruit Stuffing: Add 1/2 cup diced tart apples, washed cranberries, or diced pears. Sweet Stuffing: Add 1 teaspoon allspice, cinnamon, nutmeg, or ginger. Mushroom Stuffing: Add 1 cup sliced mushrooms (white or wild). Saute with the onions. Cook until mushrooms are soft. Chestnut Stuffing: Add 1 cup roasted chestnuts, peeled (chestnuts are low in fat). To save time, use a jar of water-packed chestnuts (some grocers stock these around the holidays) instead of roasting the chestnuts. Dried Fruit Stuffing: Add 1 cup diced dried apricots, apples, figs, cranberries, or cherries. Corn Bread Stuffing: Replace 3 cups of the whole-grain bread with 3 cups cornbread.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "914836.jpg",
    "o": "",
    "st": "allrecipes"
}