{
    "id": 15785,
    "old_rating": "4.54545",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Pastry Dough:",
        "4 1/2 cups all-purpose flour",
        "1 1/4 cups white sugar",
        "1/4 teaspoon salt",
        "1 1/8 cups unsalted butter",
        "4 eggs, beaten",
        "2 teaspoons vanilla extract",
        "Apple Filling:",
        "4 Granny Smith apples - peeled, cored and chopped",
        "1/4 cup brown sugar",
        "1/4 teaspoon ground cinnamon",
        "1/2 cup chopped walnuts",
        "4 ounces apricot jam (if using jam, use less sugar) (optional)"
    ],
    "nut": [
        "Calories > 388 kcal",
        "Carbs > 55.8 g",
        "Cholesterol > 79 mg",
        "Fat > 16.3 g",
        "Protein > 6 g",
        "Sodium > 60 mg"
    ],
    "n": "Fresh Apple Tarts",
    "a": "Punkin",
    "r": "0",
    "s": 16,
    "des": "\"These tarts are easy to make and bake. White sugar may be used in place of brown sugar.\"",
    "ins": "In a large bowl, mix together flour, 1 1/4 cups sugar, and salt. Cut in butter until mixture is crumbly. Mix in eggs and vanilla extract until dough forms a ball. Wrap in plastic and refrigerate for at least 1 hour but not more than 1 day.\nWhile the dough is chilling, prepare the apple filling.\nIn a medium bowl, toss diced apples with sugar and cinnamon. Mix in walnuts.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease 16 3-inch tart pans. Remove tart dough from the refrigerator and let it stand at room temperature for 30 minutes before rolling out.\nKnead dough briefly on a lightly floured surface. Cut into 16 equal portions. Roll each portion into a 6-inch circle, and carefully fit one circle into each tart pan.\nSpoon an equal amount of apple mixture into each tart pan. Fold pastry over filling. Place filled tarts on a baking sheet.\nBake in preheated oven until golden brown, about 30 minutes. Melt apricot jam and brush over finished tarts, if desired.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "852593.jpg",
    "o": "",
    "st": "allrecipes"
}