{
    "id": 157918,
    "old_rating": "4.38889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 quarts vegetable broth",
        "2 cups water",
        "2 cups fresh green beans - rinsed, trimmed, and snapped into bite-size pieces",
        "4 zucchini, cut into small cubes",
        "3 carrots, cut into bite size pieces",
        "4 potatoes, cut into bite sized pieces",
        "1 bunch basil, leaves picked from stems",
        "10 cloves garlic, minced",
        "3 tomatoes, chopped",
        "1/2 cup olive oil",
        "1 teaspoon salt",
        "1 (15 ounce) can kidney beans, drained and rinsed",
        "1 (15.5 ounce) can white beans, drained and rinsed",
        "1 (14.5 ounce) can diced tomatoes",
        "1 (8 ounce) package spaghetti, broken into 2-inch pieces",
        "1/2 cup shredded Gruyere cheese",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 456 kcal",
        "Carbs > 63 g",
        "Cholesterol > 11 mg",
        "Fat > 15.7 g",
        "Protein > 17.1 g",
        "Sodium > 1056 mg"
    ],
    "n": "Pistou Soup",
    "a": "somaluna",
    "r": "0",
    "s": 10,
    "des": "\"My mom brought this recipe back from a cooking class in Provence. Pistou is the French word for pesto. This is a wonderful tasting fresh vegetable soup. We've made it 3 times in just one month! It is so easy, healthy, filling, and delicious (better the next day). Can be served as a dinner meal with some crusty bread and wine.\"",
    "ins": "Bring the vegetable broth and water to a boil in a large pot. Stir in the green beans, zucchini, carrots, and potatoes. Return to a boil, reduce heat to medium-low, and simmer 45 minutes.\nMeanwhile, prepare the pistou by processing the basil leaves, garlic, tomatoes, olive oil, and salt together in a food processor until finely chopped; set aside.\nStir the kidney beans, white beans, canned diced tomatoes, and spaghetti into the soup and return to a simmer. Cook until the spaghetti is tender, about 10 minutes. Remove the soup from the heat and stir in the pistou. Sprinkle with Gruyere cheese and Parmesan cheese to serve.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "3796205.jpg",
    "o": "",
    "st": "allrecipes"
}