{
    "id": 158162,
    "old_rating": "4.23077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package mostaccioli or medium tube pasta",
        "1 tablespoon olive oil",
        "1 yellow onion, chopped",
        "1 pound ground venison",
        "1 (15 ounce) can tomato sauce",
        "1/4 teaspoon dried basil",
        "1/8 teaspoon garlic powder",
        "salt and pepper to taste",
        "1/4 cup grated Parmesan cheese",
        "3 cups grated Mozzarella cheese"
    ],
    "nut": [
        "Calories > 417 kcal",
        "Carbs > 47.6 g",
        "Cholesterol > 70 mg",
        "Fat > 11.9 g",
        "Protein > 30.7 g",
        "Sodium > 608 mg"
    ],
    "n": "Venison Mostaccioli Casserole",
    "a": "IronChefLaurie",
    "r": "0",
    "s": 8,
    "des": "\"Have a freezer full of venison? This wholesome recipe is perfect for using your pre-packaged ground venison meat. My three and six-year-olds love it, and it isn't gamey tasting at all!!\"",
    "ins": "Preheat oven to 375  degrees F (190 degrees C). Lightly grease a 9x13 inch baking dish.\nBring a large pot of lightly salted water to a boil. Add the pasta and cook until al dente, about 8 to 10 minutes. Drain and reserve pasta.\nMeanwhile, place the olive oil into a skillet set over medium-high heat. Stir in the onion, and cook until soft and translucent, about 5 minutes. Add the venison and cook until crumbled and no longer pink, about 10 minutes. Drain, if necessary. Stir in the tomato sauce, basil, and garlic powder. Season to taste with salt and pepper, and turn off the heat.\nAssemble the casserole by spooning a layer of the venison sauce over the bottom of the prepared baking dish. Sprinkle the sauce with Parmesan cheese, and layer with cooked pasta. Top with the sauce, layer with pasta, and half of the Mozzarella. Repeat the layers to use the remaining ingredients, ending with a layer of Mozzarella cheese. Cover the dish with aluminum foil.\nBake in preheated oven for 20 minutes. Remove the foil cover and bake until the cheese topping is light gold, about 10 minutes more.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "3570778.jpg",
    "o": "",
    "st": "allrecipes"
}