{
    "id": 158229,
    "old_rating": "4.53846",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 pounds Korean-style short ribs (beef chuck flanken, cut 1/3 to 1/2 inch thick across bones)",
        "1/2 cup reduced-sodium soy sauce",
        "1/2 cup white sugar",
        "2 tablespoons honey",
        "2 tablespoons minced garlic",
        "2 tablespoons ground black pepper",
        "3 tablespoons water",
        "1 tablespoon Asian (toasted) sesame oil",
        "1 1/2 tablespoons Asian plum wine"
    ],
    "nut": [
        "Calories > 692 kcal",
        "Carbs > 46.5 g",
        "Cholesterol > 123 mg",
        "Fat > 26.6 g",
        "Protein > 42.3 g",
        "Sodium > 787 mg"
    ],
    "n": "The Real Deal Korean Beef Ribs",
    "a": "KoreanITGal",
    "r": "0",
    "s": 6,
    "des": "\"This is an authentic Korean beef rib recipe, not the Americanized version. This is super easy and a crowd pleaser. This is for 4 pounds of ribs. I find 2 tablespoons of honey is perfect for a not-so-sweet rib. This gives you the perfect amount of tanginess. However, if you like it sweeter you can add up to 3 tablespoons.  \"",
    "ins": "Wash the ribs, removing any stray bits of bone, and allow to drain for 30 minutes.\nWhisk together the soy sauce, sugar, honey, garlic, pepper, water, sesame oil, and plum wine until the sugar has dissolved; pour the mixture into a 1 gallon plastic zipper bag. Place the ribs into the marinade, squeeze all the air out of the bag, zip it up, and refrigerate at least 24 hours.\nThe next day, remove the ribs from the refrigerator and allow to come to room temperature before grilling.  Remove the ribs from the marinade and discard the marinade.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate. Grill the ribs until browned and no longer pink inside, 4 to 6 minutes per side.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "1 d ",
    "i": "845264.jpg",
    "o": "",
    "st": "allrecipes"
}