{
    "id": 15860,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 quarts green tomatoes, minced",
        "8 quarts minced, cored apples",
        "1/2 pound beef suet",
        "6 pounds brown sugar",
        "1 cup distilled white vinegar",
        "2 tablespoons salt",
        "2 tablespoons ground cinnamon",
        "2 tablespoons ground cloves",
        "2 tablespoons ground allspice",
        "2 pounds raisins",
        "32 ounces candied mixed citrus peel (optional)",
        "7 large orange, peeled, sectioned, and cut into bite-size",
        "2 lemons, finely chopped"
    ],
    "nut": [
        "Calories > 179 kcal",
        "Carbs > 42.1 g",
        "Cholesterol > 1 mg",
        "Fat > 2 g",
        "Protein > 0.9 g",
        "Sodium > 126 mg"
    ],
    "n": "Green Tomato Mincemeat",
    "a": "April",
    "r": "0",
    "s": 120,
    "des": "\"This makes about 30 pints of mincemeat. Have on hand 30 pint canning jars with brand-new rings and lids. Reusing old lids is not recommended. A delicious way to use green tomatoes. The recipe came from my grandfather, and our family has been making it forever! Use straight from the jar for pies, cookies, muffins, or cake.\"",
    "ins": "In a very large stock pot, combine green tomatoes, apples, suet (or oil), brown sugar, vinegar, chopped oranges, chopped lemons, raisins, and candied peel. Season with salt, cinnamon, cloves and allspice. Cover, and cook over low heat for 3 hours.\nSterilize 30 (1 pint) canning jars and lids according to manufacturer's instructions.\nLadle filling into the sterilized jars, leaving 1/2 inch head space. Wipe the jar with a clean, damp cloth. Cover with jars with lids, and screw on jar rings.\nHeat water in a hot water canner. Place jars in rack, and slowly lower jars into canner. The water should cover the jars completely, and should be hot but not boiling. Bring water to a boil, and process for 10 minutes.",
    "pt": "45 m",
    "ct": "3 h",
    "tt": "4 h ",
    "i": "914136.jpg",
    "o": "",
    "st": "allrecipes"
}