{
    "id": 158634,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups chopped pistachio nuts",
        "1 cup panko bread crumbs",
        "2 egg whites",
        "4 skinless, boneless chicken breast halves",
        "salt and black pepper to taste",
        "1 tablespoon vegetable oil",
        "2 tablespoons butter",
        "Sauce:",
        "1 teaspoon butter",
        "2 shallots, finely chopped",
        "1/2 cup red wine",
        "4 ounces dried cherries",
        "1 cup freshly squeezed orange juice",
        "1 1/2 cups chicken stock",
        "1 teaspoon grated orange zest"
    ],
    "nut": [
        "Calories > 894 kcal",
        "Carbs > 73.5 g",
        "Cholesterol > 85 mg",
        "Fat > 51.1 g",
        "Protein > 40.6 g",
        "Sodium > 963 mg"
    ],
    "n": "Pistachio Crusted Chicken Breasts with Sun-Dried Cherry and Orange Sauce",
    "a": "Nanci",
    "r": "0",
    "s": 4,
    "des": "\"The pistachio nut crust gives the chicken a great flavor, and the sauce is manna from Heaven. Truly. \"",
    "ins": "Preheat the oven to 325 degrees F (165 degrees C). Mix together the pistachios and bread crumbs in a bowl. Beat the egg whites in a separate bowl, and set aside.\nSeason the chicken breasts with salt and pepper, gently dip them into the beaten egg whites, and then press into the pistachio-bread crumb mixture to coat. Gently toss between your hands so any coating that hasn't stuck can fall away.\nHeat the oil and butter in an oven-safe skillet over medium heat. Gently place the chicken breasts into the hot skillet, and fry for 5 to 8 minutes, until the bottom coating is golden brown and crisp.\nTurn the chicken over in the skillet, and place the skillet in the preheated oven. Bake for about 30 minutes, until the chicken is no longer pink, the juices run clear, and the top coating is lightly browned.\nWhile the chicken is baking, melt 1 teaspoon of butter in a saucepan over medium-low heat, add the shallots, and cook for 2 to 3 minutes until tender. Pour in the wine, drop in the cherries, and cook and stir for about 10 minutes to reduce wine to a glaze. Pour in the orange juice, chicken stock, and orange zest, and cook and stir about 20 more minutes, until sauce is reduced and thickened.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "535631.jpg",
    "o": "",
    "st": "allrecipes"
}