{
    "id": 158733,
    "old_rating": "4.44286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons olive oil",
        "1 onion, diced",
        "1 clove garlic, crushed",
        "1 cup Arborio rice",
        "1 stalk celery, diced",
        "1/3 cup dry white wine",
        "4 cups boiling chicken stock",
        "1 cup broccoli florets",
        "3/4 cup sugar snap peas, halved",
        "1 cup thinly sliced zucchini",
        "1 cup fresh green beans, cut into 1 inch pieces",
        "1/3 cup crumbled reduced-fat feta cheese",
        "2 tablespoons chopped fresh parsley (optional)"
    ],
    "nut": [
        "Calories > 368 kcal",
        "Carbs > 56.3 g",
        "Cholesterol > 8 mg",
        "Fat > 9.8 g",
        "Protein > 11.5 g",
        "Sodium > 984 mg"
    ],
    "n": "Emerald Green Risotto",
    "a": "Louiselombard",
    "r": "0",
    "s": 4,
    "des": "\"My husband and I love risotto, but also prefer to eat healthily, so we came up with this compromise between the two.  We use homemade stock to keep the fat and salt down.  This recipe can easily be made vegetarian or vegan by using veggie stock and leaving out the cheese.\"",
    "ins": "Heat olive oil in a large, heavy-bottomed saucepan over medium-high heat. Add the onion and garlic; cook and stir until the onion begins to turn golden brown at the edges, about 2 minutes. Pour in the rice, and stir until the rice is coated in oil and has started to toast, 3 to 4 minutes. Reduce the heat to medium and stir in the celery and white wine.\nCook and stir until the wine has mostly evaporated, then stir in one third of the boiling chicken stock; continue stirring until incorporated. Repeat this process twice more, stirring constantly. Stirring in the broth should take 15 to 20 minutes in all. Add the broccoli, peas, zucchini, and green beans during the last 7 minutes of cooking, and cook until tender. Stir in the feta cheese and parsley before serving.",
    "pt": "35 m",
    "ct": "25 m",
    "tt": "1 h",
    "i": "1912643.jpg",
    "o": "",
    "st": "allrecipes"
}