{
    "id": 15897,
    "old_rating": "3.8125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (9 inch) pie crust, baked",
        "5 tablespoons cornstarch",
        "1 cup white sugar",
        "1/4 teaspoon salt",
        "2 cups water",
        "3 egg yolks",
        "2 tablespoons butter",
        "5 tablespoons lemon juice",
        "2 teaspoons lemon zest",
        "3 egg whites",
        "6 tablespoons white sugar"
    ],
    "nut": [
        "Calories > 287 kcal",
        "Carbs > 48 g",
        "Cholesterol > 84 mg",
        "Fat > 9.7 g",
        "Protein > 3.1 g",
        "Sodium > 219 mg"
    ],
    "n": "Old Fashioned Lemon Pie",
    "a": "Pat",
    "r": "0",
    "s": 8,
    "des": "\"This recipe came from a very old and dear friend, and it combines just the right amount of tartness and sweetness.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nTo Make Lemon Filling: In a double boiler, combine cornstarch, sugar, and salt. Stir in water, mixing well. Cook until mixture is thickened, stirring frequently. Remove from heat.\nPlace egg yolks in a medium bowl and beat well. Slowly pour 1/2 cup of cornstarch mixture into egg yolks, whisking constantly.\nPour egg yolk mixture back into cornstarch mixture in double boiler, continuing to  whisk constantly. Return double boiler to heat and cook mixture 2 minutes longer, stirring constantly. Remove from heat.\nStir butter or margarine, lemon juice, and lemon rind into thickened mixture. Allow mixture to cool, then pour into pie shell.\nTo Make Meringue: In a large metal or glass mixing bowl, beat egg whites until foamy. Add 6 tablespoons sugar a little at a time, continuing to beat until all sugar is incorporated and whites are stiff. Spread meringue into pie shell, making sure to completely cover lemon filling.\nBake in preheated oven for 15 minutes, just until meringue is golden brown. Chill before serving.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "1119153.jpg",
    "o": "",
    "st": "allrecipes"
}