{
    "id": 15901,
    "old_rating": "4.57229",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups Burgundy wine",
        "1 1/2 cups canola oil",
        "1 1/2 cups soy sauce",
        "2 cups oyster sauce",
        "1 tablespoon garlic, minced",
        "1 1/2 teaspoons dried oregano",
        "8 (6 ounce) fillets filet mignon",
        "1/2 cup butter, softened",
        "1 teaspoon Burgundy wine",
        "1 tablespoon minced shallots",
        "1 tablespoon minced green onions",
        "1 teaspoon ground white pepper"
    ],
    "nut": [
        "Calories > 883 kcal",
        "Carbs > 8 g",
        "Cholesterol > 116 mg",
        "Fat > 73.8 g",
        "Protein > 28.9 g",
        "Sodium > 3290 mg"
    ],
    "n": "Lover's Beef Burgundy Filet",
    "a": "ttinkerbel",
    "r": "0",
    "s": 8,
    "des": "\"One must be very careful who this is prepared for. Like a magic love potion, it brings out the lover in ANYone. Through trial and error, I learned very quickly not to prepare this for a mere 'casual date' UNLESS you want that 'casual date' to become 'more'....\"",
    "ins": "In a medium saucepan, mix together Burgundy wine, canola oil, soy sauce, oyster sauce, garlic and oregano. Bring to a boil, and then remove from heat. Place in the refrigerator 1 hour, or until chilled.\nPlace filet mignon filets in a 9x13 inch baking dish, and pour the chilled marinade over them. Cover tightly with foil, and refrigerate for a minimum of 5 hours.\nIn a medium bowl, cream butter and 1 teaspoon of Burgundy wine with a hand mixer. Mix in shallots, green onions and white pepper by hand; cover tightly, and refrigerate.\nPreheat an outdoor grill for high heat, and lightly oil grate. Preheat oven to 200 degrees F (95 degrees C).\nGrill marinated filets to desired doneness, turning once. Place filets in a clean 9x13 inch baking dish. Dollop with the Burgundy butter mixture, and place in the preheated oven for a minute, or until butter is melted.",
    "pt": "40 m",
    "ct": "20 m",
    "tt": "6 h ",
    "i": "70803.jpg",
    "o": "",
    "st": "allrecipes"
}