{
    "id": 15908,
    "old_rating": "4.63456",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 recipe pastry for a 9 inch double crust deep dish pie",
        "1/2 cup packed brown sugar",
        "1/4 cup butter, melted",
        "1/3 cup all-purpose flour",
        "5 cups thinly sliced apples",
        "2/3 cup white sugar",
        "3 tablespoons all-purpose flour",
        "2 teaspoons ground cinnamon",
        "1 teaspoon lemon juice",
        "20 caramels, halved",
        "2 tablespoons milk"
    ],
    "nut": [
        "Calories > 546 kcal",
        "Carbs > 87.4 g",
        "Cholesterol > 17 mg",
        "Fat > 21.4 g",
        "Protein > 4.2 g",
        "Sodium > 371 mg"
    ],
    "n": "Caramel Apple Pie II",
    "a": "Emtmom",
    "r": "0",
    "s": 8,
    "des": "\"This is a gooey sweet pie that tastes best warm. Microwave reheats well!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nTo Make Taffy: In a small bowl combine brown sugar, melted butter or margarine, and 1/3 cup flour. Mix well and set aside.\nTo Make Apple Filling: Place apples in a large bowl. Add white sugar, 3 tablespoons flour, cinnamon, and lemon juice. Toss until all ingredients are mixed well and apples are thoroughly coated.\nSpoon half of apple filling into pastry-lined deep-dish pan. Top with half of caramels and half of taffy mixture. Repeat process with remaining apple filling, caramels and taffy mixture. Place top pastry over filling and seal well (this is very important--if edges are not sealed, caramel will leak out all over). Cut steam vents and brush top crust with milk or light cream.\nCover pie with foil and place on a baking sheet. Bake in preheated oven for 25 minutes. Remove foil from pie and bake for another 20 to 25 minutes, until crust is golden. Serve warm.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "638658.jpg",
    "o": "4057570.jpg,2892942.jpg,2880015.jpg,2616490.jpg,1756129.jpg,1751406.jpg",
    "st": "allrecipes"
}