{
    "id": 15925,
    "old_rating": "4.51837",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 russet potatoes, sliced into 1/4 inch slices",
        "1 onion, sliced into rings",
        "salt and pepper to taste",
        "3 tablespoons butter",
        "3 tablespoons all-purpose flour",
        "1/2 teaspoon salt",
        "2 cups milk",
        "1 1/2 cups shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 499 kcal",
        "Carbs > 49.3 g",
        "Cholesterol > 77 mg",
        "Fat > 25.4 g",
        "Protein > 19.8 g",
        "Sodium > 683 mg"
    ],
    "n": "Creamy Au Gratin Potatoes",
    "a": "CathyM",
    "r": "0",
    "s": 4,
    "des": "\"This is my husband's favorite dish, and he considers it a special occasion every time I make it. The creamy cheese sauce and the tender potatoes in this classic French dish combine to make a deliciously addictive experience. It's a great side dish with a roast pork loin or beef tenderloin. Add a green salad and French bread, and you have found the magic path to a man's heart. To avoid lumps in your sauce, add the milk just a little at a time as you stir the flour and butter. Experiment with different cheeses for variety.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Butter a 1 quart casserole dish.\nLayer 1/2 of the potatoes into bottom of the prepared casserole dish. Top with the onion slices, and add the remaining potatoes. Season with salt and pepper to taste.\nIn a medium-size saucepan, melt butter over medium heat. Mix in the flour and salt, and stir constantly with a whisk for one minute. Stir in milk. Cook until mixture has thickened. Stir in cheese all at once, and continue stirring until melted, about 30 to 60 seconds. Pour cheese over the potatoes, and cover the dish with aluminum foil.\nBake 1 1/2 hours in the preheated oven.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "4539062.jpg",
    "o": "4539062.jpg,4527674.jpg,4521421.jpg,4518873.jpg,4518232.jpg,4508140.jpg",
    "st": "allrecipes"
}