{
    "id": 159345,
    "old_rating": "4.47761",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound skinless, boneless chicken thighs",
        "2 cups chicken stock",
        "4 cups water",
        "3 tablespoons olive oil",
        "1 large onion, thinly sliced",
        "6 cloves garlic, chopped",
        "2 large potatoes, cubed",
        "1 (16 ounce) can garbanzo beans, drained",
        "1 (10 ounce) bag fresh spinach",
        "1/2 cup diced roasted red peppers (optional)",
        "salt and pepper to taste",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 297 kcal",
        "Carbs > 33.8 g",
        "Cholesterol > 37 mg",
        "Fat > 10.8 g",
        "Protein > 17.1 g",
        "Sodium > 504 mg"
    ],
    "n": "Chicken, Spinach, and Potato Soup",
    "a": "Catherine Ann",
    "r": "0",
    "s": 8,
    "des": "\"This delicious, fresh soup combines all of the great features of a full dinner into one bowl.\"",
    "ins": "Bring chicken thighs, chicken stock, and water to a simmer in a large saucepan over medium-high heat. Reduce heat to medium-low, and continue simmer in  until the chicken is no longer pink in the center, about 20 minutes. Remove the chicken thighs, and set aside to cool. Reserve the broth.\nWhile the thighs are cooling, heat olive oil in a large pot over medium heat. Stir in onion and garlic. Cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the potatoes, then strain the reserved cooking liquid into the pot. Bring to a boil over high heat, then reduce heat to medium-low, and simmer until the potatoes are tender, about 25 minutes.\nCut the cooked chicken into cubes and add to the simmering potatoes. Cook for 5 minutes, then stir in the garbanzo beans, spinach, and roasted pepper; simmer 10 more minutes. Season to taste with salt and pepper, and sprinkle with grated Parmesan cheese before serving.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "3964499.jpg",
    "o": "",
    "st": "allrecipes"
}