{
    "id": 15947,
    "old_rating": "4.62195",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (9 inch) pie shell",
        "1 (8 ounce) package cream cheese, softened",
        "1/4 cup white sugar",
        "1/2 teaspoon vanilla extract",
        "1 egg, beaten",
        "1 1/4 cups pumpkin puree",
        "1 cup evaporated milk",
        "2 eggs, beaten",
        "1/4 cup packed brown sugar",
        "1/4 cup white sugar",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon salt",
        "2 tablespoons all-purpose flour",
        "2 tablespoons brown sugar",
        "2 tablespoons butter, softened",
        "1/2 cup chopped pecans"
    ],
    "nut": [
        "Calories > 430 kcal",
        "Carbs > 40.3 g",
        "Cholesterol > 117 mg",
        "Fat > 27.1 g",
        "Protein > 8.6 g",
        "Sodium > 433 mg"
    ],
    "n": "Old Fashioned Paradise Pumpkin Pie",
    "a": "MARBALET",
    "r": "0",
    "s": 8,
    "des": "\"This triple-decker pie has a cheesecake layer on the bottom, pumpkin custard in the middle, and a pecan streusel layer on top. Paradise!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nTo Make Cheesecake Layer: In a medium mixing bowl, beat cream cheese until smooth. Beat in 1/4 cup sugar, then add vanilla extract and 1 egg. Beat mixture until light and smooth. Chill mixture for 30 minutes, then spread into pastry shell.\nTo Make Pumpkin Layer: In a large bowl, combine pumpkin puree, evaporated milk, 2 eggs, 1/4 cup brown sugar, 1/4 cup white sugar, cinnamon, nutmeg, and salt. Mix until all ingredients are thoroughly combined.\nPour pumpkin mixture over cream cheese layer. Cover edges of crust with aluminum foil.\nBake in preheated oven for 25 minutes. Remove foil from edges and bake an additional 25 minutes.\nTo Make Pecan Streusel Layer: While pie is in oven, combine flour and 2 tablespoons brown sugar in a small bowl. Mix well, then add softened butter or margarine and stir until ingredients are combined. Mix in pecans.\nAfter pie has been in oven for 50 minutes, remove and sprinkle pecan streusel evenly over top. Bake for an additional 10 to 15 minutes, until a toothpick inserted in center comes out clean.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "2 h",
    "i": "27351.jpg",
    "o": "4517231.jpg,4219216.jpg,4023169.jpg,2912510.jpg,2689579.jpg,2644338.jpg",
    "st": "allrecipes"
}