{
    "id": 159432,
    "old_rating": "4.27869",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 cups bread flour",
        "2 1/2 teaspoons salt",
        "2 cups water, or as needed",
        "2 cups unsalted butter, at room temperature "
    ],
    "nut": [
        "Calories > 239 kcal",
        "Carbs > 20.7 g",
        "Cholesterol > 41 mg",
        "Fat > 15.8 g",
        "Protein > 3.6 g",
        "Sodium > 245 mg"
    ],
    "n": "Puff Pastry",
    "a": "your mom",
    "r": "0",
    "s": 24,
    "des": "\"If you've ever wanted to make authentic puff pastry from scratch, this is the recipe. Puff pastry puffs into thin delicate layers as it bakes, making it perfect for breakfast pastries, beef wellington and tempting appetizers.\"",
    "ins": "Mix the flour and salt together in a large bowl or in the bowl of a stand mixer that is fitted with a dough hook. Gradually stir in water until the dough holds together enough to clean the sides of the bowl. You may not need the full amount of water. Shape into a flat ball, and allow to rest for at least 10 minutes.\nPlace the butter between two pieces of plastic wrap and pound into a flat disc using a rolling pin or other heavy object. Refrigerate until firm, about 20 minutes.\nOn a lightly floured surface, roll out the dough into a large rectangle about 1/2 inch thick. Place the disc of chilled butter in the center and fold the two ends over it so that it is completely encased in dough. Roll out the dough again, taking care not to let the butter break through the dough, to about 1/2 inch thickness. Fold into thirds. This is the first ''turn''.  Rotate the dough 90 degrees and roll out into a rectangle again. Fold into thirds. By this time the butter is starting to warm up. Place the dough on a baking sheet and mark it with two pokes from your finger (two turns). Wrap in plastic and refrigerate for at least 30 minutes.\nRepeat this rolling, folding and turning two more times, then refrigerate until firm. Repeat two more times for a total of 6 ''turns''. Wrap and refrigerate. The dough is now ready to roll out and use in any recipe calling for puff pastry. Roll the dough out as thin as 1/4 inch to make pastries. Bake in a preheated oven of at least 400 degrees F (200 degrees C) to get the maximum puff from your pastry.",
    "pt": "1 h ",
    "ct": "",
    "tt": "",
    "i": "327055.jpg",
    "o": "4498568.jpg,4498562.jpg,3916698.jpg,3809938.jpg,3113215.jpg,3058007.jpg",
    "st": "allrecipes"
}