{
    "id": 159615,
    "old_rating": "4.77778",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 slices bacon, chopped",
        "1 tablespoon olive oil",
        "2 cloves garlic, minced",
        "1 onion, diced",
        "2 carrots, chopped",
        "2 stalks celery, chopped",
        "1/2 cup all-purpose flour",
        "1 (48 fluid ounce) can chicken broth",
        "1 teaspoon ground cumin",
        "1 teaspoon red pepper flakes",
        "2 teaspoons garlic and herb seasoning blend",
        "2 bay leaves",
        "1/2 teaspoon ground thyme",
        "1 teaspoon salt",
        "1/2 teaspoon poultry seasoning",
        "1 small head broccoli, cut into florets",
        "1 1/2 cups half-and-half",
        "1 potato, cubed",
        "2 (6.5 ounce) cans chopped clams",
        "1/2 pound roasted chicken thigh meat, diced",
        "1/4 cup butter, cubed",
        "1 cup coarsely shredded smoked cheddar cheese (optional)"
    ],
    "nut": [
        "Calories > 317 kcal",
        "Carbs > 14.7 g",
        "Cholesterol > 79 mg",
        "Fat > 19.9 g",
        "Protein > 19.4 g",
        "Sodium > 1011 mg"
    ],
    "n": "Smokey Clamicken Chowder",
    "a": "rccola1",
    "r": "0",
    "s": 12,
    "des": "\"This wholesome, warming chowder is quite simple and filling.\"",
    "ins": "Cook the bacon and olive oil in a large pot over medium heat until the grease has rendered out, and the bacon has begun to brown. Remove bacon with a slotted spoon, and set aside. Stir the garlic, onion, carrots, and celery into the bacon drippings, and cook for 10 minutes until the onion softens and becomes translucent. Stir in the flour, and continue cooking and stirring 10 minutes more.\nPour in the chicken broth, and season with cumin, red pepper flakes, garlic and herb seasoning blend, bay leaf, thyme, salt, and poultry seasoning. Bring to a boil over high heat, then reduce heat to medium-low, and simmer for 10 minutes, stirring frequently.\nMeanwhile, place broccoli in a steamer over 1 inch of boiling water, and cover. Cook until tender, 2 to 4 minutes. Drain, and place into a blender. Puree until smooth, using some of the half-and-half as needed.\nAdd the broccoli puree, remaining half-and-half, potato, clams, and chicken to the simmering chowder. Return to a simmer, and cook until the potatoes are tender, about 15 minutes. Stir in the cubed butter until melted, and sprinkle with Cheddar cheese to serve.",
    "pt": "45 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "587894.jpg",
    "o": "",
    "st": "allrecipes"
}