{
    "id": 16006,
    "old_rating": "4.43333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1 cup butter",
        "1 cup hazelnuts, ground",
        "1/2 cup sifted confectioners' sugar",
        "1/8 teaspoon salt",
        "1 teaspoon vanilla extract",
        "2 cups sifted confectioners' sugar",
        "1 vanilla bean"
    ],
    "nut": [
        "Calories > 95 kcal",
        "Carbs > 11.2 g",
        "Cholesterol > 10 mg",
        "Fat > 5.3 g",
        "Protein > 0.9 g",
        "Sodium > 33 mg"
    ],
    "n": "Viennese Crescent Holiday Cookies",
    "a": "Debby Hawkins",
    "r": "0",
    "s": 48,
    "des": "\"These cookies have been a Christmas family favorite for 20 years. Flaky and buttery, they are worth the effort. Almonds can be substituted for hazelnuts.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nIn a large mixing bowl, combine flour, butter, nuts, 1/2 cup confectioners' sugar, salt, and vanilla. Hand mix until thoroughly blended. Shape dough into a ball. Cover and refrigerate for 1 hour.\nMeanwhile, place sugar in a bowl or small container. With sharp chef's knife, split vanilla bean lengthwise. Scrape out seeds, and mix them into the sugar. Cut pod into 2 inch pieces and mix into sugar.\nRemove dough from refrigerator and form into 1 inch balls. Roll each ball into a small roll, 3 inches long. Place rolls 2 inches apart on ungreased cookie sheet, and bend each one to make a crescent shape.\nBake 10 to 12 minutes in the preheated oven, or until set but not brown.\nLet stand 1 minute, then remove from cookie sheets. Place hot cookies on a large sheet of aluminum foil. Sprinkle with prepared sugar mixture. Turn gently to coat on both sides. Cool completely and store in an airtight container at room temperature. Just before serving, coat with more vanilla flavored sugar.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "4334131.jpg",
    "o": "4334131.jpg,3384448.jpg,2976960.jpg,2965918.jpg,1069436.jpg,944515.jpg",
    "st": "allrecipes"
}