{
    "id": 160038,
    "old_rating": "4.23404",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (15 ounce) can diced tomatoes, drained",
        "2 tablespoons white wine",
        "2 tablespoons coconut oil",
        "4 cloves garlic, minced",
        "1 small onion, chopped",
        "1 small stalk celery, finely chopped",
        "3 1/2 cups vegetable broth",
        "2 cups rinsed quinoa",
        "2/3 cup grated Parmesan cheese",
        "1/2 cup evaporated milk",
        "1 cup frozen peas, thawed",
        "salt to taste",
        "1/2 teaspoon ground white pepper"
    ],
    "nut": [
        "Calories > 190 kcal",
        "Carbs > 24.8 g",
        "Cholesterol > 7 mg",
        "Fat > 6.3 g",
        "Protein > 7.8 g",
        "Sodium > 286 mg"
    ],
    "n": "Quinoa with Peas and Parmesan",
    "a": "Lindsay L.",
    "r": "0",
    "s": 12,
    "des": "\"Quinoa is an ancient South American grain, often called a 'superfood' because of its high content of protein, fiber, iron, and amino acids. It can be used almost anywhere you would use rice. It is gluten-free, with a mild nutty flavor, and a slightly chewy texture. This recipe is a great cold-weather comfort food--it is creamy, rich, and hearty.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Adjust oven rack to its topmost position. Lightly oil a baking sheet.\nToss the diced tomatoes with the wine, and spread out on baking sheet. Roast in preheated oven until the tomatoes have dried a bit, but have not begun to burn, about 15 minutes. When the tomatoes are just starting to turn brown at the edges, remove, and allow to rest at room temperature.\nMeanwhile, melt the coconut oil in a large saucepan over medium-high heat. Stir in the garlic, onion, and celery. Cook and stir until the onion has softened and turned translucent, 5 to 7 minutes. Pour in vegetable broth and quinoa, and bring to a boil over high heat.\nReduce heat to medium-low, cover, and simmer until the quinoa is tender and the liquid has been absorbed, 15 to 20 minutes. Stir in the Parmesan cheese, evaporated milk, peas, and tomatoes. Season with salt and white pepper.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "335925.jpg",
    "o": "",
    "st": "allrecipes"
}