{
    "id": 160042,
    "old_rating": "4.24176",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 canned chipotle pepper in adobo sauce",
        "2 tablespoons adobo sauce from the can",
        "1/4 cup salsa",
        "1 tablespoon lime juice",
        "4 tilapia fillets",
        "1/2 (8 ounce) package tortilla chips, crushed",
        "1 small avocado - peeled, pitted, and cut into large chunks",
        "1/4 cup sour cream",
        "1 tablespoon lime juice",
        "3 tablespoons milk",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 367 kcal",
        "Carbs > 25.8 g",
        "Cholesterol > 49 mg",
        "Fat > 17.8 g",
        "Protein > 27.1 g",
        "Sodium > 355 mg"
    ],
    "n": "Crispy Chipotle Lime Tilapia with Cool Avocado Sauce",
    "a": "LARANEFF",
    "r": "0",
    "s": 4,
    "des": "\"My husband loves this zesty Southwestern-style fish. You can make it with any of firm whitefish--like cod or halibut--if tilapia isn't available. You can even use boneless, skinless chicken breasts. I usually make a package of red or black beans with rice to serve with it while the fish cooks. If you have any leftovers, they make great fish tacos.\"",
    "ins": "Preheat oven to 375  degrees F (190 degrees C). Grease a baking sheet with cooking spray.\nCombine the chipotle pepper, adobo sauce, salsa, and 1 tablespoon lime juice in a blender and blend until smooth; brush the mixture over both sides of each tilapia fillet.\nSpread the crushed tortilla chips into the bottom of a deep dish; dredge the coated fillets in the chips to coat. Arrange the fillets on the prepared baking pan.\nBake the fillets 15 minutes; turn and lightly spray with cooking spray. Continue to bake until golden brown, another 10 to 15 minutes.\nWhile the fish bakes, place the avocado, sour cream, and 1 tablespoon lime juice and blend until smooth. Stir in the milk 1 tablespoon at a time until the consistency is similar to ranch dressing. Season with salt and pepper. Spoon the sauce over the baked fillets to serve.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "955829.jpg",
    "o": "4335157.jpg,1999602.jpg,1999594.jpg,1129933.jpg,1112575.jpg,1100199.jpg",
    "st": "allrecipes"
}