{
    "id": 160220,
    "old_rating": "4.09091",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups shortening, or as needed",
        "1/3 cup honey",
        "3 tablespoons white vinegar",
        "3/4 cup all-purpose flour",
        "2 teaspoons poultry seasoning",
        "1/4 teaspoon cayenne pepper (optional)",
        "8 cut up chicken pieces",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 306 kcal",
        "Carbs > 22.9 g",
        "Cholesterol > 58 mg",
        "Fat > 14.9 g",
        "Protein > 19.7 g",
        "Sodium > 55 mg"
    ],
    "n": "Daniel Boone's Favorite Honey-Fried Chicken",
    "a": "Laurie P.",
    "r": "0",
    "s": 8,
    "des": "\"Sticky, sweet, tangy, and a little zippy if you prefer, this is a local favorite.\"",
    "ins": "Melt shortening to a depth of 1/2 inch in a large heavy skillet to 350 degrees F (175 degrees C). Whisk together the honey and white vinegar; set aside. Whisk together the flour, poultry seasoning, and cayenne pepper in a bowl.\nSeason the chicken pieces with salt and black pepper. Roll chicken in the flour mixture to coat evenly; shake off excess. Place the chicken in the preheated skillet, and cook until a light brown crust forms, about 3 minutes per side. Turn the chicken pieces over and brown on the other side.\nReduce heat to low. Cover the skillet; cook until the meat is no longer pink at the bone and the juices run clear, about 20 minutes.  An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\nRemove the cover, turn up the heat, and continue to cook, turning as needed, until the chicken is evenly browned and crisp, about 5 minutes. Pour off most of the shortening. Pour the honey mixture over the chicken and cook over medium-low heat, turning chicken pieces to coat, until liquid thickens, about 5 minutes.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "680301.jpg",
    "o": "",
    "st": "allrecipes"
}