{
    "id": 160475,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "5 tablespoons white sugar",
        "1 pinch salt",
        "2 eggs",
        "3 tablespoons butter, melted",
        "1 tablespoon extra-virgin olive oil",
        "2 tablespoons dry white wine",
        "2 tablespoons rum",
        "1 teaspoon grated lemon zest",
        "5 cups white sugar",
        "1 cup unsweetened cocoa powder",
        "1 1/2 teaspoons ground cinnamon",
        "1 1/2 cups cornstarch",
        "1 quart whole milk",
        "1 teaspoon vanilla extract",
        "13 (1 ounce) squares unsweetened chocolate",
        "1 quart vegetable oil for frying",
        "1/2 cup miniature semisweet chocolate chips",
        "1/4 cup confectioners' sugar"
    ],
    "nut": [
        "Calories > 216 kcal",
        "Carbs > 35.8 g",
        "Cholesterol > 12 mg",
        "Fat > 8.5 g",
        "Protein > 2.9 g",
        "Sodium > 19 mg"
    ],
    "n": "Chiacchiere with Sanguinaccio",
    "a": "LaCuocaEnza",
    "r": "0",
    "s": 48,
    "des": "\"'Chiacchiere' is a dessert that is fried and sprinkled with confectioners' sugar and served with sanguinaccio. It is a traditional Italian dessert in the region of Campagnia, served during 'carnevale' or as we say Mardi Gras. It is served with 'sanguinaccio' a chocolate sauce used for dipping the 'chiacchiere'. Years ago the sanguinaccio was made with chocolate and pig's blood, but now the use of the blood has been banned due to health concerns, but in small villages across Italy it is still used.\"",
    "ins": "Sift the flour, 5 tablespoons sugar, and salt into a large bowl, and make a well in the center. Whisk together the eggs, butter, olive oil, wine, rum, and lemon zest in a separate bowl until smooth; pour into the flour mixture. Stir together until a dough forms, then knead on a lightly floured work surface until smooth and elastic, about 10 minutes. Place into a lightly oiled bowl, cover with plastic wrap, and set aside for 1 hour.\nWhile the dough rests, stir together 5 cups white sugar, cocoa powder, cinnamon, and cornstarch in a large saucepan. Slowly pour in the milk, whisking constantly. Stir in the vanilla. Add the unsweetened chocolate, and bring to a simmer over medium heat, stirring constantly. Simmer for 5 minutes, stirring constantly, then remove from the heat and allow the sauce to cool to room temperature.\nTransfer the dough to a lightly floured work surface. Roll with a well-floured rolling pin to a thickness of 1/8 of an inch. Use a sharp knife to cut the dough into 2x5 inch rectangles. Alternately, pinch off an egg-sized piece of dough and roll it through a pasta machine. Repeat with the remaining dough.\nHeat oil in deep-fryer to 375 degrees F (190 degrees C).\nFry the Chiacchiere a few at a time until golden brown; remove and drain on a paper towel-lined plate. To serve, pour the cooled Sanguinaccio sauce into a bowl, and sprinkle with chocolate chips to garnish. Place the fried Chiacciere onto a serving platter and sprinkle with confectioner's sugar to serve.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "2 h",
    "i": "953680.jpg",
    "o": "",
    "st": "allrecipes"
}