{
    "id": 160963,
    "old_rating": "3.90909",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/4 pounds peeled and deveined medium shrimp",
        "1/4 teaspoon turmeric powder",
        "1/4 teaspoon ground red pepper",
        "3 tablespoons cashews",
        "5 whole cardamom pods, broken",
        "2 (3 inch) cinnamon sticks",
        "1 teaspoon whole black peppercorns",
        "4 teaspoons sunflower oil",
        "1/2 red onion, diced",
        "1/2 teaspoon garlic paste",
        "3/4 teaspoon ginger paste",
        "salt to taste",
        "1/2 teaspoon garam masala",
        "1 large bay leaf",
        "1/2 cup diced roma tomatoes",
        "2 green bell peppers, seeded and diced",
        "1 (14 ounce) can coconut milk"
    ],
    "nut": [
        "Calories > 253 kcal",
        "Carbs > 6.8 g",
        "Cholesterol > 194 mg",
        "Fat > 15.5 g",
        "Protein > 22.9 g",
        "Sodium > 312 mg"
    ],
    "n": "Prawns in Cashew Coconut Curry Sauce",
    "a": "bagchibhai",
    "r": "0",
    "s": 8,
    "des": "\"This is a very mellow tasting dish that has a rich creamy taste of the coconut sauce with the nice crunchy texture of toasted cashews and soft, succulent prawns. Goes perfectly with steamed basmati rice and a nice Riesling or Gewurztraminer.\"",
    "ins": "Season the shrimp with turmeric powder and chile powder, and set aside. Toast the cashews, cardamom, cinnamon, and peppercorns in a skillet over medium heat until toasted and fragrant, about 7 minutes; remove from the skillet and set aside.\nHeat the sunflower oil in a large skillet over medium-high heat. Add the onion, garlic, and ginger; cook and stir until the onion has softened and begun to lose its red color, about 5 minutes. Stir in the shrimp and toasted spice mixture along with the salt, garam masala, bay leaf, tomatoes, and green pepper. Cook and stir until half of the shrimp has begun to turn pink, then pour in the coconut milk, cover, and bring to a simmer.\nCover, and reduce heat to medium-low. Simmer until the shrimp are opaque and the vegetables are tender, about 5 minutes.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}