{
    "id": 160982,
    "old_rating": "4.64286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 bacon slices",
        "2 tablespoons extra-virgin olive oil",
        "3 bay leaves",
        "2 tablespoons red pepper flakes",
        "1 large green bell pepper, chopped",
        "1 large red bell pepper, chopped",
        "1 large yellow onion, chopped",
        "1 bunch green onions, chopped",
        "3 cloves garlic, chopped",
        "4 (15.5 ounce) cans light red kidney beans",
        "2 quarts water",
        "1/4 cup salted butter",
        "2 pounds andouille sausage, sliced",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 689 kcal",
        "Carbs > 45 g",
        "Cholesterol > 85 mg",
        "Fat > 44.6 g",
        "Protein > 28.5 g",
        "Sodium > 1653 mg"
    ],
    "n": "Richard and Suzanne's Famous Red Beans and Sausage",
    "a": "Richard and Suzanne",
    "r": "0",
    "s": 8,
    "des": "\"This recipe was created by Richard during his single days. It became a family favorite over the years. He gets many requests for this recipe so we decided just to make it public. If you don't like spicy food, use mild sausage and omit the red pepper flakes. Hope you enjoy! Serve over white rice with corn bread and coleslaw for a delicious meal.\"",
    "ins": "Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Reserving the drippings, remove the bacon, and blot off excess grease with paper towels; crumble and set aside. Add the olive oil, bay leaves, and red pepper flakes to the bacon drippings in the skillet and reheat. Cook the green bell pepper, red bell pepper, yellow onion, green onion, and garlic in the olive oil mixture until tender.\nPlace the kidney beans in a heavy pot over medium heat. Pour the water over the beans; add the vegetable mixture from the skillet and the cooked bacon; stir. Simmer 30 minutes, stirring occasionally. Add the butter.\nWhile the butter melts into the bean mixture, return the skillet to the heat and cook the sausage in the skillet until lightly browned; add the sausage to the beans. Rinse the bottom of the skillet with a small amount of water and pour into the bean mixture. Cook the beans another 15 minutes. Season with salt and pepper.",
    "pt": "35 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "2379003.jpg",
    "o": "",
    "st": "allrecipes"
}