{
    "id": 161082,
    "old_rating": "4.29412",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups dry garbanzo beans, soaked overnight",
        "1 pinch baking soda (optional)",
        "1/2 cup extra-virgin olive oil",
        "3/4 cup tahini paste",
        "1/4 cup fresh lemon juice, or more to taste",
        "1 large clove garlic, minced, or more to taste",
        "1 teaspoon ground cumin",
        "salt to taste",
        "1 tablespoon extra virgin olive oil, for drizzling"
    ],
    "nut": [
        "Calories > 551 kcal",
        "Carbs > 51.2 g",
        "Cholesterol > 0 mg",
        "Fat > 32.3 g",
        "Protein > 18.4 g",
        "Sodium > 78 mg"
    ],
    "n": "Authentic Middle Eastern Hummus (Chummus)",
    "a": "Simone",
    "r": "0",
    "s": 8,
    "des": "\"Authentic chummus is very different and SO much tastier than its American counterpart. This chummus is creamy and delicate in taste rather than overpowered with garlic or thick and pasty. It is eaten warm, fresh, and as a whole meal spread out in a dish and drizzled with fresh olive oil. It is scooped up with pita, raw onion slices, or just a fork. Do NOT use canned chickpeas (garbanzo beans)!\"",
    "ins": "Rinse the garbanzo beans and and place in a pot. Fill with enough water to cover by at least 1 inch. Add baking soda, if using. Bring to a boil and then simmer over medium heat until the beans are very soft, 1 1/2 to 2 hours.\nDrain the beans, reserving some of the water to use later. Reserve a small handful of the whole beans for a garnish. Transfer the rest to a blender or if you have a hand blender, a large bowl. Blend the beans until smooth, adding 1/2 cup of olive oil gradually. Add some of the reserved water if needed to help it blend. Add the tahini and blend in along with the lemon juice. Blend in the garlic, cumin and salt.\nSpread the hummus into a flat serving dish and garnish with the reserved beans and a drizzle of olive oil.",
    "pt": "20 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "176685.jpg",
    "o": "",
    "st": "allrecipes"
}