{
    "id": 161026,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (2 pound) flat iron steak",
        "salt and ground black pepper to taste",
        "2 tablespoons olive oil",
        "1 large red onion, thinly sliced",
        "1/2 cup Italian salad dressing",
        "3 large red bell peppers, cut into 1/2 inch strips",
        "2 portobello mushrooms, sliced",
        "1/2 cup red wine",
        "4 cups baby spinach leaves",
        "1/2 cup crumbled blue cheese"
    ],
    "nut": [
        "Calories > 486 kcal",
        "Carbs > 12.7 g",
        "Cholesterol > 112 mg",
        "Fat > 31.1 g",
        "Protein > 36.2 g",
        "Sodium > 601 mg"
    ],
    "n": "Flat Iron Steak and Spinach Salad",
    "a": "Kerinholland",
    "r": "0",
    "s": 6,
    "des": "\"Spinach is topped with peppers, mushrooms and steak in this recipe.\"",
    "ins": "Preheat an outdoor grill for medium-high heat; lightly oil the grate.\nSeason the flat iron steak on both sides with salt and pepper. Cook to desired degree of doneness on preheated grill, about 5 minutes per side for medium-rare. Let rest in a warm area while proceeding with the recipe.\nHeat olive oil in a large skillet over medium-high heat. Stir in the onion, and cook until it begins to soften, about 4 minutes. Pour in the Italian salad dressing, and bring to a boil, then stir in the red peppers and mushrooms. Reduce heat to medium, and cook until the peppers are tender, about 5 minutes.\nRemove the vegetables from the skillet with a slotted spoon, and set aside. Increase the heat to medium-high, and add the red wine. Simmer the salad dressing and wine until it has reduced to a syrupy sauce, about 5 minutes.\nMeanwhile, divide the spinach leaves onto serving plates. Thinly slice the flat iron steak across the grain. Spoon the warm, cooked vegetable mixture over the spinach leaves, then place the sliced steak on top. Spoon on the reduced red wine sauce, and finally, sprinkle with blue cheese.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "125597.jpg",
    "o": "3685699.jpg,3657374.jpg,2595492.jpg,399366.jpg,362230.jpg,247878.jpg",
    "st": "allrecipes"
}