{
    "id": 16154,
    "old_rating": "4.375",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 ounces cream cheese, room temperature",
        "1/2 cup white sugar",
        "3 eggs, room temperature",
        "3 tablespoons heavy whipping cream",
        "2 tablespoons coffee-flavored liqueur (such as KahluaÂ®)",
        "3 (1 ounce) squares milk chocolate, coarsely chopped",
        "1/2 cup heavy cream",
        "1 cup whipped cream for garnish (optional)",
        "2 tablespoons Shaved chocolate, to garnish (optional)"
    ],
    "nut": [
        "Calories > 317 kcal",
        "Carbs > 19.5 g",
        "Cholesterol > 122 mg",
        "Fat > 23.9 g",
        "Protein > 5.8 g",
        "Sodium > 143 mg"
    ],
    "n": "KahluaÂ® Chocolate Cheesecake",
    "a": "KATRON",
    "r": "0",
    "s": 10,
    "des": "\"My friends would be very upset if I didn't serve this at my annual Cinco de Mayo gathering. This needs to sit in refrigerator at least 8 hours so you may want to make it the day ahead.\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C).\nIn a mixing bowl, blend cream cheese and sugar until smooth. Beat in the eggs one at a time, mixing until fully incorporated before adding the next egg. Mix in 3 tablespoons whipping cream and the coffee-flavored liquor.  Pour into an 8-inch glass pie pan.\nPlace chocolate in a small heat-proof bowl and set aside. In a small saucepan, bring 1/2 cup whipping cream just to a boil. Pour it over the chopped chocolate; let chocolate soften for about 3 minutes. Whisk until smooth.\nDrizzle chocolate in a spiral pattern over filling. Stir lightly with tip of a paring knife to achieve a marbling effect.  Set the pie pan in a larger pan with water that comes halfway up side of pie pan.\nBake in preheated oven until firm in the center, about 55 minutes. Cool completely and refrigerate, covered with plastic wrap, overnight.\nGarnish with whipped cream piped or dolloped around edges and shaved chocolate in center.",
    "pt": "30 m",
    "ct": "55 m",
    "tt": "1 d ",
    "i": "61159.jpg",
    "o": "",
    "st": "allrecipes"
}