{
    "id": 161613,
    "old_rating": "4.48571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 fresh jalapeno peppers, stems removed",
        "1 1/2 pounds fresh tomatillos, husks removed",
        "3 green onions",
        "1 small onion, quartered",
        "1 bunch fresh cilantro, stems trimmed",
        "1 cup heavy cream",
        "1 cup chicken broth",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 pound frozen fully cooked salad shrimp, thawed",
        "1 (9 ounce) bag baby spinach leaves",
        "2 teaspoons vegetable oil, divided",
        "10 (6 inch) corn tortillas",
        "8 ounces shredded Monterey Jack cheese",
        "1/2 cup sour cream (optional)",
        "1 tablespoon green pepper sauce (e.g., TabascoÂ®) (optional)"
    ],
    "nut": [
        "Calories > 678 kcal",
        "Carbs > 39.4 g",
        "Cholesterol > 254 mg",
        "Fat > 42.8 g",
        "Protein > 37.7 g",
        "Sodium > 731 mg"
    ],
    "n": "Shrimp Enchiladas Suizas",
    "a": "cheeziekt",
    "r": "0",
    "s": 5,
    "des": "\"These enchiladas are a rich, tangy spin on more common red chile enchiladas. Don't be shy about experimenting with fillings and the spice level.\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C). Lightly oil a 9x13 inch baking dish.\nPlace jalapeno peppers, tomatillos, green onions, quartered onion, and cilantro in a food processor. Pulse until mixture is coarsely chopped, about 8 pulses. Pour mixture into a saucepan over medium heat and bring to a simmer; cook about 5 minutes. Stir in cream and chicken broth; season with salt and pepper. Return to a simmer and cook until slightly thickened, about 10 minutes. Set aside.\nPlace shrimp and spinach in a skillet over medium heat. Cover tightly and cook until spinach wilts and shrimp are heated through, about 3 minutes. Remove from heat.\nWipe skillet dry and pour in 1 teaspoon of the oil; heat oil over medium heat. Place a tortilla in skillet about 10 seconds; turn and heat on second side about 5 seconds to soften for easier handling. Fill tortilla with a tablespoon of the shrimp and spinach mixture and about a tablespoon of shredded cheese. Repeat with each tortilla adding more oil to the skillet as needed. Place filled tortillas snugly in prepared baking dish.\nPour sauce over tortillas and sprinkle with remaining grated cheese and any remaining filling. Top with dollops of sour cream and some green pepper sauce, if desired.\nBake in preheated oven for 15 to 20 minutes or until hot and bubbly.",
    "pt": "45 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "426679.jpg",
    "o": "2631695.jpg,826512.jpg,795460.jpg,286610.jpg,286605.jpg,286604.jpg",
    "st": "allrecipes"
}