{
    "id": 16162,
    "old_rating": "4.58",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons active dry yeast",
        "1 tablespoon white sugar",
        "2 1/2 cups warm water (110 degrees F)",
        "2 tablespoons shortening",
        "2 teaspoons salt",
        "7 cups all-purpose flour",
        "3 egg whites, stiffly beaten",
        "1 egg white (for egg wash)",
        "2 tablespoons cold milk"
    ],
    "nut": [
        "Calories > 150 kcal",
        "Carbs > 28.8 g",
        "Cholesterol > < 1 mg",
        "Fat > 1.5 g",
        "Protein > 4.8 g",
        "Sodium > 206 mg"
    ],
    "n": "German Brotchen Rolls",
    "a": "MARBALET",
    "r": "0",
    "s": 24,
    "des": "\"These rolls are nice and chewy with a very firm crumb.  Most enjoyable.\"",
    "ins": "In a large mixing bowl, dissolve yeast and sugar in warm water. Let sit until creamy; about 10 minutes.\nMix in shortening, salt and 3 cups of the flour. Beat with dough whisk or heavy spoon for 2 minutes. Fold in egg whites.  Gradually add flour 1/4 cup at a time, until dough forms a mass and begins to pull away from bowl.  Turn onto a floured surface.  Knead, adding more flour as necessary, for 8 to 10 minutes, until smooth and elastic with bubbles.\nLightly oil a large mixing bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour. Deflate the dough, form into a round and let rise again until doubled, about 45 minutes.\nPreheat oven to 425 degrees F (220 degrees C). Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into 24 equal pieces and form into oval rolls about 3 1/2 inches long. Place on lightly greased baking sheets, cover and let rise until doubled in volume, about 40 minutes.\nPlace an empty baking sheet on the bottom rack of the oven. In a small bowl, lightly beat the egg white with the 2 tablespoons of milk to make the egg wash.  Lightly brush the risen rolls with the egg wash. Place 1 cup of ice cubes on the hot baking sheet in the oven and immediately place the rolls in the oven.\nBake at 425 degrees F (220 degrees C) for about 20 minutes or until the tops are golden brown. Remove to a wire rack and cool.",
    "pt": "40 m",
    "ct": "20 m",
    "tt": "3 h",
    "i": "113725.jpg",
    "o": "4520025.jpg,4519536.jpg,4473907.jpg,3868694.jpg,3727438.jpg,3310748.jpg",
    "st": "allrecipes"
}