{
    "id": 16167,
    "old_rating": "4.63021",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups Burgundy wine",
        "2 tablespoons brandy",
        "2 onions, thinly sliced",
        "2 carrots, chopped",
        "1 sprig fresh parsley",
        "1 bay leaf",
        "1 clove garlic, crushed",
        "10 whole black peppercorns",
        "1 teaspoon salt",
        "2 pounds cubed beef chuck roast",
        "4 tablespoons olive oil, divided",
        "1/4 pound bacon, cubed",
        "2 onions, chopped",
        "3 tablespoons all-purpose flour",
        "1 tablespoon tomato paste",
        "2 cloves garlic, crushed",
        "1 (10.5 ounce) can beef broth",
        "salt and pepper to taste",
        "4 tablespoons butter",
        "1 pound fresh mushrooms, sliced"
    ],
    "nut": [
        "Calories > 458 kcal",
        "Carbs > 14.1 g",
        "Cholesterol > 72 mg",
        "Fat > 28.9 g",
        "Protein > 19.9 g",
        "Sodium > 638 mg"
    ],
    "n": "Beef Bourguignon I",
    "a": "COOKPOT",
    "r": "0",
    "s": 8,
    "des": "\"My sister sent me this recipe and the delectable smell of this hearty yet fancy dish brings my teenaged boys running! Serve with potatoes, noodles or rice.\"",
    "ins": "For marinade: In a large bowl, combine the wine, cognac, onions, carrots, parsley, bay leaf, garlic, peppercorns and salt. Mix well and add the cubed beef. Cover and marinate in the refrigerator for 2 days.\nPreheat oven to 300 degrees F (150 degrees C).\nFor Bourguignon: Strain the meat from the vegetables and marinade; reserve marinade. Dry meat with paper towels. Heat 2 tablespoons of the oil in a large skillet over medium high heat. Add the meat and saute for 10 minutes, or until browned on all sides. Transfer meat to a separate medium bowl with a slotted spoon and set aside.\nIn the same skillet, add the bacon and saute until lightly browned. Transfer the bacon to the bowl with the meat. Drain the skillet and return it to the heat. Pour a cup of marinade into the skillet to deglaze the skillet, scraping the bottom to loosen up all the little bits. Return this liquid to the reserved marinade.\nHeat the remaining oil in the skillet. Add the onion and carrot from the marinade, along with the additional onion that you've chopped, and saute for 5 minutes, or until tender. Transfer this mixture to the bowl with the meat and bacon, again using a slotted spoon, and return skillet to the heat. Add the flour to the skillet, combining with the oil and stir until well mixed and brown, about 2 minutes.\nNow add the tomato paste, garlic, beef broth, reserved marinade and salt and pepper to taste. Bring to a boil and whisk to remove any flour lumps. Add this to the meat and vegetable mixture. Place entire mixture into a 9x13 baking dish.\nBake at 300 degrees F (150 degrees C) for 3 hours, stirring occasionally and adding water as needed. Season with salt and pepper to taste.\nAbout 15 minutes before meat is done baking, melt butter in the skillet over medium high heat. Add the mushrooms and saute for 5 to 10 minutes, or until lightly browned. When meat is done, add the mushrooms to the meat mixture, stir well and let sit for about 15 minutes.",
    "pt": "30 m",
    "ct": "3 h",
    "tt": "2 d ",
    "i": "1188118.jpg",
    "o": "4529682.jpg,4077922.jpg,3955812.jpg,3572243.jpg,3529739.jpg,3155033.jpg",
    "st": "allrecipes"
}