{
    "id": 16184,
    "old_rating": "4.17391",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup ground black pepper",
        "4 tablespoons ground cayenne pepper",
        "4 tablespoons garlic powder",
        "2 tablespoons paprika",
        "1/4 cup packed brown sugar",
        "2 tablespoons chili powder",
        "6 pork chops",
        "4 tablespoons prepared mustard",
        "4 tablespoons prepared horseradish mustard",
        "1/4 cup prepared brown mustard",
        "2 teaspoons prepared horseradish",
        "1/4 cup packed brown sugar",
        "4 tablespoons honey"
    ],
    "nut": [
        "Calories > 488 kcal",
        "Carbs > 65.6 g",
        "Cholesterol > 61 mg",
        "Fat > 17.9 g",
        "Protein > 24.7 g",
        "Sodium > 655 mg"
    ],
    "n": "Honey Mustard Dream Delight Pork Chops",
    "a": "Blues",
    "r": "0",
    "s": 4,
    "des": "\"Double thick pork chops basted with three kinds of mustard, and cured with a dry rub for a day, and then glazed over with honey. Serve with grilled veggies, white wine, and pie a la mode for dessert!\"",
    "ins": "In a small bowl, combine the ground black pepper, cayenne pepper, garlic powder, paprika, brown sugar and chili powder. Mix well and rub thoroughly over the pork chops. Cover the meat and refrigerate for 24 hours, taking meat out at least 30 to 45 minutes before grilling.\nPrepare an outdoor grill for high heat and lightly oil grate.\nMeanwhile, in a small bowl, combine the yellow mustard, horseradish mustard, brown mustard, horseradish and brown sugar. Mix well. Place the honey in a separate small bowl.\nThen, continue to grill over medium high heat, turning and basting every 10 minutes with the mustard sauce, for 45 to 50 minutes, or until internal temperature reaches 145 degrees F (63 degrees C). During the last 15 minutes of cooking, start basting with the honey, turning as needed. This will give the chops a nice, sweet coating, sealing in the flavors of the mustard baste.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "4516563.jpg",
    "o": "",
    "st": "allrecipes"
}