{
    "id": 161869,
    "old_rating": "4.32456",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package elbow macaroni",
        "6 tablespoons butter",
        "1/2 cup all-purpose flour",
        "5 1/2 cups milk, divided",
        "2 1/2 cups shredded smoked Gouda cheese",
        "1 1/2 cups shredded Cheddar cheese",
        "1 1/2 cups shredded Swiss cheese",
        "1 cup grated Parmesan cheese",
        "1/2 cup grated Parmesan cheese",
        "1/2 cup dry bread crumbs",
        "1 teaspoon ground cayenne pepper",
        "olive oil"
    ],
    "nut": [
        "Calories > 651 kcal",
        "Carbs > 50.7 g",
        "Cholesterol > 107 mg",
        "Fat > 35.1 g",
        "Protein > 32.4 g",
        "Sodium > 712 mg"
    ],
    "n": "Shannon's Smoky Macaroni and Cheese",
    "a": "S.Michael",
    "r": "0",
    "s": 10,
    "des": "\"This recipe is the best Mac & Cheese you'll ever have.  It is literally one of 3 meals everyone in my family will eat. The smoked gouda gives this dish its smoky rich flavor. It's a gourmet grown-up version of the kiddie classic. Take any leftovers and cut into bite-sized squares, bread, and deep fry for a yummy snack.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nFill a pot with lightly-salted water and bring to a boil. Stir the macaroni into the water and return to a boil. Cook and occasionally stir until the pasta has cooked through, but is still firm to the bite, about 8 minutes; drain.\nMelt the butter in a large pot over medium heat. Add the flour to the melted butter and whisk continually for 1 to 2 minutes to make a roux. Whisk 2 cups of the milk into the roux until smooth and then add the remaining milk. Raise the heat to medium-high and continue cooking and stirring until thickened, but not boiling. Stir the Gouda, Cheddar, Swiss, and 1 cup Parmesan cheese into the mixture; once the cheeses have melted completely, fold the drained macaroni into the mixture to coat. Pour the macaroni mixture into a 9x13-inch baking dish.\nStir 1/2 cup Parmesan cheese,  bread crumbs, and cayenne pepper together in a small bowl; sprinkle over the macaroni. Drizzle the olive oil over the bread crumbs.\nBake in the preheated oven until golden and bubbly, about 30 minutes. Allow to rest 10 minutes before cutting.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "227118.jpg",
    "o": "4233146.jpg,3759635.jpg,3397216.jpg,3239515.jpg,2151920.jpg,2096796.jpg",
    "st": "allrecipes"
}