{
    "id": 16195,
    "old_rating": "4.14286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup water",
        "2 cups beef broth",
        "1/2 cup cider vinegar",
        "1 cup apricot preserves",
        "1 teaspoon salt",
        "1 onion, chopped",
        "1 carrot, chopped",
        "1 1/4 teaspoons pickling spice",
        "4 pounds eye of round roast",
        "salt and pepper to taste",
        "2 tablespoons vegetable oil",
        "1 cup heavy cream"
    ],
    "nut": [
        "Calories > 270 kcal",
        "Carbs > 19.2 g",
        "Cholesterol > 73 mg",
        "Fat > 12.4 g",
        "Protein > 20.4 g",
        "Sodium > 389 mg"
    ],
    "n": "Apricot Marinated Eye of Round Roast",
    "a": "Marylynn Roe",
    "r": "0",
    "s": 12,
    "des": "\"The eye of round roast is a less tender cut of beef, but try this recipe for delicious results. It bakes in a robust sauce including apricots and cream.\"",
    "ins": "In a medium saucepan over medium high heat, combine the water, beef broth, vinegar, apricot preserves, salt, onion, carrot and pickling spice. Stir together and bring to a boil. Then remove from heat, cover and refrigerate until well chilled.\nPlace roast in a 9x13 inch baking dish, pour chilled marinade over roast, cover and refrigerate for up to 24 hours.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat the oil in a large skillet over medium high heat. Place the roast in the skillet and sear the meat, browning well on all sides. Season with salt and pepper to taste, return meat to the baking dish and cover.\nBake at 350 degrees F (175 degrees C) for 1 1/2 hours. Remove from oven and let meat rest for 5 to 10 minutes.\nMeanwhile, to make the gravy, transfer the sauce from the baking dish to a blender and puree until smooth. Then pour into a medium saucepan over medium heat. Stir in the cream and simmer until thickened, about 15 to 20 minutes. Slice meat and serve with the sauce.",
    "pt": "20 m",
    "ct": "2 h",
    "tt": "1 d ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}