{
    "id": 161985,
    "old_rating": "4.69231",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (1 1/2 pound) whole red snapper, cleaned and scaled",
        "1/2 cup fresh basil leaves",
        "2 tablespoons peanut oil",
        "2 tablespoons fish sauce",
        "2 cloves garlic, minced",
        "1 teaspoon minced fresh ginger",
        "2 red chile peppers, sliced diagonally",
        "1 yellow bell pepper, seeded and diced",
        "1 tablespoon brown sugar",
        "1 tablespoon rice vinegar",
        "2 tablespoons water",
        "2 tomatoes, seeded and sliced",
        "5 leaves basil"
    ],
    "nut": [
        "Calories > 277 kcal",
        "Carbs > 10.6 g",
        "Cholesterol > 62 mg",
        "Fat > 9.4 g",
        "Protein > 36.8 g",
        "Sodium > 630 mg"
    ],
    "n": "Baked Snapper with Chilies, Ginger and Basil",
    "a": "Chili Spice",
    "r": "0",
    "s": 4,
    "des": "\"Almost any whole fish can be cooked with this method, but snapper or sea bass are particularly good with the Thai flavors. If you can find it, try fresh galangal in place of the ginger, the flavor is unique.\"",
    "ins": "Preheat oven to 375  degrees F (190 degrees C). Line a roasting pan with aluminum foil.\nStuff the cavity of the snapper with 1/2 cup basil leaves and set aside. Heat the peanut oil in a large skillet over high heat until it begins to smoke. Place the snapper in the skillet, and quickly brown on both sides, about 1 minute total. Place the fish into the roasting pan, and sprinkle with fish sauce. Reserve the peanut oil in the skillet.\nBake fish in preheated oven until the flesh flakes easily with a fork, 25 to 30 minutes.\nMeanwhile, heat the remaining peanut oil over medium heat. Stir in the garlic, ginger, chile peppers, and yellow pepper and cook until the peppers have softened, about 5 minutes. Stir in the sugar, rice vinegar, water, and tomatoes. Bring to a simmer over medium-high heat until thickened to desired consistency. Pour the sauce over the snapper, and garnish with the remaining basil leaves to serve.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "873150.jpg",
    "o": "",
    "st": "allrecipes"
}