{
    "id": 162066,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 smoked ham hock",
        "4 quarts water",
        "2 teaspoons chicken soup base",
        "3 cups cornmeal",
        "1 1/2 teaspoons dried thyme leaves",
        "2 teaspoons rubbed sage",
        "1 teaspoon ground savory",
        "1/8 teaspoon ground allspice",
        "1/8 teaspoon ground nutmeg",
        "1/8 teaspoon ground clove",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon ground white pepper",
        "1 pinch cayenne pepper",
        "salt and pepper to taste",
        "2 tablespoons butter",
        "1 onion, diced",
        "2 cups shredded sharp Cheddar cheese (optional)"
    ],
    "nut": [
        "Calories > 181 kcal",
        "Carbs > 9.7 g",
        "Cholesterol > 36 mg",
        "Fat > 11.4 g",
        "Protein > 9.3 g",
        "Sodium > 131 mg"
    ],
    "n": "Scrapple (Mush)",
    "a": "Kudu",
    "r": "0",
    "s": 36,
    "des": "\"Scrapple or mush has been a hearty breakfast staple in our family for generations. Heavily flavored with herbs, spices, onions and meat, it is a meal unto itself.\"",
    "ins": "Bring the ham hocks and water to a boil in a large pot over high heat. Reduce heat to meduim-low, cover, and simmer until the pork is very tender, about 2 hours. When done, remove the ham hocks to a plate to cool to room temperature, then shred the meat, discarding the fat, skin, and bones. Strain the cooking liquid and reserve 2 1/2 quarts.\nReturn the 2 1/2 quarts of broth to a boil in a large pot over high heat, and stir in the chicken soup base until dissolved. Place the cornmeal in a bowl, and stir in the thyme, sage, savory, allspice, nutmeg, clove, black pepper, white pepper, cayenne pepper, salt, and pepper. Slowly whisk the cornmeal into the boiling broth, and reduce heat to medium-low. Simmer 15 minutes, stirring frequently.\nWhile the cornmeal is cooking, melt the butter in a large skillet over medium heat. Stir in the onion, and cook until the onion has softened and turned translucent, about 5 minutes. After the cornmeal has cooked for 15 minutes, stir in the onion, shredded ham hock, and Cheddar cheese. Cook and stir an additional 15 minutes; the mixture will be thick enough that a spoon will stand up in it. Season to taste, scrapple must be well-seasoned or it will taste very bland when fried. Oil the bottom and sides of three 9x5 inch loaf pans, and pour in the scrapple. Cover the pans with plastic wrap, and refrigerate overnight.\nTo serve the scrapple, remove from the loaf pans and cut into 1/4 to 1/2 inch thick slices. Fry in melted butter in a skillet over medium-high heat until brown and crispy on both sides, about 10 minutes.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "11 h",
    "i": "66650.jpg",
    "o": "",
    "st": "allrecipes"
}