{
    "id": 162055,
    "old_rating": "4.32075",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1/2 onion, chopped",
        "1 large Granny Smith apple - peeled, cored and diced",
        "2 tablespoons balsamic vinegar",
        "1/2 cup dried cranberries",
        "salt and pepper to taste",
        "2 (6 ounce) boneless pork chops",
        "1 tablespoon olive oil"
    ],
    "nut": [
        "Calories > 427 kcal",
        "Carbs > 42.8 g",
        "Cholesterol > 54 mg",
        "Fat > 19.9 g",
        "Protein > 22.3 g",
        "Sodium > 231 mg"
    ],
    "n": "Cranberry and Apple Stuffed Pork Chops",
    "a": "Valerie",
    "r": "0",
    "s": 2,
    "des": "\"This is a sweet and savory stuffed boneless pork chop. It is very easy and quick to prepare.\"",
    "ins": "Heat 1 tablespoon olive oil in a skillet over medium heat. Stir in the onion and apple; cook and stir for 5 minutes. Stir in the cranberries and balsamic vinegar, and continue cooking until the apple and onions have softened, about 5 minutes more. Season to taste with salt and pepper, then scrape the mixture onto a plate, and refrigerate until cold.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease a small baking dish.\nCut a large pocket into the pork chops using a sharp, thin bladed knife. Stuff the cooled apple mixture into the pork chops, and secure with toothpicks if needed. Heat the remaining 1 tablespoon olive oil in a large skillet over medium-high heat.  Season the pork chops with salt and pepper to taste, and place into the hot skillet. Cook on each side until browned, about 3 minutes, then transfer to a baking dish.  Top with the remaining apple mixture, and cover the baking dish with aluminum foil.\nBake in preheated oven until the pork is no longer pink in the center, about 40 minutes depending on the thickness of the pork chops. Uncover, and bake about 10 minutes longer until the apple mixture has browned around the edges.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "3120711.jpg",
    "o": "",
    "st": "allrecipes"
}