{
    "id": 162054,
    "old_rating": "4.35294",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds beef tenderloin, cut into 1-inch cubes",
        "salt and pepper to taste",
        "2 tablespoons extra-virgin olive oil, divided",
        "2 cups shiitake mushrooms, thinly sliced",
        "2 cups port wine",
        "1 tablespoon seedless raspberry jam",
        "1 teaspoon Worcestershire sauce",
        "1 cup beef broth"
    ],
    "nut": [
        "Calories > 504 kcal",
        "Carbs > 11.7 g",
        "Cholesterol > 87 mg",
        "Fat > 27.4 g",
        "Protein > 28.2 g",
        "Sodium > 118 mg"
    ],
    "n": "Beef Tenderloin in a Port Shiitake Reduction",
    "a": "jonnyd523",
    "r": "0",
    "s": 4,
    "des": "\"This recipe combines the tenderness of filet mignon with a velvety port shiitake reduction.  A simple, yet elegant meal with earthy overtones that is served best over sweet potato and hazelnut mashed potatoes with bacon and balsamic glazed sugar snap peas.  Enjoyed best over candle light with the one you love.\"",
    "ins": "Season the tenderloin cubes with salt and pepper to taste and set aside at room temperature as you continue preparing the recipe.\nHeat 1 tablespoon olive oil in a large skillet over medium-high heat. Stir in the shiitake mushrooms, and cook until they have wilted and are beginning to turn golden brown, about 5 minutes. Remove the mushrooms from the skillet and set aside; heat the remaining olive oil in the skillet until it begins to smoke, the sprinkle in the cubed beef tenderloin. Cook on all sides until browned on the outside and the meat is cooked just under your desired degree of doneness, about 5 minutes for medium rare. Remove the steak from the skillet and set aside.\nPour the port wine into the skillet and bring to a boil over high heat. Boil until the port has reduced by half, then whisk in the raspberry jam, Worcestershire sauce, beef broth, and shiitake mushrooms. Continue cooking until the sauce has reduced to  1/2 cup, about 30 minutes. Once reduced, stir in the tenderloin cubes, and reheat.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "104253.jpg",
    "o": "",
    "st": "allrecipes"
}