{
    "id": 162191,
    "old_rating": "4.7",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cloves garlic, diced",
        "1 tablespoon caraway seeds",
        "1 pinch salt",
        "3 tablespoons olive oil",
        "2/3 cup mild chile peppers, chopped",
        "1 1/2 cups green bell peppers, seeded and chopped",
        "2 cups tomatoes, seeded and chopped",
        "4 eggs",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 209 kcal",
        "Carbs > 10.8 g",
        "Cholesterol > 186 mg",
        "Fat > 15.7 g",
        "Protein > 8.6 g",
        "Sodium > 79 mg"
    ],
    "n": "Tastira (Tunisian Fried Peppers and Eggs)",
    "a": "Asma Khalfaoui",
    "r": "0",
    "s": 4,
    "des": "\"I learned this recipe from my mother-in-law in Tunisia. Serve it on four separate plates or on one large platter. Serve with sliced French bread.\"",
    "ins": "Mash the garlic, caraway seeds, and pinch of salt in a mortar and pestle or against the side of a mixing bowl.\nHeat 1 tablespoon of the olive oil in a skillet over medium heat. Stir in the chile peppers; cook and stir until the peppers have softened, about 5 minutes. Remove them from the skillet and set aside. Add another tablespoon of oil to the skillet and cook the bell peppers and tomatoes until the peppers are soft and the tomatoes have begun to break down, about 5 more minutes. Add the tomato-bell pepper mixture to the hot peppers. Stir in the mashed garlic and caraway seeds. Spoon the vegetables onto plates or a serving platter.\nHeat the remaining oil in the skillet. Fry the eggs until the whites are set and the yolks are the desired consistency, about 2 to 3 minutes for runny yolks, 4 to 5 minutes for fully set yolks. Place the fried eggs on the vegetable mixture and season to taste with salt and pepper.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "855624.jpg",
    "o": "",
    "st": "allrecipes"
}