{
    "id": 16212,
    "old_rating": "4.77116",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup butter",
        "1 1/2 cups brown sugar",
        "2 tablespoons water",
        "2 cups semisweet chocolate chips",
        "2 eggs",
        "2 1/2 cups all-purpose flour",
        "1 1/4 teaspoons baking soda",
        "1/2 teaspoon salt",
        "3 (4.5 ounce) packages chocolate covered thin mints"
    ],
    "nut": [
        "Calories > 162 kcal",
        "Carbs > 23.8 g",
        "Cholesterol > 18 mg",
        "Fat > 7.4 g",
        "Protein > 1.7 g",
        "Sodium > 99 mg"
    ],
    "n": "Chocolate Mint Candies Cookies",
    "a": "Jackie Schmidt",
    "r": "0",
    "s": 40,
    "des": "\"I received this recipe through a cookie exchange years ago, and it has become a favorite of family and friends.\"",
    "ins": "In a saucepan over medium heat, cook the sugar, butter and water, stirring occasionally until melted.  Remove from heat, stir in the chocolate chips until melted and set aside to cool for 10 minutes.\nPour the chocolate mixture into a large bowl, and beat in the eggs, one at a time. Combine the flour, baking soda and salt, stir into the chocolate mixture. Cover and refrigerate dough for at least 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.  Roll cookie dough into walnut sized balls and place 2 inches apart onto the prepared cookie sheets.\nBake for 8 to 10 minutes in the preheated oven, be careful not to overbake. When cookies come out of the oven, Press one mint wafer into the top of each cookie and let sit for 1 minute. When the mint is softened, swirl with the back of a spoon or toothpick to make a pattern with the green filling of the mint wafer. For smaller cookies, break mints in half.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "4328531.jpg",
    "o": "4328531.jpg,4299900.jpg,3736860.jpg,3336307.jpg,3016075.jpg,2995838.jpg",
    "st": "allrecipes"
}