{
    "id": 162166,
    "old_rating": "4.51515",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 large potatoes, peeled and cubed",
        "salt and pepper to taste",
        "2 tablespoons butter",
        "1/2 cup half-and-half cream",
        "1/2 pound ground elk meat",
        "1/4 teaspoon Italian seasoning",
        "1 small onion, chopped",
        "1 parsnip, peeled and diced",
        "2 cups frozen mixed vegetables",
        "1 tablespoon butter, melted",
        "1/4 teaspoon garlic powder"
    ],
    "nut": [
        "Calories > 358 kcal",
        "Carbs > 56.6 g",
        "Cholesterol > 40 mg",
        "Fat > 9.1 g",
        "Protein > 15 g",
        "Sodium > 171 mg"
    ],
    "n": "Elk Shepherd's Pie",
    "a": "Sarah Waltrip",
    "r": "0",
    "s": 6,
    "des": "\"This a savory dish filled with ground elk, an array of vegetables, and delicious mashed potatoes.\"",
    "ins": "Place potatoes into a large pot and cover with salted water. Bring to a boil, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two, then mash with salt, pepper, 2 tablespoons butter, and half-and-half; set aside.\nPreheat oven to 400 degrees F (200 degrees C).\nMeanwhile, stir together the elk meat, Italian seasoning, salt, and pepper in a skillet over medium-high heat until crumbly and no longer pink, about 5 minutes. Spread the cooked elk meat into a 9-inch pie plate or baking dish and return the skillet to the stove over medium heat.\nPlace the onion, parsnip, and garlic powder in the skillet, season to taste with salt and pepper, and cook until the turnip has softened, about 10 minutes. Stir in the mixed vegetables and cook an additional 5 minutes, then spread in the pie plate over the elk. Finally, spread the mashed potatoes evenly over the top, and brush the melted butter on the potatoes.\nBake in preheated oven until the potatoes begin to turn golden brown, about 30 minutes. Serve hot.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "427768.jpg",
    "o": "4476090.jpg,3809388.jpg,3809387.jpg,2791745.jpg,2600178.jpg,1766508.jpg",
    "st": "allrecipes"
}