{
    "id": 162367,
    "old_rating": "4.52381",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons canola oil",
        "1/2 cup finely diced onion",
        "2 teaspoons minced garlic",
        "2 1/2 teaspoons chopped fresh sage",
        "3/4 cup pumpkin puree",
        "3/4 cup dry bread crumbs",
        "1 eggs",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "2 cups vegetable oil for frying",
        "1 sprig fresh sage leaves",
        "1/4 cup sour cream",
        "1/4 cup heavy whipping cream",
        "1 teaspoon white sugar",
        "1 tablespoon balsamic vinegar"
    ],
    "nut": [
        "Calories > 101 kcal",
        "Carbs > 5.9 g",
        "Cholesterol > 18 mg",
        "Fat > 8.1 g",
        "Protein > 1.5 g",
        "Sodium > 146 mg"
    ],
    "n": "Mini Pumpkin Sage Balls with Balsamic Creme Fraiche",
    "a": "cocojo761",
    "r": "0",
    "s": 16,
    "des": "\"An easy appetizer that isn't cheese! These baked pumpkin balls will really impress company. They're sprinkled with fried sage leaves and served with a tangy dipping sauce.\"",
    "ins": "Preheat oven to 375  degrees F (190 degrees C). Grease a baking sheet.\nHeat canola oil in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the garlic, and cook 2 minutes until softened, then stir in the chopped sage, and cook 2 more minutes. Scrape into a large bowl, and stir in the pumpkin puree, bread crumbs, eggs, salt, and black pepper until combined. Roll the mixture into 1 1/2 inch balls, and place onto the greased baking sheet.\nBake in preheated oven until firm and hot, about 15 minutes.\nMeanwhile, heat the frying oil to 350 degrees F (175 degrees C), and add the sage leaves. Fry until the bubbles begin to subside and the leaves are crispy. Remove the leaves, and drain on a paper towel-lined plate. Prepare the dipping sauce by stirring together the sour cream, whipping cream, sugar, and balsamic vinegar until smooth. To serve, sprinkle the pumpkin balls with fried sage leaves and serve with the dipping sauce on the side.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "162840.jpg",
    "o": "",
    "st": "allrecipes"
}