{
    "id": 162670,
    "old_rating": "4.48718",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds ground beef",
        "2 tablespoons barbeque seasoning",
        "1 tablespoon pureed chipotle peppers in adobo sauce",
        "1 (8 ounce) package cream cheese, softened",
        "1 teaspoon barbeque seasoning",
        "1 tablespoon butter",
        "1 small onion, chopped",
        "1/2 bell pepper (any color), chopped",
        "1 (4 ounce) package sliced fresh mushrooms",
        "1 tablespoon minced garlic",
        "1 cup shredded Cheddar cheese",
        "1/2 cup barbeque sauce"
    ],
    "nut": [
        "Calories > 542 kcal",
        "Carbs > 12.8 g",
        "Cholesterol > 158 mg",
        "Fat > 39.2 g",
        "Protein > 33.9 g",
        "Sodium > 1646 mg"
    ],
    "n": "Heather's Famous Barbeque Bunyan Burger",
    "a": "Amanda Handy",
    "r": "0",
    "s": 6,
    "des": "\"This scrumptious stuffed-and-grilled meatloaf has sauteed vegetables and is oozing with a full, robust flavor.\"",
    "ins": "Preheat an outdoor grill for high heat. When hot, lightly oil grate.\nMix together the ground beef, 2 tablespoons barbeque seasoning, and chipotle peppers in adobo sauce in a bowl; divide mixture into two halves; form each half into large rectangles, making one larger and thinner than the other; lay the rectangles on large sheets of aluminum foil.\nMix together the cream cheese and 1 teaspoon barbeque seasoning; spread on top of the smaller, thicker rectangle of meat.\nMelt the butter in a skillet over medium-high heat. Cook the onion, bell pepper, mushrooms, and garlic in the hot butter until the onion has softened; spread atop the cream cheese mixture; top with the Cheddar cheese.\nPlace the thinner rectangle of meat atop the smaller piece by lifting the aluminum foil beneath it and flipping it onto the cream cheese and vegetable layer. Use your hands to form a seal around the edges of the loaf, making sure the cheese and vegetable mixture will not leak out during cooking. Fold the edges of the aluminum foil beneath the loaf upwards, so as to form a bowl, to keep the grease from leaking onto the grill while cooking. Brush the top of the loaf with barbeque sauce.\nCook on the preheated grill until the top of the loaf is cooked completely through, about 30 minutes. Slice into six even pieces to serve.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "850209.jpg",
    "o": "",
    "st": "allrecipes"
}