{
    "id": 162671,
    "old_rating": "4.27586",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "1 tablespoon olive oil, divided",
        "2 pounds beef stew meat, cubed",
        "1 medium onion, chopped",
        "2 cloves garlic, minced",
        "1/2 cup red wine",
        "1/4 teaspoon ground cinnamon",
        "1 pinch salt and pepper to taste",
        "1/4 teaspoon ground nutmeg",
        "1 teaspoon white sugar",
        "1 strip (4- by 1-inch) fresh orange zest",
        "1 (14.5 ounce) can diced tomatoes",
        "1/2 cup water",
        "1 tablespoon olive oil",
        "1 pound pearl onions, peeled"
    ],
    "nut": [
        "Calories > 544 kcal",
        "Carbs > 20.6 g",
        "Cholesterol > 112 mg",
        "Fat > 34.6 g",
        "Protein > 31.7 g",
        "Sodium > 281 mg"
    ],
    "n": "Beef Stifado",
    "a": "Lolly B",
    "r": "0",
    "s": 5,
    "des": "\"This gorgeous casserole with beef and onions is best made the day before. Store the leftovers in the fridge, covered; it also freezes well.\"",
    "ins": "Heat half of the butter and half of the first tablespoon of olive oil in a large skillet over medium-high heat. Brown half of the beef cubes on all sides, and place into a large saucepan. Repeat with the remaining butter, olive oil, and beef. Stir the onions and garlic into the oil remaining in the skillet, and reduce heat to medium; cook and stir until the onion has softened and turned translucent, about 5 minutes. Pour in the red wine, and bring to a simmer, then scrape the onions into the saucepan with the beef.\nSeason the beef with salt, pepper, cinnamon, nutmeg, sugar, and orange zest. Pour in the diced tomatoes and water. Cover, and bring to a simmer over medium-high heat; then reduce heat to medium-low, and continue simmering 1 hour.\nMeanwhile, heat the remaining tablespoon of olive oil in the skillet over medium heat. Stir in the pearl onions, and cook until they are well browned, stirring frequently, about 20 minutes. After the beef has simmered for an hour, add the pearl onions, recover, and continue simmering 20 minutes.\nRemove the lid, and simmer, uncovered until the stew has reduced and slightly thickened, about 10 minutes. Remove the orange zest before serving.",
    "pt": "45 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "872814.jpg",
    "o": "",
    "st": "allrecipes"
}