{
    "id": 162895,
    "old_rating": "4.02083",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons butter",
        "1 teaspoon minced garlic",
        "10 chicken drumsticks",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 teaspoon butter",
        "1/2 onion, sliced",
        "5 teaspoons honey",
        "2 teaspoons soy sauce",
        "1/2 teaspoon ground ginger",
        "1 cup water",
        "1 lemon, thinly sliced",
        "1 teaspoon cornstarch",
        "2 teaspoons water",
        "1 peach, peeled and sliced"
    ],
    "nut": [
        "Calories > 246 kcal",
        "Carbs > 5.9 g",
        "Cholesterol > 90 mg",
        "Fat > 12.4 g",
        "Protein > 26.9 g",
        "Sodium > 266 mg"
    ],
    "n": "Drumsticks with Peach and Honey",
    "a": "IrvineHousewife",
    "r": "0",
    "s": 10,
    "des": "\"My neighbor used to have a restaurant in Indonesia. He was kind enough to share one of his most popular item on the menu with me. My kids who are big fans of peaches, canned or fresh, and drumsticks love this recipe, especially on a hot,summer day. These are good when served hot over rice, or bring to the park for a picnic.\"",
    "ins": "Heat 2 teaspoons of butter in a large skillet over medium-low heat. Stir in the garlic, and cook for a minute or two until the garlic softens and mellows. Season the chicken with salt and pepper, and add to the skillet. Cook until the chicken has browned on all sides, about 15 minutes.\nWhen the drumsticks have browned, remove, and set aside. Melt the remaining 1 teaspoon butter in the skillet, and stir in the sliced onion. Cook and stir until the onion begins to soften, about 5 minutes, then stir in the honey, soy sauce, ginger, and 1 cup of water. Return the drumsticks to the skillet, and bring to a boil over high heat. Reduce heat to medium-low, spread the lemon slices overtop, cover with a lid, and simmer until the drumsticks are tender and no longer pink at the bone, about 15 minutes.\nOnce the drumsticks have cooked, remove them to a serving platter and keep warm. Dissolve the cornstarch in 2 teaspoons of water, and stir into the simmering sauce. Add the peach, and cook until the sauce thickens and returns to a simmer. Pour sauce over the drumsticks to serve.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4517414.jpg",
    "o": "4468323.jpg,3472112.jpg,2609475.jpg,2409987.jpg,353629.jpg,96852.jpg",
    "st": "allrecipes"
}