{
    "id": 16308,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups water",
        "1 (4 inch) piece dashi kombu (dried kelp)",
        "1 cup bonito shavings (dry fish flakes)",
        "1/4 cup spinach, rinsed and sliced",
        "2/3 teaspoon salt",
        "2 teaspoons soy sauce",
        "1 tablespoon sake",
        "4 frozen toasted mochi squares, thawed",
        "4 naruto (fish paste stick with a red spiral pattern)",
        "4 slices yuzu (citron) peel"
    ],
    "nut": [
        "Calories > 131 kcal",
        "Carbs > 24.6 g",
        "Cholesterol > 2 mg",
        "Fat > 0.2 g",
        "Protein > 6.3 g",
        "Sodium > 662 mg"
    ],
    "n": "Zoni",
    "a": "Ayumi",
    "r": "0",
    "s": 4,
    "des": "\"This is a traditional soup served in Japan over New Year's. The mochi cakes, kelp, bonito flakes, and naruto can be found in Japanese grocery stores. Sake can be found in the wine section of many grocery stores (as well as Japanese stores).\"",
    "ins": "To Make Dashi: Rinse kelp and pat dry. Place kelp in a medium size pot, along with the 3 cups of water. Steep in the water for 3 hours.\nAfter steeping, bring the water with kelp in it to a boil. Then remove and discard the kelp. Remove the water from the heat and let it cool for 5 minutes.\nPlace the fish flakes in a pot of water. Bring the pot of water to a boil. When the shavings have sunk to the bottom of the pot, strain, reserving the liquid. This is the dashi, the basic broth for Japanese soups and dishes.\nWhile making the dashi, place the spinach in a small pot of water and bring to a boil. When the spinach is cooked, drain well.\nPour salt, thin soy sauce and sake in the heated dashi. Ladle the soup into bowls for servings. Into each bowl place one piece each of mochi cake, spinach and fish paste. Put a piece of citrus rind in each bowl.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "3 h ",
    "i": "865980.jpg",
    "o": "",
    "st": "allrecipes"
}