{
    "id": 163659,
    "old_rating": "4.34545",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil",
        "1/2 cup diced onion",
        "1/4 cup fennel, chopped",
        "1 tablespoon garlic, minced",
        "1/2 teaspoon fennel seed",
        "1/4 teaspoon crushed red pepper flakes",
        "1 eggs",
        "1 pound ground beef",
        "2 tablespoons dry bread crumbs",
        "1 tablespoon dried parsley",
        "1 teaspoon salt",
        "1 (8 ounce) package refrigerated crescent rolls"
    ],
    "nut": [
        "Calories > 536 kcal",
        "Carbs > 27.9 g",
        "Cholesterol > 116 mg",
        "Fat > 34.6 g",
        "Protein > 25.3 g",
        "Sodium > 1135 mg"
    ],
    "n": "Ground Beef 'Wellington' with Fennel",
    "a": "iq5203",
    "r": "0",
    "s": 4,
    "des": "\"I took the idea of wrapping beef in pastry from the traditional beef Wellington to make a simpler dish with the kick of fennel seeds and cayenne. I serve these with tomato sauce.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a baking sheet.\nHeat the vegetable oil in a skillet over medium heat. Stir in the onion, fennel, and garlic. Cook and stir until the fennel is tender, and the onion has softened and turned translucent, about 5 minutes. Stir in the fennel seed and red pepper flakes, and cook for 1 minute more. Meanwhile, beat the egg in a bowl, then mix in the ground beef, bread crumbs, parsley, and salt. Add the cooked vegetable mixture, and stir until combined.\nSeparate the crescent roll dough into two squares. Divide the meat mixture among the crescent roll squares, then seal the dough around the meat. Place seam-side-down onto the prepared baking sheet.\nBake in the preheated oven until the pastry has turned golden-brown, and the center of the pastries registers 160 degrees F (71 degrees C) on a kitchen thermometer, about 30 minutes. Slice and serve.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "707463.jpg",
    "o": "4516055.jpg,4397566.jpg,2571991.jpg,2565020.jpg,2460257.jpg,2121683.jpg",
    "st": "allrecipes"
}