{
    "id": 163877,
    "old_rating": "4.37838",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons canola oil",
        "2 large Vidalia or other sweet onions, roughly chopped",
        "4 (15 ounce) cans whole new potatoes, drained",
        "3 tablespoons extra-virgin olive oil",
        "3/4 teaspoon garlic salt",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon dried minced garlic",
        "2 tablespoons paprika",
        "1/4 teaspoon black pepper",
        "1/2 cup butter, at room temperature"
    ],
    "nut": [
        "Calories > 265 kcal",
        "Carbs > 24.9 g",
        "Cholesterol > 24 mg",
        "Fat > 17.9 g",
        "Protein > 3.2 g",
        "Sodium > 598 mg"
    ],
    "n": "Brilliant Potatoes With Paprika and Caramelized Onions",
    "a": "Gwenn Hornick Weiss",
    "r": "0",
    "s": 10,
    "des": "\"I love potatoes in all forms, but this is my all time favorite.  I have been making it since I was a teenager, and everyone in the family always requests it when I make dinner.  I have shortened the prep time using canned, whole, white potatoes, instead of boiling my own.  The results are just as delicious. If you are opposed to canned potatoes, use fresh, boiled potatoes.  These potatoes make fantastic leftovers too!  This is the first time I have ever given out the recipe.  I hope you all enjoy it as much as we do!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9x13 inch baking dish.\nHeat the canola oil in a large skillet over medium heat, then stir in the Vidalia onion. Cook and stir until the onion has softened and turned deep brown, 10 to 15 minutes. While the onions are caramelizing, toss the drained potatoes with the olive oil in a large bowl. Season with garlic salt, garlic powder, dried minced garlic, and black pepper; toss until well coated, then pour into the prepared baking dish, and spread into a single layer.\nSprinkle the caramelized onions on top of the potatoes, then dot the top of the dish with the room temperature butter, and sprinkle with paprika. Bake uncovered in the preheated oven until the outsides of the potatoes are crisp, 45 to 55 minutes.",
    "pt": "10 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1567968.jpg",
    "o": "",
    "st": "allrecipes"
}