{
    "id": 163972,
    "old_rating": "4.69231",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds skinless, boneless chicken breast",
        "2 tablespoons minced fresh ginger root",
        "2 tablespoons minced fresh jalapeno chile",
        "1/2 cup peeled and thinly-julienned seedless cucumber",
        "1/4 cup minced fresh Thai basil leaves",
        "1/4 cup minced fresh mint leaves",
        "1/4 cup minced fresh cilantro",
        "1 1/2 tablespoons minced lemon grass",
        "1/2 cup ground peanuts",
        "1/4 cup fish sauce",
        "3 tablespoons lime juice",
        "2 teaspoons white sugar",
        "1 tablespoon sesame oil",
        "1 tablespoon peanut oil",
        "16 rice paper wrappers",
        "16 leaves red leaf lettuce"
    ],
    "nut": [
        "Calories > 137 kcal",
        "Carbs > 6.5 g",
        "Cholesterol > 28 mg",
        "Fat > 6.9 g",
        "Protein > 12.4 g",
        "Sodium > 301 mg"
    ],
    "n": "Lemon Grass and Chicken Summer Rolls",
    "a": "Seattle Dad",
    "r": "0",
    "s": 16,
    "des": "\"These are like little bundles of delicious chicken salad wrapped in rice paper. They are deliciously perfect for warm weather treats.\"",
    "ins": "Bring a large pot of lightly-salted water to a boil. Season the chicken with salt and cook in the boiling water until no longer pink in the center, 7 to 10 minutes. Transfer to a large platter and allow to cool completely in refrigerator. Shred into small pieces once cooled.\nCombine the shredded chicken, ginger, jalapeno pepper, cucumber, basil, mint, cilantro, lemon grass, and peanuts in a large mixing bowl; toss until evenly distributed. Whisk together the fish sauce, lime juice, sugar, sesame oil, and peanut oil in a small bowl; add to the chicken mixture and mix with your hands until evenly coated.\nFill a shallow pan with hot water. Dip the rice paper wrappers in the hot water until soft one at a time. Spread the rice paper onto a clean, flat surface. Place 1 leaf of lettuce into the center of a sheet of rice paper; spread about 1/3 cup of the chicken mixture onto the lettuce leaf. Fold the bottom end of the rice paper over the top of the mixture and then roll into a cylinder. Repeat until all ingredients are used. Cut into halves to serve.",
    "pt": "1 h",
    "ct": "20 m",
    "tt": "3 h ",
    "i": "388056.jpg",
    "o": "",
    "st": "allrecipes"
}