{
    "id": 16457,
    "old_rating": "4.32636",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 head broccoli, cut into florets",
        "8 ounces whole button mushrooms",
        "3 small zucchini, chopped",
        "2 cups chopped carrots",
        "1/4 cup olive oil",
        "salt and pepper to taste",
        "3 cups water",
        "1 cup milk",
        "1/4 cup butter",
        "1 (7.6 ounce) package instant mashed potato flakes",
        "1 (12 ounce) package corn tortillas",
        "3 cups enchilada sauce",
        "8 ounces shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 390 kcal",
        "Carbs > 35.9 g",
        "Cholesterol > 54 mg",
        "Fat > 23.9 g",
        "Protein > 10.8 g",
        "Sodium > 210 mg"
    ],
    "n": "Easy Mashed Potato and Roasted Vegetable Enchiladas",
    "a": "JUSTLETTY2",
    "r": "0",
    "s": 12,
    "des": "\"This is the perfect comfort food for cold days. To make it vegan, substitute non-dairy ingredients for dairy. Leftover filling makes a great lunch! If you want to make mashed potatoes from scratch, you will want at least 4 cups when you are through.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nIn a large mixing bowl, combine broccoli, mushrooms, zucchini, and carrots. Drizzle the vegetables with olive oil, and season with salt and pepper. Spread vegetables in a single layer in a shallow baking dish. Roast vegetables in the preheated oven for 30 to 40 minutes; stir halfway through their cooking time. When finished cooking, remove from the oven, and reduce oven temperature to 350 degrees F (175 degrees C).\nBring water, milk, and butter to a boil in a large pot. Remove the pot from heat, and mix in the mashed potato flakes. Let stand two minutes, then stir the mashed potatoes with a fork until they are smooth. Stir in roasted vegetables.\nIn a dry, nonstick skillet over medium heat, quickly heat each tortilla on both sides to make pliable. Dip the tortillas in enchilada sauce. Put a large spoonful (approximately 1/4 to 1/3 cup) of potato-veggie mixture into the center of each tortilla. Top mixture with about 1 to 2 tablespoons cheese, and roll tortillas. Place seam-side down in a 9x13 inch baking dish. Pour extra sauce over top, and sprinkle with remaining cheese.\nBake at 350 degrees F (175 degrees C) for approximately 20 to 30 minutes, or until the enchiladas are heated through.",
    "pt": "40 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "134791.jpg",
    "o": "3737164.jpg,3550665.jpg,3371567.jpg,2614179.jpg,2174273.jpg,2144298.jpg",
    "st": "allrecipes"
}