{
    "id": 164582,
    "old_rating": "4.69912",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups crushed graham crackers",
        "1 teaspoon white sugar",
        "1/8 teaspoon ground cinnamon (optional)",
        "1/4 cup chopped pecans (optional)",
        "4 tablespoons melted butter",
        "2 (8 ounce) packages cream cheese, softened",
        "3 eggs",
        "1 cup sugar",
        "1 teaspoon vanilla extract",
        "1 (16 ounce) container sour cream"
    ],
    "nut": [
        "Calories > 585 kcal",
        "Carbs > 42.2 g",
        "Cholesterol > 172 mg",
        "Fat > 43.1 g",
        "Protein > 9.8 g",
        "Sodium > 358 mg"
    ],
    "n": "Perfect Cheesecake Everytime",
    "a": "Cheesecakemama",
    "r": "0",
    "s": 8,
    "des": "\"I came up with this because I wanted simple, but elegant too.  I wanted the taste of restaurant cheesecake, but something simple to prepare--because I did not want to measure the sour cream, I dumped in the whole container. I also did not want to bake for an hour, so that is where the 30 minute shut-off of the oven comes into play. I shut off the oven and do not open door for 6 hours or leave in oven all night. This will get you great reviews from friends. You also will not order cheesecake out again. If it cracks, garnish with fruit to hide the cracks.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Whisk together the crushed graham crackers, the 1 teaspoon sugar, cinnamon, and walnuts. Stir in the butter. Press the mixture into the bottom of a 9 inch springform pan.\nBake in the preheated oven for 10 minutes. Remove from oven; allow crust to cool.\nBeat the cream cheese with the eggs on medium-low with an electric mixer until smooth. Beat in the 1 cup sugar and vanilla. Fold in the sour cream just until blended. Do not overmix; ovemixing causes the cheesecake to crack. Pour into the cooled crust.\nBake in the preheated oven for 30 minutes. Turn oven off. When the cheesecake has reached room temperature, chill in refrigerator for 8 hours before serving.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "15 h ",
    "i": "1010633.jpg",
    "o": "4532693.jpg,4401583.jpg,3221403.jpg,3188965.jpg,3016912.jpg,2586062.jpg",
    "st": "allrecipes"
}