{
    "id": 16513,
    "old_rating": "3.88235",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "3 onions, chopped",
        "1 green bell pepper, chopped",
        "1 red bell pepper, chopped",
        "1 yellow bell pepper, chopped",
        "2 sliced zucchini",
        "8 chopped tomatoes",
        "3 tablespoons tomato paste",
        "4 cloves garlic, minced",
        "2 tablespoons dried oregano",
        "2 tablespoons dried basil",
        "1 tablespoon dried thyme",
        "salt and pepper to taste",
        "2 tablespoons butter",
        "1 1/2 tablespoons all-purpose flour",
        "3 cups milk",
        "1 cup shredded Cheddar cheese",
        "1/8 teaspoon freshly ground nutmeg",
        "salt and pepper to taste",
        "12 spinach lasagna noodles"
    ],
    "nut": [
        "Calories > 764 kcal",
        "Carbs > 103.9 g",
        "Cholesterol > 60 mg",
        "Fat > 28.7 g",
        "Protein > 30.4 g",
        "Sodium > 334 mg"
    ],
    "n": "Lisa's Lasagne",
    "a": "LISAMICH",
    "r": "0",
    "s": 4,
    "des": "\"A colorful, tasty dish. Served with garlic bread, this vegetarian lasagne makes an excellent meal for guests.\"",
    "ins": "Heat the oil in a large saucepan.  Add the onions and saute for 3 minutes.  Add the peppers and saute for 2 minutes. Add the zucchini and saute 3 minutes before adding the tomatoes, tomato paste, garlic and oregano, basil, thyme, salt and pepper.  Cover the saucepan and simmer for 20 to 30 minutes (the longer the better as long as the sauce is not sticky.)\nPreheat the oven to 200 degrees F (95 degrees C). Grease a 9x13 inch baking dish.\nWhile the sauce cooks, melt 2 tablespoons butter in a saucepan. Add the flour into the butter, stir vigorously for 2 minutes. Gradually add the milk, stirring until the sauce thickens. Stir in the cheese, reserving as much as you will want  to sprinkle on top of the lasagna. Stir the cheese into the flour and butter mixture until it has melted completely. Season with nutmeg, salt, and pepper.\nSoak the lasagna noodles in water for 30 seconds.\nCover the bottom of the prepared dish with some of the tomato sauce, followed by a layer of the lasagna sheet, and the cheese sauce. Continue layering these ingredients ending with a layer of cheese sauce. Sprinkle the final layer of cheese sauce with nutmeg, salt, pepper, and the reserved cheese.\nBake the lasagna 40 to 50 minutes, until the top of the lasagna is golden brown.",
    "pt": "40 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "637458.jpg",
    "o": "",
    "st": "allrecipes"
}