{
    "id": 16595,
    "old_rating": "4.5977",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (.25 ounce) package active dry yeast",
        "1 cup warm water (110 degrees F)",
        "3 cups all-purpose flour",
        "1 egg",
        "1 tablespoon butter",
        "1 tablespoon white sugar",
        "1 teaspoon salt",
        "1 cup chopped ham",
        "1 cup shredded mozzarella cheese",
        "1 (4 ounce) jar diced pimento peppers, drained",
        "1/2 cup black olives, drained and chopped"
    ],
    "nut": [
        "Calories > 285 kcal",
        "Carbs > 40.2 g",
        "Cholesterol > 44 mg",
        "Fat > 7.8 g",
        "Protein > 12.7 g",
        "Sodium > 685 mg"
    ],
    "n": "Ham and Cheese Picnic Bread",
    "a": "MARBALET",
    "r": "0",
    "s": 8,
    "des": "\"This is a great picnic bread, filled with ham, cheese, pimento and olives. Everyone loves it!\"",
    "ins": "In a small mixing bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large mixing bowl, combine the yeast mixture with the flour, egg, butter, sugar and salt; mix well.  When the dough has pulled together, turn it out onto a lightly floured surface, and knead until smooth, about 8 minutes.\nLightly oil a large mixing, place the dough in the bowl, and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nPreheat oven to 400 degrees F (200 degrees C). Combine the ham, cheese, pimento, and olive in a medium mixing bowl; set aside.\nDeflate the dough, and turn it out onto a lightly floured surface. Roll or pat the dough into a 10x14 inch rectangle. Make parallel cuts 3/4 inch wide and 2 inches long on the two long edges of the rectangle. Evenly spread the filling mixture over the center of the rectangle. Fold the short ends of the rectangle over the filling. Starting from one of these ends, alternately stretch strips from the two sides across the filling so that the strips overlap diagonally. Transfer the loaf to a lightly greased baking sheet, cover with a damp cloth, and let rise until doubled in volume, about 40 minutes.\nBake at 400 degrees F (200 degrees C) for 20 to 30 minutes, or until golden brown.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "18910.jpg",
    "o": "4520257.jpg,3765535.jpg,1125648.jpg,299360.jpg,34365.jpg,22514.jpg",
    "st": "allrecipes"
}