{
    "id": 16590,
    "old_rating": "4.19231",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil",
        "1 large onion, chopped",
        "2 cloves garlic, minced",
        "2 tablespoons butter",
        "4 skinless, boneless chicken breast halves",
        "salt and pepper to taste",
        "1 teaspoon dried rosemary",
        "2 (4.5 ounce) cans sliced mushrooms, drained",
        "1 1/2 cups chicken broth",
        "1 (16 ounce) container sour cream, room temperature",
        "1 tablespoon all-purpose flour"
    ],
    "nut": [
        "Calories > 583 kcal",
        "Carbs > 14.4 g",
        "Cholesterol > 135 mg",
        "Fat > 42.4 g",
        "Protein > 37 g",
        "Sodium > 1037 mg"
    ],
    "n": "Coq au Creme",
    "a": "Caroline Kheiri",
    "r": "0",
    "s": 4,
    "des": "\"This is a French recipe taught to me by one of my husband's Moroccan cousins. It's super easy, and can be doubled for a larger dinner party. It's great served with a Caesar salad and lots of French bread to dip in the creamy sauce.\"",
    "ins": "Heat oil in a large skillet over medium heat. Add onion and garlic and saute until slightly clear, then reduce heat to medium low (careful not to burn, but browning is okay).\nMeanwhile, melt butter or margarine in another large skillet over medium high heat. Rinse chicken breasts and pat dry; season with salt and pepper to taste and brown on both sides, about 2 minutes each side.\nDrain and add browned chicken breasts to onion/garlic mixture, then add rosemary, mushrooms and chicken broth. Stir to mix together, making sure chicken breasts are evenly spaced in the skillet. Reduce heat to simmer, cover skillet tightly and cook for 30 minutes.\nAdd sour cream and stir well, breaking up any clumps with a spoon. Cover skillet again and allow to heat through for 10 minutes.\nStrain about 3/4 cup of the liquid from the skillet into a small bowl; add flour and mix well with a fork to break up any clumps. Pour mixture into the chicken mixture, stir well and cook over medium heat for about 15 to 20 more minutes to thicken the sauce. Serve hot.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "111380.jpg",
    "o": "",
    "st": "allrecipes"
}