{
    "id": 16602,
    "old_rating": "4.5939",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 skinless, boneless chicken breasts",
        "8 slices cooked ham",
        "4 slices Swiss cheese, cut into 1 inch pieces",
        "salt and pepper to taste",
        "1 teaspoon dried thyme",
        "1/4 cup melted butter",
        "1/2 cup cornflakes cereal crumbs",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "1/2 cup sour cream",
        "1 teaspoon lemon juice"
    ],
    "nut": [
        "Calories > 490 kcal",
        "Carbs > 14 g",
        "Cholesterol > 163 mg",
        "Fat > 25.1 g",
        "Protein > 50 g",
        "Sodium > 1080 mg"
    ],
    "n": "Cordon Bleu Chicken Rolls",
    "a": "Michelle",
    "r": "0",
    "s": 6,
    "des": "\"This is the best Chicken Cordon Bleu recipe! Chicken stuffed with ham and Swiss cheese. I hope you enjoy it as much as I have.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPlace each chicken breast half between sheets of plastic wrap and pound with a meat mallet to about 1/8 inch thickness. Place a finger of cheese on each ham slice and sprinkle lightly with thyme and salt and pepper to taste. Roll up seasoned ham and cheese 'jellyroll-style', then roll each chicken breast with ham and cheese inside. Tuck in ends and fasten with toothpicks.\nPlace melted butter in a small bowl and place cereal crumbs in a shallow dish or bowl. Dip each chicken roll in butter or margarine, then roll in crumbs, turning to coat thoroughly. Place coated rolls in a lightly greased 9x13 inch baking dish.\nBake at 400 degrees F (200 degrees C) for about 40 minutes or until chicken is golden brown and juices run clear. Serve with cordon bleu sauce, if desired.\nTo Make Cordon Bleu Sauce: In a small saucepan mix together the soup, sour cream and lemon juice. Heat over low heat, stirring occasionally, and serve hot over chicken rolls. Makes about 2 cups; 8 servings of 1/4 cup each.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "371879.jpg",
    "o": "4529671.jpg,4429845.jpg,3787925.jpg,3693764.jpg,3665832.jpg,3346538.jpg",
    "st": "allrecipes"
}