{
    "id": 16604,
    "old_rating": "4.29268",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons canola oil",
        "5 whole cloves",
        "10 black peppercorns",
        "1 (1 inch) piece cinnamon stick",
        "1 bay leaf",
        "1 whole cardamom pod (optional)",
        "2 onion, chopped",
        "6 roma (plum) tomatoes, chopped",
        "4 cloves garlic, minced",
        "2 tablespoons minced fresh ginger root",
        "1 teaspoon powdered red pepper or dried Cajun pepper (optional)",
        "1 (15 ounce) can kidney beans, drained",
        "salt to taste",
        "water",
        "6 sprigs cilantro, minced"
    ],
    "nut": [
        "Calories > 482 kcal",
        "Carbs > 59.1 g",
        "Cholesterol > 0 mg",
        "Fat > 22.9 g",
        "Protein > 15.7 g",
        "Sodium > 480 mg"
    ],
    "n": "Red Kidney Beans (Rajma)",
    "a": "MEDHALEE",
    "r": "0",
    "s": 2,
    "des": "\"Enjoy this Indian recipe for rajma (red kidney beans) with jeera (cumin) rice. You can spice this up according to your taste! If you have an Indian grocery store in your area, you could add a great taste to it by adding one spoon of 'garam masala' which is a special blend of mixed spices...But it's just as great without it!\"",
    "ins": "Heat oil in a large saucepan over a medium heat. Stir in the cloves, whole black peppercorn, cinnamon, cardamom and bay leaf. Cover the pan as the pepper tends to splutter right out of the pan and can cause burns! Let heat for 1 minute.\nReduce the heat to medium-low and add the sliced onions. Saute until the onions are soft and almost translucent. Mix in the  tomatoes and saute well. (For a great taste, saute until almost dry.)\nRaise the stovetop's temperature to a medium heat. Add the garlic and ginger and saute for 2 to 3 minutes. Mix in  the chili powder,  red kidney beans and salt; mix well. Slowly add water a small amount at a time. You are adding water to create a gravy, only add water until the gravy has reached the consistency that you would like. For a smoother gravy, cool and blend the sauteed mixture before adding the red kidney beans. Garnish with cilantro.",
    "pt": "15 m",
    "ct": "5 m",
    "tt": "20 m",
    "i": "237145.jpg",
    "o": "",
    "st": "allrecipes"
}