{
    "id": 166529,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon minced fresh ginger",
        "3 tablespoons lime juice",
        "4 teaspoons fish sauce",
        "2 teaspoons white sugar",
        "salt and pepper to taste",
        "1/4 cup olive oil",
        "1 clove garlic, minced",
        "1 teaspoon grated lime zest",
        "1/2 fresh red chile pepper, seeded and minced",
        "1 bunch cilantro, stems and leaves separated",
        "2 (8 ounce) tuna steaks",
        "1 bunch watercress, trimmed",
        "12 cherry tomatoes, halved",
        "1/2 fresh red chile pepper, cut into matchsticks"
    ],
    "nut": [
        "Calories > 565 kcal",
        "Carbs > 17 g",
        "Cholesterol > 102 mg",
        "Fat > 29.9 g",
        "Protein > 58.4 g",
        "Sodium > 890 mg"
    ],
    "n": "Seared Ahi Tuna with Watercress, Chile, and Ginger Salad",
    "a": "Alex Bluett",
    "r": "0",
    "s": 2,
    "des": "\"This Thai influenced tuna steak with a light and aromatic salad is ideal for summer.\"",
    "ins": "Whisk together the ginger, lime juice, fish sauce, sugar, salt and pepper in a bowl until the sugar has dissolved. Slowly whisk in olive oil until incorporated. Set aside and refrigerate half of this mixture to be used as a salad dressing later. Whisk the garlic, lime zest, minced chile pepper, and cilantro stems into the marinade. Coat the tuna steaks with the marinade, cover, and let stand for 1 hour at room temperature.\nPreheat a large, heavy-bottomed skillet over medium-high heat. Once the skillet is very hot, remove the tuna from the marinade, and place into the skillet. Sear the tuna until golden brown on both sides, and cooked to your desired degree of doneness, about 2 minutes per side for medium, depending on thickness.\nPlace the watercress in a large bowl with the cilantro leaves, cherry tomatoes, and sliced chile pepper. Pour in the reserved dressing, and toss to mix. Serve the seared tuna on a bed of salad.",
    "pt": "30 m",
    "ct": "5 m",
    "tt": "1 h ",
    "i": "720213.jpg",
    "o": "",
    "st": "allrecipes"
}