{
    "id": 166506,
    "old_rating": "4.37879",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon butter",
        "1 large onion, thinly sliced",
        "6 mushrooms, sliced",
        "1 teaspoon brown sugar",
        "1 (16 ounce) package potato gnocchi",
        "20 peeled and deveined large shrimp (21 to 30 per pound)",
        "3 tablespoons reduced-fat sour cream",
        "1 teaspoon paprika",
        "1 pinch saffron",
        "salt to taste",
        "2 tablespoons shredded fresh basil",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 333 kcal",
        "Carbs > 26.7 g",
        "Cholesterol > 198 mg",
        "Fat > 14.7 g",
        "Protein > 23.7 g",
        "Sodium > 471 mg"
    ],
    "n": "Creamy Saffron Shrimp with Gnocchi and Caramelized Onion",
    "a": "@lex",
    "r": "0",
    "s": 4,
    "des": "\"It sounds fancy, but this is a simple and delicious meal you can easily make for any occasion. Feel free to add any vegetables you like and make a meal out of it.\"",
    "ins": "Melt the butter in a large skillet over medium heat. Stir in the onion, mushrooms, and brown sugar. Cook and stir until the onion has cooked to a deep brown color, about 10 minutes. Remove the caramelized onions and set aside.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the gnocchi and return to a boil. Cook until the gnocchi floats to the top, about 3 minutes; drain, and keep warm.\nPlace the skillet over medium-high heat, and stir in the shrimp. Cook and stir until the shrimp have turned pink on the outside and are no longer translucent in the center, about 5 minutes. Add the caramelized onions, sour cream, paprika, and saffron. Cook and stir until the mixture begins to simmer, then gently fold in the cooked gnocchi, then season to taste with salt.\nPour the gnocchi into a serving dish, and sprinkle with shredded basil and Parmesan cheese to serve.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "180717.jpg",
    "o": "4506786.jpg,817327.jpg,808380.jpg,576294.jpg,334984.jpg,191458.jpg",
    "st": "allrecipes"
}