{
    "id": 167029,
    "old_rating": "4.08696",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 sweet potatoes",
        "2 heads garlic",
        "2 tablespoons olive oil",
        "2 tablespoons butter (at room temperature)",
        "3/4 cup light sour cream",
        "1/2 cup reduced-fat cream cheese",
        "1/2 teaspoon cayenne pepper (optional)",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 200 kcal",
        "Carbs > 19.9 g",
        "Cholesterol > 25 mg",
        "Fat > 11.9 g",
        "Protein > 4.3 g",
        "Sodium > 135 mg"
    ],
    "n": "Roasted Garlic Sweet Potatoes",
    "a": "Kelly",
    "r": "0",
    "s": 8,
    "des": "\"These sweet potatoes are prepared similar to roasted garlic mashed potatoes. The sweet potatoes add an interesting creamy and sweet dynamic that is balanced out with sour cream, cream cheese, and--of course--roasted garlic...mmm.\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C).\nPrick the sweet potatoes with a fork or the tip of a paring knife; set aside. Cut off the top of the heads of garlic to expose the cloves, trimming about 1/4 inch off of the top of each clove. You may need to trim individual cloves along the sides of each head. Brush the cut cloves with the olive oil, then nestle each head into a piece of aluminum foil.\nPlace the sweet potatoes and garlic cloves directly on the oven racks. Bake for about 1 hour, removing the sweet potatoes once they have softened, and removing the garlic heads once they are tender and nicely browned.\nPeel the sweet potatoes, and place into a mixing bowl. Squeeze the individual garlic cloves into the bowl, then add the butter, sour cream, cream cheese, and cayenne pepper. Mash until smooth, then season to taste with salt and pepper. Scrape the mashed potatoes into a 1 1/2 quart baking dish, and return to the oven for about 15 minutes to reheat.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1885698.jpg",
    "o": "",
    "st": "allrecipes"
}