{
    "id": 167198,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup mayonnaise",
        "2 tablespoons milk",
        "1 tablespoon white vinegar",
        "1/2 teaspoon white sugar",
        "6 cups shredded cabbage",
        "3 cups olive oil",
        "4 potatoes, sliced 1/4 inch thick",
        "1/4 pound thinly sliced capicola",
        "4 (1 ounce) slices mozzarella cheese",
        "4 (1 ounce) slices provolone cheese",
        "4 (1 ounce) slices Swiss cheese",
        "8 thick slices Italian bread",
        "4 thin slices onion (optional)",
        "4 thin slices tomato (optional)"
    ],
    "nut": [
        "Calories > 1116 kcal",
        "Carbs > 76.8 g",
        "Cholesterol > 93 mg",
        "Fat > 73.7 g",
        "Protein > 38.7 g",
        "Sodium > 1347 mg"
    ],
    "n": "Primanti-Style Sandwiches",
    "a": "Mayor McFood",
    "r": "0",
    "s": 4,
    "des": "\"Anyone who has been to Pittsburgh can tell you about the wonderful Primanti Brothers sandwiches which are a local delicacy. Coleslaw, fries, cheese, and meat (or no meat for you veggies) on thickly sliced Italian bread brings a taste of Pittsburgh to wherever you may be. You can substitute your favorite meat for the capicola.\"",
    "ins": "Whisk together the mayonnaise, milk, white vinegar, and white sugar in a large bowl; add the cabbage and toss to coat. Chill in refrigerator at least 1 hour.\nHeat oil in deep-fryer or large deep pan to 375 degrees F (190 degrees C); add the potato slices; cook until crispy and golden brown, 5 to 6 minutes. Drain on paper towels.\nPlace a large skillet over medium heat. Arrange the capicola in four separate stacks in the skillet and top each stack with 1 slice mozzarella cheese, provolone cheese, and Swiss cheese; heat until the cheese begins to melt.\nArrange 4 slices of Italian bread on 4 separate plates. Top each slice with a stack of capicola and melted cheese; about 1 1/2 cups of the cabbage mixture, 1 slice onion, 1 slice tomato, and about 1/4 of the fried potatoes. Top with the remaining bread slices. Cut each sandwich in half to serve.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "1043446.jpg",
    "o": "",
    "st": "allrecipes"
}