{
    "id": 167200,
    "old_rating": "4.7",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup grated orange zest",
        "1/2 cup white sugar",
        "1/4 cup water",
        "2 1/2 cups all-purpose flour",
        "3 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 egg",
        "1 cup white sugar",
        "3 tablespoons melted butter",
        "1 1/4 cups milk"
    ],
    "nut": [
        "Calories > 489 kcal",
        "Carbs > 97.2 g",
        "Cholesterol > 50 mg",
        "Fat > 8.1 g",
        "Protein > 8.4 g",
        "Sodium > 553 mg"
    ],
    "n": "Orange Peel Bread",
    "a": "Bob",
    "r": "0",
    "s": 6,
    "des": "\"Grandma-Ag's Orange Bread - This bread is a fond memory of my childhood, visiting Agnes Frances Primm, my Grandma-Ag. As a young adult, I tried to duplicate the recipe, and unable. I went back and begged her for the secrets of it. When I asked her how long it had taken to develop the tricky recipe, she flattened my ego by telling me she'd gotten it out of a magazine years before! I like to make it for Christmas.\"",
    "ins": "Place the orange zest into a saucepan and add water to cover; bring to a boil and cook 5 minutes. Strain the zest through a mesh strainer and return to the saucepan along with 1/2 cup white sugar and 1/4 cup of water. Return to a boil, then reduce heat to medium-low; cook, stirring constantly, until the water has evaporated. Allow to cool until lukewarm.\nPreheat an oven to 350 degrees F (175 degrees C). Grease and flour a 9x5 inch loaf pan.\nWhisk the flour, baking powder, and salt together in a bowl; set aside. Whisk the egg and 1 cup of sugar in a bowl. Stir in the butter, milk, and cooled orange zest until blended; stir in the flour mixture until just moistened then pour into the prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 55 to 65 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "3 h ",
    "i": "2565112.jpg",
    "o": "",
    "st": "allrecipes"
}