{
    "id": 16721,
    "old_rating": "3.91667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "1 teaspoon salt",
        "1/2 teaspoon baking powder",
        "1 cup butter",
        "4 eggs",
        "2 teaspoons distilled white vinegar",
        "3 1/2 cups water",
        "1 cup dry lentils",
        "3 potatoes, chopped",
        "1 onion, chopped",
        "1 tablespoon olive oil",
        "1 teaspoon salt"
    ],
    "nut": [
        "Calories > 777 kcal",
        "Carbs > 88.1 g",
        "Cholesterol > 174 mg",
        "Fat > 38.1 g",
        "Protein > 21.1 g",
        "Sodium > 1092 mg"
    ],
    "n": "Vegetarian Pasties",
    "a": "avihockey",
    "r": "0",
    "s": 6,
    "des": "\"I came up with this recipe because I wanted a vegetarian version.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nMake the dough: mix flour, salt and baking powder together in a medium size mixing bowl. Cut in butter. Stir in egg, vinegar and 1/2 cup water. Continue stirring until dough is moist enough to be formed into a ball (add more water if necessary). Form the dough into a large ball.\nMake the filling: bring a pot of 3 cups water to boil, add lentils and continue to boil for 30 to 45 minutes; until lentils are tender. Watch the lentils and add water if necessary.\nWrap the potatoes in aluminum foil and bake them for 30 minutes in the preheated oven. When the potatoes have cooled cut them into small pieces and mix them with the lentils.\nIn a frying pan saute onions with oil. Stir the onions into the potato-lentil mixture; season with salt and stir.\nDivide the dough into 6 - 8-inch circles. Lay the circles on a flat, floured surface. Place one cup of filling into the center of each circle. Fold the dough around the filling; seal the edges and arrange the pasties on an ungreased cookie sheet. Bake for one hour in the preheated oven.",
    "pt": "40 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "386307.jpg",
    "o": "",
    "st": "allrecipes"
}