{
    "id": 167419,
    "old_rating": "4.32168",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup chicken broth",
        "1 (4 pound) whole chicken, rinsed and patted dry",
        "1/2 cup butter, cut into 1 tablespoon sized pieces",
        "2 navel oranges, halved",
        "salt and pepper to taste",
        "2 cloves garlic, minced",
        "1/2 cup butter, melted",
        "2 sprigs fresh rosemary",
        "2 sprigs fresh thyme",
        "2 sprigs fresh sage"
    ],
    "nut": [
        "Calories > 707 kcal",
        "Carbs > 8.9 g",
        "Cholesterol > 264 mg",
        "Fat > 53.5 g",
        "Protein > 46.8 g",
        "Sodium > 539 mg"
    ],
    "n": "Orange Herb Roasted Chicken",
    "a": "Nellie Fiorenzi",
    "r": "0",
    "s": 6,
    "des": "\"This whole roasted chicken turns out terrifically flavorful and tender, and the broth left in the bottom is a perfect gravy in itself!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Pour the chicken broth into a small roasting pan, and set aside.\nLoosen the skin from the breasts and thighs of the chicken. Stuff the butter pieces evenly underneath the skin of the chicken, and place into the roasting pan. Squeeze the orange halves over the chicken, and stuff the orange halves into the chicken cavity. Tie the legs together with kitchen twine. Sprinkle the chicken with salt and pepper to taste, then rub in the minced garlic. Drizzle the melted butter all over the chicken, then lay the herb sprigs onto the breast and around the legs.\nCover the dish with aluminum foil, and bake in the preheated oven for 20 minutes. Uncover and baste the chicken with the pan juices. Continue cooking until the chicken is no longer pink, or until a meat thermometer inserted into the thickest part of the thigh reads 165 degrees F (74 degrees C), 1 to 2 hours. Baste the chicken every 10 to 15 minutes after you uncover it. Once cooked, allow the chicken to rest out of the oven for 10 minutes before slicing.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "2587775.jpg",
    "o": "2587775.jpg,2568921.jpg,2175603.jpg,2058498.jpg,886285.jpg,662482.jpg",
    "st": "allrecipes"
}