{
    "id": 16794,
    "old_rating": "4.72635",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 recipe pastry for a 9 inch double crust pie",
        "4 boneless, skinless chicken breast halves",
        "1/2 cup chopped onion",
        "1 teaspoon poultry seasoning",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1 cup shredded Cheddar cheese",
        "1 cup shredded mozzarella cheese",
        "2 cups frozen mixed vegetables, thawed",
        "1 cup sliced fresh mushrooms",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 648 kcal",
        "Carbs > 44.5 g",
        "Cholesterol > 81 mg",
        "Fat > 37.3 g",
        "Protein > 33.8 g",
        "Sodium > 1272 mg"
    ],
    "n": "Chicken Pot Pie VI",
    "a": "Angie Smothermon",
    "r": "0",
    "s": 6,
    "des": "\"This is a simple and delicious recipe I received from a friend. Chock-full of tender veggies, gooey cheese, and moist chicken.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease and flour a 2 quart casserole dish.\nPlace chicken breasts, onion, and poultry seasoning in a medium saucepan and add enough water to cover. Simmer over medium heat for 8 to 10 minutes, until chicken is cooked through. Drain and dice chicken.\nIn a large bowl, combine chicken, onions, cream of chicken soup, cream of mushroom soup, Cheddar cheese, mozzarella cheese, mixed vegetables, mushrooms, and salt and pepper. Mix thoroughly.\nLay one sheet of pastry in bottom of greased and floured pan. Pour chicken mixture over pastry. Cover with second sheet of pastry. Seal edges of top and bottom pastries. Cut steam vents in top.\nBake in preheated oven for 50 minutes, until pastry is golden brown.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "693736.jpg",
    "o": "4023487.jpg,3190167.jpg,2155025.jpg,1640291.jpg,1111311.jpg,965601.jpg",
    "st": "allrecipes"
}