{
    "id": 168203,
    "old_rating": "4.11538",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 3/4 cups dry garbanzo beans",
        "1 (15 ounce) can pumpkin puree",
        "5 fluid ounces lemon juice",
        "1/3 cup extra-virgin olive oil",
        "1/2 cup tahini paste",
        "3 cloves garlic, minced",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground allspice",
        "salt to taste"
    ],
    "nut": [
        "Calories > 143 kcal",
        "Carbs > 14.5 g",
        "Cholesterol > 0 mg",
        "Fat > 8.1 g",
        "Protein > 4.7 g",
        "Sodium > 70 mg"
    ],
    "n": "Pumpkin Hummus",
    "a": "BOND 007",
    "r": "0",
    "s": 20,
    "des": "\"This stuff is soooooo good!  You can either make it from scratch as I have it here, or you can simply add the pumpkin and spices to a pre-made 32 fl. oz container of hummus. I have played around with it in different recipes, but it makes such a good dip for either soft pita or chips.  It is savory and warm tasting and I heartily recommend everyone try it! Be sure to use pureed pumpkin, not pumpkin pie filling.\"",
    "ins": "Place the garbanzo beans into a large container and cover with several inches of cool water; let stand 8 hours to overnight. Or, bring the beans and water to a boil in a large pot over high heat. Once boiling, turn off the heat, cover, and let stand 1 hour. Drain and rinse before using.\nPlace the soaked garbanzo beans into a large saucepan and cover with several inches of water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until the garbanzo beans are tender, 1 1/2 to 2 hours. Once cooked, refrigerate the beans and liquid until cold.\nDrain the garbanzo beans, reserving the cooking liquid. Place the beans and 1/2 cup of the reserved cooking liquid into a blender, and puree until a smooth paste forms. Add the pumpkin puree, lemon juice, olive oil, tahini, garlic, cinnamon, nutmeg, and allspice. Cover and puree again until smooth. Use additional cooking liquid as needed to achieve a smooth consistency. Season to taste with salt.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "14 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}