{
    "id": 16828,
    "old_rating": "4.54167",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups shortening",
        "2 cups white sugar",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "2 cups mashed cooked carrots",
        "4 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon salt",
        "1 cup chopped walnuts",
        "1 cup chopped walnuts",
        "1 cup confectioners' sugar",
        "1 orange, zested and juiced"
    ],
    "nut": [
        "Calories > 235 kcal",
        "Carbs > 27.2 g",
        "Cholesterol > 15 mg",
        "Fat > 13.2 g",
        "Protein > 2.9 g",
        "Sodium > 100 mg"
    ],
    "n": "Orange Carrot Cookies",
    "a": "JONILYN",
    "r": "0",
    "s": 36,
    "des": "\"My Grandma used to make these cookies all the time, and I grew up hooked!  You'll be surprised at how great the combination of flavors are, especially with the citrusy glaze.\"",
    "ins": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the shortening and sugar until light and fluffy. Add the eggs one at a time, beating well with each addition, then stir in the vanilla and carrots. Combine the flour, baking powder and salt; gradually stir into the creamed mixture. Finally, fold in the walnuts. Drop by rounded spoonfuls onto the prepared cookie sheet.\nBake for 8 to 10 minutes in the preheated oven, until lightly golden. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\nTo make the glaze, put 1 cup of the confectioners' sugar into a medium bowl. Grate the rind of the orange into the bowl with the sugar. Squeeze in enough juice from the orange to form a thin but spreadable consistency. Mix until smooth. If necessary, stir in more confectioners' sugar. Spread onto the cooled cookies. Store in an airtight container.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "4534503.jpg",
    "o": "",
    "st": "allrecipes"
}