{
    "id": 168667,
    "old_rating": "4.3125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (10 ounce) packages frozen chopped broccoli",
        "1 (8 ounce) package cream cheese, softened",
        "2 eggs",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "1/4 cup bacon ranch dressing",
        "1/2 cup sour cream",
        "1/2 cup mayonnaise",
        "1/4 cup chopped onion, or to taste",
        "2 tablespoons all-purpose flour",
        "2 cups shredded Cheddar cheese",
        "1 cup herb-seasoned stuffing mix",
        "1 tablespoon melted butter"
    ],
    "nut": [
        "Calories > 756 kcal",
        "Carbs > 39.6 g",
        "Cholesterol > 170 mg",
        "Fat > 57.2 g",
        "Protein > 23.1 g",
        "Sodium > 1477 mg"
    ],
    "n": "Peggy's Broccoli Casserole",
    "a": "Oaksfan",
    "r": "0",
    "s": 6,
    "des": "\"I made this recipe by taking two other recipes, then adding and subtracting with my own ingredients. I took it to a friends and family picnic, and everyone loved it.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Prepare a 2 quart casserole dish with cooking spray.\nPlace the frozen broccoli into a large saucepan and cover with water, and bring to a boil over high heat. When the water has come to a boil and the broccoli is no longer frozen, drain in a colander set in the sink.\nWhile waiting for the broccoli to come to a boil, beat the cream cheese and eggs in a large bowl until smooth. Add the condensed soup, ranch dressing, sour cream, mayonnaise, onion, and flour; mix well. Stir in the drained broccoli along with the Cheddar cheese until evenly mixed. Pour into the prepared baking dish. Toss the dry stuffing mix with the melted butter, and spread evenly over the top of the casserole.\nBake in the preheated oven until the sauce is bubbly, and the top is golden brown, 30 to 35 minutes. Let stand 10 minutes before serving.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "162711.jpg",
    "o": "",
    "st": "allrecipes"
}