{
    "id": 16875,
    "old_rating": "4.3045",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups vanilla wafer crumbs",
        "3 bananas, sliced into 1/4 inch slices",
        "1 1/2 cups white sugar",
        "1/4 cup all-purpose flour",
        "2 cups milk",
        "3 egg yolks",
        "2 teaspoons butter",
        "2 teaspoons vanilla extract",
        "3 egg whites",
        "1/4 cup white sugar"
    ],
    "nut": [
        "Calories > 504 kcal",
        "Carbs > 92.1 g",
        "Cholesterol > 84 mg",
        "Fat > 12.8 g",
        "Protein > 7.2 g",
        "Sodium > 194 mg"
    ],
    "n": "Homemade Banana Pudding Pie",
    "a": "Pat",
    "r": "0",
    "s": 8,
    "des": "\"I can't stand those instant banana puddings. This one is old and authentic!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nLine the bottom and sides of a 9-inch pie plate with a layer of alternating vanilla wafer crumbs and banana slices.\nTo Make Pudding: In a medium saucepan, combine 1 1/2 cups sugar with flour. Mix well, then stir in half the milk. Beat egg yolks and whisk into sugar mixture. Add remaining milk and butter or margarine.\nPlace mixture over low heat and cook until thickened, stirring frequently. Remove from heat and stir in vanilla extract. Pour half of pudding over vanilla wafer and banana layer while still hot.\nMake another layer of alternating vanilla wafers and banana slices on top of pudding layer. Pour remaining pudding over second wafer and banana layer.\nTo Make Meringue: In a large glass or metal bowl, beat egg whites until foamy. Gradually add 1/4 cup sugar, continuing to beat until whites are stiff. Spread meringue into pie pan, making sure to completely cover pudding layer.\nBake in preheated oven for 15 minutes, just until meringue is browned. Chill before serving.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "2 h",
    "i": "3138228.jpg",
    "o": "4526930.jpg,4512309.jpg,4512307.jpg,4507455.jpg,4507452.jpg,4485083.jpg",
    "st": "allrecipes"
}