{
    "id": 16881,
    "old_rating": "4.55694",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds ground beef",
        "1 onion, chopped",
        "2 teaspoons minced garlic",
        "1 (2 ounce) can black olives, sliced",
        "1 (4 ounce) can diced green chili peppers",
        "1 (10 ounce) can diced tomatoes with green chile peppers",
        "1 (16 ounce) jar taco sauce",
        "2 (16 ounce) cans refried beans",
        "12 (8 inch) flour tortillas",
        "9 ounces shredded Colby cheese"
    ],
    "nut": [
        "Calories > 432 kcal",
        "Carbs > 33.3 g",
        "Cholesterol > 68 mg",
        "Fat > 23.9 g",
        "Protein > 19.8 g",
        "Sodium > 847 mg"
    ],
    "n": "Burrito Pie",
    "a": "KATHIMC",
    "r": "0",
    "s": 16,
    "des": "\"This is a lot like a lasagna, only Mexican-style! Serve like a pie and garnish with sour cream, salsa, lettuce and tomato. Make sure you like spicy foods before trying this one. It's hot!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large skillet over medium heat, saute the ground beef for 5 minutes. Add the onion and garlic, and saute for 5 more minutes. Drain any excess fat, if desired. Mix in the olives, green chile peppers, tomatoes with green chile peppers, taco sauce and refried beans. Stir mixture thoroughly, reduce heat to low, and let simmer for 15 to 20 minutes.\nSpread a thin layer of the meat mixture in the bottom of a 4 quart casserole dish. Cover with a layer of tortillas followed by more meat mixture, then a layer of cheese. Repeat tortilla, meat, cheese pattern until all the tortillas are used, topping off with a layer of meat mixture and cheese.\nBake for 20 to 30 minutes in the preheated oven, or until cheese is slightly brown and bubbly.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "4518847.jpg",
    "o": "4518847.jpg,4516803.jpg,4516550.jpg,4506367.jpg,4500550.jpg,4500549.jpg",
    "st": "allrecipes"
}