{
    "id": 16885,
    "old_rating": "4.2766",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "9 potatoes - peeled and cubed",
        "1 1/2 pounds ground beef",
        "1 (6 ounce) can tomato sauce",
        "2 tablespoons chopped fresh parsley",
        "1 dash Worcestershire sauce",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "2 (15 ounce) cans green beans, drained",
        "2 tablespoons all-purpose flour",
        "2 tablespoons milk"
    ],
    "nut": [
        "Calories > 638 kcal",
        "Carbs > 63.5 g",
        "Cholesterol > 97 mg",
        "Fat > 30.7 g",
        "Protein > 27.3 g",
        "Sodium > 651 mg"
    ],
    "n": "Mom's Shepherd's Pie",
    "a": "Missy",
    "r": "0",
    "s": 6,
    "des": "\"This recipe is simple and affordable. It's made up of common ingredients from the pantry- ground beef, green beans, tomato sauce, potatoes and seasonings. I'm not sure where it came from, but I know there are many variations. This is Mom's! Try serving with cranberry sauce or other fruit of your choice.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace the potatoes and water to cover in a large pot over high heat. Boil for 15 minutes. Meanwhile, brown the ground beef in a large skillet over medium high heat; drain excess fat.\nTo the ground beef, add the tomato sauce, parsley, Worcestershire sauce to taste, salt, ground black pepper and green beans. In a separate small bowl, mix the flour with the 3 tablespoons water and stir into the beef mixture.\nStir all together well. Drain the potatoes, mash and spread over the beef mixture Place 2 to 3 vent holes through the mashed potatoes.\nBake at 350 degrees F (175 degrees C) for 25 minutes. Brush the milk over the potatoes for the last 5 minutes of baking.",
    "pt": "35 m",
    "ct": "25 m",
    "tt": "1 h",
    "i": "496048.jpg",
    "o": "4465048.jpg,1017140.jpg,1006935.jpg,929405.jpg,836618.jpg,724895.jpg",
    "st": "allrecipes"
}