{
    "id": 168959,
    "old_rating": "4.14865",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 red onion, chopped",
        "1 zucchini, coarsely chopped",
        "1 yellow squash, coarsely chopped",
        "1 carrot, coarsely chopped",
        "1 red bell pepper, coarsely chopped",
        "1 yellow bell pepper, coarsely chopped",
        "1/2 cup sliced baby portabella mushrooms",
        "4 cups vegetable broth",
        "1/2 teaspoon smoked sweet paprika",
        "1/4 teaspoon ground cardamom",
        "1/4 teaspoon salt",
        "1 tablespoon chopped fresh cilantro",
        "1 (16 ounce) can chickpeas, drained",
        "2 Roma tomatoes, sliced",
        "2 cups dry couscous",
        "1 teaspoon grated orange zest",
        "1 tablespoon grated Parmesan cheese (optional)",
        "1/2 teaspoon paprika (optional)",
        "1 tablespoon finely chopped toasted almonds (optional)"
    ],
    "nut": [
        "Calories > 387 kcal",
        "Carbs > 72.1 g",
        "Cholesterol > < 1 mg",
        "Fat > 4.9 g",
        "Protein > 13.6 g",
        "Sodium > 699 mg"
    ],
    "n": "25-Minute Tunisian Vegetable Couscous",
    "a": "girlandagun",
    "r": "0",
    "s": 6,
    "des": "\"A perfect summer meal. What I love about this recipe is the practicality: it is both quick to make and can wait for you; there's no hurry to serve. It's also a satisfying vegetarian meal that even carnivores love, or if a member of your household prefers meat, a chicken breast poached in water, wine, and paprika and then sliced very thin can be added. I do highly recommend the garnish I devised; it can be made very quickly while the couscous is cooking. Or even if you just zest a navel orange over this dish, the aroma is heavenly and it brings the flavors together. Enjoy!\"",
    "ins": "Heat oil in large pot over medium-low heat. Place onion, zucchini, yellow squash, and carrot in pot and cook, stirring occasionally, until onions begin to soften and turn translucent, about 5 minutes. Stir in the red and yellow peppers and mushrooms; cook another 3 minutes. Vegetables should still be firm.\nPour in the vegetable stock and season with paprika, cardamom, salt, and cilantro. Bring mixture to a boil; reduce heat to low. Stir in chickpeas and tomatoes. Slowly pour in the couscous; stir. Cover pot immediately and remove from the heat. Let stand, covered, for 5 minutes. Fluff couscous with a fork. The couscous should have absorbed about half the cooking liquid.\nServe at slightly warmer than room temperature. Garnish with orange zest and the grated cheese, paprika, and almonds.",
    "pt": "12 m",
    "ct": "13 m",
    "tt": "25 m",
    "i": "248517.jpg",
    "o": "",
    "st": "allrecipes"
}