{
    "id": 168984,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups vegetable broth",
        "1 cup green lentils, rinsed and drained",
        "2 tablespoons extra virgin olive oil",
        "2 medium onions, chopped",
        "2 stalks celery, chopped",
        "3 carrots, chopped",
        "2 cloves garlic, minced",
        "2 tablespoons salt-free seasoning blend",
        "1 teaspoon chopped fresh marjoram leaves",
        "1 teaspoon chopped fresh thyme",
        "1 teaspoon chopped fresh lemon thyme",
        "1 tablespoon ground cumin",
        "1/2 teaspoon crushed red pepper flakes",
        "1/8 teaspoon ground cardamom",
        "1 egg",
        "1 cup buckwheat groats",
        "1 tablespoon olive oil",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 tablespoon olive oil",
        "1 tablespoon red wine vinegar"
    ],
    "nut": [
        "Calories > 271 kcal",
        "Carbs > 38.6 g",
        "Cholesterol > 23 mg",
        "Fat > 8.9 g",
        "Protein > 11.2 g",
        "Sodium > 415 mg"
    ],
    "n": "Lentil and Buckwheat Salad",
    "a": "thamesarino",
    "r": "0",
    "s": 8,
    "des": "\"This yummy, whole grain and protein-rich salad is a great lunch, side dish, or potluck item. It can be eaten warm or cold, alone, or on top of a mixed green salad with tomatoes.\"",
    "ins": "Bring broth to a boil in a large pot over high heat. Stir in lentils, reduce heat to low and simmer until lentils are tender but firm, 15 to 20 minutes. Drain, but reserve liquid. Transfer lentils to a large bowl.\nHeat olive oil over medium heat in a skillet. Cook onions until they are soft and translucent about 10 minutes, stirring occasionally. Add celery, carrots, and garlic and continue cooking until carrots are just tender, about 10 minutes. Stir vegetables into lentils. Mix in the seasoning blend, marjoram, thyme, lemon thyme, cumin, crushed red pepper, and cardamom. Set aside.\nWhisk egg in a bowl; add the buckwheat and stir until well coated with egg.\nHeat 1 tablespoon of olive oil in a skillet over medium heat. Add buckwheat and egg mixture. Cook, stirring constantly, until buckwheat has absorbed the egg and appears dry, about 10 minutes. Stir in 2 cups of the reserved lentil liquid and bring to a boil over medium-high heat; reduce heat to low and simmer until liquid is absorbed and buckwheat is soft but maintains its shape and texture, 15 to 25 minutes.\nMix buckwheat into lentil mixture. Season with salt, pepper, 1 tablespoon olive oil, and vinegar. Stir and adjust seasonings. Serve warm, at room temperature, or chilled.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "181752.jpg",
    "o": "",
    "st": "allrecipes"
}