{
    "id": 16892,
    "old_rating": "4.28571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 pounds whole chicken cut up",
        "1 whole dried red chili pepper, seeded and diced",
        "2 carrots, chopped",
        "2 stalks celery, chopped",
        "2 onions, chopped",
        "1 bay leaves",
        "3 cloves garlic, minced",
        "4 (14.5 ounce) cans chicken broth",
        "1 cup heavy cream",
        "1/4 cup cornstarch",
        "1/2 cup water",
        "2 cups self-rising flour",
        "1 cup heavy cream"
    ],
    "nut": [
        "Calories > 1055 kcal",
        "Carbs > 39.2 g",
        "Cholesterol > 308 mg",
        "Fat > 57.8 g",
        "Protein > 89.3 g",
        "Sodium > 1445 mg"
    ],
    "n": "Ultimate Comfort Food",
    "a": "karela",
    "r": "0",
    "s": 7,
    "des": "\"This is the best recipe for chicken and dumplings that I've ever found. It's the ultimate comfort food.\"",
    "ins": "For the stock: In a large pot over high heat, place the chicken parts, chile pepper, carrots, celery, onions, bay leaf, garlic and chicken broth. Mix well and bring to a boil. Reduce heat to low, cover and simmer for 1 to 2 hours, or until  chicken comes off bone easily. Cover and refrigerate overnight.\nThe next day, skim the fat off the top of the soup and remove the chicken parts. De-bone the chicken and chop the meat into bite size pieces. Discard bones and set meat aside. Using a slotted spoon, remove and discard the vegetables. Return the pot to the stove over high heat and bring to a boil. Reduce heat to low for 10 to 15 minutes, add the heavy cream and stir well.\nIn a separate small bowl, dissolve the cornstarch in the water and add to the pot. Stir until thickened, and make the dumplings while the stock reduces.\nFor the dumplings: In a large bowl, combine the flour and the heavy cream, mixing well. Roll into balls about 1 1/2 inches in diameter. Drop balls carefully into the simmering soup and cook for 7 minutes. Then cover soup and cook for 7 more minutes. Add the chicken, stir well and allow to heat through.",
    "pt": "1 h ",
    "ct": "40 m",
    "tt": "9 h ",
    "i": "4497543.jpg",
    "o": "",
    "st": "allrecipes"
}