{
    "id": 168914,
    "old_rating": "4.22059",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup uncooked white rice",
        "2 cups water",
        "1 head broccoli, cut into florets",
        "3 cups cubed cooked chicken",
        "1 1/2 cups shredded Cheddar cheese",
        "2 (10.75 ounce) cans condensed cream of chicken soup",
        "1 cup fat-free plain yogurt",
        "1/3 cup slivered almonds",
        "1/4 teaspoon curry powder",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon black pepper",
        "3 tablespoons lemon juice"
    ],
    "nut": [
        "Calories > 395 kcal",
        "Carbs > 30.6 g",
        "Cholesterol > 68 mg",
        "Fat > 18 g",
        "Protein > 26.9 g",
        "Sodium > 703 mg"
    ],
    "n": "Easy Chicken and Broccoli Casserole",
    "a": "Stacy P",
    "r": "0",
    "s": 8,
    "des": "\"This has been a family favorite for over 15 years.  It's easy to make and a crowd pleaser.  It can also be made the day before and baked when you are ready to enjoy it.\"",
    "ins": "Bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Meanwhile, bring a large pot of lightly salted water to a boil. Add the broccoli florets, and cook uncovered until just tender, about 4 minutes. Drain in a colander, then immediately rinse with cold water for several minutes until cold to stop the cooking process. Once the broccoli is cold, drain well, chop into small pieces, and place into a mixing bowl.\nPreheat an oven to 350 degrees F (175 degrees C).\nStir the cooked rice, chicken, Cheddar cheese, cream of chicken soup, yogurt, almonds, curry powder, garlic powder, pepper, and lemon juice into the broccoli until evenly mixed. Spoon the mixture into a 9x13 inch baking dish.\nBake in the preheated oven until hot and bubbly, about 30 minutes.",
    "pt": "10 m",
    "ct": "50 m",
    "tt": "1 h",
    "i": "1089710.jpg",
    "o": "4517892.jpg,4258589.jpg,3999054.jpg,3913958.jpg,2189587.jpg,1421107.jpg",
    "st": "allrecipes"
}