{
    "id": 169028,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cube beef bouillon",
        "1/2 cup boiling water",
        "2 tablespoons olive oil",
        "1 pound tenderized skirt steak",
        "1 pinch salt",
        "1 cup marinated artichoke hearts, chopped, liquid reserved",
        "1/2 cup roasted red peppers, drained and chopped",
        "2 pickled jalapeno peppers, chopped",
        "1/2 cup pickled carrots, chopped",
        "1 teaspoon capers",
        "2 tablespoons prepared horseradish"
    ],
    "nut": [
        "Calories > 484 kcal",
        "Carbs > 16.4 g",
        "Cholesterol > 71 mg",
        "Fat > 33.8 g",
        "Protein > 30.9 g",
        "Sodium > 1546 mg"
    ],
    "n": "Braised Skirt Steak with Artichoke",
    "a": "Jeff",
    "r": "0",
    "s": 2,
    "des": "\"Had my first annual 'I'm getting old' Dr.'s checkup yesterday and my cholesterol was - what's the opposite of through the roof?  Through the floor?  Anyway, it was low - real low.  And I am healthy as a horse so I thought I might celebrate with a slab o' meat. \"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C).\nDissolve beef boullion cube in boiling water. Heat the olive oil in an oven-safe Dutch oven over high heat. Season the skirt steak on both sides with salt, and cook in the hot oil until browned on both sides, about 2 minutes per side.\nPour the beef bouillon and 1/4 cup artichoke juice into the Dutch oven, then stir in the artichokes, red peppers, jalapeno peppers, carrots, capers, and horseradish. Bring to a boil, then cover, and place into the preheated oven. Bake until the meat has turned from red to light pink in the center, about 30 minutes.\nRemove the skirt steak from the Dutch oven, cover with foil, and keep warm. Return the Dutch oven to the stove, and simmer, uncovered, over medium-high heat until the sauce has reduced to your desired consistency, about 10 minutes. Slice the skirt steak thinly, and serve with the reduced sauce.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "175464.jpg",
    "o": "",
    "st": "allrecipes"
}