{
    "id": 16911,
    "old_rating": "4.39726",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (3 pound) chicken, split in half lengthwise",
        "garlic powder to taste",
        "ground black pepper to taste",
        "1 pinch seasoned salt",
        "1 (12 fluid ounce) can or bottle beer",
        "1/2 cup butter",
        "2 tablespoons garlic powder",
        "1 tablespoon seasoned pepper"
    ],
    "nut": [
        "Calories > 988 kcal",
        "Carbs > 9.5 g",
        "Cholesterol > 316 mg",
        "Fat > 74.3 g",
        "Protein > 64.7 g",
        "Sodium > 464 mg"
    ],
    "n": "Grilled Beer Chicken",
    "a": "Tom Bartlett",
    "r": "0",
    "s": 4,
    "des": "\"This is a chicken recipe from ranch hand trail cooks. The 'garlic on the coals' trick will probably bring your neighbors over, so beware, and cook plenty!!\"",
    "ins": "Preheat grill for high heat.\nIn a microwave-safe bowl, combine the beer, butter, 1 tablespoon garlic powder and seasoned pepper. Heat in the microwave for 2 minutes, or until butter is melted and mixture is hot. Set aside.\nSeason chicken generously with the garlic powder, ground black pepper and seasoned salt to taste.\nBrush the grilling surface with oil. Place chicken onto the grill bone side down. Close the lid, and cook for about 45 minutes, or until the chicken skin is starting to blister.\nTurn the chicken over, so it is bone side up. They will be black and charred, but the chicken meat will be fine. Pierce the membrane of the bone with a fork, and ladle some of the beer mixture into the 'cup' formed by the bones. Throw a teaspoon or so of garlic powder on the coals, close the lid, and seal the vents.\nRepeat ladling the beer mixture into the chicken, and throwing garlic powder onto the coals every 5 minutes, until the mixture is gone. The chicken should be tender and juices should run clear.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "231670.jpg",
    "o": "",
    "st": "allrecipes"
}