{
    "id": 169108,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 egg",
        "2 cups frozen corn",
        "1 tablespoon vegetable oil",
        "3/4 cup onion, chopped",
        "2 cups milk",
        "1/4 cup cornstarch",
        "1/4 cup butter",
        "1 teaspoon ground nutmeg",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 (9 inch) unbaked pie crust",
        "1 egg, beaten"
    ],
    "nut": [
        "Calories > 288 kcal",
        "Carbs > 27.1 g",
        "Cholesterol > 67 mg",
        "Fat > 17.8 g",
        "Protein > 6.5 g",
        "Sodium > 348 mg"
    ],
    "n": "Argentine Corn Pie",
    "a": "Carol C",
    "r": "0",
    "s": 8,
    "des": "\"My dad's wife taught me how to make this recipe and it's always a big success! People just love the soft white sauce. It's specially good to use that frozen corn in the back of the freezer!\"",
    "ins": "Preheat an oven to 375 degrees F (190 degrees C).\nPlace 1 egg into a saucepan cover with water by 1 inch. Cover the saucepan and bring the water to a boil. Once the water is boiling, immediately remove from the heat and let the egg stand in the hot water for 15 minutes. Pour out the hot water and cool the egg under cold running water in the sink; peel and chop the egg. Meanwhile, bring a saucepan of water to a boil. Stir in the corn and return to a boil. Cook for 2 minutes; strain and set aside to cool.\nHeat the vegetable oil in a saucepan over medium heat. Stir in the onion, and cook until the onion has softened and turned translucent, about 5 minutes. Pour the milk into the saucepan and whisk in the cornstarch. Add the butter, nutmeg, salt, and pepper. Bring to a simmer whisking constantly, then cook for 2 minutes until the butter has melted and the sauce has thickened. Stir in the hard boiled egg and corn; pour into the pie crust. Brush the crust with the beaten egg.\nBake in the preheated oven until the crust and the pie are golden brown, about 25 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "685124.jpg",
    "o": "",
    "st": "allrecipes"
}