{
    "id": 169230,
    "old_rating": "4.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup orange juice",
        "2 tablespoons olive oil",
        "3 cloves garlic, minced",
        "6 (6 ounce) boneless pork loin chops",
        "6 slices applewood smoked bacon",
        "6 fresh figs",
        "1 cup fresh mint leaves",
        "1 tablespoon balsamic vinegar",
        "3 tablespoons olive oil",
        "1 tablespoon honey",
        "1/2 cup orange juice",
        "1 pinch sea salt and pepper to taste"
    ],
    "nut": [
        "Calories > 421 kcal",
        "Carbs > 20.2 g",
        "Cholesterol > 68 mg",
        "Fat > 26.4 g",
        "Protein > 26 g",
        "Sodium > 308 mg"
    ],
    "n": "Citrus Grilled Pork Filet with Mint Fig Sauce",
    "a": "Terri Harnish",
    "r": "0",
    "s": 6,
    "des": "\"The sweet marinade keeps the pork from being dry, plus the mint-fig sauce provides a wonderfully light addition to an already tasty pork.\"",
    "ins": "Whisk together 1 cup orange juice, 2 tablespoons olive oil, and the minced garlic in a bowl; pour into a resealable plastic bag. Add the pork chops, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for at least 8 hours.\nPlace the figs and mint leaves into a blender, and blend until pureed. Add the balsamic vinegar, 3 tablespoons olive oil, honey, and 1/2 cup orange juice to the blender, and puree until smooth and thick. Season to taste with sea salt and pepper, then set aside.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate. Remove the pork from the marinade. Discard the remaining marinade. Wrap each pork chop with a slice of bacon, securing with toothpicks as necessary; season with salt and pepper.\nGrill the pork chops until the pork is no longer pink in the center, about 5 minutes per side. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Pour the mint-fig sauce over the pork chops to serve.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "8 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}