{
    "id": 169263,
    "old_rating": "4.54545",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons sesame oil",
        "1 tablespoon minced garlic",
        "1 teaspoon salt",
        "1/2 teaspoon onion powder",
        "1 teaspoon Cajun seasoning",
        "1 teaspoon green hot pepper sauce",
        "2 teaspoons soy sauce",
        "1 teaspoon teriyaki sauce",
        "2 teaspoons brown sugar",
        "12 ounces flat iron steaks",
        "3 tablespoons sesame oil",
        "1/2 red bell pepper, sliced",
        "2 green onions, chopped"
    ],
    "nut": [
        "Calories > 445 kcal",
        "Carbs > 7.1 g",
        "Cholesterol > 77 mg",
        "Fat > 35.8 g",
        "Protein > 24.3 g",
        "Sodium > 1296 mg"
    ],
    "n": "Asian Flair Flat Iron Steak",
    "a": "Victoria Champagne Benoit",
    "r": "0",
    "s": 3,
    "des": "\"One of our local food distributors has been promoting the sell of these becoming-ever-more-popular cuts of meat. After rummaging online recipes, and experimenting with my own, I came up with the following that my husband and I find quite tasty! You can also try cooking it in your indoor grill (we have a Foreman). Serve this over salad greens, or wrap in warm flour tortillas, adding a bit of your favorite Asian dressing.\"",
    "ins": "Whisk together 2 tablespoons of sesame oil with the garlic, salt, onion powder, Cajun seasoning, hot pepper sauce, soy sauce, teriyaki sauce, and brown sugar in a bowl, then pour into a resealable plastic bag. Add the flat iron steak, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 12 hours.\nRemove the flat iron steak from the marinade, and shake off excess. Discard the remaining marinade. Heat the remaining 3 tablespoons of sesame oil in a cast iron skillet over medium high heat until it begins to smoke. Sear the steak in the hot oil until cooked to your desired degree of doneness, about 3 minutes per side for medium. Remove the steak from the skillet and set aside to rest for 5 minutes before slicing thinly. While the steak is resting, cook the bell pepper in the hot skillet until it begins to soften, about 1 minute. Stir in the green onions, and cook for 30 seconds more. Serve the pepper mixture over the sliced steak.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "12 h ",
    "i": "1002610.jpg",
    "o": "",
    "st": "allrecipes"
}