{
    "id": 16961,
    "old_rating": "3.9697",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "2 cups white sugar",
        "1 teaspoon salt",
        "1 teaspoon ground cinnamon",
        "1 teaspoon baking soda",
        "1 1/2 cups vegetable oil",
        "4 eggs, beaten",
        "1 teaspoon red food coloring",
        "2 (10 ounce) packages frozen strawberries, thawed and drained",
        "1 (8 ounce) package cream cheese"
    ],
    "nut": [
        "Calories > 355 kcal",
        "Carbs > 37.3 g",
        "Cholesterol > 50 mg",
        "Fat > 21.6 g",
        "Protein > 4.2 g",
        "Sodium > 227 mg"
    ],
    "n": "Filled Strawberry Bread",
    "a": "SAUNDRA",
    "r": "0",
    "s": 20,
    "des": "\"This strawberry bread is different than any I have ever eaten. It's layered with a delicious strawberry cream cheese filling. It was given to me by a very dear friend.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease two 9x5 inch loaf pans.\nIn a large mixing bowl, stir together the flour, sugar, salt, cinnamon and baking soda.  Add oil, beaten eggs, food coloring; mix well. Drain the strawberries and reserve 1/2 cup of the juice for the filling. Fold in the drained strawberries. Pour batter evenly into the prepared pans.\nBake at 350 degrees F (175 degrees C) for 50 to 60 minutes, or until a toothpick inserted into the center of the loaf comes out clean. Let cool in the pan for 10 minutes, then remove to a wire rack to cool completely.\nIn a medium mixing bowl, mix together the cream cheese with 1/2 cup of the reserved strawberry juice. Slice the loaf twice horizontally to make three layers. Spread the cream cheese mixture between the layers and reassemble the loaf. Wrap loaves in plastic and chill in the refrigerator to set the filling. Slice and serve chilled.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1129822.jpg",
    "o": "",
    "st": "allrecipes"
}