{
    "id": 16984,
    "old_rating": "4.83246",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (10 pound) whole turkey, neck and giblets removed",
        "4 cloves garlic, crushed",
        "2 tablespoons seasoned salt",
        "1/2 cup butter",
        "2 (12 fluid ounce) cans cola-flavored carbonated beverage",
        "1 apple, quartered",
        "1 onion, quartered",
        "1 tablespoon garlic powder",
        "1 tablespoon salt",
        "1 tablespoon ground black pepper"
    ],
    "nut": [
        "Calories > 625 kcal",
        "Carbs > 9.8 g",
        "Cholesterol > 225 mg",
        "Fat > 31.7 g",
        "Protein > 71.2 g",
        "Sodium > 1185 mg"
    ],
    "n": "Turkey in a Smoker",
    "a": "Doug Kacsir",
    "r": "0",
    "s": 13,
    "des": "\"This is a great recipe for smoked turkey. A barbecue grill is nearly impossible to cook a large bird. A smoker is best for this. I prefer hickory chips or hickory wood. Hickory generates a more even smokiness than other woods, and it does not matter whether the wood is green or seasoned. Mesquite, if not well seasoned, will generate a creosote type coating because of the sap that oozes out of the wood while cooking.\"",
    "ins": "Preheat smoker to 225 to 250 degrees F (110 to 120 degrees C).\nRinse turkey under cold water, and pat dry. Rub the crushed garlic over the outside of the bird, and sprinkle with seasoned salt. Place in a disposable roasting pan. Fill turkey cavity with butter, cola, apple, onion, garlic powder, salt, and ground black pepper. Cover loosely with foil.\nSmoke at 225 to 250 degrees F (110 to 120 degrees C) for 10 hours, or until internal temperature reaches 180 degrees F (80 degrees C) when measured in the thickest part of the thigh. Baste the bird every 1 to 2 hours with the juices from the bottom of the roasting pan.",
    "pt": "20 m",
    "ct": "10 h",
    "tt": "10 h ",
    "i": "2833871.jpg",
    "o": "4412355.jpg,4235814.jpg,4211098.jpg,4193886.jpg,2895737.jpg,2754701.jpg",
    "st": "allrecipes"
}