{
    "id": 16987,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound shrimp, peeled and deveined",
        "5 quarts water",
        "4 carrots, sliced",
        "4 onions, quartered",
        "1/2 bunch celery, sliced",
        "2 bay leaves",
        "3 cloves garlic, sliced",
        "2 sprigs fresh parsley",
        "5 whole cloves",
        "1 teaspoon ground black pepper",
        "1 tablespoon dried basil",
        "2 teaspoons dried thyme",
        "1/2 teaspoon ground cayenne pepper",
        "1/2 tablespoon ground white pepper",
        "1/2 teaspoon ground black pepper",
        "1 1/2 teaspoons paprika",
        "1/2 teaspoon dried thyme",
        "1/2 teaspoon dried oregano",
        "16 ounces crabmeat",
        "1 bay leaf, crushed",
        "1 teaspoon salt",
        "3/4 cup corn oil",
        "2 cups diced onion",
        "2 cups diced celery",
        "2 cups chopped green bell pepper",
        "1 teaspoon minced garlic",
        "3 tablespoons ",
        "2 teaspoons hot pepper sauce",
        "1 1/2 cups tomato sauce",
        "1 pint shucked oysters"
    ],
    "nut": [
        "Calories > 418 kcal",
        "Carbs > 24 g",
        "Cholesterol > 142 mg",
        "Fat > 23.6 g",
        "Protein > 28.8 g",
        "Sodium > 951 mg"
    ],
    "n": "Seafood File Gumbo",
    "a": "Christine L.",
    "r": "0",
    "s": 8,
    "des": "\"This is a big recipe and a big time-consumer, but delicious! Serve gumbo over 1/3 cup cooked rice per serving in bowls.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nShell and devein the shrimp, reserve the shells. Place the shrimp in a covered bowl and refrigerate. Place the shells on a cookie sheet, and bake until the shells are dried and starting to brown on the edges. Turn off the oven.\nMake the stock: In a 8 quart pot, put 5 quarts of water, 4 carrots, 4 onions, and celery.  Add 2 bay leaves, sliced garlic, parsley, cloves, 1 teaspoons black pepper, 1 tablespoon dried basil and 2 teaspoons dried thyme. Add the shrimp shells.  Bring the stock slowly to boil.  Reduce heat to a gentle simmer and cook 5 to 7 hours, replacing water as needed, 2 or 3 times, by pouring more water down side of pot.\nRemove stock from heat and strain.  Press all liquid from the shells and vegetables, then discard them. Return liquid to heat and reduce stock to 2 to 3 quarts, or to your desired quantity (you will need 7 cups of this stock for this recipe).  If clarity is desired, strain the stock through a cloth.\nIn a small bowl, combine the ground red, white, and black peppers, paprika, thyme, oregano, bay leaf and salt and set aside.\nIn a heavy pot, 5-quart or larger, heat oil over medium heat, warming the pot first.  Add onions, celery and green pepper.  Turn heat to high.  Stirring frequently, add garlic, file, hot pepper sauce, and the pepper-herb mixture.  Cook for 5 minutes, stirring constantly.  Add tomato sauce and stir as it reduces over high heat.  Add 7 cups of the stock and bring to a boil.  Reduce heat and simmer for 1 hour, stirring occasionally.\nWhen ready to serve, add shrimp, oysters, and crabmeat.  Cover and wait 5 minutes.  Turn off heat and let stand for 10 minutes.",
    "pt": "25 m",
    "ct": "8 h ",
    "tt": "9 h ",
    "i": "2609500.jpg",
    "o": "",
    "st": "allrecipes"
}