{
    "id": 169932,
    "old_rating": "4.3125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "1/2 cup minced onion",
        "3 tablespoons minced garlic",
        "6 cups chicken stock",
        "1 (6 ounce) can tomato paste",
        "2 cups heavy cream",
        "2 tablespoons lemon juice",
        "3 cups pecan pieces",
        "3 tablespoons finely chopped canned chipotle chile in adobo sauce",
        "salt to taste",
        "1/4 cup chopped pecans for garnish"
    ],
    "nut": [
        "Calories > 603 kcal",
        "Carbs > 15.8 g",
        "Cholesterol > 90 mg",
        "Fat > 60.4 g",
        "Protein > 7.4 g",
        "Sodium > 750 mg"
    ],
    "n": "Spicy Pecan Soup",
    "a": "ArtistColumbus",
    "r": "0",
    "s": 8,
    "des": "\"This creamy and rich soup is made with pecans and chipotle in adobo sauce. This is a treasured family favorite!\"",
    "ins": "Melt the butter in a large saucepan over medium heat.  Cook and stir the onion and garlic in the butter until soft but not brown. about 5 minutes.\nPour the chicken stock into the pot and whisk in the tomato paste, heavy cream, and lemon juice.  Turn the heat to high and bring the soup to a boil.  Turn the heat down to medium-low, add the 3 cups of pecan pieces and the chopped chipotle peppers, and simmer the soup until the pecans soften, about 30 minutes.\nSet aside 2 cups of soup.  Pour the rest of the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the contents moving before leaving it on to puree.  Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot.\nStir the reserved 2 cups of soup back into the pot and bring to a simmer and season with salt to taste.  Serve, hot, with a sprinkle of chopped pecans for garnish.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "456063.jpg",
    "o": "",
    "st": "allrecipes"
}