{
    "id": 170124,
    "old_rating": "4.61765",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 pound pork sausage",
        "3/4 pound sliced fresh mushrooms",
        "1/4 cup butter",
        "2 frozen pie crusts, thawed and ready to bake",
        "1 cup heavy cream",
        "2 eggs, beaten",
        "1 tablespoon all-purpose flour",
        "1 tablespoon melted butter",
        "1 tablespoon lemon juice",
        "salt and pepper to taste",
        "1/2 cup shredded Parmesan cheese"
    ],
    "nut": [
        "Calories > 226 kcal",
        "Carbs > 9.6 g",
        "Cholesterol > 63 mg",
        "Fat > 18.7 g",
        "Protein > 5.4 g",
        "Sodium > 312 mg"
    ],
    "n": "Sausage Mushroom Quiche",
    "a": "Lori Fandrich Greer",
    "r": "0",
    "s": 16,
    "des": "\"This recipe came from my mother-in-law.  I could literally eat one of these all by myself.\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C).  Bake pie shells in the preheated oven until edge of crust is golden, about 10 minutes. Set crust aside, and lower the heat to 350 degrees F (175 degrees C).\nHeat a large skillet over medium-high heat, and stir in the sausage. Cook and stir until the sausage is crumbly, evenly browned, and no longer pink. Place the sausage on a towel lined plat,e and discard any excess grease from the pan. Add the mushrooms and butter to the skillet, and cook and stir until the mushrooms are a light golden brown, about 5 minutes. Spread sausage and mushrooms evenly over the bottom of pie crusts.\nCombine the cream, eggs, flour, butter, lemon juice, salt, and pepper in a medium bowl. Pour into the pastry crust, allowing egg mixture to thoroughly cover the sausage mixture. Sprinkle top with Parmesan cheese.\nBake until light and puffy, about 35 minutes.  Allow to stand 10 minutes before slicing.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4181173.jpg",
    "o": "2346466.jpg,863739.jpg,779400.jpg,768243.jpg,376846.jpg,376845.jpg",
    "st": "allrecipes"
}