{
    "id": 17042,
    "old_rating": "4.06667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (3 pound) whole chicken, cut into pieces",
        "2 teaspoons minced fresh ginger root",
        "2 teaspoons minced garlic",
        "1 bunch fresh cilantro",
        "1 teaspoon ground cumin",
        "1 jalapeno chile pepper, stem and seeds removed",
        "2 tablespoons lemon juice",
        "1/4 cup ground unsalted cashews",
        "1 cup heavy whipping cream",
        "salt to taste"
    ],
    "nut": [
        "Calories > 997 kcal",
        "Carbs > 6.6 g",
        "Cholesterol > 337 mg",
        "Fat > 77.5 g",
        "Protein > 66.4 g",
        "Sodium > 270 mg"
    ],
    "n": "Cilantro Chutney Chicken",
    "a": "YAKUTA",
    "r": "0",
    "s": 4,
    "des": "\"This chicken has an Indian flair to it, but it is mild and will be loved by anyone who loves the flavor of cilantro. It requires some work so it is only for people who are adventurous and looking for something new. Adjust the amount of cilantro--adding up to an extra bunch--to suite your tastes. Try serving with bread and rice.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nRemove and discard the skin from the chicken. Wash parts and pat dry. Combine the garlic and ginger and rub over the chicken. Place the chicken parts in a 9x13 inch baking dish, cover with foil and set aside.\nMeanwhile, place the cilantro, cumin, jalapeno chile pepper and lemon juice in a blender and puree until smooth, adding some water if necessary. Set this aside for later. In a separate small bowl, combine the cashews with the cream. Mix well and pour over the chicken.\nBake chicken at 350 degrees F (175 degrees C) for 30 minutes, or until chicken releases its juices. Then bake, uncovered for 15 more minutes, allowing the liquid in the dish to thicken slightly to a gravy.\nRemove from oven and combine the gravy in the dish with the reserved cilantro chutney. Mix this well and serve over the chicken.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "216509.jpg",
    "o": "",
    "st": "allrecipes"
}