{
    "id": 170503,
    "old_rating": "4.42308",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup uncooked quinoa",
        "1 cup water",
        "1/4 cup chopped celery",
        "1/4 cup chopped onion",
        "1/4 cup low fat mayonnaise (such as Hellman'sÂ® Light)",
        "1 teaspoon wasabi powder",
        "2 teaspoons lemon juice, or to taste",
        "salt and ground black pepper to taste",
        "1 (5 ounce) can tuna, drained"
    ],
    "nut": [
        "Calories > 293 kcal",
        "Carbs > 38.6 g",
        "Cholesterol > 19 mg",
        "Fat > 5.1 g",
        "Protein > 22.5 g",
        "Sodium > 410 mg"
    ],
    "n": "Caron's Kickin' Quinoa Salad",
    "a": "Caron",
    "r": "0",
    "s": 2,
    "des": "\"An easy way to use that tuna you have sitting around and that weird quinoa stuff you got at the health food store. This is great if you want a tuna salad sandwich but don't or can't have bread, or also if you like sushi because it has a nice wasabi kick and a texture reminiscent of sticky rice.  And, it has a good crunch and flavor with chopped celery and onion.  Quinoa (KEEN-wa) is a 'grain that's not really a grain' used by the ancient Incas. It is especially good for people with wheat or gluten allergies, and can be doctored up with anything for every meal of the day. Try serving on a salad or lettuce leaves for a complete meal and presentation.\"",
    "ins": "Stir the quinoa and water together in a microwave-safe bowl. Cover; cook in the microwave on High until the water has been absorbed and the quinoa is tender, about 9 minutes. Uncover and place into the refrigerator to cool.\nPlace the celery, onion, and mayonnaise together in a bowl. Season with wasabi, lemon juice, salt, and pepper; stir to mix. Fold in the tuna and chilled quinoa until evenly blended.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "1 h",
    "i": "664064.jpg",
    "o": "",
    "st": "allrecipes"
}