{
    "id": 17064,
    "old_rating": "4.69565",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups self-rising flour",
        "1/8 teaspoon baking soda",
        "3/4 teaspoon salt",
        "1 1/2 tablespoons white sugar",
        "2 tablespoons shortening",
        "2 tablespoons butter, softened",
        "1 1/4 cups buttermilk",
        "1 cup all-purpose flour",
        "1 1/2 tablespoons butter, melted"
    ],
    "nut": [
        "Calories > 235 kcal",
        "Carbs > 34.9 g",
        "Cholesterol > 13 mg",
        "Fat > 8 g",
        "Protein > 5.4 g",
        "Sodium > 632 mg"
    ],
    "n": "Johnny's Biscuits",
    "a": "Andrea Evans",
    "r": "0",
    "s": 9,
    "des": "\"These are the most wonderful biscuits you'll ever put in your mouth.  They are the biggest, best tasting, lightest, and fluffiest biscuits I've ever had. They're not very hard to make either.\"",
    "ins": "Preheat oven to 475 degrees F (245 degrees C). Spray a 10 1/2 inch  cast iron skillet with non stick cooking spray.\nIn a medium bowl, combine flour, baking soda, salt and sugar. Cut in the shortening and softened butter with a fork until the lumps are pea size. Gently stir in the buttermilk until all of the flour is incorporated; do not over mix. The dough should be very wet.  If not, add more buttermilk to achieve a sloppy consistency. Let stand for 2 to 3 minutes.\nPlace all-purpose flour in a bowl.  Spray an ice cream scoop or large spoon with vegetable spray and scoop out dough. Drop each biscuit one at a time into the flour. Using well-floured hands, pick up each piece and pass from hand to hand lightly to shake off excess flour and shape it into a soft round. Place the biscuits gently into cast iron skillet. They will be a tight fit. Do not mash the biscuits down!  Brush tops lightly with melted butter.\nBake at 475 degrees F (245 degrees C) for 16 to 18 minutes. Cool before serving.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "98808.jpg",
    "o": "4516730.jpg,4510568.jpg,4459818.jpg,3580192.jpg,3181285.jpg,3064823.jpg",
    "st": "allrecipes"
}