{
    "id": 170966,
    "old_rating": "4.38095",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "2 eggs",
        "1 cup white sugar",
        "3/4 cup mashed ripe banana",
        "2 tablespoons vegetable oil",
        "1 tablespoon rum",
        "1/2 cup toasted, chopped pecans"
    ],
    "nut": [
        "Calories > 92 kcal",
        "Carbs > 16.2 g",
        "Cholesterol > 10 mg",
        "Fat > 2.3 g",
        "Protein > 1.8 g",
        "Sodium > 64 mg"
    ],
    "n": "Banana Rum Biscotti",
    "a": "sueb",
    "r": "0",
    "s": 36,
    "des": "\"These cookies are crispy on the outside and softer on the inside.  They aren't too sweet. They do taste like banana.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper.\nCombine flour, baking powder, and salt in a bowl and stir to mix well.  Beat the eggs lightly in a bowl, and add the sugar, banana, oil, and rum.  Stir the banana mixture into the flour mixture, blend well, and drop in the pecans, mixing them thoroughly into the dough. Form the dough into 4 logs about 1/2 inch thick, place them onto  parchment paper-lined baking sheets, and bake for 25 minutes, until the cookie logs begin to brown.\nLower the oven temperature to 250 degrees F (120 degrees C). Remove the baking sheets from the oven and let the cookie logs cool for 10 minutes.  Remove the logs from the parchment paper and cut each log into 1/2 inch thick slices.  Place the biscotti back onto the cookie sheets and bake for 15 minutes per side (30 minutes total) until cookies begin to brown.  Remove to racks to cool.  The biscotti will be soft at first, and will harden as they cool.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "3 h ",
    "i": "4053227.jpg",
    "o": "3535351.jpg,382680.jpg,382609.jpg,382593.jpg,361137.jpg,179399.jpg",
    "st": "allrecipes"
}