{
    "id": 17121,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds salmon fillets",
        "1 1/2 pounds red snapper fillets",
        "1 pound black cod fillets",
        "1 pound ling cod fillets",
        "2 1/2 large onions",
        "4 carrots",
        "5 eggs",
        "1 1/2 tablespoons white sugar",
        "4 teaspoons salt",
        "4 teaspoons ground white pepper",
        "3/4 cup matzo meal",
        "3/4 cup ice water",
        "2 onions",
        "2 carrots",
        "1/2 teaspoon paprika",
        "1/2 teaspoon ground black pepper",
        "1/4 cup white sugar"
    ],
    "nut": [
        "Calories > 513 kcal",
        "Carbs > 32.4 g",
        "Cholesterol > 248 mg",
        "Fat > 14.2 g",
        "Protein > 62.1 g",
        "Sodium > 1446 mg"
    ],
    "n": "Gefilte Fish",
    "a": "Eileen Mintz",
    "r": "0",
    "s": 8,
    "des": "\"My mother-in-law took great pains to prepare Gefilte Fish for Passover and Rosh Hashanah. The best legacy she left was to teach her sons how to do it and in turn they would teach their wives and then the next generation. This has been passed down and today it is still appreciated as the Mintz Family Gefilte Fish.\"",
    "ins": "Grind the fish, 2 1/2 onions and 4 carrots together. Place fish mixture in a wooden bowl. Using a hand chopper, add eggs one at a time.  Add 1 1/2 tablespoons sugar, 4 teaspoons salt and white pepper and continue to chop until very well blended. Stir in the ice water a little at a time throughout this process.  Add matzo meal and chop again. Check to see if mixture is thick enough to bind together to make an oval gefilte fish ball and if not add in more matzo meal.\nMeanwhile, fill two large heavy stock pots half full of water . Into each pot slice one raw onion and one sliced carrot. Add fish skins, if desired. Sprinkle in paprika, salt, black pepper and two tablespoons of sugar. Bring to a boil over medium heat and let boil for 10 minutes.\nWith wet hands shape the fish balls and carefully drop into boiling stock. Cover slightly and cook over medium-low heat for 2 hours. When done, let fish sit in the pot for 10 minutes, then remove pieces carefully to containers and strain remaining stock over fish balls, just barely covering them. Chill and serve.  They will now keep in the refrigerator for up to 6 days.",
    "pt": "25 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "658227.jpg",
    "o": "",
    "st": "allrecipes"
}