{
    "id": 17145,
    "old_rating": "4.32353",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 cup warm water",
        "1 (.25 ounce) package active dry yeast",
        "3/4 cup warm milk",
        "2 tablespoons honey",
        "2 tablespoons vegetable oil",
        "1 teaspoon salt",
        "2 1/2 cups all-purpose flour",
        "2 cups whole wheat flour"
    ],
    "nut": [
        "Calories > 162 kcal",
        "Carbs > 30.6 g",
        "Cholesterol > < 1 mg",
        "Fat > 2.6 g",
        "Protein > 4.9 g",
        "Sodium > 162 mg"
    ],
    "n": "Honey Wheat Bread III",
    "a": "MARBALET",
    "r": "0",
    "s": 15,
    "des": "\"A delightfully wholesome wheat bread sweetened with honey. This treasured recipe is tried and true.\"",
    "ins": "Place the warm water in large bowl. Sprinkle in yeast, stir until dissolved and let stand until creamy. Add the warm milk, honey, oil, salt, and 1 1/2 cups all-purpose flour; blend well. Stir in whole wheat flour and mix well. Add the remaining all-purpose flour, 1/2 cup at a time, until the dough is soft and workable (there may be some flour left over).\nTurn the dough out onto a lightly floured surface and knead until smooth and elastic, about 6 to 8 minutes. Place in a lightly oiled bowl and turn the dough to grease the top. Cover the bowl with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nLightly grease a 9x5 inch loaf pan. Punch the dough down and turn onto a lightly floured surface. Form dough into a loaf and place into the prepared pan. Cover and let rise in a warm place until doubled in size, about 45 minutes. Preheat oven to 375 degrees F (190 degrees C).\nPreheat oven to 375 degrees F (190 degrees C).\nBake in the preheated oven for 35 minutes or until top is golden brown and the bottom of the loaf sounds hollow when tapped. Remove loaf from the pan and cool on a wire rack.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "2 h ",
    "i": "3637082.jpg",
    "o": "2950553.jpg,1558704.jpg,1119171.jpg,1078142.jpg,802255.jpg,615938.jpg",
    "st": "allrecipes"
}