{
    "id": 171461,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Marinade:",
        "3 chipotle peppers in adobo sauce",
        "2 garlic cloves",
        "1/4 teaspoon cayenne pepper",
        "1/4 teaspoon paprika",
        "1/8 teaspoon ground black pepper",
        "1/8 teaspoon ground cumin",
        "2 tablespoons lime juice",
        "2 tablespoons Worcestershire sauce",
        "2 tablespoons honey",
        "1/4 cup balsamic vinegar",
        "1/4 cup olive oil",
        "kosher salt to taste",
        "4 skinless chicken drumsticks"
    ],
    "nut": [
        "Calories > 268 kcal",
        "Carbs > 14.7 g",
        "Cholesterol > 38 mg",
        "Fat > 18.4 g",
        "Protein > 11.5 g",
        "Sodium > 573 mg"
    ],
    "n": "Chipotle Marinated Grilled Chicken",
    "a": "PhillyKev",
    "r": "0",
    "s": 4,
    "des": "\"This is a great, smokey, spicy marinade for chicken or firm fish. The marinade itself is very spicy, not to be used as a sauce. But the end result has just a little kick, not overpowering.\"",
    "ins": "Place the chipotle peppers, garlic, cayenne pepper, paprika, black pepper, cumin, lime juice, Worcestershire sauce, honey, vinegar, and olive oil into a blender. Puree until no pieces of garlic remain. Pour 1/4 of the marinade into a small dish and set aside. Rub a pinch of kosher salt into each chicken drumstick and place into a resealable plastic bag. Pour in the marinade, shake, and seal. Marinade at least 2 hours in the refrigerator.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate. Remove the chicken from the marinade and shake off excess. Discard the remaining marinade.\nCook the chicken legs on the preheated grill until no longer pink at the bone and the juices run clear, about 8 minutes per side.  An instant-read thermometer inserted near the bone should read at least 165 degrees F (74 degrees C). Once the legs are completely cooked, baste well with the remaining marinade, cover the grill, and cook and additional 2 minutes per side to glaze.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "3587822.jpg",
    "o": "879448.jpg,695284.jpg,673017.jpg,663992.jpg,242169.jpg,236308.jpg",
    "st": "allrecipes"
}