{
    "id": 17152,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (.25 ounce) packages active dry yeast",
        "1/2 cup warm water",
        "1/2 teaspoon white sugar",
        "2 cups margarine, melted",
        "1 (12 fluid ounce) can evaporated milk",
        "1 cup sour cream",
        "6 egg yolks",
        "10 cups all-purpose flour",
        "6 tablespoons white sugar",
        "1 teaspoon salt",
        "1 pinch salt",
        "6 egg whites",
        "1 cup white sugar",
        "4 pounds ground walnuts",
        "1 teaspoon vanilla extract",
        "1/2 cup milk",
        "1 tablespoon confectioners' sugar for dusting"
    ],
    "nut": [
        "Calories > 307 kcal",
        "Carbs > 20.7 g",
        "Cholesterol > 19 mg",
        "Fat > 23.4 g",
        "Protein > 6.5 g",
        "Sodium > 131 mg"
    ],
    "n": "Refrigerator Nut Rolls",
    "a": "YOURGAL45",
    "r": "0",
    "s": 75,
    "des": "\"Rolled pastry with a walnut filling. These nut rolls have been a family favorite for years. They are one of the most requested items for every party we are invited to.  They freeze really well, so you don't mind making so many of them.\"",
    "ins": "In a small bowl, dissolve yeast in warm water with 1/2 teaspoon of sugar. Let sit until creamy; about 10 minutes.\nIn a large bowl, mix together melted margarine, evaporated milk, sour cream and yeast mixture. Stir in the egg yolks. Combine the flour, salt and 6 tablespoons sugar; stir into the wet mixture, then knead until the dough no longer sticks to your hands. Cover dough and refrigerate overnight.\nTo make the filling, beat egg whites until soft peaks form. Mix in sugar, ground walnuts and vanilla. Stir in milk 1 tablespoon at a time until filling reaches a spreadable consistency.\nPreheat oven to 350 degrees F (175 degrees C).\nCut dough into baseball sized portions. Dust a clean dry surface with confectioners' sugar. Roll the dough out to 1/4 to 1/8 inch in thickness. Spread with filling, then cut into 16 wedges like a pizza. Roll up wedges from the outside into the point. Brush with remaining milk and place 1 inch apart on a cookie sheet.\nBake for 18 to 21 minutes in the preheated oven, until golden brown.",
    "pt": "20 m",
    "ct": "21 m",
    "tt": "1 d ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}