{
    "id": 171939,
    "old_rating": "3.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon ground cinnamon",
        "1 tablespoon cracked black pepper",
        "1 tablespoon garlic powder",
        "1 tablespoon chili powder",
        "1 teaspoon cayenne pepper, or to taste",
        "1/4 cup dark brown sugar",
        "4 (8 ounce) flat iron steaks",
        "2 tablespoons olive oil",
        "4 cloves garlic, minced",
        "1/4 cup red onion, minced",
        "1 cup Cabernet Sauvignon (or other dry red wine)",
        "1 cup crumbled Gorgonzola cheese",
        "2 tablespoons chopped fresh basil"
    ],
    "nut": [
        "Calories > 769 kcal",
        "Carbs > 22.3 g",
        "Cholesterol > 200 mg",
        "Fat > 45.4 g",
        "Protein > 56.9 g",
        "Sodium > 594 mg"
    ],
    "n": "Grilled Gorgonzola Flat Irons",
    "a": "Tiffany Andersen",
    "r": "0",
    "s": 4,
    "des": "\"My friends thought these steaks were heaven sent.  The gorgonzola cheese, when melted on top, gives such an interesting contrast to the cinnamon and brown sugar rub.  Very nice, however, not too calorie friendly!\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C). Preheat an outdoor grill for medium-high heat, and lightly oil the grate.\nCombine the cinnamon, black pepper, garlic powder, chili powder, cayenne pepper, and brown sugar in a small bowl. Sprinkle over the flat iron steaks on all sides, and press into the meat; set aside.\nHeat the olive oil in a skillet over medium heat. Stir in the garlic and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Pour in the red wine, and boil until the wine has nearly evaporated, about 5 minutes more. Remove the onions from the skillet and set aside.\nCook the flat iron steaks on the preheated grill for 4 minutes per side, then remove and place into the skillet. Top the steaks with the onion mixture, and sprinkle with Gorgonzola cheese.\nBake in the preheated oven until the cheese has melted and the steaks have cooked to your desired degree of doneness, about 5 minutes for medium. Sprinkle with chopped basil to serve.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "535610.jpg",
    "o": "",
    "st": "allrecipes"
}