{
    "id": 17203,
    "old_rating": "4.83051",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (.25 ounce) package active dry yeast",
        "1 teaspoon white sugar",
        "3/4 cup warm water (110 degrees F/45 degrees C)",
        "1 1/2 cups buttermilk",
        "2 tablespoons margarine, melted",
        "3 tablespoons honey",
        "2 teaspoons salt",
        "2 tablespoons sesame seeds",
        "2 tablespoons flax seeds",
        "2 tablespoons poppy seeds",
        "2 tablespoons sunflower seeds",
        "2 cups whole wheat flour",
        "4 cups bread flour"
    ],
    "nut": [
        "Calories > 189 kcal",
        "Carbs > 33.3 g",
        "Cholesterol > < 1 mg",
        "Fat > 3.7 g",
        "Protein > 6.4 g",
        "Sodium > 267 mg"
    ],
    "n": "Buttermilk Seed Bread",
    "a": "Kathleen Lloyd",
    "r": "0",
    "s": 20,
    "des": "\"A soft and chewy bread that's both tangy and wholesome. Four different seeds and whole wheat flour give this bread a hearty texture.\"",
    "ins": "In a small bowl, dissolve the yeast and sugar in the warm water. Let stand until creamy, about 10 minutes.\nCombine buttermilk, butter or margarine, honey and the yeast mixture in a large bowl. Add the salt, all of the seeds and the whole wheat flour. Stir to combine. Add the bread flour, 1/2 cup at a time, mixing well with a wooden spoon after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 6 minutes.\nLightly oil a large mixing bowl, place the dough in the bowl and turn to coat with the oil. Cover with a damp cloth and put in a warm place to rise until doubled in volume, about 1 hour.\nPreheat oven to 375 degrees F (190 degrees F). Grease two 9x5 inch loaf pans.\nDeflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into the prepared pans. Cover with a damp cloth and let rise until doubled in volume, about 40 minutes.\nBake at 375 degrees F (190 degrees C) for about 30 minutes or until the tops are brown and the bottom of a loaf sounds hollow when tapped.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "30340.jpg",
    "o": "2968707.jpg,2172848.jpg,2172841.jpg,2172816.jpg,1044304.jpg,703347.jpg",
    "st": "allrecipes"
}