{
    "id": 172062,
    "old_rating": "3.85714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 chicken breast quarters with wing, skinned",
        "8 cups water",
        "salt and pepper to taste",
        "3/4 cup uncooked white rice",
        "1 1/2 cups water",
        "2 cloves garlic, minced",
        "1 onion, chopped",
        "3 carrots, sliced",
        "3 stalks celery, sliced",
        "1 tablespoon chopped fresh parsley",
        "1 tablespoon chopped fresh sage",
        "1 tablespoon chopped fresh rosemary",
        "1 tablespoon chopped fresh thyme"
    ],
    "nut": [
        "Calories > 169 kcal",
        "Carbs > 18.2 g",
        "Cholesterol > 32 mg",
        "Fat > 4.9 g",
        "Protein > 12.3 g",
        "Sodium > 70 mg"
    ],
    "n": "Chicken Song Soup",
    "a": "LADYSLEW",
    "r": "0",
    "s": 8,
    "des": "\"When my children were little they would always ask me to make this soup.  We call it 'song soup' because of the line 'parsley, sage, rosemary and thyme' from the Simon and Garfunkle song 'Scarborough Fair.'  You can change it up by using noodles instead of rice, or add extra veggies instead of a starch.  I've also made this with leg quarters instead of white meat, or if you have a lot of people to feed you can double this and use a whole chicken, cut up. Serve with garlic cheese bread and a green salad.\"",
    "ins": "Place the chicken breasts and 8 cups of water into a large pot. Season with salt and pepper, and bring to a boil over high heat. Reduce heat to medium-low, cover, and simmer 1 hour until the chicken is falling off the bone. Once done, remove the chicken and set aside to cool.\nWhile the chicken is simmering, bring the rice and 1 1/2 cup water to a boil in a saucepan over high heat. Reduce heat to medium-low, and cover; simmer until the rice is tender and the liquid has been absorbed, 20 to 25 minutes. Set aside.\nOnce the chicken has been removed to cool, stir the cooked rice, garlic, onion, carrots, celery, parsley, sage, rosemary, and thyme into the broth, and return to a simmer. While the vegetables are simmering, remove and discard the skin and bones from the chicken, shred the meat, and stir in into the soup. Serve once the vegetables are tender, about 30 minutes.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "267556.jpg",
    "o": "",
    "st": "allrecipes"
}