{
    "id": 17220,
    "old_rating": "4.52288",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "1/2 cup chopped green onion",
        "1 clove garlic, minced",
        "7 cups shredded, cooked chicken meat",
        "1 tablespoon chili powder",
        "2 1/2 cups chicken broth, divided",
        "1 (16 ounce) jar picante sauce, divided",
        "1 cup uncooked long grain rice",
        "1/2 cup sliced black olives",
        "3 cups shredded Cheddar cheese, divided",
        "12 (10 inch) flour tortillas"
    ],
    "nut": [
        "Calories > 575 kcal",
        "Carbs > 52.2 g",
        "Cholesterol > 104 mg",
        "Fat > 23.2 g",
        "Protein > 37.1 g",
        "Sodium > 1211 mg"
    ],
    "n": "Picante Chicken Rice Burritos",
    "a": "IDIEHMARIE77",
    "r": "0",
    "s": 12,
    "des": "\"Flour tortillas filled with a mildly spicy, cheesy, picante chicken and rice mixture, then topped with more cheese and baked. A great dinner inspired by Mexican flavors. This is my favorite chicken recipe!\"",
    "ins": "To Make Chicken Mixture: In a large skillet over medium heat, melt butter and saute green onion and garlic until soft; stir in chicken, chili powder, 1/4 cup broth and 3/4 cup picante sauce. Heat through, then set aside.\nTo Make Rice: In a large saucepan, bring rice and remaining 2 1/4 cups broth to a boil. Reduce heat, cover pan and simmer for 20 minutes. Stir in remaining 1 1/4 cups picante sauce, cover and simmer for another 5 to 10 minutes or until rice is tender.\nMeanwhile, preheat oven to 375  degrees F (190 degrees C).\nTo Assemble Burritos: Stir chicken mixture into rice, then add olives and 2 cups of the cheese. Mix well. Spoon 1 cup of filling onto each tortilla, off center. Fold sides and ends over filling, then roll up. Arrange filled tortillas in two 9x13 inch baking dishes and sprinkle remaining cup of cheese on top.\nBake at 375 degrees F (190 degrees C) for 10 to 15 minutes, or until heated through.",
    "pt": "10 m",
    "ct": "50 m",
    "tt": "1 h",
    "i": "397010.jpg",
    "o": "2610400.jpg,2058345.jpg,565608.jpg,565606.jpg,473529.jpg,421047.jpg",
    "st": "allrecipes"
}