{
    "id": 17257,
    "old_rating": "3.28571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup warm milk (110 degrees F/45 degrees C)",
        "2 (.25 ounce) packages active dry yeast",
        "2 1/2 cups all-purpose flour",
        "6 eggs, room temperature",
        "1 1/2 cups grated Romano cheese",
        "4 tablespoons butter, softened"
    ],
    "nut": [
        "Calories > 141 kcal",
        "Carbs > 13.2 g",
        "Cholesterol > 72 mg",
        "Fat > 6.6 g",
        "Protein > 7 g",
        "Sodium > 150 mg"
    ],
    "n": "Romano Cheese Easter Bread",
    "a": "CONNIE263",
    "r": "0",
    "s": 20,
    "des": "\"A delicious bread made with Romano cheese. Italians make this bread at Easter time, but it's good anytime! It can be baked in a tube pan or two loaf pans.\"",
    "ins": "In the bowl of a stand mixer, dissolve yeast in warm milk. Let stand until creamy, about 10 minutes. Lightly grease a large mixing bowl.\nStir flour and eggs into yeast mixture; beat on medium-low speed for about 10 minutes, scraping sides of bowl occasionally. Add cheese and softened butter; beat a few minutes more, until fully incorporated. Dough will be very sticky. Scoop dough into greased mixing bowl. Cover bowl with plastic wrap and let rise for 1 hour. Deflate dough and gently fold it over itself; cover and let rise again for 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Grease two 9x5-inch loaf pans or a tube pan.\nTransfer dough to a lightly floured surface and knead slightly. Divide the dough in half, if using loaf pans, or shape it into a log if using a tube pan. Transfer dough to prepared pan(s). Let rise for 30 minutes.\nBake in preheated oven until loaves are golden brown and sound hollow when their bottoms are tapped, about 60 minutes. Remove from pans and place on a wire rack to cool completely.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "4 h",
    "i": "2112482.jpg",
    "o": "",
    "st": "allrecipes"
}