{
    "id": 17307,
    "old_rating": "4.17647",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups ground ham",
        "1 onion, finely chopped",
        "1 (10 ounce) package chopped frozen broccoli, thawed and drained",
        "3 eggs, beaten",
        "2 teaspoons anise seed",
        "2 teaspoons dried basil",
        "3 cloves garlic, minced",
        "1 teaspoon salt",
        "2 teaspoons ground black pepper",
        "3/4 cup cornmeal",
        "1/2 cup grated Asiago cheese",
        "2 tablespoons olive oil"
    ],
    "nut": [
        "Calories > 313 kcal",
        "Carbs > 17.4 g",
        "Cholesterol > 143 mg",
        "Fat > 18.4 g",
        "Protein > 20.6 g",
        "Sodium > 577 mg"
    ],
    "n": "Plantation Ham Cakes",
    "a": "Barbara J. Morgan",
    "r": "0",
    "s": 6,
    "des": "\"A great way to use the leftover Easter ham. I call these Plantation Ham Cakes because they always makes me think of Tara and the food descriptions of succulent baked ham dripping with red eye gravy that always made my mouth water! These are wonderful with leftover yams, heated and mashed and dripping with butter; applesauce is a good accompaniment as well.\"",
    "ins": "In a large bowl combine the ground ham, onion, broccoli and beaten eggs. Mix with hands for 1 full minute, or until eggs are evenly absorbed into meat.\nSprinkle anise seed, basil, garlic, salt, pepper, cornmeal and cheese over meat mixture and mix again with hands for 1 full minute, until all ingredients are evenly distributed.\nHeat oil in a large skillet over medium heat. Scoop about 3 ounces of ham mixture into hands and form patties about 1/2 inch thick. Lay patties in skillet and cook for 3 to 5 minutes each side, or until browned. Drain on paper towels. Repeat until all of the mixture has been used, then serve hot.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "20 m",
    "i": "2464048.jpg",
    "o": "",
    "st": "allrecipes"
}