{
    "id": 173239,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 cups uncooked jasmine rice",
        "2 teaspoons unsalted butter",
        "2 teaspoons minced fresh ginger root",
        "2 (14 ounce) cans coconut milk",
        "2 cups water",
        "1/2 teaspoon salt",
        "1 tablespoon peanut oil",
        "2 cloves garlic, minced",
        "1 shallot, minced",
        "1 Thai chile pepper, seeded and minced",
        "1 teaspoon minced fresh ginger root",
        "1 teaspoon minced lemon grass",
        "1/2 pound peeled and deveined medium shrimp (30-40 per pound)",
        "1/2 red bell pepper, sliced",
        "1 tablespoon chopped fresh basil",
        "1 tablespoon fish sauce",
        "1 teaspoon soy sauce",
        "1/2 lime, juiced",
        "1 1/2 cups diced pineapple",
        "2 teaspoons white sugar, or to taste",
        "1/4 cup chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 623 kcal",
        "Carbs > 90.5 g",
        "Cholesterol > 46 mg",
        "Fat > 23.9 g",
        "Protein > 13.7 g",
        "Sodium > 386 mg"
    ],
    "n": "Thai-Style Rice Salad",
    "a": "Tastyeatsathome",
    "r": "0",
    "s": 8,
    "des": "\"This recipe occurred semi-accidentally. I was studying various Thai recipes and examining the flavors, and went home to stare at my fridge, and out came this recipe. A wonderful condiment to eat with this dish, and many other asian dishes, is Sambal Oelek, a garlic-chili paste you can find in the asian section of most groceries and asian specialty stores. It's quite spicy, and quite tasty.\"",
    "ins": "Bring the rice, butter, ginger, coconut milk, water, and salt to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, about 20 minutes. Remove from the heat, fluff with a fork, and refrigerate until cold.\nHeat the peanut oil in a large skillet over medium-high heat. Stir in the garlic, shallot, minced chile pepper, ginger, and lemon grass; cook for 1 minute until the shallot begins to go limp. Add the shrimp; cook and stir until the shrimp has turned pink, then stir in the red bell pepper slices. Continue cooking until the shrimp is no longer opaque in the center. Season with basil, fish sauce, soy sauce, and lime juice.\nStir the shrimp mixture into the chilled rice along with the pineapple and sugar. Sprinkle with cilantro to serve.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "3 h",
    "i": "880375.jpg",
    "o": "",
    "st": "allrecipes"
}