{
    "id": 173308,
    "old_rating": "2.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 cups all-purpose flour",
        "2/3 cup sugar",
        "2 (.25 ounce) envelopes Fleischmann'sÂ® RapidRise Yeast",
        "1 1/2 teaspoons salt",
        "1/2 cup water",
        "1 cup milk",
        "6 tablespoons butter OR margarine",
        "2 eggs",
        "Sugar Nut Topping:",
        "1/4 cup butter OR margarine",
        "1 cup brown sugar",
        "1 cup chopped walnuts"
    ],
    "nut": [
        "Calories > 217 kcal",
        "Carbs > 31.6 g",
        "Cholesterol > 29 mg",
        "Fat > 8.8 g",
        "Protein > 3.8 g",
        "Sodium > 193 mg"
    ],
    "n": "Quick N' Easy Coffee Cake or Muffins",
    "a": "ARGOÂ®,  KAROÂ®  and FLEISCHMANN'SÂ®",
    "r": "0",
    "s": 24,
    "des": "\"A light, not-too-sweet coffee cake dough is topped with brown sugar and walnuts and baked until golden brown.\"",
    "ins": "Combine 1 cup flour, sugar, undissolved yeast and salt in a large mixing bowl. Heat water, milk and butter until very warm (120 to 130 degrees F). Gradually add to dry ingredients; beat 2 minutes at medium speed of electric mixer, scraping bowl occasionally. Add eggs and 1/2 cup flour; beat 2 minutes at high speed, scraping bowl occasionally. Stir in remaining flour to make a stiff batter. Turn into 2 greased 8 or 9-inch square pans. Or, to make muffins, fill 24 greased muffin tins half full. Sprinkle evenly with Sugar-Nut Topping (see directions below). Cover; let rise in warm, draft-free place until doubled in size, about 1 hour.\nBake at 350 degrees F for 20 to 25 minutes or until done. Remove from pans; cool on wire racks.\nSugar-Nut Topping: Combine butter and brown sugar with a pastry blender or two knives until mixture resembles coarse crumbs. Stir in chopped walnuts.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "979661.jpg",
    "o": "",
    "st": "allrecipes"
}