{
    "id": 17386,
    "old_rating": "4.64286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "5 1/2 pounds crown roast of pork",
        "2 tablespoons butter",
        "12 ounces pork sausage",
        "1 onion, chopped",
        "4 cups dry French breadcrumbs",
        "1 (7 ounce) can steamed chestnuts, chopped",
        "1/2 cup low-sodium chicken broth",
        "1/2 cup chopped parsley",
        "2 teaspoons dried sage",
        "2 teaspoons dried thyme",
        "salt and pepper to taste",
        "2 cups low-sodium chicken broth",
        "1 1/2 cups dry vermouth",
        "3 slices bacon",
        "3 tablespoons butter, softened",
        "1 1/2 tablespoons all-purpose flour"
    ],
    "nut": [
        "Calories > 858 kcal",
        "Carbs > 50.2 g",
        "Cholesterol > 151 mg",
        "Fat > 43.3 g",
        "Protein > 52.5 g",
        "Sodium > 959 mg"
    ],
    "n": "Crown Roast of Pork with Sausage Stuffing",
    "a": "Marc Boyer",
    "r": "0",
    "s": 8,
    "des": "\"This traditional crown roast recipe is intended for an 11-rib roast (about 5-1/2 pounds). This recipe is easily doubled since the stuffing makes enough for a 22-rib roast. White wine can be substituted for dry vermouth.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Butter one 8x8x2 inch glass baking dish and set aside.\nCover roasting rack with aluminum foil and place in roasting pan. Place crown roast, bone ends up, on foil lined rack. Bake at 350 degrees F (175 degrees C) for 1 hour.\nPrepare the stuffing by melting 2 tablespoons butter in a  large skillet over medium-high heat. Add sausage and onion; cook until sausage is crumbled and fully cooked. Remove from heat. Stir in bread crumbs, chestnuts, chicken broth, parsley, sage, thyme, salt and pepper. Mix well.\nBoil 2 cups broth and vermouth in large saucepan until reduced by half.\nPlace the bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble, and set aside.\nIn the same skillet over medium high heat, melt 3 tablespoons butter. Add flour; mix and cook until golden brown. Add broth mixture and boil until slightly thickened, about 5 minutes. Add bacon; season with salt and pepper.\nRemove pork from oven and fill cavity with stuffing; cover stuffing with foil. Transfer remaining stuffing to prepared baking dish.\nPlace roast and extra stuffing in oven. Bake until thermometer inserted into center of pork registers 145 degrees F (63 degrees C), about 1 hour. Baste roast occasionally with drippings.  Transfer roast to serving platter and cover.\nCarve pork between the bones into chops. Serve with stuffing and gravy.",
    "pt": "30 m",
    "ct": "2 h ",
    "tt": "3 h",
    "i": "1869716.jpg",
    "o": "",
    "st": "allrecipes"
}