{
    "id": 173977,
    "old_rating": "4.11765",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 potatoes, peeled and cubed",
        "1 tablespoon extra-virgin olive oil",
        "1/2 cup diced red bell pepper",
        "1/2 cup diced yellow bell pepper",
        "1/4 cup all-purpose flour",
        "2 cups chicken broth",
        "ground black pepper to taste",
        "3 ounces baby spinach leaves",
        "1/2 cup grated Parmesan cheese",
        "2 tablespoons bacon bits",
        "1 tablespoon minced garlic",
        "2 tablespoons butter",
        "1/2 cup cream",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 301 kcal",
        "Carbs > 32.3 g",
        "Cholesterol > 45 mg",
        "Fat > 16.1 g",
        "Protein > 8.2 g",
        "Sodium > 231 mg"
    ],
    "n": "Spinach-Infused Mashed Potatoes",
    "a": "Aslan",
    "r": "0",
    "s": 6,
    "des": "\"This recipe brings the advantages of spinach into the world of the popular, well loved mashed potato!\"",
    "ins": "Place the potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two.\nMeanwhile, heat the olive oil in a saucepan over medium heat. Stir in the red and yellow bell pepper, and cook until the peppers begin to soften, about 3 minutes. Stir in the flour, and cook for 3 minutes more. Pour in the chicken broth, and bring to a boil over medium-high heat. Reduce heat to medium-low and simmer gently for 15 minutes. Season to taste with black pepper.\nOnce the potatoes have finished draining, return them to the pot along with the baby spinach, Parmesan cheese, bacon bits, and garlic; mash until smooth. Fold in the butter and cream until incorporated and season to taste with salt and pepper. Serve the mashed potatoes alongside the bell pepper gravy.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "964353.jpg",
    "o": "",
    "st": "allrecipes"
}