{
    "id": 173980,
    "old_rating": "3.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup raw pumpkin seeds",
        "1 tablespoon cayenne pepper",
        "3 pounds roma (plum) tomatoes, halved",
        "2 bunches green onions, cut into 1/2-inch pieces",
        "6 cloves garlic, chopped",
        "1/4 cup olive oil",
        "1 (10 ounce) package goat cheese",
        "1 (16 ounce) package gemelli pasta"
    ],
    "nut": [
        "Calories > 771 kcal",
        "Carbs > 93.5 g",
        "Cholesterol > 45 mg",
        "Fat > 33.2 g",
        "Protein > 31.1 g",
        "Sodium > 328 mg"
    ],
    "n": "Pumpkin Seed Pasta",
    "a": "Nicole Devaney",
    "r": "0",
    "s": 5,
    "des": "\"I received this recipe from my Mom years ago. It is so yummy!!! A must try.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).\nSpread pumpkin seeds in a single layer on a cookie sheet. Sprinkle the seeds with cayenne pepper.\nRoast in the preheated oven until lightly browned, 3 to 5 minutes. Watch them carefully so that they do not burn. Set aside.\nPlace the tomatoes in a single layer on a cookie sheet. Scatter the green onion and garlic over the tomatoes. Drizzle the vegetables with olive oil to coat.\nRoast in the preheated oven 45 minutes. Remove from oven and cool slightly; remove the skins from the tomatoes.\nMeanwhile, fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the gemelli, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 10 minutes. Drain well in a colander set in the sink.\nStir the goat cheese into the hot pasta until melted. Then, stir in the roasted peeled tomatoes. Place the pumpkin seeds on top of pasta to serve.",
    "pt": "10 m",
    "ct": "50 m",
    "tt": "1 h",
    "i": "2550659.jpg",
    "o": "",
    "st": "allrecipes"
}