{
    "id": 17405,
    "old_rating": "4.07547",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Cake:",
        "4 (1 ounce) squares German chocolate",
        "1/2 cup hot water",
        "2 cups white sugar",
        "1 cup shortening",
        "4 egg yolks",
        "1 cup buttermilk",
        "1 teaspoon vanilla extract",
        "2 1/2 cups all-purpose flour",
        "1 pinch salt",
        "1 teaspoon baking soda",
        "4 egg whites",
        "Coconut Pecan Frosting:",
        "1 egg yolk",
        "1 1/4 cups white sugar",
        "1 cup flaked coconut",
        "3/4 cup chopped pecans",
        "2 cups heavy whipping cream",
        "1/4 cup butter"
    ],
    "nut": [
        "Calories > 785 kcal",
        "Carbs > 86.2 g",
        "Cholesterol > 150 mg",
        "Fat > 47.7 g",
        "Protein > 7.7 g",
        "Sodium > 242 mg"
    ],
    "n": "German Chocolate Cake II",
    "a": "m-ann",
    "r": "0",
    "s": 12,
    "des": "\"I've tried many German chocolate cakes, but this is the absolute best.  It takes a little extra time, but is well worth the effort.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 4 - 9 inch round pans. Melt the chopped German chocolate in 1/2 cup hot water, and set aside.\nIn a large bowl, cream together the 2 cups sugar and shortening. Beat in 4 egg yolks until smooth. Next, stir in the buttermilk and vanilla. Sift together the flour, salt and baking soda; mix into creamed mixture. Then, stir in the melted chocolate. In another bowl, whip egg whites to stiff peaks, fold into the batter. Divide the batter evenly between the four pans, and spread evenly.\nBake for 20 to 25 minutes in the preheated oven. Cool cake in pans on wire racks. When cool, fill and ice with the coconut pecan icing.\nTo make the icing:  In a medium bowl, whip 1 egg yolk, heavy cream and 1 1/4 cup sugar until smooth. Cook in the top of a double boiler, until the mixture thickens. Remove from heat and stir in the coconut, pecans and butter. Cool before icing the cake.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "3549486.jpg",
    "o": "",
    "st": "allrecipes"
}