{
    "id": 174247,
    "old_rating": "4.37143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package reduced-fat cream cheese",
        "1/2 cup minced red onion",
        "3 cloves garlic, minced",
        "1/2 teaspoon ground black pepper",
        "4 skinless, boneless chicken breast halves",
        "8 slices prosciutto",
        "8 leaves fresh basil",
        "3 tablespoons olive oil",
        "3 tablespoons butter",
        "3 tablespoons all-purpose flour",
        "1/2 cup white wine (optional)",
        "2 cups chicken broth"
    ],
    "nut": [
        "Calories > 588 kcal",
        "Carbs > 12.2 g",
        "Cholesterol > 145 mg",
        "Fat > 40.7 g",
        "Protein > 36.3 g",
        "Sodium > 846 mg"
    ],
    "n": "Cream Cheese and Prosciutto Stuffed Chicken",
    "a": "StacyD",
    "r": "0",
    "s": 4,
    "des": "\"This cheesy stuffed chicken will impress everyone, whether it's your family on a weeknight or your guests at a dinner party. You can even prepare the chicken the day before and cook it quickly when you need to! So easy and delicious!\"",
    "ins": "Mix the cream cheese, red onion, garlic, and black pepper together in a small bowl; set aside. Place the chicken breasts between two sheets of waxed paper on a solid, level surface. Firmly pound the chicken with the smooth side of a meat mallet to a thickness of 1/4 inch.\nSpread the cream cheese mixture over the flattened chicken breasts, then place two slices of prosciutto and two leaves of basil over the cream cheese on each breast. Roll the chicken breasts over the filling, and secure with toothpicks. Cover, and refrigerate 1 hour to overnight.\nHeat the olive oil in a large skillet over medium-high heat. Add the chicken breasts; cook until browned on all sides, about 10 minutes. Remove the chicken from the pan, and set aside. Whisk the butter and flour into the skillet until the butter melts and the flour turns golden, about 1 minute. Stir in the white wine, and cook for 1 minute. Pour in the chicken broth, and return to a boil. Reduce heat to medium-low; simmer for a few more minutes. Return the chicken breasts to the skillet, and cover; cook until the chicken is no longer pink in the center, about 5 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "266655.jpg",
    "o": "",
    "st": "allrecipes"
}