{
    "id": 174272,
    "old_rating": "4.21348",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup uncooked brown rice",
        "1 cup water",
        "2 (16 ounce) cans black beans, rinsed and drained",
        "1 green bell pepper, halved and seeded",
        "1 onion, quartered",
        "1/2 cup sliced mushrooms",
        "6 cloves garlic, peeled",
        "3/4 cup shredded mozzarella cheese",
        "2 eggs",
        "1 tablespoon chili powder",
        "1 tablespoon ground cumin",
        "1 tablespoon garlic salt",
        "1 teaspoon hot sauce",
        "1/2 cup dry bread crumbs, or as needed"
    ],
    "nut": [
        "Calories > 317 kcal",
        "Carbs > 49.4 g",
        "Cholesterol > 71 mg",
        "Fat > 5.8 g",
        "Protein > 18.2 g",
        "Sodium > 1704 mg"
    ],
    "n": "Best of Everything Veggie Burgers",
    "a": "Bank of America",
    "r": "0",
    "s": 6,
    "des": "\"I have two different veggie burger recipes and found that mixing them into one created the ULTIMATE veggie bean burger. My meat-and-potatoes firefighter husband LOVES these and says he could eat them every week!\"",
    "ins": "Bring the brown rice and water to a boil in a saucepan over high heat. Reduce the heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 45 to 50 minutes.\nPreheat an outdoor grill for high heat. Lightly oil a sheet of aluminum foil. Mash black beans in a large bowl with a fork until thick and pasty; set aside.\nPlace the bell pepper, onion, mushrooms, and garlic in the bowl of a food processor, and chop finely. Stir the bell pepper mixture into the mashed black beans. Place the brown rice and mozzarella cheese in the food processor, and process until combined. Stir the mixture into the black beans.\nWhisk together the eggs, chili powder, cumin, garlic salt, and hot sauce. Stir the egg mixture into the black bean mixture. Stir in the bread crumbs, adding additional bread crumbs as needed until the mixture is sticky and holds together. Divide into 6 large patties.\nPlace patties onto the prepared foil, and grill until browned and heated through, about 8 minutes per side.",
    "pt": "25 m",
    "ct": "16 m",
    "tt": "41 m",
    "i": "689291.jpg",
    "o": "4506833.jpg,892466.jpg,461426.jpg,420901.jpg,410744.jpg,391600.jpg",
    "st": "allrecipes"
}