{
    "id": 174360,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup extra-virgin olive oil",
        "3 cloves garlic, minced",
        "1 1/2 cups Italian dry bread crumbs",
        "1/4 cup chopped fresh flat-leaf parsley",
        "1/2 cup grated Parmesan cheese",
        "1 pound venison tenderloin, cut into 1 inch cubes",
        "salt and pepper to taste",
        "5 cups arugula",
        "1 lemon, cut into quarters"
    ],
    "nut": [
        "Calories > 479 kcal",
        "Carbs > 34.4 g",
        "Cholesterol > 97 mg",
        "Fat > 22.6 g",
        "Protein > 34.5 g",
        "Sodium > 541 mg"
    ],
    "n": "Venison Tenderloin Bites",
    "a": "reneebiscoe",
    "r": "0",
    "s": 4,
    "des": "\"My husband loves venison, and I'm always trying to come up with creative things to do with it.  This is by far one of his favorite dishes.\"",
    "ins": "Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil.\nWarm the olive oil and garlic in a small saucepan over low heat for 5 minutes to infuse the flavor of the garlic into the olive oil. Place the bread crumbs into a mixing bowl, and pour the oil mixture overtop. Stir the parsley, and Parmesan cheese into the bread crumb mixture until evenly blended. Press the venison cubes into the bread crumb mixture to coat, and place onto the prepared baking sheet. Make sure the venison pieces are not touching.\nBroil in the oven until the bread crumbs are golden, and the venison has turned from red to pink in the center, or to your desired degree of doneness, about 6 minutes. Turn the cubes occasionally as they cook.\nDivide the arugula onto 4 dinner plates, and top with the broiled venison. Squeeze a quarter of a lemon over each plate to serve.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "756597.jpg",
    "o": "",
    "st": "allrecipes"
}