{
    "id": 17432,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 cups water",
        "1/2 cup whole wheat berries",
        "6 eggs",
        "1 cup white sugar",
        "1 (8 ounce) package mixed candied fruit",
        "1 1/2 pounds ricotta cheese",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon ground cinnamon",
        "1 teaspoon grated lemon zest",
        "2 teaspoons grated orange zest",
        "1 tablespoon shortening",
        "1 teaspoon salt",
        "2 pastries for 9-inch lattice-top pies",
        "2 tablespoons confectioners' sugar for dusting"
    ],
    "nut": [
        "Calories > 454 kcal",
        "Carbs > 51.7 g",
        "Cholesterol > 92 mg",
        "Fat > 23.3 g",
        "Protein > 10.6 g",
        "Sodium > 441 mg"
    ],
    "n": "Easter Grain Pie",
    "a": "PAMSTER2",
    "r": "0",
    "s": 16,
    "des": "\"This fruity ricotta and wheat pie is dense and moist and very good. A real Italian treat for Easter.\"",
    "ins": "Bring water to a boil in a large saucepan. Pour in wheat and allow to boil 40 minutes. As wheat is cooking, beat eggs in a large bowl while gradually adding 1 cup sugar to eggs. Mix in fruit, ricotta, vanilla extract, cinnamon, lemon rind, and orange rind.\nWhen wheat is ready, drain in a colander and rinse with warm water. Place 3/4 cup of cooked wheat in a small bowl, and mix in shortening and salt. Stir until shortening is melted, then stir wheat mixture into ricotta mixture along with the rest of the cooked wheat berries.\nPreheat oven to 375  degrees F (190 degrees C).\nLine two 9 inch pie pans with pastry. Cut remaining pastry into strips for tops of pies. Spoon half of filling into each pan. Cover with pastry strips to form lattice tops. Crimp edges.\nBake in preheated oven for 45 minutes, until crust is golden brown. Sprinkle each pie with 1 tablespoon sugar and allow to cool at room temperature. Chill overnight before serving. Store any leftovers in refrigerator.",
    "pt": "45 m",
    "ct": "45 m",
    "tt": "1 d ",
    "i": "2160802.jpg",
    "o": "",
    "st": "allrecipes"
}