{
    "id": 174663,
    "old_rating": "4.14286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "FOR THE SHORTCAKE",
        "1/2 cup butter",
        "1/4 cup white sugar",
        "1 1/2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon ground ginger",
        "FOR THE ICING",
        "1/4 cup confectioners' sugar",
        "1/4 cup butter",
        "1 tablespoon golden syrup",
        "1 teaspoon ground ginger"
    ],
    "nut": [
        "Calories > 286 kcal",
        "Carbs > 30.4 g",
        "Cholesterol > 46 mg",
        "Fat > 17.5 g",
        "Protein > 2.6 g",
        "Sodium > 186 mg"
    ],
    "n": "Congresbury Ginger Shortcake",
    "a": "Jay",
    "r": "0",
    "s": 8,
    "des": "\"This is an old British recipe handed down for many generations. I would like to archive it here so that it doesn't get forgotten. It's a hit in our family, and I hope this delicious shortcake makes a lot of other people happy, too!\"",
    "ins": "Preheat the oven to 400 degrees F (200 degrees C). Grease a 9-inch cake pan or springform pan.\nCream the 1/2 cup butter and 1/4 cup white sugar until smooth. Sift together the flour, baking powder, and 1 teaspoon ground ginger. Add the flour mixture to the butter and sugar and stir until combined, forming a stiff dough.\nPat the dough into the prepared pan and bake for 15 to 20 minutes or until the shortcake is firm and pale golden on top. Allow the cake to cool in the pan for ten minutes, and then remove it from the pan and let it cool on a wire rack.\nTransfer the cake to a serving plate. Combine the confectioners' sugar, 1/4 cup butter, golden syrup and 1 teaspoon ginger in a saucepan; heat over medium-low heat until the butter and sugar have melted. Pour the warm glaze over the shortcake and refrigerate the cake to set the glaze. When cool, cut the cake into 8 wedges.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "5 h",
    "i": "1243880.jpg",
    "o": "",
    "st": "allrecipes"
}