{
    "id": 174675,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups rigatoni",
        "1/2 pound bulk sweet Italian sausage",
        "1/2 pound ground lamb",
        "1 clove garlic, chopped",
        "4 1/2 cups tomato sauce",
        "1/2 pound provolone cheese, sliced",
        "2 teaspoons Italian seasoning",
        "1 pinch crushed red pepper, or to taste",
        "1/2 pound mozzarella cheese, sliced",
        "1/2 cup grated Parmigiano-Reggiano cheese"
    ],
    "nut": [
        "Calories > 457 kcal",
        "Carbs > 31.1 g",
        "Cholesterol > 72 mg",
        "Fat > 23.6 g",
        "Protein > 30.4 g",
        "Sodium > 1475 mg"
    ],
    "n": "Mom's Irish Ziti",
    "a": "Miss Sharon",
    "r": "0",
    "s": 8,
    "des": "\"Much like an Italian-American version I once came across, but this recipe uses a combination of ground lamb and Italian sweet sausage.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Prepare a 1 1/2-quart baking dish with cooking spray.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the rigatoni and return to a boil. Stirring occasionally, boil until the pasta cooked is still firm to the bite, about 13 minutes. Drain well in a colander set in the sink; pour into the prepared baking dish.\nPlace a skillet over medium heat; crumble the sausage and lamb into the hot skillet. Breaking the meat into small pieces with a wooden spoon, cook and stir the mixture until completely browned, 7 to 10 minutes. Stir in the garlic and cook another 2 to 3 minutes. Drain the fat from the skillet.\nPour about half of the tomato sauce over the pasta, then layer with the provolone slices and the meat mixture. Season with the Italian seasoning and crushed red pepper; top with the mozzarella cheese and the remaining tomato sauce. Sprinkle the Parmigiano-Reggiano cheese over the top of the dish.\nBake in the preheated oven until hot and bubbly, 25 to 35 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "2154041.jpg",
    "o": "",
    "st": "allrecipes"
}