{
    "id": 174836,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 3/4 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon ground nutmeg",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon salt",
        "1/2 cup shortening",
        "1/2 cup butter",
        "1 cup white sugar",
        "1/2 cup finely chopped almonds",
        "3 tablespoons grated orange zest",
        "2 cups sifted confectioners' sugar",
        "2/3 cup orange marmalade",
        "2 tablespoons orange juice",
        "1/2 cup sliced almonds for garnish (optional)"
    ],
    "nut": [
        "Calories > 153 kcal",
        "Carbs > 22 g",
        "Cholesterol > 7 mg",
        "Fat > 7.2 g",
        "Protein > 1.4 g",
        "Sodium > 51 mg"
    ],
    "n": "Glazed Orange Spice Cookies",
    "a": "mommyluvs2cook",
    "r": "0",
    "s": 36,
    "des": "\"These light sugary cookies are topped with a sweet orange glaze. Delicious!\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Combine the flour, baking powder, nutmeg, cloves, cinnamon, and salt.\nBeat the shortening and butter with an electric mixer until smooth. Add the sugar and beat until combined. Mix in the chopped almonds and orange zest. Gradually add the flour mixture to the butter mixture and stir until combined.\nTransfer the cookie dough to a lightly floured surface and roll it into a rectangle about 13 inches long. Cut the dough into 3 1/2-inch rectangles using a fluted pastry wheel or sharp paring knife. Place the cookies on an ungreased baking sheet.\nBake in the preheated oven until lightly browned, about 12 minutes. Allow the cookies to cool slightly on the baking sheets, and then transfer them to a wire rack to cool completely.\nCombine the sifted confectioners' sugar, the orange marmalade, and the orange juice and stir well. Spread the glaze on the cookies and garnish with sliced almonds, if desired.",
    "pt": "20 m",
    "ct": "12 m",
    "tt": "1 h",
    "i": "316437.jpg",
    "o": "",
    "st": "allrecipes"
}