{
    "id": 17602,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (9 inch) pie crust, baked",
        "1/4 cup cold water",
        "1 envelope (1 tablespoon) unflavored gelatin",
        "2 (1 ounce) squares unsweetened chocolate, grated",
        "1/2 cup boiling water",
        "4 egg yolks",
        "1/2 cup white sugar",
        "1/4 teaspoon salt",
        "1 teaspoon vanilla extract",
        "4 egg whites",
        "1/2 cup white sugar"
    ],
    "nut": [
        "Calories > 252 kcal",
        "Carbs > 35.4 g",
        "Cholesterol > 102 mg",
        "Fat > 11 g",
        "Protein > 5.5 g",
        "Sodium > 210 mg"
    ],
    "n": "Chocolate Chiffon Pie",
    "a": "CG",
    "r": "0",
    "s": 8,
    "des": "\"Here is a recipe from my late grandma. The creamy chocolate filling is light as a cloud. You can serve each slice with a dollop of whipped cream if you like. Please note: this recipe contains raw eggs. We recommend that pregnant women, young children, the elderly and the infirm do not consume raw eggs. Important: be sure to use only fresh eggs for this recipe.\"",
    "ins": "Place cold water in a small bowl and sprinkle gelatin over top. Set aside 5 minutes to soften. Place grated chocolate in a large heat-proof bowl. Pour boiling water over chocolate and stir until smooth. Stir gelatin mixture into chocolate mixture; stir until gelatin is completely dissolved.\nIn a small bowl, whisk egg yolks with 1/2 cup sugar until smooth and light. Whisk egg yolks into chocolate mixture, then stir in salt and vanilla extract. Allow mixture to cool.\nIn a large glass or metal mixing bowl, beat egg whites until foamy. Gradually add remaining 1/2 cup sugar, continuing to beat until whites form stiff peaks. Fold egg whites into cooled chocolate mixture. Spread into baked pastry shell and chill at least 2 hours, or until firm.",
    "pt": "25 m",
    "ct": "",
    "tt": "",
    "i": "1757493.jpg",
    "o": "",
    "st": "allrecipes"
}