{
    "id": 176239,
    "old_rating": "4.55556",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons brown sugar",
        "2 tablespoons honey",
        "1 tablespoon lime juice (optional)",
        "1 tablespoon lemon juice",
        "3 tablespoons maraschino cherry juice",
        "1 teaspoon garlic powder",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon cayenne pepper (optional)",
        "1/4 cup pineapple juice",
        "1/4 cup dry white wine",
        "1/4 cup hot pepper sauce (such as CrystalÂ®) (optional)",
        "3/4 cup reduced-sodium soy sauce",
        "1 (8 ounce) package fresh mushrooms, stems removed",
        "1 small red onion, cut into chunks",
        "1 red bell pepper, cut into 1 inch pieces",
        "1/2 pint cherry tomatoes",
        "4 skinless, boneless chicken breast halves - cut into 1 inch pieces",
        "16 wooden skewers, soaked in water",
        "16 fresh pineapple chunks",
        "16 maraschino cherries, stemmed"
    ],
    "nut": [
        "Calories > 191 kcal",
        "Carbs > 28.8 g",
        "Cholesterol > 34 mg",
        "Fat > 1.8 g",
        "Protein > 15.3 g",
        "Sodium > 1018 mg"
    ],
    "n": "Slayer's Sweet, Tangy, and Spicy Kabobs",
    "a": "Snacks",
    "r": "0",
    "s": 8,
    "des": "\"I acquired both my nickname and the idea for this recipe while working at an awful franchised restaurant in my college years. These are great for Summertime cookouts at tailgate partys or just for get-togethers. The sauce is fairly versatile and can be used for an array of different meats and applications (I originally used the sauce for chicken wings). For people such as myself who have acid reflux I have indicated some ingredients that can be left out in order to help curb the heartburn.\"",
    "ins": "Make the marinade by whisking the brown sugar, honey, lime juice, lemon juice, maraschino cherry juice, garlic powder, ginger, black pepper, cayenne pepper, pineapple juice, wine, hot pepper sauce, and soy sauce together in a large, non-metallic bowl. Toss the mushrooms, onion, bell pepper, tomatoes, and chicken in the marinade; cover and refrigerate at least 1 hour.\nPreheat an outdoor grill for medium heat and lightly oil the grate.\nOn each skewer, thread a piece of chicken, then three of the veggies followed by another piece of chicken then a pineapple slice and one maraschino cherry at the end. Mix and match the vegetables as you assemble the skewers. Cook on the preheated grill until the chicken is no longer pink in the center and the vegetables are tender, about 10 minutes.",
    "pt": "40 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "3687051.jpg",
    "o": "",
    "st": "allrecipes"
}