{
    "id": 17644,
    "old_rating": "4.65679",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup water",
        "4 (1 ounce) squares German sweet chocolate",
        "1 cup butter, softened",
        "2 cups white sugar",
        "4 egg yolks",
        "1 teaspoon vanilla extract",
        "1 cup buttermilk",
        "2 1/2 cups cake flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "4 egg whites",
        "1 cup white sugar",
        "1 cup evaporated milk",
        "1/2 cup butter",
        "3 egg yolks, beaten",
        "1 1/3 cups flaked coconut",
        "1 cup chopped pecans",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon shortening",
        "1 (1 ounce) square semisweet chocolate"
    ],
    "nut": [
        "Calories > 735 kcal",
        "Carbs > 88.3 g",
        "Cholesterol > 187 mg",
        "Fat > 40.6 g",
        "Protein > 9.1 g",
        "Sodium > 458 mg"
    ],
    "n": "German Chocolate Cake III",
    "a": "Dean",
    "r": "0",
    "s": 12,
    "des": "\"A spectacular German Chocolate cake made from scratch, using cake flour.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 3 - 9 inch round pans. Sift together the flour, baking soda and salt. Set aside. In a small saucepan, heat water and 4 ounces chocolate until melted. Remove from heat and allow to cool.\nIn a large bowl, cream 1 cup butter and 2 cups sugar until light and fluffy. Beat in 4 egg yolks one at a time. Blend in the melted chocolate mixture and vanilla.  Beat in the flour mixture alternately with the buttermilk, mixing just until incorporated.\nIn a large glass or metal mixing bowl, beat egg whites until stiff peaks form. Fold 1/3 of the whites into the batter, then quickly  fold in remaining whites until no streaks remain.\nPour into 3 - 9 inch pans Bake in the preheated oven for 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool for 10 minutes in the pan, then turn out onto wire rack.\nTo make the Filling:  In a saucepan combine 1 cup sugar, evaporated milk, 1/2 cup butter, and 3 egg yolks. Cook over low heat, stirring constantly until thickened. Remove from heat. Stir in coconut, pecans and vanilla. Cool until thick enough to spread.\nSpread filling between layers and on top of cake. In a small saucepan, melt shortening and 1 ounce of chocolate. Stir until smooth and drizzle down the sides of the cake.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "4541603.jpg",
    "o": "4541603.jpg,4541600.jpg,4541224.jpg,4541016.jpg,4539277.jpg,4539276.jpg",
    "st": "allrecipes"
}