{
    "id": 176636,
    "old_rating": "3.58824",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter",
        "1/2 cup white sugar",
        "2 eggs",
        "1/2 cup sour cream",
        "1 teaspoon vanilla extract",
        "1 teaspoon freshly grated lemon peel",
        "1 1/2 cups all-purpose flour",
        "1/4 cup cornstarch",
        "1/2 teaspoon salt",
        "1/2 teaspoon baking soda",
        "3 tablespoons lemon juice",
        "2 cups confectioners' sugar"
    ],
    "nut": [
        "Calories > 338 kcal",
        "Carbs > 53.2 g",
        "Cholesterol > 62 mg",
        "Fat > 12.7 g",
        "Protein > 3.5 g",
        "Sodium > 264 mg"
    ],
    "n": "Lemon Loaf Cake",
    "a": "seth martin",
    "r": "0",
    "s": 10,
    "des": "\"I made this cake purely as an experiment. Wow did it come through! I had been craving a lemon-flavored something for a while and this completely satisfied it. It's sweet, yet retains that delicious tart lemon zing and flavor. My dad loved it.\"",
    "ins": "Preheat an oven to 325 degrees F (165 degrees C).\nBeat the butter and sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the sour cream, vanilla, and lemon peel. Beat for an additional 2 minutes. Batter will look curdled. Combine flour, cornstarch, salt, and baking soda in a separate bowl. Pour the flour mixture into the egg mixture, mixing until just incorporated. Pour the batter into a prepared 8x4 inch loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 30 to 35 minutes. Cool in the pans for 5 minutes before removing to cool completely on a plate.\nTo make glaze:  Whisk together the lemon juice and powdered sugar. Pour glaze over entire cake and allow cake to cool while the glaze is soaked in.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "3581545.jpg",
    "o": "",
    "st": "allrecipes"
}