{
    "id": 17757,
    "old_rating": "4.61538",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups coarsely crushed pretzels",
        "3/4 cup margarine, melted",
        "1 tablespoon white sugar",
        "1 (8 ounce) package cream cheese, softened",
        "1 cup white sugar",
        "1 (8 ounce) container frozen whipped topping, thawed",
        "2 (3 ounce) packages strawberry flavored Jell-OÂ®",
        "2 cups boiling water",
        "2 (10 ounce) packages frozen sweetened strawberries (do not thaw)"
    ],
    "nut": [
        "Calories > 332 kcal",
        "Carbs > 43.6 g",
        "Cholesterol > 15 mg",
        "Fat > 17.3 g",
        "Protein > 3.4 g",
        "Sodium > 368 mg"
    ],
    "n": "Strawberry Pretzel Pie",
    "a": "IMJEN2",
    "r": "0",
    "s": 16,
    "des": "\"A sweet and salty pretzel crust lies beneath a smooth, tangy cream cheese layer and a topping of cool strawberry gelatin and juicy strawberries. This pie is a real sensory treat that everyone will love! Top each serving with a dollop of whipped topping if you like.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nIn a medium bowl mix together crushed pretzels, melted margarine, and 1 tablespoon sugar. Press mixture firmly into bottom of a 9x13 inch baking pan. Bake in preheated oven for 8 to 10 minutes, until lightly browned. Cool completely.\nIn a medium mixing bowl, beat together softened cream cheese and 1 cup sugar until smooth and fluffy. Fold in whipped topping and spread mixture evenly onto cooled crust.\nPlace gelatin in a medium heat-proof bowl and pour in boiling water. Stir gently until gelatin is completely dissolved. Add frozen strawberries and continue to stir until mixture begins to thicken. Chill until semi-firm but still pourable. Pour gelatin mixture over cream cheese layer. Chill at least 2 hours before serving.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "2 h ",
    "i": "4525044.jpg",
    "o": "",
    "st": "allrecipes"
}