{
    "id": 177786,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup sliced blanched almonds",
        "1/3 cup granulated sugar",
        "4 tablespoons unsalted butter, softened",
        "2 eggs",
        "1 tablespoon grated orange zest",
        "1 teaspoon vanilla extract",
        "1 (17.3 ounce) package Pepperidge FarmÂ® Puff Pastry Sheets",
        "1 teaspoon water",
        "confectioners' sugar"
    ],
    "nut": [
        "Calories > 329 kcal",
        "Carbs > 27.4 g",
        "Cholesterol > 41 mg",
        "Fat > 21.8 g",
        "Protein > 6.7 g",
        "Sodium > 215 mg"
    ],
    "n": "Almond Orange Pithiviers",
    "a": "Campbell's Kitchen",
    "r": "0",
    "s": 12,
    "des": "\"Circles of golden, flaky Pepperidge FarmÂ® Puff Pastry surround a delicious filling made with almonds, sugar, butter, orange zest and vanilla extract to make a spectacular dessert.\"",
    "ins": "Thaw the pastry sheets at room temperature for 40 minutes or until they're easy to handle.  Heat the oven to 375 degrees F.  Line a baking sheet with parchment paper.\nPlace the almonds, sugar, butter, 1 egg, orange zest and vanilla extract into a food processor.  Cover and blend until the almond mixture is a smooth paste.\nUnfold 1 pastry sheet on a lightly floured surface. Roll the pastry sheet into an 11-inch square. Cut the pastry into a 10-inch circle using a 10-inch cake pan.  Repeat with the remaining pastry sheet.\nPlace 1 pastry circle onto the baking sheet.  Spread the almond mixture on the pastry circle to within 1-inch of the edge. Beat the remaining egg and the water in a small bowl with a fork or whisk.  Brush the edge of the pastry circle with the egg mixture. Place the remaining pastry circle on top of the almond mixture.  Crimp the edges of the circles together with a fork.\nBake for 25 minutes or until the pastry is golden.  Sprinkle with the confectioners' sugar.",
    "pt": "55 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "975930.jpg",
    "o": "",
    "st": "allrecipes"
}