{
    "id": 17773,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound bacon",
        "2 1/2 pounds chopped onion",
        "1/2 pound sweet onions",
        "1/2 cup dry white wine",
        "2 tablespoons chopped fresh thyme",
        "1 tablespoon salt",
        "1 tablespoon ground black pepper",
        "8 cups beef stock",
        "1/4 cup cooking sherry",
        "4 slices toasted French bread",
        "4 slices Gruyere cheese"
    ],
    "nut": [
        "Calories > 717 kcal",
        "Carbs > 57.7 g",
        "Cholesterol > 70 mg",
        "Fat > 37.7 g",
        "Protein > 30.1 g",
        "Sodium > 2756 mg"
    ],
    "n": "Julia's Excellent French Onion Soup",
    "a": "Julia",
    "r": "0",
    "s": 4,
    "des": "\"This is the best French onion soup you'll ever taste! I've added bacon and use Gruyere cheese for a unique boost of flavor. This one's a meal in itself.\"",
    "ins": "In a large skillet over medium high heat, fry the bacon for 15 minutes, or until crisp. Transfer bacon to paper towels but leave the grease in the skillet.\nReduce heat to medium, add the onions and saute in the bacon grease for about 15 minutes, or until translucent and tender. Stir in the wine and the thyme and simmer for 5 more minutes. Add the salt and ground black pepper.\nPreheat oven to broil.\nThen pour in the beef stock, bring to a boil, reduce heat to low and simmer for about 30 minutes. Crumble the bacon, reserve 4 tablespoons and add the rest to the soup.\nPlace 1 tablespoon of sherry into each of 4 individual oven-safe bowls. Lay a slice of bread into each bowl, then ladle the soup into each bowl. Top with the cheese and sprinkle with the remaining bacon.\nPlace in the oven and broil for about 3 to 5 minutes, or until the cheese is melted and bubbly. (Note: Be careful when removing the bowls as they will be hot.)",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "477799.jpg",
    "o": "",
    "st": "allrecipes"
}