{
    "id": 178090,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound ground pork",
        "2 tablespoons soy sauce",
        "1/8 teaspoon garlic powder",
        "1/8 teaspoon ground black pepper",
        "1 bitter melon",
        "4 cups water",
        "1 teaspoon soy sauce, or to taste",
        "1 teaspoon fish sauce, or to taste",
        "1 green onions, sliced"
    ],
    "nut": [
        "Calories > 171 kcal",
        "Carbs > 3 g",
        "Cholesterol > 49 mg",
        "Fat > 10.9 g",
        "Protein > 14.8 g",
        "Sodium > 873 mg"
    ],
    "n": "Minh-ai's Bitter Melon Soup",
    "a": "AM1408",
    "r": "0",
    "s": 3,
    "des": "\"A Vietnamese-style pork and bitter melon recipe my friend Minh-ai N. taught me to make. It's a homey dish popular in Vietnamese and Chinese cuisine. Its unusual bitter flavor is on par with strong, unsweetened tea. Serve immediately or refrigerate soup for 24 hours. The soup's bitter flavor will mellow with a day's refrigeration. Serve hot, ladled over bowls of steamed white rice.\n\"",
    "ins": "Combine pork, 2 tablespoons of soy sauce, garlic powder, and pepper in a bowl. Cover the bowl with plastic wrap and refrigerate for 30 minutes to 1 hour. Slice the bitter melon into 1 to 1 1/2 inch thick rounds. Using the tip of a small knife, remove the spongy, seeded interior. Fill each bitter melon ring with the pork mixture, making sure to that each ring is fully stuffed. Form similar sized meatballs with any remaining pork.\nBring the water to a boil in a saucepan. Drop in the stuffed bitter melon rings and any meatballs. Simmer over medium heat until the bitter melon is tender and easily cut with a spoon, 30 to 45 minutes. Remove from heat. Season with 1 teaspoon of soy sauce and fish sauce. Stir in green onions.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "643039.jpg",
    "o": "",
    "st": "allrecipes"
}