{
    "id": 178151,
    "old_rating": "4.34817",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 1/2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon salt",
        "1 cup butter, softened",
        "2 cups brown sugar",
        "6 tablespoons white sugar",
        "2 eggs",
        "4 teaspoons vanilla extract",
        "1 (12 ounce) bag chocolate chips"
    ],
    "nut": [
        "Calories > 267 kcal",
        "Carbs > 37.9 g",
        "Cholesterol > 36 mg",
        "Fat > 12.5 g",
        "Protein > 3.1 g",
        "Sodium > 235 mg"
    ],
    "n": "Felix K.'s 'Don't even try to say these aren't the best you've ever eaten, because they are' Chocolate Chip Cookies",
    "a": "Felix K.",
    "r": "0",
    "s": 24,
    "des": "\"After years of tweaking my chocolate chip recipe, it is now ready for public consumption. It has been laboratory-tested on many of my friends all of whom seem to think its pretty great, as do I. They certainly aren't healthy, but its well worth the requisite post-cookie eating cardio workout. I hope it works for you as well as it has for me! Enjoy!\"",
    "ins": "Preheat an oven to 300 degrees F (150 degrees C).\nGently mix the flour, baking powder, baking soda, and salt with a fork in a bowl. Beat the butter, brown sugar, and white sugar with an electric mixer in a large bowl until smooth. Add the eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the vanilla with the last egg.  Mix in the flour mixture until just incorporated. Fold in the chocolate chips; mixing just enough to evenly combine.\nDivide the dough into 24 3-tablespoon-sized balls. Flatten the balls to about 1/4-inch thick onto a baking sheet.\nBake in the preheated oven until the edges are golden, 15 to 17 minutes. Allow the cookies to cool on the baking sheet until the centers begin to set, about 20 minutes.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "50 m",
    "i": "251031.jpg",
    "o": "4322341.jpg,4302633.jpg,3469720.jpg,2822913.jpg,2783064.jpg,2747525.jpg",
    "st": "allrecipes"
}