{
    "id": 178526,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup water",
        "3 tablespoons vegetable oil",
        "2 tablespoons nonfat dry milk powder",
        "3 1/2 tablespoons white sugar",
        "1 teaspoon salt",
        "3 cups all-purpose flour",
        "2 teaspoons active dry yeast",
        "1/3 cup white sugar",
        "3/4 teaspoon ground cinnamon",
        "3 tablespoons butter, softened"
    ],
    "nut": [
        "Calories > 212 kcal",
        "Carbs > 34.1 g",
        "Cholesterol > 8 mg",
        "Fat > 6.6 g",
        "Protein > 4 g",
        "Sodium > 222 mg"
    ],
    "n": "Johnson Family Cinnamon Rolls",
    "a": "FSLUKE",
    "r": "0",
    "s": 12,
    "des": "\"This is my mom's recipe for cinnamon rolls. As a kid there were many functions I was invited to with the clear understanding that I would have my mom send some of these along with me.\"",
    "ins": "Place the water, oil, dry milk powder, 3 1/2 tablespoons sugar, salt, flour, and yeast into a bread machine in the order recommended by the manufacturer. Run the machine on the Dough cycle. At the end of the cycle, remove the dough and place it on a floured work surface.\nMix 1/3 cup of sugar with the cinnamon in a bowl, and set aside. Spray a 9x13 inch pan with cooking spray.\nRoll the dough out into a 10x15 inch rectangle. Spread the softened butter over the dough and sprinkle evenly with the sugar-cinnamon mixture. Roll up the dough from the long side into a tight roll. Cut the roll into 12 slices about 3/4 inch thick and place the slices into the prepared baking pan with the rolls barely touching each other. Cover with a cloth, and let rise in a warm place until doubled, 30 to 60 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nBake the rolls in the preheated oven until the tops of the rolls are golden brown, 15 to 20 minutes.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "4136920.jpg",
    "o": "",
    "st": "allrecipes"
}