{
    "id": 179263,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds sweet potatoes",
        "1/4 cup unsalted butter, melted",
        "3 eggs",
        "1 1/2 cups white sugar",
        "1 (12 fluid ounce) can evaporated milk",
        "1 cup whole milk",
        "3/4 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground cloves",
        "1 1/2 teaspoons vanilla extract",
        "10 large marshmallows"
    ],
    "nut": [
        "Calories > 435 kcal",
        "Carbs > 74.5 g",
        "Cholesterol > 102 mg",
        "Fat > 12.4 g",
        "Protein > 8.6 g",
        "Sodium > 200 mg"
    ],
    "n": "Sweet Potato Pudding",
    "a": "Mmmmmomma",
    "r": "0",
    "s": 8,
    "des": "\"This recipe is very similar to sweet potato casserole, but with shredded sweet potatoes.  My mom used to make it at both Thanksgiving and Christmas.  She passed away when I was 8, so I when I eat this it reminds me of family holidays of long ago.  I hope your family enjoys this!\"",
    "ins": "Preheat an oven to 375 degrees F (190 degrees C).  Lightly grease a 2 quart baking dish.\nPeel and grate the sweet potatoes and mix with melted butter in a large bowl. In a medium bowl, beat eggs with sugar until well mixed.  Pour over the sweet potato mixture, and stir in evaporated milk, whole milk, cinnamon, allspice, nutmeg, cloves, and vanilla extract.  Mix well to combine all ingredients, and spoon into the prepared baking dish.\nBake in the preheated oven for 60 to 70 minutes, until the sweet potatoes are tender and the top is lightly browned.  Remove dish from the oven and place marshmallows on top of the sweet potatoes.  Return to the oven and bake 5 to 10 minutes more, until the marshmallows are lightly browned.  Let stand 5 minutes before serving.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}