{
    "id": 179285,
    "old_rating": "4.63462",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon ground cinnamon",
        "3/4 cup white sugar",
        "5 large Rome Beauty apples, peeled, cored, and chopped",
        "3 cups all-purpose flour",
        "1 teaspoon salt",
        "1 tablespoon baking powder",
        "4 eggs",
        "2 cups white sugar",
        "1 cup vegetable oil",
        "1/4 cup orange juice",
        "1 tablespoon vanilla extract"
    ],
    "nut": [
        "Calories > 528 kcal",
        "Carbs > 83.1 g",
        "Cholesterol > 62 mg",
        "Fat > 20.3 g",
        "Protein > 5.6 g",
        "Sodium > 341 mg"
    ],
    "n": "Jewish Apple Cake from Bubba's Recipe Box",
    "a": "Janyce",
    "r": "0",
    "s": 12,
    "des": "\"There are very few Jewish Apple Cake recipes on Allrecipes, so after writing a review for the best one I could find and adding my own tips, I found that 111 people used them. So here is my version of the best Jewish Apple Cake out there (it was handed down to me by my grandmother). I've been making this cake for 37 years now. It is a foolproof recipe and a sure crowd-pleaser.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch tube pan.\nMix cinnamon, 3/4 cup of sugar, and apples in a bowl; set aside. Combine flour, salt, and baking powder in a bowl. Beat the eggs and 2 cups of sugar with an electric mixer until fluffy.  Pour in the flour mixture alternately with the oil. Beat in the orange juice and vanilla until smooth and thoroughly mixed. Pour half of the batter into the prepared pan. Layer half of the apples on top. Pour the remaining batter over, then finish by topping with the rest of the apples.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour and 30 minutes to 1 hour and 45 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "3 h",
    "i": "3698469.jpg",
    "o": "4099571.jpg,4089076.jpg,4050838.jpg,4041979.jpg,2562057.jpg,2375382.jpg",
    "st": "allrecipes"
}