{
    "id": 17932,
    "old_rating": "4.4898",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "7 pounds fresh pork butt roast",
        "2 tablespoons ground New Mexico chile powder",
        "4 tablespoons packed brown sugar"
    ],
    "nut": [
        "Calories > 326 kcal",
        "Carbs > 4 g",
        "Cholesterol > 99 mg",
        "Fat > 21.8 g",
        "Protein > 26.7 g",
        "Sodium > 78 mg"
    ],
    "n": "Smoked Pork Butt",
    "a": "Smokin' Ron",
    "r": "0",
    "s": 16,
    "des": "\"We love pulled BBQ pork sandwiches at our house, so we make this every few weeks. The pork just shreds apart after it's done, and the smoky flavor is incredible. It's best to brine the meat overnight to help it retain moisture during smoking, but it's not necessary. There's a basic brine recipe on this site titled 'Basic Brine for Smoking' if you want to brine the pork. I like to rub the pork before I smoke it with a very spicy dry rub that I usually make up each time, so that it's always different. Also, I use apple wood chips because we like the sweet, fruity flavor they yield. When it's done, shred it apart, heat up your favorite sauce, and slather some on a bun. Authentic pit barbecue right in your own house!\"",
    "ins": "If desired, soak the pork butt in a brine solution for at least 4 hours or overnight. There's a recipe for a brine on this site titled 'Basic Brine for Smoking Meat'.  You should do this covered and in the refrigerator.\nPreheat an outdoor smoker for 200 to 225 degrees F (95 to 110 degrees C).\nIn a small bowl, combine the brown sugar, chili powder and any additional seasonings to your taste. Apply this liberally to the meat and rub it in with your fingers. Place a roasting rack in a drip pan and lay the meat on the rack.\nSmoke at 200 to 225 degrees F (95 to 110 degrees C) for 6 to 18 hours, or until internal pork temperature reaches 145 degrees F (63 degrees C).",
    "pt": "20 m",
    "ct": "18 h",
    "tt": "1 d ",
    "i": "417773.jpg",
    "o": "4471559.jpg,2300004.jpg,1132819.jpg,848860.jpg,454507.jpg,411339.jpg",
    "st": "allrecipes"
}