{
    "id": 17940,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup sprouted wheat berries, ground",
        "3/4 cup buttermilk",
        "1 egg",
        "2 tablespoons maple syrup",
        "1/2 teaspoon salt",
        "1/3 teaspoon baking soda",
        "2 tablespoons vital wheat gluten",
        "2 1/4 cups whole wheat flour",
        "1 1/2 teaspoons active dry yeast"
    ],
    "nut": [
        "Calories > 104 kcal",
        "Carbs > 20.6 g",
        "Cholesterol > 13 mg",
        "Fat > 0.9 g",
        "Protein > 4.9 g",
        "Sodium > 124 mg"
    ],
    "n": "Essene Bread for the Bread Machine",
    "a": "MARBALET",
    "r": "0",
    "s": 15,
    "des": "\"It will take several days for the wheat berries to sprout before you can use them in this recipe. The reward for your patience is a hearty loaf packed with protein. Special care needs to be taken with this bread and the instructions need to be followed very carefully.\"",
    "ins": "Beginning several days before you hope to be eating this bread, rinse 1/2 cup raw wheat berries in cool water; drain. Soak the berries with cool water in a large bowl. Cover the bowl with a plate or cloth, and allow the berries to soak at normal room temperature overnight or for about 12 hours. The berries will soak up a considerable amount of water. Drain the berries in a colander, cover the colander with a plate to prevent the berries from drying out, and set it in a place away from light. Rinse the berries about 3 times a day, and they will soon begin to sprout. In a couple of days the sprouts will reach their optimum length of about l/4 inch. Drain the sprouts and grind them in a blender or food processor.\nPlace ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select Whole Wheat cycle and Medium Crust setting; press Start.\nIf your machine has a raisin cycle, you can put the sprouts in at the beep for more intact sprouts. If not, the bread may have a mushy consistency.",
    "pt": "1 h ",
    "ct": "3 h",
    "tt": "3 d ",
    "i": "1527729.jpg",
    "o": "",
    "st": "allrecipes"
}