{
    "id": 18000,
    "old_rating": "3.27273",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 teaspoons active dry yeast",
        "1 teaspoon white sugar",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "3 cups unbleached flour",
        "2 teaspoons salt",
        "3/4 cup milk (110 degrees F/45 degrees C)",
        "2 tablespoons vegetable oil",
        "1/4 cup cornmeal"
    ],
    "nut": [
        "Calories > 196 kcal",
        "Carbs > 33.7 g",
        "Cholesterol > 1 mg",
        "Fat > 3.9 g",
        "Protein > 6 g",
        "Sodium > 475 mg"
    ],
    "n": "Toaster Biscuits",
    "a": "Bobbi Jo",
    "r": "0",
    "s": 10,
    "des": "\"Australian Toaster Biscuits are very similar to English crumpets. They are cooked inside metal rings on the top of a griddle. If you don't have crumpet rings you can make them out of aluminum foil. There are directions below.\"",
    "ins": "In a small bowl, dissolve yeast and sugar in warm water. Let stand until creamy, about 10 minutes. To make crumpet rings, cut aluminum foil into 7x12 inch pieces. Fold in half lengthwise and then in thirds, making 6 layers. Form into a 3 1/2 inch diameter circle and tape shut on the outside.\nIn a large bowl, mix together flour and salt. Stir in the milk, oil and yeast mixture. Beat well until smooth. Cover with plastic wrap and let rise in a warm place until doubled, about 60 minutes. Lightly grease or butter the inside of the crumpet rings and dip the rings in cornmeal.\nHeat a griddle or frying pan over medium low heat. Sprinkle cornmeal on the griddle and place the rings on the griddle. Deflate the batter by stirring. Pour 1/4 cup of batter into each ring. Cook slowly for about 10 minutes or until pale brown. Carefully remove the rings and turn the biscuits over. Bake on second side about 8 minutes or until light brown. Transfer to a rack to cool.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "918439.jpg",
    "o": "",
    "st": "allrecipes"
}