{
    "id": 180170,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 3/4 sticks butter, softened",
        "2/3 cup white sugar",
        "2/3 cup all-purpose flour",
        "2/3 cup almond meal",
        "1 teaspoon baking powder",
        "2 teaspoons vanilla extract",
        "1 egg",
        "3 1/2 tablespoons white sugar",
        "7 tablespoons butter, softened",
        "2/3 cup almond paste",
        "1 teaspoon vanilla extract",
        "3 1/2 tablespoons all-purpose flour",
        "1 teaspoon baking powder"
    ],
    "nut": [
        "Calories > 542 kcal",
        "Carbs > 45 g",
        "Cholesterol > 103 mg",
        "Fat > 37.9 g",
        "Protein > 8 g",
        "Sodium > 348 mg"
    ],
    "n": "Mazarine",
    "a": "Annleih",
    "r": "0",
    "s": 8,
    "des": "\"An almond-filled, soft, and sweet pie. Serve this warm with vanilla ice cream, sprinkle with icing sugar, or cover with icing.\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C). Grease a 9-inch pie pan.\nBeat the 1 3/4 sticks butter and 2/3 cup sugar with an electric mixer in a large bowl until light and fluffy. Whisk the 2/3 cup flour, almond meal, and 1 teaspoon baking powder together in a large bowl. Add the butter mixture and 2 teaspoon vanilla to the flour mixture; mix until soft. Chill in refrigerator for 5 minutes. Press the dough into the prepared pie pan.\nBake in the preheated oven until lightly golden in color, 15 to 20 minutes. Reduce the oven temperature to 350 degrees F (180 degrees C).\nWhile the crust cooks, beat the egg and 3 1/2 tablespoons sugar in a large bowl until light and fluffy. Add the 7 tablespoons butter, almond paste, 1 teaspoon vanilla, 3 1/2 tablespoons flour, and 1 teaspoon baking powder and mix well. Pour the mixture into the baked pie crust.\nBake in the oven at 350 degrees F (180 degrees C) until the surface of the pie filling is firm, 30 to 40 minutes.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}