{
    "id": 18013,
    "old_rating": "3.57576",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (.25 ounce) package active dry yeast",
        "1 teaspoon white sugar",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "2 1/2 cups bread flour",
        "1 tablespoon vegetable oil",
        "1/2 cup bread flour",
        "1 egg white",
        "1 tablespoon water"
    ],
    "nut": [
        "Calories > 138 kcal",
        "Carbs > 25.4 g",
        "Cholesterol > 0 mg",
        "Fat > 1.7 g",
        "Protein > 4.6 g",
        "Sodium > 6 mg"
    ],
    "n": "Brotchen Rolls",
    "a": "J Ann",
    "r": "0",
    "s": 12,
    "des": "\"These versatile rolls will warm up any dinner. They're brushed with a simple egg wash before baking so they shine when they come out of the oven. These are best served warm.\"",
    "ins": "In a small bowl, dissolve the yeast and sugar in the water. Cover and let set in a warm place for 15 minutes, or until yeast is creamy.\nPlace 2 1/2 cups flour in a large mixing bowl. Stir in the yeast mixture. Pour in the oil and stir until the flour is combined and a loose dough has formed. Turn the dough out onto a lightly floured surface and knead in the remaining flour as is necessary to keep the dough from sticking. Knead until smooth and supple, about 8 minutes.  Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nDivide the dough into twelve equal pieces and form into oval rolls. Place the rolls on a lightly greased baking sheet. Cover the rolls with a damp cloth and let rise until doubled in volume, about 40 minutes. Preheat oven to 450 degrees F (230 degrees C). In a small bowl, beat together egg white with 1 teaspoon water until frothy.\nBrush the risen rolls with the egg wash and bake in preheated oven for 15 to 20 minutes, until golden brown.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "984883.jpg",
    "o": "3861424.jpg,3861423.jpg,3861422.jpg,3736393.jpg,3591891.jpg,3190658.jpg",
    "st": "allrecipes"
}