{
    "id": 180516,
    "old_rating": "4.65385",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 roast turkey carcass, cut into pieces",
        "12 cups cold water",
        "3 stalks celery, chopped",
        "2 carrots, chopped",
        "1 Spanish onion, chopped",
        "1/4 bunch Italian parsley",
        "2 bay leaves",
        "12 whole black peppercorns",
        "2 tablespoons olive oil",
        "1 red onion, chopped",
        "2 stalks celery, diced",
        "2 carrots, diced",
        "1 large parsnip, peeled and diced",
        "1/2 pound rutabagas, peeled and diced",
        "2 cloves garlic, minced",
        "2 tablespoons minced Italian parsley",
        "salt and black pepper to taste",
        "1 cup uncooked orzo pasta"
    ],
    "nut": [
        "Calories > 276 kcal",
        "Carbs > 47.1 g",
        "Cholesterol > 5 mg",
        "Fat > 7.2 g",
        "Protein > 8 g",
        "Sodium > 92 mg"
    ],
    "n": "Turkey Soup with Root Vegetables",
    "a": "kdonofrio",
    "r": "0",
    "s": 6,
    "des": "\"A recipe for Thanksgiving leftovers. Instead of the turkey carcass, you can use 3 to 4 pounds of turkey necks, backs, and wings. Serve the soup with Parmesan cheese.\"",
    "ins": "Bring the turkey carcass and water to a boil in a large pot over high heat. Skim off and discard any scum that forms. Add the chopped celery, chopped carrots, chopped Spanish onion, 1/4 bunch parsley, bay leaves, and peppercorns and return to a simmer. Reduce heat to medium-low and simmer uncovered for 3 hours. Strain the turkey broth through a mesh sieve and skim off any fat that floats to the surface.\nHeat the olive oil in a large pot over medium heat. Stir in the red onion; cook until the onion has softened and turned translucent, about 5 minutes. Add the diced celery, diced carrots, parsnip, and rutabaga; cook 5 minutes more. Stir in the garlic and chopped parsley, and cook for 1 minute more. Pour in the turkey broth, season to taste with salt and pepper, and bring to a simmer over high heat.\nReduce heat to medium-low and simmer until the vegetables are nearly tender, 15 to 20 minutes. Stir in the orzo and cook until just tender, about 7 minutes. Cover and remove the pot from the heat. Let stand until the orzo is tender, about 5 minutes.",
    "pt": "40 m",
    "ct": "3 h ",
    "tt": "4 h ",
    "i": "692795.jpg",
    "o": "",
    "st": "allrecipes"
}