{
    "id": 18068,
    "old_rating": "4.70936",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups cubed winter squash",
        "1 cup scalded milk",
        "2 (.25 ounce) packages active dry yeast",
        "1/2 cup warm water (110 degrees F/45 degrees C)",
        "6 cups all-purpose flour",
        "1/2 cup white sugar",
        "2 teaspoons salt",
        "1/2 cup shortening"
    ],
    "nut": [
        "Calories > 363 kcal",
        "Carbs > 61.2 g",
        "Cholesterol > 2 mg",
        "Fat > 9.6 g",
        "Protein > 7.9 g",
        "Sodium > 399 mg"
    ],
    "n": "Winter Squash Rolls",
    "a": "TRACEY_MITCHELL",
    "r": "0",
    "s": 12,
    "des": "\"This recipe is always a real hit! Every time I make these I get asked for the recipe. People can't believe it when I tell them that they're made from winter squash. These delicious rolls taste best fresh out of the oven.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). In a small saucepan, cover squash cubes with water. Bring to a boil and cook until tender, about 15 minutes. Drain, cool and mash.\nIn a small bowl, dissolve yeast in warm water. In a large bowl, combine 5 cups flour, sugar and salt. Stir in the yeast mixture, shortening, squash and milk. Mix well. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nDivide the dough into twelve equal pieces and form into rounds. Place the rounds in a lightly greased 13x9 inch baking pan. Cover with a damp cloth and let rise until doubled in volume, about 30 minutes.\nBake at 400 degrees F (200 degrees C) for 10 to 15 minutes or until golden brown.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "2 h ",
    "i": "784483.jpg",
    "o": "4063548.jpg,3962873.jpg,3498147.jpg,2889464.jpg,2884820.jpg,2593045.jpg",
    "st": "allrecipes"
}