{
    "id": 180682,
    "old_rating": "4.23077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups whole wheat pastry flour",
        "1/2 cup multigrain hot cereal (uncooked)",
        "1 1/2 teaspoons baking powder",
        "2 eggs",
        "1 cup milk",
        "3/4 cup pureed pumpkin",
        "3/4 cup plain yogurt",
        "2 teaspoons vanilla extract",
        "1/3 cup white sugar",
        "1/2 teaspoon salt",
        "3/4 cup finely chopped pecans"
    ],
    "nut": [
        "Calories > 321 kcal",
        "Carbs > 42.5 g",
        "Cholesterol > 67 mg",
        "Fat > 13.4 g",
        "Protein > 10.4 g",
        "Sodium > 451 mg"
    ],
    "n": "Pumpkin Pecan Pancakes",
    "a": "firegirl",
    "r": "0",
    "s": 6,
    "des": "\"These hearty pancakes are tasty and stick to your ribs. The pumpkin and pecan work well together and the vanilla extract adds a great flavor. They taste sweet and rich, but don't have much sugar or fat.\"",
    "ins": "In a bowl, combine whole wheat pastry flour, multigrain hot cereal, and baking powder.\nIn a second bowl, beat eggs and combine with milk, pumpkin, yogurt, vanilla extract, sugar and salt.  Add wet ingredients to dry, being careful not to overmix the batter.  Fold in pecans.\nHeat a lightly oiled griddle or frying pan over medium-high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Bubbles will start to form in the pancakes. Cook until the edges of the pancakes start to look dry, and a bubble popped near the edge holds its shape. Flip the pancakes over, and continue cooking until the other side is golden brown. Repeat with remaining batter, adding more oil to the griddle if necessary. Stack the pancakes on a plate and keep warm until serving. For larger batches, keep pancakes warm in a single layer on a cooling rack positioned over a baking sheet in a 300 degrees F oven (150 degrees C).",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "505654.jpg",
    "o": "",
    "st": "allrecipes"
}