{
    "id": 180626,
    "old_rating": "4.37838",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 small shallots, peeled",
        "1 cup olive oil",
        "2 teaspoons butter",
        "1 (4 pound) whole chicken, cut into pieces",
        "2 cloves garlic, finely chopped",
        "1/2 cup red wine",
        "1 cup tomato sauce",
        "2 tablespoons chopped fresh parsley",
        "salt and ground black pepper to taste",
        "1 pinch dried oregano, or to taste",
        "2 bay leaves",
        "1 1/2 cups chicken stock, or more if needed"
    ],
    "nut": [
        "Calories > 574 kcal",
        "Carbs > 6.8 g",
        "Cholesterol > 100 mg",
        "Fat > 45.3 g",
        "Protein > 31.8 g",
        "Sodium > 394 mg"
    ],
    "n": "Greek Chicken Stew (Stifado)",
    "a": "Gracey",
    "r": "0",
    "s": 8,
    "des": "\"This is traditional hearty Greek comfort food. It is typically made with hare or beef. This version uses chicken, so that you can have the heartiness and full taste without the trouble or extra calories!\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Add the shallots, and cook uncovered for 3 minutes until just tender. Drain in a colander, then immediately immerse in ice water, or rinse with cold water for several minutes until cold to stop the cooking process. Once the shallots are cold, drain well, and set aside.\nHeat the olive oil and butter in a Dutch oven or large pot over medium heat until oil is hot and butter is melted and bubbling. Add the whole, blanched shallots and chicken pieces to the skillet and cook, turning chicken pieces over until no longer pink inside and shallots have softened and turned translucent, about 15 minutes.  Stir in the chopped garlic and cook for another 3 minutes, until garlic starts to turn golden.\nPour in red wine and tomato sauce, and add the parsley, salt and pepper, oregano, and bay leaves.  Pour the chicken stock over the chicken pieces to cover, and stir to combine.\nSimmer the stew, covered, over medium-low heat for about 50 minutes, until the shallots are soft and the chicken is tender.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "173079.jpg",
    "o": "",
    "st": "allrecipes"
}