{
    "id": 180754,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 naval oranges, zested and juiced",
        "2 limes, zested and juiced",
        "5 cloves garlic",
        "1/2 cup loosely packed cilantro leaves",
        "1/2 cup extra-virgin olive oil",
        "kosher salt and pepper to taste",
        "2 (1 1/2 inches thick) boneless pork chops",
        "1 cup shredded Swiss cheese",
        "2 (3 ounce) ham steaks (1/4 inch thick)",
        "2 dill pickle slices"
    ],
    "nut": [
        "Calories > 1508 kcal",
        "Carbs > 32.9 g",
        "Cholesterol > 309 mg",
        "Fat > 100.4 g",
        "Protein > 116.1 g",
        "Sodium > 1713 mg"
    ],
    "n": "Citrus Marinated Cuban Pork Chops",
    "a": "jonnyd523",
    "r": "0",
    "s": 2,
    "des": "\"These boneless pork chops are marinated in a citrus bath and filled with ham, Swiss cheese, and pickles and grilled to perfection. This is easy recipe that will leave your guests impressed with your culinary skill.\"",
    "ins": "Place the orange juice, orange zest, lime juice, lime zest, garlic, cilantro, and olive oil in to a blender. Season to taste with kosher salt and pepper, then puree until smooth. Pour half of the vinaigrette into a resealable plastic bag. Refrigerate the remaining for use later as a sauce.\nCut each pork chop from one side through the middle horizontally to within one-half inch of the other side. Open the two sides and spread them out like an open book. Pound with a meat mallet to 1/4 inch thick, then place the pork chops into the bag with the marinade. Squeeze out any excess air, and refrigerate 4 to 6 hours.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate. Remove the pork chops from the marinade, and shake off excess. Discard the remaining marinade.\nOpen the pork chops onto your work surface. Sprinkle 1/4 cup of the Swiss cheese on the bottom half of each pork chop. Cover the cheese with the ham steaks, then fan the sliced pickles on top of the ham steaks. Sprinkle the remaining Swiss cheese over the pickles. Fold the top half of the pork chop over the filling, and secure with several toothpicks.\nCook on the preheated grill until the pork is no longer pink in the center and the filling is hot, about 5 minutes per side. An instant-read thermometer inserted into the center of the filling should read 145 degrees F (63 degrees C). Serve with the reserved citrus vinaigrette drizzled overtop.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "4 h ",
    "i": "265723.jpg",
    "o": "",
    "st": "allrecipes"
}