{
    "id": 180744,
    "old_rating": "4.39759",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/3 cup honey",
        "1 tablespoon chili powder",
        "1/3 cup lime juice",
        "2 cloves garlic, minced",
        "1 pound shredded, cooked chicken",
        "2 cups green enchilada sauce, divided",
        "6 cups shredded Monterey Jack cheese, divided",
        "10 (8 inch) flour tortillas",
        "1 cup fat free half-and-half"
    ],
    "nut": [
        "Calories > 596 kcal",
        "Carbs > 44.5 g",
        "Cholesterol > 97 mg",
        "Fat > 31.4 g",
        "Protein > 33.8 g",
        "Sodium > 826 mg"
    ],
    "n": "Honey-Lime Enchiladas",
    "a": "user",
    "r": "0",
    "s": 10,
    "des": "\"My sister recommended this recipe, with a sweet and spicy twist on traditional enchiladas.\"",
    "ins": "Whisk together the honey, chili powder, lime juice, and minced garlic in a large glass or ceramic bowl. Add the shredded cooked chicken and toss to evenly coat. Cover the bowl with plastic wrap, and marinate in the refrigerator for at least a half hour.  Remove the shredded chicken from the marinade, and shake off excess. Save the used marinade.\nPreheat an oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish, and spread 1/2 cup of enchilada sauce over the bottom.\nCombine marinated shredded chicken with 5 cups of shredded Cheddar cheese in a bowl.  Mix lightly.  Spoon about 3/4 cup of the chicken-cheese mixture down the center of each tortilla.  Roll tortillas and place seam-side down in the prepared baking dish.\nIn a bowl, whisk together remaining enchilada sauce, fat-free half-and-half, and remaining marinade.  Pour sauce over enchiladas and sprinkle top with 1 cup of shredded Cheddar cheese.\nBake in preheated oven until the cheese has melted and the top is brown, about 30 minutes",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "368799.jpg",
    "o": "",
    "st": "allrecipes"
}