{
    "id": 18080,
    "old_rating": "4.29412",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1/4 teaspoon salt",
        "3/4 cup butter, room temperature",
        "1 (8 ounce) package cream cheese, room temperature",
        "1 cup white sugar",
        "3/4 teaspoon vanilla extract",
        "2 cups flaked coconut",
        "2 drops red food coloring (optional)",
        "2 drops yellow food coloring (optional)",
        "1 cup chocolate coated peanuts"
    ],
    "nut": [
        "Calories > 146 kcal",
        "Carbs > 16.1 g",
        "Cholesterol > 17 mg",
        "Fat > 8.5 g",
        "Protein > 1.8 g",
        "Sodium > 117 mg"
    ],
    "n": "Almond Macaroon Nests",
    "a": "TYMEGJUS3",
    "r": "0",
    "s": 36,
    "des": "\"This is a tradition at Easter in our family! A delicate butter cookie, decorated with colored coconut to look like a little nest and filled with chocolate covered almonds or peanuts.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Grease cookie sheets.\nSift together the flour, baking powder and salt; set aside. In a medium bowl, cream together the butter, cream cheese, and sugar until smooth. Stir in the vanilla, then gradually beat in the dry ingredients.\nDivide the coconut into three separate containers (see Cook's Note). Color one portion red, one yellow, and leave one plain. Toss the colored coconut together with the plain.\nRoll cookie dough into walnut-sized balls, then roll the balls in the coconut mixture. Place them 2 inches apart onto the prepared cookie sheet. Press 1 candy into the center of each cookie.\nBake for 12 minutes in the preheated oven, then remove from the oven and press 2 more candies into the center of each cookie. Return to the oven to continue baking for another 4 to 5 minutes, until golden brown. Cool cookies on the baking sheet for a few minutes before removing to a wire rack to cool completely.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "1 h",
    "i": "3222143.jpg",
    "o": "",
    "st": "allrecipes"
}