{
    "id": 18095,
    "old_rating": "4.48101",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (.25 ounce) packages active dry yeast",
        "1/4 cup warm water (110 degrees F/45 degrees C)",
        "1 1/2 cups buttermilk",
        "1/2 cup vegetable oil",
        "4 1/2 cups all-purpose flour",
        "1 teaspoon salt",
        "1/2 teaspoon baking soda",
        "1/2 cup butter, melted",
        "1 1/4 cups brown sugar",
        "1 1/2 teaspoons ground cinnamon"
    ],
    "nut": [
        "Calories > 315 kcal",
        "Carbs > 42.2 g",
        "Cholesterol > 17 mg",
        "Fat > 14.1 g",
        "Protein > 5.1 g",
        "Sodium > 271 mg"
    ],
    "n": "Buttermilk Cinnamon Rolls",
    "a": "Amy",
    "r": "0",
    "s": 15,
    "des": "\"Easy, yeasted cinnamon rolls. A crowd always gathers when they come out of the oven. Favorite activity: scraping the goo off the bottom of the pan.\"",
    "ins": "In a large bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes. In a small saucepan, heat the buttermilk until warm to the touch.\nPour the buttermilk and oil into the yeast mixture; mix well. Combine the flour, salt and baking soda. Stir the flour mixture into the liquid 1 cup at a time, until a soft dough forms. Turn dough out onto a lightly floured surface and knead 20 times. Cover and let rest for 15 minutes. In a small bowl, stir together the butter, brown sugar and cinnamon.\nOn a lightly floured surface, roll dough out into a large rectangle. Spread the brown sugar and butter mixture over the dough, roll up into a log and pinch the seam to seal. Slice into 1 inch pieces and place cut side up in a lightly greased 10x15 baking pan. Cover and let rise 30 minutes or cover and refrigerate overnight. If baking immediately, preheat oven to 400 degrees F (200 degrees C).\nBake in preheated oven for 20 to 25 minutes, until golden brown. Let stand for 2 to 3 minutes before serving.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "622714.jpg",
    "o": "4504217.jpg,4503288.jpg,4176737.jpg,3734723.jpg,3495896.jpg,2651704.jpg",
    "st": "allrecipes"
}