{
    "id": 180977,
    "old_rating": "4.65385",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds bulk Italian sausage",
        "2 tablespoons olive oil",
        "6 ounces pancetta bacon, diced",
        "2 onions, chopped",
        "7 large stalks celery, chopped",
        "4 cloves garlic, minced",
        "6 cups day-old French bread, cut into 1/2 inch cubes",
        "3 cups crumbled cornbread",
        "1 1/2 tablespoons rubbed dried sage",
        "1 1/2 tablespoons poultry seasoning",
        "1 teaspoon salt",
        "1 cup toasted pine nuts",
        "4 cups chicken broth",
        "2 cups shredded mozzarella cheese",
        "1/2 cup butter",
        "2 tablespoons chopped fresh sage",
        "1 ounce shaved Parmesan cheese"
    ],
    "nut": [
        "Calories > 594 kcal",
        "Carbs > 45.3 g",
        "Cholesterol > 71 mg",
        "Fat > 34.8 g",
        "Protein > 25.9 g",
        "Sodium > 1795 mg"
    ],
    "n": "Southern Italian Thanksgiving Stuffing",
    "a": "Briana",
    "r": "0",
    "s": 12,
    "des": "\"This is the best Thanksgiving stuffing I have ever had. With a mix of Southern-style cooking and Italian flavors it brings all great tastes together. I got this recipe from my mom last year after everyone gave it amazing reviews!\"",
    "ins": "Preheat an oven to 375 degrees F (190 degrees C). Grease a deep 9x13 inch baking dish or roasting pan.\nHeat a large skillet over medium-high heat and stir in the sausage. Cook and stir until the sausage is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Place the browned sausage into a large mixing bowl.\nMeanwhile, heat the olive oil and pancetta in a large skillet over medium heat. Once the pancetta begins to brown, stir in the onions and celery, and cook until the onion softens and turns translucent, about 8 minutes. Stir in the garlic, and cook another 3 minutes until the aroma of the garlic mellows.\nScrape the onion mixture into the bowl with the crumbled sausage. Add the French bread, cornbread, dried sage, poultry seasoning, salt, and pine nuts; stir well. Pour in the chicken broth and mozzarella cheese; stir until the chicken stock has been absorbed by the bread and the stuffing is evenly mixed. Pack the stuffing into the prepared baking dish, and dot the butter overtop. Cover with aluminum foil.\nBake in the preheated oven for 45 minutes, then remove the foil, and continue baking until the top has turned golden brown, about 15 minutes more. Sprinkle with the fresh sage and shaved Parmesan cheese to serve.",
    "pt": "45 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "926082.jpg",
    "o": "",
    "st": "allrecipes"
}