{
    "id": 18114,
    "old_rating": "4.6087",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup milk",
        "1/2 cup butter, softened",
        "1/3 cup white sugar",
        "1/2 teaspoon salt",
        "1 (.25 ounce) package active dry yeast",
        "1/2 cup warm water (110 degrees F/45 degrees C)",
        "1 egg",
        "3 1/2 cups all-purpose flour",
        "1 egg, beaten"
    ],
    "nut": [
        "Calories > 241 kcal",
        "Carbs > 34.1 g",
        "Cholesterol > 52 mg",
        "Fat > 9.1 g",
        "Protein > 5.5 g",
        "Sodium > 169 mg"
    ],
    "n": "Butter Crescents",
    "a": "SAMME",
    "r": "0",
    "s": 12,
    "des": "\"Melt in your mouth crescent rolls! This recipe takes a little time but is well worth the wait.\"",
    "ins": "Warm the milk in a small saucepan until bubbles form at the edges; remove from heat. Mix in the butter, sugar, and salt. Let cool until lukewarm. In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, combine milk and yeast mixtures. Stir in 1 egg. Beat in flour 1 cup at a time until dough pulls together. Turn out onto a lightly floured surface, and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl, and turn to coat. Cover with a damp cloth, and let rise in a warm place until doubled in volume, about 1 hour.\nDeflate the dough, and turn it out onto a lightly floured surface. Divide the dough into two equal pieces, and form into rounds. Cover, and let rest 10 minutes.\nUsing a floured rolling pin, roll each dough half into a 12 inch circle. Cut each circle into 6 wedges. Roll each wedge up towards the point.  Bend ends inward to form crescents, and place point side down on lightly greased baking sheets. Cover, and let rise until doubled, about 30 minutes. Meanwhile, preheat oven to 400 degrees F (200 degrees C).\nBrush rolls with beaten egg, and bake for 12 to 15 minutes in the preheated oven, or until golden brown.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "2 h ",
    "i": "2444086.jpg",
    "o": "4109553.jpg,4090968.jpg,3639777.jpg,3018304.jpg,2955093.jpg,2898725.jpg",
    "st": "allrecipes"
}