{
    "id": 18169,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 (.25 ounce) packages active dry yeast",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "8 cups bread flour",
        "1 1/2 cups white sugar",
        "2 teaspoons salt",
        "6 egg yolks",
        "1 cup margarine, melted",
        "1 1/2 cups warm milk",
        "1 cup golden raisins",
        "2 egg whites, beaten"
    ],
    "nut": [
        "Calories > 388 kcal",
        "Carbs > 62.1 g",
        "Cholesterol > 63 mg",
        "Fat > 11.6 g",
        "Protein > 9.1 g",
        "Sodium > 356 mg"
    ],
    "n": "Hunza Bread II",
    "a": "MARBALET",
    "r": "0",
    "s": 20,
    "des": "\"Hunza bread refers to a Hungarian sweet bread filled with golden raisins. This is a simple version that's made by hand.\"",
    "ins": "In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, mix together flour, sugar and salt. Make a well in the center of the flour and pour in the yeast mixture, egg yolks, margarine and warm milk. Stir until a soft dough is formed. Turn it out onto a lightly floured surface and knead until smooth and supple, about 6 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nDeflate the dough and turn it out onto a lightly floured surface. Knead in the raisins. Divide the dough into two equal pieces and form into loaves. Place the loaves into two lightly greased 9x5 inch loaf pans. Cover the loaves with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\nBrush the risen loaves with egg whites. Bake in preheated oven for 30 to 45 minutes, until golden brown.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "2 h ",
    "i": "4233855.jpg",
    "o": "",
    "st": "allrecipes"
}