{
    "id": 181609,
    "old_rating": "4.47619",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil",
        "1/2 teaspoon ground coriander",
        "1/2 teaspoon ground turmeric",
        "1/2 teaspoon ground cumin",
        "2 teaspoons curry powder",
        "1/2 cup coconut milk, or more as needed",
        "2 red onions, chopped",
        "1 stalk lemon grass, thinly sliced",
        "1 red chile pepper, roughly chopped",
        "1 large russet potato, diced",
        "3/4 pound skinless, boneless chicken breast, cut in bite-sized pieces",
        "1 teaspoon salt",
        "1 (17.25 ounce) package frozen puff pastry, thawed"
    ],
    "nut": [
        "Calories > 424 kcal",
        "Carbs > 35.5 g",
        "Cholesterol > 22 mg",
        "Fat > 25.3 g",
        "Protein > 14.2 g",
        "Sodium > 423 mg"
    ],
    "n": "Chicken Curry Puffs",
    "a": "argus",
    "r": "0",
    "s": 9,
    "des": "\"These oven-baked beauties are great as appetizers or a snack. They're spicy and savory, with a subtle coconut milk base. In Malaysia, they are traditionally deep fried. But here's a modern version. You can wrap them in different ways - as rolls, sealed pockets or semi-open bundles.\"",
    "ins": "Heat vegetable oil in a saucepan over medium-low heat. Stir in coriander, turmeric, cumin, and curry powder. Cook a few seconds until fragrant. Pour in coconut milk, onions, lemon grass, and red pepper; cook until the vegetables are tender, about 7 minutes. Stir in potato and continue cooking for 12 minutes, adding more coconut milk if the mixture becomes too dry. Stir in the chicken, then season with salt. Cook and stir until chicken and potato has absorbed most of the liquid, then spread mixture on a plate to cool.\nPreheat an oven to 375 degrees F (190 degrees C). Line 2 baking sheets with parchment paper.\nUnfold puff pastry and cut each sheet into 9 squares. Place heaping spoonfuls of the filling in the center of each square. Gather all 4 corners of the pastry and pinch together at the top, forming a small pouch. Place each pastry on the baking sheet, about 1 inch apart.\nBake in the preheated oven until golden brown, 22 to 27 minutes. Cool on the baking sheet for 10 minutes before removing to cool on a wire rack. Serve warm or at room temperature.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "2465822.jpg",
    "o": "",
    "st": "allrecipes"
}