{
    "id": 18172,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 cup dried figs",
        "3/4 cup raisins",
        "3/4 cup dried apricots",
        "3 tablespoons chopped crystallized ginger",
        "2/3 cup dry sherry",
        "1 teaspoon orange zest",
        "1 cup chopped walnuts",
        "2 tablespoons unsalted butter, softened",
        "3/4 cup white sugar",
        "1 egg, beaten",
        "1 cup milk",
        "2 1/4 cups unbleached flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon ground allspice",
        "1 teaspoon salt"
    ],
    "nut": [
        "Calories > 331 kcal",
        "Carbs > 55.5 g",
        "Cholesterol > 22 mg",
        "Fat > 9.8 g",
        "Protein > 6.7 g",
        "Sodium > 275 mg"
    ],
    "n": "Fruited Sherry Bread",
    "a": "Jen",
    "r": "0",
    "s": 12,
    "des": "\"This is a wonderfully aromatic bread with lots of dried fruit. It's rich in fruit, not rich in fat! You can also use prunes, dates, pears or any type of dried fruit in this bread.\"",
    "ins": "Place the dried fruit into a small saucepan with the crystallized ginger, sherry, and orange rind. Bring mixture to a boil, remove pan from heat, cover and let cool for 30 minutes. Place walnuts on a baking sheet and toast until golden, about 10 minutes; set aside to cool. Preheat oven to 350 degrees F (175 degrees C). Lightly grease and flour a 9x5 inch loaf pan.\nIn a large bowl, cream the butter and sugar. Beat in the egg and then the milk. Combine the flour, baking powder, allspice and salt, stir slowly into the egg mixture. Do not over mix. Fold in the walnuts and cooled fruit mixture. Pour the batter into the prepared loaf pan.\nBake in preheated oven for 60 to 70 minutes, until a toothpick inserted into center of the loaf comes out clean. Let the loaf cool in the pan 15 minutes before removing it to a wire rack to cool. When the bread has cooled completely, wrap it in plastic. It tastes better if left to sit for a day, and it's especially good with butter or cream cheese.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "318398.jpg",
    "o": "",
    "st": "allrecipes"
}