{
    "id": 18227,
    "old_rating": "3.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound squid",
        "8 ounces shrimp, peeled and deveined",
        "8 ounces orange roughy fillets",
        "1 tomato, seeded and chopped",
        "1 small onion, quartered",
        "1/2 cup olive oil",
        "1/2 teaspoon salt",
        "1/4 teaspoon paprika",
        "3 tablespoons dry white wine",
        "1 slice white bread",
        "4 slices  lemon, for garnish"
    ],
    "nut": [
        "Calories > 492 kcal",
        "Carbs > 11.9 g",
        "Cholesterol > 346 mg",
        "Fat > 32.6 g",
        "Protein > 35.5 g",
        "Sodium > 552 mg"
    ],
    "n": "Santiago's Stuffed Squid",
    "a": "DMASON",
    "r": "0",
    "s": 4,
    "des": "\"This recipe originates from Spain. It's tender and moist, not a typical chewy squid dish. It's simple to prepare, rich, scrumptious and definitely a favorite in our home! You may use butter instead of olive oil and black pepper instead of paprika if you prefer.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Clean squid, removing tentacles, spine and outer skin. Rinse well in cold water and let drain on paper towels.\nCoarsely chop shrimp.  Flake orange roughy fillets and combine with shrimp, sprinkle with 1/4 teaspoon salt\nBlot squid with paper towel to remove any excess water. Use a small spoon to pack each squid with fish/shrimp mixture leaving 1 inch unfilled at bottom.  Secure open end  with a toothpick and place in glass baking dish. Repeat until filling is gone. Any extra squid can be cut into rings and scattered over the stuffed squid.\nPlace tomato, onion, olive oil, 1/4 teaspoon salt, paprika, wine and bread in a blender or food processor and puree. Pour mixture over stuffed squid.\nCover dish with aluminum foil and bake in preheated oven for 1 hour. Remove foil and bake for another 30 minutes. Serve warm, garnished with lemon wedges.",
    "pt": "1 h",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "720296.jpg",
    "o": "",
    "st": "allrecipes"
}