{
    "id": 182320,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (1 pound) beef marrow bone",
        "1 tablespoon tomato puree",
        "1 large onion, chopped",
        "3 cloves garlic, minced",
        "2 bay leaves",
        "2 quarts water",
        "2 potatoes, diced",
        "2 (14.5 ounce) cans diced tomatoes",
        "1 tablespoon chopped fresh parsley",
        "2 teaspoons chopped fresh oregano",
        "1 teaspoon chopped fresh rosemary",
        "1 tablespoon Worcestershire sauce",
        "1 (14 ounce) can baked beans (such as HeinzÂ®)",
        "1 cup uncooked spaghetti, broken into 1 inch pieces",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 326 kcal",
        "Carbs > 35.8 g",
        "Cholesterol > 118 mg",
        "Fat > 13.8 g",
        "Protein > 14.8 g",
        "Sodium > 403 mg"
    ],
    "n": "My Mum's Spaghetti Soup",
    "a": "Estelle Welsh",
    "r": "0",
    "s": 8,
    "des": "\"A gorgeous, Italian style heart warming soup made with tomatoes, potatoes, spaghetti and the special secret ingredient....marrow from a marrow bone. Both myself and my brother have been brought up with this delicious soup, and I have made it ever since. Marrow bones are available from your butcher very cheaply, sometimes even for free. If the bone is very large, ask your butcher to cut it in half for you, so it will fit into the pot comfortably. You can use a can of cannellini beans if you prefer. Serve this soup with a sprinkle of freshly grated Parmesan cheese.\"",
    "ins": "Place the marrow bone, tomato puree, onion, garlic, and bay leaves into a large pot. Pour in the water, and bring to a boil over high heat. Reduce the heat to medium, and simmer 45 minutes. After 45 minutes, stir in the potatoes, diced tomatoes, parsley, oregano, and rosemary. Cook, stirring occasionally until the potatoes are just tender, 15 to 20 minutes.\nStir in the Worcestershire sauce, baked beans, and spaghetti. Return to a simmer, and cook until the spaghetti is tender, 15 to 20 minutes. Season to taste with salt and pepper before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4389875.jpg",
    "o": "",
    "st": "allrecipes"
}