{
    "id": 18358,
    "old_rating": "3.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/2 cups all-purpose flour",
        "1 pinch salt",
        "3/4 cup unsalted butter",
        "4 tablespoons cold water",
        "1/4 cup butter",
        "1/2 cup brown sugar",
        "1/2 teaspoon ground cinnamon",
        "7 apples -- peeled, cored, and chopped",
        "1 egg white, beaten",
        "1 1/2 tablespoons white sugar"
    ],
    "nut": [
        "Calories > 378 kcal",
        "Carbs > 50 g",
        "Cholesterol > 49 mg",
        "Fat > 18.9 g",
        "Protein > 4.1 g",
        "Sodium > 84 mg"
    ],
    "n": "Apple Dumplings II",
    "a": "Christine",
    "r": "0",
    "s": 10,
    "des": "\"Deliciously simple apple dumplings. This recipe uses a food processor to make dough, it can also be made by hand. If using whole apples stuff them with brown sugar mixture. Place on rolled out dough and cut into equal sized squares. Wrap them by pulling corners up onto top in criss-cross pattern, then seal each corner of dough with egg white. Bake for same amount of time, or until apples are tender.\"",
    "ins": "Preheat oven to 375  degrees F (190 degrees C). Grease a 9x13 inch baking dish.\nTo Make Dough: Combine flour and salt in food processor, then add 3/4 cup of butter and process until blended. Add water 1 tablespoon at a time pulsing only until dough forms a ball. Wrap the dough in plastic wrap and chill for 30 minutes, or up to 1 day if time allows.\nTo Make Filling: In a large bowl, cream together remaining 1/4 cup butter and brown sugar. Stir in chopped apples.\nRoll out dough into a rectangle approximately 12x18 inches in size. Spread filling onto dough, then roll dough up starting at longest side. Cut into 2 inch pieces and place each dumpling into baking dish. Brush top of dough with egg white and sprinkle with sugar.\nBake in preheated oven for 30 to 40 minutes, or until dough is brown. Let set for 15 minutes.",
    "pt": "1 h ",
    "ct": "35 m",
    "tt": "2 h ",
    "i": "1067461.jpg",
    "o": "",
    "st": "allrecipes"
}