{
    "id": 18418,
    "old_rating": "3.95",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil",
        "3 tablespoons butter",
        "1 bulb fennel, diced",
        "1 small red bell pepper, diced",
        "1 onion, diced",
        "3 cloves garlic, minced",
        "2 teaspoons grated lemon zest",
        "3 tablespoons chopped fresh mint leaves",
        "3 tablespoons chopped fresh parsley",
        "2 tablespoons chopped fresh rosemary (optional)",
        "1/2 teaspoon ground coriander",
        "1 1/2 cups uncooked Arborio rice",
        "1/2 cup dry white wine",
        "3 1/2 cups hot vegetable stock",
        "1 tablespoon fresh lemon juice, or to taste",
        "1/3 cup grated Parmesan cheese",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 395 kcal",
        "Carbs > 55.6 g",
        "Cholesterol > 19 mg",
        "Fat > 14.3 g",
        "Protein > 7.2 g",
        "Sodium > 401 mg"
    ],
    "n": "Spring Risotto",
    "a": "lcpgh",
    "r": "0",
    "s": 6,
    "des": "\"This is a fabulous rice dish served either as a main or side dish. It's a wonderful way to feature fresh spring herbs. Enjoy!\"",
    "ins": "Heat oil and butter in a medium-size heavy saucepan over medium heat. Stir in fennel, red pepper, onion, and garlic. In a small bowl, mix together lemon zest, mint, parsley, and rosemary. Stir half of this herb mixture into saucepan, and set the rest aside. Saute vegetables until slightly softened, 3 to 4 minutes.\nStir in coriander and rice. Cook, stirring frequently, until rice grains are thoroughly coated with oil and butter. Stir in wine, then reduce heat to low. Stir in about 1 cup of vegetable broth. Continue to stir while ladling in more broth as needed; rice should have a thin veil of broth over it at all times. Cook for 20 to 25 minutes, until all broth is used and absorbed, and rice is tender.\nRemove pan from heat and stir in remaining herb mixture, lemon juice and Parmesan cheese. Season to taste with salt and pepper. Cover pan loosely with waxed paper and allow to stand 8 to 10 minutes before serving.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "79450.jpg",
    "o": "",
    "st": "allrecipes"
}