{
    "id": 18415,
    "old_rating": "3.86667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (12 ounce) package firm tofu",
        "2 teaspoons vegetable oil",
        "1 small onion, chopped",
        "1 celery, chopped",
        "1 egg, beaten",
        "1/4 cup shredded Cheddar cheese",
        "salt and pepper to taste",
        "1/2 cup vegetable oil for frying"
    ],
    "nut": [
        "Calories > 151 kcal",
        "Carbs > 4.1 g",
        "Cholesterol > 28 mg",
        "Fat > 11 g",
        "Protein > 11.3 g",
        "Sodium > 59 mg"
    ],
    "n": "Tofu Burgers",
    "a": "SILVERWOLF",
    "r": "0",
    "s": 6,
    "des": "\"This recipe uses tofu that has been frozen for 72 hours and then quickly defrosted. Onion, celery and cheese make these burgers delicious.  This is a family favorite at the Silverwolfs' den. Serve in place of meat as a main entree or place on a bun along with your favorite toppings: lettuce, onion, tomato, mayo, etc. These burgers can also be baked in an oven preheated at 350 degrees for 30 minutes rather than frying.\"",
    "ins": "Place tofu in freezer 72 hours ahead of time. To thaw, fill a large saucepan with water and bring to a simmer. Leave tofu in package and place in water for about 20 minutes.\nWhile tofu is thawing, heat 2 teaspoons vegetable oil in a small skillet. Saute onion and celery until soft and lightly browned. Place in a medium bowl and set aside.\nWhen tofu is thawed, squeeze out excess water. Chop tofu finely and place in bowl with onion and celery. Mix in egg, cheese, salt and pepper until thoroughly combined.\nHeat a large skillet over medium-high heat and pour in 1/2 cup vegetable oil (oil should be 1/4 inch deep). Drop tofu mixture into pan in 6 equal portions. Flatten with a spatula to form patties. Fry for 5 to 7 minutes on each side, until golden.",
    "pt": "40 m",
    "ct": "15 m",
    "tt": "3 d",
    "i": "4477249.jpg",
    "o": "",
    "st": "allrecipes"
}