{
    "id": 18417,
    "old_rating": "4.49252",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil",
        "1 large onion, chopped",
        "1 bunch green onions, chopped",
        "2 cloves garlic, minced",
        "2 pounds spinach, rinsed and chopped",
        "1/2 cup chopped fresh parsley",
        "2 eggs, lightly beaten",
        "1/2 cup ricotta cheese",
        "1 cup crumbled feta cheese",
        "8 sheets phyllo dough",
        "1/4 cup olive oil"
    ],
    "nut": [
        "Calories > 528 kcal",
        "Carbs > 32.8 g",
        "Cholesterol > 108 mg",
        "Fat > 36.7 g",
        "Protein > 21 g",
        "Sodium > 925 mg"
    ],
    "n": "Spanakopita (Greek Spinach Pie)",
    "a": "SILVERWOLF",
    "r": "0",
    "s": 5,
    "des": "\"This is an authentic, really rich pie stuffed with spinach, onions, cheeses and herbs that are all enfolded by crispy, flaky phyllo dough.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x9 inch square baking pan.\nHeat 3 tablespoons olive oil in a large skillet over medium heat. Saute onion, green onions and garlic, until soft and lightly browned. Stir in spinach and parsley, and continue to saute until spinach is limp, about 2 minutes. Remove from heat and set aside to cool.\nIn a medium bowl, mix together eggs, ricotta, and feta. Stir in spinach mixture. Lay 1 sheet of phyllo dough in prepared baking pan, and brush lightly with olive oil. Lay another sheet of phyllo dough on top, brush with olive oil, and repeat process with two more sheets of phyllo. The sheets will overlap the pan. Spread spinach and cheese mixture into pan and fold overhanging dough over filling. Brush with oil, then layer remaining 4 sheets of phyllo dough, brushing each with oil. Tuck overhanging dough into pan to seal filling.\nBake in preheated oven for 30 to 40 minutes, until golden brown. Cut into squares and serve while hot.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4476903.jpg",
    "o": "4476903.jpg,4476191.jpg,4472022.jpg,4470896.jpg,4464377.jpg,4400034.jpg",
    "st": "allrecipes"
}