{
    "id": 184255,
    "old_rating": "4.56897",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (14.5 ounce) can whole berry cranberry sauce",
        "1 cup apple jelly",
        "1 tablespoon Dijon mustard",
        "4 cubes chicken bouillon, crushed",
        "1 teaspoon prepared horseradish",
        "2 teaspoons garlic powder",
        "2 tablespoons chopped fresh thyme",
        "1 (4 pound) boneless pork loin roast",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 419 kcal",
        "Carbs > 38.8 g",
        "Cholesterol > 88 mg",
        "Fat > 15.9 g",
        "Protein > 29.6 g",
        "Sodium > 805 mg"
    ],
    "n": "Quick Savory Cranberry Glazed Pork Loin Roast",
    "a": "goodfood4ursoul",
    "r": "0",
    "s": 10,
    "des": "\"This simple, 1-hour roast is our favorite Christmas dish and voted most likely to be served if the President were to drop in for dinner- LOL! I love serving this entree because it causes me NO stress and everyone raves over it. While the pork is roasting, make another batch of the cranberry glaze to serve in a gravy boat alongside the sliced pork roast.  For food safety, the new batch should not be prepared in same pan as the first if you have been basting directly out of the saucepan. If you basted out of another dish, you can use the same pan.\"",
    "ins": "Preheat an oven to 425 degrees F (220 degrees C).\nCombine the cranberry sauce, apple jelly, mustard, crushed bouillon, horseradish, garlic powder, and thyme in a saucepan; bring to a boil.\nLine a large baking pan with foil. Place pork loin in pan, fat side up. Sprinkle evenly with salt and pepper. Use a pastry brush and a small spoon to completely coat the pork with sauce.\nCook until the pork is no longer pink in the center, and an instant-read thermometer inserted into the center reads 145 degrees F (63 degrees C), about 45 minutes, basting every 10 minutes with remaining sauce.",
    "pt": "10 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1747860.jpg",
    "o": "4504943.jpg,2604630.jpg,2297859.jpg,1898099.jpg,1873592.jpg,681128.jpg",
    "st": "allrecipes"
}