{
    "id": 18421,
    "old_rating": "4.61111",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1 1/2 teaspoons ground cinnamon",
        "1 1/2 teaspoons ground allspice",
        "3/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 1/2 cups peeled and shredded apples",
        "1 1/2 cups shredded carrots",
        "1 1/2 cups peeled and shredded potatoes",
        "3/4 cup dried currants",
        "3/4 cup raisins",
        "3/4 cup chopped walnuts",
        "1 tablespoon grated orange zest",
        "3/4 cup butter, softened",
        "1 1/2 cups brown sugar",
        "3 eggs",
        "2 tablespoons light molasses"
    ],
    "nut": [
        "Calories > 393 kcal",
        "Carbs > 61.2 g",
        "Cholesterol > 56 mg",
        "Fat > 15.6 g",
        "Protein > 5.5 g",
        "Sodium > 282 mg"
    ],
    "n": "Vegetarian Cake",
    "a": "Jennifer Madigan",
    "r": "0",
    "s": 14,
    "des": "\"This super-moist cake is packed with apples, carrots, potatoes, nuts, dried fruit and spices. It's almost a meal in itself! It's best served the day after it's baked.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10-inch bundt pan.\nOnto a sheet of waxed paper, sift flour, baking powder, cinnamon, allspice, baking soda and salt. Set aside. In a medium bowl, stir together apples, carrots, potatoes, currants, raisins, walnuts and orange zest. Set aside.\nPlace softened butter and brown sugar in a large mixing bowl. Beat at low speed until mixture is light and fluffy. Add eggs one at a time, beating after each addition, and then mix in molasses. Slowly beat in dry ingredients until mixture is thoroughly moistened. Gradually stir in fruit mixture and continue to beat at low speed until well blended. Spoon into prepared pan.\nBake in preheated oven for 60 minutes, or until a toothpick inserted in center comes out clean and cake pulls away from sides of pan. Cool on a wire rack for 10 minutes, then remove from pan and cool completely.",
    "pt": "40 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}