{
    "id": 184361,
    "old_rating": "4.64748",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound penne pasta",
        "3 tablespoons extra-virgin olive oil, divided",
        "1 pound bulk Italian sausage",
        "1 pound cremini mushrooms, sliced",
        "3 cloves garlic, minced",
        "1 1/2 cups heavy cream",
        "1/4 teaspoon salt, or to taste",
        "1/4 teaspoon cracked black pepper",
        "1/2 cup grated Parmesan cheese",
        "1 (8 ounce) package shredded whole milk mozzarella"
    ],
    "nut": [
        "Calories > 440 kcal",
        "Carbs > 31.6 g",
        "Cholesterol > 73 mg",
        "Fat > 27.4 g",
        "Protein > 17 g",
        "Sodium > 469 mg"
    ],
    "n": "Baked Pasta with Sausage and Baby Portobello Mushroom White Sauce",
    "a": "Peter Alfieri",
    "r": "0",
    "s": 12,
    "des": "\"This easy to make dish will impress your family or friends with its exotic flavors. This recipe will have your friends and family coming back for more!\"",
    "ins": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nBring a large pot of lightly-salted water to a boil; cook the penne uncovered, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain and return to the pot.\nMeanwhile, heat 1 tablespoon of the olive oil in a large skillet over medium-high heat. Cook and stir the sausage in the hot oil until crumbly and no longer pink, about 7 minutes: remove from the skillet, leaving the fat in the pan, and set aside. Pour the remaining 2 tablespoons of olive oil into the skillet and add the mushrooms and garlic. Cook and stir until the mushrooms have browned and begun to release their liquid, about 5 minutes more. Return the sausage to the skillet and pour in the heavy cream. Season with salt and pepper and return to a simmer, cooking until the sauce begins to thicken, about 5 minutes more. Pour the sauce over the pasta and stir. Stir in 1/2 cup mozzarella and Parmesan. Pour into a 9x13-inch baking dish and sprinkle with remaining 1/2 cup mozzarella cheese.\nBroil in the preheated oven until the mozzarella cheese is bubbly and golden brown, 5 to 7 minutes.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "387462.jpg",
    "o": "4523926.jpg,4501327.jpg,4499071.jpg,4497632.jpg,4488658.jpg,4013381.jpg",
    "st": "allrecipes"
}