{
    "id": 18514,
    "old_rating": "4.31915",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (.25 ounce) packages active dry yeast",
        "2 cups warm water (110 degrees F/45 degrees C)",
        "6 1/2 cups all-purpose flour",
        "1 teaspoon salt",
        "1/3 cup butter, chilled and diced"
    ],
    "nut": [
        "Calories > 295 kcal",
        "Carbs > 52.1 g",
        "Cholesterol > 14 mg",
        "Fat > 5.8 g",
        "Protein > 7.5 g",
        "Sodium > 232 mg"
    ],
    "n": "Farmer's Bread",
    "a": "ARVILLALAR",
    "r": "0",
    "s": 12,
    "des": "\"A big loaf of this simple white bread will satisfy the most hungry farmer. City folks will love it too!\"",
    "ins": "In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, combine 4 cups of flour and salt. Cut in the butter and stir in the yeast mixture. Beat in the remaining flour, 1/2 cup at a time. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 10 minutes. Butter a large bowl, place the dough in the bowl, and turn to coat. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nPreheat oven to 400 degrees F (200 degrees C). Lightly grease a large baking sheet.\nDeflate the dough and turn it out onto a lightly floured surface. Form the dough into a large oval loaf. Place onto the prepared pan. Cover with a damp cloth and let rise until doubled in volume, about 30 minutes. When the loaf is risen, cut a 1/2 inch deep cross onto the top of it. Brush the top with water before baking.\nBake in preheated oven for 25 minutes. Reduce heat to 350 degrees F (175 degrees C) and bake for an additional 15 minutes, or until bottom of loaf sounds hollow when tapped. Let cool on a wire rack before slicing.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "2 h ",
    "i": "3555601.jpg",
    "o": "3164339.jpg,2695676.jpg,1120441.jpg,877465.jpg,606448.jpg,606447.jpg",
    "st": "allrecipes"
}