{
    "id": 185331,
    "old_rating": "4.67",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups uncooked jasmine rice",
        "3 1/2 cups water",
        "2 tablespoons vegetable oil",
        "3 cloves garlic, minced",
        "1 pound skinless, boneless chicken breast halves - cut into thin strips",
        "1 tablespoon Asian fish sauce",
        "1 tablespoon oyster sauce",
        "1 tablespoon white sugar",
        "1/2 cup fresh ginger, cut into matchsticks",
        "1 large red bell pepper, cut into strips",
        "3/4 cup sliced fresh mushrooms",
        "4 green onions cut into 2-inch pieces",
        "1/2 teaspoon Thai red chile paste, or to taste",
        "2 tablespoons chicken broth",
        "salt and ground black pepper to taste",
        "2 tablespoons fresh cilantro leaves"
    ],
    "nut": [
        "Calories > 491 kcal",
        "Carbs > 68.3 g",
        "Cholesterol > 65 mg",
        "Fat > 9.9 g",
        "Protein > 30.2 g",
        "Sodium > 376 mg"
    ],
    "n": "Thai Ginger Chicken (Gai Pad King)",
    "a": "Shae's Mama",
    "r": "0",
    "s": 4,
    "des": "\"My family loved ordering this dish at our local Thai restaurant, but then they closed down for some unknown reason (they were always busy).  So I decided to recreate this traditional dish at home.  My husband says it's just like the restaurant...maybe even better?  Please note that some people like to eat the ginger, while others don't but like the flavor it gives off.  You can easily double this recipe to serve a larger group...plus it makes great leftovers.\"",
    "ins": "Bring the rice and water to a boil in a saucepan. Reduce heat to medium-low; cover and simmer until the rice is tender and the liquid has been absorbed, 20 to 25 minutes.\nMeanwhile, heat a wok or large skillet over medium-high heat. Stir in the garlic and chicken; cook for 2 minutes. Add the fish sauce, oyster sauce, sugar, ginger, red pepper, mushrooms, and onions. Cook and stir until the chicken is no longer pink and the vegetables are nearly tender, about 3 minutes. Dissolve the chile paste in the chicken broth, then add to the chicken mixture. Season to taste with salt and pepper; sprinkle with cilantro leaves to garnish. Serve with the hot rice.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "215482.jpg",
    "o": "3957340.jpg,3787798.jpg,3346797.jpg,3016189.jpg,3016142.jpg,1060171.jpg",
    "st": "allrecipes"
}