{
    "id": 185947,
    "old_rating": "4.5969",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "20 ounces white chocolate, coarsely chopped, divided",
        "30 peppermint candies, crushed, divided",
        "10 ounces dark chocolate, coarsely chopped",
        "6 tablespoons heavy cream",
        "1 teaspoon peppermint extract"
    ],
    "nut": [
        "Calories > 204 kcal",
        "Carbs > 28.7 g",
        "Cholesterol > 8 mg",
        "Fat > 9.5 g",
        "Protein > 1.6 g",
        "Sodium > 23 mg"
    ],
    "n": "Layered Peppermint Bark",
    "a": "carol",
    "r": "0",
    "s": 32,
    "des": "\"I never liked peppermint bark until I tried this recipe. The soft ganache center contrasts perfectly with the crunchy peppermints.\"",
    "ins": "Line a 9x12 inch baking pan with aluminum foil or parchment paper.\nMelt half of the white chocolate in the top of a double boiler over just barely simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Spread the white chocolate into the prepared pan. Sprinkle 1/4 of the crushed peppermints evenly over white chocolate. Chill until firm, about 15 minutes.\nMeanwhile, melt the dark chocolate, heavy cream, and peppermint extract together in the top of a double boiler over just barely simmering water, stirring frequently, until just melted. Quickly pour the chocolate layer over the chilled white chocolate layer; spread evenly. Chill until firm, about 20 minutes.\nMeanwhile, melt the remaining white chocolate in the top of a double boiler over just barely simmering water, stirring frequently, until just melted. Spread quickly over the chilled bark. Sprinkle with the remaining peppermint pieces; chill until firm, about 20 minutes. Cut or break into small pieces to serve.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "309307.jpg",
    "o": "4361388.jpg,4095641.jpg,3908934.jpg,1100430.jpg,1079307.jpg,932782.jpg",
    "st": "allrecipes"
}