{
    "id": 186691,
    "old_rating": "4.69506",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup orange juice",
        "1/2 cup lemon juice",
        "1/3 cup lime juice",
        "4 cloves garlic, minced",
        "1/2 cup soy sauce",
        "1 teaspoon finely chopped canned chipotle pepper",
        "1 tablespoon chili powder",
        "1 tablespoon ground cumin",
        "1 tablespoon paprika",
        "1 teaspoon dried oregano",
        "1 tablespoon black pepper",
        "1 bunch fresh cilantro, chopped",
        "1/2 cup olive oil",
        "3 pounds flank steak"
    ],
    "nut": [
        "Calories > 207 kcal",
        "Carbs > 5.7 g",
        "Cholesterol > 25 mg",
        "Fat > 14 g",
        "Protein > 15 g",
        "Sodium > 640 mg"
    ],
    "n": "Lisa's Favorite Carne Asada Marinade",
    "a": "Lisa Arlotti",
    "r": "0",
    "s": 12,
    "des": "\"I've tried many marinade recipes for carne asada, and this is our family favorite!\"",
    "ins": "Combine the orange, lemon, and lime juice in a large glass or ceramic bowl along with the garlic, soy sauce, chipotle pepper, chili power, ground cumin, paprika, dried oregano, black pepper, and cilantro. Slowly whisk in the olive oil until marinade is well combined.  Remove one cup of the marinade and place in a small bowl, cover with plastic wrap and refrigerate for use after the meat is cooked.\nPlace the flank steak between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the steak with the smooth side of a meat mallet to a thickness of 1/4 inch.  After pounding, poke steak all over with a fork.  Add the meat to the marinade in the large bowl, cover, and allow to marinate in the refrigerator for 24 hours.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nRemove the steak from the marinade and grill to desired doneness, about 5 minutes per side for medium rare. Discard used marinade.  Remove meat from heat and slice across the grain.\nPour the one cup of reserved, unused marinade over the hot meat and serve immediately.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "1 d ",
    "i": "4534162.jpg",
    "o": "4534162.jpg,4458173.jpg,3871137.jpg,3828341.jpg,3700944.jpg,3594043.jpg",
    "st": "allrecipes"
}