{
    "id": 186804,
    "old_rating": "4.08333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound fresh green beans, trimmed",
        "1/4 cup olive oil",
        "4 pork chops",
        "1 teaspoon salt",
        "1 pinch ground black pepper",
        "1 teaspoon chopped fresh sage",
        "1 tablespoon minced garlic",
        "2 large tomatoes, sliced",
        "4 slices shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 453 kcal",
        "Carbs > 12.9 g",
        "Cholesterol > 89 mg",
        "Fat > 30.2 g",
        "Protein > 33.6 g",
        "Sodium > 804 mg"
    ],
    "n": "Pork Chops with Tomatoes and String Beans",
    "a": "S.P. Daley",
    "r": "0",
    "s": 4,
    "des": "\"Pork chops are seared on the stovetop and topped with a layer of cheese and tomatoes, then baked on a bed of fresh string beans. Great with baked potatoes.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Lightly grease a baking dish.\nFill a saucepan with lightly salted water, and bring to a rolling boil over high heat. Once the water is boiling, add the green beans, and return to a boil. Cook uncovered until the green beans are crisp-tender, 3 to 4 minutes. Drain the beans, reserving 2/3 cup of the cooking liquid. Spread the beans into the greased baking dish.\nHeat the olive oil in a large skillet over medium-high heat. Add the pork chops, and cook until golden brown on each side, about 3 minutes per side. Season the browned pork chops with salt, pepper, sage, and garlic, then arrange over the green beans.\nPour the reserved bean-cooking liquid in the skillet and stir the browned bits until dissolved. Pour over the pork chops. Place the tomato slices over the pork chops, and cover each with a slice of Cheddar cheese.\nBake in the preheated oven until the cheese melts and is golden brown, 20 to 25 minutes. An instant-read thermometer inserted into the center of the pork chops should read 145 degrees F (63 degrees C).",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "822641.jpg",
    "o": "",
    "st": "allrecipes"
}