{
    "id": 186943,
    "old_rating": "4.48315",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups uncooked penne pasta",
        "1 pound ground Italian sausage",
        "1 (26 ounce) jar garlic and onion spaghetti sauce (such as RaguÂ® RobustoÂ® Sauteed Onion & Garlic Pasta Sauce)",
        "1 cup cottage cheese",
        "2 cups shredded mozzarella cheese, divided"
    ],
    "nut": [
        "Calories > 386 kcal",
        "Carbs > 29.6 g",
        "Cholesterol > 46 mg",
        "Fat > 19.3 g",
        "Protein > 22.1 g",
        "Sodium > 1135 mg"
    ],
    "n": "Lasagna Toss",
    "a": "jbabb",
    "r": "0",
    "s": 8,
    "des": "\"This is based on a recipe that I received from my aunt at my bridal shower about 6 years ago.  I finally used it this last year and modified it to make it a quicker meal.  Hey, a working wife has to survive somehow! This is a quick, and EASY, alternative to lasagna when you don't have much time, it's great for a weeknight meal!  Serve with side salad and garlic bread and you have a quick and yummy meal!\n\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 2.5 quart baking dish.\nBring a large pot of lightly salted water to a boil. Place pasta in the pot, cook for 8 to 10 minutes, until tender, and drain.\nCook and stir the Italian sausage in a large skillet over medium heat until browned, about 8 to 10 minutes. Drain the fat from the meat, pour the cooked pasta and spaghetti sauce into the skillet, and stir well to combine. Bring the mixture to a boil.\nPour half of the hot pasta-sausage mixture into the prepared baking dish, spread with the cottage cheese in an even layer, and sprinkle with half the mozzarella cheese. Spread the remaining pasta mixture over the cheese, and top with the remaining mozzarella cheese.\nCover and bake in the preheated oven for about 25 minutes, until the casserole is hot and the cheese is melted and bubbling. Let it stand 5 minutes to firm up before serving.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "201719.jpg",
    "o": "",
    "st": "allrecipes"
}