{
    "id": 186936,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (18.25 ounce) box red velvet cake mix",
        "2 eggs, lightly beaten",
        "1/2 cup vegetable oil",
        "1 tablespoon bourbon",
        "Icing",
        "1 (8 ounce) package cream cheese, softened",
        "1/4 cup butter, softened",
        "2 teaspoons evaporated milk",
        "1 teaspoon vanilla",
        "1/2 cup flaked coconut",
        "4 cups confectioners' sugar",
        "1/2 cup chopped pecans"
    ],
    "nut": [
        "Calories > 292 kcal",
        "Carbs > 39.9 g",
        "Cholesterol > 29 mg",
        "Fat > 14.3 g",
        "Protein > 2.5 g",
        "Sodium > 182 mg"
    ],
    "n": "Dawn's Easy Red Velvet Sandwich Cookies",
    "a": "DAWNV4",
    "r": "0",
    "s": 24,
    "des": "\"As a Southern girl, I love baking from scratch and red velvet cakes are a must for the holidays. I usually make one every Christmas, especially one for my brother-in-law David. This year was so busy, I just didn't have time to make him one, but I am always making cake mix cookies for my girls as a quick snack in the afternoons after school, so I whipped up a batch of these gems for him for Christmas. They are out of this world! You don't just have to make them for holidays they are wonderful anytime, see for your self.\"",
    "ins": "Preheat the oven to 375 degrees F (190 degrees C).\nMix together cake mix, eggs, oil, and bourbon in a large bowl. Roll the dough into balls the size of walnuts. Place 2 inches apart on ungreased baking sheets.\nBake in the preheated oven until the tops start to crack, about 8 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\nIn a large bowl combine cream cheese, butter, evaporated milk, vanilla, and coconut. Add the confectioners' sugar 1 cup at a time, mixing well with each addition. If consistency is too stiff, add more milk.\nPlace the chopped pecans in a bowl. Spread a generous amount of icing on the bottom of a cookie, sandwich it with another cookie, pressing firmly so that the icing comes all the way out to the edge. Roll the edges of the sandwich cookies in the chopped pecans. Repeat with the remaining cookies.",
    "pt": "25 m",
    "ct": "8 m",
    "tt": "33 m",
    "i": "577495.jpg",
    "o": "4519696.jpg,4517298.jpg,3545324.jpg,3344911.jpg,3202721.jpg,2751458.jpg",
    "st": "allrecipes"
}