{
    "id": 186961,
    "old_rating": "4.04839",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 ounces jumbo pasta shells",
        "1 1/2 pounds thinly sliced deli roast beef",
        "4 (10.25 ounce) cans beef gravy",
        "1 (10 ounce) bottle cream-style horseradish sauce",
        "8 ounces shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 556 kcal",
        "Carbs > 42.3 g",
        "Cholesterol > 89 mg",
        "Fat > 28.2 g",
        "Protein > 33.6 g",
        "Sodium > 1901 mg"
    ],
    "n": "Roast Beef Stuffed Shells",
    "a": "CNM CATERING",
    "r": "0",
    "s": 8,
    "des": "\"These roast beef, horseradish, and Cheddar stuffed pasta shells are easy to prepare and always a crowd pleaser.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).  Grease 2 - 9x13 inch baking dishes.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the pasta shells, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 10 minutes. Drain well in a colander set in the sink and place shells on a sheet of wax paper to cool.\nCombine the roast beef and the gravy in a large saucepan and place over medium-low heat.  Cook for 10 minutes or until heated through.\nUse a slotted spoon to fill each shell with roast beef, draining off as much gravy as possible.  Spread about 1 1/2 teaspoons of horseradish sauce on top of the beef in each shell.  Place the shells in the greased baking dishes, and top with the remaining gravy.  Sprinkle the Cheddar cheese evenly over the stuffed shells.  Bake, uncovered,  until the cheese is melted and the filling is hot and bubbly, about 20 minutes.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "2281044.jpg",
    "o": "867255.jpg,387745.jpg,357807.jpg,357806.jpg,241101.jpg,226564.jpg",
    "st": "allrecipes"
}