{
    "id": 187448,
    "old_rating": "4.48092",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 ounces dry Chinese noodles",
        "3 tablespoons soy sauce",
        "3/4 cup sweet chili sauce",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon ground ginger",
        "3 tablespoons sesame oil",
        "1/2 cup soy sauce",
        "1/2 teaspoon garlic powder",
        "1 (1 pound) pork loin, cut into 2-inch strips",
        "2 tablespoons cooking oil",
        "2 onions, cut into bite-size pieces",
        "1/8 teaspoon crushed red pepper flakes",
        "3 tablespoons sweet chili sauce",
        "3 cups chopped napa cabbage",
        "3/4 cup sliced celery",
        "1 cup sliced carrots",
        "3 red bell peppers, chopped",
        "2 teaspoons cornstarch",
        "1/4 cup cold water"
    ],
    "nut": [
        "Calories > 527 kcal",
        "Carbs > 72.5 g",
        "Cholesterol > 36 mg",
        "Fat > 19.3 g",
        "Protein > 22.1 g",
        "Sodium > 2131 mg"
    ],
    "n": "Sweet and Spicy Pork and Napa Cabbage Stir-Fry with Spicy Noodles",
    "a": "thriftybob",
    "r": "0",
    "s": 6,
    "des": "\"The Thai sweet chili sauce gives this dish a sweet and spicy flavor that my kids love. You can adjust the heat level by adding more or less of the sauce or adding additional red pepper flakes, if you like it really hot.\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the Chinese noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 5 minutes. Drain well in a colander set in the sink.\nWhisk together the 3 tablespoons soy sauce, 3/4 cup sweet chili sauce, 1/2 teaspoon garlic powder, the ground ginger, and the sesame oil in a large bowl; add the drained Chinese noodles and toss to coat; set aside\nWhisk together the 1/2 cup soy sauce and 1/2 teaspoon garlic powder in a large bowl; add the pork and stir to coat. Allow to marinate 5 minutes.\nHeat the cooking oil in a wok or a large, deep skillet over medium-high heat. Add the pork, onions, and red pepper flakes to the oil; cook until the pork is browned completely. Stir in 3 tablespoons sweet chili sauce, the napa cabbage, celery, carrots, and bell peppers; cook and stir until vegetables are completely heated, about 5 minutes. Whisk together the cornstarch and water and add to the stir fry, stirring until the mixture thickens. Serve the stir-fry over the noodles.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "2625712.jpg",
    "o": "3193590.jpg,2767117.jpg,1889485.jpg,1816971.jpg,1331587.jpg,1031398.jpg",
    "st": "allrecipes"
}