{
    "id": 187504,
    "old_rating": "4.65455",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "1 pound bulk hot pork sausage",
        "1 (28 ounce) can crushed tomatoes",
        "1 (15.25 ounce) can whole kernel corn with red and green bell peppers (such as MexicornÂ®), drained and rinsed",
        "1 (14.5 ounce) can black beans, rinsed and drained",
        "1 (14 ounce) can kidney beans, rinsed and drained",
        "1 (1 ounce) package ranch dressing mix",
        "1 (1 ounce) package taco seasoning mix",
        "1 onion, chopped",
        "1 green bell pepper, chopped",
        "1 red bell pepper, chopped",
        "1 (14.5 ounce) can diced tomatoes with green chile peppers (such as RO*TELÂ®), undrained",
        "1/2 cup chili sauce",
        "2 fresh jalapeno peppers, diced",
        "1 (12 fluid ounce) can or bottle dark beer",
        "ground black pepper to taste"
    ],
    "nut": [
        "Calories > 195 kcal",
        "Carbs > 19.4 g",
        "Cholesterol > 27 mg",
        "Fat > 8.1 g",
        "Protein > 10.9 g",
        "Sodium > 839 mg"
    ],
    "n": "Chad's Slow Cooker Taco Soup",
    "a": "AccountKiller",
    "r": "0",
    "s": 20,
    "des": "\"This easy soup is hearty, yet extremely tasty. This is really a form of chili, but uses some ingredients not found in regular chili.  Sure to be a hit, you can adjust the spice as needed by using varying levels of jalapenos and RO*TELÂ® varieties. Top with shredded sharp Cheddar cheese and/or sour cream. Serve with tortilla chips. Leftovers can be frozen and enjoyed later.\"",
    "ins": "Brown the ground beef completely in a large skillet over medium heat; drain. Transfer the beef to a slow cooker.\nBrown the sausage completely in a large skillet over medium heat; drain. Transfer the beef to a slow cooker.\nAdd the crushed tomatoes, corn, black beans, kidney beans, ranch dressing mix, taco seasoning mix, onion, green bell pepper, red bell pepper, diced tomatoes with green chile peppers, chili sauce, jalapeno peppers, beer, and black pepper to the slow cooker. Set slow cooker to Low and cook 8 to 10 hours, or, if you prefer, on High for 4 to 6 hours.",
    "pt": "20 m",
    "ct": "8 h ",
    "tt": "8 h ",
    "i": "4256175.jpg",
    "o": "",
    "st": "allrecipes"
}