{
    "id": 18775,
    "old_rating": "4.60987",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness",
        "2 teaspoons seasoning salt",
        "6 slices bacon, cut in half",
        "1/2 cup prepared yellow mustard",
        "1/2 cup honey",
        "1/4 cup light corn syrup",
        "1/4 cup mayonnaise",
        "1 tablespoon dried onion flakes",
        "1 tablespoon vegetable oil",
        "1 cup sliced fresh mushrooms",
        "2 cups shredded Colby-Monterey Jack cheese",
        "2 tablespoons chopped fresh parsley"
    ],
    "nut": [
        "Calories > 813 kcal",
        "Carbs > 57.1 g",
        "Cholesterol > 153 mg",
        "Fat > 46.1 g",
        "Protein > 47.2 g",
        "Sodium > 1807 mg"
    ],
    "n": "Aussie Chicken",
    "a": "beckie",
    "r": "0",
    "s": 4,
    "des": "\"This recipe is very similar to a chicken dish served at a local well-known restaurant.  A friend of mine was kind enough to share it. It includes chicken breasts topped with mushrooms, bacon and cheese cooked in a honey-mustard sauce.\"",
    "ins": "Rub the chicken breasts with the seasoning salt, cover and refrigerate for 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Place bacon in a large, deep skillet. Cook over medium high heat until crisp. Set aside.\nIn a medium bowl, combine the mustard, honey, corn syrup, mayonnaise and dried onion flakes. Remove half of sauce, cover and refrigerate to serve later.\nHeat oil in a large skillet over medium heat. Place the breasts in the skillet and saute for 3 to 5 minutes per side, or until browned. Remove from skillet and place the breasts into a 9x13 inch baking dish. Apply the honey mustard sauce to each breast, then layer each breast with mushrooms and bacon. Sprinkle top with shredded cheese.\nBake in preheated oven for 15 minutes, or until cheese is melted and chicken juices run clear. Garnish with parsley and serve with the reserved honey mustard sauce.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "4536653.jpg",
    "o": "4536653.jpg,4487960.jpg,4479234.jpg,4478175.jpg,4477727.jpg,4477714.jpg",
    "st": "allrecipes"
}