{
    "id": 18771,
    "old_rating": "4.34783",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon olive oil",
        "1 pound ground lamb",
        "6 cloves garlic, crushed",
        "1 large onion, sliced",
        "1 tablespoon dried oregano",
        "2/3 teaspoon ground cumin",
        "2 teaspoons salt",
        "2 teaspoons freshly ground black pepper",
        "1 dash hot pepper sauce",
        "2/3 cup chopped fresh parsley",
        "1 pound pizza crust dough",
        "6 ounces feta cheese",
        "1/2 zucchini, diced",
        "8 ounces chopped black olives",
        "1/2 teaspoon garlic powder"
    ],
    "nut": [
        "Calories > 694 kcal",
        "Carbs > 66.6 g",
        "Cholesterol > 95 mg",
        "Fat > 32.9 g",
        "Protein > 32.5 g",
        "Sodium > 2952 mg"
    ],
    "n": "Gyroll",
    "a": "Adam Pack",
    "r": "0",
    "s": 4,
    "des": "\"Well-seasoned lamb meat, along with feta cheese, zucchini and black olives, gets sealed into pizza dough and baked until golden. This mess-less version of a gyro sandwich substitutes pizza dough for the much harder-to-make pita bread. \"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nHeat oil in a large skillet over medium-high heat. Brown meat with garlic, onion, oregano, cumin, salt, pepper and hot pepper sauce. When meat is almost done, add parsley and cook until the parsley wilts. Remove mixture from heat and allow to cool.\nRoll pizza dough out into a rectangle (about 18 inches by 12 inches), with the long side laid out left-to-right in front of you. Spread out feta cheese, zucchini and black olives evenly over the dough, leaving 3 inches from the edges of the crust uncovered. Spread the cooled meat mixture over the top, still leaving edges of dough uncovered.\nStarting with the edge closest to you, roll up the whole thing until it is all rolled up. You can do this by using the uncovered edge of dough at the end as a 'strip' to stick to the roll and seal it, making sure both ends are pressed down and sealed.  Sprinkle with garlic powder and bake in the preheated oven for 5 minutes. Then, reduce heat to 350 degrees F (175 degrees C) and bake for about 30 minutes, or until golden brown.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "32812.jpg",
    "o": "",
    "st": "allrecipes"
}