{
    "id": 18791,
    "old_rating": "4.24115",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 tablespoons olive oil, divided",
        "1 onion, chopped",
        "1/4 cup balsamic vinegar",
        "1 1/2 cups uncooked Arborio rice",
        "1/4 cup dry white wine",
        "7 cups hot chicken broth",
        "2 tablespoons butter",
        "2 cups chopped cooked chicken breast",
        "salt and pepper to taste",
        "2 tablespoons chopped fresh thyme"
    ],
    "nut": [
        "Calories > 774 kcal",
        "Carbs > 77.3 g",
        "Cholesterol > 72 mg",
        "Fat > 29.1 g",
        "Protein > 44.8 g",
        "Sodium > 2840 mg"
    ],
    "n": "Roasted Chicken with Risotto and Caramelized Onions",
    "a": "Michele O'Sullivan",
    "r": "0",
    "s": 4,
    "des": "\"Moist roasted chicken gets the royal treatment with caramelized onions, balsamic vinegar and creamy risotto. You may choose to roast your own chicken or purchase a rotisserie chicken from a grocery store. A little grated cheese such as Parmesan or Pecorino Romano before serving is also a nice touch.\"",
    "ins": "Heat 2 tablespoons of the oil in a medium saucepan over medium heat. Stir in the onions and saute for 15 to 20 minutes, or until the onions are a dark golden brown. Remove from heat, stir in the balsamic vinegar and set aside.\nHeat the remaining oil in a separate large skillet over medium heat. Stir in the rice and mix well. Let heat for about 2 minutes, then pour in the wine. Reduce heat to medium low and start pouring in the broth about 1 cup at a time. Add more broth as each cup is absorbed. Continue in this manner until all the broth is absorbed and the rice is al dente, about 20 minutes.\nStir in the reserved onion mixture and allow to heat through. Remove from heat and stir in the butter and chicken. Season with salt and pepper to taste, and garnish each serving with fresh thyme.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "810078.jpg",
    "o": "4482028.jpg,3835517.jpg,3235117.jpg,457851.jpg,457849.jpg,254622.jpg",
    "st": "allrecipes"
}