{
    "id": 18819,
    "old_rating": "4.28409",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 large eggplants",
        "8 large potatoes",
        "8 green bell peppers",
        "8 large onions",
        "8 summer squash",
        "6 tomatoes",
        "1 pound fresh green beans",
        "1 pound whole fresh mushrooms",
        "2 bulbs garlic, cloves separated and peeled",
        "1/4 cup chopped fresh dill weed",
        "1/4 cup chopped fresh oregano",
        "1/4 cup chopped fresh basil",
        "1 (15 ounce) can tomato sauce",
        "3/4 cup olive oil",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 176 kcal",
        "Carbs > 30.9 g",
        "Cholesterol > 0 mg",
        "Fat > 5.1 g",
        "Protein > 5.2 g",
        "Sodium > 75 mg"
    ],
    "n": "Hariton's 'Famous' Vegetarian Casserole",
    "a": "Patti Moschonas",
    "r": "0",
    "s": 36,
    "des": "\"This is a very tasty dish consisting of all kinds of fresh vegetables and herbs baked in the oven. This will tantalize your taste buds. It has been a sell-out at our Greek Church at every function for five years now. We serve this on toasted, warm pita bread.\"",
    "ins": "Prepare the eggplant before assembling ingredients, by cutting them into 2 inch chunks and putting them into an extra large bowl with salted water to cover. This will draw out the bitterness from the eggplant. Let this sit for about 3 hours.\nPreheat oven to 375 degrees F (190 degrees C).\nCut the potatoes, green bell peppers, onion, squash and tomatoes into 2-inch chunks. Cut the green beans and mushrooms in half and peel the garlic cloves.\nDrain and rinse the eggplant, then combine it with all the other chopped vegetables, the dill, oregano and basil and place all into a 3x13x18 inch roasting pan. Pour the tomato sauce and olive oil over all.\nBake at 375 degrees F (190 degrees C) for 2 1/2 hours, adding a little water about halfway through cooking time to keep moist.",
    "pt": "30 m",
    "ct": "2 h ",
    "tt": "6 h",
    "i": "991832.jpg",
    "o": "",
    "st": "allrecipes"
}