{
    "id": 18842,
    "old_rating": "4.38532",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups uncooked long-grain white rice",
        "1 large onion, chopped",
        "1/2 cup chopped fresh dill",
        "1/2 cup chopped fresh mint leaves",
        "2 quarts chicken broth",
        "3/4 cup fresh lemon juice, divided",
        "60 grape leaves, drained and rinsed",
        "hot water as needed",
        "1 cup olive oil"
    ],
    "nut": [
        "Calories > 303 kcal",
        "Carbs > 30.9 g",
        "Cholesterol > 0 mg",
        "Fat > 18.7 g",
        "Protein > 3.6 g",
        "Sodium > 573 mg"
    ],
    "n": "My Own Famous Stuffed Grape Leaves",
    "a": "Patti Moschonas",
    "r": "0",
    "s": 12,
    "des": "\"These are grape leaves, stuffed with a tantalizing mixture of rice, fresh dill, mint and lemon. 'Yum' is the only one word to describe these. These can either be a main dish or an appetizer, depending on your appetite. Serve with good crusty bread and a Greek salad, if desired.\"",
    "ins": "In a large saucepan over medium-high heat, saute the rice, onion, dill, and mint for about 5 minutes, or until onion is soft. Pour in 1 quart of broth, reduce heat to low and simmer for another 10 to 15 minutes, or until rice is almost cooked. Stir in 1/2 of lemon juice and remove from heat.\nTake one leaf, shiny side down, and place 1 teaspoon of the rice mixture at the bottom (stem) end of the leaf. Fold both sides of the leaf towards the center, roll up from the broad bottom to the top, and place into a 4-quart pot. Repeat with all leaves, leaving no gaps as leaves are placed in pot (to prevent from opening while cooking). Sprinkle with remaining lemon juice and with olive oil.\nPour chicken broth over all to cover grape leaves. Cover pot and simmer for about 1 hour (do not boil, because this will make the stuffing burst out of the leaves). Remove from heat, remove cover and let cool for 1/2 hour. Transfer to serving dish and serve.",
    "pt": "40 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4528750.jpg",
    "o": "4526830.jpg,4521063.jpg,3499303.jpg,2030319.jpg,1374735.jpg,811447.jpg",
    "st": "allrecipes"
}