{
    "id": 188796,
    "old_rating": "3.77778",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package dry 15 bean mix for soup",
        "1 bay leaf",
        "1 pound bacon",
        "1 pound ground beef",
        "1 pound kielbasa sausage, sliced",
        "1 onion, chopped",
        "1 green bell pepper, chopped",
        "1 red bell pepper, chopped",
        "2 (10.5 ounce) cans chicken broth",
        "1 (16 ounce) bottle hickory flavored barbeque sauce (such as Open PitÂ®)",
        "1 1/2 teaspoons Worcestershire sauce",
        "1/3 cup honey",
        "1/4 cup real maple syrup",
        "2/3 cup bourbon whiskey",
        "3 tablespoons coarse-grain mustard"
    ],
    "nut": [
        "Calories > 466 kcal",
        "Carbs > 44.2 g",
        "Cholesterol > 54 mg",
        "Fat > 19.1 g",
        "Protein > 21.1 g",
        "Sodium > 1237 mg"
    ],
    "n": "Bourbon Barbecue Slow Cooker Beans",
    "a": "Erica Anderson",
    "r": "0",
    "s": 14,
    "des": "\"I am asked to bring these 'trucker beans' to almost every summer bbq! Rich, meaty and satisfying. These beans make a great side dish, are perfect to bring to a pot luck picnic, or hearty enough to be eaten as a meal.\"",
    "ins": "Rinse the beans, and place in a very large pot.  Cover beans with water, add the bay leaf, and bring to a boil.  Simmer until all of the water is absorbed, 45 minutes to 1 hour.  Remove the bay leaf.\nPlace the chopped bacon in a large, deep skillet; cook over medium-high heat, stirring, until evenly browned, about 5 minutes. Drain the bacon on a paper towel-lined plate.  Return the skillet to the heat, and add the ground beef; cook until the beef is cooked through and browned, about 5 minutes.  Drain fat.\nCombine the beans, bacon, ground beef, sliced kielbasa, onion, green pepper, red pepper, chicken broth, barbeque sauce, Worcestershire sauce, honey, maple syrup, bourbon, and mustard in the crock of a slow cooker,  and stir well to combine. Turn the slow cooker to Low heat, and cook until the beans are tender, 8 to 10 hours.",
    "pt": "30 m",
    "ct": "10 h",
    "tt": "10 h ",
    "i": "772543.jpg",
    "o": "",
    "st": "allrecipes"
}