{
    "id": 189049,
    "old_rating": "4.16129",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package elbow macaroni",
        "1/4 cup butter, softened",
        "1 tablespoon olive oil",
        "1 small onion, minced",
        "1 (6 ounce) can salmon, drained and flaked",
        "1 tablespoon seafood seasoning (such as Old BayÂ®)",
        "1 tablespoon red wine vinegar",
        "2 1/2 cups shredded Cheddar cheese",
        "2 eggs, beaten",
        "2 cups milk",
        "1/2 cup vegetable stock",
        "1 (14.5 ounce) can peas and carrots, drained",
        "1 (8 ounce) can whole kernel corn, drained",
        "salt and pepper to taste",
        "3 slices day-old bread",
        "3 tablespoons grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 581 kcal",
        "Carbs > 61 g",
        "Cholesterol > 115 mg",
        "Fat > 25.3 g",
        "Protein > 28.2 g",
        "Sodium > 913 mg"
    ],
    "n": "Salmon Mac and Cheese",
    "a": "Pixie2",
    "r": "0",
    "s": 8,
    "des": "\"This is a salmon version of a tuna casserole. You can use tuna in this as well. I made this up in college when I needed to make something that would use up stuff I had in the kitchen.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the macaroni, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink. Transfer to a large bowl. Stir the softened butter into the macaroni.\nHeat the olive oil in a skillet over medium heat; cook the onion in the oil until brown, about 5 minutes. Stir in the salmon and seafood seasoning and cook until warmed through, about 5 minutes more. Remove from heat and pour the red wine vinegar into the skillet and set aside to cool.\nMix together the Cheddar cheese, eggs, milk, and vegetable stock in a large mixing bowl. Add the salmon mixture, peas and carrots, and corn; mix. Stir in the macaroni. Season with salt and pepper. Spread into the bottom of the prepared baking dish.\nToast the bread and break into small pieces. Combine the toasted bread and Parmesan cheese in a food processor; blend until chopped into crumbs. Sprinkle over top of the dish.\nBake in the preheated oven until heated through, about 45 minutes. Allow to cool 15 to 20 minutes before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "187986.jpg",
    "o": "2228460.jpg,357629.jpg,233370.jpg,233367.jpg,233349.jpg,187983.jpg",
    "st": "allrecipes"
}