{
    "id": 189477,
    "old_rating": "4.29825",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup uncooked short-grain white rice",
        "1 cup water",
        "1/4 cup rice vinegar",
        "1 tablespoon white sugar",
        "1/2 cup imitation crabmeat, finely chopped",
        "1/4 cup mayonnaise",
        "8 sheets nori (dry seaweed)",
        "2 1/2 tablespoons sesame seeds",
        "1 cucumber, cut into thin spears",
        "2 avocados - pitted, peeled, and sliced the long way"
    ],
    "nut": [
        "Calories > 232 kcal",
        "Carbs > 23.7 g",
        "Cholesterol > 5 mg",
        "Fat > 14.4 g",
        "Protein > 3.9 g",
        "Sodium > 135 mg"
    ],
    "n": "California Roll Sushi",
    "a": "Erin",
    "r": "0",
    "s": 8,
    "des": "\"California Roll - it's really good. Serve with soy sauce and wasabi.\n\"",
    "ins": "Wash the rice in several changes of water until the rinse water is no longer cloudy, drain well, and place in a covered pan or rice cooker with 1 cup water. Bring to a boil, reduce heat to a simmer, and cover the pan. Allow the rice to simmer until the top looks dry, about 15 minutes. Turn off the heat, and let stand for 10 minutes to absorb the rest of the water.\nMix the rice vinegar and sugar in a small bowl until the sugar has dissolved, and stir the mixture into the cooked rice until well combined. Allow the rice to cool, and set aside.\nMix the imitation crabmeat with mayonnaise in a bowl, and set aside. To roll the sushi, cover a bamboo rolling mat with plastic wrap. Lay a sheet of nori, shiny side down, on the plastic wrap. With wet fingers, firmly pat a thin, even layer of prepared rice over the nori, leaving 1/4 inch uncovered at the bottom edge of the sheet. Sprinkle the rice with about 1/2 teaspoon of sesame seeds, and gently press them into the rice. Carefully flip the nori sheet over so the seaweed side is up.\nPlace 2 or 3 long cucumber spears, 2 or 3 slices of avocado, and about 1 tablespoon of imitation crab mixture in a line across the nori sheet, about 1/4 from the uncovered edge. Pick up the edge of the bamboo rolling sheet, fold the bottom edge of the sheet up, enclosing the filling, and tightly roll the sushi into a cylinder about 1 1/2 inch in diameter. Once the sushi is rolled, wrap it in the mat and gently squeeze to compact it tightly.\nCut each roll into 1 inch pieces with a very sharp knife dipped in water.",
    "pt": "45 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "907484.jpg",
    "o": "4478666.jpg,4469437.jpg,4035360.jpg,4020920.jpg,3434922.jpg,1902751.jpg",
    "st": "allrecipes"
}