{
    "id": 19024,
    "old_rating": "4.82353",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup light corn syrup",
        "1 cup heavy cream",
        "10 ounces semisweet chocolate, chopped",
        "16 graham crackers, broken into 1/2-inch pieces",
        "1 cup toasted almonds",
        "3 tablespoons white sugar",
        "1/2 cup melted butter",
        "1 1/2 quarts coffee ice cream, softened",
        "1 (7 ounce) jar marshmallow creme",
        "2 cups miniature marshmallows"
    ],
    "nut": [
        "Calories > 960 kcal",
        "Carbs > 101.8 g",
        "Cholesterol > 201 mg",
        "Fat > 58.1 g",
        "Protein > 13.5 g",
        "Sodium > 346 mg"
    ],
    "n": "Coffee Ice Cream Fudge Cake",
    "a": "Andrew",
    "r": "0",
    "s": 10,
    "des": "\"Crumb crust, coffee ice cream middle, topped with toasted marshmallow -- like a cross between s'mores and mud pie!\"",
    "ins": "To make fudge sauce, combine heavy cream and corn syrup in heavy saucepan.  Bring to a boil, remove from heat, add chocolate and whisk until smooth.  Refrigerate until cool, about 45 minutes.\nTo make ice cream cake, preheat oven to 350 degrees F (175 degrees C).  Finely grind graham crackers and almonds in food processor or blender.  Stir in sugar.  Add butter and process until moist crumbs form.  Press mixture into bottom and sides of 9 inch spring form pan.  Bake until golden, about 12 minutes.  Allow to cool, then spread 2 cups softened ice cream over crust.  Spoon 3/4 cup fudge sauce over ice cream.  Freeze until set, then repeat layering.  Cover and freeze 8 hours or overnight.  Refrigerate remaining fudge sauce.\nThe next day, preheat the oven broiler.  Warm the remaining fudge sauce in the microwave or a small saucepan.  Place the cake pan on a cookie sheet.  Spread the marshmallow creme over cake and sprinkle miniature marshmallows on top.  Place under broiler until marshmallows are deep brown.  Loosen cake with knife and remove sides of pan.  Serve immediately with warmed fudge sauce.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}