{
    "id": 190412,
    "old_rating": "4.38764",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons lime juice",
        "1 tablespoon ground cumin",
        "1 tablespoon paprika",
        "2 teaspoons minced garlic",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1 1/2 pounds tilapia fillets, cut into chunks",
        "2 tablespoons olive oil",
        "2 onions, chopped",
        "4 large bell peppers, sliced",
        "1 (16 ounce) can diced tomatoes, drained",
        "1 (16 ounce) can coconut milk",
        "1 bunch fresh cilantro, chopped (optional)"
    ],
    "nut": [
        "Calories > 359 kcal",
        "Carbs > 15.6 g",
        "Cholesterol > 42 mg",
        "Fat > 21.8 g",
        "Protein > 27.4 g",
        "Sodium > 600 mg"
    ],
    "n": "Brazilian Fish Stew",
    "a": "BellevueMama",
    "r": "0",
    "s": 6,
    "des": "\"This super easy but hearty dish is full of flavor and absolutely delicious! It's a simplified version of a common Brazilian dish that I remember from my childhood and it's become a favorite even among my kids and I, even though we don't like fish! This can be made easily on the stovetop or in the slow cooker for a no-fail convenience meal. Use salmon in place of tilapia for a stronger fish flavor. Serve with hot rice or warm tortillas.\"",
    "ins": "Stir together the lime juice, cumin, paprika, garlic, salt, and pepper in a bowl. Add the tilapia and toss to coat. Cover and refrigerate at least 20 minutes, up to 24 hours.\nHeat the olive oil in a large pot over medium-high heat. Quickly fry the onions in the oil 1 to 2 minutes. Reduce heat to medium. Add the bell peppers, tilapia, and diced tomatoes to the pot in succeeding layers. Pour the coconut milk over the mixture. Cover the pot and simmer 15 minutes, stirring occasionally. Stir in the cilantro and continue cooking until the tilapia is completely cooked through, another 5 to 10 minutes.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "896031.jpg",
    "o": "4498399.jpg,4091155.jpg,3907001.jpg,3766074.jpg,3721665.jpg,3656625.jpg",
    "st": "allrecipes"
}