{
    "id": 19083,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "11 (2.15 ounce) milk chocolate covered caramel and nougat bars",
        "1 1/2 cups margarine",
        "2 cups white sugar",
        "4 eggs",
        "2 teaspoons vanilla extract",
        "2 1/2 cups all-purpose flour",
        "1/2 teaspoon baking soda",
        "1 cup buttermilk",
        "1/2 cup chopped walnuts",
        "2 cups confectioners' sugar"
    ],
    "nut": [
        "Calories > 821 kcal",
        "Carbs > 114.6 g",
        "Cholesterol > 68 mg",
        "Fat > 37.4 g",
        "Protein > 8.7 g",
        "Sodium > 454 mg"
    ],
    "n": "Caramel Nougat Cake V",
    "a": "Ann",
    "r": "0",
    "s": 12,
    "des": "\"Made with eleven regular milk chocolate covered caramel and nougat bars, buttermilk and baking soda.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch tube pan. Sift together the flour and  baking soda. Set aside.\nIn a medium saucepan, melt 8 candy bars with 1/2 cup margarine, stirring until smooth. Remove from heat and set aside to cool.\nIn a large bowl, cream together 1/2 cup margarine and 2 cups sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla.  Beat in the flour mixture alternately with the buttermilk, mixing just until incorporated. Stir in cooled chocolate mixture and chopped nuts.\nPour batter into prepared 10 inch tube pan. Bake in the preheated oven for 40 to 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 15 minutes, then turn out onto a wire rack and cool completely.\nTo make the Frosting:  In a medium saucepan melt remaining 3 candy bars with 1/2 cup margarine. Stir until smooth. Beat in confectioners' sugar to desired thickness.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "934586.jpg",
    "o": "",
    "st": "allrecipes"
}