{
    "id": 19087,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (18.25 ounce) package white cake mix",
        "1/4 cup instant cappuccino coffee powder",
        "1 tablespoon vegetable oil",
        "3 egg whites",
        "1 1/4 cups water",
        "1 cup shortening",
        "1 1/2 teaspoons vanilla extract",
        "4 1/2 cups confectioners' sugar",
        "4 tablespoons milk",
        "3/4 cup unsweetened cocoa powder",
        "1 tablespoon instant coffee powder",
        "1 cup hot water"
    ],
    "nut": [
        "Calories > 540 kcal",
        "Carbs > 81.6 g",
        "Cholesterol > < 1 mg",
        "Fat > 23.9 g",
        "Protein > 4.1 g",
        "Sodium > 301 mg"
    ],
    "n": "Cappuccino Cake with Mocha Frosting",
    "a": "ANGELAELAINE",
    "r": "0",
    "s": 12,
    "des": "\"A very simple cake using a white cake mix and cappuccino coffee powder. The vegetable oil has been reduced to account for the fat in the added cappuccino mix.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9 inch cake pans.\nIn a large bowl, combine cake mix and 1/4 cup cappuccino. Pour in 1 1/4 cups water, 3 egg whites and 1 tablespoon oil. Mix well, then pour batter into prepared pans.\nBake in preheated oven according to package directions until a toothpick inserted into center of cake comes out clean. Cool in pans for 10 minutes, then turn out onto wire racks and cool completely.\nTo make the Mocha Frosting:  In a large bowl, combine shortening with vanilla. Blend in half of the confectioners' sugar. Blend in 2 tablespoons milk. Repeat with remaining confectioners' sugar and 2 tablespoons milk. Mix in approximately half of the cocoa.\nDissolve the 1 tablespoon instant coffee into 1 cup of hot water. While still warm, pour two tablespoons of the coffee into the frosting mixture. Mix in remaining cocoa. Add coffee mixture, a tablespoon at a time, until desired consistency is achieved. Fill and frost cake.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "679315.jpg",
    "o": "677208.jpg,667318.jpg,581160.jpg,581158.jpg,416402.jpg,114282.jpg",
    "st": "allrecipes"
}