{
    "id": 19103,
    "old_rating": "4.08333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 (1 ounce) squares white chocolate",
        "1/2 cup hot water",
        "1 cup butter",
        "1 cup white sugar",
        "4 egg yolks",
        "1 teaspoon vanilla extract",
        "2 1/2 cups sifted all-purpose flour",
        "1 teaspoon baking soda",
        "1 cup buttermilk",
        "4 egg whites, beaten"
    ],
    "nut": [
        "Calories > 216 kcal",
        "Carbs > 24.2 g",
        "Cholesterol > 57 mg",
        "Fat > 11.9 g",
        "Protein > 3.5 g",
        "Sodium > 138 mg"
    ],
    "n": "Swiss White Chocolate Cake",
    "a": "Bubelz",
    "r": "0",
    "s": 24,
    "des": "\"This cake has won best tasting 3 years running at my local cake auction. My friends always ask me to make it for parties. You won't be disappointed! As a variation, stir in 1 cup each of coconut and chopped pecans before baking.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Sift together the flour and baking soda; set aside.\nChop the white chocolate and place it in a medium bowl. Pour the hot water over it and stir until chocolate is melted and smooth. Allow to cool to room temperature.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the egg yolks one at a time, then stir in the melted white chocolate and vanilla. Beat in the flour mixture alternately with the buttermilk, mixing just until incorporated.\nIn a large glass or metal mixing bowl, beat egg whites until stiff peaks form. Fold 1/3 of the whites into the batter, then quickly fold in remaining whites until no streaks remain.\nPour batter into prepared pan. Bake in the preheated oven for 30 to 35 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "3551713.jpg",
    "o": "",
    "st": "allrecipes"
}