{
    "id": 191329,
    "old_rating": "4.44531",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "1 bunch cilantro, finely chopped",
        "1 small onion, chopped",
        "4 cloves garlic, minced",
        "1 pinch garlic salt",
        "1 pinch onion powder",
        "salt and ground black pepper to taste",
        "4 (14.5 ounce) cans chicken broth",
        "4 large carrots, cut into 1/2 inch pieces",
        "3 stalks celery, cut into 1 inch pieces",
        "3 potatoes, cubed"
    ],
    "nut": [
        "Calories > 275 kcal",
        "Carbs > 26 g",
        "Cholesterol > 46 mg",
        "Fat > 12.1 g",
        "Protein > 15.7 g",
        "Sodium > 159 mg"
    ],
    "n": "Homemade Albondigas Soup",
    "a": "Melissa Avila",
    "r": "0",
    "s": 6,
    "des": "\"This soup reminds me of when I was young, staying home from school. My grandmother would make this for me. It is so good and flavorful. It is great for a cold rainy day, or any day you feel like it. You can substitute any of the veggies for ones you like better. My grandmother would also make Mexican rice and scoop some into my bowl to make it even better!\"",
    "ins": "Place the ground beef, 1/2 of the cilantro, 1/2 of the chopped onion, the garlic, garlic salt, and onion powder in a bowl. Sprinkle with salt and black pepper, and mix gently until combined. Form the meat mixture into golf ball-sized meatballs.\nSpray a large skillet with nonstick spray, and brown the meatballs carefully over medium-high heat; remove the meatballs and set aside (the meatballs do not need to be fully cooked; they will finish cooking in the soup). Cook and stir the remaining onion in the same skillet over medium-low heat until translucent, about 10 minutes.\nPour the chicken broth into a large pot, and stir in the onion; add the carrots, celery, and potatoes. Bring to a boil over high heat; reduce heat and simmer until potatoes are nearly tender, about 15 minutes. Add the meatballs and the remaining cilantro; simmer for 30 minutes. Season to taste with salt and black pepper.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "771104.jpg",
    "o": "4485842.jpg,4471606.jpg,4461439.jpg,4461438.jpg,4457594.jpg,4166260.jpg",
    "st": "allrecipes"
}