{
    "id": 192256,
    "old_rating": "4.73333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 whole grain baguette",
        "2 tablespoons olive oil",
        "3/4 pound Brie cheese",
        "24 oysters - shucked, rinsed and drained",
        "1/4 cup butter, melted",
        "salt and pepper to taste",
        "1 red bell pepper, cut into thin strips"
    ],
    "nut": [
        "Calories > 315 kcal",
        "Carbs > 21.7 g",
        "Cholesterol > 89 mg",
        "Fat > 16.8 g",
        "Protein > 18.8 g",
        "Sodium > 496 mg"
    ],
    "n": "Bayou Crostini",
    "a": "AZ",
    "r": "0",
    "s": 12,
    "des": "\"Broiled oysters are elevated from southern backyard fare to upscale appetizers that still call for licking your fingers afterwards. You can use plain oysters or smoked oysters in this recipe which is sure to please every oyster lover out there. This is a great brunch dish or supper appetizer and goes particularly well with champagne.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Slice the baguette into 24 rounds. Brush bread rounds lightly with olive oil. Place bread rounds on a baking sheet.\nToast the bread rounds in the preheated oven just until crisp, 5 to 8 minutes. Meanwhile, slice Brie cheese into 24 equal pieces. Remove toasted bread from oven; top each round with a slice of Brie cheese. Return the crostini to the oven to melt the cheese, about 5 minutes.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source. In an ovenproof casserole, stir together the oysters, butter, any remaining olive oil, salt, and pepper.\nBroil in the preheated oven until the oysters begin to curl at the edges, about 5 minutes. Remove the oysters; place one oyster on top of each crostini. Top the crostini with red pepper strips; serve warm.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "25 m",
    "i": "351242.jpg",
    "o": "",
    "st": "allrecipes"
}