{
    "id": 192394,
    "old_rating": "4.67568",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup milk",
        "1/2 cup margarine, at room temperature",
        "1/2 cup Greek yogurt",
        "3 1/2 cups all-purpose flour",
        "1 tablespoon salt",
        "1 tablespoon baking powder",
        "1 egg white"
    ],
    "nut": [
        "Calories > 220 kcal",
        "Carbs > 29.3 g",
        "Cholesterol > 3 mg",
        "Fat > 9 g",
        "Protein > 5.2 g",
        "Sodium > 808 mg"
    ],
    "n": "Piadina Romagnola (Italian Flat Bread)",
    "a": "Max_a_romagnolo_In_America",
    "r": "0",
    "s": 12,
    "des": "\"A flat bread from the Italian region Romagna. Great with arugula and soft cheese (Squacquerone is the one typically used) or cold cuts and a glass of Sangiovese Superiore di Romagna from Forli'. The dough can sit at 40 degrees F (4 degrees C) up to 2 days.\"",
    "ins": "Stir the milk, margarine, and yogurt together in a bowl.\nMix the flour, salt, baking powder, and egg white in a large bowl. Pour the milk mixture into the flour mixture and work the mixture together with your hands until the dough separates from the sides of the bowl, adding flour or water as needed to get the right consistency, which will be neither sticky nor dry. Cover with a damp cloth and let stand at room temperature for 30 minutes.\nTurn the dough out onto a lightly floured surface; divide into 12 pieces and roll into balls. Roll and stretch each ball  to about 1/8-inch thick and 8 inches in diameter.\nLightly oil a cast iron skillet and place over medium-low heat. Cook the dough in the hot skillet until it begins to set, 1 to 2 minutes per side. Pierce the dough with a fork 3 to 4 times while it cooks. Wrap the finished pieces in a towel until ready to serve.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "4261998.jpg",
    "o": "3619424.jpg,3619394.jpg,2949284.jpg,1126775.jpg,643265.jpg,600170.jpg",
    "st": "allrecipes"
}