{
    "id": 192524,
    "old_rating": "4.27273",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon vegetable oil",
        "3 pounds chicken pieces",
        "2 whole carrots",
        "2 stalks celery, cut in half",
        "1 large whole onion, peeled",
        "salt and pepper, to taste",
        "5 cloves garlic, crushed",
        "1 (6 ounce) package long grain and wild rice mix (such as Uncle Ben's Â® Original)",
        "3 carrots, chopped",
        "1 1/2 tablespoons lemon juice",
        "chopped fresh parsley"
    ],
    "nut": [
        "Calories > 411 kcal",
        "Carbs > 24.3 g",
        "Cholesterol > 100 mg",
        "Fat > 18.7 g",
        "Protein > 35.4 g",
        "Sodium > 139 mg"
    ],
    "n": "My Favorite Chicken and Wild Rice Soup",
    "a": "Mel",
    "r": "0",
    "s": 6,
    "des": "\"This is my favorite chicken and wild rice soup. It is a basic recipe and you can customize it to your taste easily. I like the flavor from the wild rice seasoning.\"",
    "ins": "Heat oil in a large pot over medium heat; add the chicken, whole carrots, celery, and whole onion.  Cook until the chicken is browned, about 10 minutes. Season with salt and pepper. Stir in the crushed garlic cloves, and cook until soft, about 1 to 2 minutes. Pour enough water into the pot to cover the chicken and vegetables. Simmer for 2 to 3 hours.  Add water as necessary.\nWhile the soup is simmering, cook the rice according to package instructions. Refrigerate when done.\nRemoved cooked chicken from the pot to cool. Strain the broth, discarding cooked vegetables.  Shred chicken and return to the pot along with the broth; stir in chopped carrots and lemon juice. Bring soup to a simmer, and cook until the carrots are soft, about 10 minutes. Stir in the cooked rice and chopped parsley. Heat until hot, about 5 minutes. Season with additional salt and pepper, if needed.",
    "pt": "20 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "2528699.jpg",
    "o": "",
    "st": "allrecipes"
}