{
    "id": 192610,
    "old_rating": "3.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "24 eggs",
        "2 onions, sliced",
        "2 cups balsamic vinegar",
        "4 cups water",
        "4 tablespoons white sugar",
        "20 cloves garlic, mashed into a paste",
        "35 peppercorns",
        "1/2 cup beet juice (see Cook's Note)",
        "6 fresh green and red cayenne chiles, halved lengthwise"
    ],
    "nut": [
        "Calories > 109 kcal",
        "Carbs > 9.6 g",
        "Cholesterol > 185 mg",
        "Fat > 5.1 g",
        "Protein > 7 g",
        "Sodium > 167 mg"
    ],
    "n": "Lance's Balsamic Pickled Eggs",
    "a": "Lanceb33",
    "r": "0",
    "s": 24,
    "des": "\"A great (but secret) recipe for pickled eggs based upon the tradition of bluenose recipes for pickled ears from frost-bitten travelers who, due to frostbite, have lost their ears and donated them to a local Alaskan bar/pub in the area as a gag, but still available to this day (03/04/2009) as an edible bar treat to those in the know. Don't worry, these are just pickled eggs with some East Tennessee (Cocke County) tradition added. Note:  These can provide for a very foul smell from the consumer, so, provider beware!!!\"",
    "ins": "Place the eggs into a large pot cover with water by 1 inch. Cover the saucepan and bring the water to a boil over high heat; remove from the heat and let the eggs stand in the hot water for 15 minutes. Pour out the hot water and cool completely under cold running water; peel and place in a glass jar large enough to hold them.\nCombine the onions, balsamic vinegar, water, sugar, garlic, peppercorns, beet juice, and cayenne chiles in a deep saucepan over high heat; bring to a boil and immediately remove from heat. Allow the mixture to cool to room temperature. Pour into the glass jar with the eggs. Seal the jar with the lid. Refrigerate 4 to 5 days before serving.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "4 d ",
    "i": "3722658.jpg",
    "o": "",
    "st": "allrecipes"
}