{
    "id": 19316,
    "old_rating": "4.65625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound beef brisket, chopped",
        "2 eggs",
        "3 slices white bread",
        "1/2 cup grated Romano cheese",
        "1 pinch dried parsley",
        "salt and pepper to taste",
        "3 tablespoons olive oil",
        "4 onion, chopped",
        "6 cloves garlic, chopped",
        "12 (3.5 ounce) links sweet Italian sausage",
        "1 1/2 pounds cubed beef brisket",
        "1/2 pound pork neck bones",
        "4 (6 ounce) cans tomato paste",
        "3 (28 ounce) cans crushed tomatoes",
        "1/2 cup red wine",
        "4 bay leaves",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon dried parsley",
        "1 teaspoon dried basil",
        "salt and pepper to taste",
        "3 (16 ounce) packages dry pasta"
    ],
    "nut": [
        "Calories > 639 kcal",
        "Carbs > 58.5 g",
        "Cholesterol > 95 mg",
        "Fat > 31.9 g",
        "Protein > 29.1 g",
        "Sodium > 841 mg"
    ],
    "n": "Family Sicilian Sauce and Meatballs",
    "a": "PETEIYC",
    "r": "0",
    "s": 24,
    "des": "\"My Mother's family originally came from Sicily and every family member makes his or her own version - this version came most recently via Brooklyn.  Use your favorite meat and Italian red wine for this sauce and serve with your favorite pasta. This also is a great pizza sauce if you leave out about half of the meat.  If there are any leftovers, they freeze very well. MANGIA!\"",
    "ins": "To make the meatballs, combine chopped meat, eggs, bread, Romano cheese, parsley and salt and pepper to taste in a medium bowl. Form golf ball-sized meatballs; place into freezer to firm up.\nTo make sauce, heat olive oil in a large pot on medium heat. Saute onion, garlic and fry links of sausage.\nMeanwhile, in a large skillet over medium heat, brown beef chunks and pork neck bones; reserve.\nWhen onions and garlic are done, turn heat down to low. Add tomato paste; stir and simmer for 10 minutes. Add the browned beef and pork, crushed tomatoes, wine, bay leaves, cinnamon, parsley, basil and salt and pepper to taste; stir.\nIn a large skillet over medium heat, brown meatballs; reserve.\nSimmer sauce over low heat for 3 to 4 hours, add meatballs and simmer for 1 hour. Meanwhile, bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Cover pasta with sauce and meatballs, serve.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "619718.jpg",
    "o": "",
    "st": "allrecipes"
}