{
    "id": 19320,
    "old_rating": "4.39286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup olive oil, or as needed",
        "1 pound lean ground beef",
        "1 onion, thinly sliced",
        "1/4 teaspoon dried sage",
        "1/4 teaspoon dried rosemary",
        "salt to taste",
        "1/2 cup white wine",
        "4 tablespoons butter",
        "4 tablespoons all-purpose flour",
        "2 cups milk",
        "2 egg yolks, lightly beaten",
        "12 ounces mozzarella cheese, cubed",
        "For the Tomato Sauce:",
        "2 tablespoons butter",
        "1 onion, thinly sliced",
        "1/2 cup white wine",
        "2 (14.5 ounce) cans stewed tomatoes",
        "salt and pepper to taste",
        "12 cannelloni pasta shells"
    ],
    "nut": [
        "Calories > 890 kcal",
        "Carbs > 47.4 g",
        "Cholesterol > 198 mg",
        "Fat > 58.1 g",
        "Protein > 37.4 g",
        "Sodium > 826 mg"
    ],
    "n": "Italian Baked Cannelloni",
    "a": "MARBALET",
    "r": "0",
    "s": 6,
    "des": "\"This is a very special old Italian dish that warms your stomach, as well as your heart. It is a labor of love, but worth every bite! You can also use half ground beef, half ground pork in the filling.\"",
    "ins": "In a large skillet over medium heat, warm oil and saute ground beef with the onion, sage and rosemary; cook until meat is evenly browned and crumbly. Drain fat. Add salt and 1/2 cup white wine; cook until wine is evaporated. Set mixture aside.\nTo make the Bechamel sauce: Melt 4 tablespoons butter in a medium saucepan over medium heat. Add flour and stir until well incorporated. Stir in milk and bring to a slow boil until mixture thickens. Remove sauce from the heat. In a steady stream, pour the bechamel in to the beaten egg yolks, whisking constantly. Stir the sauce into the meat mixture. Stir in the cubed mozzarella.\nIn a medium saucepan over medium-low heat, melt 2 tablespoons butter and saute onion until soft and translucent. Add 1/2 cup white wine and let it cook down to evaporate; add stewed tomatoes and salt. Mix well; simmer for 15 minutes.\nBring a large pot of lightly salted water to a boil. Add pasta, a few at a time, and cook for 8 to 10 minutes or until al dente; using a slotted spoon, remove immediately to a pot filled with cold water. Lift pasta out with slotted spoon and arrange on a flat surface.\nPreheat oven to 400 degrees F (200 degrees C). Lightly grease a 9x13-inch baking dish.\nSpoon a line of filling into each shell, starting from one end and using your finger to push the filling inside of each shell. Place cannelloni in prepared baking dish and cover with tomato sauce mixture.\nBake in preheated oven for 15 minutes or until heated through; when finished baking, allow to stand for 5 minutes and serve.",
    "pt": "45 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "238445.jpg",
    "o": "",
    "st": "allrecipes"
}