{
    "id": 19394,
    "old_rating": "4.44872",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 ounces lasagna noodles",
        "1 pound lean ground beef",
        "2/3 (28 ounce) jar spaghetti sauce",
        "2 pounds ricotta cheese",
        "1/2 cup grated Romano cheese",
        "1 egg",
        "1/4 cup dried basil",
        "1 clove garlic, pressed",
        "1 (8 ounce) package sliced pepperoni sausage",
        "8 ounces mozzarella cheese, shredded"
    ],
    "nut": [
        "Calories > 921 kcal",
        "Carbs > 50.4 g",
        "Cholesterol > 282 mg",
        "Fat > 52.2 g",
        "Protein > 61.1 g",
        "Sodium > 1566 mg"
    ],
    "n": "Yummy Lasagna",
    "a": "Savery",
    "r": "0",
    "s": 6,
    "des": "\"Yummy and quick lasagna with pepperoni!  Use the smoothest spaghetti sauce for best results.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn large skillet over medium-high heat, cook beef until brown; drain.  In small saucepan, heat spaghetti sauce.\nIn a medium bowl, stir together ricotta, Romano, egg, basil and garlic.\nCoat the bottom of a 9 x 13 baking dish with a thin layer of spaghetti sauce.  Place 3 or 4 noodles, overlapping edges, over sauce.  Spread half of ricotta mixture over noodles.  Cover ricotta with half of browned beef, half of pepperoni slices, and 1/4 of mozzarella cheese.  Repeat sauce, noodle, ricotta, meat and cheese layers.  Layer sauce and noodles again, and pour remaining sauce over all, being sure to cover the edges.  Top with remaining mozzarella.\nCover pan with foil and pierce foil 3 or 4 times with fork to ventilate.  Bake 45 minutes, remove foil, and bake 15 minutes more to brown the top.  Let stand 10 minutes before serving.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "37890.jpg",
    "o": "3781084.jpg,2616049.jpg,2610321.jpg,1905343.jpg,1339757.jpg,1006696.jpg",
    "st": "allrecipes"
}