{
    "id": 19422,
    "old_rating": "4.22434",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 cup dry bread crumbs",
        "2 tablespoons melted butter",
        "8 ounces macaroni",
        "2 tablespoons butter",
        "1 small onion, minced",
        "1 tablespoon all-purpose flour",
        "salt and pepper to taste",
        "1/4 teaspoon dry mustard",
        "1 1/2 cups milk",
        "2 cups shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 461 kcal",
        "Carbs > 43.9 g",
        "Cholesterol > 65 mg",
        "Fat > 23 g",
        "Protein > 19 g",
        "Sodium > 414 mg"
    ],
    "n": "Macaroni and Cheese V",
    "a": "LEACH",
    "r": "0",
    "s": 6,
    "des": "\"This is my mom's recipe for macaroni and cheese with a bread crumb topping and a little dry mustard for zip.  It is great!!  You can make it more or less cheesy, depends on your taste.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart casserole dish. Place the bread crumbs into a small bowl and mix well with the melted butter; set aside.\nBring a large pot of lightly salted water to a boil. Add macaroni and cook for 8 to 10 minutes or until al dente; drain, then place into prepared casserole dish.\nWhile the pasta is cooking, melt 2 tablespoons butter in a saucepan over medium heat. Stir in the minced onion and cook until the onion softens and turns translucent, about 5 minutes.\nStir in the flour, pepper, salt, and dry mustard until incorporated, then pour in the milk and bring to a simmer. Simmer, stirring constantly until the milk has thickened, about 10 minutes. Take the milk off of the heat and stir in the Cheddar cheese until melted. Pour cheese sauce over the macaroni, then sprinkle evenly with buttered bread crumbs.\nBake until the top is golden and bubbly, about 20 minutes.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "87013.jpg",
    "o": "2876842.jpg,2825411.jpg,2298319.jpg,1766484.jpg,1053655.jpg,440616.jpg",
    "st": "allrecipes"
}