{
    "id": 19568,
    "old_rating": "4.14286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "1 egg, beaten",
        "1 cup lukewarm water",
        "1 teaspoon white sugar",
        "1 teaspoon lard, melted",
        "1 pinch salt",
        "1 1/2 cups butter, melted",
        "1 cup toasted bread crumbs",
        "1 cup ground walnuts",
        "3 1/2 pounds apples - peeled, cored and thinly sliced",
        "3/4 cup raisins",
        "1 teaspoon ground cinnamon",
        "1 3/4 cups white sugar"
    ],
    "nut": [
        "Calories > 620 kcal",
        "Carbs > 87.4 g",
        "Cholesterol > 77 mg",
        "Fat > 29.2 g",
        "Protein > 6.9 g",
        "Sodium > 238 mg"
    ],
    "n": "Apple Strudel II",
    "a": "June",
    "r": "0",
    "s": 12,
    "des": "\"Homemade dough and filling make this apple strudel especially fun and delicious!\"",
    "ins": "Sift all-purpose flour into a large bowl. Mix in egg, water, white sugar, lard and salt. Knead until soft and smooth. Lightly brush with approximately 1 tablespoon butter. Cover with a towel and set aside 1 hour.\nMix bread crumbs and 3/4 cup butter in a medium bowl. Mix in ground walnuts, apples, raisins, cinnamon and sugar.\nPreheat oven to 375  degrees F (190 degrees C). Lightly butter a medium baking dish.\nOn a large, lightly floured surface stretch and roll the dough into a large, very thin rectangle. Cut away thick edges. Sprinkle with approximately 1/2 cup melted butter. Spread bread crumb mixture across the dough, leaving a two inch border on all sides. Fold one end of the dough over the filling, then roll dough to form strudel. Cut so that it will fit the baking dish.\nPlace strudel in baking dish and brush with remaining butter. Bake in the preheated oven 1 hour, until surface is golden brown and apples are tender.",
    "pt": "1 h ",
    "ct": "1 h",
    "tt": "2 h ",
    "i": "1358.jpg",
    "o": "",
    "st": "allrecipes"
}