{
    "id": 19589,
    "old_rating": "4.07143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "2 cups thinly sliced celery",
        "1 1/2 cups sliced green onion",
        "1 1/2 pounds vegetarian hot dogs",
        "2 eggs, beaten",
        "1 1/2 cups milk",
        "2 teaspoons rubbed sage",
        "1/4 teaspoon ground black pepper",
        "2 (8.5 ounce) packages dry corn bread mix",
        "2 cups shredded Cheddar cheese, divided"
    ],
    "nut": [
        "Calories > 396 kcal",
        "Carbs > 34.5 g",
        "Cholesterol > 51 mg",
        "Fat > 19.4 g",
        "Protein > 21.5 g",
        "Sodium > 1054 mg"
    ],
    "n": "Corn Dog Casserole",
    "a": "COURTNEYSUNSHINE",
    "r": "0",
    "s": 12,
    "des": "\"This casserole tastes just like a corn dog, only better, thanks to the addition of cheese, celery, green onions, and spices. This is a very tasty, kid-friendly dish. Since we became vegetarians, we use veggie hot dogs instead of meat in the recipe. The recipe makes 12 servings, but you can cut the recipe down to the size you need.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease a shallow 3 quart baking dish.\nIn a large skillet over medium heat, melt butter, then saute celery for 5 minutes. Stir in green onions, and saute an additional 5 minutes. Place in a large bowl and set aside.\nCut hot dogs lengthwise into quarters, then cut into thirds. In the same skillet, saute hot dogs for 5 minutes, until lightly browned. Mix hot dogs into celery and onions. Set aside 1 cup of this mixture.\nIn a medium bowl, combine eggs, milk, sage, pepper, and corn bread mix. Stir well to combine, then stir into remaining hot dog mixture. Mix in 1 1/2 cups cheese. Spread mixture into prepared baking dish. Top with reserved hot dog mixture and remaining 1/2 cup cheese.\nBake uncovered in preheated oven for 30 minutes, until golden brown.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "78421.jpg",
    "o": "2616982.jpg,1127143.jpg,547126.jpg,313188.jpg,145202.jpg,91406.jpg",
    "st": "allrecipes"
}