{
    "id": 195942,
    "old_rating": "4.44118",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 pound orzo pasta",
        "2 tablespoons olive oil",
        "1 yellow onion, chopped",
        "2 large cloves garlic, chopped",
        "1 1/2 pounds ground lamb",
        "4 1/2 teaspoons dried oregano",
        "1 tablespoon dried basil",
        "salt and pepper to taste",
        "1 (16 ounce) package frozen chopped spinach, thawed and drained",
        "2 tomatoes, diced",
        "1 (6 ounce) can tomato paste",
        "8 ounces crumbled feta cheese",
        "6 large green or red bell peppers - tops removed and seeded",
        "olive oil"
    ],
    "nut": [
        "Calories > 639 kcal",
        "Carbs > 51 g",
        "Cholesterol > 109 mg",
        "Fat > 34 g",
        "Protein > 36.2 g",
        "Sodium > 775 mg"
    ],
    "n": "Tina's Greek Stuffed Peppers",
    "a": "Tina G.",
    "r": "0",
    "s": 6,
    "des": "\"I took my some of my favorite Greek ingredients to make these delicious stuffed bell peppers. The ground lamb can be replaced with ground beef or turkey if you wish.\"",
    "ins": "Bring a pot of lightly salted water to a boil over high heat. Cook the orzo in the boiling water uncovered, stirring occasionally, until tender yet firm to the bite, about 8 minutes. Drain.\nHeat 2 tablespoons olive oil in a large skillet over medium high heat; cook and stir the onion and garlic in the hot oil until fragrant, about 1 minute. Crumble the ground lamb into the mixture; season with the oregano, basil, and salt and pepper. Continue cooking until the lamb is completely browned, 7 to 10 minutes. Remove from heat. Stir the orzo, spinach, tomatoes, tomato paste, and feta cheese into the lamb mixture until evenly incorporated.\nPreheat oven to 400 degrees F (200 degrees C).\nEvenly rub the outside of the bell peppers and the tops with 2 tablespoons olive oil. Season with salt and pepper. Arrange in a baking dish large enough to accommodate all of them standing upright. Fill the peppers with the lamb mixture and replace the tops.\nBake in the preheated oven until the peppers begin to brown, 30 to 40 minutes.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "1103876.jpg",
    "o": "3945081.jpg,3943979.jpg,1937987.jpg,913664.jpg,857853.jpg,789298.jpg",
    "st": "allrecipes"
}