{
    "id": 19713,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 cups uncooked jasmine rice",
        "1 1/2 cups water",
        "2 cups dried shiitake mushrooms",
        "3 tablespoons oyster sauce, divided",
        "2 tablespoons soy sauce",
        "2 tablespoons cornstarch",
        "1 teaspoon salt",
        "1 tablespoon white sugar",
        "1 tablespoon red wine",
        "3 links lop chong (Chinese-style sausage)",
        "1 tablespoon sesame oil",
        "1 pound fresh shrimp - peeled, deveined, and diced",
        "1/4 pound cooked pork link sausage, diced",
        "1 bunch green onions, diced",
        "1 cup fresh water chestnuts, peeled and diced",
        "1 1/2 cups frozen green peas"
    ],
    "nut": [
        "Calories > 665 kcal",
        "Carbs > 100.9 g",
        "Cholesterol > 98 mg",
        "Fat > 16.9 g",
        "Protein > 31.8 g",
        "Sodium > 1145 mg"
    ],
    "n": "Chinese New Year Sweet Rice",
    "a": "SEMANO",
    "r": "0",
    "s": 8,
    "des": "\"This is a traditional Chinese sweet rice recipe that is usually served for the Chinese New Year. This recipe was handed down to me from my dad who liked to eat this alone as a main dish, so it's a little heartier than most other sweet rice recipes. For those of you who know what Chinese sweet rice is, this is the most awesome tasting recipe yet!\"",
    "ins": "Place the jasmine rice and water in a medium saucepan. Cover and let stand at least 1 hour, until the water has been absorbed. Transfer to a steamer basket and fluff with a fork. Steam 20 minutes, or until tender.\nPlace the dried mushrooms in a bowl with enough hot water to cover. Soak 30 minutes or until tender. Drain, remove stems, and slice.\nIn a small bowl, mix 1 tablespoon oyster sauce, soy sauce, cornstarch, salt, sugar, and red wine. Place mushrooms in the bowl, and marinate at least 15 minutes.\nIn the steamer basket, steam the mushrooms and Chinese-style sausage 15 to 20 minutes. Remove from heat and chop.\nHeat the sesame oil in a large wok over high heat. Toss in the shrimp and cook 1 to 2 minutes, until nearly opaque. Stir in the mushrooms, Chinese-style sausage, pork sausage, green onion, and water chestnuts. Cook and stir about 2 minutes. Mix in the rice and remaining oyster sauce. Cook another 3 to 4 minutes. Remove from heat and toss in the peas. Serve when the peas are heated through.",
    "pt": "45 m",
    "ct": "1 h",
    "tt": "3 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}