{
    "id": 197394,
    "old_rating": "4.30986",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups vegetable oil for frying",
        "3 eggs",
        "1/2 cup cornstarch",
        "1 pound skinless, boneless chicken thighs, cut into bite-sized pieces",
        "1 tablespoon vegetable oil",
        "5 dried red pepper pods",
        "1 1/2 tablespoons rice vinegar",
        "2 tablespoons rice wine",
        "3 tablespoons white sugar",
        "3 tablespoons soy sauce",
        "2 teaspoons cornstarch",
        "3 green onions, thinly sliced"
    ],
    "nut": [
        "Calories > 865 kcal",
        "Carbs > 61.7 g",
        "Cholesterol > 277 mg",
        "Fat > 52.6 g",
        "Protein > 38.4 g",
        "Sodium > 1208 mg"
    ],
    "n": "Joe's General Tso's Chicken",
    "a": "joe harrington",
    "r": "0",
    "s": 3,
    "des": "\"General Tso's Chicken is a perfect combination of sweet and spicy flavors. It is found in a lot of Chinese buffets and take-out places. You can try substituting gin for the rice wine if you'd like.\"",
    "ins": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nBeat the eggs in a mixing bowl until smooth. Stir in 1/2 cup of cornstarch until no lumps remain, then mix in the chicken until evenly coated in batter.\nIn batches, carefully drop the chicken cubes into the hot oil one by one, cooking until the chicken turns golden brown and begins to float, about 3 minutes. Drain on a paper towel-lined plate.\nHeat the vegetable oil in a wok or large skillet over high heat. Stir in the dried peppers, and cook for about 30 seconds until the color brightens. Add the chicken, and cook for a few minutes until the chicken turns a deep, golden brown. Stir the vinegar, rice wine, sugar, soy sauce, and 2 teaspoons of cornstarch together in a small bowl. Pour into the wok, and boil until the sauce thickens and is no longer cloudy, about 2 minutes. Garnish with green onions to serve.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "3557911.jpg",
    "o": "3557911.jpg,3376638.jpg,3338991.jpg,2935494.jpg,2545595.jpg,2175523.jpg",
    "st": "allrecipes"
}