{
    "id": 197470,
    "old_rating": "4.125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup uncooked white rice",
        "2 cups water",
        "1 tablespoon olive oil",
        "3 cloves garlic, minced",
        "1 (1/2 inch) piece fresh ginger, minced",
        "1/2 onion, coarsely chopped",
        "1 cup kim chee",
        "1/2 cup sliced cucumber",
        "1/4 cup sliced carrots",
        "2 tablespoons soy sauce",
        "2 tablespoons rice vinegar",
        "salt and pepper to taste",
        "1 tablespoon Korean chile powder, or to taste",
        "1 tablespoon water, or as needed",
        "1 (5 ounce) can tuna, drained"
    ],
    "nut": [
        "Calories > 538 kcal",
        "Carbs > 87.5 g",
        "Cholesterol > 19 mg",
        "Fat > 8.8 g",
        "Protein > 26.4 g",
        "Sodium > 1574 mg"
    ],
    "n": "Chompchae Deopbap (Korean Spicy Tuna and Rice)",
    "a": "somthinclever",
    "r": "0",
    "s": 2,
    "des": "\"This is my favorite Korean dish and I eat it weekly at restaurants here in South Korea. It uses simple, cheap ingredients to create a spicy and filling dinner. If you like, you can add a fried egg to the side for extra protein, and some shredded sea weed (gim). Sprinkle the top with a few sesame seeds.\"",
    "ins": "Bring the rice and 2 cups of water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes.\nHeat the olive oil in a skillet over medium heat. Stir in the garlic, ginger, and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the kim chee, cucumber, and carrot. Pour in the soy sauce and rice vinegar. Season with salt, pepper, and chile powder. If the mixture becomes to thick, add 1 tablespoon of water. Gently stir in the tuna and continue cooking until the fish is heated through. Serve with rice.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "50 m",
    "i": "819527.jpg",
    "o": "",
    "st": "allrecipes"
}