{
    "id": 198637,
    "old_rating": "3.69231",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package fettuccine",
        "3 tablespoons olive oil",
        "1 teaspoon cumin seeds",
        "1 large onion, chopped",
        "4 cloves garlic, crushed",
        "2 skinless, boneless chicken breasts, cut into cubes",
        "2 tablespoons curry powder, divided",
        "1 (14 ounce) can diced tomatoes",
        "2 tablespoons tomato paste"
    ],
    "nut": [
        "Calories > 668 kcal",
        "Carbs > 99.1 g",
        "Cholesterol > 35 mg",
        "Fat > 15.2 g",
        "Protein > 31.4 g",
        "Sodium > 258 mg"
    ],
    "n": "Fettuccine Bombay",
    "a": "Bill Ligertwood",
    "r": "0",
    "s": 4,
    "des": "\"A delicious variation on the usual tomato sauce. Italy meets India. Use a good quality curry powder. I find that 1 tablespoon of regular curry and 1 tablespoon of Malaysian curry powder tastes great. Most Asian markets carry the Malaysian Powder and I like it because it has some heat to it. You could also add chile powder or chiles if you want it 3-alarm spicy.\"",
    "ins": "Bring a large pot of lightly-salted water to a rolling boil over high heat; add the fettuccine and return to a boil. Cook uncovered until the pasta has cooked through, but is still firm to the bite, about 8 minutes; drain.\nHeat the olive oil in a large skillet or wok over medium-high heat. Fry the cumin seeds in the hot oil until they begin to pop, 2 to 3 minutes. Cook and stir the onion and garlic in the oil until lightly browned, about 5 minutes. Add the chicken and continue cooking until the chicken is cooked through, 4 to 5 minutes. Season with 1 tablespoon curry powder; cook and stir another 3 to 4 minutes. Pour the diced tomatoes over the mixture and reduce heat to low. Stir in the tomato paste and remaining 1 tablespoon curry powder. Simmer 15 minutes.\nStir the cooked pasta into the sauce to coat. Simmer 2 to 5 minutes, until pasta is reheated.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}