{
    "id": 198758,
    "old_rating": "4.47794",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 tablespoons olive oil",
        "3 pounds skinless, boneless chicken breast halves - cut into 1 inch pieces",
        "1 cup water",
        "1 cup packed light brown sugar",
        "3/4 cup apple-grape-cherry juice",
        "2/3 cup soy sauce",
        "1/4 cup ketchup",
        "1/4 cup peach-flavored bourbon liqueur (such as Southern Comfort Â®)",
        "2 tablespoons apple cider vinegar",
        "2 cloves garlic, minced",
        "1 tablespoon dried minced onion",
        "3/4 teaspoon crushed red pepper flakes, or to taste",
        "1/2 teaspoon ground ginger",
        "1/4 cup apple-grape-cherry juice",
        "2 tablespoons cornstarch"
    ],
    "nut": [
        "Calories > 417 kcal",
        "Carbs > 36.7 g",
        "Cholesterol > 97 mg",
        "Fat > 10.9 g",
        "Protein > 37.1 g",
        "Sodium > 1382 mg"
    ],
    "n": "Best Bourbon Chicken",
    "a": "Rikster67",
    "r": "0",
    "s": 8,
    "des": "\"Bourbon Chicken is traditionally a Southern dish, and after moving to Pennsylvania from Oklahoma, I really missed this. I searched for a recipe I liked, but I couldn't find one, so this is my own delicious version, spiced up with ginger, fruit juice, red pepper, and a little Southern Comfort! Serve over rice.\n\"",
    "ins": "Heat the oil in a large heavy pan or Dutch oven, and brown the chicken pieces until lightly golden on all sides, about 10 minutes. Transfer the chicken to a bowl.\nIn the same dutch oven, whisk the water, brown sugar, 3/4 cup of fruit juice cocktail, soy sauce, ketchup, bourbon liqueur, apple cider vinegar, garlic, dried onion, red pepper flakes, and ground ginger into the Dutch oven. Bring the sauce to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon.\nStir the chicken back into the sauce, and bring to a full boil over medium-high heat. Reduce the heat to medium-low, and simmer until the sauce is reduced and thickened and the chicken pieces are no longer pink in the middle, about 20 minutes.\nRemove the chicken pieces to a bowl with a slotted spoon. Stir together 1/4 cup of fruit juice cocktail with the cornstarch until smooth, and whisk the cornstarch mixture into the sauce, stirring constantly to avoid lumps. Bring the sauce back to a simmer, let thicken for about 1 minute, and return the chicken pieces to the sauce. Stir to combine, and serve.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "384691.jpg",
    "o": "4507647.jpg,4497355.jpg,4486384.jpg,4470085.jpg,4289324.jpg,3930160.jpg",
    "st": "allrecipes"
}