{
    "id": 19883,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups white sugar",
        "1/4 cup light corn syrup",
        "1/2 cup water",
        "1 pinch salt",
        "2 egg whites",
        "2/3 cup almonds",
        "35 caramels",
        "2 tablespoons water",
        "24 ounces milk chocolate chips"
    ],
    "nut": [
        "Calories > 521 kcal",
        "Carbs > 82.7 g",
        "Cholesterol > 18 mg",
        "Fat > 21.5 g",
        "Protein > 6.3 g",
        "Sodium > 181 mg"
    ],
    "n": "Planet Mars Almond Bars",
    "a": "SAUNDRA",
    "r": "0",
    "s": 14,
    "des": "\"Homemade caramel, almond, nougat bars that melt in your mouth!\"",
    "ins": "In a medium saucepan, combine sugar, corn syrup and 1/2 cup water.  Bring to a boil and add salt.  Heat to 270 to 290 degrees F (132 to 143 degrees C), or until a small amount of syrup dropped into cold water forms hard but pliable threads.\nWhile the syrup is cooking, beat the egg whites in the metal bowl of an electric mixer until stiff peaks form.  When the syrup is ready, set the mixer to low speed, remove the syrup from the heat, and pour it into the egg whites in a thin stream, blending continuously.  Continue to mix until the nougat begins to thicken to the consistency of a soft dough, about 20 minutes. Lightly grease a 9x9 inch baking dish.  Mix in almonds and press nougat into prepared dish and chill in refrigerator until firm, about 30 minutes.\nIn a small saucepan over low heat, melt the caramels with 2 tablespoons water.  Pour melted caramel over nougat.  Chill in refrigerator 30 minutes.\nCut the chilled candy into 14 oblong bars with a sharp knife.  In a microwave-safe bowl, microwave chocolate until melted. Stir occasionally until chocolate is smooth.   Dip bars into melted chocolate, let cool 2 hours on wire rack or waxed paper.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "3 h ",
    "i": "1019267.jpg",
    "o": "",
    "st": "allrecipes"
}