{
    "id": 19898,
    "old_rating": "4.52381",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (17.5 ounce) package frozen puff pastry sheets, thawed",
        "1/2 cup chopped walnuts",
        "1 cup chopped pecans",
        "1 cup chopped hazelnuts",
        "1 cup raisins",
        "1 cup flaked coconut",
        "1 1/4 cups white sugar, divided",
        "4 cups milk",
        "1/2 cup heavy cream"
    ],
    "nut": [
        "Calories > 934 kcal",
        "Carbs > 87.4 g",
        "Cholesterol > 30 mg",
        "Fat > 62.1 g",
        "Protein > 14.7 g",
        "Sodium > 215 mg"
    ],
    "n": "Om Ali",
    "a": "NANCY GIRGIS",
    "r": "0",
    "s": 8,
    "des": "\"This Egyptian dessert contains phyllo dough or puff pastry, milk and nuts. Use any kind of nuts that you would like and eat it with a spoon. Legend has it that Om Ali was the first wife of the sultan Ezz El Din Aybek. When the sultan died, his second wife had a dispute with Om Ali, resulting in the second wife's death. To celebrate, Om Ali made this dessert and distributed it among the people of the land.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking dish.\nPlace the pastry sheets in the baking dish and place the dish in the oven. Watch it closely. When the top layer  turns crunchy and golden, remove it from the oven. Continue until all the sheets are cooked.\nPreheat the oven's broiler.\nIn a bowl, combine walnuts, pecans, hazelnuts, raisins, coconut and 1/4 cup sugar. Break cooked pastry into pieces and stir into nut mixture. Spread mixture evenly in 9x13-inch dish.\nBring milk and 1/2 cup sugar to a boil in a medium saucepan over medium heat. Pour over nut mixture.\nBeat the heavy cream with the remaining 1/2 cup sugar until stiff peaks form. Spread evenly over nut mixture in dish.\nPlace dessert under oven broiler until top is golden brown, about 10 minutes. Serve hot.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "1101880.jpg",
    "o": "",
    "st": "allrecipes"
}