{
    "id": 19893,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "CIGARS",
        "2 cups sifted confectioners' sugar",
        "1 1/4 cups sifted all-purpose flour",
        "1/8 teaspoon salt",
        "5/8 cup butter, melted and cooled",
        "1 vanilla bean, split and scraped",
        "6 egg whites, room temperature",
        "1 tablespoon heavy cream",
        "1 1/2 ounces bittersweet chocolate, grated",
        "COFFEE CREAM FILLING",
        "1/4 cup coffee flavored liqueur",
        "1 1/2 teaspoons instant espresso coffee powder",
        "2 1/2 cups heavy cream",
        "1/4 cup confectioners' sugar",
        "1 1/2 ounces bittersweet chocolate, grated"
    ],
    "nut": [
        "Calories > 117 kcal",
        "Carbs > 10.5 g",
        "Cholesterol > 24 mg",
        "Fat > 7.7 g",
        "Protein > 1.2 g",
        "Sodium > 35 mg"
    ],
    "n": "Mocha Cigars with Coffee Cream",
    "a": "KITTYCATGRL",
    "r": "0",
    "s": 48,
    "des": "\"Looks like cigars, but delicious and tasty.  Have a coffee cream inside and chocolate dipped on each end.  Hope you enjoy!\"",
    "ins": "In a large bowl, mix 2 cups confectioners' sugar, flour and salt.  Make a well in the center and set aside.\nIn another bowl, combine melted butter and vanilla scrapings.  Pour vanilla butter, egg whites and 1 tablespoon cream into well of dry ingredients.  Mix until smooth.  Fold in 1 1/2 ounces grated chocolate.  Chill in refrigerator 2 hours or overnight.\nPreheat oven to 400 degrees F (200 degrees C).  Line a baking sheet with waxed paper.\nMake a stencil by using a utility knife to cut a 4 1/2 inch (11.5 centimeter) circle in the center of a flexible plastic lid.  Place the stencil on the baking sheet and spread 2 teaspoons of batter inside circle; remove stencil.  Make 3 circles on a baking sheet.\nBake in preheated oven 2 minutes, rotate pan and bake 2 minutes more, until golden.  Working quickly, remove cookie from tray with a spatula and roll around the handle of a wooden spoon.  Place rolled cookies on wire rack to cool completely.  If cookies harden before rolling, return to oven for 30 seconds to soften.  Repeat to use all remaining batter.\nTo make coffee cream:  Beat together coffee liqueur and espresso powder until powder is dissolved.  Beat in 2 1/2 cups cream and 1/4 cup confectioners' sugar until soft peaks form.  Refrigerate 15 minutes.\nFill cooled cookies with coffee cream using a pastry bag fitted with a 3/8 inch round tip.  Dip each end of filled cookies in grated chocolate.  Serve at once, or store in an airtight container up to 3 days.",
    "pt": "45 m",
    "ct": "1 h ",
    "tt": "4 h ",
    "i": "1958621.jpg",
    "o": "",
    "st": "allrecipes"
}