{
    "id": 199255,
    "old_rating": "4.32308",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 1/2 ounces dried Thai-style rice noodles, wide (such as Chantaboon Rice Noodles)",
        "1 1/2 teaspoons olive oil",
        "2 cloves garlic, minced",
        "1/2 teaspoon thick soy sauce",
        "2 teaspoons white sugar",
        "1 1/2 teaspoons olive oil",
        "2 cloves garlic, minced",
        "1/2 pound pork (any cut), thinly sliced",
        "1 serrano pepper, minced, or more to taste",
        "30 fresh basil leaves, chopped",
        "1/2 teaspoon thick soy sauce",
        "1 teaspoon white sugar",
        "1 teaspoon salt",
        "1/2 cup bean sprouts"
    ],
    "nut": [
        "Calories > 218 kcal",
        "Carbs > 26.2 g",
        "Cholesterol > 22 mg",
        "Fat > 9.1 g",
        "Protein > 7.2 g",
        "Sodium > 707 mg"
    ],
    "n": "Pad Kee Mao",
    "a": "Deborah B",
    "r": "0",
    "s": 4,
    "des": "\"Pad Kee Mao translates to 'Drunken Stir Fry' in English. This is one variation of many such 'drunken' dishes that are commonly hawked by street-side vendors in Bangkok. The 'drunken' description comes from the fact that it originated in late-night revelers' kitchens after stumbling home from the nightclubs in the wee hours of the morning.\"",
    "ins": "Place the dry rice noodles in a bowl, cover with hot water, and let soak until white and softened, about 1 hour. Drain the noodles, and set aside.\nHeat 1 1/2 teaspoon of olive oil in a wok or large skillet over low heat, and cook and stir 2 minced garlic cloves until brown and beginning to crisp, 2 to 3 minutes. Stir in the soaked noodles, 1/2 teaspoon of thick soy sauce, and 2 teaspoons of sugar, and cook and stir until the noodles have absorbed the soy sauce and turned brown, about 3 minutes. Remove the noodles from the skillet.\nHeat the remaining 1 1/2 teaspoons of olive oil in the wok over low heat; stir in the remaining 2 minced garlic cloves, and cook until brown and beginning to crisp, 2 to 3 minutes. Raise the heat to medium-high, and stir in the pork, serrano pepper, basil, 1/2 teaspoon thick soy sauce, 1 teaspoon sugar, and salt. Cook and stir until the pork is no longer pink and the edges of the meat are beginning to brown, about 5 minutes. Return the noodles to the wok, and stir in the bean sprouts. Cook and stir until heated through, about 5 more minutes.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "248010.jpg",
    "o": "4510111.jpg,4487301.jpg,3696267.jpg,2659033.jpg,2649070.jpg,2386904.jpg",
    "st": "allrecipes"
}