{
    "id": 199688,
    "old_rating": "4.55128",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds ground beef",
        "2 eggs",
        "2 tablespoons ketchup",
        "1 cup dry bread crumbs",
        "1 tablespoon Parmesan cheese",
        "1 teaspoon garlic powder",
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon dried basil",
        "1/2 teaspoon ground black pepper",
        "1 small yellow onion, diced",
        "6 slices bacon",
        "8 ounces sharp Cheddar cheese, cut into quarters",
        "1 tablespoon ketchup"
    ],
    "nut": [
        "Calories > 589 kcal",
        "Carbs > 17.3 g",
        "Cholesterol > 207 mg",
        "Fat > 37.5 g",
        "Protein > 43.5 g",
        "Sodium > 946 mg"
    ],
    "n": "Dad's Cheesy Bacon Wrapped Meat Loaf",
    "a": "Ashley",
    "r": "0",
    "s": 6,
    "des": "\"This is a recipe my dad has been making for years. Great for the cheese and bacon lover-- it's a huge hit with crowds, even kids! And it's a great comfort food!\"",
    "ins": "Preheat an oven to 375 degrees F (190 degrees C).\nCombine ground beef, eggs and 2 tablespoons of ketchup in a large bowl. Mix well, then add bread crumbs, Parmesan cheese, garlic powder, salt, oregano, basil, pepper, and onion. Set mixture aside. Line the bottom of a 9x13 inch pan with bacon, widthwise. Place half of the meat mixture across the top of the bacon. Lay 3 of the 4 pieces of Cheddar cheese across the center of the meat, lengthwise. Cover the cheese with the second half of the meat mixture and mold the meat into a loaf shape. Pull the ends of the bacon up and around the loaf. Spread 1 tablespoon of ketchup thinly over the loaf.\nBake in the preheated oven until no longer pink in the center, about 60 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Remove from the oven.\nCut the final piece of Cheddar cheese into slices and place on top of the meat loaf. Return the meat loaf to the oven and continue baking until the cheese is melted, about 5 minutes. Remove from the oven and allow the meat loaf to rest for 5 minutes before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1558942.jpg",
    "o": "4521263.jpg,4477687.jpg,4477240.jpg,4107447.jpg,4102077.jpg,4035165.jpg",
    "st": "allrecipes"
}