{
    "id": 20003,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 slices bacon",
        "1 (20 ounce) can sauerkraut, drained and rinsed",
        "1 teaspoon onion powder",
        "3 tablespoons bacon grease",
        "3 eggs",
        "1/4 cup half-and-half cream",
        "1/2 teaspoon salt",
        "3/4 cup milk",
        "1/4 cup butter, softened",
        "5 1/2 cups all-purpose flour",
        "1/4 cup butter, melted",
        "1 egg, beaten"
    ],
    "nut": [
        "Calories > 145 kcal",
        "Carbs > 18.8 g",
        "Cholesterol > 36 mg",
        "Fat > 6 g",
        "Protein > 3.9 g",
        "Sodium > 220 mg"
    ],
    "n": "Pierogi III",
    "a": "Robbie Rice",
    "r": "0",
    "s": 30,
    "des": "\"This is an old Czechoslovakian recipe. It has recently become available in supermarkets, but this recipe beats them all. Top cooked pierogi with sauteed onions and melted butter. These can also be frozen between layers of waxed paper and boiled for 10 minutes. Try alternate fillings of prunes or mashed potatoes.\"",
    "ins": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, reserving bacon grease, crumble and set aside.\nIn medium bowl, combine sauerkraut, onion powder, crumbled bacon and bacon grease.  Stir well; set aside.\nIn large bowl, beat together 3 eggs, half-and-half, salt, milk and 1/4 cup butter with electric mixer.  Stir in flour to form a soft dough.  Cover and let rest 5 minutes in a warm place.  Grease hands and dough with butter, and knead on a floured surface 10 minutes.  Divide dough into 4 sections, and grease each with butter to prevent drying out.\nMelt remaining 1/4 cup butter; beat remaining egg, combine egg and butter, and set aside.  Roll out a section of dough to a thickness of 1/8 inch.  Cut out 4 inch circles with round cutter or glass.  Place one tablespoon sauerkraut filling in the center of each circle, brush the edges of the circle with the butter and egg mixture,  fold in half and press edges together to seal.  Repeat with remaining sections of dough.\nBring a large pot of water to a boil.  Cook pierogi for 5 minutes, or until they float to the top.",
    "pt": "1 h",
    "ct": "5 m",
    "tt": "1 h ",
    "i": "1003684.jpg",
    "o": "",
    "st": "allrecipes"
}