{
    "id": 200658,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (16.3 ounce) cans refrigerated biscuit dough (such as PillsburyÂ®)",
        "2 skinless, boneless chicken breast halves",
        "3 (5 ounce) cans tuna (such as Chicken of the SeaÂ®), drained",
        "1/4 cup mayonnaise (such as Best FoodsÂ®)",
        "1/8 teaspoon whole grain mustard",
        "1 teaspoon ground white pepper",
        "1 teaspoon cayenne pepper",
        "1/2 teaspoon paprika",
        "1/8 teaspoon ground cumin",
        "1 head lettuce, leaves rinsed and dried"
    ],
    "nut": [
        "Calories > 260 kcal",
        "Carbs > 26.1 g",
        "Cholesterol > 18 mg",
        "Fat > 11.2 g",
        "Protein > 13.5 g",
        "Sodium > 613 mg"
    ],
    "n": "Spicy Southern Chicken And Tuna Biscuit",
    "a": "WillowGypseyC",
    "r": "0",
    "s": 16,
    "des": "\"This is a recipe that was posted down from my family in Mississippi. Although I live in New York City, I still enjoy all the southern foods. Served best with a light wine or beer, or a very light but sweet fruit juice (pineapple-grapefruit is best).\"",
    "ins": "Preheat an oven to 375 degrees F (190 degrees C).\nPlace biscuit dough on a baking sheet, about 1 to 2 inches apart. Bake in the preheated oven until golden brown, about 11 to 15 minutes. Remove from oven and allow the biscuits to cool.\nHeat a skillet over medium-high heat and cook the chicken breasts until no longer pink in the center and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove the chicken from the skillet and dice into 1/2 inch cubes.\nMix tuna, mayonnaise, and mustard in a bowl until combined. Stir in white pepper, cayenne pepper, paprika, and cumin. Reserve 1/4 of the tuna mixture in a separate bowl. Combine the remaining 3/4 portion of the tuna mixture with the chicken. Split each biscuit in half and place over a bed of lettuce leaves. Divide chicken and tuna mixture on top of each biscuit half. Use the remaining 1/4 portion of the tuna mixture as a garnish on the lettuce leaves.",
    "pt": "5 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "3295022.jpg",
    "o": "",
    "st": "allrecipes"
}