{
    "id": 20122,
    "old_rating": "4.28788",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 large  fresh peaches - peeled, pitted, and sliced",
        "2 cups water",
        "1 1/2 cups white sugar",
        "2 tablespoons cornstarch",
        "1 1/3 cups buttermilk baking mix",
        "2 tablespoons white sugar",
        "2 tablespoons margarine, melted",
        "1/3 cup milk",
        "2 tablespoons margarine, softened",
        "1/4 cup white sugar",
        "1 teaspoon ground cinnamon"
    ],
    "nut": [
        "Calories > 459 kcal",
        "Carbs > 89 g",
        "Cholesterol > 1 mg",
        "Fat > 11.4 g",
        "Protein > 2.5 g",
        "Sodium > 428 mg"
    ],
    "n": "Peach Whirligigs",
    "a": "Tally Flint",
    "r": "0",
    "s": 6,
    "des": "\"My mother-in-law makes this yummy dish every summer when peaches are in season. When my husband and I got married I just had to have the recipe to carry on the tradition! In autumn, replace the peaches with apples and you have a delicious fall dessert as well!\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nIn large saucepan over medium heat, combine peaches, water, 1 1/2 cups sugar and cornstarch. Cook, stirring constantly, until mixture boils. Boil for one minute, then reduce heat to low to keep warm.\nIn a large bowl, stir together baking mix, 2 tablespoons sugar, melted margarine and milk to form a soft dough.  Remove to floured surface and knead 8 to 10 times.  Roll out into a 9 inch square.\nSpread softened margarine over dough.  Combine 1/4 cup sugar with cinnamon, and sprinkle mixture over dough.  Roll dough into a log shape and cut into 6 - 1 1/2 inch slices.  Pour hot peach mixture into an 8x8 inch baking dish. Place roll slices, cut side up, on top of peach mixture.\nBake in preheated oven 20 to 25 minutes, until puffed and golden.  Serve warm.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "694221.jpg",
    "o": "722594.jpg,722593.jpg,722088.jpg,722085.jpg,709417.jpg,667643.jpg",
    "st": "allrecipes"
}