{
    "id": 202261,
    "old_rating": "4.41176",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup white sugar",
        "4 eggs, separated",
        "1 (14 ounce) can sweetened condensed milk",
        "3/4 cup milk, plus",
        "2 tablespoons milk"
    ],
    "nut": [
        "Calories > 303 kcal",
        "Carbs > 53.1 g",
        "Cholesterol > 112 mg",
        "Fat > 7.3 g",
        "Protein > 7.9 g",
        "Sodium > 108 mg"
    ],
    "n": "Brazilian Style Flan (Pudim de Leite Condensado)",
    "a": "PattyZumba",
    "r": "0",
    "s": 8,
    "des": "\"I learned to make this when we lived in Brazil.  It has a wonderful, creamy texture without being too heavy. Melted syrup will run down sides, forming a caramel sauce. Serve cool with a dollop of whipped cream on the side. Top it with toasted coconut and serve with a garnish of tropical fruits such as mango or pineapple.  Uma delicia!\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).\nMelt the sugar in a heavy saucepan over low heat, stirring constantly. Once the sugar becomes a golden brown syrup after about 10 minutes, pour it immediately into a round baking dish, swirling so that the syrup coats all sides of the dish. Set aside to cool.\nPlace the egg yolks into a blender and blend on medium for 5 minutes, then add condensed milk, 3/4 cup plus 2 tablespoons milk, and egg whites. Continue to blend until all ingredients are combined. Pour egg mixture into the baking dish and cover with aluminum foil.  Line a roasting pan with a damp kitchen towel.  Place baking dish on towel, inside roasting pan, and place roasting pan on oven rack.  Fill roasting pan with boiling water to reach halfway up the sides of the baking dish.\nBake in the preheated oven until a knife inserted 1 inch from the edge comes out clean, 45 to 50 minutes. The center of the flan will still be soft.  Allow flan to cool before unmolding onto a plate. Refrigerate before serving.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "3 h ",
    "i": "3512487.jpg",
    "o": "4372922.jpg,3732791.jpg,3676386.jpg,1807626.jpg,1778026.jpg,250649.jpg",
    "st": "allrecipes"
}