{
    "id": 20254,
    "old_rating": "4.44156",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (17.5 ounce) package frozen puff pastry, thawed",
        "1 cup white sugar",
        "3/8 cup dry bread crumbs",
        "3 tablespoons ground cinnamon",
        "1 pinch ground nutmeg",
        "1 egg, beaten",
        "4 Granny Smith apples - peeled, cored and halved",
        "1 cup confectioners' sugar",
        "1 teaspoon vanilla extract",
        "3 tablespoons milk"
    ],
    "nut": [
        "Calories > 563 kcal",
        "Carbs > 82.3 g",
        "Cholesterol > 24 mg",
        "Fat > 24.4 g",
        "Protein > 6.4 g",
        "Sodium > 202 mg"
    ],
    "n": "Allie's Delicious Baked Dumplings",
    "a": "NYRED",
    "r": "0",
    "s": 8,
    "des": "\"A delicious baked apple dumpling with a crispy crust and moist and juicy inside! Always a big hit for all occasions, and surprisingly easy to prepare.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).  Lightly grease a baking sheet.\nRoll out each sheet of pastry to measure 12x12 inches.  Cut into quarters, to make 8 - 6 inch squares.\nIn a small bowl, combine sugar, bread crumbs, cinnamon and nutmeg.  Brush a pastry square with beaten egg.  Place 1 tablespoon bread crumb mixture in center.  Place one apple half, core side down, over bread crumbs.  Top with another tablespoon of mixture.  Pull up four corners of pastry and pinch sides together to seal seams completely.  Repeat with remaining apples.\nBrush each dumpling with beaten egg.  Place in preheated oven for 15 minutes, then reduce heat to 350 degrees F (175 degrees C) and continue baking 25 minutes more, until lightly browned.  Let cool completely at room temperature.\nTo make icing, combine confectioners' sugar and vanilla and enough milk to make a drizzling consistency.  Drizzle over cooled dumplings.  Serve the same day.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "4091.jpg",
    "o": "",
    "st": "allrecipes"
}