{
    "id": 202885,
    "old_rating": "4.47945",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "3 cups diced zucchini",
        "1/4 cup canned diced green chiles",
        "1 teaspoon chili powder",
        "1/4 teaspoon black pepper",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "1/4 teaspoon salt",
        "1 teaspoon chili powder",
        "1/8 teaspoon black pepper",
        "1 cup milk",
        "1/4 cup canned diced green chiles",
        "1 cup shredded Monterey Jack cheese",
        "8 (8 inch) flour tortillas",
        "1/2 cup shredded Monterey Jack cheese",
        "1 1/2 cups chopped tomatoes"
    ],
    "nut": [
        "Calories > 662 kcal",
        "Carbs > 73.9 g",
        "Cholesterol > 58 mg",
        "Fat > 30.8 g",
        "Protein > 24.2 g",
        "Sodium > 1135 mg"
    ],
    "n": "Bountiful Garden Zucchini Enchiladas",
    "a": "Annabelle",
    "r": "0",
    "s": 4,
    "des": "\"These vegetarian enchiladas are easy to make, delicious and very filling.  They are also very accommodating to modifications.  I frequently add mushrooms and other vegetables.\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C). Heat oil in a large skillet over medium-high heat. Cook the onion and garlic in the oil until tender, about 5 minutes. Stir in zucchini, 1/4 cup diced chiles, 1 teaspoon chili powder, and 1/4 teaspoon black pepper. Cook until softened, 3 to 5 minutes. Remove zucchini mixture from skillet and reserve.\nMelt butter in the skillet over medium low heat. Stir in flour, salt, remaining 1 teaspoon chili powder, and 1/8 teaspoon pepper. Cook, stirring, for 1 minute. Pour in milk; whisk until thickened, 3 to 5 minutes. Stir in the remaining 1/4 cup of diced chiles and 1 cup of Monterey Jack cheese.\nStir 1/2 cup of cheese sauce into the zucchini mixture. Spoon 1/3 cup squash mixture down the center of each tortilla; roll up. Place filled tortillas in prepared baking dish, pour remaining cheese sauce over. Cover and bake in preheated oven until hot, about 25 minutes. Remove from oven; sprinkle with remaining 1/2 cup Monterey Jack cheese and the chopped tomatoes.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "689289.jpg",
    "o": "3618195.jpg,1302218.jpg,1116698.jpg,1073298.jpg,706861.jpg,250535.jpg",
    "st": "allrecipes"
}