{
    "id": 20287,
    "old_rating": "4.77007",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound chopped mixed nuts",
        "1 teaspoon ground cinnamon",
        "1 (16 ounce) package phyllo dough",
        "1 cup butter, melted",
        "1 cup white sugar",
        "1 cup water",
        "1/2 cup honey",
        "1 teaspoon vanilla extract",
        "1 teaspoon grated lemon zest"
    ],
    "nut": [
        "Calories > 194 kcal",
        "Carbs > 19.3 g",
        "Cholesterol > 14 mg",
        "Fat > 12.4 g",
        "Protein > 3.1 g",
        "Sodium > 181 mg"
    ],
    "n": "Easy Baklava",
    "a": "ARVILLALAR",
    "r": "0",
    "s": 36,
    "des": "\"This is simple and easy. Serve it in cupcake papers.   It freezes well, too.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).  Butter a 9x13 inch baking dish.\nToss together cinnamon and nuts.  Unroll phyllo and cut whole stack in half to fit the dish.  Cover phyllo with a damp cloth while assembling the baklava, to keep it from drying out.\nPlace two sheets of phyllo in the bottom of the prepared dish.  Brush generously with butter.  Sprinkle 2 to 3 tablespoons of the nut mixture on top.  Repeat layers until all ingredients are used, ending with about 6 sheets of phyllo.  Using a sharp knife, cut baklava (all the way through to the bottom of the dish) into four long rows, then (nine times) diagonally to make 36 diamond shapes.\nBake in preheated oven 50 minutes, until golden and crisp.\nWhile baklava is baking, combine sugar and water in a small saucepan over medium heat and bring to a boil.  Stir in honey, vanilla and lemon zest,  reduce heat and simmer 20 minutes.\nRemove the baklava from the oven and immediately spoon the syrup over it.  Let cool completely before serving.  Store uncovered.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "4517881.jpg",
    "o": "4517881.jpg,4484686.jpg,4374562.jpg,4239362.jpg,3930700.jpg,3827068.jpg",
    "st": "allrecipes"
}