{
    "id": 203137,
    "old_rating": "4.25325",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups bow tie pasta",
        "1 skinless, boneless chicken breast half - cut into bite-size pieces",
        "1 teaspoon lemon pepper",
        "1/4 cup margarine",
        "2 tablespoons olive oil",
        "2 cloves garlic, minced",
        "1/4 cup white wine",
        "2 cups sour cream",
        "1 tablespoon chopped fresh basil",
        "1 lemon, zested and juiced",
        "1/4 cup grated Parmesan cheese",
        "1/4 cup grated mozzarella cheese",
        "1 tablespoon chopped fresh parsley",
        "1/2 cup torn fresh spinach"
    ],
    "nut": [
        "Calories > 398 kcal",
        "Carbs > 20 g",
        "Cholesterol > 49 mg",
        "Fat > 30.7 g",
        "Protein > 11.5 g",
        "Sodium > 299 mg"
    ],
    "n": "Baked Lemon-Basil Pasta",
    "a": "Brennan Cartwright",
    "r": "0",
    "s": 6,
    "des": "\"I was a little unsure about the idea behind this pasta when my wife ordered something similar in a restaurant.  But we both loved it and knew that we had to go home and try to replicate it.  Here is what we came up with!\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the bow tie pasta; return to a boil. Cook, uncovered, stirring occasionally, until the pasta is cooked through, but still firm to the bite, about 10 minutes. Drain.\nPreheat oven to 375 degrees F (190 degrees C). Season chicken with lemon pepper.\nMelt the margarine with the olive oil in a skillet over medium heat; cook and stir the chicken pieces until no longer pink in the center. Remove the chicken pieces, and place them in the bottom of a casserole dish.\nTo the same skillet, add the garlic, white wine, sour cream, basil, lemon zest, and 1/2 of the lemon juice. Bring the mixture to a boil, stirring constantly. Remove the skillet from the heat; stir in the pasta. Spoon the pasta and sauce mixture over the chicken. Cover with foil.\nBake in the preheated oven until heated through, about 15 minutes. Uncover, sprinkle evenly with Parmesan cheese, mozzarella cheese, parsley, spinach, and drizzle with the remaining lemon juice. Bake, uncovered, for 10 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "352986.jpg",
    "o": "",
    "st": "allrecipes"
}