{
    "id": 203488,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups all-purpose flour, plus",
        "2 tablespoons all-purpose flour",
        "1 teaspoon salt",
        "1 cup butter",
        "1 cup water",
        "3 eggs",
        "2 cups white sugar",
        "1/2 cup buttermilk",
        "1 1/2 teaspoons baking soda",
        "1/2 teaspoon baking powder",
        "1 teaspoon vanilla extract",
        "1 teaspoon almond extract (optional)",
        "Icing:",
        "1/2 cup butter",
        "5 tablespoons milk",
        "1 (16 ounce) package confectioners' sugar, sifted",
        "1 cup chopped pecans",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 328 kcal",
        "Carbs > 44.9 g",
        "Cholesterol > 54 mg",
        "Fat > 15.9 g",
        "Protein > 2.8 g",
        "Sodium > 284 mg"
    ],
    "n": "Alaska Sheet Cake",
    "a": "Kim Sing",
    "r": "0",
    "s": 24,
    "des": "\"A white version of the ever-popular Texas Sheet Cake. Moist and delicious!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C), and grease and flour a 10x15 inch sheet pan.\nStir together the flour and salt in a large mixing bowl.\nPlace 1 cup butter with the water in a saucepan, and bring to a boil over medium heat. Remove from the heat, and set aside to cool.\nBeat eggs in a separate mixing bowl, and stir in the sugar, buttermilk, boiled butter mixture, baking soda, baking powder, vanilla extract, and almond extract until well combined.\nPour the egg mixture into the flour mixture, and stir until the batter is well mixed. Pour the batter into the prepared baking sheet.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, about 15 minutes. Let the cake cool before icing.\nTo make icing, place 1/2 cup of butter and the milk into a saucepan, and bring to a boil over medium-low heat. Remove from the heat, and beat in the confectioners' sugar, chopped pecans, and vanilla extract. Ice the cooled cake with the warm frosting.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "369124.jpg",
    "o": "",
    "st": "allrecipes"
}