{
    "id": 203762,
    "old_rating": "4.69767",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "9 cups chicken broth",
        "5 skinless, boneless chicken breast halves",
        "1 large red onion, quartered",
        "5 cloves garlic, chopped",
        "2 teaspoons dried oregano",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon dried thyme",
        "1 tablespoon vegetable oil",
        "4 green onions, chopped",
        "1 large green chile pepper, seeded and chopped",
        "2 large tomatoes, peeled and chopped",
        "6 limes, juiced",
        "1/2 lime",
        "1/2 cup chopped fresh cilantro",
        "tortilla chips, for topping"
    ],
    "nut": [
        "Calories > 214 kcal",
        "Carbs > 21.6 g",
        "Cholesterol > 44 mg",
        "Fat > 7.1 g",
        "Protein > 18 g",
        "Sodium > 1464 mg"
    ],
    "n": "Sopa De Lima (Mexican Lime Soup)",
    "a": "Amatre",
    "r": "0",
    "s": 8,
    "des": "\"Hot or cold outside, this soup is light and refreshing. I first enjoyed this dish while sitting ocean-side in Mexico. Goes great with a margarita or beer and a side of chips and salsa.  Use whatever chilies you want (hot or mild) depending on the amount of heat you enjoy. Serve in bowls with crushed tortilla chips or strips on top.\"",
    "ins": "Bring the chicken broth, chicken breasts, red onion, garlic, oregano, salt, pepper, and thyme to a boil in a large pot; reduce heat to medium-low and simmer until the chicken breasts are no longer pink in the center and the juices run clear, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove the cooked chicken to a cutting board and shred into bite-sized strips; return to the simmering pot.\nHeat the oil in a skillet over medium heat; cook the green onions and green chile pepper in the hot oil until tender, about 5 minutes. Stir the tomatoes into the mixture and continue cooking until soft, about 5 minute more; pour the mixture into the pot with the chicken soup. Season with the salt; return the soup to a simmer. Add the lime juice and 1/2 a lime; cook another 10 minutes. Remove the pot from the heat and remove the lime half; stir in the cilantro to serve.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "1770529.jpg",
    "o": "4504432.jpg,3208499.jpg,3158679.jpg,3139269.jpg,2113917.jpg,1126792.jpg",
    "st": "allrecipes"
}