{
    "id": 204308,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup yellow mustard seeds",
        "1/2 cup brown mustard seeds",
        "1 tablespoon Oriental mustard seeds",
        "1 1/2 cups apple cider vinegar",
        "2 cloves garlic, minced",
        "2 tablespoons honey",
        "1 teaspoon salt",
        "1 teaspoon dried thyme",
        "3 half pint canning jars with lids and rings"
    ],
    "nut": [
        "Calories > 31 kcal",
        "Carbs > 4.2 g",
        "Cholesterol > 0 mg",
        "Fat > 1.4 g",
        "Protein > 1.8 g",
        "Sodium > 98 mg"
    ],
    "n": "Tangy Mustard",
    "a": "pelicangal",
    "r": "0",
    "s": 24,
    "des": "\"This is a nice mustard for use with all kinds of meats, cold cuts, and sandwiches.  Made from the whole mustard seeds it is a very grainy mustard. Kept in the fridge, the prepared mustard will keep up to one month after you open the sealed jar.\"",
    "ins": "Combine the yellow mustard seeds, brown mustard seeds, and Oriental mustard seeds in a bowl. Pour the vinegar over the seeds and stir. Cover and store in refrigerator for 24 hours. If the seeds absorb all the vinegar too quickly, add more as needed or add a little water.\nBlend the soaked mustard seeds, garlic, honey, salt, and thyme in a blender until it is to your desired consistency, depending on how grainy you like your mustard.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the mustard into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings. Refrigerate at least 2 weeks before using.",
    "pt": "15 m",
    "ct": "",
    "tt": "",
    "i": "717199.jpg",
    "o": "909347.jpg,779490.jpg,717186.jpg,715322.jpg,710308.jpg,697443.jpg",
    "st": "allrecipes"
}