{
    "id": 204482,
    "old_rating": "4.59551",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups shredded unpeeled zucchini",
        "1/2 teaspoon salt",
        "2 eggs, lightly beaten",
        "1/2 cup grated Parmesan cheese",
        "2 cups shredded mozzarella cheese",
        "1 cup shredded Monterey Jack cheese",
        "1 pound ground beef",
        "1/2 cup chopped onion",
        "1 (15 ounce) can Italian-style tomato sauce",
        "1 teaspoon Italian seasoning",
        "1 green bell pepper, chopped",
        "1/2 cup sliced fresh mushrooms",
        "1/2 cup sliced black olives"
    ],
    "nut": [
        "Calories > 409 kcal",
        "Carbs > 12.3 g",
        "Cholesterol > 155 mg",
        "Fat > 25.6 g",
        "Protein > 33.9 g",
        "Sodium > 1182 mg"
    ],
    "n": "Zucchini Pizza Bake",
    "a": "Christina",
    "r": "0",
    "s": 6,
    "des": "\"This is a recipe my entire family loves. You can also use turkey instead of ground beef.\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C). Place the zucchini in a colander and sprinkle with salt; let drain for 15 minutes then squeeze out the moisture.\nCombine the zucchini, eggs, Parmesan, 1 cup mozzarella, and 1/2 cup Monterey Jack in a large bowl. Press the mixture into a greased 9x13 inch baking dish. Bake, uncovered, in the preheated oven for 20 minutes.\nWhile the zucchini crust is baking, heat a large skillet over medium-high heat and stir in the ground beef and onion. Cook and stir until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Stir in the tomato sauce and Italian seasoning.\nSpoon the sauce mixture over the baked zucchini crust. Top with the bell pepper, mushrooms, black olives, and the remaining mozzarella and Monterey Jack cheeses. Return to the preheated oven and bake for 20 minutes or until heated through.  Let sit for 5 minutes before serving.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "664067.jpg",
    "o": "4529128.jpg,4515509.jpg,3802899.jpg,2817851.jpg,2756828.jpg,2482997.jpg",
    "st": "allrecipes"
}