{
    "id": 204429,
    "old_rating": "4.45455",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package lasagna noodles",
        "2 (18 ounce) containers pulled pork in barbeque sauce",
        "1 (16 ounce) package shredded mozzarella cheese",
        "1 (16 ounce) package Cheddar cheese, shredded",
        "1 (16 ounce) container ricotta cheese",
        "1 egg, beaten",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper"
    ],
    "nut": [
        "Calories > 710 kcal",
        "Carbs > 39.9 g",
        "Cholesterol > 166 mg",
        "Fat > 36.6 g",
        "Protein > 54.2 g",
        "Sodium > 1498 mg"
    ],
    "n": "Barbecue Lasagna",
    "a": "cullinanpat",
    "r": "0",
    "s": 10,
    "des": "\"I smoke a 6-10 pound Boston Butt ahead of time, slicing off some for a dinner and then pulling the rest for pulled pork sandwiches and of course Barbecue Lasagna. If you're accustomed to pulled pork you are ahead of the game as there are many pulled pork recipes online. Too much work? There are ready-made pork alternatives in most grocery stores. Same for barbeque sauce -- there are good recipes on the web or use your favorite store-bought brand. I guess I use about 2 pounds of pork in the lasagna. Mix sauce with pulled pork in a sauce pan and bring it to a slow simmer so it will spread easily.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil; cook the lasagna noodles in the boiling water until cooked through but still firm to the bite, about 12 minutes. Drain.\nBring the pork in barbeque sauce to a simmer in a large pot over medium heat; keep warm at a slow simmer.\nToss the mozzarella cheese and Cheddar cheese together in a bowl. Beat the ricotta cheese, egg, salt, and pepper together in a separate bowl until smooth.\nSpread a layer of the barbeque sauce into the bottom of a large, deep baking dish. Lay enough lasagna noodles over the sauce to cover the bottom of the dish. Spread an even layer of the pulled pork in barbeque sauce over the noodles; top with a layer of the ricotta mixture and the mozzarella and Cheddar cheese mixture. Repeat layering. Finish the assembly by topping with a layer of the ricotta mixture, a thin layer of the pork, and a light sprinkling of the cheese mixture. Reserve a small portion of the cheese mixture for later.\nBake in the preheated oven for 40 minutes. Top the lasagna with the reserved cheese mixture and return to over until the cheese is bubbly, about 5 minutes. Remove from oven and allow to rest for 15 minutes before serving.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "688550.jpg",
    "o": "",
    "st": "allrecipes"
}