{
    "id": 20465,
    "old_rating": "4.78818",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 cups graham cracker crumbs",
        "1/3 cup butter, melted",
        "1/4 cup white sugar",
        "1 cup all-purpose flour",
        "3/4 cup quick cooking oats",
        "1/4 cup brown sugar",
        "1/2 cup butter, melted",
        "3/4 cup chopped pecans",
        "1 (8 ounce) package cream cheese",
        "1 (14 ounce) can sweetened condensed milk",
        "1 (12 ounce) container frozen whipped topping, thawed",
        "1 (12 ounce) jar caramel topping"
    ],
    "nut": [
        "Calories > 617 kcal",
        "Carbs > 70.9 g",
        "Cholesterol > 66 mg",
        "Fat > 35.4 g",
        "Protein > 7.9 g",
        "Sodium > 347 mg"
    ],
    "n": "Butter Brickle Frozen Delight",
    "a": "LORIELEECOOPER",
    "r": "0",
    "s": 12,
    "des": "\"This dessert is a frozen winner! It is made in a 9\" springform and can be stored in the freezer and served immediately when unexpected company arrives.   It is a very rich dessert with layers of butter brickle, caramel sauce, and a rich layer of cool whip & cream cheese. Very rich!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nIn medium bowl, combine graham cracker crumbs, 1/3 cup melted butter and white sugar until well mixed.  Press into bottom of a 9 inch springform pan.\nBake 6 minutes, until set.  Cool completely.\nPreheat oven to 400 degrees F (200 degrees C).\nIn a large bowl, combine flour, oats, brown sugar, 1/2 cup melted butter and pecans until well mixed.  Lightly pat onto a baking sheet.\nBake 10 to 15 minutes, until light brown.  Crumble while still hot.  Cool completely.\nIn large mixing bowl, beat cream cheese until smooth.  Beat in condensed milk until well blended.  Fold in whipped topping.\nSpread half of the cheese mixture over the crust in the springform pan.  Sprinkle half of the oat crumbles over the cheese mixture, and spread half of the caramel sauce over that.  Repeat layers.  Freeze until firm, remove pan sides and serve cold.",
    "pt": "15 m",
    "ct": "21 m",
    "tt": "1 h ",
    "i": "1018103.jpg",
    "o": "3701887.jpg,1720092.jpg,1093648.jpg,1028270.jpg,1020013.jpg,992452.jpg",
    "st": "allrecipes"
}