{
    "id": 204821,
    "old_rating": "4.22857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons canola oil",
        "1/2 cup sliced fresh ginger",
        "1 (5 pound) whole chicken, cut into pieces",
        "salt and ground black pepper to taste",
        "2 (14 ounce) cans coconut milk",
        "1 (10 ounce) package frozen chopped spinach, thawed and drained"
    ],
    "nut": [
        "Calories > 709 kcal",
        "Carbs > 7 g",
        "Cholesterol > 103 mg",
        "Fat > 59.7 g",
        "Protein > 39.4 g",
        "Sodium > 212 mg"
    ],
    "n": "Ginataang Manok (Chicken Cooked in Coconut Milk)",
    "a": "daplo",
    "r": "0",
    "s": 6,
    "des": "\"This is a Filipino chicken dish flavored with ginger and coconut milk.  Each family has their own version.  This is my mother's version.  It's a rich dish that makes your kitchen smell so wonderful!  Once my family smells the ginger frying and coconut milk simmering, they can't wait for it to be done so they can dig in!  I salt it liberally as the coconut milk tends to hide the salt flavor.\"",
    "ins": "Heat the canola oil in a large skillet over medium heat and stir in the ginger slices. Cook and stir until fragrant and lightly browned. Remove ginger and set aside. Season chicken with salt and pepper. Place chicken in the same skillet over medium-high heat without crowding. Cook until chicken is lightly brown on all sides. Return the ginger to the skillet and add coconut milk. Bring to a boil, then cover the skillet with the lid tilted to allow steam to escape. Reduce heat to medium-low and simmer until the chicken is  no longer pink at the bone, stirring occasionally, about 30 minutes.\nStir in the spinach. Simmer uncovered until spinach is warmed through, 8 to 12 minutes. Season with salt and pepper, as necessary.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4506061.jpg",
    "o": "4463470.jpg,3808181.jpg,3211949.jpg,2350577.jpg,1741536.jpg,1369996.jpg",
    "st": "allrecipes"
}