{
    "id": 204947,
    "old_rating": "4.14737",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) container low-fat ricotta cheese",
        "1 (8 ounce) package shredded low-fat mozzarella cheese",
        "2 cloves garlic, minced, or more to taste",
        "salt and ground black pepper to taste",
        "1 (1 pound) package whole-wheat penne pasta",
        "1 pound ground turkey",
        "1 (13.5 ounce) jar spaghetti sauce"
    ],
    "nut": [
        "Calories > 478 kcal",
        "Carbs > 49 g",
        "Cholesterol > 78 mg",
        "Fat > 15.5 g",
        "Protein > 35.5 g",
        "Sodium > 498 mg"
    ],
    "n": "Turkey Bake with Whole Wheat Pasta",
    "a": "Jessica Murfin",
    "r": "0",
    "s": 8,
    "des": "\"My husband and I LOVE pasta, but with our new diet and exercise plan, pasta is not our friend, so here's a way to make it a little easier for us to enjoy our faves!\"",
    "ins": "Preheat an oven to 300 degrees F (150 degrees C).\nStir the ricotta cheese, mozzarella cheese, garlic, salt, and pepper in a bowl; set aside on counter to allow to come to room temperature.\nBring a pot of water to a boil; cook the penne in the boiling water until cooked through yet firm to the bite, about 11 minutes. Drain and transfer to a large mixing bowl.\nWhile the pasta cooks, place a skillet over medium heat. Crumble the turkey into the skillet; cook and stir until the turkey is completely browned. Drain and add to the pasta.\nSpread 2 tablespoons of the spaghetti sauce into the bottom of a 13x9-inch baking dish; stir the rest of the spaghetti sauce into the pasta and turkey mixture. Spoon about half of the pasta mixture into the baking dish; top with the cheese mixture and spread into an even layer. Spread the remaining pasta mixture over the cheese layer. Cover with aluminum foil if desired.\nBake in the preheated oven until slightly brown on top, about 30 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "693917.jpg",
    "o": "4521516.jpg,4515057.jpg,1575834.jpg,1177438.jpg,444889.jpg,274712.jpg",
    "st": "allrecipes"
}