{
    "id": 205584,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package linguine pasta",
        "2 pounds abalone without shell",
        "3 limes, juiced",
        "3 cloves garlic, chopped",
        "2 tablespoons olive oil",
        "2 green bell peppers, sliced",
        "1 (16 ounce) jar Alfredo sauce"
    ],
    "nut": [
        "Calories > 1060 kcal",
        "Carbs > 109.5 g",
        "Cholesterol > 239 mg",
        "Fat > 44.3 g",
        "Protein > 60.3 g",
        "Sodium > 1792 mg"
    ],
    "n": "Sauteed Abalone",
    "a": "mxmom",
    "r": "0",
    "s": 4,
    "des": "\"This recipe was a flying by the seat of my pants, sauteed abalone in lime juice and garlic.  Everyone in the family loved it.\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\nSlice abalone into 1/2 inch slices. Place the abalone between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the abalone with the smooth side of a meat mallet to a thickness of 1/4 inch. Mix lime juice and garlic in a large bowl. Toss abalone slices and bell pepper in the lime garlic mixture to coat.\nHeat olive oil in a large skillet over high heat and stir in the abalone and bell pepper, including the juice. Cook and stir until the cooked through, 5 to 10 minutes. Remove the abalone slices and place on a plate and set aside. Continue cooking the peppers, until tender. Meanwhile, pour Alfredo sauce into a saucepan and heat over medium-low heat until hot, stirring occasionally. Serve abalone over a bed of linguine and Alfredo sauce.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}