{
    "id": 205692,
    "old_rating": "4.22727",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil",
        "1 head garlic, cut in half",
        "1 cup chicken stock",
        "1/2 cup cream",
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "1/2 pound sea scallops",
        "salt and ground black pepper to taste",
        "1 tablespoon lemon juice",
        "2 tablespoons chopped fresh parsley for garnish"
    ],
    "nut": [
        "Calories > 693 kcal",
        "Carbs > 17.6 g",
        "Cholesterol > 166 mg",
        "Fat > 56.3 g",
        "Protein > 32 g",
        "Sodium > 740 mg"
    ],
    "n": "Scallops with Roasted Garlic Cream Sauce",
    "a": "Mitzi",
    "r": "0",
    "s": 2,
    "des": "\"I've looked and looked for a recipe for scallops that was tasty yet elegant. I searched through 30 recipes and out of those I got ideas and came up with this.\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C).\nSpoon 3 tablespoons olive oil over the cut sides of the garlic head; wrap tightly in aluminum foil.\nRoast in the preheated oven until the garlic is soft, about 30 minutes; set aside until cool enough to handle.\nSqueeze the roasted garlic cloves into a saucepan; pour the chicken stock into the saucepan and use a fork to mash the garlic into the stock. Cook the stock over high heat until the liquid is reduced in volume by half, about 10 minutes. Stir the cream into the stock and remove from heat; set aside.\nMelt the butter with 1 tablespoon olive oil in a large skillet over medium-high heat. Season the scallops with salt and pepper; sear in the hot butter and oil mixture until opaque, about 3 minutes per side. Remove from heat immediately.\nStir the lemon juice into the cream sauce; spoon immediately onto 2 plates. Arrange the scallops on the plates. Garnish with the parsley to serve.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "4516286.jpg",
    "o": "",
    "st": "allrecipes"
}