{
    "id": 205656,
    "old_rating": "4.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 tablespoon vegan margarine",
        "1 onion, chopped",
        "2 pounds zucchini, sliced",
        "1 teaspoon dried oregano",
        "salt and pepper to taste",
        "2 1/2 teaspoons vegetable bouillon powder",
        "2 1/2 cups water",
        "6 ounces crumbled Gorgonzola cheese",
        "1 cup non-dairy creamer (such as MimicCremeÂ®)"
    ],
    "nut": [
        "Calories > 242 kcal",
        "Carbs > 11.5 g",
        "Cholesterol > 30 mg",
        "Fat > 18.6 g",
        "Protein > 8.5 g",
        "Sodium > 418 mg"
    ],
    "n": "Cream of Zucchini Soup",
    "a": "alexy",
    "r": "0",
    "s": 6,
    "des": "\"Vegetarian zucchini soup with Gorgonzola. You can use real cream, but I use a vegan mimic cream to keep the calories down, the Gorgonzola adds enough richness that I don't think it's needed.\"",
    "ins": "Heat the olive oil and margarine together in a large pot; cook and stir the onion in the hot oil and margarine until soft, 5 to 7 minutes. Add the zucchini and season with the oregano, salt, and pepper; continue cooking and stirring until the zucchini is tender, about 10 minutes.\nPour the water into the pot, and stir in the bouillon powder. Bring the liquid to a boil, reduce heat to medium-low, and simmer another 10 minutes. Add the Gorgonzola cheese and allow it to melt into the soup.\nPour the soup into a blender, filling the pitcher no more than halfway full. Secure the lid of the blender with a folded kitchen towel and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup in the cooking pot. Stir the creamer through the soup before serving hot.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "45 m",
    "i": "684476.jpg",
    "o": "",
    "st": "allrecipes"
}