{
    "id": 206162,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package dried lima beans",
        "1/4 cup milk",
        "salt to taste",
        "2 tablespoons olive oil",
        "1 small onion, chopped",
        "1 pound ground chicken",
        "1 zucchini, chopped",
        "1 large tomato, chopped",
        "1 teaspoon ground cumin",
        "1/4 teaspoon cayenne pepper",
        "1 cup shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 707 kcal",
        "Carbs > 78.4 g",
        "Cholesterol > 93 mg",
        "Fat > 17.7 g",
        "Protein > 60 g",
        "Sodium > 347 mg"
    ],
    "n": "Legume My Shepherd's Pie",
    "a": "Jana",
    "r": "0",
    "s": 4,
    "des": "\"We always have a hard time incorporating legumes into our meals. By altering an old-time favorite, I came up with a legume-rich and delicious dish. It was a huge hit with the family.\"",
    "ins": "Place the lima beans into a large container and cover with several inches of cool water; let stand 8 hours to overnight. Drain and rinse.\nPreheat an oven to 400 degrees F (200 degrees C).  Drain the soaked lima beans and cook according to package directions.\nBlend the cooked lima beans and milk together in a blender until smooth; season with salt. Set aside.\nHeat the olive oil in a large skillet over medium heat; cook the onion in the hot oil until soft, about 5 minutes. Add the chicken and cook until completely browned, 7 to 10 minutes more. Stir the zucchini, tomato, cumin, and cayenne pepper into the chicken; cook until the vegetables are slightly tender, about 7 minutes more. Spread the mixture into the bottom of an 11x7-inch baking dish; pour the lima bean mixture over the chicken and vegetables in a single, smooth layer. Top with mozzarella and Parmesan cheese.\nBake in the preheated oven until the top is browned and crisp, about 10 minutes.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "8 h ",
    "i": "317305.jpg",
    "o": "",
    "st": "allrecipes"
}