{
    "id": 20650,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups butter, softened",
        "1 1/2 tablespoons prepared mustard",
        "16 slices rye bread",
        "1/2 pound boiled ham, thinly sliced",
        "16 slices white bread",
        "1/2 pound cooked ham, thinly sliced",
        "1/2 pound salami, thinly sliced",
        "1 (8 ounce) package cream cheese, softened",
        "1 1/2 teaspoons curry powder",
        "4 1/2 ounces toasted almonds"
    ],
    "nut": [
        "Calories > 334 kcal",
        "Carbs > 20.5 g",
        "Cholesterol > 60 mg",
        "Fat > 23.7 g",
        "Protein > 10.7 g",
        "Sodium > 810 mg"
    ],
    "n": "Cocktail Birthday Cake",
    "a": "SEBRING SOCKS",
    "r": "0",
    "s": 24,
    "des": "\"Two types of bread, ham and salami are layered with a mustard butter and frosted with cream cheese, curry powder and almonds to create a fun, delicious \"cake\" that is cut up into little pieces and served cold. The curry powder may be omitted.\"",
    "ins": "In a small bowl, mix the butter and mustard.\nRemove crusts from the bread slices. On a small cookie sheet, arrange 4 rye slices to form a square. Spread slices with a layer of mustard butter. Top with 4 slices of boiled ham. Top the boiled ham with four slices of white bread arranged in a square. Spread with mustard butter. Top with 4 slices of cooked ham. Top the cooked ham with four slices of rye bread arranged in a square. Spread with mustard butter. Top with 4 slices of salami. Repeat until 8 alternating layers have been created. Trim overhanging meat.\nPlace a small cookie sheet on top of the layers. Weigh down the cookie sheet with a bowl so as to lightly flatten the layers into a thinner, square cake. Continue flattening and refrigerate a minimum of 5 hours.\nFrost the chilled cake on all sides with cream cheese and curry powder. Decorate with almonds. Refrigerate until serving.\nTo serve, cut into quarters, then six cubes per quarter resulting in 24 pieces.",
    "pt": "5 h ",
    "ct": "",
    "tt": "",
    "i": "376765.jpg",
    "o": "491068.jpg,491067.jpg,363564.jpg,314928.jpg,314926.jpg,314925.jpg",
    "st": "allrecipes"
}