{
    "id": 206524,
    "old_rating": "4.59574",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 leeks",
        "2 tablespoons butter",
        "1 tablespoon brown sugar",
        "3 carrots, cut into matchsticks ",
        "kosher salt to taste",
        "2 pounds salmon fillets",
        "2 teaspoons olive oil",
        "kosher salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 523 kcal",
        "Carbs > 20.3 g",
        "Cholesterol > 127 mg",
        "Fat > 30.4 g",
        "Protein > 41 g",
        "Sodium > 399 mg"
    ],
    "n": "Salmon with Caramelized Leeks",
    "a": "SHERSHON",
    "r": "0",
    "s": 4,
    "des": "\"This is an adaptation from a few recipes I've enjoyed. Simple, elegant and delicious. I've served it for guests and picky teens with high praise.\"",
    "ins": "Preheat an oven to 425 degrees F (220 degrees C). Line a baking sheet with foil, and spray with cooking spray.\nTrim away the root end, tough outer leaves, and dark green tops of the leeks. Cut the leeks lengthwise into quarters, then crosswise into thirds. Wash the leeks well to remove any grit, and drain in a colander.\nMelt the butter in a large skillet over medium-high heat, and cook and stir the leeks until they have started to soften, about 5 minutes. Sprinkle the leeks with brown sugar, and cook until they turn brown, 15 to 20 minutes. Stir in the matchstick carrots, sprinkle with kosher salt, and cook and stir until the carrots are tender, about 5 minutes.\nPlace the salmon on the prepared baking sheet, rub the fillets with olive oil, and sprinkle with salt and pepper. Roast the salmon until the flesh is opaque and flakes easily but isn't dry, about 10 minutes per 1 inch of thickness. Remove the cooked fillets to plates, and top each fillet with 1/4 of the caramelized leeks and carrots.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "3458137.jpg",
    "o": "",
    "st": "allrecipes"
}