{
    "id": 20682,
    "old_rating": "4.67568",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (12 ounce) package English muffins",
        "6 eggs",
        "1/4 cup chopped green onion",
        "1 cup shredded Cheddar cheese",
        "2 1/2 tablespoons vegetable oil",
        "6 ounces ground breakfast sausage"
    ],
    "nut": [
        "Calories > 379 kcal",
        "Carbs > 26.9 g",
        "Cholesterol > 221 mg",
        "Fat > 21.1 g",
        "Protein > 20.2 g",
        "Sodium > 512 mg"
    ],
    "n": "Muffin Morning Makers",
    "a": "Susan",
    "r": "0",
    "s": 6,
    "des": "\"These breakfast muffin sandwiches are perfecto for a quick breakfast at home. I like to freeze them and pop them in the microwave for a grab and go breakfast. These sandwiches don't need to be made with sausage, they can be made vegetarian, with ham, bacon or any type of meat you enjoy in the mornings.\"",
    "ins": "Split the muffins open with a fork and toast them in a toaster oven.\nIn a large bowl scramble the eggs, green onions and cheddar cheese together. Heat vegetable oil in a skillet, pour the egg mixture into the skillet and let it fry in one layer as you would an omelet. When the egg is cooked on the underside, flip the egg over and cook the wet side; remove from heat when cooked through.\nAt the same time that the eggs are frying, form the sausage into small patties.  Place the sausage in another skillet. Fry until browned, remove from pan and drain on paper towels.\nMake the muffin sandwiches by layering a piece of sausage and a piece of the fried egg between the two muffin pieces. If you intend to freeze the sandwiches, let each part of the sandwich cool before make the sandwiches, then wrap them in plastic wrap and freeze. Reheat in the microwave.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "20 m",
    "i": "681959.jpg",
    "o": "4497719.jpg,3598061.jpg,3583379.jpg,3046819.jpg,1054093.jpg,914590.jpg",
    "st": "allrecipes"
}