{
    "id": 20764,
    "old_rating": "4.65116",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (12 pound) whole turkey",
        "2 tablespoons chopped fresh sage",
        "2 tablespoons ground black pepper",
        "2 tablespoons celery salt",
        "2 tablespoons chopped fresh basil",
        "2 tablespoons vegetable oil",
        "1 (12 ounce) jar honey",
        "1/2 pound mesquite wood chips"
    ],
    "nut": [
        "Calories > 647 kcal",
        "Carbs > 25.3 g",
        "Cholesterol > 228 mg",
        "Fat > 28.8 g",
        "Protein > 68.9 g",
        "Sodium > 776 mg"
    ],
    "n": "Honey Smoked Turkey",
    "a": "ABAYIFO",
    "r": "0",
    "s": 16,
    "des": "\"Sweet and light, this is the easiest way to cook a big bird! It will be the best turkey you have ever had. The breast is moist and juicy, and the honey makes a great thin sauce. I hope you enjoy it as much as my friends and family do when I make it. I never have any leftovers! Enjoy!\"",
    "ins": "Preheat grill for high heat. If you are using a charcoal grill, use about twice the normal amount of charcoal. Soak wood chips in a pan of water, and set next to the grill.\nRemove neck and giblets from turkey. Rinse the bird and pat dry. Place in a large disposable roasting pan.\nIn a medium bowl, mix together sage, ground black pepper, celery salt, basil, and vegetable oil. Pour mixture evenly over the turkey. Turn the turkey breast side down in the pan, and tent loosely with aluminum foil.\nPlace the roasting pan on the preheated grill. Throw a handful of the wood chips onto the coals. Close the lid, and cook for 1 hour.\nThrow about 2 more handfuls of soaked wood chips on the fire. Drizzle 1/2 the honey over the bird, and replace the foil. Close the lid of the grill, and continue cooking 1 1/2 to 2 hours, or until internal temperature reaches 180 degrees F (80 degrees C) in the thickest part of the thigh.\nUncover turkey, and carefully turn it breast side up in the roasting pan. Baste with remaining honey. Leave the turkey uncovered, and cook 15 minutes. The cooked honey will be very dark.",
    "pt": "30 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "926067.jpg",
    "o": "3052054.jpg,2915147.jpg,756748.jpg,743217.jpg,738807.jpg,720642.jpg",
    "st": "allrecipes"
}