{
    "id": 207861,
    "old_rating": "4.63636",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound yams, peeled and cubed",
        "4 eggs",
        "1 cup canola oil",
        "1 cup white sugar",
        "1 teaspoon vanilla extract",
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "2 teaspoons ground cinnamon",
        "1 teaspoon salt",
        "3 ounces cream cheese",
        "1/2 cup butter, softened",
        "1 teaspoon vanilla extract",
        "2 cups confectioners' sugar"
    ],
    "nut": [
        "Calories > 276 kcal",
        "Carbs > 32.4 g",
        "Cholesterol > 45 mg",
        "Fat > 15.4 g",
        "Protein > 2.7 g",
        "Sodium > 241 mg"
    ],
    "n": "Candied Yam Cupcakes",
    "a": "MarinaHoliday",
    "r": "0",
    "s": 24,
    "des": "\"A great use for all those leftover yams you'll have this season!\"",
    "ins": "Place a steamer insert into a large saucepan, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil over high heat. Add the yams, recover, and steam until very tender, about 15 minutes. Remove yams from steamer and allow to cool slightly.\nPreheat oven to 350 degrees F (175 degrees C). Line 2-12 cup cupcake tins with paper liners.\nPlace eggs, oil, sugar, vanilla extract, and cooked yams in a large bowl; beat with an electric mixer until light and fluffy.  Sift together flour, baking powder, baking soda, cinnamon, and salt. Stir dry ingredients into yam mixture, mixing just until combined. Pour batter into paper liners, filling 2/3 full.\nBake in preheated oven until a toothpick inserted in the center of a cupcake comes out clean, 17 to 20 minutes. Cool in pans for 5 minutes, transfer to wire rack to cool completely.\nBeat together cream cheese and butter until fluffy. Beat in the vanilla extract and confectioners sugar; mix until smooth. Frost cool cupcakes with cream cheese frosting.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "332039.jpg",
    "o": "4521201.jpg,3448184.jpg,1765147.jpg,1765113.jpg,348052.jpg,348051.jpg",
    "st": "allrecipes"
}