{
    "id": 208089,
    "old_rating": "4.57919",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 eggs",
        "4 slices bacon",
        "1/2 cup mayonnaise",
        "1/4 cup minced red onion",
        "2 teaspoons white sugar",
        "1/2 teaspoon balsamic vinegar",
        "1/4 teaspoon celery salt",
        "1/4 teaspoon freshly ground black pepper",
        "1/4 cup chopped fresh parsley"
    ],
    "nut": [
        "Calories > 79 kcal",
        "Carbs > 0.9 g",
        "Cholesterol > 96 mg",
        "Fat > 6.7 g",
        "Protein > 3.8 g",
        "Sodium > 151 mg"
    ],
    "n": "Bacon-Balsamic Deviled Eggs",
    "a": "Stephanie V",
    "r": "0",
    "s": 24,
    "des": "\"Gourmet deviled eggs with a sweet and savory mix of bacon, onion, and balsamic vinegar. Always requested and always disappears! Can be made with sugar substitute and light mayonnaise with no discernable taste difference.\"",
    "ins": "Place the eggs in a large pot in a single layer and fill with water to cover by 1 inch. Cover the saucepan and bring the water to a boil; immediately remove from the heat and let the eggs stand in the hot water for 15 minutes. Drain. Cool the eggs under cold running water in the sink. Peel and halve lengthwise. Separate the yolks from the whites, placing the yolks in a bowl; arrange the egg whites with the rounded side down onto a serving platter.\nPlace the bacon in a large, deep skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain on a paper towel-lined plate; chop.\nMash the yolks with a fork. Add the bacon, mayonnaise, onion, sugar, vinegar, celery salt, and pepper; stir until thoroughly combined. Spoon the mixture into the egg whites. Garnish with parsley.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "356397.jpg",
    "o": "4506070.jpg,4503453.jpg,4388258.jpg,3844139.jpg,3619439.jpg,3570026.jpg",
    "st": "allrecipes"
}