{
    "id": 20871,
    "old_rating": "4.1",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "2 tablespoons butter",
        "1/4 cup water",
        "1 quart oil for deep frying",
        "2 tablespoons butter",
        "1 small onion, chopped",
        "2 cloves garlic, chopped",
        "2 green chile peppers, chopped",
        "1 tablespoon fresh ginger root, chopped",
        "1/2 teaspoon ground turmeric",
        "1/2 teaspoon chili powder",
        "3/4 pound ground lamb",
        "1 teaspoon salt",
        "2 teaspoons garam masala",
        "1 1/2 tablespoons fresh lemon juice"
    ],
    "nut": [
        "Calories > 105 kcal",
        "Carbs > 7.2 g",
        "Cholesterol > 12 mg",
        "Fat > 7.3 g",
        "Protein > 2.9 g",
        "Sodium > 135 mg"
    ],
    "n": "Samosas",
    "a": "Kimber",
    "r": "0",
    "s": 30,
    "des": "\"These stuffed savory pastries are a traditional Indian favorite. Lamb meat and spices are cooked together to create a mouthwatering filling for the easy to make dough. The recipe may seem complex, but it's actually fairly simple. Enjoy!\"",
    "ins": "In a medium bowl, mix flour, salt and butter until the mixture resembles fine bread crumbs. Pour in water, using more (up to approximately 1/4 cup) if necessary to make a smooth dough. Pat into a ball. Place on a lightly floured surface and knead 10 minutes, or until dough is smooth and elastic. Return to the bowl, cover and set aside.\nHeat oil in a large, deep skillet to 375 degrees F (190 degrees C).\nMelt butter in a medium saucepan over medium high heat. Stir in onion, garlic, green chile peppers and ginger. Cook 5 minutes, or until onions are golden brown. Stir in turmeric, chili powder, ground lamb and salt. Cook until the lamb meat is evenly brown, about 10 minutes. Stir in garam masala and lemon juice. Continue cooking 5 minutes, then remove from heat.\nDivide dough into 15 equal portions. Roll portions into balls, then flatten into 4 inch circles. Cut each circle in half. Dampen edges and form semicircles into cones. Fill cones with equal portions of the lamb meat mixture. Dampen top and bottom edges of cones, and pinch to seal.\nCarefully lower cones into preheated oil a few at a time. Fry until golden brown, 2 to 3 minutes. Drain on paper towels. Serve warm.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "66569.jpg",
    "o": "4442132.jpg,3646807.jpg,2681532.jpg,329715.jpg,210760.jpg,28851.jpg",
    "st": "allrecipes"
}