{
    "id": 20962,
    "old_rating": "3.93103",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "9 lasagna noodles",
        "3 tablespoons butter",
        "1 small onion, chopped",
        "2 cloves garlic, chopped",
        "2 tablespoons all-purpose flour",
        "1/4 teaspoon ground white pepper",
        "1 teaspoon salt, divided",
        "1/8 teaspoon ground nutmeg",
        "2 1/2 cups milk",
        "2 tablespoons chopped fresh parsley",
        "1 (15 ounce) container ricotta cheese",
        "1 (10 ounce) package chopped frozen broccoli, thawed and drained",
        "1/4 cup grated Parmesan cheese",
        "2 cups shredded mozzarella cheese, divided"
    ],
    "nut": [
        "Calories > 468 kcal",
        "Carbs > 41.7 g",
        "Cholesterol > 72 mg",
        "Fat > 21.4 g",
        "Protein > 28.6 g",
        "Sodium > 858 mg"
    ],
    "n": "Broccoli Lasagna",
    "a": "MOLSON7",
    "r": "0",
    "s": 6,
    "des": "\"Broccoli lasagna with ricotta and mozzarella in a white sauce.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a medium saucepan over medium heat, melt butter.  Cook onion and garlic in butter until tender.  Stir in flour, pepper, 1/2 teaspoon salt and nutmeg.  Stirring continuously, pour in milk, a little at a time, allowing mixture to thicken.  Bring to a boil for 1 minute, then remove from heat and stir in parsley.  Set aside.\nIn a medium bowl, combine ricotta, broccoli, Parmesan, 1 cup of mozzarella and remaining 1/2 teaspoon salt.  Stir until well blended.\nIn a 7x11 inch baking dish layer: 1/4 cup white sauce; 3 noodles;  one-third of remaining white sauce;  half the broccoli mixture; 3 more noodles; half remaining white sauce; remaining broccoli mixture; 3 noodles; remaining white sauce.  Sprinkle with remaining mozzarella.  Cover with foil coated with cooking spray.\nBake in preheated oven 30 minutes.  Let stand 10 minutes before serving.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "1019430.jpg",
    "o": "",
    "st": "allrecipes"
}