{
    "id": 209691,
    "old_rating": "4.64255",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 slices bacon",
        "1 tablespoon garlic powder",
        "1 teaspoon seasoned salt",
        "1 teaspoon dried basil",
        "1 teaspoon dried oregano",
        "2 pounds pork tenderloin",
        "2 tablespoons butter",
        "2 tablespoons olive oil"
    ],
    "nut": [
        "Calories > 417 kcal",
        "Carbs > 2.4 g",
        "Cholesterol > 133 mg",
        "Fat > 25.5 g",
        "Protein > 42.3 g",
        "Sodium > 769 mg"
    ],
    "n": "Bacon Wrapped Pork Medallions",
    "a": "Eve Marie",
    "r": "0",
    "s": 4,
    "des": "\"This is variation of a recipe my mother used to make with my own spin on the seasonings!  Also, one of our favorites to enjoy around the holidays!\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C).\nPlace the bacon in a large, oven-safe skillet, and cook over medium-high heat, turning occasionally, until lightly browned and still flexible, 6 to 7 minutes. Drain the bacon slices on a paper towel-lined plate. Remove any excess bacon grease from the skillet. Combine garlic powder, seasoning salt, basil, and oregano in a small bowl. Set aside.\nWrap the pork tenderloin with the bacon strips securing with 1 or 2 toothpicks per strip of bacon. Slice the tenderloin between each bacon strip to create the medallions. Dip both sides of the medallions in seasoning mix. Melt butter and oil together in the same skillet over medium-high heat. Cook each medallion for 4 minutes on each side.\nPlace skillet into the preheated oven and bake until the pork is no longer pink in the center, 17 to 20 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "470363.jpg",
    "o": "4486535.jpg,4479450.jpg,4479440.jpg,4479064.jpg,4478527.jpg,4467017.jpg",
    "st": "allrecipes"
}