{
    "id": 209838,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons cooking oil",
        "6 skinless, boneless chicken breast halves - rinsed and patted dry",
        "salt to taste",
        "1 onion, diced",
        "2 cloves garlic, minced",
        "1 fresh jalapeno pepper, sliced into rings",
        "1 pound frozen tart cherries, thawed and roughly chopped",
        "1 pound frozen mango chunks, thawed and roughly chopped",
        "2 cups sparkling cherry juice (such as R.W. KnudsenÂ®)",
        "1/4 cup fresh lemon juice, or to taste",
        "2 tablespoons brown sugar"
    ],
    "nut": [
        "Calories > 343 kcal",
        "Carbs > 43.2 g",
        "Cholesterol > 67 mg",
        "Fat > 8.3 g",
        "Protein > 26.1 g",
        "Sodium > 71 mg"
    ],
    "n": "Mango-Cherry Chicken",
    "a": "abitquirky",
    "r": "0",
    "s": 6,
    "des": "\"I let my taste buds go on 'walk about' one afternoon at the grocery store and this recipe was the result of their adventure. It works well with chicken or pork or even right off the spoon! I recommend serving Jasmine rice as a side. It is the perfect complement.\"",
    "ins": "Heat the oil in a large, deep skillet over medium heat. Sprinkle salt over both sides of each piece of chicken; cook the chicken in the hot oil until browned on both sides, but still slightly pink in the center, 3 to 5 minutes per side. Remove chicken to a plate and set aside. Add the onion, garlic, and jalapeno pepper to the remaining oil in the skillet; cook and stir until the onion is tender and beginning to brown, 5 to 7 minutes. Stir the cherry and mango into the mixture; cook and stir until the liquid in the pan is slightly thickened, 3 to 5 minutes. Add the cherry juice, lemon juice, and brown sugar to the mixture; stir and return to a simmer.\nReturn the chicken to the pan. Ladle some of the sauce over the chicken to cover. Return the mixture to a simmer and cook until the liquid thickens and the chicken is no longer pink in the center and the juices run clear, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}