{
    "id": 210477,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup split Bengal gram (chana dal)",
        "1 cup skinned split black lentils (urad dal)",
        "1/2 cup split yellow lentils (moong dal)",
        "1 cup rice",
        "salt to taste",
        "2 dried red chile peppers, or to taste",
        "water, as needed",
        "2 tablespoons cumin seeds",
        "2 tablespoons cooking oil"
    ],
    "nut": [
        "Calories > 177 kcal",
        "Carbs > 29.9 g",
        "Cholesterol > 0 mg",
        "Fat > 2.5 g",
        "Protein > 9.1 g",
        "Sodium > 36 mg"
    ],
    "n": "Ada (Adai)",
    "a": "SUSMITA",
    "r": "0",
    "s": 15,
    "des": "\"Ada is a type of dosa (crepe) usually served at breakfast. It is made with a mixture of lentils and rice, and is quite filling. It is typically eaten with podi (south Indian spicy chutney powder) and mango pickle (avakkai). Since the batter is made with raw lentils, it gets fermented easily. It will keep in the refrigerator for 1 or 2 days maximum.\"",
    "ins": "Place the chana dal, urad dal, moong dal, and rice into a large bowl and cover with several inches of cool water; allow to soak 8 hours to overnight.\nGrind the soaked dal and rice with the salt and red chile peppers into a paste using a mortar and pestle. Add enough water to the mixture to make a batter just thin enough to spread. Stir the cumin seeds into the batter.\nHeat a griddle (or a tawa) over medium heat. Gently grease the griddle with oil on the edges and the middle. Ladle the batter on the tawa and spread into a thin circle using the back of the ladle or a large spoon. Cook for a few minutes and flip over to the other side. Cook a few more minutes, transfer to a plate, and serve immediately. Adas are best eaten hot off the griddle.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "8 h ",
    "i": "3022085.jpg",
    "o": "",
    "st": "allrecipes"
}