{
    "id": 210510,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 large red beets - trimmed, peeled, and cut into cubes",
        "3 potatoes, peeled and cut into small cubes",
        "2 tablespoons vegetable oil",
        "1/2 teaspoon skinned split black lentils (urad dal)",
        "1/2 teaspoon mustard seed",
        "1/2 teaspoon cumin seed",
        "2 dried red chile peppers, broken into pieces",
        "1 pinch asafoetida powder",
        "6 fresh curry leaves",
        "1/2 teaspoon ground red pepper",
        "1/4 cup flaked coconut"
    ],
    "nut": [
        "Calories > 321 kcal",
        "Carbs > 55.3 g",
        "Cholesterol > 0 mg",
        "Fat > 9 g",
        "Protein > 7.9 g",
        "Sodium > 217 mg"
    ],
    "n": "Beetroot Aloo Koora",
    "a": "SUSMITA",
    "r": "0",
    "s": 4,
    "des": "\"This is one of my favorite ways to eat beetroot. The color is so vibrant. The sweetness of the beets works great with potatoes and the spices. This is an Andhra style dry koora, so eat with rice and ghee.\"",
    "ins": "Place the beets and potatoes in separate bowls, each with enough water to cover. Set aside to soak until you need them.\nHeat the oil in a large skillet over medium-high heat. Cook the lentils, mustard seed, cumin seed, and red chile peppers in the hot oil until the seeds begin to splutter, about 30 seconds. Stir the asafoetida and curry leaves into the mixture and cook another few seconds.\nDrain the beets and potatoes and add to the skillet. Cook and stir until they begin to brown, about 5 minutes. Reduce heat to medium-low, cover, and continue cooking until the potatoes and beets are soft, about 20 minutes more. If there is excess water in the pan, increase the heat to high and cook until the water evaporates completely. Stir the red pepper and coconut into the mixture and serve immediately.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "1049904.jpg",
    "o": "",
    "st": "allrecipes"
}