{
    "id": 210528,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup flaked coconut",
        "1 tablespoon coriander seeds",
        "1 teaspoon cumin seeds",
        "1 tablespoon split Bengal gram (chana dal)",
        "2 green chile peppers, chopped",
        "2 cups plain yogurt",
        "1 cup water",
        "1 pinch salt, to taste",
        "1/2 cup cut fresh green beans",
        "1/2 cup cubed potatoes",
        "1/2 cup sliced plantain",
        "1/2 cup diced carrot",
        "2 tablespoons cooking oil",
        "1 teaspoon cumin seeds",
        "1 teaspoon mustard seeds",
        "2 dried red chile peppers, broken into pieces",
        "1/4 teaspoon caraway seeds",
        "1 sprig fresh curry leaves"
    ],
    "nut": [
        "Calories > 265 kcal",
        "Carbs > 31.3 g",
        "Cholesterol > 7 mg",
        "Fat > 12.4 g",
        "Protein > 9.8 g",
        "Sodium > 132 mg"
    ],
    "n": "Aviyal",
    "a": "SUSMITA",
    "r": "0",
    "s": 4,
    "des": "\"Aviyal is a south-Indian delicacy and seems like no two households make it the same. Essentially, all the recipes use the same ingredients Â– vegetables, curds(yogurt), coconut , spices Â– but the details and proportions vary. This is my mother's Andhra recipe for Aviyal. I hope you like it as much as we do.\"",
    "ins": "Place the coconut, coriander seeds, cumin seeds, and chana dal in a container and cover with a few inches of cool water; allow the mixture to soak for 2 hours. Drain. Using a mortar and pestle, grind the mixture with the green chile peppers into a paste. Stir the yogurt into the mixture.\nBring the water and salt to a boil in a pot. Add the green beans, potatoes, plantain, and carrot to the water and return to a boil; cook until tender. Reduce heat to low and stir the yogurt mixture into the vegetables; simmer the vegetables in the yogurt mixture for about 5 minutes, but do not allow to boil.\nHeat the oil in a small skillet. Fry the cumin seeds, mustard seeds, red chile peppers, and caraway seeds in the hot oil until they splutter. Add the curry leaves to the mixture and fry together another 30 seconds. Stir the mixture into the vegetable mixture and serve.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "2 h ",
    "i": "592718.jpg",
    "o": "",
    "st": "allrecipes"
}