{
    "id": 210519,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 eggs",
        "1/2 teaspoon fennel seeds",
        "1/2 teaspoon cumin seeds",
        "1/2 teaspoon whole black peppercorns",
        "3 tablespoons cooking oil",
        "1/2 teaspoon ground turmeric",
        "1 large onion, sliced thin",
        "2 tomatoes, chopped",
        "6 cloves garlic, minced",
        "1 tablespoon minced fresh ginger root",
        "1 teaspoon ground red pepper",
        "1/2 teaspoon ground coriander",
        "1 cup water",
        "1/4 cup shredded coconut",
        "1/4 cup jaggery (palm sugar)",
        "1/2 teaspoon tamarind paste",
        "salt to taste",
        "1/4 cup chopped fresh cilantro leaves"
    ],
    "nut": [
        "Calories > 166 kcal",
        "Carbs > 13.1 g",
        "Cholesterol > 163 mg",
        "Fat > 10.4 g",
        "Protein > 6.4 g",
        "Sodium > 144 mg"
    ],
    "n": "Egg Kulambu",
    "a": "SUSMITA",
    "r": "0",
    "s": 8,
    "des": "\"Kulambu is a Tamililan spicy stew-like preparation. The main flavours are from tamarind and jaggery or sugar. This is a delicious kulambu using boiled eggs. You can easily use fish or crab instead of the eggs.\"",
    "ins": "Place the eggs into a saucepan in a single layer and fill with water to cover by 1 inch. Cover the saucepan and bring the water to a boil; remove from the heat and let the eggs stand in the hot water for 15 minutes; drain. Run cold water over the eggs to cool completely; peel. Cut 4 slits into each of the eggs.\nRoast the fennel seeds, cumin seeds, and peppercorns in a small skillet over medium heat until very fragrant; grind into powder. Set aside.\nHeat the oil in a large skillet or kadhai over medium heat. Stir the turmeric into the oil. Quickly fry the eggs in the hot oil on all sides, about 2 minutes. Remove and set aside.\nCook the onions in the hot oil until golden brown; add the ginger, garlic, and tomatoes and continue cooking until the tomatoes are soft. Stir the ground seed mixture, ground red pepper, and ground coriander into the onion mixture and cook another 1 to 2 minutes. Pour the water into the skillet. Add the coconut, jaggery, tamarind, and salt; return to a boil and cook until the mixture thickens, about 5 minutes. Reduce heat to medium-low; add the eggs and allow to simmer another 10 minutes.  If the gravy is too thick, thin out with a little water. Garnish with the cilantro leaves to serve.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "2621386.jpg",
    "o": "",
    "st": "allrecipes"
}