{
    "id": 210639,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 cups milk",
        "3 tablespoons fresh lime juice",
        "2 1/2 cups white sugar",
        "6 cups water",
        "1 teaspoon ground cardamom"
    ],
    "nut": [
        "Calories > 134 kcal",
        "Carbs > 28.7 g",
        "Cholesterol > 6 mg",
        "Fat > 1.5 g",
        "Protein > 2.4 g",
        "Sodium > 32 mg"
    ],
    "n": "Rasgullas",
    "a": "SUSMITA",
    "r": "0",
    "s": 20,
    "des": "\"If you are intimidated by the idea of making rasgullas at home, please do not be any longer. I was too, until one day I tried it and realized I was worried for no reason all these years. They are quite easy and super quick to make. Give these a try.\"",
    "ins": "Bring the milk to a boil in a heavy-bottomed pan till it starts foaming; immediately add the lime juice and stir. It will curdle right away. You should see the milk solids (chenna) separate from the whey. Pour into a colander lined with cheesecloth; rinse the chenna with cold water to get rid of the lime juice. Allow the water to drain completely.\nGather the muslin cloth edges like a parcel and express as much water as possible; what you now have is soft paneer. Turn the paneer onto a rolling mat or other smooth surface. Knead the paneer well to make a smooth paste. Roll into a ball and divide into 20 equal portions.\nBring the water to a boil in a pressure cooker; stir the sugar into the boiling water until dissolved.\nRoll each portion of paneer into a smooth ball between your palms, making sure there are no cracks; gently drop the balls into the hot syrup. Secure the lid onto the pressure cooker and bring to pressure. Reduce heat to medium-low and pressure cook for 6 minutes.\nRelease the pressure from the cooker while running under water; remove the lid. The rasgullas should be floating on the syrup and have expanded 2 or 3 times in size. Pour the rasgullas and syrup into a bowl. Gently stir the cardamom into the mixture. Refrigerate to chill completely before serving cold.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "564413.jpg",
    "o": "",
    "st": "allrecipes"
}