{
    "id": 21074,
    "old_rating": "4.46667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground cloves",
        "1 teaspoon ground nutmeg",
        "1 teaspoon baking soda",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 1/2 cups white sugar",
        "1 cup butter",
        "3 eggs, beaten",
        "1 cup buttermilk",
        "1 cup chopped fresh figs",
        "1 cup chopped pecans",
        "1/2 cup butter",
        "1/2 cup white sugar",
        "1/2 cup evaporated milk",
        "1/2 teaspoon baking soda"
    ],
    "nut": [
        "Calories > 349 kcal",
        "Carbs > 37.2 g",
        "Cholesterol > 74 mg",
        "Fat > 21.4 g",
        "Protein > 4.2 g",
        "Sodium > 332 mg"
    ],
    "n": "Fig Cake I",
    "a": "MRS.CAJUN COOK",
    "r": "0",
    "s": 18,
    "des": "\"A cake that makes your whole house smell good.\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C). Grease a 9x13 inch pan. Mix together the flour, cinnamon, cloves, nutmeg, 1 teaspoon baking soda, baking powder and salt. Set aside.\nIn a large bowl, cream together 1 cup butter and 1 1/2 cup sugar until light and fluffy.  Stir in the eggs.  Beat in the flour mixture alternately with the buttermilk, mixing just until incorporated.  Fold in the chopped figs and pecans.\nPour batter into prepared pan. Bake in the preheated oven for 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\nTo make the icing:    In a large saucepan, mix together butter, sugar, evaporated milk and baking soda.  Bring to a boil, stirring until sugar is dissolved. Then cook without stirring until the mixture turns brown, or until it reaches the soft ball stage on a candy thermometer (234 degrees F - 115 degrees C). Cool to lukewarm (110 degrees F). Pour into a small bowl and beat until it thickens to spreading consistency.  Quickly spread icing onto the cooled cake.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "1022979.jpg",
    "o": "2744388.jpg,968427.jpg,682305.jpg,675632.jpg,510076.jpg,510074.jpg",
    "st": "allrecipes"
}