{
    "id": 211127,
    "old_rating": "4.60396",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons canola oil",
        "3 pounds boneless pork shoulder, cut into 1 1/2-inch cubes",
        "2 fresh poblano peppers, roughly chopped, or more to taste",
        "3 jalapeno peppers, roughly chopped, or more to taste",
        "1 serrano pepper, roughly chopped, or more to taste",
        "1 large onion, roughly chopped",
        "4 cloves garlic, roughly chopped",
        "2 teaspoons ground coriander",
        "3 teaspoons ground cumin",
        "1 1/2 cups beef broth"
    ],
    "nut": [
        "Calories > 153 kcal",
        "Carbs > 2.8 g",
        "Cholesterol > 43 mg",
        "Fat > 8.6 g",
        "Protein > 15.5 g",
        "Sodium > 131 mg"
    ],
    "n": "Pressure Cooker Carnitas",
    "a": "yellowpairs â™¥",
    "r": "0",
    "s": 12,
    "des": "\"Perfect for taco bars! This can be easily adapted to a slow cooker, but the pressure cooker really seals in the flavor and cuts down on cooking time. All the leftover broth from the pressure cooker is packed full of flavor, great as a starter for chile verde, and freezes well. Serve carnitas with white corn tortillas, guacamole and pico.\"",
    "ins": "Place the oil into a pressure cooker over medium-high heat. Brown the pork cubes on all sides in the hot oil, and stir in the poblano, jalapeno, and serrano peppers, onion, garlic, coriander, cumin, and beef broth. Lock the lid onto the pressure cooker, bring the cooker up to pressure, and reduce heat to keep the pressure steady.\nCook under medium steady pressure for 1 hour, remove the cooker from the heat, place in the sink, and run cold water over the lid of the cooker until the pressure has been released. Carefully remove the lid, and serve.",
    "pt": "25 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4464071.jpg",
    "o": "4464071.jpg,3537906.jpg,3062107.jpg,1088609.jpg,1084868.jpg,470354.jpg",
    "st": "allrecipes"
}