{
    "id": 211210,
    "old_rating": "4.26667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 acorn squash, halved and seeded",
        "1 (6 ounce) package dry corn bread stuffing mix",
        "2 teaspoons butter",
        "1 onion, diced",
        "1 clove garlic, minced",
        "1 cup chopped fresh mushrooms",
        "1 cup long grain and wild rice mix",
        "2 sprigs fresh sage, chopped",
        "2 cups vegetable stock"
    ],
    "nut": [
        "Calories > 187 kcal",
        "Carbs > 39.2 g",
        "Cholesterol > 3 mg",
        "Fat > 2.1 g",
        "Protein > 5.1 g",
        "Sodium > 637 mg"
    ],
    "n": "Wild Rice Stuffed Acorn Squash",
    "a": "sherry",
    "r": "0",
    "s": 8,
    "des": "\"A filling vegetarian main course dish, squash stuffed with stuffing and rice!\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Lightly grease 2 baking pans, and place the cleaned-out squash, cut sides down, into the pans. Bake in the preheated oven until barely soft to the touch, about 25 minutes.\nMake the stuffing mix as instructed on the package, and set aside.\nMelt the butter over medium heat in a saucepan, and cook and stir the onion and garlic until the onion is translucent, about 10 minutes. Stir in the mushrooms, and cook and stir until they give up their juice, about 5 more minutes. Add the rice mix and sage, and cook and stir the rice and vegetables until the vegetables begin to brown, about 5 minutes. Pour in the vegetable stock, stir to combine, cover, and reduce heat. Simmer the rice mixture until tender, 30 to 40 minutes.\nLightly mix the cooked rice mixture with the stuffing in a bowl, and pile the mixture into the centers of the squash without packing it. Return the stuffed squash to the oven and bake until the squash are tender and the stuffing is hot, about 15 more minutes.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "2748403.jpg",
    "o": "4529230.jpg,4066515.jpg,3087063.jpg,2749227.jpg,492536.jpg,326346.jpg",
    "st": "allrecipes"
}