{
    "id": 211401,
    "old_rating": "4.71528",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound Brussels sprouts, cleaned and trimmed",
        "2 slices bacon, cut into 1/2 inch pieces",
        "salt and ground black pepper to taste",
        "1/2 cup heavy cream",
        "1/4 cup bread crumbs",
        "1/4 cup grated Parmesan cheese",
        "2 tablespoons butter, cut into tiny pieces"
    ],
    "nut": [
        "Calories > 312 kcal",
        "Carbs > 15.8 g",
        "Cholesterol > 70 mg",
        "Fat > 25.4 g",
        "Protein > 8 g",
        "Sodium > 586 mg"
    ],
    "n": "Brussels Sprouts Gratin",
    "a": "Creative Caterer",
    "r": "0",
    "s": 4,
    "des": "\"A great way to have Brussels sprouts with a little more flair.  The cream takes away the bitterness you usually find in Brussels.  This is a family favorite during the holidays!\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C). Lightly grease a baking dish.\nBring a large pot of lightly salted water to a boil. Add the Brussels sprouts and cook uncovered until tender, about 8 minutes. Drain in a colander, then immediately immerse in ice water for several minutes until cold to stop the cooking process. Once the Brussels sprouts are cold, drain well, and cut in halves or quarters, depending on size. Set aside.\nMeanwhile, place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until limp and lightly browned, about 5 minutes. Reduce heat and stir in the Brussels sprouts. Season with salt and pepper then toss for about 1 minutes to evenly distribute the seasonings. Arrange bacon and Brussels sprouts on the prepared baking dish. Pour cream evenly over the Brussels sprouts, then sprinkle breadcrumbs and Parmesan cheese on top. Distribute pieces of butter over the bread crumbs.\nBake in the preheated oven until golden brown and heated through, 20 to 25 minutes.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "1043500.jpg",
    "o": "4508385.jpg,4469582.jpg,4462450.jpg,4459344.jpg,4455560.jpg,4425068.jpg",
    "st": "allrecipes"
}