{
    "id": 211522,
    "old_rating": "3.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound beef stew meat, cut into bite-size pieces",
        "6 cups water, plus more if desired",
        "1 bay leaf",
        "2 (14.5 ounce) cans canned diced tomatoes with their juice",
        "4 carrots, cut into 1/4 inch rounds",
        "4 stalks celery, cut into bite-size pieces",
        "1 rutabaga, peeled and cut into bite-size pieces",
        "1 large sweet onion, chopped",
        "1/2 cup uncooked pearl barley",
        "1 (10 ounce) package frozen white corn",
        "1 (10 ounce) package frozen cut green beans",
        "1 (10 ounce) package frozen baby lima beans (optional)",
        "seasoned salt (such as MortonÂ® Nature's SeasonsÂ® Seasoning Blend) to taste"
    ],
    "nut": [
        "Calories > 107 kcal",
        "Carbs > 12.8 g",
        "Cholesterol > 13 mg",
        "Fat > 3.9 g",
        "Protein > 5.7 g",
        "Sodium > 107 mg"
    ],
    "n": "Grandma Coffee's Beef Barley Vegetable Soup",
    "a": "jmbwarner",
    "r": "0",
    "s": 24,
    "des": "\"A wonderful family recipe, passed down by my mother (nicknamed Grandma Coffee by my daughters). This recipe gets a unique flavor from the rutabaga used in place of potatoes.  The rutabaga gives it a wonderful flavor, and will not fall apart like potatoes tend to do in soup. I freeze half, and use half immediately. Enjoy with some crusty sourdough or French bread and a garden salad.   \n\"",
    "ins": "Place the beef, water, and bay leaf in a large soup pot over medium heat, and cook until the beef is very tender, about 1 hour. Stir in the tomatoes, carrots, celery, rutabaga, onion, and pearl barley, and simmer until the vegetables are tender, about 30 minutes. Add the frozen white corn, green beans, and lima beans, season to taste, and simmer an additional 15 to 20 minutes, until the frozen vegetables are tender. Add more water if the soup is too thick.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}