{
    "id": 211541,
    "old_rating": "4.81212",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup all-purpose flour",
        "1 teaspoon salt",
        "1 tablespoon ground black pepper",
        "1/2 teaspoon ground cumin",
        "1 (3 pound) boneless pork shoulder roast, trimmed of excess fat and cut into 1-inch cubes",
        "2 tablespoons olive oil, or more if needed",
        "1 large onion, chopped",
        "3 cloves garlic, minced",
        "2 cups chopped fresh tomatillos",
        "1 (7 ounce) can diced green chiles, drained",
        "2 fresh jalapeno peppers, seeded and chopped",
        "2 teaspoons dried marjoram",
        "1/2 cup chopped fresh cilantro",
        "1 cup water",
        "1 pinch salt, or to taste (optional)",
        "2 tablespoons sour cream, divided",
        "6 sprigs cilantro"
    ],
    "nut": [
        "Calories > 346 kcal",
        "Carbs > 18 g",
        "Cholesterol > 88 mg",
        "Fat > 16.1 g",
        "Protein > 32 g",
        "Sodium > 839 mg"
    ],
    "n": "Pork Stew in Green Salsa (Guisado de Puerco con Tomatillos)",
    "a": "PLATO712",
    "r": "0",
    "s": 6,
    "des": "\"My Mexican husband was shocked at how authentic this recipe was to his mom's and grandmother's recipe. This is a delicious, not too spicy, authentic Mexican pork stew that is easy to make and a recipe that everyone in your family will enjoy. Serve with Spanish rice and warm tortillas.\"",
    "ins": "Stir together the flour, 1 teaspoon salt, pepper, and cumin in a large bowl. Place the cubed pork into the mixture, and stir well to coat the meat with the seasonings.\nHeat the olive oil in a large, heavy pan or Dutch oven over medium-high heat until the oil shimmers. Working in batches if necessary, place the meat into the hot pan in a single layer. Pan-fry the pork until brown on all sides, about 15 minutes. Remove the pork to a bowl, and cover to keep warm.\nCook and stir the onion in the hot pan over medium heat, adding more olive oil if necessary, until the onion is translucent and beginning to brown, about 7 minutes. Return the meat to the pan and stir in the garlic, tomatillos, chiles, marjoram, chopped cilantro, and water. Check seasoning and add 1 pinch of salt to taste, if needed. Cover and simmer over low heat, stirring occasionally, until the meat is tender, about 1 hour. Skim excess fat off the stew before serving in bowls, garnished with a dollop of sour cream and a cilantro sprig on each bowl.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "3883585.jpg",
    "o": "3883585.jpg,2996029.jpg,2411226.jpg,2364913.jpg,2337779.jpg,1627344.jpg",
    "st": "allrecipes"
}