{
    "id": 211830,
    "old_rating": "4.60573",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 pounds small new potatoes",
        "3/4 cup olive oil",
        "1/4 cup melted butter",
        "1 cup grated Parmesan cheese",
        "1 tablespoon dried basil",
        "1 tablespoon dried oregano",
        "1/2 teaspoon dried thyme leaves",
        "1/2 teaspoon dried rosemary, crumbled",
        "1/2 teaspoon garlic powder",
        "1 teaspoon crushed red pepper flakes",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "3 tablespoons minced fresh parsley",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 207 kcal",
        "Carbs > 20.5 g",
        "Cholesterol > 11 mg",
        "Fat > 12.3 g",
        "Protein > 4.7 g",
        "Sodium > 232 mg"
    ],
    "n": "Bada Bing Bada Banged Potatoes",
    "a": "CJ McD",
    "r": "0",
    "s": 20,
    "des": "\"These potatoes are easy to prepare and are a great crowd pleaser.  The herbs and cheese really bump up the flavor.  You can prep them ahead then finish them on the grill or oven.  The name of the dish makes people laugh--until they taste them.  Then all you'll here is ooo's and aaah's.\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C).\nPlace the potatoes in a large saucepan of water.  Cover; bring to a boil over high heat. Reduce heat; gently cook potatoes until tender but still firm, about 20 minutes. Drain.\nPlace potatoes on a greased, rimmed baking sheet. Smash the warm potatoes with the heel of your hand or a small pan to flatten slightly and break the skin.\nMix together the olive oil, butter, 1 cup Parmesan cheese, basil, oregano, thyme, rosemary, garlic powder, red pepper flakes, salt, and pepper in a large bowl; add the potatoes and toss well.  Return coated potatoes to baking sheet, leaving 1/2 inch space between each potato.\nRoast potatoes in the preheated oven until lightly browned and slightly crispy; about 30 minutes. Place hot potatoes on a large platter; sprinkle with parsley and the remaining 1/2 cup Parmesan cheese.",
    "pt": "10 m",
    "ct": "50 m",
    "tt": "1 h",
    "i": "4503750.jpg",
    "o": "4472972.jpg,3313605.jpg,3183620.jpg,2601786.jpg,1608407.jpg,1036201.jpg",
    "st": "allrecipes"
}