{
    "id": 211847,
    "old_rating": "4.6457",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound bacon, diced",
        "5 cups chicken stock",
        "2 tablespoons butter",
        "1/2 onion, diced",
        "4 cloves garlic, minced",
        "1 1/2 cups Arborio rice",
        "2 tablespoons butter",
        "1/4 cup grated Parmesan cheese",
        "salt and black pepper to taste"
    ],
    "nut": [
        "Calories > 557 kcal",
        "Carbs > 73.8 g",
        "Cholesterol > 56 mg",
        "Fat > 21.5 g",
        "Protein > 15.9 g",
        "Sodium > 1444 mg"
    ],
    "n": "Bacon Risotto",
    "a": "FURFNSLO",
    "r": "0",
    "s": 4,
    "des": "\"Creamy risotto with crisp bacon. Plate the risotto and add one raw egg yolk to each serving if desired, allowing the diner to break the yolk and stir into the rice.\"",
    "ins": "Cook and stir the diced bacon in a large skillet over medium heat until browned, about 10 minutes. Drain the bacon  and reserve.\nBring the chicken stock to a boil in a saucepan over high heat; reduce heat to low to keep the chicken stock hot.\nHeat 2 tablespoons butter in a large, heavy-bottomed saucepan over medium-high heat. Add the onion and garlic; cook and stir until the onion begins to turn golden brown at the edges, about 2 minutes. Pour in the rice and stir until the rice is coated in butter and has started to toast, 2 to 3 minutes. Reduce heat to medium; stir in one-third of the hot chicken stock and continue stirring until the rice has absorbed the liquid and turned creamy. Repeat this process twice more, stirring constantly. Stirring in the broth should take 15 to 20 minutes in all. When finished, the rice should be tender, yet slightly firm.\nRemove the risotto from the heat and stir in the remaining 2 tablespoons of butter, the Parmesan cheese, and the reserved bacon. Season to taste with salt and pepper before serving.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "4520845.jpg",
    "o": "4520845.jpg,4509137.jpg,4503686.jpg,4477593.jpg,4473165.jpg,4472823.jpg",
    "st": "allrecipes"
}