{
    "id": 212065,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound bulk sage-flavored pork sausage",
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "1/2 cup chopped celery",
        "1/4 cup chopped onion",
        "2 teaspoons chopped fresh sage",
        "1 Golden Delicious apple - peeled, cored, and diced",
        "2 teaspoons chicken soup base",
        "1/2 cup water",
        "3/4 cup apple cider",
        "1/2 loaf Italian bread, cubed"
    ],
    "nut": [
        "Calories > 479 kcal",
        "Carbs > 54.8 g",
        "Cholesterol > 41 mg",
        "Fat > 21.6 g",
        "Protein > 15.8 g",
        "Sodium > 1425 mg"
    ],
    "n": "Sage Sausage and Cider Stuffing",
    "a": "Terry E.",
    "r": "0",
    "s": 4,
    "des": "\"My family, as far back as I can remember loves stuffing that is moist, full of sage and as my wife calls it, 'mushy.' The layers of flavors in this one passed the family test and is now considered a winner for the holiday season.\"",
    "ins": "Preheat an oven to 375 degrees F (190 degrees C). Grease a 2-quart baking dish.\nHeat a large skillet over medium-high heat. Cook and stir the sausage in the skillet until crumbly, evenly browned, and no longer pink. Drain and discard any excess grease; set the sausage aside in a mixing bowl. Melt the butter and olive oil in the skillet over medium heat; stir in the celery and onion. Cook and stir until the onion has softened and turned translucent, about 5 minutes.\nStir the cooked sausage into the onions along with the sage and apples. Continue cooking until the apples are just turning soft, about 5 minutes more. Whisk the chicken soup base and water together in a bowl until dissolved. Add the apple cider; stir in the sausage mixture along with the bread cubes until the bread is moist. Pack the stuffing into the prepared baking dish.\nBake uncovered in the preheated oven until lightly browned and the edges are crisp, about 30 minutes.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "293697.jpg",
    "o": "",
    "st": "allrecipes"
}