{
    "id": 212346,
    "old_rating": "4.61111",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/3 cup all-purpose flour",
        "salt and pepper to taste",
        "1 tablespoon olive oil",
        "1 tablespoon butter",
        "4 (5 ounce) skinless, boneless chicken breast halves",
        "1/4 cup finely chopped red onion",
        "1/2 cup low-sodium chicken broth",
        "1/2 cup dry white wine",
        "1 tablespoon Dijon mustard",
        "2 tablespoons sour cream",
        "1 tablespoon chopped fresh tarragon"
    ],
    "nut": [
        "Calories > 301 kcal",
        "Carbs > 11 g",
        "Cholesterol > 94 mg",
        "Fat > 9.7 g",
        "Protein > 34.7 g",
        "Sodium > 227 mg"
    ],
    "n": "Creamy Mustard and Tarragon Chicken",
    "a": "blancdeblanc",
    "r": "0",
    "s": 4,
    "des": "\"These lightly breaded chicken breasts are bathed in a creamy tarragon and mustard sauce. They're quick to fix as a weeknight meal yet fancy enough for company!\"",
    "ins": "Place the flour in a shallow dish and season lightly with salt and pepper.  Heat the olive oil and butter in a large skillet over medium-high heat. Season the chicken breasts with salt and pepper and dredge each in the flour.\nCook the chicken in the hot oil and butter until golden, about 3 minutes. Flip chicken and brown on the other side, 3 additional minutes.  Remove chicken from skillet and tent with foil.\nReduce heat to medium. Stir the red onion into the oil and butter that remains in the skillet. Cook until softened, 2 to 3 minutes. Pour the chicken broth into the pan, and simmer while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Pour in the wine and bring back to a simmer.  Cook the sauce until reduced by half, about 3 minutes. Return chicken to the pan along with any juices that have accumulated. Simmer chicken in the sauce until it is cooked through and no longer pink in the center, 3 to 4 minutes. Transfer chicken to a warmed platter.\nWhisk the mustard and sour cream into the sauce; stir in the tarragon. Spoon sauce over chicken to serve.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "998263.jpg",
    "o": "",
    "st": "allrecipes"
}