{
    "id": 212394,
    "old_rating": "4.89474",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 plastic face mask (from crafts store)",
        "2 (3 ounce) packages prosciutto",
        "2 pimento-stuffed green olives",
        "24 ounces cream cheese, softened",
        "6 ounces shredded Cheddar cheese",
        "6 ounces shredded Havarti cheese",
        "1/2 cup pitted green olives, chopped",
        "1/4 cup roasted red peppers, drained and chopped"
    ],
    "nut": [
        "Calories > 189 kcal",
        "Carbs > 1 g",
        "Cholesterol > 54 mg",
        "Fat > 17.8 g",
        "Protein > 6.9 g",
        "Sodium > 427 mg"
    ],
    "n": "Flayed Man Cheese Ball",
    "a": "Tara",
    "r": "0",
    "s": 24,
    "des": "\"This is a cheese ball cleverly disguised as a skinned human face. So gross and yet SOOOooo good! Arrange crackers, pretzels, or any snacks you want around the face and serve with a knife!\"",
    "ins": "Lightly coat plastic face mask with cooking spray (see Cook's Notes). Line the face mask with plastic wrap, taking care to press it down fully into the nose and eyes.\nReserve two or three slices of prosciutto and set aside. Tear the remaining slices of prosciutto into strips and lay them into the mask to form the \"muscle tissue.\" Start around the eyes, leaving eyes blank, and then create the cheeks, chin, and forehead.\nTake the two whole green olives and position them in the eye holes, pimento side-down. Set the mask aside.\nCombine the softened cream cheese, Cheddar, and Havarti cheeses in a mixing bowl. Add the chopped green olives and roasted red peppers. Use an electric mixer or clean hands to mix until thoroughly combined.\nTake a heaping spoonful of the cheese mixture and arrange it to form an eye around one olive, and then the other. Gently lay handfuls of the cheese mixture all around the mask, taking care not to move the slices of prosciutto. Press the cheese down as you work to fill in all of the crevices. When the mask is full, gently press in the cheese mixture all around the mask. Refrigerate for at least 30 minutes.\nInvert the mask onto a serving platter and gently remove the mask and the plastic wrap. You should be left with a gorgeous (and freaky) face. If there is cheese showing around the bottom edges, use the reserved prosciutto slices to cover it before serving.",
    "pt": "1 h",
    "ct": "",
    "tt": "",
    "i": "4475511.jpg",
    "o": "4475511.jpg,4217239.jpg,4086533.jpg,4082796.jpg,4082439.jpg,4081650.jpg",
    "st": "allrecipes"
}