{
    "id": 212458,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 fresh lamb kidneys, rinsed and outer membrane removed",
        "1 1/2 tablespoons butter",
        "1 large onion, thinly sliced",
        "1 clove garlic, minced, or more to taste",
        "1 teaspoon mild curry powder (optional)",
        "1 cup white wine, or as needed",
        "2 teaspoons tomato paste, or to taste",
        "2 1/2 tablespoons heavy cream (optional)"
    ],
    "nut": [
        "Calories > 239 kcal",
        "Carbs > 7.2 g",
        "Cholesterol > 425 mg",
        "Fat > 10.5 g",
        "Protein > 17.7 g",
        "Sodium > 169 mg"
    ],
    "n": "Ol' Man's Kidneys",
    "a": "Matthew Branch",
    "r": "0",
    "s": 4,
    "des": "\"Comfort food from my youth. Sunday breakfast at its best. Guaranteed to change your mind about kidneys. Thanks to my old man for the recipe. Best served with scrambled eggs on toast with grilled tomatoes and field mushrooms.\n\"",
    "ins": "Make a slice the long way, partly through the back of each kidney (the side opposite the ducts), and spread the kidney, cut side down, onto a cutting board. With a sharp knife, slice as much meat off each side of the kidney as possible, leaving the duct \"tree\" intact. Discard the duct portion. Repeat with each kidney.\nHeat the butter in a large skillet over medium heat, and cook and stir the onion, garlic, and curry powder until the onion is soft and translucent, 5 to 8 minutes. Pour about 1/4 cup of white wine into the onion mixture, turn the heat to low, and stir to scrape up and dissolve any brown bits of flavor from the bottom of the skillet. Place the kidneys into the skillet, and gently simmer until tender but not overcooked, about 10 minutes. Turn the kidneys over about halfway through cooking. As the wine reduces, continue to add more, about 1/4 to 1/3 cup at a time.\nWhen the kidneys are no longer pink and the wine has reduced, stir in tomato paste until well combined. Serve hot with a dollop of cream drizzled over each serving, if desired.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}