{
    "id": 212484,
    "old_rating": "4.38462",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 cups peeled, cubed sweet potatoes",
        "4 eggs, separated",
        "1/4 cup butter, softened",
        "1/4 teaspoon salt",
        "1/4 cup raisins",
        "1/4 cup coarsely chopped walnuts",
        "1/4 cup sugar"
    ],
    "nut": [
        "Calories > 236 kcal",
        "Carbs > 31.1 g",
        "Cholesterol > 108 mg",
        "Fat > 10.7 g",
        "Protein > 5.5 g",
        "Sodium > 204 mg"
    ],
    "n": "Sweet Potato Puff",
    "a": "Dan",
    "r": "0",
    "s": 8,
    "des": "\"Creamy, fluffy, rich sweet potatoes with a meringue top.  Enjoy sweet potatoes' natural sweetness without drowning it in sugar. This is everyone's favorite. We can't serve Thanksgiving dinner without it!\"",
    "ins": "Place the cubed sweet potatoes into a large pot and cover with water. Bring to a boil, then reduce heat to medium-low, and simmer until tender, about 30 minutes. Drain and let cool.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 9x9 inch baking dish.\nPlace the cooked sweet potatoes, egg yolks, butter, and salt into the work bowl of an electric mixer, and beat on high speed until the sweet potatoes are creamy and smooth, 3 to 5 minutes. Spoon the sweet potato mixture into the prepared baking dish, and level the top with a spoon. Sprinkle raisins and walnuts over the top of the casserole, and lightly press them into the surface of the sweet potatoes.\nIn a mixing bowl, beat the egg whites until foamy, about 1 minute. Gradually pour in the sugar and continue beating until the meringue is glossy and holds soft peaks, 2 to 3 more minutes. Spread the meringue over the casserole.\nBake in the preheated oven until the casserole is hot and the meringue is lightly browned, about 30 minutes.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "516149.jpg",
    "o": "",
    "st": "allrecipes"
}