{
    "id": 212482,
    "old_rating": "4.42308",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (3 pound) boneless turkey breast roast, thawed",
        "1/2 cup pure maple syrup, or more as needed",
        "1 teaspoon liquid smoke flavoring (optional)",
        "1 teaspoon ground paprika",
        "1/2 teaspoon salt",
        "1/2 teaspoon pepper",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon onion powder",
        "1/2 teaspoon dried crushed thyme",
        "1 pinch cayenne pepper, or to taste"
    ],
    "nut": [
        "Calories > 351 kcal",
        "Carbs > 32.9 g",
        "Cholesterol > 120 mg",
        "Fat > 5.9 g",
        "Protein > 40.1 g",
        "Sodium > 1734 mg"
    ],
    "n": "Maple Glazed Turkey Roast",
    "a": "Michelle Berger",
    "r": "0",
    "s": 6,
    "des": "\"A great way to make make a flavorful turkey roast for any night of the week. It's also great when you're having just a handful of people for Thanksgiving.\"",
    "ins": "Preheat an oven to 325 degrees F (165 degrees C).\nRemove the plastic netting and wrap from the turkey roast, if any, but leave on string netting. (Remove and discard gravy packet, if any). Rinse the turkey, and pat dry with paper towels.\nMix together the maple syrup, smoke flavoring, paprika, salt, pepper, garlic powder, onion powder, thyme, and cayenne pepper in a bowl, stirring to combine well. Brush the syrup mixture all over the turkey roast.\nPlace the roast, skin side up, on a baking rack set in a roasting pan. Roast in the preheated oven, basting occasionally, until the roast is golden brown and a meat thermometer inserted into the center of the roast reads 170 degrees F (75 degrees C). Roasting time is about 1 1/2 hours. Wrap the roast in foil, and let stand 10 minutes before removing the string netting for slicing.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1747049.jpg",
    "o": "2874809.jpg,2390167.jpg,1121831.jpg,1071870.jpg,643482.jpg,552610.jpg",
    "st": "allrecipes"
}