{
    "id": 212481,
    "old_rating": "4.65217",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8.5 ounce) package corn bread mix",
        "10 slices firm white bread",
        "1 pound bulk spicy pork sausage",
        "2 cups sliced celery",
        "1 large onion, chopped",
        "2 teaspoons dried sage",
        "1/4 cup melted butter",
        "1 (14 ounce) can chicken broth",
        "2 eggs"
    ],
    "nut": [
        "Calories > 480 kcal",
        "Carbs > 39.2 g",
        "Cholesterol > 107 mg",
        "Fat > 28.9 g",
        "Protein > 15.2 g",
        "Sodium > 1425 mg"
    ],
    "n": "Best-Ever Cornbread-Sausage Stuffing",
    "a": "punkchic_123",
    "r": "0",
    "s": 8,
    "des": "\"Everyone always asks for this stuffing for Thanksgiving.\"",
    "ins": "The day before you want to make the stuffing, bake the corn bread mix according to package directions, remove it from the pan, cover lightly with a cloth, and leave it to dry overnight. Tear the bread into pieces and leave it out overnight to dry.\nAbout 1/2 hour before serving, preheat an oven to 350 degrees F (175 degrees C), and grease a 1 1/2-quart baking dish.\nPlace the sausage into a skillet over medium heat, and cook and stir the sausage, breaking it up as it cooks, until the meat is browned, 8 to 10 minutes. Stir in the celery and onion, and cook until the onion is translucent, stirring occasionally, about 8 minutes. Stir in the sage.\nTear up and crumble the corn bread into a large bowl. Break the bread apart into 1/2-inch pieces, and lightly mix it with the corn bread. Pour in the melted butter, stir to combine, and lightly mix in the sausage mixture.\nWhisk the chicken broth with the eggs, and stir into the corn bread mixture. Place the stuffing into the prepared baking dish, cover with foil, and bake in the preheated oven until the stuffing is cooked through and hot, about 30 minutes. Uncover the dish and return to the oven to bake until the top is lightly browned, about 10 more minutes.",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "9 h ",
    "i": "4205980.jpg",
    "o": "",
    "st": "allrecipes"
}