{
    "id": 21263,
    "old_rating": "4.37037",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 ounces sliced bacon",
        "1 pound ground pork sausage",
        "1 1/2 pounds sweet onions, peeled and chopped",
        "2 green bell peppers, chopped",
        "2 red bell peppers, chopped",
        "1 cup fresh mushrooms, sliced",
        "1/2 cup butter",
        "1 tablespoon ground black pepper",
        "2 tablespoons celery salt",
        "1 tablespoon seasoning salt",
        "2 1/2 tablespoons poultry seasoning",
        "1 tablespoon dried basil",
        "2 tablespoons garlic powder",
        "4 cups water",
        "3 (1 pound) loaves white bread, torn into pieces"
    ],
    "nut": [
        "Calories > 258 kcal",
        "Carbs > 32.6 g",
        "Cholesterol > 23 mg",
        "Fat > 10.5 g",
        "Protein > 8.3 g",
        "Sodium > 1080 mg"
    ],
    "n": "Tom Szaller's Great Pan or Bird Stuffing",
    "a": "Tom Szaller",
    "r": "0",
    "s": 25,
    "des": "\"This great sausage and bacon stuffing contains so many ingredients, some say it could be a meal in itself. Bake it as a side dish, or use it to stuff the bird.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nPlace sausage in a large Dutch oven. Cook over medium high heat, stirring to crumble, until evenly brown. Drain.\nAdd the bacon to the sausage along with the onions, green bell peppers, red bell peppers, mushrooms, butter, pepper, celery salt, seasoning salt, poultry seasoning, basil, garlic powder and water. Bring to a boil; cook and stir 10 to 20 minutes, until the vegetables are soft.\nGradually place the bread into the mixture, thoroughly blending until all pieces are coated. Transfer to a large baking dish or two medium baking dishes.\nBake in the preheated oven 40 to 60 minutes, or until the top begins to brown.",
    "pt": "45 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "904045.jpg",
    "o": "",
    "st": "allrecipes"
}