{
    "id": 212661,
    "old_rating": "4.46154",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 ounces uncooked linguine pasta",
        "2 tablespoons butter",
        "2 cups fresh mushrooms, quartered",
        "1/2 cup sliced green onion",
        "1/4 cup chopped red bell pepper",
        "1/4 cup all-purpose flour",
        "1/8 teaspoon black pepper",
        "2 tablespoons garlic spread seasoning (such as Johnny'sÂ® Great Caesar! Garlic Spread & Seasoning)",
        "1 1/4 cups chicken broth",
        "1 1/4 cups heavy cream",
        "2 cups chopped cooked turkey",
        "3/4 cup grated Parmesan cheese, divided",
        "1/4 cup sliced almonds",
        "2 tablespoons chopped fresh parsley (optional)"
    ],
    "nut": [
        "Calories > 515 kcal",
        "Carbs > 37 g",
        "Cholesterol > 123 mg",
        "Fat > 30.3 g",
        "Protein > 25.6 g",
        "Sodium > 676 mg"
    ],
    "n": "Turkey Mushroom Tetrazzini",
    "a": "Bethe Forcia",
    "r": "0",
    "s": 6,
    "des": "\"A rich and creamy dish that works well with leftover turkey or chicken.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 2-quart rectangular baking dish.\nFill a large pot with lightly salted water and bring to a rolling boil. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\nHeat butter in a large skillet; cook and stir the mushrooms, green onion, and bell pepper until the onion is translucent and the vegetables are softened, about 5 minutes. Stir in the flour, black pepper, and garlic spread seasoning. Pour in the chicken broth and cream, whisking the mixture until smooth and thickened, 5 to 8 more minutes. Stir in the turkey, half the Parmesan cheese, and the cooked linguine, and lightly stir to coat all ingredients with sauce.\nSpread the mixture into the prepared baking dish, and sprinkle the top with the remaining Parmesan cheese and the almonds. Bake in the preheated oven until the mixture is bubbling and the top has begun to brown, about 20 minutes, and sprinkle with parsley before serving.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4478779.jpg",
    "o": "",
    "st": "allrecipes"
}