{
    "id": 212692,
    "old_rating": "3.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 pound margarine",
        "1/4 cup white sugar",
        "3 eggs",
        "1 (8 ounce) container reduced-fat sour cream",
        "1 1/2 teaspoons vanilla extract",
        "1/4 teaspoon ground nutmeg",
        "1 1/2 teaspoons ground cinnamon",
        "1/4 tablespoon ground cloves",
        "1 (8.5 ounce) package dry corn muffin mix",
        "1/4 cup milk",
        "1 (15 ounce) can cream-style corn",
        "1 (15.25 ounce) can sweet corn, drained"
    ],
    "nut": [
        "Calories > 412 kcal",
        "Carbs > 50.6 g",
        "Cholesterol > 82 mg",
        "Fat > 21.3 g",
        "Protein > 8.2 g",
        "Sodium > 841 mg"
    ],
    "n": "Snacks' Crazy Sweet Corn Pudding",
    "a": "Snacks",
    "r": "0",
    "s": 8,
    "des": "\"I've made this delicious side dish for many occasions and I always get compliments. This comes in handy around the holidays but really, is a great way to spice up an otherwise boring meal. It also makes a great late-night snack.\"",
    "ins": "Preheat an oven to 375 degrees F (190 degrees C). Lightly grease a baking dish.\nBeat the margarine and sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the sour cream, vanilla, nutmeg, cinnamon, and cloves.  Pour in the corn muffin mix alternately with the milk, mixing until just incorporated. Fold in the cream-style corn and sweet corn; mixing just enough to evenly combine. Pour the batter into prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 45 minutes to 1 hour. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "3 h",
    "i": "4532773.jpg",
    "o": "",
    "st": "allrecipes"
}