{
    "id": 212664,
    "old_rating": "4.64972",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2/3 cup uncooked wild rice",
        "2 cups water",
        "6 tablespoons butter",
        "1/4 cup finely chopped onion",
        "1/4 cup finely chopped celery",
        "1/3 cup all-purpose flour",
        "4 cups turkey broth",
        "1/3 cup shredded carrot",
        "2 cups chopped cooked turkey",
        "1/2 teaspoon kosher salt, or to taste",
        "1/2 teaspoon ground black pepper, or to taste",
        "1/4 cup chopped slivered almonds",
        "1/2 teaspoon lemon juice",
        "3/4 cup half-and-half cream"
    ],
    "nut": [
        "Calories > 252 kcal",
        "Carbs > 14.4 g",
        "Cholesterol > 61 mg",
        "Fat > 15.2 g",
        "Protein > 14.3 g",
        "Sodium > 795 mg"
    ],
    "n": "Turkey Wild Rice Soup II",
    "a": "Galynn",
    "r": "0",
    "s": 8,
    "des": "\"This soup will warm your home and your heart.  True Northern comfort food.  Save Thanksgiving and Christmas turkey leftovers just so that you can make this yummy soup.  I created this recipe using leftovers that I had frozen.\"",
    "ins": "Bring the wild rice and water to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender but not mushy, 40 to 45 minutes. Drain off any excess liquid, fluff the rice with a fork, and cook uncovered 5 minutes more. Set the cooked rice aside.\nMelt the butter in a soup pot over medium heat. Cook and stir the onion and celery until the onion is translucent, about 5 minutes. Stir in the flour, and cook until it turns a pale yellowish-brown color, 3 to 5 minutes. Gradually whisk in the turkey stock until no lumps of flour remain. Stir in the carrot. Bring the mixture to a simmer, and cook, whisking constantly, until the stock is thick and smooth and the carrot is tender, about 2 more minutes.\nStir in the wild rice, turkey, salt, pepper, and almonds. Return to a simmer, and cook 2 more minutes to heat the ingredients. Stir in the lemon juice and half-and-half; bring the soup almost to a boil, and serve hot.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "948394.jpg",
    "o": "4026811.jpg,3234684.jpg,2884297.jpg,2841789.jpg,2662202.jpg,1928841.jpg",
    "st": "allrecipes"
}