{
    "id": 212720,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons vegetable oil",
        "2 skinless, boneless chicken breast halves, cubed",
        "8 green cardamom pods",
        "10 cloves, lightly pounded",
        "10 whole black peppercorns",
        "1 (1/2 inch) piece cinnamon stick",
        "3 serrano peppers",
        "2 teaspoons ginger paste",
        "2 teaspoons garlic paste",
        "1 (15 ounce) can crushed tomatoes",
        "1 1/4 cups water",
        "1 1/2 teaspoons paprika",
        "1 1/2 teaspoons dried fenugreek leaves",
        "1/2 teaspoon salt",
        "1 tablespoon butter, softened",
        "1/2 cup cream"
    ],
    "nut": [
        "Calories > 676 kcal",
        "Carbs > 33.7 g",
        "Cholesterol > 166 mg",
        "Fat > 46.9 g",
        "Protein > 33 g",
        "Sodium > 1182 mg"
    ],
    "n": "Makhani Murgh (Butter Chicken)",
    "a": "LUNACITY",
    "r": "0",
    "s": 2,
    "des": "\"This is a version of the popular 'Butter Chicken' recipe found in most Indian restaurants. I adapted it from a delicious sauce recipe in one of my cookbooks that always drives me wild, and streamlined it so it doesn't take half as long to make. Basically, it's chicken cooked in a spicy tomato cream sauce. Serve with naan and basmati rice.\"",
    "ins": "Heat the oil in a skillet over medium heat; cook and stir the chicken in the hot oil until completely browned, about 5 minutes. Set aside.\nWrap cardamom pods, cloves, peppercorns, and cinnamon stick in cheesecloth and secure with elastic or twist-tie.\nBlend the serrano peppers, ginger paste, and garlic paste together in a blender until smooth; add the crushed tomatoes and blend again until integrated. Transfer the mixture to a saucepan; add the water, paprika, and the spice bundle to the saucepan. Bring the mixture to a boil; reduce heat to medium-low and simmer until the volume of the liquid reduces to about half. Add the browned chicken to the liquid and stir. Cover the saucepan and simmer until the chicken is no longer pink in the center, about 15 minutes. Stir the salt and fenugreek seeds into the mixture and continue simmering another 5 minutes. Remove the bundle of spices and discard. Stir the butter and cream into the mixture; simmer until the butter is melted completely, 3 to 4 minutes. Serve hot.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "1110333.jpg",
    "o": "",
    "st": "allrecipes"
}