{
    "id": 212719,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup cooking oil",
        "1 (4 to 6 pound) whole chicken, cut into 8 pieces (skin removed and discarded)",
        "1 teaspoon cumin seeds",
        "1 cinnamon stick",
        "1 black cardamom pod",
        "4 whole cloves",
        "1 large onion, sliced thin",
        "1 tablespoon ginger-garlic paste",
        "4 green chile peppers, halved lengthwise",
        "1/2 cup chopped fresh spinach",
        "1/2 cup chopped fresh fenugreek leaves",
        "1 tablespoon dried fenugreek leaves",
        "1/2 teaspoon ground turmeric",
        "1/2 teaspoon ground red pepper",
        "salt to taste",
        "1 cup water",
        "1/2 teaspoon garam masala"
    ],
    "nut": [
        "Calories > 493 kcal",
        "Carbs > 8 g",
        "Cholesterol > 103 mg",
        "Fat > 34 g",
        "Protein > 36.7 g",
        "Sodium > 259 mg"
    ],
    "n": "Methi Murgh (Fenugreek Chicken)",
    "a": "SUSMITA",
    "r": "0",
    "s": 6,
    "des": "\"I love the taste of methi (fenugreek). It has an astringent taste and a slight bitterness that many people find too strong, but I am happy that there are many methi lovers out there. I really like pairing methi with chicken.\"",
    "ins": "Heat the oil in a pressure cooker over medium heat; brown the chicken pieces evenly on all sides, about 5 minutes. Remove from cooker and set aside. Add the cumin seeds, cinnamon stick, cardamom pod, cloves, onion slices, ginger-garlic paste, and green chile peppers to the pressure cooker and cook until the onions are golden brown, 5 to 7 minutes. Stir the spinach, fresh fenugreek leaves, dried fenugreek leaves, turmeric, red pepper, and salt into the mixture and cook until the spinach and fenugreek leaves begin to wilt and darken in color, about 5 minutes. Pour the water over the mixture and return the chicken pieces to the pressure cooker; bring to a boil for 2 to 3 minutes.\nFasten the lid on the pressure cooker; cook until the chicken is tender, about 30 minutes. Release pressure fully and remove the lid; sprinkle the garam masala over the dish. Cook and stir until the liquid thickens, 3 to 5 minutes. Serve hot.",
    "pt": "10 m",
    "ct": "45 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}