{
    "id": 212787,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "For the Bread:",
        "1/2 cup hazelnuts",
        "1 cup eggnog, plus",
        "1 tablespoon eggnog",
        "2 tablespoons white sugar",
        "1/2 teaspoon salt",
        "3 tablespoons butter, softened",
        "1 egg",
        "1 egg yolk",
        "3 cups bread flour",
        "1 1/2 teaspoons instant yeast",
        "2 tablespoons anise seed",
        "1 teaspoon ground cinnamon",
        "For the Glaze:",
        "1/2 cup confectioners' sugar",
        "1 tablespoon eggnog"
    ],
    "nut": [
        "Calories > 195 kcal",
        "Carbs > 28 g",
        "Cholesterol > 39 mg",
        "Fat > 7.2 g",
        "Protein > 5.2 g",
        "Sodium > 103 mg"
    ],
    "n": "Italian Christmas Bread with Eggnog Glaze",
    "a": "Nancy Ann R.",
    "r": "0",
    "s": 16,
    "des": "\"My husband fondly recalls the Anise Bread that his Italian grandmother used to make during the holidays. She evidently never had a recipe (and never used a bread machine!) so this is what I came up with for a quick, special Christmas bread. This rich bread has a wonderful aroma while baking.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).\nSpread hazelnuts evenly on a baking sheet. Bake until lightly toasted, about 5 to 7 minutes. Remove the pan from the oven, transfer the nuts to a bowl, and let them cool.\nPlace the eggnog, sugar, salt, butter, egg, egg yolk, bread flour, yeast, anise seed, and cinnamon into the bread machine. Program the machine for a basic cycle with the crust as \"medium.\" Press start. Do not use the delay timer.\nPlace the cooled toasted hazelnuts into the machine between Knead Cycle 1 and Knead Cycle 2. When the baking cycle ends, immediately remove the bread from the pan and allow it to cool on a rack.\nPrepare the glaze by combining the confectioners' sugar and eggnog in a bowl; mix well. It should be a drizzling consistency. Drizzle the glaze on the cooled bread before slicing.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "3 h ",
    "i": "319606.jpg",
    "o": "",
    "st": "allrecipes"
}