{
    "id": 212891,
    "old_rating": "4.81081",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "For the Poolish:",
        "1/2 teaspoon instant yeast",
        "1/2 cup warm water (110 degrees F/45 degrees C)",
        "3/4 cup whole wheat flour",
        "For the Dough:",
        "2 1/2 cups warm water",
        "1/2 teaspoon instant yeast",
        "6 cups unbleached bread flour",
        "1 tablespoon kosher salt",
        "2 tablespoons cornmeal for dusting"
    ],
    "nut": [
        "Calories > 419 kcal",
        "Carbs > 84.6 g",
        "Cholesterol > 0 mg",
        "Fat > 2 g",
        "Protein > 14.2 g",
        "Sodium > 726 mg"
    ],
    "n": "Pain de Campagne - Country French Bread",
    "a": "violet",
    "r": "0",
    "s": 8,
    "des": "\"I got this recipe out of a novel and made some minor changes. It is a yummy French bread that is worth the wait.\"",
    "ins": "To make the sponge, whisk the 1/2 teaspoon yeast in 1/2 cup warm water. Stir in the whole wheat flour until the mixture resembles a thick batter. Beat for about 100 strokes to form longs strands of gluten. Cover the bowl with a damp cloth and let sit at room temperature for 2 to 8 hours (longer is better for flavor development). You can also let the poolish ripen in the refrigerator for 12 to 15 hours, bringing it back to room temperature before proceeding with the recipe.\nWhen the poolish is ready, it will be bubbly and loose, with a yeasty, sour aroma. Scrape the poolish into a bowl and stir in the 2 1/2 cups water and the remaining 1/2 teaspoon yeast. Stir well to combine. Add the bread flour 1 cup at a time, mixing well after each addition, until the dough becomes too difficult to stir.\nTransfer the dough to a floured work surface and knead for 10 to 12 minutes, adding more flour only when the dough becomes too sticky to handle. Sprinkle the salt over the dough and knead it for an additional 5 to 7 minutes. The dough should have a smooth surface and spring back to the touch. Shape the dough into a round and cover with a damp cloth for 5 to 10 minutes.\nPlace the dough in an oiled bowl, turning to coat the surface of the dough with oil. Cover the dough with a damp cloth and let it rise at room temperature until doubled in size, about 2 to 3 hours.\nDeflate the dough and cut it into two pieces. Shape the dough into two rounds, cover them with plastic or a damp cloth, and allow the dough to rest for 30 minutes at room temperature.\nShape the dough into baguettes. Place a heavily floured cloth on a baking sheet, arranging a fold down the center to separate the loaves. Place the loaves, seam-side up, on the floured cloth. Dust the tops of the loaves with flour, cover with a damp towel, and let rise until doubled in bulk again, about two hours.\nPreheat an oven to 375 degrees F (190 degrees C).\nSprinkle a baking sheet with cornmeal. Gently transfer the risen loaves to the baking sheet, placing them seam-side down on the cornmeal. Make several diagonal slashes in the loaf with a serrated knife or razor blade.\nImmediately place the scored loaves in the preheated oven. Bake the bread until the loaves are golden brown, about 25 to 30 minutes. Cool the loaves on wire racks.",
    "pt": "3 h",
    "ct": "25 m",
    "tt": "5 h ",
    "i": "3771886.jpg",
    "o": "4075411.jpg,3934645.jpg,3357581.jpg,3133098.jpg,3032133.jpg,2981093.jpg",
    "st": "allrecipes"
}