{
    "id": 212913,
    "old_rating": "4.73077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (4 pound) beef chuck roast, quartered",
        "salt and pepper to taste",
        "2 tablespoons cooking oil",
        "1 onion, diced",
        "2 cloves garlic, crushed",
        "2 large tomatoes, chopped",
        "1 tablespoon whole peppercorns, crushed",
        "1 (5 ounce) jar pitted Manzanilla olives",
        "1 onion, quartered",
        "2 bay leaves",
        "2 beef bouillon cubes",
        "1/2 cup ketchup",
        "1 large red bell pepper, sliced",
        "4 small potatoes, peeled and quartered",
        "1 tablespoon corn flour (optional)",
        "1 teaspoon water (optional)"
    ],
    "nut": [
        "Calories > 639 kcal",
        "Carbs > 34.8 g",
        "Cholesterol > 138 mg",
        "Fat > 37.8 g",
        "Protein > 39.8 g",
        "Sodium > 1169 mg"
    ],
    "n": "Beef Asado",
    "a": "lola",
    "r": "0",
    "s": 6,
    "des": "\"This dish is rich in flavor due to the slow cooking of the beef with all the ingredients. The beef can be cooked to tenderness a day before, so you can skim off the fat. Do not use pressure cooker for this dish. This is a very versatile dish. It can be served with rice, bread or boiled potatoes.\"",
    "ins": "Season the beef with salt and pepper; set aside.\nHeat the oil in a skillet over medium heat; cook the diced onion and garlic in the hot oil until softened, about 5 minutes. Transfer the onion and garlic to a 6-quart pot. Individually brown the beef chunks on all sides in the skillet and place in the pot. Add the tomatoes, crushed peppercorns, olives with their juice, quartered onion, bay leaves, and bouillon cubes to the pot; bring to a boil. Stir the ketchup into the mixture, reduce heat to medium-low, and simmer 1 hour.\nRemove the beef from the pot and set aside. Add the red bell pepper to the mixture and continue simmering another 30 minutes.\nWhile the mixture continues to simmer, heat 2 tablespoons oil in the skillet. Cook the potatoes in the oil until golden brown; immediately add to the simmering mixture.\nSlice the meat against the grain and add to the pot; stir. Cook together another 5 minutes before serving. If the sauce is too thin, mix the corn flour and water together and stir into the sauce to thicken.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "2741491.jpg",
    "o": "",
    "st": "allrecipes"
}