{
    "id": 212973,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/2 cups all-purpose flour",
        "1 cup white sugar",
        "1 tablespoon baking powder",
        "1 teaspoon salt",
        "1/2 cup vegetable oil",
        "8 egg yolks",
        "2 tablespoons grated orange peel",
        "1 teaspoon vanilla extract",
        "1/3 cup orange juice",
        "1/3 cup water",
        "8 egg whites",
        "1/2 teaspoon cream of tartar",
        "1/2 cup white sugar"
    ],
    "nut": [
        "Calories > 243 kcal",
        "Carbs > 35.1 g",
        "Cholesterol > 102 mg",
        "Fat > 9.2 g",
        "Protein > 5.2 g",
        "Sodium > 269 mg"
    ],
    "n": "Mamon (Sponge Cakes)",
    "a": "lola",
    "r": "0",
    "s": 16,
    "des": "\"These sweet and soft mini cakes are usually baked in small molds and served during snack time. Use muffin tins if you don't have the molds.\"",
    "ins": "Preheat an oven to 325 degrees F (165 degrees C). Grease 16 muffin cups.\nStir the flour, 1 cup sugar, baking powder, and salt together in a large bowl. Make a well in the center of the flour mixture and add the oil, egg yolks, grated orange peel, vanilla extract, orange juice, and water. Mix well by hand until smooth with no lumps.\nBeat the egg whites with the cream of tartar until foamy in a large glass or metal mixing bowl. Gradually add the 1/2 cup sugar, continuing to beat until soft peaks form. Lift your beater or whisk straight up: the egg whites will form soft mounds rather than a sharp peak. Fold the flour mixture into the egg whites. Pour the resulting batter into the prepared muffin cups to about 2/3 full.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 40 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
    "pt": "45 m",
    "ct": "40 m",
    "tt": "2 h ",
    "i": "4347052.jpg",
    "o": "3250930.jpg,2839268.jpg,2569959.jpg,2126394.jpg,949306.jpg,630375.jpg",
    "st": "allrecipes"
}