{
    "id": 21296,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 tart green apples, peeled and cored",
        "1 cup brown sugar",
        "1/4 teaspoon ground nutmeg",
        "3 egg whites",
        "3 egg yolks",
        "1 cup milk",
        "1 teaspoon maple flavored extract",
        "1 cup all-purpose flour",
        "1 teaspoon cream of tartar",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/2 cup confectioners' sugar",
        "1/4 teaspoon ground nutmeg",
        "1 pint heavy cream"
    ],
    "nut": [
        "Calories > 648 kcal",
        "Carbs > 84.1 g",
        "Cholesterol > 214 mg",
        "Fat > 32.7 g",
        "Protein > 8.7 g",
        "Sodium > 315 mg"
    ],
    "n": "Birds' Nest Pudding",
    "a": "Jeri",
    "r": "0",
    "s": 6,
    "des": "\"Just like the ones from Little House.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).  Butter a 2 quart baking dish.\nPlace apples in prepared dish.  Stuff the core of each apple with brown sugar, pressing down slightly.  Reserve any remaining sugar.  Sprinkle all the apples with the 1/4 teaspoon nutmeg.  Place dish in preheated oven to start baking while the batter is prepared.\nBeat egg whites until stiff.  In a separate bowl, beat yolks until they change color.  Stir milk and maple flavoring into beaten yolks.  In a third bowl, combine flour, cream of tartar, baking powder, salt and any remaining brown sugar until well mixed.  Pour flour mixture all at once into egg yolk mixture and stir until smooth.  Fold beaten egg whites into yolk batter.\nRemove apples from oven and pour batter evenly over and around apples.\nBake in preheated oven 45 to 60 minutes more, until crust has browned.  Turn each apple, surrounded by some fluffy crust onto a plate and serve at once with sweetened cream.\nTo make sweetened cream:  Stir confectioners' sugar and 1/4 teaspoon nutmeg into heavy cream.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "3902118.jpg",
    "o": "",
    "st": "allrecipes"
}