{
    "id": 213075,
    "old_rating": "4.45455",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (5 pound) unsmoked bone-in ham",
        "1 teaspoon salt, or to taste (optional)",
        "5 pounds russet potatoes, peeled and shredded",
        "4 cups all-purpose flour",
        "1 1/2 cups stone ground whole wheat flour",
        "1 teaspoon baking powder",
        "1 teaspoon salt, or to taste",
        "3 slices bacon, cut into 1-inch square pieces",
        "salt and black pepper to taste (optional)"
    ],
    "nut": [
        "Calories > 378 kcal",
        "Carbs > 37 g",
        "Cholesterol > 85 mg",
        "Fat > 11.4 g",
        "Protein > 30.8 g",
        "Sodium > 296 mg"
    ],
    "n": "Original Kumla Recipe from Mom",
    "a": "Bud",
    "r": "0",
    "s": 25,
    "des": "\"Swedish-Norwegian potato dumplings. Serve with lots of butter and sour cream.\"",
    "ins": "Place the ham in a large soup pot (at least 10 quart size), and pour in 16 to 20 cups of water to cover. Bring the water to a boil, reduce heat, and simmer the ham to make a rich stock, about 2 hours. Remove the ham, and skim any foam off the broth. Stir in 1 teaspoon salt (or to taste) to broth, if necessary.\nPlace the potatoes in a large bowl, and use very wet hands to mix in the all-purpose flour, whole wheat flour, baking powder, and 1 teaspoon salt to make a sticky dough.\nBring the ham stock to a full, rolling boil. Place a bowl of water near the stove. With very wet hands, pinch off about 2/3 cup of dough, and press a piece of bacon into the center of the dough. Roll the dough into a ball about 2 1/2 inches across, and slip the kumla into the boiling broth along the side of the pot. Don't drop them into the middle of the broth to avoid splashing the hot broth. Repeat with the remaining dough, using the bowl of water to keep your hands very wet, until all the dumplings have been added to the broth.\nCover and simmer over low heat for about 15 minutes, then use a slotted spoon or spatula to gently lift any stuck dumplings from the bottom of the pot. Cover the pot again, and simmer the dumplings for about 1 hour. They will float to the top of the broth as they cook.\nGently lift the kumla from the broth with a slotted spoon, and stack them in a bowl for serving. Sprinkle with salt and pepper before serving.",
    "pt": "1 h",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "923687.jpg",
    "o": "631449.jpg,631448.jpg,479049.jpg,479048.jpg,479047.jpg,479043.jpg",
    "st": "allrecipes"
}