{
    "id": 213043,
    "old_rating": "4.68539",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (14.5 ounce) package gingerbread cake mix",
        "3 cups eggnog",
        "1 (5.1 ounce) package instant vanilla pudding mix",
        "2 cups heavy cream",
        "1/4 cup white sugar",
        "2 teaspoons vanilla extract",
        "1/4 cup sweetened dried cranberries, chopped (optional)",
        "2 tablespoons gingersnap cookie crumbs (optional)"
    ],
    "nut": [
        "Calories > 269 kcal",
        "Carbs > 32.1 g",
        "Cholesterol > 55 mg",
        "Fat > 14.7 g",
        "Protein > 2.9 g",
        "Sodium > 270 mg"
    ],
    "n": "Eggnog Gingerbread Trifle",
    "a": "Jen Graham",
    "r": "0",
    "s": 20,
    "des": "\"Combining two of the holiday season's best flavors, this dessert is easy to make and a crowd pleaser! If you are feeling fancy, you can pipe your top layer of whipped cream on the trifle. Since I normally travel with this dessert and put a lid on it, I just spread a nice thick layer on top and then sprinkle with some chopped dried cranberries and crumbled gingerbread cookies.\"",
    "ins": "Prepare gingerbread cake mix and bake according to package directions (any size pan). Cool completely.\nPlace the pudding mix in a large bowl. Pour in the eggnog and whisk for about 2 minutes. Refrigerate pudding until the gingerbread cake is cool and you are ready to assemble the trifle.\nIn a large bowl, whip cream until stiff peaks are just about to form. Beat in sugar and vanilla until peaks form.\nCrumble 1/2 of the gingerbread into the bottom of a trifle bowl or a large glass bowl. Spread 1/2 of the eggnog pudding over the gingerbread, then spread 1/2 of the whipped cream on top of the pudding. Repeat the layers with the remaining gingerbread, pudding, and whipped cream. Refrigerate 6 hours or overnight. Sprinkle the top with the cranberries and cookie crumbs before serving.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "8 h ",
    "i": "4377038.jpg",
    "o": "4377038.jpg,4363854.jpg,3398503.jpg,1873437.jpg,1865922.jpg,772745.jpg",
    "st": "allrecipes"
}