{
    "id": 213031,
    "old_rating": "4.54545",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 scotch bonnet chile pepper",
        "6 bone-in chicken pieces, such as breasts, thighs, and drumsticks",
        "2 skinless, bone-in chicken breast halves - cut in half",
        "1 tablespoon olive oil",
        "1 onion, finely chopped",
        "3 cloves garlic, minced",
        "2 cups uncooked long-grain white rice",
        "4 cups chicken broth",
        "1 (14 ounce) can coconut milk",
        "4 sprigs thyme, chopped",
        "1 (15 ounce) can black-eyed peas, rinsed and drained",
        "4 green onions, coarsely chopped",
        "1/2 head cabbage, cored and cut into large chunks",
        "2 tablespoons butter",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 541 kcal",
        "Carbs > 55.6 g",
        "Cholesterol > 68 mg",
        "Fat > 23.8 g",
        "Protein > 26.7 g",
        "Sodium > 255 mg"
    ],
    "n": "Guyanese Cookup Rice",
    "a": "Tatiana",
    "r": "0",
    "s": 8,
    "des": "\"My grandmother's recipe. It's delicious and can be made with or without meat. It's also very versatile. Here I am using chicken, however you can use brisket, pigtail, oxtail, the list is endless.\"",
    "ins": "Slice the scotch bonnet chile in half, and chop one half. Reserve both halves. (Chile is very hot, so use gloves when chopping, and avoid touching your eyes, nose, or mouth after chopping.) Cut the chicken pieces into large chunks.\nHeat the olive oil in a large skillet or Dutch oven over medium heat, and pan-fry the chicken pieces until brown on all sides, about 15 minutes. Stir in chopped chile, onion, and garlic. Cook, stirring occasionally, until the onion is translucent, about 5 minutes. Add the rice, and stir to coat with oil. Let the rice fry until it turns slightly opaque but doesn't brown. Pour in the chicken stock, bring to a boil over medium heat, and reduce heat to a simmer. Let the mixture simmer for about 5 minutes, and stir in the coconut milk, thyme, black-eyed peas, and green onions until well combined. Lay the cabbage chunks on top of the mixture, and place the remaining half chile on top of the cabbage.\nCover, and simmer until the rice and cabbage are tender, about 20 minutes. Check occasionally to see if the mixture is getting too dry on the bottom, and add a small amount of water if needed to prevent burning. Before serving, stir in butter, and season to taste with salt and pepper.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "832218.jpg",
    "o": "",
    "st": "allrecipes"
}