{
    "id": 213007,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "3/4 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/2 cup butter",
        "3/4 cup white sugar",
        "1 large egg",
        "3 ripe bananas, mashed",
        "3/4 cup butterscotch chips",
        "1/2 cup chopped walnuts (optional)"
    ],
    "nut": [
        "Calories > 159 kcal",
        "Carbs > 21.5 g",
        "Cholesterol > 18 mg",
        "Fat > 7.3 g",
        "Protein > 1.9 g",
        "Sodium > 131 mg"
    ],
    "n": "Banana Butterscotch Bread",
    "a": "KWARREN",
    "r": "0",
    "s": 24,
    "des": "\"Warning! Addictive! This is such a delicious version of traditional banana bread and is extremely popular whenever I make it that I had to share it on Allrecipes!  I got it from an old Bed and Breakfast recipe from a place in Maryland and make it every year around the holidays!  I don't use the walnuts, but I hear that it is really good for those that like them.  This recipe has definitely become a new tradition!\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Grease 2 9x5-inch loaf pans.  Set aside. Sift the flour, baking powder, baking soda, salt, cinnamon, and nutmeg together in a bowl. Set aside.\nBeat the butter and sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Beat in the egg, then stir in the mashed bananas. Pour in the flour mixture, mixing until just incorporated. Fold in the butterscotch chips and walnuts; mixing just enough to evenly combine. Pour the batter evenly into the prepared pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 25 to 28 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "2 h ",
    "i": "575960.jpg",
    "o": "1996317.jpg,1130466.jpg,905344.jpg,905342.jpg,898382.jpg,575969.jpg",
    "st": "allrecipes"
}