{
    "id": 213080,
    "old_rating": "4.50649",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package al frescoÂ® All Natural Sweet Italian Chicken Sausage",
        "2 teaspoons olive oil",
        "1 cup chopped onion",
        "1 teaspoon minced garlic",
        "3/4 cup dry red wine",
        "1 (14.5 ounce) can diced tomatoes with Italian herbs, with juices",
        "1 teaspoon dried oregano",
        "1/2 cup light cream (table cream)",
        "1/2 pound uncooked linguine",
        "2 tablespoons shredded Parmesan cheese",
        "Fresh oregano leaves for garnish (optional)"
    ],
    "nut": [
        "Calories > 522 kcal",
        "Carbs > 51.9 g",
        "Cholesterol > 108 mg",
        "Fat > 18.2 g",
        "Protein > 29.2 g",
        "Sodium > 815 mg"
    ],
    "n": "Grilled Sweet Italian Chicken Sausage with Tomato Cream Sauce Over Linguine",
    "a": "al fresco",
    "r": "0",
    "s": 4,
    "des": "\"Linguine with tomato cream sauce is an easy and impressive dish, topped with savory and delicious grilled Italian chicken sausage.\"",
    "ins": "Prepare grill for direct cooking and preheat grill to medium temperature range.\nGrill sausage links over direct heat, turning every minute. Remove from grill. Cool slightly. Cut sausage into 1/4-inch circles.\nMeanwhile, over medium-high heat, heat oil in a large heavy skillet. Add onions and saute for about 2 minutes, stirring occasionally. Add garlic and cook, just until fragrant, about 30 seconds. Reduce the heat to low and add wine, tomatoes, sausage, oregano and 1/4 tsp each salt and pepper. Cook about 3 minutes. Add cream and cook for one minute.\nMeanwhile, cook linguine in boiling salted water according to package directions. Cook until al dente. Drain. Portion cooked linguine onto 4 warm plates or pasta bowls. Spoon sausage/sauce over pasta. Sprinkle each with Parmesan and garnish with fresh oregano.",
    "pt": "22 m",
    "ct": "20 m",
    "tt": "42 m",
    "i": "4513594.jpg",
    "o": "3118875.jpg,990932.jpg,895713.jpg,892604.jpg,892123.jpg,891822.jpg",
    "st": "allrecipes"
}