{
    "id": 213089,
    "old_rating": "4.45455",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 (5 inch) corn tortillas",
        "1/2 unpeeled butternut squash, seeded",
        "1/2 cup water",
        "2 tablespoons olive oil",
        "1 clove garlic, minced",
        "1/4 onion, chopped",
        "2 cups chopped fresh spinach",
        "4 sun-dried tomatoes, chopped",
        "1 cup enchilada sauce",
        "1/4 cup crumbled goat cheese",
        "1/4 cup crumbled cotija cheese",
        "2 tablespoons chopped cilantro leaves, for garnish (optional)",
        "1/4 cup sour cream, for topping (optional)"
    ],
    "nut": [
        "Calories > 370 kcal",
        "Carbs > 46.2 g",
        "Cholesterol > 22 mg",
        "Fat > 18 g",
        "Protein > 10.4 g",
        "Sodium > 429 mg"
    ],
    "n": "Butternut Squash Enchiladas",
    "a": "Elizabeth",
    "r": "0",
    "s": 4,
    "des": "\"My coworkers and I love a local restaurant's version of this, so I thought I would try and replicate! So far, so good :)\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C).\nLay the tortillas flat onto a baking sheet. Bake in the preheated oven until crispy, about 10 minutes. Remove and allow to cool. Meanwhile, place the butternut squash half into a microwave-safe dish cut-side-down, and pour in the water. Cook in the microwave until tender, 12 to 15 minutes. Once cool enough to handle, scoop out the flesh and dice; place into a mixing bowl and set aside.\nHeat the olive oil in a skillet over medium heat. Stir in the garlic and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the spinach and sun-dried tomatoes. Continue cooking until the spinach wilts. Gently fold the spinach mixture into the diced butternut squash.\nArrange four crispy tortillas on the baking sheet. Divide the squash mixture among the tortillas. Sprinkle 1 tablespoon of goat cheese over each tortilla, then top with the remaining tortillas. Pour the enchilada sauce over top, and sprinkle each with 1 tablespoon of cotija cheese.\nBake in the preheated oven until hot, about 10 minutes. Garnish each enchilada with chopped cilantro leaves and a dollop of sour cream to serve.",
    "pt": "1 h ",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "2027840.jpg",
    "o": "",
    "st": "allrecipes"
}