{
    "id": 213180,
    "old_rating": "3.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup all-purpose flour",
        "salt and black pepper to taste",
        "garlic powder to taste",
        "8 bone-in, skinless chicken thighs",
        "2 tablespoons olive oil",
        "1 cup chicken broth",
        "6 potatoes, quartered",
        "2 cups petite pickles (such as Mt. OliveÂ®), halved",
        "1 cup baby carrots, halved",
        "1 (6 ounce) can black olives with juice",
        "1 cup pickle juice"
    ],
    "nut": [
        "Calories > 368 kcal",
        "Carbs > 38.3 g",
        "Cholesterol > 69 mg",
        "Fat > 13.4 g",
        "Protein > 23.7 g",
        "Sodium > 763 mg"
    ],
    "n": "Chicken, Pickles, and Potatoes",
    "a": "Kristie",
    "r": "0",
    "s": 8,
    "des": "\"If you love pickles you will love this. Chicken thighs are browned and cooked with potatoes, carrots, pickles and black olives. Sounds scary I know but trust me it's good. My mother-in-law served this to me when I first met my husband and I have come to love it.\"",
    "ins": "Place the flour in a shallow dish and season lightly with salt, pepper, and garlic powder. Season the chicken thighs with salt and pepper, and dredge in the flour. Heat the olive oil in a large skillet over medium-high heat.Cook the chicken in the hot oil until golden, about 3 minutes. Flip chicken and brown on the other side, 3 additional minutes. Pour in the chicken broth.\nStir in the potatoes, pickles, carrots, black olives with juice, and pickle juice. Reduce heat to medium, cover, and cook until the potatoes are tender and the chicken thighs are no longer pink at the bone and the juices run clear, about 40 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "663915.jpg",
    "o": "",
    "st": "allrecipes"
}