{
    "id": 213110,
    "old_rating": "4.6087",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups milk",
        "6 ounces German sweet chocolate",
        "1 1/2 cups white sugar",
        "2 1/2 tablespoons all-purpose flour",
        "1/4 teaspoon salt",
        "2 large eggs, beaten",
        "1 1/2 cups heavy cream",
        "1 teaspoon vanilla extract",
        "1/2 cup shredded sweetened coconut",
        "1 cup chopped pecans, toasted"
    ],
    "nut": [
        "Calories > 477 kcal",
        "Carbs > 49.6 g",
        "Cholesterol > 92 mg",
        "Fat > 30.4 g",
        "Protein > 6.4 g",
        "Sodium > 129 mg"
    ],
    "n": "Richer Than Rich German Chocolate Ice Cream",
    "a": "SharonBaker",
    "r": "0",
    "s": 10,
    "des": "\"Coconut, toasted pecans, Baker'sÂ® sweet German chocolate, and whipping cream--enough said. To die for! I have made this many, many times--everyone loves it (unless they don't like coconut).\"",
    "ins": "Heat milk, chocolate, sugar, flour, and salt in a saucepan over low heat. Cook until the chocolate melts, stirring occasionally. Stir about 1/2 cup of the hot chocolate mixture into the eggs, then stir the egg mixture into the saucepan. Increase heat to medium and continue cooking and stirring until the mixture is thickened, about 5 minutes. Pour chocolate egg mixture into a bowl. Cover and refrigerate until chilled, at least 2 hours. Stir in the heavy cream and vanilla extract.\nPour the chilled mixture into an ice cream maker and freeze according to manufacturer's directions until it reaches \"soft-serve\" consistency. Stir in the coconut and pecans. Transfer ice cream to a one- or two-quart lidded plastic container; cover surface with plastic wrap and seal. For best results, ice cream should ripen in the freezer for at least 2 hours or overnight.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "4 h ",
    "i": "597344.jpg",
    "o": "",
    "st": "allrecipes"
}