{
    "id": 213107,
    "old_rating": "4.56",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 whole russet potatoes",
        "2 large carrots, peeled",
        "2 beets, washed with tops and bottoms removed",
        "1/2 yellow onion, chopped",
        "1 (12 ounce) jar herring fillets, packed in oil",
        "6 tablespoons mayonnaise",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 120 kcal",
        "Carbs > 9.4 g",
        "Cholesterol > 8 mg",
        "Fat > 8 g",
        "Protein > 3.3 g",
        "Sodium > 175 mg"
    ],
    "n": "Russian Beet Salad with Herring",
    "a": "Evgeniya",
    "r": "0",
    "s": 20,
    "des": "\"This salad is commonly known in Russia as a 'Herring under the Winter Coat Salad.' It is a must for every Russian holiday, however, you have to have a taste for herring and beets. Every Russian craves this salad, but my American hubby doesn't care for it. I use a clear bowl for this salad so that you could see all ingredients in it.\n\"",
    "ins": "Bring a large pot of water to a boil. Cook the potatoes, carrots, and beets in the boiling water until cooked but still firm, 15 to 20 minutes for the potatoes, 25 to 30 minutes for the carrots, and 40 minutes for the beets. Allow each to cool to the touch before further handling. Remove and discard the skins from the potatoes and beets. Shred the potatoes, carrots, and beets, keeping them separate.\nArrange about half the onion and half the herring fillets in a layer in the bottom of a bowl. Cover the layer with about half of the grated potatoes, then a layer of about half the carrot, and finally about half the beet. Spread about 3 tablespoons of mayonnaise over the salad; season with salt and pepper. Repeat the layers in the same order to finish building the salad. Cover with plastic wrap and chill in the refrigerator at least 1 hour. Serve cold.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "589747.jpg",
    "o": "",
    "st": "allrecipes"
}