{
    "id": 213190,
    "old_rating": "4.53846",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 ounces dry fettuccine pasta",
        "1 tablespoon olive oil",
        "2 skinless, boneless chicken breast halves",
        "2 tablespoons Italian-style salad dressing",
        "1 tablespoon balsamic vinegar",
        "4 ounces fresh button mushrooms, quartered",
        "1 (14.5 ounce) can organic fire-roasted diced tomatoes (such as Muir GlenÂ®)",
        "2 ounces cream cheese, cut into cubes",
        "2 tablespoons chopped fresh basil",
        "2 tablespoons freshly shredded Parmesan cheese"
    ],
    "nut": [
        "Calories > 650 kcal",
        "Carbs > 60.4 g",
        "Cholesterol > 102 mg",
        "Fat > 26.5 g",
        "Protein > 40.2 g",
        "Sodium > 1028 mg"
    ],
    "n": "Valentine's Fettuccini for Two",
    "a": "Marieliobot",
    "r": "0",
    "s": 2,
    "des": "\"Chicken and fettuccini in a creamy tomato basil sauce that is quick, easy, and impressive.  It made my husband grunt like a caveman.\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil. Once the water is boiling, stir in the fettuccini, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink.\nHeat the olive oil in a skillet, and cook the chicken breast halves over medium heat until lightly browned, about 5 minutes per side. Pour the Italian dressing and balsamic vinegar over the chicken, add the mushrooms, and cook, covered, until the chicken is no longer pink inside. Remove the chicken breasts, and cut into strips.\nStir the tomatoes, cream cheese, and basil together in the skillet with the mushrooms over medium-low heat until the mixture comes to a boil. Stir to melt the cream cheese into the sauce, add the chicken strips and the cooked fettuccini, and toss together. Sprinkle with Parmesan cheese to serve.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "824997.jpg",
    "o": "",
    "st": "allrecipes"
}