{
    "id": 213167,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 cup tapioca pearls",
        "1 (14 ounce) can coconut milk",
        "2 large papayas - halved lengthwise and seeded"
    ],
    "nut": [
        "Calories > 320 kcal",
        "Carbs > 34.2 g",
        "Cholesterol > 0 mg",
        "Fat > 21.1 g",
        "Protein > 2.7 g",
        "Sodium > 17 mg"
    ],
    "n": "Coconut Tapioca in Papaya Bowl",
    "a": "Tao,RN",
    "r": "0",
    "s": 4,
    "des": "\"Coconut tapioca is one of my favorites of all time. I also love the tropical fruit papaya. When I combined these two things together, it did make my day. If you are not a big fan of papaya, you may skip the papaya bowl; coconut tapioca by itself would be a good treat to your guests too!\"",
    "ins": "Bring a pot of water to a boil. Stir the tapioca pearls into the boiling water. Reduce heat to medium to keep water at a simmer. Cook, stirring frequently to keep the pearls from sticking to the bottom of the pot, until the water becomes thickened, 5 to 7 minutes. Drain. Transfer the tapioca to a large bowl and cover with cold water.\nRefill the pot with fresh water and bring to a boil. Once the tapioca pearls have cooled, drain the cool water from the bowl and transfer the tapioca to the boiling water. Remove the pot from the heat; cook and stir again until the pearls are clear, 5 to 7 minutes; drain. Transfer the tapioca to a clean bowl and cover with cold water. If the pearls are not completely clear, repeat the process until they are.\nPour the coconut milk into a small saucepan and place over medium heat; bring to a simmer. Once the coconut milk is simmering, stir the tapioca into the coconut milk until the pearls are evenly coated. Remove from heat and allow the mixture to cool completely; spoon into the papaya halves. Store in refrigerator until ready to serve.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "361020.jpg",
    "o": "",
    "st": "allrecipes"
}