{
    "id": 213227,
    "old_rating": "3.95349",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 tablespoons vegetable oil",
        "2 cloves garlic, chopped",
        "6 tablespoons soy sauce",
        "6 tablespoons rice vinegar",
        "1 tablespoon Thai chili sauce",
        "3 tablespoons honey",
        "8 ounces extra-firm tofu, cut into 1/4-inch cubes",
        "1/2 (16 ounce) package linguine pasta",
        "1 tablespoon sesame oil",
        "8 ounces bean sprouts",
        "8 ounces shredded carrots",
        "1 green bell pepper, thinly sliced",
        "8 green onions, halved lengthwise"
    ],
    "nut": [
        "Calories > 388 kcal",
        "Carbs > 46.6 g",
        "Cholesterol > 0 mg",
        "Fat > 19.2 g",
        "Protein > 11.8 g",
        "Sodium > 1045 mg"
    ],
    "n": "Sesame Asian Tofu Stir-Fry",
    "a": "Spartan1977",
    "r": "0",
    "s": 6,
    "des": "\"Thinly-sliced vegetables are stir-fried in a garlic and sesame sauce.\"",
    "ins": "Heat the vegetable oil in a wok over medium-high heat; cook and stir the garlic until lightly browned, about 2 minutes. Pour in the soy sauce, rice vinegar, chili sauce, and honey, stir to mix, and bring the mixture to a simmer. Reduce heat to medium-low, and let the sauce simmer for 10 minutes. Transfer the sauce to a bowl, and stir the tofu into the sauce. Set the tofu mixture aside.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\nWhile the pasta is boiling, heat the sesame oil in clean wok or large skillet; cook and stir the bean sprouts, carrots, green pepper, and green onions until the vegetables are bright in color and slightly wilted, about 5 minutes. Pour in the tofu with sauce and linguine; stir to combine.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "567094.jpg",
    "o": "",
    "st": "allrecipes"
}