{
    "id": 213220,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons dry egg replacer (such as Ener-GÂ®)",
        "1/2 cup water",
        "1 1/2 cups sweet rice flour (mochiko)",
        "1 1/2 teaspoons xanthan gum",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 cup vegan margarine (such as Earth BalanceÂ®)",
        "1 cup packed brown sugar",
        "1 cup turbinado sugar (such as Sugar in the RawÂ®)",
        "2 teaspoons gluten-free vanilla extract",
        "2 cups peeled and finely shredded yam",
        "3/4 cup turbinado sugar (such as Sugar in the RawÂ®)",
        "1/4 cup cornstarch",
        "2 tablespoons vegan margarine (such as Earth BalanceÂ®), softened",
        "2 tablespoons almond milk"
    ],
    "nut": [
        "Calories > 209 kcal",
        "Carbs > 36.7 g",
        "Cholesterol > 0 mg",
        "Fat > 6.9 g",
        "Protein > 0.9 g",
        "Sodium > 155 mg"
    ],
    "n": "Gluten-Free Golden Yam Brownies",
    "a": "Ljubomir",
    "r": "0",
    "s": 24,
    "des": "\"This recipe was too good to pass up, but due to allergies and preferences, we did them gluten-free and vegan! They turned out amazing!\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nStir the egg replacer and water together in a small bowl until the powder is completely integrated. Stir the rice flour, xanthan gum, baking powder, and salt together in a separate bowl.\nBeat 1 cup margarine, brown sugar, and 1 cup turbinado sugar with an electric mixer in a large bowl until light and fluffy. Add the egg replacer about 1/2 cup at a time, allowing each addition to blend into the butter mixture before adding the next. Add the vanilla extract with the last of the egg replacer. Pour the rice flour mixture into the batter, mixing until just incorporated. Fold the shredded yam into the batter, mixing just enough to evenly combine. Pour the batter into prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 30 minutes.\nStir 3/4 cup turbinado sugar, cornstarch, 2 tablespoons margarine, and almond milk together in a small bowl until smooth. Spread over the brownies while still warm; they will absorb some of the glaze. Serve warm.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}