{
    "id": 213222,
    "old_rating": "3.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 1/2 ounces uncooked linguine pasta",
        "9 ounces fresh green beans, trimmed and cut on the diagonal",
        "1/4 cup lime juice",
        "3 tablespoons canola oil",
        "3 tablespoons soy sauce",
        "2 tablespoons brown sugar",
        "1 tablespoon Asian (toasted) sesame oil",
        "1 tablespoon minced garlic",
        "1 tablespoon grated orange zest",
        "2 small serrano chile peppers, chopped",
        "2 cups carrots, cut into matchsticks",
        "1 cup thinly sliced green onions",
        "salt and black pepper to taste"
    ],
    "nut": [
        "Calories > 203 kcal",
        "Carbs > 26.4 g",
        "Cholesterol > 0 mg",
        "Fat > 9.8 g",
        "Protein > 4.1 g",
        "Sodium > 487 mg"
    ],
    "n": "Spicy Sesame Noodle Salad",
    "a": "Denise",
    "r": "0",
    "s": 6,
    "des": "\"I have been making this recipe since 1998. Everyone enjoys it. It can be served warm or cold. To make it a main dish, I add cooked chicken pieces and prawns.\"",
    "ins": "Fill a saucepan with lightly salted water and bring to a rolling boil. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink, and rinse with cold water until the pasta is cool.\nBring a saucepan of lightly salted water to a boil, stir in the green beans, and cook, stirring occasionally, until the beans are bright green and slightly tender, 5 to 8 minutes. Drain the beans, and rinse with cold water to chill.\nIn a large salad bowl, combine lime juice, canola oil, soy sauce, brown sugar, sesame oil, garlic, orange zest, and serrano peppers, stirring until the sugar has dissolved. Allow the dressing to stand for 30 minutes. Lightly toss in the carrots, green onions, linguini and green beans, and season to taste with salt and pepper. Cover and chill before serving.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "4464004.jpg",
    "o": "",
    "st": "allrecipes"
}