{
    "id": 213250,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups barley",
        "4 cups chicken broth",
        "2 tablespoons olive oil",
        "1 cup chopped celery",
        "1 cup chopped carrots",
        "6 cloves garlic, minced",
        "1 cup chopped onion",
        "2 cups sliced mushrooms",
        "1 yellow zucchini, cut into half moons",
        "1 cup fresh green beans, trimmed and cut into 1 inch pieces",
        "2 cups broccoli florets",
        "1 (4 ounce) package cream cheese, softened",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "1/3 cup sour cream",
        "1/4 cup grated Locatella cheese",
        "1/4 cup grated Parmesan cheese",
        "1 tablespoon garlic powder",
        "1/2 teaspoon ground nutmeg",
        "1 tablespoon dried oregano",
        "1 tablespoon dried basil",
        "1 tablespoon ground thyme",
        "1 cup green peas",
        "1 cup whole kernel corn",
        "1 cup roasted red peppers, drained and chopped",
        "1 (10 ounce) package frozen chopped spinach, thawed and drained",
        "2 cups shredded cooked chicken",
        "salt and ground black pepper to taste",
        "2 cups shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 369 kcal",
        "Carbs > 38.5 g",
        "Cholesterol > 48 mg",
        "Fat > 15.5 g",
        "Protein > 21.5 g",
        "Sodium > 501 mg"
    ],
    "n": "Delicious Barley Bake",
    "a": "L Mac",
    "r": "0",
    "s": 12,
    "des": "\"Barley, chicken and tons of veggies baked in a delicious creamy sauce. Easily made vegetarian by removing the chicken and substituting a vegetable cream, condensed soup.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).\nBring the barley and chicken broth to a boil in a saucepan over high heat. Cover, reduce heat to low, and simmer until the barley is tender, about 30 minutes.\nHeat the olive oil in a skillet over medium heat. Stir in the celery, carrots, garlic, and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the mushrooms, zucchini, green beans, and broccoli. Continue cooking and stirring until the broccoli is tender, about 5 minutes more. Remove skillet from heat.\nCombine cream cheese, cream of chicken soup, sour cream, Locatella cheese, Parmesan cheese, garlic powder, nutmeg, oregano, basil, and thyme in a large bowl, mixing until smooth. Stir in the prepared barley, peas, corn, roasted red peppers, spinach, and shredded chicken. Season with salt and pepper. Spread mixture into a large baking dish and top with mozzarella cheese.\nBake in the preheated oven until bubbly, and cheese has melted, 20 to 30 minutes.",
    "pt": "40 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "2317666.jpg",
    "o": "",
    "st": "allrecipes"
}