{
    "id": 213256,
    "old_rating": "4.125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "16 cloves garlic, minced",
        "2 tablespoons minced fresh oregano",
        "2 teaspoons salt",
        "2 teaspoons ground black pepper",
        "9 pounds boneless pork butt",
        "4 dried chipotle chili peppers",
        "6 tablespoons vegetable oil",
        "8 cloves garlic, minced",
        "4 onions, chopped",
        "20 Roma tomatoes, chopped",
        "1 cup water",
        "5 teaspoons minced fresh oregano",
        "1/4 teaspoon white sugar",
        "salt, to taste",
        "12 Mexican bolillo rolls, lightly toasted, cut in half lengthwise",
        "2 pickled jalapeno peppers, sliced"
    ],
    "nut": [
        "Calories > 867 kcal",
        "Carbs > 75.1 g",
        "Cholesterol > 135 mg",
        "Fat > 41 g",
        "Protein > 47.7 g",
        "Sodium > 571 mg"
    ],
    "n": "Authentic Mexican Torta - Tortas Ahogadas",
    "a": "DeAnna N.",
    "r": "0",
    "s": 12,
    "des": "\"This is a delicious drowned sandwich that is great for an easy meal your family will love. My children eat these up!\"",
    "ins": "Preheat an oven to 475 degrees F (245 degrees C).\nMix the 16 cloves of minced garlic, 2 tablespoons of minced oregano, 2 teaspoons of salt, and pepper in a bowl. Rub garlic mixture over the pork butt, and place pork in a shallow roasting pan.\nRoast in the preheated oven for 20 minutes, then reduce oven temperature to 350 degrees F (175 degrees C). Continue roasting until pork is tender and no longer pink in the center, about 2 hours and 15 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Cover the meat with two layers of aluminum foil, and allow to rest in a warm area for 20 minutes before rough chopping or shredding it. Reserve pan drippings.\nPlace the chipotle peppers in a bowl, and cover with hot water. Allow peppers to soak until softened, about 3 minutes; drain. Set aside. Heat the vegetable oil in a skillet over medium heat. Stir in 8 cloves of minced garlic and the chopped onions; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the Roma tomatoes, 1 cup of water, chipotle chili peppers, 5 teaspoons of oregano, sugar, and salt to taste. Add the reserved pan drippings. Simmer, uncovered, over low heat for 15 to 20 minutes, stirring frequently.\nPour the chipotle sauce into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the sauce moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the sauce right in the skillet. Strain the sauce through a sieve.\nTo serve: Hollow out the bottom half of each bolillo to make a shallow bowl for the chopped pork. Scoop about 2 tablespoons of the chipotle sauce over the bottom of each roll, then arrange the chopped pork over the sauce. Top each sandwich with a couple slices of pickled jalapeno, followed by the top half of the roll. Pour about 1/4 cup of additional chipotle sauce over the entire sandwich.",
    "pt": "40 m",
    "ct": "2 h ",
    "tt": "3 h ",
    "i": "702556.jpg",
    "o": "",
    "st": "allrecipes"
}