{
    "id": 213235,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Koftas (Dumplings):",
        "2 potatoes, peeled",
        "1 cup paneer cheese, grated (optional)",
        "2 teaspoons cornstarch",
        "2 teaspoons ground cumin",
        "2 teaspoons cayenne pepper",
        "1 teaspoon salt",
        "vegetable oil for frying",
        "Gravy:",
        "8 cashews (optional)",
        "1/4 cup water (optional)",
        "1 tablespoon vegetable oil",
        "1 green chile pepper, chopped",
        "1/2 teaspoon ginger-garlic paste",
        "1/2 teaspoon cumin seed",
        "1 onion, grated",
        "1/4 cup tomato puree",
        "2 teaspoons ground coriander",
        "1 teaspoon salt",
        "1 teaspoon garam masala",
        "1/4 teaspoon ground turmeric",
        "1/4 teaspoon cayenne pepper",
        "1/4 cup heavy whipping cream",
        "1/4 cup milk",
        "2 tablespoons water, or as needed (optional)"
    ],
    "nut": [
        "Calories > 349 kcal",
        "Carbs > 33.3 g",
        "Cholesterol > 30 mg",
        "Fat > 19.6 g",
        "Protein > 12.1 g",
        "Sodium > 1520 mg"
    ],
    "n": "Malai Kofta (Indian Cheese and Potato Dumplings)",
    "a": "Sammy",
    "r": "0",
    "s": 4,
    "des": "\"Malai kofta is a north Indian dish that consists of dumplings in a gravy. It can be eaten with Indian breads like puri, paratha, and naan, or with rice. The dumplings can also be served as cutlets on bread or a bun as snacks. Garnish with chopped cilantro.\"",
    "ins": "Place potatoes in a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and mash.\nCombine mashed potatoes, grated paneer cheese, cornstarch, ground cumin, cayenne pepper, and salt in a bowl. Shape into approximately 8 small dumplings.\nHeat oil over medium-high heat in a large skillet; fry dumplings until golden brown, 5 to 7 minutes.\nPlace cashews and 1/4 cup water in a bowl; let stand at least 10 minutes. Puree mixture in a food processor.\nHeat 1 tablespoon oil in a skillet. Add chopped green chile pepper, ginger-garlic paste, and cumin seed; stir to combine. Add grated onion; cook and stir until light brown, 5 to 6 minutes. Add tomato puree, ground coriander, salt, garam masala, ground turmeric, and cayenne pepper. Cook and stir until flavors are blended, about 5 minutes.\nStir cashew puree, cream, and milk into tomato mixture; add water to thin. Add dumplings to the gravy just before serving.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}