{
    "id": 213336,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound potatoes, peeled and cut into chunks",
        "4 cups finely chopped cabbage",
        "2 large leeks (white and pale green parts only), sliced into 1/4-inch rounds",
        "1 cup milk",
        "2 tablespoons caraway seeds",
        "1/2 teaspoon anise seeds",
        "1/4 cup butter",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 120 kcal",
        "Carbs > 16.1 g",
        "Cholesterol > 14 mg",
        "Fat > 5.5 g",
        "Protein > 3 g",
        "Sodium > 97 mg"
    ],
    "n": "My Colcannon",
    "a": "tohaveaplan",
    "r": "0",
    "s": 10,
    "des": "\"Colcannon the first time around (usually) doesn't have meat in it.  Subsequent days after it was made, corned beef or bacon might be added to revive it from the fridge. This is another first night option of how to make it.\"",
    "ins": "Place the potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two.\nWhile potatoes are boiling, place the cabbage into a pot with several tablespoons of water; cover, bring to a boil over medium heat, and reduce heat to medium-low. Cook the cabbage until tender, 10 to 15 minutes. Pour off any excess liquid, and set the cabbage aside.\nPlace the sliced leeks, milk, caraway seeds, and anise seeds into a large saucepan over medium-low heat, and bring to a simmer. Cook the leeks until soft, about 10 minutes, stirring occasionally. Add the butter, and season with salt and pepper; let the mixture stand off the heat until the butter melts.\nMash the potatoes with a masher in a large bowl, and stir in the leek mixture until the mashed potatoes are slightly chunky. Stir in the cooked cabbage, and serve.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "995001.jpg",
    "o": "",
    "st": "allrecipes"
}