{
    "id": 213341,
    "old_rating": "4.70642",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup Irish stout beer (such as GuinnessÂ®)",
        "1 cup butter, cut into pieces",
        "3/4 cup unsweetened cocoa powder",
        "2 eggs",
        "2/3 cup sour cream",
        "2 cups all-purpose flour",
        "2 cups white sugar",
        "1 1/2 teaspoons baking soda",
        "3/4 teaspoon salt",
        "3 cups confectioners' sugar, or as needed",
        "1/2 cup butter at room temperature",
        "3 tablespoons Irish cream liqueur (such as BaileysÂ®), or as needed",
        "8 ounces bittersweet chocolate, coarsely chopped",
        "2/3 cup heavy cream",
        "2 tablespoons butter at room temperature"
    ],
    "nut": [
        "Calories > 579 kcal",
        "Carbs > 73.2 g",
        "Cholesterol > 91 mg",
        "Fat > 30.5 g",
        "Protein > 4.9 g",
        "Sodium > 380 mg"
    ],
    "n": "Perfect St. Patrick's Day Cake",
    "a": "jowolf2",
    "r": "0",
    "s": 16,
    "des": "\"With GuinnessÂ® and Irish Cream, so rich and decadent, a delicious Irish treat for St. Patty's Day or any time of year!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line 2 9-inch cake pans with parchment paper, and spray with cooking spray.\nPour the beer into a saucepan, add the butter, and bring to a simmer over medium-low heat. Remove the pan from the heat, and whisk in the cocoa powder until the mixture is smooth. Allow the mixture to cool. In a bowl, beat the eggs and sour cream together until smooth with an electric mixer, and stir in the stout mixture to make a smooth, thick liquid.\nIn a large bowl, mix together the flour, sugar, baking soda, and salt. Pour the stout mixture into the flour mixture, and gently combine with a spatula. Pour the batter into the prepared pans.\nBake in the preheated oven until the cakes are set and a toothpick inserted into the center of a cake comes out clean, about 30 minutes. Remove and let cool in pans for 5 minutes before inverting the cakes onto wire racks to finish cooling.\nMix together the confectioners' sugar, butter, and Irish cream liqueur until the mixture forms a smooth and spreadable frosting (add more sugar or liqueur as needed to create the desired consistency). Spread half the frosting on top of each cake.\nPlace the chopped chocolate into a heatproof bowl. Bring cream to almost boiling in a small saucepan, and pour over the chocolate. Stir in the butter, and stir the mixture until the chocolate melts and the mixture is very smooth. Allow to cool until the mixture is pourable but not thin or overly runny, 10 to 15 minutes. Stack a cake gently on top of the other, frosting sides uppermost, and carefully drizzle the chocolate mixture over the cake, allowing decorative drips to run down the sides.",
    "pt": "35 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "4486886.jpg",
    "o": "4486886.jpg,4486375.jpg,4467568.jpg,3360460.jpg,2994580.jpg,2139146.jpg",
    "st": "allrecipes"
}