{
    "id": 213335,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 egg white, beaten",
        "1/2 teaspoon cornstarch",
        "1/4 teaspoon ground white pepper",
        "3 thin slices fresh ginger root",
        "1 (6 ounce) fillet swai fish, cut into bite-sized pieces",
        "1 tablespoon vegetable oil",
        "10 Sichuan peppercorns",
        "5 dried chile de arbol peppers",
        "1 tablespoon vegetable oil",
        "2 teaspoons Sichuan bean sauce",
        "2 cups water",
        "3 stalks celery, cut into 1/2-inch pieces",
        "1 cup sliced napa cabbage",
        "2 teaspoons minced garlic",
        "2 sprigs cilantro"
    ],
    "nut": [
        "Calories > 291 kcal",
        "Carbs > 10.5 g",
        "Cholesterol > 39 mg",
        "Fat > 20.4 g",
        "Protein > 17.8 g",
        "Sodium > 446 mg"
    ],
    "n": "Shui Zhu Yu (Sichuan Boiled Fish)",
    "a": "Tao,RN",
    "r": "0",
    "s": 2,
    "des": "\"Shui Zhu Yu is one of the most common Sichuan fish dishes. 'Shui Zhu' is also one of the most famous Sichuan cooking styles. Its essential ingredient is Sichuan bean sauce. 'Shui' means water. 'Zhu' means boil. You might have also heard about 'Shui Zhu Niu Rou' which uses beef in place of fish. You may use 2 cups of soy bean sprouts to substitute for the celery and Napa cabbage stem. Cod is also a good substitute for basa. Enjoy the fish and I wish you 'Nian Nian You Yu'--Happy New Year!\"",
    "ins": "Stir the egg white, cornstarch, white pepper, and egg white together in a bowl; add the basa and mix to coat. Set aside and allow to marinate at least 15 minutes.\nHeat 1 tablespoon vegetable oil in a skillet over medium heat; cook and stir the peppercorns and dried chile peppers in the hot oil until they turn a very dark red (they will look almost black, so be careful not to burn the chiles). Remove the dried chili peppers and peppercorns from the skillet. Mince the chile peppers. Mash the peppercorns finely; set aside.\nReturn the skillet to the medium heat and add 1 tablespoon vegetable oil and the bean sauce; cook and stir the bean sauce with the oil until the mixture turns red. Stir the water into the sauce, increase heat to high and cook until the sauce simmers. Remove the ginger slices from the marinating fish and add to the boiling sauce; cook the fish at a boil until the flesh turns white.\nDivide the celery and cabbage between two soup bowls. Pour the fish and sauce over the celery and cabbage.  Top with the garlic, peppercorns, and chile peppers.\nHeat 1 tablespoon olive oil in a skillet over high heat until it just begins to smoke; carefully pour the hot oil over the garlic, peppercorns, and chile peppers. Garnish each portion with cilantro to serve.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "349249.jpg",
    "o": "",
    "st": "allrecipes"
}