{
    "id": 213479,
    "old_rating": "4.38095",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "8 ounces sour cream",
        "1 teaspoon seasoned salt",
        "1/2 teaspoon black pepper",
        "8 ounces frozen mixed vegetables",
        "1/2 cup chopped onion",
        "1 (32 ounce) package frozen bite-size potato nuggets (such as Tater TotsÂ®)",
        "1 1/2 pounds leftover meatloaf, sliced",
        "1 1/2 cups shredded sharp Cheddar cheese (optional)"
    ],
    "nut": [
        "Calories > 607 kcal",
        "Carbs > 43.9 g",
        "Cholesterol > 120 mg",
        "Fat > 38.9 g",
        "Protein > 26.9 g",
        "Sodium > 1366 mg"
    ],
    "n": "Leftover Meatloaf Tater Tot Casserole",
    "a": "layla_y",
    "r": "0",
    "s": 8,
    "des": "\"This is a versatile recipe designed to use up leftover meatloaf in a tasty one-dish meal.  Frozen tater tots, onions and vegetables are coated in a sour cream/condensed soup sauce with meatloaf pieces pressed into the surface. A cheese topping keeps the meatloaf moist during cooking and adds crispness, but ketchup or french-fried onions could also be used.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nCombine the cream of mushroom soup, cream of chicken soup, sour cream, seasoned salt, and pepper. Stir in the mixed vegetables and onion. Add the tater tots and stir until they are coated with the mixture. Pour into the prepared baking dish. Press the meatloaf slices into the top of the tater tot mixture.\nBake in preheated oven 15 minutes; sprinkle the Cheddar cheese over the top, and bake 35 minutes until the cheese browns. Remove from the oven and let stand 10 minutes before serving.",
    "pt": "10 m",
    "ct": "50 m",
    "tt": "1 h",
    "i": "1293265.jpg",
    "o": "",
    "st": "allrecipes"
}