{
    "id": 213478,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup uncooked white rice",
        "2 cups water",
        "1/2 pound ground chicken",
        "1/2 tablespoon light-colored soy sauce",
        "ground white pepper",
        "1 tablespoon vegetable oil",
        "1 clove garlic, minced",
        "2 bok choy stalks, chopped",
        "2 eggs, lightly beaten",
        "2 tablespoons light soy sauce",
        "1 tablespoon yeast extract spread (such as MarmiteÂ®)",
        "white pepper to taste"
    ],
    "nut": [
        "Calories > 658 kcal",
        "Carbs > 82.1 g",
        "Cholesterol > 255 mg",
        "Fat > 16.3 g",
        "Protein > 42.1 g",
        "Sodium > 1555 mg"
    ],
    "n": "Fried Rice with MarmiteÂ®",
    "a": "smashboombang",
    "r": "0",
    "s": 2,
    "des": "\"My nanny made this for me as a child growing up in Malaysia and I learnt to cook it and it's been my favorite fried rice dish EVER! I'm a student and so I make this dish a lot simply because it barely takes any effort at all. I have many MarmiteÂ® hater friends who absolutely despise the thought of MarmiteÂ® and even they love it because once it is combined with the rice and other ingredients, it is extremely fragrant and it doesn't even taste strongly of MarmiteÂ® at all! Adventurous food fanatics, I assure you that this is a winner!\"",
    "ins": "Bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. If possible, cook the rice a day beforehand and leave it overnight in the fridge or cook it a couple of hours before you are ready to use it and leave it to cool.\nCombine the chicken, 1/2 tablespoons soy sauce, and pepper in a bowl. Set aside.\nHeat 1 tablespoon of oil in a frying pan or a wok on high heat and fry the garlic and chicken until brown, making sure to break the chicken up into bits as you go along. Add the bok choy, cooled rice, and pepper. Stir for a minute.\nReduce the heat to medium; make a hole in the middle of the frying pan and pour the egg into the hole. Add more oil if necessary. Cook for a minute until the egg starts to set, cover the top of the egg with the rice and cook for half a minute more; stir.\nStir in 2 tablespoons soy sauce; then stir in the yeast extract spread. When everything has turned a slightly brownish color, add some pepper to taste. Give it a final quick stir, make sure that the chicken is cooked thoroughly, and serve.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "2344077.jpg",
    "o": "",
    "st": "allrecipes"
}