{
    "id": 213548,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "5 potatoes, peeled and cubed",
        "1 teaspoon cumin seeds",
        "1/2 teaspoon ground coriander",
        "1/2 teaspoon ground turmeric",
        "6 fresh curry leaves",
        "1 green chile pepper, halved lengthwise",
        "2 tablespoons vegetable oil (optional)",
        "1 teaspoon mustard seeds",
        "1 green bell pepper, finely diced (optional)",
        "1 clove garlic, minced (optional)",
        "1 small onion, finely diced",
        "1/4 cup frozen chopped spinach, thawed and drained (optional)",
        "1/2 cup frozen corn",
        "1/2 cup frozen peas",
        "1 (16 ounce) can baked beans",
        "1/2 cup chopped fresh cilantro",
        "1/2 teaspoon chili powder",
        "1/2 teaspoon salt",
        "ground black pepper to taste",
        "2 tablespoons butter",
        "3 tablespoons milk",
        "1 pinch salt"
    ],
    "nut": [
        "Calories > 166 kcal",
        "Carbs > 28.2 g",
        "Cholesterol > 5 mg",
        "Fat > 4.8 g",
        "Protein > 4.9 g",
        "Sodium > 260 mg"
    ],
    "n": "Vegetable Shepherd's Pie with Baked Beans",
    "a": "Miss S",
    "r": "0",
    "s": 12,
    "des": "\"Here's a spicy baked bean/vegetable mix with a creamy mashed potato topping. I invented this recipe for my boyfriend for Valentine's Day. This is suitable for vegetarians. Alterations can be made to the recipe by adding different types of vegetables or adding cheese to the topping. The recipe is based on the Indian style cooking and can be eaten as a dish (with or without adding other vegetables). You may omit some of the herbs, but make sure you keep the mustard seeds, cumin seeds, coriander, turmeric powder and chili!\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).\nPlace the potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two.\nMeanwhile, combine cumin seeds, ground coriander, ground turmeric, curry leaves, and sliced green chile in a bowl. Set aside. Place vegetable oil and mustard seeds in a large skillet. Cover and cook over medium heat until the mustard seeds begin popping, then reduce heat to low. When the popping stops, quickly add the cumin mixture and replace the lid; cook until the herbs make a hissing sound. Mix in the green bell pepper, garlic, and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the spinach, corn, and peas until heated through. Stir in the baked beans. Toss in the cilantro, and season with chili powder, 1/2 teaspoon of salt, and pepper. Divide vegetable and bean mixture evenly into two 9-inch round pie pans.\nCombine potatoes, butter, milk, and 1 pinch of salt in a bowl. Mash until smooth. Spread mashed potatoes over the bean mixture using a fork to create small peaks that will become crisp during baking.\nBake in the preheated oven until potatoes are golden brown, 20 to 25 minutes. Cool for 5 minutes before serving.",
    "pt": "40 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "4476430.jpg",
    "o": "",
    "st": "allrecipes"
}