{
    "id": 213506,
    "old_rating": "4.67857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (4 ounce) 1 1/2 inch thick filet mignon steaks",
        "1 tablespoon olive oil",
        "salt to taste",
        "2 tablespoons butter",
        "2 tablespoons olive oil",
        "1 large shallot, minced",
        "2 tablespoons minced garlic",
        "1/4 cup Chardonnay wine",
        "1/2 pound uncooked shrimp - peeled, deveined, and cut into 3 pieces",
        "1/4 cup heavy cream",
        "1 tablespoon butter",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 777 kcal",
        "Carbs > 9.5 g",
        "Cholesterol > 317 mg",
        "Fat > 63.1 g",
        "Protein > 37.5 g",
        "Sodium > 534 mg"
    ],
    "n": "Filet Mignon with Garlic Shrimp Cream Sauce",
    "a": "Ches",
    "r": "0",
    "s": 2,
    "des": "\"I am a big fan of combining steak and seafood. This is a cheaper option than a jumbo lump crabmeat recipe I enjoy as well. Hope you find it tasty.\"",
    "ins": "Heat a heavy steel or cast-iron skillet over medium-high heat. Brush both sides of each filet with 1 tablespoon olive oil, and sprinkle with salt. Gently place the filets into the hot skillet, and cook until they start to become firm and are reddish-pink and juicy in the center, about 3 to 4 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Set the filets aside to rest, covered loosely with foil.\nMelt 2 tablespoons butter with 2 tablespoons of olive oil in the skillet over medium heat until the foam subsides from the butter. Cook and stir the shallot and garlic until tender, about 2 minutes. Pour in the wine, and cook and stir until the wine reduces by half, about 3 minutes.\nStir in the shrimp, cream, 1 tablespoon of butter, and a pinch of salt and pepper to taste. Cook and stir until the sauce is thickened and velvety and the shrimp are pink, about 2 minutes.\nTo serve, place filets on serving plates, and top each with half the shrimp sauce. Sauce will thicken slightly as it cools.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "1127918.jpg",
    "o": "3955892.jpg,3955885.jpg,3860981.jpg,3833455.jpg,2746691.jpg,2543587.jpg",
    "st": "allrecipes"
}