{
    "id": 213571,
    "old_rating": "2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups peeled and sliced apples",
        "1 cup brown sugar",
        "1/4 cup all-purpose flour",
        "2 tablespoons vinegar",
        "1 cup water",
        "1 teaspoon vanilla extract",
        "1 tablespoon butter",
        "1 cup all-purpose flour",
        "2 teaspoons baking powder",
        "2 1/2 tablespoons shortening",
        "3/4 cup milk"
    ],
    "nut": [
        "Calories > 307 kcal",
        "Carbs > 55.6 g",
        "Cholesterol > 8 mg",
        "Fat > 8.2 g",
        "Protein > 3.9 g",
        "Sodium > 198 mg"
    ],
    "n": "Apple Pan Dowdy",
    "a": "Peggy Fugate",
    "r": "0",
    "s": 6,
    "des": "\"An old fashioned recipe my mother has made since 1954. You add a cooked syrup over the apples, and top with a flour combination topping.  It is a different type of apple cobbler you will really enjoy. You can serve plain or top with milk or ice cream.\n\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9-inch square baking dish. Layer the sliced apples evenly into the baking dish.\nMix together brown sugar and 1/4 cup flour in a saucepan, and stir in vinegar and water until the mixture is well blended and the sugar has dissolved. Bring to a simmer over low heat, and stir constantly until the mixture has thickened, about 3 minutes. Remove from heat, let cool for about 10 minutes, and stir in the vanilla extract and butter. Pour the mixture over the apple slices in the pan.\nMix together 1 cup flour and the baking powder in a bowl until there are no more lumps, and cut the shortening into the flour mixture until the mixture forms crumbs the size of peas. Stir in the milk, and spread the batter over the apples and syrup.\nBake in the preheated oven until the topping is golden brown and the apples are tender, about 35 minutes.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "606536.jpg",
    "o": "",
    "st": "allrecipes"
}