{
    "id": 213507,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups strawberries, sliced",
        "1/4 cup brown sugar",
        "1/4 cup balsamic vinegar",
        "1 tablespoon olive oil",
        "4 (6 ounce) filet mignon (beef tenderloin)",
        "salt and pepper to taste",
        "1 tablespoon chilled butter",
        "freshly ground black pepper to taste"
    ],
    "nut": [
        "Calories > 438 kcal",
        "Carbs > 22.3 g",
        "Cholesterol > 94 mg",
        "Fat > 27 g",
        "Protein > 26.1 g",
        "Sodium > 127 mg"
    ],
    "n": "Filet Mignon and Balsamic Strawberries",
    "a": "cdagirl",
    "r": "0",
    "s": 4,
    "des": "\"Also great for barbecues! The succulent meat together with this summer fruit complement each other surprising well! A great idea for something new. Serve steaks over mashed potatoes.\"",
    "ins": "Mix together the strawberries, brown sugar, and balsamic vinegar in a bowl, and allow to sit for 1 to 3 hours, stirring occasionally.\nPreheat an oven to 400 degrees F (200 degrees C).\nHeat olive oil in an oven-safe, heavy steel or cast-iron skillet over high heat. Sprinkle the filets with salt and pepper on both sides, gently place in the hot skillet, and sear each side until well-browned, 1 to 2 minutes per side. Slide the skillet into the preheated oven, and cook until they start to become firm and are reddish-pink and juicy in the center, about 10 minutes. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Transfer the steaks to a platter, and tent with foil to rest.\nPour steak juices from the skillet into a small saucepan. Strain the strawberries and discard the liquid. Add the strawberries to the steak juices, bring the sauce to a simmer over medium-low heat, and melt the butter into the sauce, tilting the pan several times to gently incorporate the butter into the sauce. Serve each fillet topped with about 1/2 cup of strawberries and a sprinkle of freshly ground black pepper.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "1313633.jpg",
    "o": "4484409.jpg,4333327.jpg,3673126.jpg,3518578.jpg,2291659.jpg,1374937.jpg",
    "st": "allrecipes"
}