{
    "id": 213603,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "For the Dough:",
        "3 eggs",
        "1 cup white sugar",
        "3/4 cup vegetable oil",
        "1/3 cup apple juice",
        "1 tablespoon lemon juice",
        "1 tablespoon vanilla extract",
        "1 tablespoon baking powder",
        "5 cups all-purpose flour",
        "For the Filling:",
        "1 (19.8 ounce) box brownie mix",
        "2 eggs",
        "1/4 cup water",
        "1/2 cup vegetable oil",
        "1 egg",
        "1 tablespoon water"
    ],
    "nut": [
        "Calories > 521 kcal",
        "Carbs > 70 g",
        "Cholesterol > 63 mg",
        "Fat > 24.3 g",
        "Protein > 7.6 g",
        "Sodium > 221 mg"
    ],
    "n": "Hamentashen with Brownie Filling",
    "a": "Chef4Six",
    "r": "0",
    "s": 16,
    "des": "\"Here is a twist on the classic hamentashen cookie eaten on the Jewish holiday of Purim. Instead of filling this triangular-shaped cookie with jam or poppy seeds, I used brownie batter. Absolutely delicious!\"",
    "ins": "Beat the eggs and sugar until creamy. Stir in the vegetable oil, apple juice, lemon juice, and vanilla extract. Mix the baking powder into the flour and add it to the egg mixture, stirring to form a dough. Wrap the dough in plastic and refrigerate for 3 hours or overnight.\nPrepare the filling: combine the brownie mix, eggs, water, and vegetable oil and mix well. (You can also follow the package directions and use the low-fat version, if desired). Refrigerate the brownie batter for 3 hours or overnight.\nRemove the cookie dough from the refrigerator and let it rest at room temperature for 30 minutes. Mix the egg and tablespoon of water to make an egg wash.\nPreheat an oven to 375 degrees F (190 degrees C).\nRoll out half the dough on a long piece of parchment paper into a rectangle about 1/4 inch thick. Use a large round cookie cutter to cut circles in the dough. Remove the scraps of dough from around the circles.\nUsing two spoons, place 1 tablespoon of chilled brownie batter in the center of each cookie dough circle.  Brush the edges of the cookie circles with egg wash.\nFold the cookie into a triangular shape, bringing the edges up so they partially overlap the brownie filling. Pinch the corners to seal the dough. Brush the hamentashen with egg wash. Repeat with the remaining circles and the other half of the dough.\nTransfer the parchment paper holding the cookies onto a baking sheet. Bake in the preheated oven until the bottoms of the cookies are light golden brown, about 10 minutes.",
    "pt": "1 h",
    "ct": "10 m",
    "tt": "4 h ",
    "i": "359339.jpg",
    "o": "",
    "st": "allrecipes"
}