{
    "id": 213636,
    "old_rating": "4.372",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "4 (4 ounce) skinless, boneless chicken breast halves",
        "1/4 cup water",
        "1 (.7 ounce) package dry Italian-style salad dressing mix",
        "1 clove garlic, pressed",
        "1 (8 ounce) package cream cheese, softened",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "1 (4.5 ounce) can chopped canned mushrooms",
        "1 (8 ounce) package spaghetti",
        "1 tablespoon chopped fresh parsley"
    ],
    "nut": [
        "Calories > 619 kcal",
        "Carbs > 53.2 g",
        "Cholesterol > 134 mg",
        "Fat > 26.3 g",
        "Protein > 40.2 g",
        "Sodium > 1674 mg"
    ],
    "n": "Slow Cooker Italian Chicken Alfredo",
    "a": "TLSmith",
    "r": "0",
    "s": 4,
    "des": "\"I came up with this recipe with ingredients on hand and it instantly became a family favorite!  You can even make it using low sodium/fat free/reduced fat ingredients and it still has a wonderful flavor!\"",
    "ins": "Spray the crock of a slow cooker with non-stick cooking spray. Place chicken breasts in crock. Combine Italian dressing mix, and water in a small bowl.  Pour over chicken; sprinkle with garlic, cover, and cook on Low 4 hours.\nAfter 4 hours, whisk softened cream cheese and cream of chicken soup together in a  bowl.  Pour over chicken; stir in mushrooms.  Cover and cook on Low for 1 additional hour.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the spaghetti, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 12 minutes. Drain well in a colander set in the sink.\nTo serve, spoon chicken and sauce over hot cooked pasta and sprinkle with parsley.",
    "pt": "20 m",
    "ct": "5 h",
    "tt": "5 h ",
    "i": "1464549.jpg",
    "o": "4536406.jpg,4038832.jpg,3145509.jpg,2925103.jpg,2615392.jpg,1621413.jpg",
    "st": "allrecipes"
}