{
    "id": 213626,
    "old_rating": "4.56944",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup dry navy beans",
        "1 large bunch kale, rinsed, stemmed and chopped",
        "1 tablespoon olive oil",
        "1 pound spicy linguica sausage, sliced",
        "1 cup chopped shallots",
        "4 cups chicken broth",
        "salt and pepper to taste",
        "1/2 teaspoon hot sauce, or to taste"
    ],
    "nut": [
        "Calories > 373 kcal",
        "Carbs > 20.3 g",
        "Cholesterol > 50 mg",
        "Fat > 23.8 g",
        "Protein > 19.2 g",
        "Sodium > 727 mg"
    ],
    "n": "Sausage, Kale, and White Bean Soup",
    "a": "Always Cooking Up Something",
    "r": "0",
    "s": 8,
    "des": "\"A comforting bean soup with spicy sausage and leafy kale. Easy to put together and delicious on a cold winter's day. You can substitute other sausage, onion instead of shallots, and other greens for the kale, and it will still be tasty!\"",
    "ins": "Place the navy beans into a large container and cover with several inches of cool water; let stand 8 hours or overnight. Drain and rinse before using.\nCook the soaked beans in a pressure cooker in 4 cups of water for 25 minutes. Use the natural release method to release pressure. Do not drain.\nBring a separate pot of salted water to a boil. Add the kale and simmer until kale is bright green and tender, about 2 minutes. Drain in a strainer, and cool under cold running water. Set aside.\nHeat olive oil over medium heat in the soup pot. Brown the linguica slices on each side, about 5 minutes. Remove from the pot with a slotted spoon and set aside. Add shallots to pot and cook until soft, about 3 minutes. Pour in a splash of chicken broth and scrape up any browned bits of sausage.\nReturn the sausage to the pot along with the beans and their cooking liquid. Stir in the chicken broth. Bring soup to a boil, reduce heat to low, and simmer uncovered for 15 minutes. Add the kale and cook about 4 minutes longer. Season with salt, pepper, and hot sauce to taste.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "9 h ",
    "i": "557937.jpg",
    "o": "3107961.jpg,2113318.jpg,2052771.jpg,906010.jpg,906008.jpg,462771.jpg",
    "st": "allrecipes"
}