{
    "id": 213610,
    "old_rating": "4.53247",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 parsnips, peeled and cut into 1/2-inch pieces",
        "3 carrots, peeled and cut into 1/2-inch pieces",
        "1 celery root, peeled and cut into 1/2-inch pieces",
        "2 turnips, quartered",
        "1 sweet potato, peeled and cut into 1/2-inch pieces",
        "1 (2 pound) butternut squash, peeled and cut into 1/2-inch pieces",
        "1/4 cup olive oil",
        "1 teaspoon kosher salt",
        "1/2 teaspoon ground black pepper",
        "3 tablespoons butter",
        "1 stalk celery, diced",
        "1/2 sweet onion, diced",
        "1 quart vegetable broth",
        "1/2 cup half-and-half cream",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 324 kcal",
        "Carbs > 40.7 g",
        "Cholesterol > 23 mg",
        "Fat > 18 g",
        "Protein > 5.2 g",
        "Sodium > 1786 mg"
    ],
    "n": "Winter Root Vegetable Soup",
    "a": "LOOSENUP",
    "r": "0",
    "s": 6,
    "des": "\"I needed to use up root vegetables I had on hand and came up with this recipe.  A creamy, savory, and slightly sweet soup that is comforting on a cold winter night.\"",
    "ins": "Preheat an oven to 425 degrees F (220 degrees C).\nCombine parsnips, carrots, celery root, turnips, sweet potato, and butternut squash in a large roasting pan. Drizzle with olive oil, and season with 1 teaspoon of kosher salt and 1/2 teaspoon of pepper. Toss vegetables to evenly distribute seasonings.\nRoast in the preheated oven until the vegetables are easily pierced with a fork, 30 to 45 minutes, stirring every 15 minutes.\nMeanwhile, melt the butter in a large pot or Dutch oven over medium heat. Stir in the celery and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Pour in the vegetable broth and bring to a simmer, uncovered. Stir in the roasted vegetables and continue simmering for 10 minutes. Puree the soup using an immersion blender. Stir in the half and half, and season with salt and pepper, if necessary. If the soup becomes too thick, add more vegetable broth.",
    "pt": "35 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "494571.jpg",
    "o": "",
    "st": "allrecipes"
}