{
    "id": 213656,
    "old_rating": "4.38158",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups cheese flavored crackers (such as Cheez-ItÂ®), crushed",
        "1 cup French-fried onions, crushed",
        "1/2 cup Italian bread crumbs",
        "2 teaspoons sesame seed, toasted",
        "salt and ground black pepper to taste",
        "4 skinless, boneless chicken breast halves - cut in half",
        "3 tablespoons mayonnaise"
    ],
    "nut": [
        "Calories > 806 kcal",
        "Carbs > 55.9 g",
        "Cholesterol > 75 mg",
        "Fat > 48.3 g",
        "Protein > 32.3 g",
        "Sodium > 1274 mg"
    ],
    "n": "Amazing Crusted Chicken",
    "a": "Chefbound",
    "r": "0",
    "s": 4,
    "des": "\"This is my husband's favorite meal for me to cook. The chicken is so moist and flavorful. The more seasonings you use the better it tastes. Mayo may cause some areas to be a little mushy but it still tastes amazing!\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C). Spray a baking dish with cooking spray.\nMix cheese-flavored crackers, French-fried onions, Italian bread crumbs, sesame seeds, salt, and pepper in a bowl. Set aside.\nWash and pat chicken breasts dry. Spread a thin layer of mayonnaise on one side of each piece and place mayonnaise-side down in the cracker mixture. Spread a thin layer of mayonnaise on the other side of the chicken and cover with the cracker mixture, patting firmly into the chicken. Place chicken breasts on the prepared baking dish. Sprinkle remaining cracker mixture on top; lightly spray the chicken with cooking spray.\nBake in the preheated oven until the chicken breasts are no longer pink in the center and the juices run clear, 35 to 40 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "1366176.jpg",
    "o": "4461046.jpg,3999354.jpg,1034630.jpg,1002338.jpg,1002335.jpg,456733.jpg",
    "st": "allrecipes"
}