{
    "id": 213600,
    "old_rating": "3.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2/3 cup brown rice",
        "1 1/3 cups water",
        "1 (14 ounce) can light coconut milk",
        "1 (5 ounce) can evaporated milk",
        "1/3 cup granular no-calorie sucralose sweetener (such as SplendaÂ®), or more to taste",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground ginger",
        "1 tablespoon molasses",
        "1/2 teaspoon almond extract",
        "1 egg, beaten"
    ],
    "nut": [
        "Calories > 132 kcal",
        "Carbs > 14.2 g",
        "Cholesterol > 28 mg",
        "Fat > 6.7 g",
        "Protein > 3.4 g",
        "Sodium > 35 mg"
    ],
    "n": "Brown Rice Pudding III",
    "a": "cubgirl1960",
    "r": "0",
    "s": 8,
    "des": "\"I love rice pudding, but since I've been trying eat 'smarter' and I LOVE the nutty taste of brown rice, I've concocted this recipe. This works great when I make a large batch of rice and have yummy leftovers. The pudding may be topped with chopped nuts or coconut as desired.\n\"",
    "ins": "Bring the brown rice and water to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and the liquid has been absorbed, 45 to 50 minutes.\nBring the coconut milk and evaporated milk to a simmer in a large saucepan over medium-low heat. Stir the sucralose sweetener into the mixture until dissolved. Add the cinnamon, nutmeg, ginger, and molasses to the mixture and mix well.\nTemper the eggs by stirring about 2 tablespoons of the coconut mixture into the eggs; add to the mixture in the saucepan along with the almond extract. Stir the cooked rice into the mixture, breaking the grains apart with a spoon as you stir. Reduce heat to low and simmer until the mixture thickens, about 45 minutes.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}