{
    "id": 213669,
    "old_rating": "4.14667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound lean ground beef",
        "1 cup plain bread crumbs",
        "1 yellow onion, minced",
        "1 egg",
        "1/2 cup whipping cream",
        "2 teaspoons salt",
        "1 teaspoon ground allspice",
        "1/4 cup butter",
        "2 tablespoons all-purpose flour",
        "2 cups milk",
        "1/2 cup whipping cream"
    ],
    "nut": [
        "Calories > 747 kcal",
        "Carbs > 35.5 g",
        "Cholesterol > 243 mg",
        "Fat > 52.6 g",
        "Protein > 33.2 g",
        "Sodium > 1603 mg"
    ],
    "n": "Finnish Meatballs (Lihapyorykoita)",
    "a": "GLehtimaki",
    "r": "0",
    "s": 4,
    "des": "\"My family's favorite Finnish meal is these Lihapyorykoita (Finnish Meatballs) with Punajuuret (Beets), and Perunasose (Mashed Potatoes). Serve with cranberry sauce, I personally like a quarter of a pickle on the side.\"",
    "ins": "Mix the ground beef, bread crumbs, onion, egg, cream, salt, and allspice in a bowl with your hands until evenly mixed. Roll the mixture into golf ball-sized spheres.\nMelt the butter in a large skillet over medium heat. Cook about half the meatballs in the melted butter until evenly browned on all sides, 5 to 7 minutes; remove to a plate and repeat with the remaining meatballs, keeping the liquid in the skillet when finished.\nSift the flour into the skillet drippings; cook the flour in the skillet drippings until brown, 2 to 3 minutes. Slowly stream the milk into the skillet while whisking vigorously; pour the cream into the mixture and stir until smooth. If you aren't good at making gravy and end up with some lumps you can pour the gravy through a strainer. Return all the meatballs to the skillet; stir to coat with the gravy. Bring the mixture to a simmer and cook until the meatballs are cooked through, 15 to 20 minutes.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "4385974.jpg",
    "o": "",
    "st": "allrecipes"
}