{
    "id": 213662,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups semisweet chocolate chips",
        "1 (14 ounce) can sweetened condensed milk",
        "1 pinch salt",
        "1 1/2 teaspoons vanilla extract",
        "1 cup heavy cream",
        "9 ounces milk chocolate, chopped",
        "12 slices good-quality bacon, partially frozen",
        "1 pinch salt"
    ],
    "nut": [
        "Calories > 81 kcal",
        "Carbs > 8.6 g",
        "Cholesterol > 8 mg",
        "Fat > 4.9 g",
        "Protein > 1.5 g",
        "Sodium > 42 mg"
    ],
    "n": "Fudgy Bacon Supreme",
    "a": "AMANDA",
    "r": "0",
    "s": 80,
    "des": "\"Creamy chocolate fudge, topped off with a sweet chocolate ganache and garnished with (YOU GUESSED IT!) crunchy salty bacon! This combination of sweet and savory is PERFECT for unexpected appetizers, or just a dessert worth trying. I used this recipe for a contest, and won 50 bucks!\"",
    "ins": "For fudge, melt chocolate chips in a saucepan over very low heat . When the chips are nearly all melted,  stir in the condensed milk until the mixture is very smooth and creamy, and add the vanilla extract and a pinch of salt. Pour the fudge into a square 9x9-inch pan, and refrigerate until firm, at least 2 hours.\nFor ganache topping, place heavy cream and chopped milk chocolate into the top of a double boiler over simmering water, and stir until the chocolate has melted and the mixture is smooth. Remove from heat, and pour the ganache over the chilled fudge in an even layer. Return to refrigerator for at least 2 more hours to chill.\nSlice bacon into 1/2-inch squares, and place into a large, deep skillet. Cook over medium heat, stirring occasionally, until evenly browned and very crisp, about 10 minutes. Drain the bacon on a paper towel-lined plate. Sprinkle bacon bits with a pinch of salt.\nSpread the bacon bits over the ganache layer, pressing the bacon lightly into the fudge. Return to refrigerator, chill until bacon is cooled, at least 30 minutes; cut into squares.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "4 h ",
    "i": "369089.jpg",
    "o": "",
    "st": "allrecipes"
}