{
    "id": 213666,
    "old_rating": "4.736",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds boneless pork, cut into 1 1/2-inch cubes",
        "14 (4 inch) skewers",
        "salt and ground black pepper to taste",
        "seasoned salt (such as LAWRY'SÂ®) to taste",
        "4 eggs",
        "3 tablespoons milk",
        "2 cups Italian seasoned bread crumbs",
        "2 cups water",
        "2 cups vegetable oil for frying"
    ],
    "nut": [
        "Calories > 369 kcal",
        "Carbs > 23.4 g",
        "Cholesterol > 179 mg",
        "Fat > 15.8 g",
        "Protein > 31.7 g",
        "Sodium > 619 mg"
    ],
    "n": "Best City Chicken",
    "a": "Jennifer",
    "r": "0",
    "s": 7,
    "des": "\"I grew up in northeast Ohio and this was my all time favorite dish when I was little...now I make it, and my family loves it too! I like to use all pork for my city chicken; however tradition is to use pork and veal combined.  The grocery stores around me sell a pack of cubed pork with the wood skewers already in the pack  specifically for city chicken, so you may want to look for that first.  But, if you can't find that, then cubing your own pork will work fine.\"",
    "ins": "Thread 2 or 3 cubes of pork onto each skewer. Sprinkle each skewer on all sides with salt, black pepper, and seasoned salt, and set the skewers aside.\nWhisk eggs and milk together in a bowl. Place the seasoned bread crumbs in another bowl. Pour 2 cups of water into a 9x13-inch baking dish with a wire rack set in the dish, and set the dish aside.\nPreheat an oven to 350 degrees F (175 degrees C). Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nDip each skewer of pork into the egg mixture, then dip in crumbs; dip the skewers a second time into egg mixture and then crumbs. Gently lay the skewers, a few at a time, into the hot oil, and brown until the coating is crisp and golden brown, about 3 minutes per side. Set the fried skewers aside while you finish the rest. Once the skewers are all browned, set them on the wire rack in the baking dish. Cover the dish tightly with aluminum foil.\nCarefully place the baking dish with the skewers into the preheated oven, and bake until hot and no longer pink in the center, about 20 minutes. Remove the foil, and bake 10 minutes more to dry out the crumb coating. Serve hot.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "785777.jpg",
    "o": "4481545.jpg,3819975.jpg,2687641.jpg,2613793.jpg,2103734.jpg,878766.jpg",
    "st": "allrecipes"
}