{
    "id": 213709,
    "old_rating": "4.17647",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 red onion, sliced thin",
        "3 habanero peppers, sliced",
        "10 limes, juiced",
        "salt to taste",
        "3 ounces dried guajillo chile peppers, seeded and deveined",
        "1 tablespoon vegetable oil",
        "salt and pepper to taste",
        "3 pounds boneless pork shoulder, cut into 1-inch cubes",
        "3 cups fresh orange juice",
        "1 cup white vinegar",
        "1 bulb garlic, peeled",
        "7 1/2 ounces achiote paste"
    ],
    "nut": [
        "Calories > 468 kcal",
        "Carbs > 39.6 g",
        "Cholesterol > 89 mg",
        "Fat > 24.9 g",
        "Protein > 27.1 g",
        "Sodium > 368 mg"
    ],
    "n": "Authentic Cochinita Pibil (Spicy Mexican Pulled Pork)",
    "a": "gema",
    "r": "0",
    "s": 6,
    "des": "\"A traditional Mexican dish without the work! I couldn't believe that something that good was SO easy to make. The achiote paste can easily be found at most Mexican grocery stores. Mouthwatering!!!!\"",
    "ins": "Combine the onion, habanero peppers, lime juice, and salt in a bowl; cover and refrigerate while preparing and cooking the pork. Use rubber gloves when preparing the habanero peppers and avoid touching your eyes, nose, or skin while slicing peppers.\nPlace the guajillo peppers in a bowl; pour enough hot water over the peppers to cover. Allow to soak until the peppers are softened, about 10 minutes.\nHeat the oil in a large skillet at medium-high heat. Season pork with salt and pepper; cook in the hot oil until completely browned, 15 to 20 minutes. Transfer the pork to a slow cooker.\nCombine the guajillo peppers, orange juice, vinegar, garlic, and achiote paste in a blender; blend until smooth. Pour the sauce over the pork cubes in the slow cooker.\nCook on High until the pork easily falls apart, 6 to 8 hours. Remove the pork to a serving dish and shred with 2 forks. Pour the achiote sauce over the shredded pork. To serve, top with the onion-habanero salsa.",
    "pt": "25 m",
    "ct": "6 h ",
    "tt": "6 h ",
    "i": "383483.jpg",
    "o": "",
    "st": "allrecipes"
}