{
    "id": 213700,
    "old_rating": "4.64286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cloves garlic",
        "3 serrano peppers",
        "1 pound small green tomatillos, husks removed",
        "1 cup vegetable oil for frying",
        "9 corn tortillas",
        "3 cups water",
        "4 teaspoons chicken bouillon granules",
        "1/2 store-bought rotisserie chicken, meat removed and shredded",
        "1/4 head iceberg lettuce, shredded",
        "1 cup cilantro leaves",
        "1 (8 ounce) container Mexican crema, crema fresca",
        "1 cup grated cotija cheese"
    ],
    "nut": [
        "Calories > 284 kcal",
        "Carbs > 17.1 g",
        "Cholesterol > 70 mg",
        "Fat > 20.3 g",
        "Protein > 11 g",
        "Sodium > 222 mg"
    ],
    "n": "Enchiladas Verdes",
    "a": "gema",
    "r": "0",
    "s": 9,
    "des": "\"I learned this recipe from an amazing cook from Puebla. I've been perfecting it for over 15 years and realized that it was time to share it when my foodie friends tried to drink the sauce out of the saucepan. I use the roasted or baked chicken from the grocery store. I did it once only to save time, but found that they are tastier. Be conservative with the cream and the cheese. Do not use sour cream!\"",
    "ins": "Cover a large griddle with aluminum foil and preheat to medium-high.\nCook the garlic, serrano peppers, and tomatillos on the hot griddle until toasted and blackened, turning occasionally, about 5 minutes for the garlic, 10 minutes for the peppers, and 15 minutes for the tomatillos. Remove to a bowl and allow to cool.\nHeat oil in a small, deep skillet to 350 degrees F (175 degrees C). Using kitchen tongs, fry the tortillas individually, turning them once. They shouldn't be in the hot oil for more than 5 seconds per side. Remove excess oil with paper towels and keep warm. Remember that the hotter the oil, the less that the tortillas will absorb.\nPlace the toasted garlic, serrano peppers, tomatillos, and the water in a blender and blend until smooth; pour into a saucepan over medium heat and bring to a boil. Dissolve the chicken bouillon into the mixture, reduce heat to medium-low, and cook at a simmer until slightly thickened, about 10 minutes. The sauce shouldn't be too thick.\nSoak three tortillas in the sauce, one at a time, for a few seconds, fill them with shredded chicken, sprinkle the meat with some of the sauce, roll them and place them seam side down on a pasta bowl. Spoon a generous amount of sauce over them and top them with lettuce, cilantro, crema, and cotija cheese. Pour a little more sauce over the whole thing if desired. Repeat the procedure twice more. Serve immediately.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "392206.jpg",
    "o": "4483815.jpg,4482436.jpg,4462712.jpg,4462429.jpg,4024131.jpg,3934900.jpg",
    "st": "allrecipes"
}