{
    "id": 21372,
    "old_rating": "4.53659",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter",
        "1/3 cup white sugar",
        "24 graham crackers, crushed",
        "2 eggs",
        "3/4 cup white sugar",
        "1 (8 ounce) package cream cheese, softened",
        "1 envelope (1 tablespoon) unflavored gelatin",
        "1/4 cup water",
        "1 (15 ounce) can pumpkin",
        "3 eggs, separated",
        "1/2 cup milk",
        "1/2 cup white sugar",
        "1/2 teaspoon salt",
        "2 teaspoons ground cinnamon",
        "1/2 pint whipped cream"
    ],
    "nut": [
        "Calories > 209 kcal",
        "Carbs > 26.3 g",
        "Cholesterol > 62 mg",
        "Fat > 10.4 g",
        "Protein > 3.8 g",
        "Sodium > 210 mg"
    ],
    "n": "Pumpkin Cream Cheese Dessert",
    "a": "BZEEFMOM",
    "r": "0",
    "s": 24,
    "des": "\"This light and delicious three layered pumpkin dessert is a nice alternative to pumpkin pie. An easy to make graham cracker crust forms the foundation for cream cheese and pumpkin layers topped with whipped cream. This recipe contains raw eggs. We recommend that pregnant women, young children, the elderly and the infirm do not consume raw eggs.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nIn a medium saucepan over medium heat, melt butter. Stir in the sugar and mix well. Stir in graham cracker crumbs. Pat the mixture into baking dish.\nIn a medium mixing bowl, beat together the eggs, sugar and cream cheese. Pour the mixture over crust.\nBake 20 minutes in the preheated oven. Remove from heat and allow the mixture to cool.\nIn a small bowl, dissolve the gelatin in water.\nIn a medium saucepan over medium heat, mix the pumpkin, eggs, milk, sugar, salt and cinnamon. Reserve the egg whites. Stirring constantly, cook until thick, about 4 minutes. Remove from heat and mix in the gelatin. Allow the mixture to cool for approximately 20 minutes.\nIn a small bowl, beat the 3 egg whites until stiff. Gently fold the egg whites into the cooled pumpkin mixture. Pour the pumpkin mixture over the cream cheese mixture. Top with whipped cream. Cover and refrigerate approximately 2 hours.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "3 h",
    "i": "1523354.jpg",
    "o": "",
    "st": "allrecipes"
}