{
    "id": 213766,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 cups water",
        "1 (16 ounce) package Portuguese chourico sausage links",
        "12 quahogs",
        "1 large onion, coarsely chopped",
        "1 (12 ounce) package chicken-flavored bread stuffing mix (such as KraftÂ® Stove TopÂ®)",
        "1/2 cup margarine",
        "1/4 cup butter"
    ],
    "nut": [
        "Calories > 350 kcal",
        "Carbs > 23.7 g",
        "Cholesterol > 43 mg",
        "Fat > 23.2 g",
        "Protein > 11.2 g",
        "Sodium > 901 mg"
    ],
    "n": "Tim O'Toole's Famous Stuffed Quahogs",
    "a": "Scotty",
    "r": "0",
    "s": 12,
    "des": "\"Classic stuffed quahog recipes used stale bread and lots of seasoning. But my grandmother would have appreciated the pre-seasoned stuffing adaptation in this modernized version.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring water to a boil over high heat. Add sausage links; reduce heat to medium and simmer for 10 minutes. Remove links from broth; reserve the broth. Remove casings from the sausage.\nBring the broth back to a simmer and add the quahogs; cook until they open, 5 to 10 minutes. Remove the quahogs; reserve the broth. Remove the cooked quahogs from the shells. Separate the shell halves. If necessary wash the shells.\nPlace the sausage and quahog meat into the bowl of a food processor; process until chopped, about 12 seconds, depending on your processor. Scrape mixture into a bowl. Add chopped onion to the processor; chop about 5 seconds. Stir in to the meat mixture.\nMake the full container of stuffing according to package directions, using the margarine, and substituting the sausage/clam broth for water. There may be more broth than you need.\nMix together the stuffing and sausage/clam/onion mixture. Spoon filling into empty clam shell halves and top each with a small pat of butter (about a third of a teaspoon).\nPlace the shells on a baking pan; bake in the preheated oven until toasty brown on top, 15 to 20 minutes.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "475473.jpg",
    "o": "",
    "st": "allrecipes"
}