{
    "id": 213701,
    "old_rating": "4.87179",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 fresh tomatillos, husks removed",
        "3 serrano chile peppers, seeded and chopped",
        "1 clove garlic, peeled",
        "3 cups water",
        "6 slices bacon",
        "2 pounds flank steak, cut into 1/2-inch squares",
        "4 teaspoons chicken bouillon granules",
        "2 (15.5 ounce) cans pinto beans",
        "1/2 onion, chopped",
        "6 tablespoons chopped fresh cilantro",
        "ground black pepper, to taste",
        "1 lime, cut into 6 wedges"
    ],
    "nut": [
        "Calories > 374 kcal",
        "Carbs > 27.6 g",
        "Cholesterol > 58 mg",
        "Fat > 16.4 g",
        "Protein > 29.3 g",
        "Sodium > 944 mg"
    ],
    "n": "Carne en su Jugo (Meat in its Juices)",
    "a": "gema",
    "r": "0",
    "s": 6,
    "des": "\"One of Guadalajara's favorites. Small pieces of flank steak are cooked in their juices, then mixed with whole beans and crispy crumbled bacon. It makes me feel at home!\"",
    "ins": "Combine the tomatillos, serrano peppers, garlic, and water in a small saucepan over medium-high heat; bring to a boil, cover, and simmer for 10 minutes. Remove the pan from the heat and allow to cool. Transfer the contents to a blender and blend until smooth. Set aside.\nCook the bacon in a large, deep skillet over medium-high heat until crispy, about 10 minutes. Drain on a paper towel-lined plate. Crumble the bacon and set aside.\nPlace a non-stick skillet over medium-high heat; cook the flank steak in the hot skillet until completely browned. Pour the tomatillo mixture over the beef and bring to a boil. Stir the chicken bouillon into the mixture, and reduce heat to medium. Cover the skillet and simmer until tender, at least 30 minutes and up to 1 hour.\nMeanwhile, heat the pinto beans in a saucepan over medium heat until warm; reduce heat to low to keep warm until needed. Stir the bacon and pinto beans into the flank steak mixture; divide the mixture between 6 bowls. Garnish each with onion, cilantro, black pepper, and a lime wedge.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "1064926.jpg",
    "o": "4514028.jpg,4130104.jpg,3754603.jpg,3754602.jpg,2907390.jpg,1924114.jpg",
    "st": "allrecipes"
}