{
    "id": 213759,
    "old_rating": "4.86667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "20 ripe Fuyu persimmons, peeled and coarsely chopped",
        "1 lemon, juiced",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/4 cup agave syrup",
        "4 half-pint canning jars with lids and rings"
    ],
    "nut": [
        "Calories > 14 kcal",
        "Carbs > 3.7 g",
        "Cholesterol > 0 mg",
        "Fat > 0 g",
        "Protein > 0.1 g",
        "Sodium > < 1 mg"
    ],
    "n": "Spiced Persimmon Butter",
    "a": "Cathy",
    "r": "0",
    "s": 64,
    "des": "\"Cooked in a slow cooker, this is an easy and excellent way to use the fruit of a Fuyu persimmon tree. Spicy and full of natural sweetness, the jars make wonderful gifts or keep well in the refrigerator for one's own use. This spread is used just like jelly or apple butter and it is especially delicious on a hearty whole grain toasted bread.\"",
    "ins": "Place persimmons into a slow cooker; amount should fill a 3-quart cooker nearly to the top. Drizzle the lemon juice over the persimmons, cover the cooker, and cook on High for about 2 hours. Mash the persimmons in the cooker with a potato masher. Stir in the cinnamon, cloves, and agave syrup, set the cooker to Low, and cook uncovered 8 hours or overnight. Stir several times if possible, to prevent burning during the long cooking period.\nIn the morning, transfer the persimmon mixture to a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the persimmon butter moving before leaving it on to puree. Puree in batches until smooth. If you have an immersion blender, you can puree the persimmon butter right in the cooker if desired.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the persimmon butter into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings. Allow the jars to cool to room temperature, then refrigerate the jars; persimmon butter will keep for several weeks.",
    "pt": "40 m",
    "ct": "10 h",
    "tt": "10 h ",
    "i": "927929.jpg",
    "o": "",
    "st": "allrecipes"
}