{
    "id": 213832,
    "old_rating": "4.73256",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups all-purpose flour",
        "1/4 cup white sugar",
        "1 teaspoon baking soda",
        "2 teaspoons baking powder",
        "1 teaspoon salt",
        "2 eggs",
        "1 1/4 cups buttermilk",
        "1/4 cup corn oil",
        "1 cup raisins"
    ],
    "nut": [
        "Calories > 272 kcal",
        "Carbs > 48.3 g",
        "Cholesterol > 32 mg",
        "Fat > 6.1 g",
        "Protein > 6.6 g",
        "Sodium > 421 mg"
    ],
    "n": "Grandma McAndrews' Irish Soda Bread",
    "a": "Sheila T",
    "r": "0",
    "s": 12,
    "des": "\"This is not the dark bread you see in every restaurant in Dublin or Galway these days but I promise, it's authentic Irish Soda Bread, exactly how my late Irish grandma made it. Serve warm or cold with butter. This freezes great. I've made several loaves before St. Patrick's Day, or family parties. I freeze them, take them out the morning they're needed and warm up in a hot oven for 5 -7 minutes before serving.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet, or line with parchment paper.\nIn a large bowl, stir together the flour, sugar, baking soda, baking powder, and salt. In another bowl, whisk together eggs, buttermilk, and corn oil. Make a well in the center of the flour mixture, and pour in the buttermilk mixture. Add the raisins, and stir a few times, just until the ingredients come together into a soft dough. Turn the dough out onto a floured surface, and with floured hands shape dough into a ball. Place the dough on the prepared baking sheet, and cut a large cross in the top with a sharp knife.\nPlace the bread on a middle rack of the preheated oven, and bake until golden brown, 30 to 40 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "2155666.jpg",
    "o": "4486674.jpg,4486255.jpg,2156725.jpg,2155124.jpg,2067258.jpg,994867.jpg",
    "st": "allrecipes"
}