{
    "id": 213925,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/2 teaspoons minced garlic, divided",
        "1 teaspoon freshly ground black pepper",
        "1 pound lean skirt steak or flank steak",
        "8 cups packed torn romaine lettuce or mixed salad greens",
        "1 large tomato, seeded, chopped",
        "1 ripe avocado, peeled, seeded, diced",
        "1 1/4 cups SargentoÂ®Shredded Reduced Sodium Mild Cheddar Cheese or SargentoÂ® Artisan Blends Shredded Double Cheddar Cheese, divided",
        "1/4 cup thinly sliced red onion (optional)",
        "2 tablespoons extra virgin olive oil",
        "1 tablespoon fresh lemon juice or white wine vinegar",
        "2 teaspoons pureed chipotle chlies in adobo sauce (optional)"
    ],
    "nut": [
        "Calories > 415 kcal",
        "Carbs > 13.1 g",
        "Cholesterol > 63 mg",
        "Fat > 30.5 g",
        "Protein > 25.4 g",
        "Sodium > 229 mg"
    ],
    "n": "Grilled Pepper Steak Salad",
    "a": "Sargento",
    "r": "0",
    "s": 4,
    "des": "\"Steak, Reduced Sodium Mild Cheddar and salad work together perfectly in one bowl topped with a delicious, simple homemade dressing.\"",
    "ins": "Rub 2 teaspoons garlic and pepper over steak. Grill over medium-hot heat on a covered grill 3 to 5 minutes per side for medium doneness depending on thickness of steak. Transfer steak to a carving board; tent with foil and let stand 5 minutes.\nMeanwhile, combine lettuce, tomato, avocado, 1 cup cheese and red onion in a large bowl. Combine oil, lemon juice and remaining garlic in a small bowl; mix well. For a spicier dressing, add chipotle chilies. Add mixture to bowl; toss with lettuce mixture. Transfer to four serving plates.\nCarve steak crosswise into thin slices; arrange over salads. Top with remaining cheese.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "990011.jpg",
    "o": "",
    "st": "allrecipes"
}