{
    "id": 213995,
    "old_rating": "2.76923",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "1 onion, minced",
        "1/2 cup sour cream",
        "1/2 cup Italian seasoned bread crumbs",
        "2 eggs",
        "1/2 pound ground beef",
        "1/2 pound ground pork",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "2 tablespoons butter"
    ],
    "nut": [
        "Calories > 501 kcal",
        "Carbs > 17.7 g",
        "Cholesterol > 208 mg",
        "Fat > 36 g",
        "Protein > 26.5 g",
        "Sodium > 751 mg"
    ],
    "n": "Dana's Famous Swedish Meatballs",
    "a": "LaughingSong",
    "r": "0",
    "s": 4,
    "des": "\"Being very into my Swedish heritage, I took it upon myself to learn how to cook the food, among other things.  These are my famous Swedish Meatballs.  I can never seem to make enough. Serve with lingonberries (cranberries are a good substitute) or with sour cream and beef gravy sauce heated.\"",
    "ins": "Melt 2 tablespoons of butter in a skillet over medium heat. Stir in the onion, and cook until the onion has softened and turned translucent, about 5 minutes. Scrape into a bowl, and set aside until cool.\nStir the sour cream together with the bread crumbs in a small bowl. In a large bowl, lightly combine the onion, eggs, ground beef, ground pork, cinnamon, cloves, nutmeg, salt, and pepper; stir in the sour cream-crumb mixture, and lightly but thoroughly mix until combined. Form the meat mixture into small balls about the size of a walnut.\nMelt another 2 tablespoons of butter in a large skillet over medium-high heat. Add the meatballs, and cook until browned on all sides and no longer pink in the center, about 10 minutes.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "750041.jpg",
    "o": "",
    "st": "allrecipes"
}