{
    "id": 213994,
    "old_rating": "4.27273",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1/2 pound ground vegetarian breakfast sausage",
        "2 cups chopped onion",
        "2 cloves garlic, minced",
        "1 1/2 cups diced red bell pepper",
        "6 cups cubed whole-wheat country bread",
        "1 tablespoon Dijon mustard",
        "1 1/2 cups grated Swiss cheese",
        "12 large eggs",
        "2 cups 1% milk",
        "1 teaspoon salt, or to taste",
        "freshly ground black pepper to taste"
    ],
    "nut": [
        "Calories > 268 kcal",
        "Carbs > 19.6 g",
        "Cholesterol > 200 mg",
        "Fat > 13.3 g",
        "Protein > 17.4 g",
        "Sodium > 537 mg"
    ],
    "n": "Sunday Vegetarian Strata",
    "a": "bronxdog",
    "r": "0",
    "s": 12,
    "des": "\"A strata is a casserole of layers of bread, in this case vegetarian sausage and cheese baked in eggs. This one is really good for vegetarians on Easter.\"",
    "ins": "Heat the olive oil in a large skillet over medium heat and stir in the vegetarian sausage. Cook and stir until the sausage is crumbly, and evenly browned. Stir in the onion, garlic, and bell pepper; cook and stir until softened, 3 to 4 minutes. Remove from heat, and set aside.\nSpray a 9x13-inch baking dish with non-stick cooking spray. Arrange bread in an even layer in the prepared baking dish. Scatter the sausage mixture on top. Brush with the Dijon mustard, and sprinkle with cheese. Whisk eggs, milk, salt, and pepper in a large bowl, and pour over the cheese. Cover tightly with plastic wrap, and refrigerate for 2 hours or overnight.\nPreheat an oven to 350 degrees F (175 degrees C). Remove strata from the refrigerator, and unwrap.\nBake in the preheated oven until puffed, lightly browned, and the center is set, 1 hour to 1 1/2 hours. Allow to cool for 5 minutes before serving.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "3 h ",
    "i": "768004.jpg",
    "o": "",
    "st": "allrecipes"
}