{
    "id": 214000,
    "old_rating": "4.74359",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (10 pound) fully-cooked, bone-in ham",
        "4 cups boiling water, or as needed",
        "1 cup packed brown sugar",
        "2 tablespoons all-purpose flour",
        "2 tablespoons dry mustard powder",
        "1/4 cup honey",
        "1 teaspoon fresh lemon juice, or as needed",
        "1 (20 ounce) can pineapple chunks, drained",
        "1 (10 ounce) jar maraschino cherries, drained",
        "toothpicks"
    ],
    "nut": [
        "Calories > 668 kcal",
        "Carbs > 23.6 g",
        "Cholesterol > 218 mg",
        "Fat > 32.8 g",
        "Protein > 66.1 g",
        "Sodium > 146 mg"
    ],
    "n": "Baked Ham with Sweet Glaze",
    "a": "aellis0923",
    "r": "0",
    "s": 20,
    "des": "\"This is a common recipe brought down through my family. My grandmother made it, my mother still makes it, and  we all love it to pieces! It is great left over or chopped into a fresh green salad. I love this ham glaze because it is simple, easy and delicious!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Place ham on a rack set in a roasting pan, and carefully pour about 1/2 inch of boiling water into the pan beneath the ham.\nBake the ham in the preheated oven for 2 hours, or until a meat thermometer inserted into the thickest part of the meat (do not touch the bone) reads at least 140 degrees F (60 degrees C.)\nReduce oven heat to 350 degrees F (175 degrees C.) In a bowl, mix together the brown sugar, flour, dry mustard, honey, and lemon juice as needed to make a thick, smooth paste. Brush the ham generously with glaze. Skewer 1 pineapple chunk and 1 maraschino cherry per toothpick, and insert the decorated picks all over the ham.\nReturn the ham to the oven, and roast for 15 minutes. Baste the ham, fruit and all, with glaze and juices that have collected in the bottom of the pan, return to the oven, and roast for an additional 15 minutes. Let the ham rest for at least 10 minutes before slicing.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "3 h",
    "i": "739061.jpg",
    "o": "4525873.jpg,4517605.jpg,4504339.jpg,4503891.jpg,4369333.jpg,4272703.jpg",
    "st": "allrecipes"
}