{
    "id": 214028,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 eggs",
        "4 cups white sugar",
        "2 tablespoons imitation vanilla flavoring",
        "1 teaspoon anise extract",
        "1 teaspoon grated lime zest (optional)",
        "1 teaspoon grated lemon zest (optional)",
        "4 pounds ricotta cheese",
        "1 (12 ounce) bag semisweet chocolate chips",
        "1 tablespoon all-purpose flour",
        "6 (9 inch) prepared graham cracker crusts"
    ],
    "nut": [
        "Calories > 311 kcal",
        "Carbs > 42.8 g",
        "Cholesterol > 43 mg",
        "Fat > 13.4 g",
        "Protein > 6.9 g",
        "Sodium > 230 mg"
    ],
    "n": "Italian Cheesecake II",
    "a": "Keri",
    "r": "0",
    "s": 48,
    "des": "\"This is a sweet, moist chocolate chip cheesecake with a hint of citrus and anise flavors.  It is made with Ricotta cheese instead of cream cheese.  This dessert has been an Easter tradition in my family since before my father was born.  The recipe makes a lot, but it can easily be cut in half for smaller groups. Sprinkle additional chocolate chips on top of the cheesecakes before baking if desired.\"",
    "ins": "Preheat an oven to 375 degrees F (190 degrees C).\nBeat the eggs in a large mixing bowl, then mix in the sugar, vanilla flavoring, anise extract, lime zest, lemon zest, and ricotta cheese until smooth. Toss the chocolate chips with the flour in a plastic bag to coat. Fold in to the ricotta batter until evenly blended. Place the graham cracker crusts onto baking sheets. Evenly divide the batter among the crusts.\nBake in the preheated oven for 30 minutes, then rotate the cheesecakes 90 degrees, and continue baking until a knife inserted into the center comes out clean, 20 to 30 minutes longer. Cool to room temperature, then refrigerate at least 2 hours until cold before serving.",
    "pt": "25 m",
    "ct": "50 m",
    "tt": "4 h ",
    "i": "382741.jpg",
    "o": "",
    "st": "allrecipes"
}