{
    "id": 214069,
    "old_rating": "4.28333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 tablespoon red wine vinegar",
        "1 tablespoon prepared yellow mustard",
        "1 tablespoon spicy mustard",
        "1 tablespoon coarse-grained mustard",
        "1 tablespoon honey",
        "1 tablespoon vegetable oil",
        "4 skinless, boneless chicken breast halves",
        "4 cups salted pretzels",
        "1/2 cup mayonnaise",
        "2 tablespoons prepared yellow mustard",
        "3 tablespoons honey",
        "1/2 teaspoon salt"
    ],
    "nut": [
        "Calories > 759 kcal",
        "Carbs > 86.7 g",
        "Cholesterol > 78 mg",
        "Fat > 31.8 g",
        "Protein > 33.2 g",
        "Sodium > 2175 mg"
    ],
    "n": "Honey Mustard Chicken with Pretzel Crust",
    "a": "Kathleen",
    "r": "0",
    "s": 4,
    "des": "\"A crunchy and salty crust to dress up chicken!\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C). Line a baking sheet with foil and spray with cooking spray.\nIn a bowl, mix together the red wine vinegar, 1 tablespoon yellow mustard, the spicy mustard, coarse-grained mustard, 1 tablespoon of honey, and the vegetable oil.\nPlace the chicken breasts  between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the chicken with the smooth side of a meat mallet to a thickness of about 1/4 inch. Coat the chicken well with the mustard mixture.\nPlace the pretzels into a resealable plastic zipper bag and roll the bag under a rolling pin to finely grind the pretzels. Place the coated chicken breasts, one at a time, into the bag, seal, and shake the bag to thoroughly coat each chicken breast with pretzel meal. Place the chicken breasts on the prepared baking sheet and spray each breast with cooking spray.\nBake the chicken in the preheated oven until the coating is golden brown and the meat is no longer pink in the center, about 25 minutes. Flip the chicken after about 12 minutes of cooking to brown both sides.\nMix together the mayonnaise, 2 tablespoons of yellow mustard, 3 tablespoons of honey, and salt in a bowl. Drizzle the honey-mustard sauce over the chicken to serve.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "428125.jpg",
    "o": "4485147.jpg,3302416.jpg,3302412.jpg,2362868.jpg,1769161.jpg,1403149.jpg",
    "st": "allrecipes"
}