{
    "id": 214062,
    "old_rating": "4.5614",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups all-purpose flour",
        "3 tablespoons white sugar",
        "1/2 teaspoon salt",
        "1 tablespoon baking powder",
        "1 tablespoon dried rosemary",
        "1 1/2 cups shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese",
        "1 small onion, minced",
        "2 teaspoons crushed garlic",
        "1 egg, beaten",
        "1 cup milk",
        "1/4 cup butter, melted"
    ],
    "nut": [
        "Calories > 185 kcal",
        "Carbs > 21.6 g",
        "Cholesterol > 38 mg",
        "Fat > 7.6 g",
        "Protein > 7.6 g",
        "Sodium > 336 mg"
    ],
    "n": "Fabulous Fargozas",
    "a": "FunwithFood",
    "r": "0",
    "s": 12,
    "des": "\"A moist and tender cheese, garlic, onion and rosemary muffin is quick to make and wonderful served alongside homemade soup, especially potato or Italian-flavored soups. It's a nice change from yeast-type breads or rolls.\"",
    "ins": "Preheat  oven to 425 degrees F (220 degrees C). If using dark-coated muffin pans, preheat  oven to 400 degrees F (200 degrees C). Grease 12 muffin cups.\nIn a large bowl, stir together flour, sugar, salt, baking powder, and rosemary until the mixture is smooth and without lumps. Lightly mix in the mozzarella cheese, Parmesan cheese, onion, and garlic. In another bowl, whisk together the egg and melted butter, then whisk into the milk. Make a well in the center of the dry ingredients, and pour the milk mixture into the well. Stir just to moisten, 12 to 15 full circular strokes that scrape the bottom of the bowl. The batter will look lumpy. Pour batter into the prepared muffin cups, filling them about 2/3 full.\nBake the muffins in the preheated oven until browned, about 25 minutes. Cool in pan for about 5 minutes before removing from the cups.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "967062.jpg",
    "o": "802052.jpg,598942.jpg,484833.jpg,467719.jpg,395580.jpg,395579.jpg",
    "st": "allrecipes"
}