{
    "id": 214006,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (5 pound) leg of lamb",
        "1/4 cup clover honey",
        "salt and black pepper to taste",
        "1 sprig fresh rosemary",
        "1 cup hard apple cider",
        "2 tablespoons honey"
    ],
    "nut": [
        "Calories > 487 kcal",
        "Carbs > 20 g",
        "Cholesterol > 152 mg",
        "Fat > 23.8 g",
        "Protein > 43.4 g",
        "Sodium > 115 mg"
    ],
    "n": "Honeyed Lamb with Cider Gravy",
    "a": "Christianne",
    "r": "0",
    "s": 6,
    "des": "\"This is a family recipe I got from a friend of mine. It's a fairly easy recipe and has a simple but delicious taste. Tastes great with roasted red potatoes.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a roasting pan with aluminum foil, letting enough foil hang from each side of the pan to create a foil tent that won't touch the meat.\nPlace leg of lamb into the foil-lined roasting pan. Warm up 1/4 cup of honey in a small saucepan over low heat, and brush the honey all over the lamb. Sprinkle with salt and black pepper to taste, and place the rosemary sprig onto the lamb. Pull the ends of the aluminum foil together over the lamb, and pinch the ends together to make a foil tent.\nRoast lamb in the preheated oven for 15 minutes, then reduce heat to 350 degrees F (175 degrees C) and continue roasting for about 1 hour.\nOpen up the foil and roast an additional 20 minutes to crisp the outside of the meat. For medium-rare, roast until a meat thermometer inserted into the thickest part reads 140 degrees F (60 degrees C.) Remove the lamb from the oven, and place on a warmed platter to rest about 15 minutes before slicing. Pour the drippings from the roasting pan into a saucepan, and wrap the lamb loosely in the foil to rest.\nPour hard cider and 2 tablespoons of honey into the saucepan with the lamb drippings, and boil over medium heat, stirring frequently, until the sauce reduces by about half, about 10 minutes. Slice the lamb and spoon sauce over the slices to serve.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}