{
    "id": 214076,
    "old_rating": "4.41667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 slices bacon",
        "1 tablespoon butter",
        "2 cloves garlic, minced",
        "1/2 red onion, thinly sliced",
        "3 cups fresh spinach leaves",
        "1/2 cup reduced-fat mayonnaise",
        "2 chipotle peppers in adobo sauce, minced",
        "1 teaspoon adobo sauce from chipotle peppers",
        "8 (4 inch) pieces focaccia bread",
        "4 slices provolone cheese",
        "1/2 pound sliced deli turkey meat"
    ],
    "nut": [
        "Calories > 699 kcal",
        "Carbs > 65.1 g",
        "Cholesterol > 81 mg",
        "Fat > 33.2 g",
        "Protein > 34.5 g",
        "Sodium > 2276 mg"
    ],
    "n": "Turkey and Bacon Panini with Chipotle Mayonnaise",
    "a": "chefmommy",
    "r": "0",
    "s": 4,
    "des": "\"This is one of my favorite sandwiches to make, I whipped it up one day when I was trying to use up leftover ingredients. My family raved! It's also excellent as a vegetarian sandwich if you leave out the turkey and bacon.\"",
    "ins": "Preheat a panini press according to manufacturer's instructions.\nPlace the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Meanwhile, melt the butter in a large skillet over medium heat. Cook and stir the garlic and onion until the onion has softened and turned translucent, about 10 minutes. Stir in the spinach and cook until wilted, about 3 minutes more.\nWhile the onions and spinach are cooking, stir together the mayonnaise, minced chipotle peppers, and adobo sauce in a small bowl. Spread the mayonnaise over 4 slices of focaccia bread. Place a slice of cheese onto the 4 slices, then divide the turkey among the sandwiches. Place 2 strips of bacon onto each sandwich and top with the spinach mixture. Place the remaining slices of bread onto the sandwiches.\nCook the sandwiches in the preheated panini grill according to manufacturer's directions until crispy and golden brown, about 5 minutes.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "651270.jpg",
    "o": "",
    "st": "allrecipes"
}