{
    "id": 214168,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup dry cannellini beans",
        "2 lamb shanks",
        "1/4 teaspoon freshly ground black pepper",
        "2 tablespoons all-purpose flour",
        "2 tablespoons olive oil",
        "2 large shallots, chopped",
        "2 carrots, chopped",
        "2 celery ribs, chopped",
        "6 cloves garlic, thinly sliced",
        "2 teaspoons chopped fresh rosemary",
        "1 cup dry red wine",
        "2 cups low-sodium beef broth",
        "1 cup water",
        "1 tablespoon tomato paste",
        "1/2 teaspoon salt",
        "2 teaspoons lemon zest",
        "1/4 cup chopped Italian flat leaf parsley, divided"
    ],
    "nut": [
        "Calories > 474 kcal",
        "Carbs > 51.2 g",
        "Cholesterol > 41 mg",
        "Fat > 12 g",
        "Protein > 30.8 g",
        "Sodium > 557 mg"
    ],
    "n": "Pressure Cooker Lamb Shanks with White Beans",
    "a": "Always Cooking Up Something",
    "r": "0",
    "s": 4,
    "des": "\"This hearty lamb and white bean dish is Italian-influenced comfort food. It's cooked in a pressure cooker but tastes like it was braised for hours!\"",
    "ins": "Soak cannellini beans in a large bowl of cold water for at least 4 hours, up to overnight. Drain.\nPat lamb shanks dry; season with ground black pepper and dust with flour. Heat oil in pressure cooker over medium-high heat. Cook lamb shanks one at a time, turning to brown on all sides, about 10 minutes per shank.  Transfer to a plate and set aside.\nCook and stir shallots, carrots, celery, and garlic in the oil left in pressure cooker until shallots are golden brown, about 15 minutes. Add rosemary and red wine; cook for 2 minutes, scraping up any browned bits from the bottom of the pan. Add drained beans, beef broth, and water; season to taste with more black pepper. Return the lamb shanks to the pot.\nSeal the pressure cooker lid; bring cooker to full pressure according to manufacturer's instructions. Cook for 35 minutes. Turn off heat and allow the pressure to lower naturally, about 10 minutes.\nRemove lid; stir in tomato paste, salt, lemon zest, and half of the chopped parsley.\nSpoon bean and vegetable mixture into large shallow bowls; top with lamb shank meat and sauce. Sprinkle servings with remaining parsley.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "5 h ",
    "i": "3468455.jpg",
    "o": "",
    "st": "allrecipes"
}