{
    "id": 214186,
    "old_rating": "2.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1/2 cup dry bread crumbs",
        "1 tablespoon salt (optional)",
        "2 tablespoons lemon pepper",
        "2 tablespoons seasoned salt",
        "2 tablespoons paprika",
        "2 beaten eggs",
        "2 cups milk",
        "5 pounds chicken drumsticks and thigh pieces",
        "1 1/2 cups vegetable oil for frying"
    ],
    "nut": [
        "Calories > 862 kcal",
        "Carbs > 57.4 g",
        "Cholesterol > 254 mg",
        "Fat > 43.7 g",
        "Protein > 56.5 g",
        "Sodium > 2891 mg"
    ],
    "n": "City Fried Chicken",
    "a": "getsome",
    "r": "0",
    "s": 7,
    "des": "\"Something I put together and it works out very nice. Family and friends love this tasty meal, so I thought I would share it. I have a large family (5 boys), so I cook large meals!\"",
    "ins": "Place the flour, bread crumbs, salt, lemon pepper, seasoned salt, and paprika into a large resealable plastic zipper bag, and stir the mixture to thoroughly combine.\nWhisk the eggs and milk together in a large shallow bowl. Rinse off the chicken pieces, and place 2 or 3 pieces at a time into the plastic bag. Seal the bag, shake several times to thoroughly coat the chicken with seasoned flour mixture, and dip into the egg mixture. Place the chicken pieces back into the flour, shake to coat, and dip; repeat one more time, giving each chicken piece 2 dips in egg mixture and 3 coatings of seasoned flour.\nHeat oil in a large skillet with deep sides until the oil shimmers; gently add the chicken in batches, either all drumsticks or all thighs. Cover the skillet, and fry until the juices run clear and the coating is beginning to brown, 10 to 15 minutes; uncover and cook the chicken until the coating is golden brown, another 5 to 10 minutes.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "3934514.jpg",
    "o": "",
    "st": "allrecipes"
}