{
    "id": 214113,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup white sugar",
        "1/2 cup cranberry juice",
        "1/4 cup water",
        "3 cups coarsely chopped rhubarb",
        "2 1/2 cups dry biscuit mix",
        "2 tablespoons brown sugar",
        "1/2 teaspoon ground nutmeg",
        "1/4 teaspoon ground cinnamon",
        "1 tablespoon vegetable oil",
        "1/2 cup milk",
        "3 tablespoons softened butter",
        "2 cups finely chopped rhubarb",
        "1/4 cup brown sugar",
        "2 tablespoons white sugar",
        "2 tablespoons white sugar"
    ],
    "nut": [
        "Calories > 347 kcal",
        "Carbs > 61 g",
        "Cholesterol > 11 mg",
        "Fat > 10.9 g",
        "Protein > 3.5 g",
        "Sodium > 458 mg"
    ],
    "n": "Rhubarb Cranberry Roll Ups",
    "a": "jowolf2",
    "r": "0",
    "s": 9,
    "des": "\"Quick and easy recipe that looks like it took a lot more effort. Very pretty colouring and excellent balance of tartness and sweetness. Serve warm with ice cream or whipped cream.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Generously grease a 9x9-inch baking dish.\nBring 1 cup of sugar with the cranberry juice and water to a boil in a saucepan and let boil for 1 minute, stirring constantly. Remove the cranberry juice mixture from the heat and set aside.\nSprinkle 3 cups of coarsely-chopped rhubarb into the bottom of the prepared dish.\nMix the biscuit mix, 2 tablespoons of brown sugar, the nutmeg, and cinnamon together in a bow; stir in vegetable oil and milk to make a soft dough. Roll the dough out on a floured surface into a square about 10 inches on each side; spread butter over the dough. Sprinkle 2 cups of finely chopped rhubarb over the butter; sprinkle the rhubarb with 1/4 cup of brown sugar and 2 tablespoons of white sugar. Roll the dough up jellyroll style, gently press the seam down, and cut the roll into 9 slices. Arrange the slices over the rhubarb in the baking dish. Pour the reserved cranberry syrup over the slices; sprinkle with the last 2 tablespoons of sugar.\nBake in the preheated oven until the biscuit topping is golden brown and the rhubarb is bubbling, 25 to 30 minutes.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "394854.jpg",
    "o": "",
    "st": "allrecipes"
}