{
    "id": 214120,
    "old_rating": "3.95",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup olive oil, for frying",
        "2 large eggplants, halved lengthwise",
        "1 pinch salt and ground black pepper to taste",
        "1/4 cup fresh basil leaves",
        "3 cloves garlic, minced",
        "2 tablespoons pine nuts",
        "2 tablespoons freshly grated Parmesan cheese",
        "3 tablespoons extra-virgin olive oil, for pesto"
    ],
    "nut": [
        "Calories > 663 kcal",
        "Carbs > 41.9 g",
        "Cholesterol > 4 mg",
        "Fat > 54.4 g",
        "Protein > 11.3 g",
        "Sodium > 92 mg"
    ],
    "n": "Eggplants With Pesto",
    "a": "Sonya Jane",
    "r": "0",
    "s": 2,
    "des": "\"I had a super dish once at a famous and trendy London restaurant back in the 80's - this is my interpretation. Serve with greens like spinach or a simple salad; arugula is stunning with this. This is enough for 2 as a main, although I have made 4 starters out of it before now. Any of the pesto left in the blender can be refrigerated for a couple of days and used as required.\"",
    "ins": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nHeat 1/2 cup olive oil in a skillet over medium heat. While heating the oil, cut slits in a crisscross pattern in the 'meat' of the eggplant halves, being careful not to pierce the skin. This will allow the heat and oil to penetrate better. Lightly season the eggplant with salt and pepper; gently lay the eggplant halves into the hot oil, skin sides facing up, and fry until golden brown, about 10 minutes. Flip the eggplant halves and cook another 2 to 3 minutes. Remove and allow to drain on a plate lined with paper towels.\nMake the pesto by blending the basil, garlic, pine nuts, Parmesan cheese, and about half of the extra-virgin olive oil in a blender on Low until smooth; slowly stream the remaining extra-virgin olive oil into the mixture as it blends.\nArrange the eggplant halves in a broiler pan with the skin sides down. Slather the pesto over the surface of the eggplant.\nCook the eggplants under the broiler until the pesto begins to bubble, 7 to 10 minutes.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "3361940.jpg",
    "o": "",
    "st": "allrecipes"
}