{
    "id": 214226,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 pounds chicken bones",
        "cold water, to cover",
        "1 cup sliced celery (1-inch pieces)",
        "1 cup sliced carrot (1/2-inch pieces)",
        "1 (8 ounce) onion, quartered",
        "6 parsley stems",
        "2 sprigs fresh thyme",
        "1 bay leaf",
        "10 whole black peppercorns",
        "1 clove garlic (optional)",
        "cheesecloth",
        "kitchen twine",
        "salt to taste"
    ],
    "nut": [
        "Calories > 24 kcal",
        "Carbs > 5.2 g",
        "Cholesterol > 0 mg",
        "Fat > 0.2 g",
        "Protein > 0.9 g",
        "Sodium > 38 mg"
    ],
    "n": "Real Chicken Stock",
    "a": "flyinmetal",
    "r": "0",
    "s": 10,
    "des": "\"Real chicken stock is made over a period of 3 to 4 hours to develop the flavor, so here it goes. You can buy chicken bones from your local butcher (mine charges a mere 49 cents a pound) or you can buy whole chickens and cut them up yourself, freeze the edible parts, and use the carcasses for the stock.\"",
    "ins": "Place the chicken bones in the bottom of a large stock pot and fill with enough cold water to cover the bones by about 2 inches. Bring the water to a gentle simmer over medium-low heat. The bubbles should just barely break the surface. After the stock has simmered for about 30 minutes, skim off any foam that forms on the surface or the edges of the pot and discard. Continue simmering another 90 minutes.\nAdd the celery, carrots, and onion to the stock pot. As the stock simmers, continue to skim off any foam. After 1 hour and 15 more minutes, wrap the parsley stems, thyme, bay leaf, peppercorns, and garlic in a small piece of cheesecloth and tie into a tidy package with kitchen twine. Add the seasoning bundle to the stock. Simmer for 45 more minutes (4 total hours simmering time); remove the seasoning bundle. Strain the stock through a fine mesh strainer lined with cheesecloth. Season to taste with salt.",
    "pt": "15 m",
    "ct": "4 h",
    "tt": "4 h ",
    "i": "2843265.jpg",
    "o": "",
    "st": "allrecipes"
}