{
    "id": 214382,
    "old_rating": "4.11111",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 (5 ounce) skinless, boneless chicken breast halves",
        "1/4 cup hot pepper sauce (such as Frank's RedHotÂ®)",
        "6 sheets phyllo dough",
        "1 tablespoon olive oil",
        "salt and pepper to taste",
        "1/2 cup hot pepper sauce (such as Frank's RedHotÂ®)",
        "2 tablespoons distilled white vinegar",
        "1/2 cup light garlic-flavored cream cheese",
        "1 tablespoon olive oil"
    ],
    "nut": [
        "Calories > 579 kcal",
        "Carbs > 37.6 g",
        "Cholesterol > 111 mg",
        "Fat > 29.9 g",
        "Protein > 40 g",
        "Sodium > 2934 mg"
    ],
    "n": "Buffalo Chicken Phyllo Wraps",
    "a": "Raquel Teixeira",
    "r": "0",
    "s": 2,
    "des": "\"These can be made as an appetizer or main meal. They feel like the comfort food of chicken wings minus the extra fat! They are so delicious and best served with blue cheese dipping sauce.\"",
    "ins": "Combine chicken and 1/4 cup hot sauce in a shallow dish; marinate in the refrigerator for 1 hour. Grease a 9x13- inch baking dish.\nPreheat oven to 350 degrees F (175 degrees C). Place phyllo sheets on work surface; cover with damp towel to keep from drying out.\nHeat 1 tablespoon olive oil in a small skillet over medium heat.  Remove chicken from hot sauce; season with salt and pepper. Cook the chicken in the oil until the juices run clear, 3 to 5 minutes per side. Remove from heat; shred.  Combine the shredded chicken, remaining 1/2 cup hot sauce, vinegar, and cream cheese in a large bowl. Stir until creamy. Allow mixture to cool, about 5 minutes.\nRemove 1 phyllo sheet from stack; fold in half lengthwise.  Brush lightly with oil.  Place 2 heaping tablespoons of the chicken mixture at the bottom of the folded phyllo, about 1 inch from the bottom.  Fold bottom of phyllo over filling, fold in each side, roll wrap to the end of the phyllo sheet. Repeat with remaining phyllo sheets and chicken mixture.\nPlace phyllo rolls in prepared baking dish. Bake in preheated oven until phyllo is brown and flaky, 20 to 25 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "688780.jpg",
    "o": "",
    "st": "allrecipes"
}