{
    "id": 21447,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup low-fat cottage cheese",
        "2 tablespoons skim milk",
        "3 tablespoons fresh lemon juice",
        "1 teaspoon minced fresh parsley",
        "1 teaspoon dried basil leaves, crushed",
        "1 teaspoon dried thyme, crushed",
        "4 (4 ounce) swordfish steaks",
        "1 cup water",
        "1 bay leaf",
        "1 pound fresh steamed asparagus tips"
    ],
    "nut": [
        "Calories > 191 kcal",
        "Carbs > 7.2 g",
        "Cholesterol > 46 mg",
        "Fat > 5.2 g",
        "Protein > 29 g",
        "Sodium > 222 mg"
    ],
    "n": "Lemon Thyme Swordfish with Asparagus",
    "a": "dakota kelly",
    "r": "0",
    "s": 4,
    "des": "\"The creamy lemon and thyme sauce accents the flavor of the swordfish.  If desired, garnish with lemon slices and sprigs of thyme.\"",
    "ins": "In a blender or food processor, process the cottage cheese until creamy. Transfer the cottage cheese to a small bowl, and stir in the milk, 1 1/2 teaspoons of the lemon juice, parsley, basil, and 1/2 teaspoon of the dried thyme.  Cover and chill in the refrigerator.\nPreheat oven to 350 degrees F (175 degrees C).\nPlace the fish in an 8x8 inch baking dish. Pour the water and the remaining lemon juice into the dish. Place the bay leaf in the water, and sprinkle the remaining 1/2 teaspoon of dried thyme over the fish. Cover the dish with foil.\nBake in a preheated oven for 20 minutes or until the fish flakes easily when tested with a fork and is opaque all the way through.\nMeanwhile, place asparagus in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 2 to 6 minutes. Drain.\nWhen fish is done, transfer to a serving platter and arrange the asparagus next to the fish. Serve with the cottage cheese sauce.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "14627.jpg",
    "o": "",
    "st": "allrecipes"
}