{
    "id": 214449,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "2 cups all-purpose flour",
        "1 cup chilled margarine, cut into cubes",
        "1/2 cup cold water",
        "Filling:",
        "1/2 pound almond paste",
        "1/2 cup white sugar",
        "1 egg",
        "1 egg, separated",
        "2 teaspoons white sugar, or more to taste"
    ],
    "nut": [
        "Calories > 257 kcal",
        "Carbs > 25.6 g",
        "Cholesterol > 23 mg",
        "Fat > 15.9 g",
        "Protein > 3.8 g",
        "Sodium > 142 mg"
    ],
    "n": "Bonquet",
    "a": "mindygreengenes",
    "r": "0",
    "s": 16,
    "des": "\"Can also be spelled 'bonket' or 'banket.' An old Dutch recipe that my Great Grandma shared with me. A very flaky crust, like phyllo dough, and an almond paste center.\"",
    "ins": "Place flour in a large bowl. Cut in margarine with 2 forks or a pastry blender until the mixture resembles coarse crumbs. Add water, 1 tablespoon at a time, tossing with a fork, until flour mixture is moistened and sticks together when squeezed. Split dough into 3 portions, sealing each in plastic wrap.\nShred almond paste into a bowl using a grater. Add 1/2 cup sugar, egg, and egg yolk; mix well. Cover almond filling with plastic wrap. Refrigerate dough and almond filling, 8 hours to overnight.\nPreheat oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper.\nRoll each portion of dough onto a floured work surface into a 4x12-inch crust. Lay crusts on the prepared sheet. Spread a strip of almond filling onto the center of each crust. Fold each side toward the center and pinch ends to seal in the filling. Flip bonquets over, folded side-down.\nPoke holes down the middle of each bonquet, 2 inches apart. Beat egg white in a small bowl; brush over bonquets. Sprinkle 2 teaspoons sugar on top.\nBake in the preheated oven until golden, about 15 minutes. Reduce oven temperature to 350 degrees F (175 degrees C); continue baking until golden brown, about 10 minutes more.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "8 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}