{
    "id": 214450,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "5 1/3 cups powdered non-fat milk",
        "15 1/4 cups cold water, divided",
        "1 pint heavy whipping cream",
        "1 1/2 teaspoons citric acid powder",
        "rennet",
        "flaked sea salt to taste",
        "2 drops liquid smoke, or more to taste"
    ],
    "nut": [
        "Calories > 994 kcal",
        "Carbs > 87.2 g",
        "Cholesterol > 195 mg",
        "Fat > 45.8 g",
        "Protein > 60.3 g",
        "Sodium > 1008 mg"
    ],
    "n": "Homemade Smoked Mozzarella Cheese",
    "a": "AliciaVR6",
    "r": "0",
    "s": 4,
    "des": "\"Turn a gallon of milk into fresh milky mozzarella to impress your guests. This is very easy to to do, but you must be very precise. You can find citric acid and rennet at your local health or organic food store or order online. You also need a food thermometer to read temperatures from 75 to 110 degrees F (24 to 43 degrees C).\"",
    "ins": "Reconstitute powdered milk by stirring into 15 cups cold water; stir until dissolved.\nCombine reconstituted milk, heavy cream, and citric acid in a large pot over low heat. Heat to 90 degrees F (32 degrees C), about 15 minutes.\nDilute 1/4 teaspoon rennet in remaining 1/4 cup water. Pour into the pot and stir, about 45 seconds. Continue to heat mixture until it reaches 100 degrees F (38 degrees C), about 10 minutes. Remove from heat.\nLet mixture stand until temperature climbs to 105 degrees F (41 degrees C), about 3 minutes, and sets into curd. Pull edge of the curd gently with a thin knife or spoon to check to make sure it is set.\nSlice vertically into the pot to cut curd into 1-inch squares. Transfer curd to a microwave-safe bowl using a hand-held strainer or slotted spoon, draining out as much liquid (whey) as possible.\nHeat the curd in the microwave on high for 1 minute. Drain off whey. Stretch curd mixture and fold, repeating until it cools and becomes difficult to stretch.\nReheat in the microwave for 30 seconds. Drain whey. Stretch and fold the curds repeatedly.\nRepeat this process one more time, kneading salt and liquid smoke into the cheese. Shape into a ball and place in a bowl of cold water. Cover with plastic wrap and chill until firm.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}