{
    "id": 214488,
    "old_rating": "4.43002",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 large skinless, boneless chicken breast halves - cut into 1/2-inch medallions",
        "salt and pepper to taste",
        "1/2 cup all-purpose flour",
        "2 tablespoons vegetable oil, or as needed",
        "1 clove garlic, minced",
        "1 cup low sodium chicken broth",
        "1/2 lemon, thinly sliced",
        "1/4 cup fresh lemon juice",
        "2 tablespoons capers, drained and rinsed",
        "3 tablespoons butter",
        "2 tablespoons minced Italian (flat-leaf) parsley"
    ],
    "nut": [
        "Calories > 421 kcal",
        "Carbs > 16.1 g",
        "Cholesterol > 128 mg",
        "Fat > 21.2 g",
        "Protein > 41.1 g",
        "Sodium > 348 mg"
    ],
    "n": "Lemon Chicken Piccata",
    "a": "LemonLush",
    "r": "0",
    "s": 4,
    "des": "\"This delicious chicken dish is exquisite and easy to prepare. The light and luscious lemon sauce really pops without being too acidic; it is simply divine. Serve it with herb-roasted potatoes or lemon-rice pilaf.\"",
    "ins": "Preheat oven to 200 degrees F (95 degrees C). Place a serving platter into the oven to warm.\nSeason the chicken breast pieces with salt and pepper and dredge them in flour. Shake off excess flour. Heat the vegetable oil in a skillet; pan-fry the chicken pieces until golden brown on both sides, about 3 minutes per side. Work in batches and do not crowd skillet, adding oil as needed . Place the chicken pieces onto the warmed platter in the oven. When finished with all the chicken, drain most of the oil from the skillet, leaving a thin coating on the surface of the pan.\nCook and stir the minced garlic in the skillet until fragrant, about 20 seconds. Pour in the chicken broth. Scrape and dissolve any brown bits from the bottom of the skillet. Stir in the lemon slices and bring the mixture to a boil. Let cook, stirring occasionally, until the sauce reduces to about 2/3 cup, 5 to 8 minutes. Add the lemon juice and capers; simmer until the sauce is reduced and slightly thickened, about 5 minutes more. Drop the butter into the skillet and swirl it into the sauce by tilting the skillet until the butter is melted and incorporated. Add the parsley; remove from heat and set aside.\nArrange the chicken medallions on serving plates and spoon sauce over each portion to serve.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "4540867.jpg",
    "o": "4540867.jpg,4540864.jpg,4538032.jpg,4531113.jpg,4529653.jpg,4529426.jpg",
    "st": "allrecipes"
}