{
    "id": 214480,
    "old_rating": "4.65957",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (5 pound) boneless pork loin roast",
        "1 tablespoon curry powder",
        "1 tablespoon ground turmeric",
        "1 tablespoon garam masala",
        "2 teaspoons ground ginger",
        "2 teaspoons chili powder",
        "1 teaspoon ground cumin",
        "1 pinch ground cayenne pepper",
        "salt and ground black pepper to taste",
        "2 tablespoons olive oil",
        "2 tablespoons butter",
        "3 cloves garlic, roughly chopped",
        "1 onion, roughly chopped",
        "2 tablespoons fig compote",
        "1 (14.5 ounce) can whole peeled tomatoes",
        "1 cup chicken broth"
    ],
    "nut": [
        "Calories > 487 kcal",
        "Carbs > 6.1 g",
        "Cholesterol > 143 mg",
        "Fat > 29.8 g",
        "Protein > 46.9 g",
        "Sodium > 304 mg"
    ],
    "n": "Moroccan Fig Pork Roast",
    "a": "michtrem",
    "r": "0",
    "s": 8,
    "des": "\"A succulent, savory and sweet pork roast, ideally served over a vegetable rice or couscous.  I love using spices as much as possible, so in this experiment I used quite a few which I rubbed onto the pork roast before I seared it.  I think it would be even better if you let the rub sit on the roast for an hour or so in the fridge prior to cooking.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Pat pork roast dry with a clean towel. Mix curry powder, turmeric, garam masala, ground ginger, chili powder, cumin, cayenne, salt, and pepper in a small bowl. Rub spice mixture all over the pork roast.\nHeat the olive oil and butter in a large, heavy bottom pot or Dutch oven over medium-high heat. Place the seasoned pork roast into the pot and cook until evenly browned, about 2 minutes on each side. Remove pork and set aside.  Stir in the garlic and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the fig compote, until well blended. Return pork to the pot, coating it with the fig mixture. Pour in the tomatoes and chicken broth. Cover, and bring to a boil.\nPlace covered pot in the preheated oven. Cook until the pork is no longer pink in the center, about 2 hours. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
    "pt": "10 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "433691.jpg",
    "o": "",
    "st": "allrecipes"
}