{
    "id": 214583,
    "old_rating": "4.54237",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 eggs",
        "2/3 cup milk",
        "1/2 teaspoon salt",
        "2 tablespoons butter",
        "1 pound bulk pork sausage",
        "2 tablespoons minced garlic",
        "1/2 red onion, diced",
        "1 tomato, diced",
        "1/4 cup chopped fresh cilantro",
        "1 (3.5 ounce) can diced jalapenos (optional)",
        "1 (1 ounce) package taco seasoning",
        "1 1/2 cups shredded Cheddar cheese",
        "20 (6 inch) flour tortillas"
    ],
    "nut": [
        "Calories > 296 kcal",
        "Carbs > 19.4 g",
        "Cholesterol > 140 mg",
        "Fat > 18.8 g",
        "Protein > 11.7 g",
        "Sodium > 707 mg"
    ],
    "n": "Southwest Breakfast Burritos",
    "a": "Norm Walker",
    "r": "0",
    "s": 20,
    "des": "\"My wife and I love eating Mexican so I came up with this recipe so that we could have a little more variety in our morning meals.  We are busy people and don't have time to make elaborate meals in the morning. In the past we have bought frozen breakfast burritos, but they are not very tasty and I knew they could be improved upon.  This recipe will make a large batch of the burrito fixins that you can freeze, or store in the refrigerator so that you can make great breakfast burritos whenever you please.\"",
    "ins": "Whisk together the eggs, milk, and salt in a large bowl. Heat butter in a large skillet over medium-high heat. Pour in the egg mixture; cook and stir until eggs are completely set, about 5 minutes. Chop the cooked eggs and place in a large bowl. Set aside.\nHeat a large skillet over medium heat and stir in the sausage and garlic. Cook and stir for 5 minutes, then add the onion. Continue cooking and stirring until the sausage is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Combine the sausage with the eggs, tomato, cilantro, jalapeno, and taco seasoning. Allow mixture to cool to room temperature, then stir in the Cheddar cheese.\nPlace a tortilla onto your work surface, then spoon some of the filling halfway between the bottom edge and the center of the tortilla. Flatten the filling into rectangle shape with the back of a spoon. Fold the bottom of the tortilla snugly over the filling, then fold in the left and right edges.  Roll the burrito up to the top edge, forming a tight cylinder. Repeat with the remaining ingredients.\nTightly wrap individual burritos with plastic wrap and freeze until ready to serve. Heat in the microwave until hot, 3 to 4 minutes, before serving.",
    "pt": "50 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "509153.jpg",
    "o": "",
    "st": "allrecipes"
}