{
    "id": 214552,
    "old_rating": "4.73333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 teaspoons butter",
        "1 1/4 teaspoons olive oil",
        "1/2 pound portobello mushrooms, chopped",
        "1/4 cup chopped onion",
        "1/4 cup chopped carrot",
        "2 tablespoons chopped celery",
        "2 tablespoons white wine",
        "1/2 cup beef broth",
        "1 1/4 teaspoons tomato paste",
        "1 teaspoon butter",
        "2 ounces enoki mushrooms",
        "3 1/2 tablespoons heavy cream",
        "1 pinch ground nutmeg",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 80 kcal",
        "Carbs > 4.5 g",
        "Cholesterol > 16 mg",
        "Fat > 6.1 g",
        "Protein > 1.8 g",
        "Sodium > 99 mg"
    ],
    "n": "Mushroom Bolognese",
    "a": "jodyratti",
    "r": "0",
    "s": 6,
    "des": "\"Similar to other Bolognese recipes, but this one replaces meat with Portobellos and Enoki mushrooms.\"",
    "ins": "Melt 1 1/2 teaspoon of butter with olive oil in a large skillet over medium heat. Cook and stir the portobello mushrooms, onion, carrot, and celery until the vegetables are softened and beginning to brown, about 8 minutes. Transfer the mushroom mixture to a large saucepan.\nPour the white wine into the skillet and bring to a boil, dissolving any browned flavor bits from the bottom of the skillet. Allow the wine to cook for about 2 minutes, until reduced, and pour into the saucepan. Stir the beef broth and tomato paste into the mixture in the saucepan, bring to a boil over medium-high heat, then reduce heat to low. Simmer, partially covered, until the beef broth has reduced and the vegetables are very tender, about 35 minutes.\nMelt 1 teaspoon of butter in the original skillet, and cook and stir the enoki mushrooms until lightly browned, 3 to 4 minutes. Remove the enoki, and chop. Stir the chopped enoki mushrooms into the sauce and simmer for about 10 minutes; stir in the heavy cream, and allow to heat through (do not boil). Season with nutmeg, salt, and pepper to taste.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "3785064.jpg",
    "o": "",
    "st": "allrecipes"
}