{
    "id": 214500,
    "old_rating": "4.60922",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons olive oil",
        "2 pounds Italian sausage links, cut into 2-inch pieces",
        "1/4 cup olive oil",
        "4 large potatoes, peeled and thickly sliced",
        "2 large green bell peppers, seeded and cut into wedges",
        "2 large red bell peppers, seeded and cut into wedges",
        "3 large onions, cut into wedges",
        "1/2 cup white wine",
        "1/2 cup chicken stock",
        "1 teaspoon Italian seasoning",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 539 kcal",
        "Carbs > 45.8 g",
        "Cholesterol > 45 mg",
        "Fat > 29.8 g",
        "Protein > 20.2 g",
        "Sodium > 1041 mg"
    ],
    "n": "Sausage, Peppers, Onions, and Potato Bake",
    "a": "Beccabo73",
    "r": "0",
    "s": 8,
    "des": "\"This is an Italian comfort food classic!  The smell of this cooking in my kitchen transports me back to playing on the street in front of my Papa and Gigi's house in Brooklyn.  I make 2 trays of this for every family get-together, and it's gone in a flash!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nHeat 2 teaspoons olive oil in a large skillet over medium heat, and cook and stir the sausage until browned. Transfer the cooked sausage to a large baking dish. Pour 1/4 cup of olive oil into the skillet, and cook the potatoes, stirring occasionally, until browned, about 10 minutes. Place the potatoes into the baking dish, leaving some oil. Cook and stir the green and red peppers and onions in the hot skillet until they are beginning to soften, about 5 minutes. Add the vegetables to the baking dish. Pour wine and chicken stock over the vegetables and sausage, and sprinkle with Italian seasoning, salt, and pepper. Gently stir the sausage, potatoes, and vegetables together.\nBake in the preheated oven until hot and bubbling, 20 to 25 minutes. Serve hot.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4538146.jpg",
    "o": "4538146.jpg,4534733.jpg,4528064.jpg,4525418.jpg,4523985.jpg,4513744.jpg",
    "st": "allrecipes"
}