{
    "id": 214554,
    "old_rating": "4.43902",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup warm water",
        "2 tablespoons canola oil",
        "3 cups bread flour",
        "1 tablespoon white sugar",
        "3/4 teaspoon salt",
        "1 teaspoon vital wheat gluten",
        "2 1/4 teaspoons active dry yeast"
    ],
    "nut": [
        "Calories > 151 kcal",
        "Carbs > 26.2 g",
        "Cholesterol > 0 mg",
        "Fat > 2.9 g",
        "Protein > 4.5 g",
        "Sodium > 147 mg"
    ],
    "n": "Soft-N-Fluffy Hamburger Buns",
    "a": "What's for dinner, mom?",
    "r": "0",
    "s": 12,
    "des": "\"Soft and light with a moist crumb.  Simple and perfect every time.  You can vary the size to accommodate larger burgers or make little sliders - make hot dog buns too!  I worked on this recipe until I got it perfect! I hope you enjoy it too!\"",
    "ins": "Place the water, canola oil, flour, sugar, salt, vital wheat gluten, and yeast into the pan of a bread machine in the order recommended by the manufacturer, select the Dough cycle, and turn on the machine. Line baking sheets with parchment paper.\nWhen the cycle is finished, remove the dough to a lightly oiled work surface, and knead for 2 to 3 minutes. Cut the dough into 12 equal-size pieces, and roll the dough into balls by cupping your hand, with open fingers, over each piece of dough. Roll gently, with just a little pressure, to form a dough ball with a silky surface. Place the dough balls onto the parchment-lined baking sheets, and flatten each dough ball gently into a bun. Cover with a cloth and let rise until doubled, 30 to 45 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBake the rolls in the preheated oven until the tops are golden brown, about 12 minutes. Let cool on racks before slicing.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "3 h ",
    "i": "4484744.jpg",
    "o": "4238884.jpg,1598605.jpg,1598604.jpg,1217856.jpg,1117653.jpg,1098755.jpg",
    "st": "allrecipes"
}