{
    "id": 214569,
    "old_rating": "4.53846",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "7 chicken drumsticks, with skin",
        "6 bone-in chicken breast halves, with skin",
        "1 tablespoon Cajun seasoning blend (such as Tony Chachere'sÂ®), or to taste",
        "1/2 cup olive oil",
        "1/2 cup dry white wine",
        "1/4 cup olive oil",
        "4 cups chicken broth",
        "1 large yellow onion, chopped",
        "1 large green bell pepper, chopped",
        "1 large celery stalk, chopped",
        "3 tablespoons olive oil",
        "1 cup all-purpose flour",
        "1 cup canola oil",
        "10 cups boiling water, divided",
        "2 teaspoons Cajun seasoning (such as Tony Chachere's), or to taste",
        "1 teaspoon garlic powder, or to taste",
        "1 teaspoon cayenne pepper, or to taste",
        "1 1/2 pounds smoked sausage, cut into 1/2-inch slices",
        "2 tablespoons olive oil",
        "2 cups uncooked jasmine rice",
        "3 cups water",
        "1 bunch green onions, chopped"
    ],
    "nut": [
        "Calories > 825 kcal",
        "Carbs > 31.5 g",
        "Cholesterol > 129 mg",
        "Fat > 57.5 g",
        "Protein > 41.7 g",
        "Sodium > 1206 mg"
    ],
    "n": "Dupre Family Chicken and Sausage Gumbo",
    "a": "Crawfish",
    "r": "0",
    "s": 15,
    "des": "\"The original, purist, real-deal gumbo from a certified Cajun. Serve over cooked jasmine rice with hot French bread to dip.\"",
    "ins": "Peel back the skin from the chicken drumsticks and breasts without removing the skin, and make several deep cuts in the chicken meat. Sprinkle 1 tablespoon of Cajun seasoning into the cuts and onto the meat, then replace the skin. Whisk 1/2 cup olive oil and white wine together in a bowl. Place the chicken into a large bowl, pour the olive oil mixture over, stir to coat, and refrigerate 1 hour.\nRemove the chicken pieces from the marinade, and discard the marinade. Heat 1/4 cup olive oil in a large skillet until the oil shimmers, and brown the chicken pieces over medium heat, working in batches if necessary, about 5 minutes per side. Place all the chicken pieces into a large soup pot, and pour the broth over the chicken. Bring the mixture to a boil, reduce heat to a simmer, and cook the chicken until tender, about 20 minutes.\nWhile the chicken is simmering, place the onion, green bell pepper, and celery into a skillet with 3 tablespoons of olive oil, and cook and stir until the onions are transparent and the peppers have softened, about 8 minutes. Set the onion mixture aside.\nMake a roux: mix flour and canola oil together in a nonstick pan, stirring the mixture together until smooth and lump-free. Heat over medium-high heat, stirring constantly with a wooden spoon and scraping the bottom of the pan to prevent burning. After about 5 minutes of stirring, the roux will begin to turn a pale golden color, and gently bubble and foam. Stir the roux until it turns the color of milk chocolate and gives off a nutty fragrance, about 30 to 40 more minutes.  Watch carefully because it's easy to burn the roux. Pull the pan from the hot burner, and stir until the roux cools and stops cooking, about 5 more minutes.\nStir the onion mixture and 1 cup of boiling water into the roux (be careful to avoid spattering), heat over medium heat until the mixture comes to a simmer, and whisk until the roux and water combine and become thick, about 10 minutes. Pour the thickened roux into the pot with the chicken, stir together, and add 9 more cups of boiling water. Season the gumbo with 2 more teaspoons of Cajun seasoning, or to taste, and bring the soup to a rolling boil. Reduce heat, and simmer for 1 hour.\nSprinkle garlic powder and cayenne pepper over the smoked sausage, and brown in a skillet with 2 tablespoons of olive oil. Transfer the sausage into the soup, and simmer for 30 more minutes. Remove the chicken pieces, and take the chicken meat off the bones, discarding the skin and bones. Return the chicken meat to the soup. Simmer 15 more minutes, and skim off the layer of oil that has formed on top of the gumbo.\nWhile the gumbo is simmering, bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes.\nServe gumbo over hot, cooked rice with a generous sprinkling of chopped green onions over each serving.",
    "pt": "45 m",
    "ct": "2 h ",
    "tt": "4 h ",
    "i": "3511038.jpg",
    "o": "",
    "st": "allrecipes"
}