{
    "id": 214553,
    "old_rating": "4.65263",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 skinless, boneless chicken breast halves",
        "1/4 cup soy sauce",
        "3 slices thick cut bacon",
        "2 large hamburger buns, split",
        "1 tablespoon softened butter",
        "1/4 cup teriyaki sauce",
        "2 slices Swiss cheese",
        "2 tablespoons mayonnaise",
        "2 slices pineapple",
        "2 slices tomato",
        "2 slices of iceberg lettuce"
    ],
    "nut": [
        "Calories > 668 kcal",
        "Carbs > 40.7 g",
        "Cholesterol > 129 mg",
        "Fat > 35.4 g",
        "Protein > 45.8 g",
        "Sodium > 3972 mg"
    ],
    "n": "Aloha Chicken Burgers",
    "a": "Chris McDaniel",
    "r": "0",
    "s": 2,
    "des": "\"This tasty sandwich is like a luau on a bun!\"",
    "ins": "Place chicken breasts into a plastic zipper bag with soy sauce, seal the bag, and marinate in refrigerator for 30 minutes. While chicken is marinating, place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate, and set aside. Spread cut sides of hamburger buns with butter.\nPreheat an outdoor grill for medium heat, and lightly oil the grate.\nRemove the chicken from the soy sauce, and discard the excess soy sauce. Place the chicken breasts onto the preheated grill, and grill until chicken shows good grill marks, is no longer pink inside, and the juices run clear, 4 to 5 minutes per side. When chicken is almost done, brush each piece generously on both sides with teriyaki sauce to finish grilling.  Place a slice of Swiss cheese on each chicken breast, and cover with a lid to help the cheese melt onto the chicken.\nWhile chicken is grilling, spread the buns open on the grill and cook until toasted and showing grill lines, about 2 minutes. Set the buns aside.\nTo assemble, spread the grilled sides of each bun with mayonnaise, and top each bottom bun with a cooked chicken breast, 1 1/2 slices of bacon, a slice of pineapple, a slice from a head of lettuce, a slice of tomato, and the top bun.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "2340003.jpg",
    "o": "4538438.jpg,4536706.jpg,4530804.jpg,4524044.jpg,4518649.jpg,1124707.jpg",
    "st": "allrecipes"
}