{
    "id": 214548,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon butter",
        "1 cup chopped celery",
        "1 cup sliced yellow onion",
        "2 red potatoes, cubed",
        "3 cloves garlic, minced",
        "2 (14 ounce) cans vegetable broth",
        "1 cup water",
        "1/4 cup heavy cream",
        "1/2 teaspoon paprika",
        "1/2 teaspoon cayenne pepper (optional)",
        "1 teaspoon fresh ground black pepper",
        "1/4 teaspoon sea salt",
        "2 tablespoons all-purpose flour",
        "1 pound firm white fish, such as cod or halibut, cut into 2-inch chunks",
        "8 ounces langostino or shrimp"
    ],
    "nut": [
        "Calories > 341 kcal",
        "Carbs > 29.7 g",
        "Cholesterol > 128 mg",
        "Fat > 10.4 g",
        "Protein > 31.6 g",
        "Sodium > 685 mg"
    ],
    "n": "Marci's Noyo Harbor Pan Roast",
    "a": "MARCIL",
    "r": "0",
    "s": 4,
    "des": "\"This summer in Fort Bragg, my husband went on a fishing charter and came back to the campground with a lot of fresh caught Cod.  We came up with this recipe, which was inspired by a pan roast dish we once had in a restaurant.  This dish is very versatile, delicious, and light! Serve with crunchy bread (whole wheat for extra fiber!), lemon wedges, or Tabasco sauce for an extra kick.\n\"",
    "ins": "Heat the butter in a stock pot over medium heat. Stir in the celery, onion, and potato; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the garlic and cook for about 1 minute.\nPour in the vegetable broth and water. Bring to a boil, then reduce heat to medium-low, cover, and simmer until the potatoes are just tender, 10 to 15 minutes.\nCombine heavy cream, paprika, cayenne pepper, black pepper, and sea salt in a small bowl. Pour 1/2 cup of hot broth into the cream mixture; stir. Whisk in the flour.  Stir the cream mixture into the soup and bring to a boil. Add the fish and shellfish, cover and simmer until the fish flakes easily with a fork, about 3 to 4 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "423561.jpg",
    "o": "",
    "st": "allrecipes"
}