{
    "id": 214619,
    "old_rating": "4.55556",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups cherry wood chips",
        "2 (12 fluid ounce) cans beer, half full",
        "1/2 cup dark brown sugar",
        "1/2 cup kosher salt",
        "1/2 cup paprika",
        "1/4 cup ground black pepper",
        "1 teaspoon cayenne pepper",
        "1/4 cup vegetable oil",
        "2 (3 pound) whole chickens"
    ],
    "nut": [
        "Calories > 627 kcal",
        "Carbs > 22.8 g",
        "Cholesterol > 205 mg",
        "Fat > 33.2 g",
        "Protein > 53 g",
        "Sodium > 5855 mg"
    ],
    "n": "BBQ Beer Can Chicken",
    "a": "mark'n'karen",
    "r": "0",
    "s": 8,
    "des": "\"I tried several beer can chicken recipes and changed the ingredients up until I found one the whole family loves!!\"",
    "ins": "Soak wood chips in water for at least 1 hour.\nPreheat an outdoor grill for indirect medium heat, about 350 degrees F (175 degrees C).\nMix together dark brown sugar, kosher salt, paprika, ground black pepper, and cayenne pepper in a small bowl. Place two half full cans of beer on a baking sheet. Spoon 1 teaspoon seasoning mix into each can. Be careful, this will make the beer foam up and out of the can.\nRinse chicken under cold running water. Discard giblets and neck from chicken; drain and pat dry. Rub each chicken with 2 tablespoons vegetable oil. Rub the remaining seasoning mix over the entire chicken, inside and out.  Fit each chicken over a can of beer with the legs on the bottom; keep upright.\nDrain the wood chips and place them with the coals or in an aluminum pan on or under the grill grate as directed by the grill's manual. Place the two chickens, standing on their cans directly on the grill. Close the lid and barbeque the chicken until no longer pink at the bone and the juices run clear, about 1 hour 30 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). Remove the chickens from the grill and discard the beer cans. Cover the chicken with a doubled sheet of aluminum foil, and allow to rest in a warm area for 10 minutes before slicing.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "650631.jpg",
    "o": "4531926.jpg,4458869.jpg,3835837.jpg,3678110.jpg,3579701.jpg,3500159.jpg",
    "st": "allrecipes"
}