{
    "id": 214663,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 skinless, boneless chicken breast halves",
        "1 1/2 tablespoons chopped fresh cilantro",
        "1 tablespoon vegetable oil",
        "4 slices lean bacon, chopped",
        "1 (16 ounce) can refried beans",
        "1 teaspoon taco seasoning mix",
        "1 cup sour cream",
        "3/4 cup shredded Cheddar cheese",
        "1 cup prepared guacamole",
        "1 cup diced tomatoes",
        "1 1/2 tablespoons chopped fresh cilantro",
        "2 tablespoons sliced black olives",
        "2 tablespoons finely sliced green onions",
        "1/4 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 434 kcal",
        "Carbs > 18.2 g",
        "Cholesterol > 78 mg",
        "Fat > 31.3 g",
        "Protein > 21.3 g",
        "Sodium > 602 mg"
    ],
    "n": "Jen's Nine Layer Dip",
    "a": "Jenhere",
    "r": "0",
    "s": 6,
    "des": "\"Can also be made without chicken as an 8-layer dip, or omit bacon, too, for vegetarian. Serve with tortilla chips. A clear 8x8 pan is good for this. \"",
    "ins": "Place the chicken, 1 1/2 tablespoons of cilantro, and vegetable oil in a skillet over medium heat, and pan-fry the chicken breasts until lightly golden brown, no longer pink in the middle, and the juices run clear, about 5 minutes per side. Remove the chicken and set aside. When cooled, cut into cubes.\nPlace the bacon in the same skillet, and cook over medium-high heat, stirring often, until evenly browned, about 10 minutes. Mix the refried beans into the skillet with the bacon, and cook, stirring frequently, until the beans are hot and bubbling, 5 to 10 minutes. Mix the taco seasoning and sour cream together in a bowl.\nTo assemble, spread the hot bean and bacon mixture into the bottom of an 8x8-inch glass dish. Sprinkle the chicken cubes over the bean mixture, then follow with these layers: 3/4 cup of Cheddar cheese, guacamole, sour cream mixture, and sliced tomatoes. Sprinkle the top with 1 1/2 tablespoons of cilantro, black olives, green onions, and 1/4 cup of shredded cheddar cheese.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "1060581.jpg",
    "o": "",
    "st": "allrecipes"
}