{
    "id": 21466,
    "old_rating": "4.38278",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup brown sugar",
        "1/2 cup butter",
        "2 tablespoons light corn syrup",
        "1 cup chopped pecans, divided",
        "12 slices French or Italian-style bread",
        "6 eggs",
        "1 1/2 cups milk",
        "1 teaspoon vanilla extract",
        "1 teaspoon ground nutmeg",
        "1 1/2 teaspoons ground cinnamon",
        "1/4 teaspoon salt",
        "Caramel Sauce",
        "1/2 cup brown sugar",
        "1/4 cup butter",
        "1 tablespoon light corn syrup"
    ],
    "nut": [
        "Calories > 615 kcal",
        "Carbs > 72.5 g",
        "Cholesterol > 189 mg",
        "Fat > 32.5 g",
        "Protein > 12.2 g",
        "Sodium > 527 mg"
    ],
    "n": "Oven-Baked Caramel French Toast",
    "a": "HappyHousewife",
    "r": "0",
    "s": 8,
    "des": "\"This is perfect served with quiche, homemade home fries and fresh coffee!  I make the bread for this recipe using my bread machine!\"",
    "ins": "In a small saucepan, combine 1 cup brown sugar, 1/2 cup butter and 2 tablespoons corn syrup. Cook over medium heat, stirring constantly, until thickened.\nPour sauce into a 9x13 inch baking dish and sprinkle with 1/2 cup pecans. Place 6 slices of bread on top of the sauce, sprinkle with the remaining pecans and cover with the remaining 6 slices of bread.\nCombine eggs, milk, vanilla, nutmeg, cinnamon and salt in a blender. Pour egg mixture evenly over bread slices, cover the baking dish, and refrigerate for 8 hours or overnight.\nThe next morning, preheat oven to 350 degrees F (175 degrees C). Remove the French toast from the refrigerator 30 minutes prior to baking. Bake in preheated oven for 40 to 45 minutes, until lightly brown. Drizzle sauce over the toast right before serving.\nTo make the Caramel Sauce:  In a small saucepan, combine 1/2 cup brown sugar, 1/4 cup butter and 1 tablespoon corn syrup. Cook until thickened, stirring constantly.",
    "pt": "9 h",
    "ct": "40 m",
    "tt": "10 h",
    "i": "326687.jpg",
    "o": "4072541.jpg,3730453.jpg,2271512.jpg,550369.jpg,205205.jpg,70054.jpg",
    "st": "allrecipes"
}