{
    "id": 214635,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups pomegranate seeds",
        "1/2 cup pomegranate juice",
        "1/2 cup orange juice, or as needed",
        "1/2 cup Marsala wine, or as needed",
        "1/4 cup chopped fresh mint",
        "2 tablespoons grated orange zest",
        "12 quail, dressed",
        "salt and freshly ground black pepper to taste",
        "12 slices pancetta (Italian unsmoked cured bacon)",
        "1/4 cup olive oil",
        "1 cup chicken stock",
        "2 oranges, sectioned",
        "1/2 cup pomegranate seeds, for garnish"
    ],
    "nut": [
        "Calories > 341 kcal",
        "Carbs > 7.8 g",
        "Cholesterol > 93 mg",
        "Fat > 21.5 g",
        "Protein > 25.2 g",
        "Sodium > 303 mg"
    ],
    "n": "Quaglie Alla Melagrana (Quail with Pomegranate)",
    "a": "Shay",
    "r": "0",
    "s": 12,
    "des": "\"This is an old Sicilian recipe. The pomegranate seeds add a tartness that is balanced by the sweetness of the orange zest and juice.\"",
    "ins": "Stir together 1 1/2 cups pomegranate seeds, pomegranate juice, orange juice, Marsala, mint, and orange zest in a very large glass or ceramic bowl. Add the quail, and turn to evenly coat. Cover the bowl with plastic wrap, and marinate at room temperature for 2 hours.\nRemove the quail from the marinade, and pat dry with paper towels. Season the quail inside and out with salt and pepper. Strain the marinade, reserving the liquid, and stuff the quail with the pomegranate seeds. Wrap each quail with 1 slice of pancetta.\nPreheat an oven to 400 degrees F (200 degrees C).\nHeat the olive oil in a large skillet over medium-high heat. Cook the quail 4 at a time in the hot oil until golden brown on all sides, 5 to 8 minutes total. Place the quail into a large roasting pan in a single layer; set aside. Pour the chicken stock and reserved liquid marinade into the skillet, and bring to a boil. Cook and stir until the sauce has reduced to half its original volume. Pour the sauce over the quail.\nBake the quail in the preheated oven until no longer pink at the bone and the juices run clear, 10 to 15 minutes.  An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C). Pour the juices from the baking dish back into the skillet; cover the quail with aluminum foil, and keep warm. Taste the juices, and add additional orange juice and Marsala wine if desired. Stir in the orange segments, and bring to a boil over medium-high heat. Cook a few minutes until hot. Pour the sauce and orange segments over the quail, and sprinkle with 1/2 cup of pomegranate seeds to serve.",
    "pt": "40 m",
    "ct": "35 m",
    "tt": "3 h ",
    "i": "4407950.jpg",
    "o": "",
    "st": "allrecipes"
}