{
    "id": 214645,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "5 cups all-purpose flour",
        "3 cups white sugar",
        "4 teaspoons baking powder",
        "1 1/2 teaspoons baking soda",
        "2 teaspoons salt",
        "3 tablespoons dried grated orange peel",
        "3/4 cup orange juice concentrate",
        "1 1/2 cups water",
        "1 tablespoon orange extract",
        "1 1/2 cups butter, softened",
        "2 (12 ounce) packages cranberries, rinsed and stems removed if necessary",
        "3/4 cup finely chopped pecans"
    ],
    "nut": [
        "Calories > 464 kcal",
        "Carbs > 70.7 g",
        "Cholesterol > 41 mg",
        "Fat > 19 g",
        "Protein > 4.6 g",
        "Sodium > 583 mg"
    ],
    "n": "Really Cranberry Orange Yummy Gummy Pudding Cake",
    "a": "Trisha777",
    "r": "0",
    "s": 18,
    "des": "\"If you love cranberries and a dense cake, then this is the recipe for you.  This cake is super moist with a great orange taste and tons of fresh cranberries.  I had to put it away or I wouldn't stop eating it! This is great for a party.  Serve it warm with ice cream!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 10x14-inch baking pan.\nWhisk together the flour, sugar, baking powder, baking soda, salt, and dried orange peel in a bowl. In a separate bowl, whisk together the orange juice concentrate, water, and orange extract. Using a pastry cutter, cut the butter into the flour mixture until well combined, and stir the orange juice mixture in, stirring just enough to thoroughly mix. Gently stir in the cranberries and pecans. Smooth the batter into the prepared baking dish.\nBake in the preheated oven until the top is browned, about 50 minutes. Reduce heat to 325 degrees F (165 degrees C), cover the dish with foil, and bake until a knife inserted into the center of the cake comes out clean, 20 to 30 more minutes.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "3029070.jpg",
    "o": "",
    "st": "allrecipes"
}