{
    "id": 214672,
    "old_rating": "4.2963",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package farfalle (bow tie) pasta",
        "1 cup prepared ranch dressing",
        "6 slices bacon",
        "1/2 cup shredded Parmesan cheese",
        "1 carrot, peeled and diced",
        "1 stalk celery, diced",
        "1 red onion, diced"
    ],
    "nut": [
        "Calories > 584 kcal",
        "Carbs > 62.8 g",
        "Cholesterol > 27 mg",
        "Fat > 28.3 g",
        "Protein > 17.7 g",
        "Sodium > 713 mg"
    ],
    "n": "Ranch, Bacon, and Parmesan Pasta Salad",
    "a": "John Politte",
    "r": "0",
    "s": 6,
    "des": "\"A great side dish for the summer picnic.  I made this on accident when I put some soup ingredients into the bowl instead of the stock pot.  I doctored it up and added other ingredients, and voila! Use your favorite pasta shape.\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the bow tie pasta and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 12 minutes. Drain well in a colander set in the sink. Transfer to a bowl, and refrigerate until cool, at least 30 minutes.\nMeanwhile, place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate, let cool, and chop.\nIn a large salad bowl, stir together the ranch dressing, bacon, Parmesan cheese, carrot, celery, and red onion until well combined. Lightly stir in the cooled pasta to coat with dressing, and refrigerate 2 hours to blend flavors before serving.",
    "pt": "15 m",
    "ct": "",
    "tt": "",
    "i": "3378222.jpg",
    "o": "519985.jpg,463100.jpg,436254.jpg,422984.jpg,420326.jpg,415738.jpg",
    "st": "allrecipes"
}