{
    "id": 214736,
    "old_rating": "4.52903",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 skinless, boneless chicken breast halves",
        "salt and pepper to taste",
        "1 pinch paprika, or to taste",
        "3 tablespoons butter",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1/3 cup milk",
        "2 tablespoons minced onion",
        "1/2 cup processed cheese (such as VelveetaÂ®), diced",
        "2 tablespoons Worcestershire sauce",
        "1 (4.5 ounce) can sliced mushrooms, drained and chopped",
        "2/3 cup sour cream"
    ],
    "nut": [
        "Calories > 335 kcal",
        "Carbs > 8.9 g",
        "Cholesterol > 100 mg",
        "Fat > 20.6 g",
        "Protein > 28.2 g",
        "Sodium > 769 mg"
    ],
    "n": "Chicken Breasts Supreme",
    "a": "angelfadedblue",
    "r": "0",
    "s": 6,
    "des": "\"This won 1st place in county fair Dairy Main Dish Recipe Contest in 1972. Passed down in the family -- it's the dish I make when I make my first dinner for a boyfriend! Everyone loves this! (Even my daughter- picking out the mushrooms, of course!) Cook any kind of noodles or rice to have as a bed under the chicken and sauce. I always make double the sauce, because its sooo good! I use the sauce just with noodles as well.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2-quart casserole dish.\nSprinkle the chicken breasts with salt, pepper, and paprika. Melt butter in a large skillet and brown the chicken breasts well on both sides, about 5 minutes per side. Lay the chicken breasts into the bottom of the prepared casserole dish.\nIn a saucepan over medium-low heat, mix together the mushroom soup, milk, onion, processed cheese, Worcestershire sauce, and mushrooms. Allow the mixture to heat until the cheese melts, but do not boil. Stir to thoroughly combine; mix in the sour cream until smooth. Pour the sauce over the chicken breasts in the dish and cover with foil.\nBake in the preheated oven until the chicken is tender and the juices run clear, about 45 minutes. Uncover, baste with sauce, and bake 30 more minutes, basting occasionally.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "476930.jpg",
    "o": "4465552.jpg,4460225.jpg,4329621.jpg,4293437.jpg,4223443.jpg,4126831.jpg",
    "st": "allrecipes"
}