{
    "id": 214709,
    "old_rating": "4.64286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 pounds whole russet potatoes",
        "5 eggs",
        "1 1/2 cups mayonnaise (such as Hellman'sÂ®)",
        "2 tablespoons prepared yellow mustard (such as French'sÂ®)",
        "1 small onion, chopped",
        "3 stalks celery, chopped",
        "7 sweet gherkins, chopped",
        "25 pimento-stuffed green olives, sliced",
        "1 pinch salt to taste",
        "1 green bell pepper, sliced (optional)"
    ],
    "nut": [
        "Calories > 501 kcal",
        "Carbs > 51.6 g",
        "Cholesterol > 106 mg",
        "Fat > 30.1 g",
        "Protein > 8.8 g",
        "Sodium > 613 mg"
    ],
    "n": "Mother's Potato Salad",
    "a": "Susie",
    "r": "0",
    "s": 10,
    "des": "\"My mother's potato salad -- chunky and flavorful -- a favorite at our family gatherings. Best if made the day before. Season with salt carefully because the olives will be salty.\"",
    "ins": "Place the potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two. Allow to cool, peel, and cut into cubes.\nPlace the eggs into a saucepan in a single layer and fill with water to cover the eggs by 1 inch. Cover the saucepan and bring the water to a boil over high heat. Once the water is boiling, remove from the heat and let the eggs stand in the hot water for 15 minutes. Pour out the hot water, then cool the eggs under cold running water in the sink. Peel and slice once cold. Reserve 1 attractive slice of egg for garnish.\nMix the mayonnaise and mustard together in a bowl. In a large salad bowl, lightly mix together the potatoes, eggs, onion, celery, sweet gherkins, and olives until thoroughly combined. Pour the mayonnaise dressing over the salad, and gently toss gain to coat the ingredients with dressing. Season to taste with salt, and top the salad with slices of green pepper and reserved egg slice in the center for garnish. Chill until ready to serve.",
    "pt": "45 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "2432722.jpg",
    "o": "",
    "st": "allrecipes"
}