{
    "id": 214739,
    "old_rating": "2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 head cauliflower, broken into florets",
        "3 potatoes, peeled and diced",
        "2 garlic cloves",
        "salt and ground black pepper to taste",
        "1 cup peas (optional)",
        "1 cup milk",
        "1/2 cup cold vegetable stock",
        "2 tablespoons butter",
        "2 tablespoons flour",
        "3 slices Swiss cheese, torn into pieces",
        "1 tablespoon curry powder, or more to taste"
    ],
    "nut": [
        "Calories > 300 kcal",
        "Carbs > 39.8 g",
        "Cholesterol > 32 mg",
        "Fat > 10.9 g",
        "Protein > 13.3 g",
        "Sodium > 208 mg"
    ],
    "n": "Veggie Curry Casserole",
    "a": "DLUTINSKI",
    "r": "0",
    "s": 5,
    "des": "\"I created this dish because my boyfriend is from South Africa and always wants curry, so I took some of his favorite ingredients and I Americanized it, but he loves it so I thought I would share. It's warm and comforting on cold nights and reheats well.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Lightly grease a casserole dish.\nBring a pot of lightly salted water to a boil; partially cook the cauliflower, potatoes, and garlic cloves in the boiling water for 5 to 7 minutes. Drain. Spread into the bottom of the prepared casserole dish; season with salt and pepper. Scatter the peas over the mixture. Set aside.\nCombine the vegetable stock, butter, and flour together in a small saucepan over medium heat; bring to a simmer. Slowly stir the milk into the mixture; continue cooking until hot. Slowly add the Swiss cheese to the mixture and allow to melt into the liquid; cook and stir until a cheesy white sauce forms. Season with the curry powder, salt, and pepper. Pour the sauce over the vegetable mixture. Cover with aluminum foil.\nBake in the preheated oven until the vegetables are cooked through and tender, about 20 minutes. Serve hot.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "3675066.jpg",
    "o": "",
    "st": "allrecipes"
}