{
    "id": 214774,
    "old_rating": "4.59375",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon yellow curry paste",
        "1/2 cup chicken broth, divided",
        "1 teaspoon white sugar",
        "1 1/2 teaspoons curry powder",
        "1/2 teaspoon salt",
        "4 1/2 teaspoons light soy sauce",
        "1 (5.6 ounce) can coconut milk",
        "1 tablespoon canola oil",
        "3 skinless, boneless chicken breast halves, sliced",
        "2 teaspoons minced garlic",
        "1 teaspoon minced fresh ginger",
        "1 onion, sliced",
        "2 potatoes - peeled, halved, and sliced"
    ],
    "nut": [
        "Calories > 241 kcal",
        "Carbs > 24.1 g",
        "Cholesterol > 46 mg",
        "Fat > 7.1 g",
        "Protein > 20.1 g",
        "Sodium > 864 mg"
    ],
    "n": "Adriel's Chinese Curry Chicken",
    "a": "BlondeCook",
    "r": "0",
    "s": 4,
    "des": "\"My husband is Chinese and this is one of our favorite dishes. My late father-in-law, who used to be a Chinese chef, said my version of this was better than his! Yellow curry paste can be found at an Asian market. You may have to add a little more or less curry paste, depending on your taste. I included a more moderate amount in this recipe. I suggest serving this over cooked jasmine rice. It has a little bit of heat, so probably do not serve to small children. Enjoy!\"",
    "ins": "In a bowl, mash the yellow curry paste with about 2 tablespoons of chicken broth to help dissolve the paste; whisk in remaining chicken broth, sugar, curry powder, salt, light soy sauce, and coconut milk. Set aside.\nHeat a wok or large skillet over high heat for about 30 seconds; pour in the oil. Let the oil heat until shimmering, about 30 more seconds. Stir the chicken, garlic, and ginger into the hot oil; cook and stir until the chicken has begun to brown and the garlic and ginger are fragrant, about 2 minutes. Stir in the onion and potatoes, toss all ingredients in the hot oil, and pour in the sauce mixture. Bring the sauce to a boil, reduce heat, and cover the wok. Simmer until the chicken is cooked through and the potatoes are tender, 20 to 25 minutes.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "1018396.jpg",
    "o": "",
    "st": "allrecipes"
}