{
    "id": 214776,
    "old_rating": "4.44681",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/4 cups all-purpose flour",
        "1/4 teaspoon salt",
        "1/3 cup shortening",
        "2 tablespoons warm water, or as needed",
        "1 tablespoon shortening",
        "1/4 cup white sugar",
        "ground cinnamon"
    ],
    "nut": [
        "Calories > 62 kcal",
        "Carbs > 7.1 g",
        "Cholesterol > 0 mg",
        "Fat > 3.4 g",
        "Protein > 0.7 g",
        "Sodium > 24 mg"
    ],
    "n": "Piggies (Sugar and Cinnamon Pie Dough Cookies)",
    "a": "jmk3482",
    "r": "0",
    "s": 24,
    "des": "\"Crumbly sugar and cinnamon cookies that you can make as fast as they disappear. My father told me about these cookies that his mother used to make. When she made a pie, she would take the excess dough and make these simple cookies. You don't have to make a pie first, all you need is pie dough. My father loves when I make them for him, and I think you will be hard-pressed to find someone who doesn't. My father said she called them Piggies. That's what I call them.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C). Spray a baking sheet with cooking spray, or line with parchment paper.\nMix flour and salt together in a bowl, and use a pastry cutter to cut in 1/3 cup of shortening until the mixture forms pea-size balls. With a fork, form a small well in the center of the mixture, and pour in water, a couple of teaspoons at a time, and stir with the fork to mix in the water and form a dough. Incorporate each addition of water before adding the next, until about 3/4 of the flour mixture has formed a stiff dough. Work a little more water in with your hands, and shape the dough into a ball.\nWorking on a well-floured work surface with a floured rolling pin, roll the dough out into a rectangle about 12 by 16 inches, and about 1/8-inch thick. Spread 1 tablespoon of shortening over the surface of the dough with a soft spatula, and sprinkle sugar all over the dough square. Sprinkle the dough with cinnamon. Pick up a long edge of dough, and tightly roll the dough into a log shape. With a sharp knife, slice the log into 3/4-inch thick slices. Place the slices onto the prepared baking sheet.\nBake in the preheated oven until the cookies are lightly browned and sizzling on the bottom, about 8 minutes. Cool on paper towels; freeze extras for later.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "518810.jpg",
    "o": "",
    "st": "allrecipes"
}