{
    "id": 214760,
    "old_rating": "4.79167",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup chopped pecans",
        "1 1/2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1 1/2 cups very ripe, mashed bananas",
        "1 cup white sugar",
        "2 large eggs",
        "1 1/2 teaspoons vanilla extract",
        "1/2 teaspoon coconut extract",
        "2 tablespoons lemon juice",
        "1/2 cup light butter, at room temperature"
    ],
    "nut": [
        "Calories > 181 kcal",
        "Carbs > 27.8 g",
        "Cholesterol > 31 mg",
        "Fat > 7.5 g",
        "Protein > 2.7 g",
        "Sodium > 202 mg"
    ],
    "n": "Roasted Pecan Banana Bread Loaves",
    "a": "atlantasassybelle",
    "r": "0",
    "s": 16,
    "des": "\"My father loves bananas and pecans, so for his birthday this year I whipped up a special treat for him: two of his favorites, wrapped into one, and made into individual loaves so he could easily freeze the extras and have his birthday banana bread whenever he wanted. (Coconut extract helps to bring out the fresh banana flavor - trust!) The flavor is better a day later.\"",
    "ins": "Preheat oven to 275 degrees F (135 degrees C).  Spread the pecans onto a baking sheet, and toast until the nuts start to turn golden brown and become fragrant, about 45 minutes. Watch the nuts carefully as they bake, they burn quickly. Once toasted, set the nuts aside to cool to room temperature.\nRaise the oven temperature to 350 degrees F (175 degrees C). Spray 2 mini loaf pans with cooking spray.\nCombine the toasted pecans, flour, baking soda, baking powder, and salt in a bowl. In a large bowl, mix the bananas, sugar, eggs, vanilla and coconut extracts, lemon juice, and butter together with a fork or an electric mixer on low speed. Stir the flour mixture into the banana mixture, and pour the batter into the prepared loaf pans, filling them about 3/4 full.\nBake in the preheated oven until a toothpick inserted into the middle of a loaf comes out clean, about 30 minutes. Let the loaves cool in the pans for 5 minutes before turning out onto a rack to finish cooling. Wrap cooled loaves in plastic wrap.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "583398.jpg",
    "o": "",
    "st": "allrecipes"
}