{
    "id": 214735,
    "old_rating": "4.38889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 red potatoes, scrubbed and dried with paper towels",
        "3 tablespoons canola oil",
        "1 tablespoon dried thyme",
        "1 tablespoon chili powder",
        "1 tablespoon kosher salt",
        "1 tablespoon cracked black pepper",
        "1 bunch green onions, sliced",
        "3/4 cup roasted red peppers, drained and diced",
        "1/2 cup kalamata olives, pitted and sliced",
        "1 (10 ounce) can artichoke hearts, drained and chopped",
        "1/4 cup chopped fresh parsley",
        "1/2 cup crumbled Gorgonzola cheese",
        "1/4 cup balsamic vinegar",
        "1/4 cup extra-virgin olive oil",
        "1 tablespoon Dijon mustard",
        "1 teaspoon minced garlic",
        "1 teaspoon dried oregano",
        "1 teaspoon dried basil",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 254 kcal",
        "Carbs > 18.7 g",
        "Cholesterol > 11 mg",
        "Fat > 18 g",
        "Protein > 5.7 g",
        "Sodium > 1319 mg"
    ],
    "n": "Roasted Potato Salad with Balsamic Dressing",
    "a": "Zin",
    "r": "0",
    "s": 8,
    "des": "\"This delicious side salad is good for any season and won't go bad in the hot summer sun! If you want a quick hot dish, stir to thoroughly coat the ingredients and serve warm.  If you're interested in a cool dish (or wish to serve later), chill for at least 4 hours or overnight before serving.\n\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nCut the potatoes into 3/4-inch chunks, and place into a bowl. Drizzle with canola oil, and spread out onto a baking sheet. Turn potatoes so skin sides are down. Sprinkle the potatoes with thyme, chili powder, kosher salt, and pepper.\nBake in the preheated oven until the potatoes are golden brown, about 45 minutes. Remove and allow to cool.\nIn a large salad bowl, lightly toss the cooled potatoes, green onions, roasted red peppers, olives, artichoke hearts, parsley, and Gorgonzola cheese until thoroughly combined.\nPlace the balsamic vinegar, olive oil, Dijon mustard, garlic, oregano, and basil into a blender, and pulse a few times until the dressing is thickened and creamy. Season to taste with salt and pepper, pour over the potato salad, and toss lightly. Chill for 4 hours before serving.",
    "pt": "45 m",
    "ct": "45 m",
    "tt": "6 h",
    "i": "964064.jpg",
    "o": "",
    "st": "allrecipes"
}