{
    "id": 214767,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon clarified butter",
        "1 1/3 pounds quinces - peeled, cored, and cut into wedges",
        "1/2 cup all-purpose flour",
        "1 tablespoon white sugar",
        "1 pinch salt",
        "1/2 cup dark beer",
        "1 dash vanilla extract",
        "2 teaspoons finely grated fresh lemon zest",
        "3 tablespoons coconut oil, or as needed",
        "3 tablespoons demerara sugar"
    ],
    "nut": [
        "Calories > 215 kcal",
        "Carbs > 32.3 g",
        "Cholesterol > 5 mg",
        "Fat > 9.3 g",
        "Protein > 1.6 g",
        "Sodium > 33 mg"
    ],
    "n": "Fried Quinces, in the Manner of the Countess",
    "a": "THELASTBARON",
    "r": "0",
    "s": 6,
    "des": "\"According to lore, this recipe finds its origins in the cookbook of one Philippina Welser, authored in 1545 in Augsburg, Germany. The 20-year-old woman, a commoner, placed her cookbook in her dowry when she married Archduke Ferdinand Hapsburg of Austria, Governor of Bohemia in 1557 in a secret ceremony.\"",
    "ins": "Heat the clarified butter in a skillet over low heat, and place the quince wedges into the pan. Cover, then gently cook the quince wedges until softened, about 15 minutes. Remove from heat and set aside.\nMix the flour, white sugar, and salt in a bowl. In a separate bowl, mix the beer with the vanilla extract and lemon zest; gradually mix the flour mixture into the beer mixture until it becomes a smooth batter.\nMelt the coconut oil in a skillet over medium heat. When the oil is hot, dip the quince wedges into the batter and place them in the hot oil; fry in batches until golden brown. Remove fried quinces to a warm platter while you finish frying. Sprinkle the fried quinces with demerara sugar to serve.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "1079116.jpg",
    "o": "",
    "st": "allrecipes"
}