{
    "id": 214754,
    "old_rating": "3.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 large beets",
        "1 (12 ounce) package bacon",
        "1/2 cup shredded Gruyere cheese",
        "1/4 cup grated Parmesan cheese",
        "1/4 cup sour cream",
        "2 tablespoons chopped garlic",
        "1 teaspoon garlic salt",
        "ground black pepper to taste"
    ],
    "nut": [
        "Calories > 365 kcal",
        "Carbs > 25.2 g",
        "Cholesterol > 56 mg",
        "Fat > 20.9 g",
        "Protein > 20.8 g",
        "Sodium > 1402 mg"
    ],
    "n": "Stuffed Beets",
    "a": "BRENT",
    "r": "0",
    "s": 4,
    "des": "\"Delicious as a small meal, or great as a side dish.  Savory and flavorful.\"",
    "ins": "Place the beets into a large pot and cover with water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender and skin slides off, about 20 minutes. Drain and allow to cool, then remove skin, and cut off roots and stems so that both ends are flat. Scoop out the inside of the beets using a melon baller or spoon, leaving about 1/4-inch on the sides and bottom. Set the hollowed beet cups aside.\nWhile the beets are cooking, place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate, then crumble.\nPreheat an oven to 350 degrees F (175 degrees C).\nDice the remaining chunks of beets, and place in a large bowl. Mix in the Gruyere cheese, Parmesan cheese, sour cream, crumbled bacon, garlic, garlic salt, and pepper until well combined. Gently fill each beet cup with the cheese mixture. Place filled beets in a shallow baking dish.\nBake in the preheated oven until the cheese melts and is heated through, 20 to 30 minutes.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "943627.jpg",
    "o": "",
    "st": "allrecipes"
}