{
    "id": 214784,
    "old_rating": "4.26354",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 bunch kale",
        "1 tablespoon extra-virgin olive oil, divided",
        "1 tablespoon sherry vinegar",
        "1 pinch sea salt, to taste"
    ],
    "nut": [
        "Calories > 174 kcal",
        "Carbs > 22.5 g",
        "Cholesterol > 0 mg",
        "Fat > 8.3 g",
        "Protein > 7.4 g",
        "Sodium > 257 mg"
    ],
    "n": "Kale Chips",
    "a": "Theresa Peters",
    "r": "0",
    "s": 2,
    "des": "\"Crispy, crunchy, and nutritious! I used Spanish sherry vinegar, but any vinegar you like the flavor of will work. I checked every 10 minutes or so and turned some pieces over. I also found I didn't mind if there were a few softer parts on some of the kale leaves, I liked the combination of crisp and softer parts.\"",
    "ins": "Preheat an oven to 300 degrees F (150 degrees C).\nCut away inner ribs from each kale leaf and discard; tear the leaves into pieces of uniform size. (I made my pieces about the size of a small potato chip.) Wash torn kale pieces and spin dry in a salad spinner or dry with paper towels until they're very dry.\nPut the kale pieces into a large resealable bag (or use a bowl if you don't mind getting your hands oily). Add about half the olive oil; seal and squeeze the bag so the oil gets distributed evenly on the kale pieces. Add the remaining oil and squeeze the bag more, until all kale pieces are evenly coated with oil and slightly 'massaged.' Sprinkle the vinegar over the kale leaves, reseal the bag, and shake to spread the vinegar evenly over the leaves. Spread the leaves evenly onto a baking sheet.\nRoast in the preheated oven until mostly crisp, about 35 minutes. Season with salt and serve immediately.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "873437.jpg",
    "o": "4537809.jpg,4018518.jpg,3385949.jpg,2244768.jpg,2080472.jpg,1903709.jpg",
    "st": "allrecipes"
}