{
    "id": 214863,
    "old_rating": "4.61111",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 pork chops",
        "1 sleeve buttery crackers (such as Keebler ClubÂ® crackers), crushed",
        "1/2 teaspoon Greek seasoning (such as Cavender'sÂ®)",
        "1/4 teaspoon ground black pepper",
        "1 cup all-purpose flour",
        "2 eggs, beaten",
        "1 cup butter",
        "1 lemon, cut into wedges"
    ],
    "nut": [
        "Calories > 834 kcal",
        "Carbs > 43.7 g",
        "Cholesterol > 253 mg",
        "Fat > 64.1 g",
        "Protein > 23.2 g",
        "Sodium > 706 mg"
    ],
    "n": "Schnitzel with a Twist",
    "a": "Stephanie",
    "r": "0",
    "s": 4,
    "des": "\"My husband spent part of his childhood in Germany and craves traditional German fare.  I found a simple recipe for pork schnitzel that was really delicious.  Unfortunately one of the times that I went to make for my husband I was missing some of the ingredients so I experimented and came up with this version.  My family enjoys this so much I no longer make  traditional schnitzel for them.  This recipe is definitely rich and is not for anyone worried about dieting....I hope any who try this will enjoy this recipe.\"",
    "ins": "Place the pork chops between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the pork with the smooth side of a meat mallet to a thickness of 1/2-inch.\nCombine crackers, Greek seasoning, and pepper in a large mixing bowl. Place the flour in a shallow bowl. Dredge the pork chops in the flour, then dip them into the egg. Toss the pork chops one at a time in the cracker mixture to coat.\nMelt the butter in a large skillet over medium heat. Fry the pork chops in the butter until golden brown, reducing heat to medium-low if the pork browns too quickly, 10 to 15 minutes. Flip the pork chops, continue cooking until the pork is no longer pink in the center, 10 to 15 more minutes. Serve with lemon wedges.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "3964760.jpg",
    "o": "",
    "st": "allrecipes"
}