{
    "id": 214826,
    "old_rating": "4.59504",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 hard rolls, split",
        "1/2 cup mayonnaise",
        "3 cloves garlic, minced",
        "1 tablespoon Parmesan cheese",
        "3 tablespoons olive oil",
        "2 pounds round steak, thinly sliced",
        "1 large onion, sliced and quartered",
        "1 pinch coarse sea salt",
        "1/2 teaspoon Worcestershire sauce",
        "1/8 teaspoon liquid smoke",
        "8 (1 ounce) slices provolone cheese",
        "1/2 teaspoon Italian seasoning"
    ],
    "nut": [
        "Calories > 949 kcal",
        "Carbs > 27.7 g",
        "Cholesterol > 171 mg",
        "Fat > 62.9 g",
        "Protein > 65.9 g",
        "Sodium > 1039 mg"
    ],
    "n": "Ultimate Steak Sandwich",
    "a": "fotoe!78",
    "r": "0",
    "s": 4,
    "des": "\"Make the ultimate steak sandwich with tender and juicy steak and sauteed onions served on a toasted hard roll with garlic-Parmesan mayonnaise, provolone cheese and Italian seasoning. Don't forget to roll up your sleeves!\"",
    "ins": "Preheat an oven to 500 degrees F (260 degrees C). Split the rolls open and toast them on a baking sheet in the oven while it is preheating. Mix together the mayonnaise, garlic, and Parmesan cheese in a small bowl. Refrigerate until ready to use. Remove the rolls from the oven when toasted as desired.\nHeat olive oil in a large skillet over medium-high heat. Carefully place the sliced steak and onions in the pan and season with sea salt, Worcestershire sauce, and liquid smoke. Cook and stir until the steak is browned and the onion is tender, about 10 minutes.\nGenerously spread the prepared garlic-Parmesan mayonnaise on both halves of the toasted rolls. Divide the steak and onion mixture evenly among the bottom halves of the rolls, piling them high. Top each with 2 slices provolone cheese and sprinkle with Italian seasoning. Place the tops on the sandwiches.\nBake the sandwiches on a baking sheet in the preheated oven until the cheese is melted, about 5 minutes.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "1099284.jpg",
    "o": "4484366.jpg,3510298.jpg,1589475.jpg,1083302.jpg,844287.jpg,419660.jpg",
    "st": "allrecipes"
}