{
    "id": 214827,
    "old_rating": "4.76923",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound sirloin steak",
        "1 tablespoon garlic salt",
        "1 teaspoon ground black pepper",
        "1 teaspoon ground cumin",
        "ground cayenne pepper to taste",
        "4 kaiser rolls, split",
        "1/4 cup mayonnaise",
        "1/2 cup refried beans",
        "1 large avocado, thinly sliced",
        "1 large tomato, sliced",
        "2 cups shredded lettuce",
        "crumbled cotija cheese (optional)"
    ],
    "nut": [
        "Calories > 546 kcal",
        "Carbs > 36.4 g",
        "Cholesterol > 64 mg",
        "Fat > 32.3 g",
        "Protein > 29.4 g",
        "Sodium > 1886 mg"
    ],
    "n": "Mexican Steak Torta",
    "a": "Sarah Waltrip",
    "r": "0",
    "s": 4,
    "des": "\"This is a Mexican sandwich filled with char grilled steak, beans, avocado, lettuce and tomato all served up on a warm toasted roll.  Growing up in Southern California this has become a family favorite. If cotija cheese is not available, use cheddar. Serve warm with Spanish rice.\"",
    "ins": "Preheat an outdoor grill for medium-high heat, and lightly oil the grate. Season steak with garlic salt, black pepper, cumin, and cayenne pepper.\nGrill steak on the preheated grill until medium-rare, about 5 minutes per side. Remove from heat to a cutting board and cover with foil.\nSet a large skillet over medium-high heat. Spread both halves of each roll with mayonnaise. Brown the rolls, mayonnaise-side down until golden, about 3 minutes. Warm the refried bean in a bowl in the microwave, about 1 minute on High, and slice the sirloin steak into thin strips.\nSpread a thin layer of beans on the bottom half of each roll, layer with steak, avocado, tomato, and lettuce. Top with cheese, if desired, and close the sandwich with the top of the roll.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "2516917.jpg",
    "o": "",
    "st": "allrecipes"
}