{
    "id": 214811,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups uncooked white rice",
        "4 cups water",
        "3 tablespoons vegetable oil",
        "2 cloves garlic, minced",
        "3 skinless, boneless chicken breast halves - cut into bite-size pieces",
        "2 tablespoons soy sauce, or to taste",
        "1/2 cup dry-roasted, unsalted peanuts",
        "4 large leaves of iceberg lettuce",
        "1 (11 ounce) can mandarin oranges, drained"
    ],
    "nut": [
        "Calories > 693 kcal",
        "Carbs > 91 g",
        "Cholesterol > 50 mg",
        "Fat > 22.2 g",
        "Protein > 31.4 g",
        "Sodium > 511 mg"
    ],
    "n": "Maho, Vietnamese Chicken Recipe",
    "a": "PinkPetunias",
    "r": "0",
    "s": 4,
    "des": "\"Here is a very low cost and simple recipe for a great Vietnamese chicken recipe, Maho. It is something we eat on a regular basis, and my toddler likes it too, so you know it is yummy.\"",
    "ins": "Bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Let the rice stand, covered, while you finish the dish.\nHeat oil in a skillet over medium heat until shimmering, and cook and stir the garlic until fragrant, about 1 minute. Stir in the chicken, and cook and stir until seared and beginning to brown, about 5 minutes. Stir in soy sauce and peanuts, and cook and stir until the chicken is no longer pink inside, and the soy sauce has coated the chicken and peanuts, 5 more minutes. Remove the chicken mixture from the heat.\nLine 4 plates with lettuce leaves, and scoop 1 cup of cooked rice onto each leaf. Top with chicken-peanut mixture, and sprinkle each plate with mandarin orange slices.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "3509830.jpg",
    "o": "",
    "st": "allrecipes"
}