{
    "id": 214895,
    "old_rating": "4.3125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 slices fresh pineapple",
        "1 red bell pepper",
        "1 jalapeno pepper",
        "2 large mangos - peeled, seeded, and diced",
        "1 small red onion, diced",
        "1/4 cup chopped cilantro",
        "1 lime, juiced",
        "1/2 teaspoon lime zest"
    ],
    "nut": [
        "Calories > 48 kcal",
        "Carbs > 12.4 g",
        "Cholesterol > 0 mg",
        "Fat > 0.2 g",
        "Protein > 0.6 g",
        "Sodium > 2 mg"
    ],
    "n": "Grilled Pineapple Mango Salsa",
    "a": "Irlynda Smith",
    "r": "0",
    "s": 12,
    "des": "\"This salsa is so easy to make and versatile too. Add what you like, leave out what you don't like. It should taste as fresh as summer! Great with fish, chicken, pork, chips, or just with a spoon! This is a do ahead recipe for sure.  It taste better the next day.  Play with this salsa, I have added grapes, apples, dried cranberries, cantaloupe, honeydew melon, watermelon; just balance sweet with acid of lime or lemon. Have fun with it!\"",
    "ins": "Preheat an outdoor grill for medium-high heat; lightly oil the grate.\nCook the pineapple, red bell pepper, and jalapeno pepper on the preheated grill, turning frequently, until the pineapple has mild grill marks and the peppers are browned on all sides, about 3 minutes for pineapple and 5 to 7 minutes for peppers. Carefully remove from grill and place peppers in paper bag to cool.\nAfter peppers are cool, rub skins off gently with paper towels, cut in half, and remove and discard seeds. Cut the cooled pineapple and peppers into a small dice and place into a bowl. Add the mango, red onion, cilantro, lime juice, and lime zest; stir to combine. Cover the bowl with plastic wrap and refrigerate for 8 hours to 1 day before serving.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "8 h ",
    "i": "3503570.jpg",
    "o": "",
    "st": "allrecipes"
}