{
    "id": 214924,
    "old_rating": "4.78889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups farro",
        "3/4 pound fresh asparagus, trimmed",
        "1 cup red and yellow cherry tomatoes, halved",
        "3/4 cup chopped walnuts",
        "3/4 cup dried cranberries",
        "1/2 cup chopped fresh parsley",
        "1/3 cup chopped fresh chives",
        "1/4 cup balsamic vinaigrette, or to taste",
        "1 cup shaved Parmesan cheese, divided"
    ],
    "nut": [
        "Calories > 223 kcal",
        "Carbs > 32.4 g",
        "Cholesterol > 6 mg",
        "Fat > 9.1 g",
        "Protein > 7.9 g",
        "Sodium > 164 mg"
    ],
    "n": "Farro Salad with Asparagus and Parmesan",
    "a": "Duncan",
    "r": "0",
    "s": 12,
    "des": "\"A light and delicious way to get your whole grains. Perfect salad for picnics, baby or bridal showers or just because!\"",
    "ins": "Soak farro in a large bowl of water for at least 12 hours. Drain.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the drained farro, and return to a boil. Reduce heat to medium, then cook the farro uncovered, stirring occasionally for 20 minutes. Reduce heat to low, cover, and continue simmering until tender, about 30 more minutes. Drain and allow to cool.\nBring a large pot of lightly salted water to a boil. Add the asparagus, and cook uncovered until tender, about 3 minutes. Drain in a colander, then immediately immerse in ice water for several minutes until cold to stop the cooking process. Once the asparagus is cold, drain well, and chop. Set aside.\nPlace farro, asparagus, tomatoes, walnuts, cranberries, parsley, and chives in a large bowl. Drizzle the balsamic vinaigrette over and sprinkle about 3/4 cups Parmesan cheese, then toss. Top with the remaining 1/4 cup of Parmesan cheese. Serve at room temperature.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "13 h ",
    "i": "1125962.jpg",
    "o": "4500968.jpg,4471571.jpg,3787979.jpg,3641227.jpg,3593899.jpg,2636527.jpg",
    "st": "allrecipes"
}