{
    "id": 214975,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 purple potatoes, scrubbed",
        "1 tablespoon olive oil",
        "1 large red onion, chopped",
        "8 ounces sliced fresh mushrooms",
        "salt and black pepper to taste",
        "2 tablespoons olive oil",
        "1/4 teaspoon crushed red pepper flakes",
        "1 tablespoon chopped capers",
        "1 teaspoon chopped fresh tarragon"
    ],
    "nut": [
        "Calories > 189 kcal",
        "Carbs > 29.7 g",
        "Cholesterol > 0 mg",
        "Fat > 6.9 g",
        "Protein > 4.5 g",
        "Sodium > 46 mg"
    ],
    "n": "Vegetarian Purple Potatoes with Onions and Mushrooms",
    "a": "wmihalo",
    "r": "0",
    "s": 6,
    "des": "\"This is a simple side dish for purple potatoes, onions and mushrooms. You can prepare this recipe in a large skillet. I prefer thoroughly scrubbing the potatoes and not peeling them.\"",
    "ins": "Cut each potato into wedges by quartering the potatoes, then cutting each quarter in half. Heat 1 tablespoon of olive oil over medium heat in a large skillet, and cook and stir the onion and mushrooms until the mushrooms start to release their liquid and the onion becomes translucent, about 5 minutes. Transfer the onion and mushrooms into a bowl, and set aside.\nHeat 2 more tablespoons of olive oil over high heat in the same skillet, and place the potato wedges into the hot oil. Sprinkle with salt and pepper, and allow to cook, stirring occasionally, until the wedges are browned on both sides, about 10 minutes. Reduce heat to medium, sprinkle the potato wedges with red pepper flakes, and allow to cook until the potatoes are tender, about 10 more minutes. Stir in the onion and mushroom mixture, toss the vegetables together, and mix in the capers and fresh tarragon.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "3331258.jpg",
    "o": "",
    "st": "allrecipes"
}