{
    "id": 214959,
    "old_rating": "4.45",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound chicken livers, rinsed and trimmed",
        "1 cup milk",
        "1/2 cup unsalted butter",
        "2 large onions, thinly sliced",
        "2 cloves garlic, minced",
        "1 teaspoon chopped fresh rosemary",
        "1 teaspoon chopped fresh thyme",
        "2 bay leaves",
        "1/2 cup dry white wine",
        "2 tablespoons drained capers",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 139 kcal",
        "Carbs > 4.2 g",
        "Cholesterol > 158 mg",
        "Fat > 9.7 g",
        "Protein > 7.1 g",
        "Sodium > 266 mg"
    ],
    "n": "Jo's Chicken Liver Pate",
    "a": "aeyla64",
    "r": "0",
    "s": 12,
    "des": "\"I love pate so I decided to make some at home. Living in a small town, goose or duck liver is not available. I worked on making a recipe with readily available ingredients, but does not taste like it. Serve with sliced French baguettes, capers, whipped cream cheese, thinly sliced green onions, and black whitefish caviar.\"",
    "ins": "Stir together the chicken livers and milk in a bowl. Set aside to soak for 2 hours, then drain and discard the milk.\nMelt the butter in a large skillet over medium  heat. Stir in the onion and garlic; cook and stir until the onions have softened and turned translucent, about 10 minutes. Stir in the rosemary, thyme, bay leaves, and drained chicken livers. Cook and stir until the livers have firmed on the outside but are still pink on the inside, about 5 minutes. Transfer the chicken livers to a bowl, and pour the wine into the skillet. Simmer until the wine has reduced to 1/4 of its original volume, then return the livers to the skillet, and continue cooking until no longer pink in the center, about 5 minutes more.\nRemove and discard the bay leaves. Scrape the livers into a blender or food processor, and add the capers, salt, and pepper. Puree until smooth, then scrape the mixture into a serving dish. Cover with plastic wrap, and refrigerate at least 4 hours until cold.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "6 h ",
    "i": "488830.jpg",
    "o": "",
    "st": "allrecipes"
}