{
    "id": 214918,
    "old_rating": "4.39394",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 slices bacon",
        "1 head cauliflower, chopped into bite size pieces",
        "2 tablespoons extra-virgin olive oil",
        "2 cloves garlic, minced",
        "salt and ground black pepper to taste",
        "1/2 cup fat-free sour cream",
        "1/2 cup reduced-fat mayonnaise",
        "4 ounces shredded sharp white Cheddar cheese",
        "4 green onions, chopped",
        "1 bunch chopped fresh chives",
        "2 dashes hot pepper sauce (such as Frank's RedHotÂ®)",
        "1/4 teaspoon paprika"
    ],
    "nut": [
        "Calories > 200 kcal",
        "Carbs > 10 g",
        "Cholesterol > 30 mg",
        "Fat > 13.5 g",
        "Protein > 11 g",
        "Sodium > 329 mg"
    ],
    "n": "Fully Loaded Cauliflower Salad",
    "a": "Sarah Jo",
    "r": "0",
    "s": 6,
    "des": "\"A lower in carb version of my favorite baked potato salad. Most people when I serve this can't tell right away that this is made with cauliflower. Even my cauliflower hating husband enjoys this salad!\"",
    "ins": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. When cool, crumble into bacon bits.\nPreheat an oven to 400 degrees F (200 degrees C). Line a baking sheet with foil.\nCombine the cauliflower, olive oil, garlic, salt, and black pepper in large bowl. Spread the cauliflower on the foil-lined baking sheet, and roast in the preheated oven until the cauliflower is lightly browned, about 15 to 20 minutes. Cool.\nPlace the cooled roasted cauliflower, sour cream, and mayonnaise in a large bowl; stir.  Fold in the shredded Cheddar cheese, bacon bits, green onion, chives, pepper sauce, and paprika. Adjust salt and black pepper. Refrigerate for 1 to 2 hours before serving.",
    "pt": "35 m",
    "ct": "35 m",
    "tt": "2 h ",
    "i": "816368.jpg",
    "o": "",
    "st": "allrecipes"
}