{
    "id": 215078,
    "old_rating": "4.44444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (9 inch) unbaked pie crust",
        "1 cup peeled, cubed zucchini",
        "2 eggs",
        "1 cup white sugar",
        "1/2 cup butter, melted",
        "2 tablespoons all-purpose flour",
        "1/2 teaspoon vanilla extract",
        "1/2 cup all-purpose flour",
        "1/2 cup brown sugar",
        "3 tablespoons butter"
    ],
    "nut": [
        "Calories > 612 kcal",
        "Carbs > 75.8 g",
        "Cholesterol > 118 mg",
        "Fat > 32.9 g",
        "Protein > 5.8 g",
        "Sodium > 337 mg"
    ],
    "n": "Zucchini Pie with Crumb Topping",
    "a": "Cat_Lady",
    "r": "0",
    "s": 6,
    "des": "\"Tastes like an apple pie with a smooth texture! My husband LOVES this pie!  He says the taste is somewhere between an apple and a pecan pie, but I think it tastes like apple. You may want to use less sugar depending on your taste. This is a great way to use all that zucchini from your garden! My family only likes zucchini bread once in a while, and my kids will only eat a few different veggies -- zucchini being one of them -- so I love discovering new ways to incorporate it into our meals and desserts.\n\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a 9-inch pie dish with the pie crust, and place the pie dish onto a baking sheet.\nPlace zucchini into the work bowl of a food processor, and process until pureed. Transfer the puree to a bowl, and whisk with eggs, 1 cup white sugar, 1/2 cup melted butter, 2 tablespoons flour, and the vanilla extract. Pour the mixture into the pie crust.\nPlace 1/2 cup flour, brown sugar, and 3 tablespoons of butter into a bowl, and cut the mixture with a pastry cutter until the topping resembles coarse crumbs. Sprinkle the topping evenly over the pie filing.\nBake in the preheated oven until the filling is set and the topping is lightly browned, about 45 minutes. Allow to cool for at least 30 minutes before serving.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "999014.jpg",
    "o": "",
    "st": "allrecipes"
}