{
    "id": 215061,
    "old_rating": "4.54717",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup mayonnaise",
        "2 tablespoons real maple syrup",
        "1 tablespoon Dijon mustard",
        "canola oil",
        "1 onion, sliced",
        "1 Granny Smith apple - peeled, cored, and chopped",
        "1 pound ground chicken",
        "2 tablespoons real maple syrup",
        "1 teaspoon Italian seasoning",
        "1 egg",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper",
        "6 tablespoons canola oil, divided",
        "6 hamburger buns, split"
    ],
    "nut": [
        "Calories > 524 kcal",
        "Carbs > 38.3 g",
        "Cholesterol > 81 mg",
        "Fat > 31.4 g",
        "Protein > 22.3 g",
        "Sodium > 604 mg"
    ],
    "n": "Maple Apple Chicken Burgers",
    "a": "tamiwaski",
    "r": "0",
    "s": 6,
    "des": "\"Chicken burgers topped with grilled Granny Smith apples and onions.  Topped with a sauce similar to a mild honey mustard, but using real maple syrup instead of honey.  We use the Burger or Hot Dog Buns recipe from this site to make our own burger buns, but you could substitute a potato hamburger bun from the grocery store.\"",
    "ins": "Make the 'secret sauce'  by whisking the mayonnaise, 2 tablespoons maple syrup, and the Dijon mustard together in a small bowl; set aside.\nHeat 2 tablespoons canola oil in a skillet over medium heat; cook and stir the onion and about half the chopped apple in the hot oil until soft, 7 to 10 minutes. Set aside.\nMix the remaining uncooked apple, the ground chicken, 2 tablespoons maple syrup, Italian seasoning, egg, salt, and pepper together in bowl. Shape the burger mixture into 6 balls; the mixture will be loose, but that is okay.\nHeat 1 tablespoon canola oil in a large skillet over medium heat. Place one of the balls into the hot oil and flatten with the back of spoon to create a patty. Cook until slightly brown on one side and then flip and cook the other side until cooked through, 5 to 7 minutes per side; repeat for each portion.\nTo assemble, place the chicken burgers on buns; top with the grilled apple and onions. Pour some secret sauce over the top of each burger. More secret sauce can be served on the side if desired.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "4466803.jpg",
    "o": "",
    "st": "allrecipes"
}