{
    "id": 215076,
    "old_rating": "4.62322",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup rinsed quinoa",
        "2 cups chicken broth",
        "2 tablespoons extra-virgin olive oil",
        "2 garlic scapes, chopped",
        "1 small onion, chopped",
        "2 skinless, boneless chicken breast halves - cut into strips",
        "2 tablespoons extra-virgin olive oil",
        "1 zucchini, diced",
        "1 tomato, diced",
        "4 ounces crumbled feta cheese",
        "8 fresh basil leaves",
        "1 tablespoon lime juice"
    ],
    "nut": [
        "Calories > 453 kcal",
        "Carbs > 35.3 g",
        "Cholesterol > 61 mg",
        "Fat > 23.8 g",
        "Protein > 23.8 g",
        "Sodium > 841 mg"
    ],
    "n": "Chicken with Quinoa and Veggies",
    "a": "kmo1070",
    "r": "0",
    "s": 4,
    "des": "\"A quick recipe that can be adjusted to include whatever vegetables you have on hand.  It could probably be done well with shrimp also. You could easily try different vegetables.  The times and amounts are variable depending upon how thick you slice your chicken and veggies, as well as how crisp you prefer the zucchini.\"",
    "ins": "Bring the quinoa and chicken broth to a boil in a saucepan; reduce heat to a simmer and cover the pan. Simmer until the broth is absorbed, the quinoa is fluffy, and the white line is visible in the grain, about 12 minutes.\nHeat 2 tablespoons of olive oil in a skillet; cook and stir the garlic scapes and onion until onion is translucent, about 5 minutes. Stir in the chicken breast strips and cook until the chicken is still slightly pink in the middle, about 5 more minutes. Remove the chicken meat and set aside. Pour 2 more tablespoons of olive oil in the skillet and cook and stir the zucchini and tomato until the zucchini is tender, 5 to 8 minutes. Return chicken to skillet and sprinkle with feta cheese, basil leaves, and lime juice. Cook until the chicken is fully cooked and hot, about 10 more minutes. Serve over hot quinoa.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "3787822.jpg",
    "o": "3787822.jpg,3787816.jpg,3552252.jpg,3484074.jpg,3484015.jpg,3373820.jpg",
    "st": "allrecipes"
}