{
    "id": 215095,
    "old_rating": "4.67925",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup extra-virgin olive oil",
        "1 clove garlic, minced",
        "2 teaspoons dried basil",
        "2 teaspoons ground black pepper",
        "1 teaspoon salt",
        "4 tilapia fillets",
        "2/3 cup chopped mango",
        "2 tablespoons lime juice",
        "2 tablespoons orange juice",
        "4 teaspoons minced jalapeno pepper",
        "4 teaspoons minced red onion",
        "2 teaspoons minced red bell pepper",
        "2 teaspoons minced green bell pepper",
        "1 teaspoon dried parsley",
        "1 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 397 kcal",
        "Carbs > 8.3 g",
        "Cholesterol > 41 mg",
        "Fat > 29.7 g",
        "Protein > 23.6 g",
        "Sodium > 634 mg"
    ],
    "n": "Grilled Tilapia and Mango Salsa",
    "a": "Ainsley_",
    "r": "0",
    "s": 4,
    "des": "\"This is my boyfriend's absolute favourite meal. It is very easy to prepare, and goes great on top of lemon basmati rice. I like to present it by placing the tilapia on top of lemon basmati rice, with the mango salsa spread over top of the fish.\"",
    "ins": "Stir the olive oil, garlic, basil, black pepper, and salt together in a bowl. Put the tilapia fillets in a resealable plastic bag; pour the olive oil mixture over the fillets and seal the bag. Marinate in refrigerator for 1 hour.\nMake the salsa by stirring the mango, lime juice, orange juice, jalapeno pepper, red onion, red bell pepper, green bell pepper, parsley, and black pepper together in a bowl. Refrigerate for 1 hour to allow the flavors to blend.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nRemove the tilapia from the marinade, shaking off any excess oil, and wrap each fillet in a piece of aluminum foil.\nCook the tilapia on the preheated grill until the flesh easily with a fork, 3 to 4 minutes per side. Spoon the salsa over the tilapia to serve.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "601999.jpg",
    "o": "4507668.jpg,4011047.jpg,2458446.jpg,693676.jpg,693193.jpg,677195.jpg",
    "st": "allrecipes"
}