{
    "id": 215011,
    "old_rating": "4.55814",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2/3 cup raisins",
        "1 cup hot water",
        "3 1/4 cups all-purpose flour",
        "3 tablespoons white sugar",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "3/4 cup cold butter, cut into pieces",
        "1 cup milk",
        "1 egg",
        "1 tablespoon water"
    ],
    "nut": [
        "Calories > 416 kcal",
        "Carbs > 55 g",
        "Cholesterol > 69 mg",
        "Fat > 19 g",
        "Protein > 7.5 g",
        "Sodium > 474 mg"
    ],
    "n": "Raisin Tea Biscuits",
    "a": "What's for dinner, mom?",
    "r": "0",
    "s": 8,
    "des": "\"Moist, lightly sweet biscuits are just perfect for breakfast or a cup of tea in the afternoon.  This is as close as I could get to the store bakery version. My husband and kids loved these just as much as the store bought biscuits.  We make a lactose free version with vanilla soy milk  and margarine, but have made the milk variety for others.  Recipe works perfectly in both options.\"",
    "ins": "Preheat an oven to 375 degrees F (190 degrees C). Soak raisins in water for 10 minutes; drain and set aside. Line a baking sheet with parchment paper.\nWhisk together the flour, sugar, baking powder, and salt in a mixing bowl. Cut in the butter with a knife or pastry cutter until the mixture resembles coarse crumbs. Stir milk into the flour mixture until moistened. Add the drained raisins. Turn the dough out onto a lightly floured surface and pat or roll the dough out into a 3/4 to 1-inch thick round. Cut dough with a biscuit cutter and place onto the prepared baking sheet. Beat the egg with 1 tablespoon water in a small bowl. Brush egg mixture on each biscuit.\nBake in the preheated oven until golden brown, about 15 minutes.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "434381.jpg",
    "o": "4526082.jpg,4477040.jpg,4468467.jpg,4461522.jpg,4154434.jpg,2898805.jpg",
    "st": "allrecipes"
}