{
    "id": 21505,
    "old_rating": "4.26087",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 red bell pepper, cut into 1 inch pieces",
        "1 yellow bell pepper, cut into 1 inch pieces",
        "1 green bell pepper, cut into 1 inch pieces",
        "2 tablespoons olive oil",
        "2 cloves garlic, minced",
        "1 (14.5 ounce) can peeled and diced tomatoes",
        "1 (10 ounce) can diced tomatoes with green chile peppers",
        "1 pound angel hair pasta",
        "2 tablespoons butter",
        "2 tablespoons olive oil",
        "4 skinless, boneless chicken breast halves - cut into bite size pieces",
        "1/2 teaspoon dried basil",
        "1/2 teaspoon dried rosemary",
        "1/2 teaspoon dried thyme",
        "1/2 teaspoon garlic powder",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 469 kcal",
        "Carbs > 49.9 g",
        "Cholesterol > 59 mg",
        "Fat > 17 g",
        "Protein > 29.1 g",
        "Sodium > 578 mg"
    ],
    "n": "Chicken Pasta Primavera",
    "a": "Joy",
    "r": "0",
    "s": 6,
    "des": "\"A wonderful dish with lots of herbs and your favorite pasta.  Serve with garlic bread sticks.\"",
    "ins": "In a large skillet over medium heat, cook red, yellow and green bell peppers in 2 tablespoons olive oil with garlic until just tender.  Stir in diced tomatoes and diced tomatoes with chiles, reduce heat to medium-low and simmer 10 minutes.  Remove to a serving bowl.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nWhile pasta is cooking, heat 2 tablespoons oil and butter over medium heat in a large skillet.  Cook chicken in butter mixture until juices run clear, 5 to 10 minutes.  Place cooked chicken over tomato sauce and sprinkle with basil, rosemary, thyme, garlic powder and Parmesan.  Serve with cooked pasta.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "39212.jpg",
    "o": "3657076.jpg,2453311.jpg,2453190.jpg,2132479.jpg,1583661.jpg,1124061.jpg",
    "st": "allrecipes"
}