{
    "id": 215116,
    "old_rating": "3.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup white wine vinegar",
        "1/4 cup white sugar",
        "3 1/2 cups fresh apricots, pitted and halved",
        "1 (14 ounce) can coconut milk",
        "1/2 cup chopped onion",
        "1 teaspoon minced garlic",
        "1 tablespoon cayenne pepper hot sauce",
        "1 tablespoon Worcestershire sauce",
        "1/4 teaspoon ground cinnamon",
        "1 teaspoon red curry paste (such as Thai KitchenÂ®)",
        "1/2 (10 ounce) jar mild curry paste (such as Patak'sÂ®)",
        "1/2 cup flaked coconut",
        "4 skinless, boneless chicken breast halves"
    ],
    "nut": [
        "Calories > 540 kcal",
        "Carbs > 41.1 g",
        "Cholesterol > 61 mg",
        "Fat > 32.1 g",
        "Protein > 28.3 g",
        "Sodium > 859 mg"
    ],
    "n": "Apricot Curry Chicken",
    "a": "MJWoodsPhx",
    "r": "0",
    "s": 4,
    "des": "\"A wonderful curry dish made from a base of fresh apricots. Not too spicy, not too mild. Serve over hot cooked jasmine or Basmati rice.\"",
    "ins": "Combine the white wine vinegar, sugar, apricots, coconut milk, onion, garlic, hot pepper sauce, Worcestershire sauce, cinnamon, red curry paste, mild curry paste, and coconut into a saucepan over medium heat; bring to a boil, stirring constantly. Reduce heat to a simmer and cook until the onion is translucent and the apricots are soft, about 10 minutes.\nPour the mixture into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the sauce moving before leaving it on to puree. Puree in batches until smooth. Pour the blended sauce back into the saucepan, and bring to a simmer over medium-low heat.  (You can also use a stick blender and puree the sauce right in the cooking pot.)\nStir the chicken meat into the simmering sauce and cook, stirring occasionally, until the chicken is cooked through and the sauce has thickened, 20 to 30 minutes.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}