{
    "id": 215275,
    "old_rating": "3.89474",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 butternut squash - peeled, seeded, and cut into 2-inch cubes",
        "1/2 cup natural peanut butter",
        "1 small tomato, chopped",
        "1 cup warm water",
        "2 tablespoons olive oil",
        "1 large yellow onion, thickly sliced lengthwise",
        "2 cloves garlic, minced",
        "1 bay leaf",
        "ground black pepper to taste",
        "salt, or to taste",
        "2 teaspoons lemon juice"
    ],
    "nut": [
        "Calories > 396 kcal",
        "Carbs > 42.4 g",
        "Cholesterol > 0 mg",
        "Fat > 24 g",
        "Protein > 11.4 g",
        "Sodium > 391 mg"
    ],
    "n": "Guinean Peanut Sauce with Butternut Squash",
    "a": "Anne-Marie",
    "r": "0",
    "s": 4,
    "des": "\"This peanut butter and butternut squash recipe is from the village of Cansamange in Guinea-Bissau, West Africa. I learned it while I was in the Peace Corps; it quickly became my favorite dish! The authentic West African preparation requires squishing this by hand until the mixture is fairly uniform - a food processor also works. Serve over medium-grained rice. Okra sauce (folere) is a traditional accompaniment.\"",
    "ins": "Place the butternut squash in a saucepan with water to cover. Bring to a boil and then simmer, covered, until the squash is tender, about 20 minutes. Drain, reserving the cooking liquid.\nCombine the peanut butter, tomato, and warm water in a bowl. The authentic way to prepare this is to squish it together by hand -- but a food processor works, too.\nHeat the olive oil in a skillet over medium-high heat. When the oil is hot, add the onion slices and cook for 2 minutes. Add the peanut butter mixture, the minced garlic, the bay leaf, black pepper, and about 1/2 teaspoon salt. Stir to combine, then bring to a boil.\nReduce the heat to low and simmer the peanut sauce, adding the reserved cooking liquid as needed, for 15 minutes. The consistency should be similar to a thick soup.\nStir in the butternut squash and simmer for an additional 15 minutes. Add the lemon juice, and taste to adjust the seasoning.",
    "pt": "25 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "592888.jpg",
    "o": "",
    "st": "allrecipes"
}