{
    "id": 215284,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups water",
        "1 cup whole wheat couscous",
        "1 (6 ounce) can skinless, boneless salmon, drained and flaked",
        "1 large cucumber, chopped",
        "2 stalks celery, chopped",
        "1 tomato, chopped",
        "1 teaspoon dried dill weed",
        "1 teaspoon chopped fresh parsley",
        "salt, to taste",
        "freshly ground black pepper to taste",
        "1 tablespoon lemon poppy seed dressing",
        "3 tablespoons extra-virgin olive oil, or to taste",
        "1 tablespoon distilled white vinegar, or to taste"
    ],
    "nut": [
        "Calories > 411 kcal",
        "Carbs > 50.7 g",
        "Cholesterol > 20 mg",
        "Fat > 15.9 g",
        "Protein > 18.9 g",
        "Sodium > 298 mg"
    ],
    "n": "Salmon Cucumber Couscous Salad",
    "a": "cmw6v8",
    "r": "0",
    "s": 4,
    "des": "\"I made this when I needed to clean out my pantry and use up our crop of cucumbers. This salad is light, fresh, and fast. You can add in whatever fresh vegetables you have on hand, and experiment with herbs and dressings. I didn't have any lemons on hand but I had a lemon poppy seed dressing which was too thick for this salad, so I thinned it into a vinaigrette with olive oil and vinegar. I served this with a hard-boiled egg on the side for an extra protein kick.\"",
    "ins": "Bring the water to a boil in a saucepan over high heat. Remove from the heat, and stir in the couscous. Cover, and let stand for 3 to 5 minutes, then fluff with a fork. Rinse couscous with cold water in a colander set in the sink. Once cooled, pour couscous into a large bowl. Add salmon, cucumber, celery, tomato, dill weed, parsley, salt, and pepper.\nWhisk together lemon poppy seed dressing, olive oil, and vinegar in a small bowl. Pour dressing over salad, and toss to coat.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "487094.jpg",
    "o": "",
    "st": "allrecipes"
}