{
    "id": 215280,
    "old_rating": "4.54545",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups water",
        "salt",
        "1 1/4 cups dry lentils",
        "2 large cloves garlic, minced",
        "2 large roma (plum) tomatoes, seeded and chopped",
        "1/2 cup chopped red onion",
        "1/2 cup chopped green bell pepper",
        "1 small green chile pepper, seeded and chopped",
        "1 lemon, juiced",
        "1 teaspoon lemon zest",
        "1 small carrot, shredded",
        "1/2 cup oil-cured black olives",
        "1/4 cup chopped fresh cilantro",
        "salt and ground black pepper to taste",
        "1/4 cup extra-virgin olive oil",
        "2 hard-cooked eggs, cut in half lengthwise"
    ],
    "nut": [
        "Calories > 431 kcal",
        "Carbs > 44.8 g",
        "Cholesterol > 106 mg",
        "Fat > 19.4 g",
        "Protein > 19.9 g",
        "Sodium > 344 mg"
    ],
    "n": "Refreshing Lentil Salad",
    "a": "TUNISIANSWIFE",
    "r": "0",
    "s": 4,
    "des": "\"I tried to duplicate this light, refreshing salad that my Tunisian in-laws make. I put my own 'twist' on this with the addition of lemon zest. Using colorful vegetables makes for a light salad with a beautiful presentation. Garnish with sliced hard-boiled eggs and serve with crusty baguettes.\"",
    "ins": "Bring the water and salt to a boil in a saucepan over high heat. Pour the lentils into the water while stirring constantly. Reduce heat to low, cover, and simmer until the lentils are tender but still hold their shape, about 30 minutes. Drain well.\nTransfer the lentils to a mixing bowl and stir in the garlic, seeded tomatoes, red onion, green bell pepper, and chile pepper. Add the juice of 1 lemon plus 1 teaspoon of the zest. Mix in the shredded carrot, olives, and cilantro.\nSeason with salt and black pepper, and drizzle with olive oil; mix well. Refrigerate for at least an hour to allow the flavors to blend.\nBefore serving, mix the salad again and add more lemon juice or olive oil if needed. Transfer to a serving dish and garnish with sliced eggs.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "691198.jpg",
    "o": "",
    "st": "allrecipes"
}