{
    "id": 215386,
    "old_rating": "4.67568",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 skinless, boneless chicken breast half",
        "1/2 cup couscous",
        "1/2 cup water",
        "1 tablespoon unsalted butter",
        "1 pinch salt",
        "1 tablespoon salted butter",
        "1/4 cup capers, drained",
        "3 dates, pitted and chopped",
        "1/4 cup mascarpone cheese",
        "1/4 cup heavy cream",
        "salt and ground black pepper to taste (optional)",
        "1 date, pitted and chopped",
        "1/4 cucumber, diced",
        "1/2 tomato, diced",
        "1 teaspoon lemon juice (optional)"
    ],
    "nut": [
        "Calories > 616 kcal",
        "Carbs > 50.6 g",
        "Cholesterol > 140 mg",
        "Fat > 37.5 g",
        "Protein > 21.9 g",
        "Sodium > 616 mg"
    ],
    "n": "Chicken Breasts in a Date, Caper, and Mascarpone Sauce with Couscous",
    "a": "Wickedchef",
    "r": "0",
    "s": 2,
    "des": "\"A recipe I created for one of the leading hotels of the world. It includes a marvel of flavors, and is a nice approach to an Arabian fusion cuisine. I am sure you will enjoy this...\"",
    "ins": "Preheat an outdoor grill for medium heat, and lightly oil the grate.\nGrill the chicken breast until the meat is no longer pink inside and shows well-defined grill marks, 5 to 8 minutes per side. Cut the chicken breast in half, and set aside.\nBring the water, unsalted butter, and a pinch of salt to a boil in a saucepan over high heat. Remove from the heat, and stir in the couscous. Cover and let stand for 10 minutes, then fluff with a fork.\nMelt the salted butter in a skillet over medium heat, and gently stir in the capers and 3 dates. Stir a few times to heat the capers and dates, then stir in the mascarpone cheese and cream, stirring until the cheese and cream have melted together. Allow the mixture to simmer for about 3 minutes to reduce slightly, then season to taste with salt and pepper.\nPlace the couscous on a serving platter, and sprinkle with a chopped date. Arrange the 2 pieces of chicken breast onto the couscous, and cover with the mascarpone sauce. Sprinkle the dish with diced cucumber and tomato, and drizzle lemon juice over the top to serve.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "2140515.jpg",
    "o": "",
    "st": "allrecipes"
}