{
    "id": 215322,
    "old_rating": "4.7",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups unsalted butter",
        "1 pound portobello mushrooms, wiped clean with paper towels",
        "2 pounds whole white mushrooms, wiped clean with paper towels",
        "1 cup all-purpose flour",
        "4 (14.5 ounce) cans chicken broth",
        "1 1/2 cups turkey pan drippings",
        "2 cups chopped onions",
        "1 cup chopped celery",
        "salt and pepper to taste",
        "1/4 teaspoon cayenne pepper"
    ],
    "nut": [
        "Calories > 347 kcal",
        "Carbs > 9.1 g",
        "Cholesterol > 64 mg",
        "Fat > 34 g",
        "Protein > 3 g",
        "Sodium > 31 mg"
    ],
    "n": "Turkey Mushroom Gravy",
    "a": "ranch_maven",
    "r": "0",
    "s": 20,
    "des": "\"I have been making Thanksgiving dinner every year since the 1970's. I have tried every kind of turkey gravy.  I created this recipe about 15 years ago. It is everyone's favorite, even the people who hate mushrooms. Serve with roasted turkey and cornbread stuffing!\"",
    "ins": "Melt butter in a large stock pot over medium-low heat, and cook the mushrooms until they are browned and the butter is clear, 1 to 1 1/2 hours. Remove the mushrooms, coarsely chop them, and set aside. There should be about 1 cup of butter left in the stock pot; whisk the flour into the butter, and gently cook over low heat until the flour mixture turns mahogany brown in color, about 20 minutes. Whisk in the chicken broth; bring the mixture to a simmer to thicken the stock.\nPour the turkey drippings into a saucepan, then cook and stir the onions and celery in the drippings over medium-low heat until the onions begin to turn brown, about 20 minutes. Stir the drippings and vegetables into the thickened stock. Bring the gravy to a gentle boil, reduce heat, and simmer for about 20 minutes to blend the flavors. Stir in the chopped mushrooms, then season to taste with salt, black pepper, and cayenne pepper.",
    "pt": "30 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "4199653.jpg",
    "o": "",
    "st": "allrecipes"
}