{
    "id": 215334,
    "old_rating": "3.85714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "For Topping:",
        "8 Sister Schubert Parker House Rolls, defrosted and broken into crumbs",
        "1/2 cup chopped walnuts, hazelnuts or pecans",
        "3/4 cup brown sugar",
        "1 1/4 teaspoons ground cinnamon",
        "3 tablespoons unsalted butter, softened and cut into bits",
        "For Filling:",
        "8 large assorted apples, peeled, cored and sliced",
        "1/3 cup sugar",
        "1/2 teaspoon ground cinnamon",
        "3 tablespoons all-purpose flour",
        "2 teaspoons lemon zest",
        "1/4 cup apple cider",
        "2 tablespoons unsalted butter, cut into bits",
        "Marzetti Caramel Apple Dip",
        "Vanilla, cinnamon or salted caramel ice cream"
    ],
    "nut": [
        "Calories > 398 kcal",
        "Carbs > 63.2 g",
        "Cholesterol > 36 mg",
        "Fat > 16 g",
        "Protein > 4 g",
        "Sodium > 159 mg"
    ],
    "n": "Sister Schubert'sÂ® Caramel Apple Crisp",
    "a": "Marzetti",
    "r": "0",
    "s": 10,
    "des": "\"Sliced assorted apples and spices are topped with crumbled Parker House rolls, nuts and more spices in this delicious crisp. Drizzle with caramel apple dip and top with ice cream while it's still warm from the oven.\"",
    "ins": "Preheat oven to 350 degrees F. Butter a 9 x 13-inch baking dish\nFor topping, combine Sister Schubert Parker House Rolls with all remaining ingredients in a medium bowl. Cut butter into ingredients to create a crumble topping.\nFor filling, combine apples, sugar, cinnamon, flour, zest and cider and toss well to coat apple slices. Transfer apple mixture to prepared pan. Dot top of apple filling with butter. Cover apples with topping. Bake uncovered 40 to 45 minutes or until topping is light golden brown. Cool slightly and drizzle top of crisp with warm Marzetti Carmel Apple Dip and serve with ice cream.\nCrisp can also be prepared in individual ramekins; baking times may vary depending upon the size of the baking dishes.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "983802.jpg",
    "o": "",
    "st": "allrecipes"
}