{
    "id": 215493,
    "old_rating": "4.65421",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 eggs",
        "2 cups white sugar",
        "1 cup vegetable oil",
        "1 tablespoon vanilla extract",
        "2 cups grated zucchini",
        "2 cups all-purpose flour",
        "1 1/2 teaspoons ground cinnamon",
        "1 teaspoon baking soda",
        "1/4 teaspoon baking powder",
        "1 teaspoon salt",
        "1/2 cup chopped walnuts (optional)"
    ],
    "nut": [
        "Calories > 318 kcal",
        "Carbs > 38.3 g",
        "Cholesterol > 35 mg",
        "Fat > 17.2 g",
        "Protein > 3.5 g",
        "Sodium > 247 mg"
    ],
    "n": "Caley's Classic Zucchini Bread",
    "a": "mouse1493",
    "r": "0",
    "s": 16,
    "des": "\"A sweet cinnamon-y zucchini bread that makes use of all the leftover zucchini from my family's garden. My whole family loves this bread and begs me to make it as soon as the zucchinis are harvested! Pecans can be used in place of walnuts if preferred.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Prepare 2 8x4-inch loaf pans with cooking spray.\nBeat the eggs in a mixing bowl with an electric mixer until frothy. Slowly add the sugar while continually beating. Stir the vegetable oil and vanilla into the egg mixture; continue beating until the mixture is thick. Add the zucchini to the mixture and stir.\nMix the flour, cinnamon, baking soda, baking powder, and salt together in a separate bowl; pour into the wet mixture and stir until just combined. Add the chopped walnuts and stir. Divide the batter between the two prepared loaf pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool in the pans for 10 minutes before loosening the edges with a knife and removing to cool completely on a wire rack.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "687760.jpg",
    "o": "4536268.jpg,3999020.jpg,3880953.jpg,3865675.jpg,3861877.jpg,3649565.jpg",
    "st": "allrecipes"
}