{
    "id": 215420,
    "old_rating": "4.70213",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "4 zucchini, sliced",
        "1 large clove garlic, crushed",
        "4 ounces thinly sliced mozzarella cheese",
        "4 large tomatoes, peeled and sliced",
        "1/4 cup grated Parmesan cheese",
        "1 tablespoon chopped fresh basil",
        "salt and freshly ground black pepper"
    ],
    "nut": [
        "Calories > 412 kcal",
        "Carbs > 24.9 g",
        "Cholesterol > 43 mg",
        "Fat > 26.4 g",
        "Protein > 23.8 g",
        "Sodium > 563 mg"
    ],
    "n": "Zucchini e Pomodori Gratinati (Zucchini and Tomato Gratin)",
    "a": "Swiss Phil",
    "r": "0",
    "s": 2,
    "des": "\"A quick and easy vegetarian dish for two, or a starter for 4, or even a side. A rustic Italian favorite, taught me by my Roman friends. If serving as a main, then crusty bread, torn off the loaf by hand, and a green salad with a lemon and/or lime vinaigrettey dressing cannot be bettered.\n\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Move oven rack into the top third of the oven.\nHeat the olive oil in a large skillet over medium heat, and spread the zucchini slices into the skillet in a single layer. If they don't fit, cook them in batches. Sprinkle pieces of garlic over the zucchini, and cook until the zucchini are golden brown on both sides, about 8 minutes per side. Remove from heat.\nArrange the slices of zucchini in an 9x12-inch glass baking dish, alternating with slices of mozzarella cheese and tomato, so that the slices overlap each other in a neat row pattern. Sprinkle the Parmesan cheese and basil over the dish, and season to taste with salt and pepper.\nBake in the preheated oven until the cheese is melted and brown and the dish is bubbling, about 30 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "1460019.jpg",
    "o": "1427696.jpg,1360237.jpg,887565.jpg,885725.jpg,855458.jpg,834314.jpg",
    "st": "allrecipes"
}