{
    "id": 215478,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 red bell peppers",
        "1 pound bulk chorizo sausage",
        "1 (16 ounce) loaf French bread, cubed",
        "1 white onion, chopped",
        "6 stalks celery, chopped",
        "1 cup dried cranberries",
        "1 tablespoon minced garlic",
        "1 tablespoon chopped fresh parsley",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped fresh rosemary",
        "2 tablespoons poultry seasoning",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1/2 cup chicken broth"
    ],
    "nut": [
        "Calories > 249 kcal",
        "Carbs > 26 g",
        "Cholesterol > 25 mg",
        "Fat > 11.5 g",
        "Protein > 10.7 g",
        "Sodium > 694 mg"
    ],
    "n": "Roasted Red Pepper and Sausage Stuffing",
    "a": "Kristina",
    "r": "0",
    "s": 16,
    "des": "\"A twist on traditional turkey stuffing, with a mix of fresh and flavorful ingredients like roasted red peppers, garlic, rosemary, and chorizo sausage, this recipe will leave your taste buds tickling and wanting more.\"",
    "ins": "Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source.\nLine a baking sheet with aluminum foil. Cut the peppers in half from top to bottom; remove the stem, seeds, and ribs, then place the peppers cut-side-down onto the prepared baking sheet.\nCook under the preheated broiler until the skin of the peppers has blackened and blistered, about 15 minutes. Place the blackened peppers into a bowl, and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 20 minutes. Once cool, remove the skins and discard.\nReduce the oven temperature to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.\nMeanwhile, heat a large skillet over medium-high heat and stir in the sausage. Cook and stir until the sausage is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease, then pour into a large mixing bowl, and allow to cool.\nChop the roasted peppers, and place them in the bowl with the sausage along with the bread cubes, onion, celery, cranberries, garlic, parsley, thyme, rosemary, poultry seasoning, salt, and black pepper. Pour the chicken broth overtop, and stir until evenly blended. Pack the stuffing into the prepared baking dish.\nBake in the preheated oven until the stuffing is golden brown and crispy on top, about 30 minutes.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "601747.jpg",
    "o": "",
    "st": "allrecipes"
}