{
    "id": 215441,
    "old_rating": "4.56667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 cup vegetable shortening",
        "1/4 cup water, or as needed",
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 teaspoon rubbed sage",
        "1 cup chicken broth",
        "1 cup evaporated milk",
        "4 cups cooked turkey, cut into bite-size pieces",
        "2 (15 ounce) cans mixed vegetables (such as Veg-AllÂ®), drained "
    ],
    "nut": [
        "Calories > 463 kcal",
        "Carbs > 31.7 g",
        "Cholesterol > 78 mg",
        "Fat > 25 g",
        "Protein > 27.1 g",
        "Sodium > 795 mg"
    ],
    "n": "Kae's Turkey Pot Pie",
    "a": "Kae Hiles",
    "r": "0",
    "s": 8,
    "des": "\"This recipe is incredible, even down to the best crust ever. This is great for the turkey leftovers after the holidays or you can even use chicken.  It's a yummy pie. Hope you enjoy!!\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Whisk together 1 1/2 cups of flour and 1/2 teaspoon of salt in a bowl.\nWith a fork or pastry cutter, cut the shortening into the flour mixture until it becomes crumbly, then stir in water, a tablespoon at a time, just until the dough holds together. Divide dough in half; roll out each half with a rolling pin on a floured surface to make an 11-inch circle. Fit one crust into a 10-inch pie dish; place the other crust on a baking sheet or piece of parchment paper, and set aside.\nMelt butter in a large pot over medium heat. Combine 1/4 cup flour, 1 teaspoon of salt, black pepper, and sage in a small bowl until thoroughly mixed; stir the flour mixture into the melted butter until the mixture forms a smooth paste. Allow the mixture to bubble for about 1 minute, then stir in the chicken broth and evaporated milk. Bring the mixture to a boil, and whisk until thick, about 2 minutes. Remove the sauce from the heat; stir in the cooked turkey meat and mixed vegetables. Spoon the filling into the prepared pie dish. Top the pie with the remaining crust, then pinch and fold together the edges of the crusts to seal. Cut an X into the center of the top crust with a sharp knife.\nBake in the preheated oven until the crust is browned and the filling is bubbling, 35 to 40 minutes. Let stand 10 minutes before serving.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "780066.jpg",
    "o": "",
    "st": "allrecipes"
}