{
    "id": 215476,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground buffalo meat",
        "1 cup water",
        "1 (1 ounce) package taco seasoning mix",
        "1 1/2 (8 ounce) packages cream cheese",
        "1/4 cup water",
        "1 (8 ounce) jar medium salsa (such as Tostito'sÂ®)",
        "1 pound extra sharp Cheddar cheese, grated"
    ],
    "nut": [
        "Calories > 221 kcal",
        "Carbs > 3 g",
        "Cholesterol > 64 mg",
        "Fat > 17.1 g",
        "Protein > 13.6 g",
        "Sodium > 462 mg"
    ],
    "n": "Erin's Year Round Party Dip",
    "a": "Erin Eckenrode",
    "r": "0",
    "s": 16,
    "des": "\"Just change the name and bring this dish along to the next party, and you are guaranteed to be getting noticed. This taco dip is simple and lasting. Make a day or two before and just heat it up 15 minutes before serving. Be prepared for compliments!!! Serve with tortilla chips.\"",
    "ins": "Heat a large skillet over medium-high heat. Cook and stir the ground buffalo until the meat is crumbly, evenly browned, and no longer pink, about 5 minutes. Stir in 1 cup water and taco seasoning. Reduce heat to low and simmer until reduced, about 10 minutes. Remove from heat and set aside.\nPreheat an oven to 350 degrees F (175 degrees C).\nPlace the cream cheese and 1/4 cup water in a microwave-safe glass or ceramic bowl; heat in the microwave, stirring occasionally, until softened and easily spread, 1 to 2 minutes.\nSpread the cooled buffalo meat on the bottom of a 9-inch round cake pan or baking dish, then spread the cream cheese mixture over the meat.  Pour the salsa in an even layer over the cream cheese, and top with the Cheddar cheese.\nBake in the preheated oven until the cheese melts and is bubbly, about 15 minutes.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "45 m",
    "i": "846530.jpg",
    "o": "",
    "st": "allrecipes"
}