{
    "id": 215458,
    "old_rating": "4.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1 cup chilled solid vegetable shortening",
        "6 tablespoons ice water, or as needed",
        "3 cups cubed cooked turkey",
        "1/2 small onion, chopped",
        "1 (10.75 ounce) can cream of potato soup",
        "1 (10.75 ounce) can cream of chicken soup",
        "1/2 (10.75 ounce) can water",
        "2 (15 ounce) cans mixed vegetables, drained",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 559 kcal",
        "Carbs > 45 g",
        "Cholesterol > 44 mg",
        "Fat > 31.7 g",
        "Protein > 22.5 g",
        "Sodium > 912 mg"
    ],
    "n": "Grandma's Leftover Turkey Pot Pie",
    "a": "Laura Adams",
    "r": "0",
    "s": 8,
    "des": "\"Easy recipe for a warm winter meal. This recipe makes enough to fill a 10-inch cast iron pan just like my Grandma used to do.\"",
    "ins": "Whisk together the flour and 1/2 teaspoon of salt in a bowl. Cut the shortening into the flour mixture with a pastry cutter until the mixture looks like coarse crumbs. Drizzle the ice water, about 1 tablespoon at a time, over the mixture and gently work the water into the dough with your fingers. Add more water as needed until you can gather the dough together in a ball. Wrap the dough in plastic wrap and refrigerate for 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nIn a saucepan, mix together the turkey, onion, cream of potato soup, cream of chicken soup, water, and mixed vegetables. Bring the mixture to a boil; reduce heat and allow to simmer while you prepare the crust.\nCut the dough in almost equal halves. Roll the larger piece into a circle on a floured work surface and fit into a 10-inch cast-iron skillet. Roll out the smaller piece into a circle to fit the top. Pour the hot turkey filling into the bottom crust. Place top crust over the filling, crimp the two crusts together with a fork, and cut several slits in the top with a sharp knife.\nBake in the preheated oven until the crust is golden brown, about 45 minutes.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "1893796.jpg",
    "o": "",
    "st": "allrecipes"
}