{
    "id": 215565,
    "old_rating": "4.65145",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/3 cup all-purpose flour",
        "1 teaspoon Spanish smoked paprika",
        "1/2 teaspoon seasoned salt",
        "1/2 teaspoon ground black pepper",
        "2 pounds beef chuck, cut into 1-inch cubes",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "1 (8 ounce) package mushrooms, chopped",
        "3 potatoes, diced",
        "5 carrots, sliced",
        "2 stalks celery, chopped",
        "2 cloves garlic, minced",
        "1/4 cup Marsala wine",
        "1 tablespoon Worcestershire sauce",
        "3 (10.5 ounce) cans organic beef broth",
        "1 (14.5 ounce) can crushed tomatoes",
        "1 (1 ounce) package dry onion soup mix",
        "1 teaspoon Spanish smoked paprika, or to taste",
        "salt and ground black pepper to taste",
        "2 tablespoons cornstarch (optional)",
        "2 tablespoons water (optional)"
    ],
    "nut": [
        "Calories > 467 kcal",
        "Carbs > 43.8 g",
        "Cholesterol > 69 mg",
        "Fat > 20.6 g",
        "Protein > 25.3 g",
        "Sodium > 1110 mg"
    ],
    "n": "Make-Ahead Slow Cooker Beef Stew",
    "a": "BusySpoons",
    "r": "0",
    "s": 6,
    "des": "\"Served with fresh bread and a salad, this hearty beef stew is a family favorite. It can be made fresh, browning the meat then tossing all the ingredients together in the slow cooker, or it can be prepared ahead of time for freezing and quick assembly for a quick crock pot meal when you need it! I like to make fresh stew, but double the ingredients and freeze the second portion for a quick dose of comfort food mid-week.\"",
    "ins": "Combine the flour, 1 teaspoon smoked paprika, seasoned salt, and 1/2 teaspoon black pepper in a large, resealable plastic bag. Add the beef, and seal the bag. Shake the bag thoroughly to coat the beef with seasoned flour.\nHeat the olive oil in a large skillet over medium-high heat. Shake the excess seasoning off the beef, then stir the beef into the hot skillet with the onion and mushrooms. Cook and stir until the beef is evenly browned and no longer pink. Drain and discard any excess grease.\nPlace the beef mixture into a slow cooker. Place the potatoes, carrots, celery, garlic, Marsala wine, and Worcestershire sauce into the cooker with the beef mixture. Pour the beef broth and tomatoes into the cooker, and stir in the onion soup mix and 1 more teaspoon of smoked paprika. Cook on High for 4 to 6 hours, or on Low for 10 to 12 hours. Season to taste with salt and black pepper.\nFor a thicker stew, combine cornstarch and water in a small bowl. Gradually stir the mixture into the stew until thickened.",
    "pt": "30 m",
    "ct": "4 h",
    "tt": "4 h ",
    "i": "4318501.jpg",
    "o": "4318501.jpg,4071675.jpg,3785996.jpg,3622518.jpg,3174462.jpg,3168550.jpg",
    "st": "allrecipes"
}