{
    "id": 215680,
    "old_rating": "4.41935",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound ground beef",
        "1 large zucchini, ends trimmed",
        "1/2 cup bread crumbs",
        "2 cloves garlic, minced",
        "1 (16 ounce) jar spaghetti sauce",
        "1/2 (6 ounce) can sliced black olives, drained",
        "1/2 cup grated Parmesan cheese",
        "1 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 405 kcal",
        "Carbs > 30.9 g",
        "Cholesterol > 63 mg",
        "Fat > 20.1 g",
        "Protein > 25.2 g",
        "Sodium > 1112 mg"
    ],
    "n": "Easy Stuffed Zucchini",
    "a": "cookkassi",
    "r": "0",
    "s": 4,
    "des": "\"Fresh out of the oven...zucchini packed full of meat, sauce and cheese makes a delicious dish!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nCook and stir the ground beef in a skillet over medium heat until the meat is browned, breaking the beef up into crumbles as it cooks, about 10 minutes. Drain off excess fat, and transfer the beef into a mixing bowl. Slice the zucchini in half the long way, and use a spoon to scoop out the flesh, leaving a 1/2-inch thick shell all around the zucchini. Chop the scooped-out zucchini flesh, and add to mixing bowl. Stir in the bread crumbs, garlic, spaghetti sauce, black olives, and Parmesan cheese; mix the stuffing well. Lightly stuff both halves of the zucchini with the meat mixture. Place the zucchini halves into a baking dish, and cover tightly with foil.\nBake in the preheated oven for 45 minutes, remove from oven, and remove the foil. Sprinkle 1/2 cup of shredded mozzarella cheese over each zucchini half. Move an oven rack to within 6 inches of the oven broiler's heat source, turn on the broiler, and broil the zucchini until the mozzarella cheese is browned and bubbling, about 5 minutes.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "996411.jpg",
    "o": "4525132.jpg,4471854.jpg,4048055.jpg,3860858.jpg,3786156.jpg,2553484.jpg",
    "st": "allrecipes"
}