{
    "id": 215664,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups water",
        "1 cup uncooked white rice",
        "2 tablespoons olive oil",
        "1 dried chourico sausage, halved lengthwise and cut into 1/4-inch slices",
        "1/4 Spanish onion, finely chopped",
        "3 cloves garlic, minced",
        "1 1/2 cups tomato sauce",
        "1/2 teaspoon red pepper flakes",
        "1 teaspoon Italian seasoning",
        "salt and pepper to taste",
        "1/2 (14.5 ounce) can fava beans, rinsed and drained"
    ],
    "nut": [
        "Calories > 722 kcal",
        "Carbs > 108.6 g",
        "Cholesterol > 21 mg",
        "Fat > 23.7 g",
        "Protein > 18.6 g",
        "Sodium > 1434 mg"
    ],
    "n": "Portuguese Chourico, Beans, and Rice",
    "a": "Raquel Teixeira",
    "r": "0",
    "s": 2,
    "des": "\"I grew up on chourico, and this dish is a Portuguese comfort food that my mom always made. I took it upon myself to replicate it with a bit more kick, but even with the changes, it reminds me of being a kid. It's such a warm and satisfying dish.\"",
    "ins": "Bring the water to a boil in a pot; stir the rice into the boiling water, reduce heat to low, place cover on the pot, and allow the rice to cook until all the moisture is absorbed, about 30 minutes.\nAs the rice cooks, heat the oil in a skillet over medium heat. Cook the chourico in the hot oil for 2 minutes. Add the onions and garlic to the sausage and continue cooking until the vegetables are soft and the chourico has browned, 5 to 7 minutes.\nStir the tomato sauce into the chourico mixture. Reduce heat to low. Season with the red pepper flakes, Italian seasoning, salt, and pepper; simmer until thoroughly heated, 10 to 15 minutes. Stir the fava beans into the mixture and continue cooking just long enough for the beans to heat, 2 to 3 minutes. Serve over rice.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "488708.jpg",
    "o": "",
    "st": "allrecipes"
}