{
    "id": 215699,
    "old_rating": "4.72222",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup fresh squeezed orange juice",
        "2 tablespoons lemon juice",
        "2 tablespoons lime juice",
        "1 teaspoon salt",
        "2 teaspoons ground black pepper",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped garlic",
        "1 tablespoon chopped fresh ginger",
        "1 habanero pepper, seeded and chopped (use gloves)",
        "1 tablespoon curry powder",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground cinnamon",
        "1/2 cup vegetable oil",
        "12 large chicken wings, tips removed and wings cut apart at joint"
    ],
    "nut": [
        "Calories > 373 kcal",
        "Carbs > 6.1 g",
        "Cholesterol > 31 mg",
        "Fat > 34.8 g",
        "Protein > 10.6 g",
        "Sodium > 614 mg"
    ],
    "n": "Jerk Grilled Chicken Wings",
    "a": "BencyCooks",
    "r": "0",
    "s": 4,
    "des": "\"Spicy, citrus, earthy, with the right amount of thyme. These wings should be a hit as long as your guests are brave enough to take some Caribbean heat. I like to serve this with a mango, cilantro, sour cream, mayonnaise, and buttermilk dipping sauce. \n\"",
    "ins": "Mix together the orange juice, lemon juice, lime juice, salt, black pepper, thyme, garlic, ginger, habanero pepper, curry powder, allspice, nutmeg, and cinnamon in a bowl. Whisk in the vegetable oil. Pour 3/4 of the marinade into a resealable plastic zipper bag, and place the chicken wing pieces into the bag. Squeeze out any air, and mix the wing pieces with the marinade, and refrigerate from 4 to 12 hours. Place the remaining 1/4 of the marinade in a small bowl, and refrigerate until grilling time.\nPreheat an outdoor grill for medium heat, and lightly oil the grate.\nRemove the wing pieces from the bag of marinade, and discard the used marinade. Sprinkle the wings with salt and pepper to taste, and sear on the hottest part of the grill until the wings begin to brown, about 4 minutes per side.\nMove the wings to a less-hot part of the grill, baste with the unused portion of the marinade, and close the grill. Grill until the wings are golden brown, show good grill marks, are no longer pink in the center, and the juices run clear, 10 to 15 more minutes. Baste again with marinade and turn after 5 to 8 minutes.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "4 h ",
    "i": "514241.jpg",
    "o": "",
    "st": "allrecipes"
}