{
    "id": 215697,
    "old_rating": "4.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 skinless, boneless chicken breast halves",
        "1 tablespoon olive oil, divided",
        "1/4 teaspoon garlic salt",
        "3 roma (plum) tomatoes, chopped",
        "1/2 cup chopped fresh basil",
        "1/4 cup chopped green onions",
        "2 cloves garlic, minced",
        "1/2 teaspoon salt",
        "1/8 teaspoon ground black pepper",
        "1 tablespoon lemon juice",
        "1/4 cup grated Parmesan cheese",
        "6 8x8-inch squares of heavy duty aluminum foil"
    ],
    "nut": [
        "Calories > 175 kcal",
        "Carbs > 2.3 g",
        "Cholesterol > 70 mg",
        "Fat > 6.1 g",
        "Protein > 26.3 g",
        "Sodium > 381 mg"
    ],
    "n": "Deborah's Grilled Chicken",
    "a": "deborah",
    "r": "0",
    "s": 6,
    "des": "\"Grilled chicken breasts topped with a savory tomato-basil topping and Parmesan. Great over angel hair pasta!\"",
    "ins": "Preheat an outdoor grill for medium-high heat, and lightly oil the grate.\nPlace the chicken breast halves  between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the chicken with the smooth side of a meat mallet to a thickness of about 1/2 inch. Brush each chicken breast with olive oil, and sprinkle with a pinch of garlic salt.\nGrill the chicken breasts on the preheated grill until the meat is no longer pink inside and the chicken has good grill marks, 5 to 8 minutes per side. Move chicken to a cooler part of the grill to keep warm.\nWhile the chicken is cooking, mix together the tomatoes, basil, green onions, garlic, salt, black pepper, and lemon juice in a bowl.\nPlace an 8-inch square piece of aluminum foil onto the grill, and move a cooked chicken breast onto the foil. Top the chicken breast with about 1/4 cup of the tomato mixture, and sprinkle the topping with about 2 teaspoons of Parmesan cheese. Repeat for the other pieces of chicken.\nClose the lid on the grill, and grill the chicken breasts until the topping is hot, 2 to 3 more minutes.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "1009278.jpg",
    "o": "",
    "st": "allrecipes"
}