{
    "id": 215603,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup peanut or vegetable oil",
        "1 cup buttermilk",
        "1 1/2 pounds uncooked large shrimp, tails removed",
        "1/2 cup all-purpose flour",
        "2 cups ProgressoÂ® lemon pepper Panko crispy bread crumbs",
        "1 medium red onion, thinly sliced",
        "3 oranges, peeled and cut in between sections as segments",
        "9 cups loosely packed spinach or baby arugula",
        "6 tablespoons purchased citrus salad dressing",
        "Finely ground sea salt, preferably gray salt",
        "Freshly ground black pepper"
    ],
    "nut": [
        "Calories > 944 kcal",
        "Carbs > 72.9 g",
        "Cholesterol > 158 mg",
        "Fat > 59.7 g",
        "Protein > 28.3 g",
        "Sodium > 1793 mg"
    ],
    "n": "Crispy Seafood Salad with Citrus Vinaigrette",
    "a": "Progresso",
    "r": "0",
    "s": 6,
    "des": "\"Large shrimp are coated with lemon pepper panko crumbs, quickly fried, then tossed with spinach, red onion rings, and orange sections in this bright and tasty seafood salad.\"",
    "ins": "Heat the oil in a wok or deep-sided skillet on medium-high heat.\nPlace buttermilk in medium bowl; add shrimp, and soak for 5 minutes.\nPlace flour and bread crumbs in separate shallow bowls. Drain the shrimp in a sieve over another shallow bowl to capture the buttermilk.  Dip the shrimp into flour to coat, then dip in buttermilk, and finally dredge in bread crumbs.  Fry the shrimp in hot oil in batches until golden brown, about 3 minutes. Drain on paper towels to absorb any excess oil.\nGently toss the red onion with the orange segments and their juices; add spinach and toss. Drizzle the dressing over the top. Toss to evenly coat the ingredients. Divide salad among 6 large salad pates. Top with shrimp. Season with salt and pepper. Serve immediately.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "985321.jpg",
    "o": "",
    "st": "allrecipes"
}