{
    "id": 215762,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter",
        "1 (8 ounce) package cream cheese",
        "1/2 cup confectioners' sugar",
        "2 cups all-purpose flour",
        "1/4 teaspoon salt",
        "1 cup prepared mincemeat",
        "1 tablespoon rum"
    ],
    "nut": [
        "Calories > 86 kcal",
        "Carbs > 8 g",
        "Cholesterol > 15 mg",
        "Fat > 5.7 g",
        "Protein > 0.9 g",
        "Sodium > 66 mg"
    ],
    "n": "Festive Mincemeat Pastries",
    "a": "Heide F",
    "r": "0",
    "s": 48,
    "des": "\"Tender butter cookies filled with mincemeat, in a cornucopia shape.\"",
    "ins": "In a mixing bowl, beat butter and cream cheese with an electric mixer until combined, about 30 seconds; beat in the confectioners' sugar until the mixture is light and fluffy, about 2 minutes. In a bowl, whisk the flour with salt, and stir the flour mixture into the butter mixture to make an even, smooth dough. Cover the dough, and chill in refrigerator for at least 3 hours or overnight.\nPreheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nRoll the dough on a well-floured work surface to a thickness of about 1/8 inch. Cut the dough into rounds with a 3-inch round cookie or biscuit cutter. Place the cookies onto the prepared baking sheet. Mix the mincemeat and rum in a bowl, and spoon about 1 teaspoon of the filling into the middle of a cookie. Bring together 2 adjacent edges of the cookie into a triangle shape, and pinch the cookie closed to partially cover the filling and make a cornucopia or bell shape.\nBake in the preheated oven until the cookies are light golden brown, 10 to 12 minutes. Allow to cool on the baking sheet for about 5 minutes before removing to wire racks to finish cooling.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "4 h",
    "i": "2482001.jpg",
    "o": "",
    "st": "allrecipes"
}