{
    "id": 215765,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 cups peeled, chopped zucchini",
        "6 cups apples - peeled, cored and chopped",
        "2 cups raisins",
        "1 cup dried currants",
        "1 cup distilled white vinegar",
        "1 orange, juiced and zested",
        "2 cups brown sugar",
        "2 cups white sugar",
        "1 1/2 tablespoons ground cinnamon",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon salt",
        "2 tablespoons dry bread crumbs, if needed (optional)",
        "4 (1 pint) canning jars with lids and rings"
    ],
    "nut": [
        "Calories > 288 kcal",
        "Carbs > 74.3 g",
        "Cholesterol > 0 mg",
        "Fat > 0.4 g",
        "Protein > 1.9 g",
        "Sodium > 92 mg"
    ],
    "n": "Zucchini Mincemeat",
    "a": "Barb S",
    "r": "0",
    "s": 16,
    "des": "\"I was trying to think up a creative way to use up zucchini from my mom's garden. I concocted this recipe which tastes just like regular mincemeat. I hand-chopped everything; prep time would be cut down with a food processor.\"",
    "ins": "In a large pot over medium heat, stir together the zucchini, apples, raisins, currants, vinegar, orange juice, orange zest, brown sugar, white sugar, cinnamon, allspice, cloves, nutmeg, and salt. Stir until the sugar has dissolved, and allow the mixture to boil. Reduce heat to low, then simmer until thickened, 2 to 3 hours. For a thicker mincemeat, stir in the bread crumbs; simmer for 5 more minutes to absorb excess liquid.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the mincemeat into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark place.",
    "pt": "1 h ",
    "ct": "2 h",
    "tt": "4 h ",
    "i": "713921.jpg",
    "o": "",
    "st": "allrecipes"
}