{
    "id": 215777,
    "old_rating": "4.05556",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup all-purpose flour",
        "1 1/2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon cayenne pepper",
        "1 egg",
        "1 cup panko bread crumbs",
        "2 tablespoons olive oil, or as needed",
        "1 pound chicken tenders",
        "2 tablespoons olive oil",
        "15 cherry tomatoes, halved",
        "4 cloves garlic, chopped",
        "10 fresh basil leaves",
        "1 small onion, chopped",
        "salt and ground black pepper to taste",
        "4 slices of fresh mozzarella cheese, or as needed - cut in half"
    ],
    "nut": [
        "Calories > 616 kcal",
        "Carbs > 49.8 g",
        "Cholesterol > 165 mg",
        "Fat > 25.9 g",
        "Protein > 50.2 g",
        "Sodium > 1148 mg"
    ],
    "n": "Crispy Italian Chicken Topped with Mozzarella",
    "a": "PMJNSTN",
    "r": "0",
    "s": 4,
    "des": "\"Crispy fried chicken tenderloins topped with a tomato-garlic-basil sauce and fresh mozzarella -- you can't beat fresh ingredients! Great with rice pilaf and a good green salad.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nWhisk together the flour, 1 1/2 teaspoons of salt, 1 teaspoon of black pepper, and cayenne pepper in a bowl. In a separate shallow bowl, beat the egg. Place the panko crumbs into a third bowl.\nHeat 2 tablespoons of olive oil in a skillet over medium heat. Dip each chicken tender into the seasoned flour, then into the egg; roll in panko crumbs. Pan fry the chicken tenders until golden brown on both sides, about 4 minutes per side. Transfer the chicken pieces to a baking sheet.\nHeat 2 more tablespoons of olive oil in a skillet over medium heat, and stir in the tomatoes, garlic, basil, onion, and a pinch of salt and black pepper. Reduce heat and simmer the tomato sauce until it starts to thicken, stirring often, about 10 minutes. Spoon about 1 tablespoon of sauce over each chicken piece; top with a half piece of mozzarella cheese.\nBake in the preheated oven until the cheese is melted and bubbly, 8 to 10 minutes.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "486020.jpg",
    "o": "",
    "st": "allrecipes"
}