{
    "id": 215763,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 apples - peeled, cored and chopped",
        "2 tablespoons butter",
        "2 teaspoons lemon juice",
        "1/2 cup white sugar",
        "1/2 teaspoon ground cinnamon",
        "1/8 teaspoon ground nutmeg",
        "1 1/2 teaspoons vanilla extract",
        "2 cups prepared mincemeat (such as None SuchÂ®)",
        "1 cup chopped walnuts (optional)",
        "1 package of refrigerated pastry for double-crust pie (such as PillsburyÂ®",
        "1 egg yolk",
        "1 tablespoon water"
    ],
    "nut": [
        "Calories > 594 kcal",
        "Carbs > 78.4 g",
        "Cholesterol > 33 mg",
        "Fat > 31.1 g",
        "Protein > 5.8 g",
        "Sodium > 430 mg"
    ],
    "n": "Apple Mincemeat Pie",
    "a": "Tasha",
    "r": "0",
    "s": 8,
    "des": "\"An easy and very tasty mincemeat pie with an apple base. My stepdad asks for me to make him this pie every Friday!\"",
    "ins": "Preheat an oven to 450 degrees F (230 degrees C).\nPlace apples, butter, and lemon juice into a saucepan over medium heat, and cook, stirring often, until the apples are tender, 8 to 10 minutes. Stir in sugar, cinnamon, nutmeg, and vanilla extract. Mix in the mincemeat and walnuts until thoroughly combined, and set the pie filling aside.\nFit a pie crust into a 9-inch pie dish; pour the filling into the crust. With a brush dipped in water, moisten the edge of the bottom crust. Top the pie with the second crust, and crimp the two crusts together with a fork to seal. Cut 4 slits into the top crust for steam vents. In a small bowl, whisk the egg yolk with water, and brush the yolk mixture over the top crust.\nBake in the preheated oven for 15 minutes, then reduce oven temperature to 350 degrees F (175 degrees C). Remove the pie from the oven, and cover the crust edges with strips of aluminum foil to prevent over baking. Return the pie to the oven, and bake until the crust is golden brown and the filling is bubbling, 30 to 35 more minutes.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "775918.jpg",
    "o": "",
    "st": "allrecipes"
}