{
    "id": 215944,
    "old_rating": "4.43333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (14 ounce) can coconut milk, divided",
        "1 clove garlic, minced",
        "1 tablespoon soy sauce",
        "1 tablespoon lime juice",
        "1 1/2 pounds skinless, boneless chicken breast halves, cut into strips",
        "1 cup sweetened shredded coconut",
        "1 cup panko bread crumbs",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/2 cup all-purpose flour",
        "1 egg, beaten",
        "1/2 cup reduced-fat mayonnaise"
    ],
    "nut": [
        "Calories > 409 kcal",
        "Carbs > 29.4 g",
        "Cholesterol > 96 mg",
        "Fat > 21.6 g",
        "Protein > 29.5 g",
        "Sodium > 544 mg"
    ],
    "n": "Coconut Chicken",
    "a": "katie",
    "r": "0",
    "s": 6,
    "des": "\"I couldn't find a recipe for coconut chicken that is typically served at a Chinese buffet, so I made my own. This is baked, not fried. I like to serve this with rice and edamame.  My husband and picky 2 year old love this!\"",
    "ins": "Pour half the coconut milk, the garlic, soy sauce, and lime juice into a resealable plastic zipper bag, and shake to thoroughly combine the marinade. Place the chicken strips into the bag, squeeze several times to coat the chicken with marinade, and refrigerate at least 3 hours. Reserve the rest of the coconut milk.\nPreheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil and grease with olive oil.\nPlace the shredded coconut into a blender or food processor and pulse several times until the coconut is ground into crumbs. Mix it with panko crumbs, salt, and black pepper in a bowl. Place the flour into a second bowl, and the egg into a third shallow bowl. Shake excess marinade from chicken strips, and dip them into the flour to thoroughly coat; then dip into egg, and finally into the coconut crumb mixture. Place the coated strips onto the prepared baking sheet.\nBake the chicken strips in the preheated oven until golden brown, about 30 minutes.\nMix the reserved coconut milk and mayonnaise in a small saucepan, and bring to a simmer over medium-low heat; serve the sauce drizzled over the chicken strips or on the side for dipping.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "3 h ",
    "i": "3833803.jpg",
    "o": "3925585.jpg,2144873.jpg,1969212.jpg,1801136.jpg,1424577.jpg,1128445.jpg",
    "st": "allrecipes"
}