{
    "id": 215982,
    "old_rating": "4.15385",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 1/2 cups vegetable broth",
        "4 1/2 cups water",
        "1 tablespoon whole allspice berries",
        "1 tablespoon whole black peppercorns",
        "1 cup kosher salt",
        "4 Cornish game hens",
        "1 grapefruit, cut into quarters",
        "1 juicy orange, cut into quarters",
        "1 lemon, cut into quarters",
        "1 lime, cut into quarters",
        "1 sprig fresh rosemary, or to taste, chopped",
        "1 sprig fresh thyme, or to taste, chopped",
        "1/4 cup water",
        "1/4 cup olive oil",
        "salt and ground black pepper to taste"
    ],
    "nut": [],
    "n": "Heather's Rosemary Citrus Cornish Hens",
    "a": "Shawnna Boles",
    "r": "0",
    "s": 8,
    "des": "\"This recipe does just as well with a full chicken as it does with Cornish hens.  The meat is tender and flavorful, and absolutely the best I've ever had!  Don't leave the hens in the brine for too long, or the meat will be too salty.\"",
    "ins": "Bring the vegetable broth, 4 1/2 cups of water, the allspice berries, black peppercorns, and kosher salt to a boil in a large pot, stirring to dissolve the salt. Remove the brine from the heat, and set aside to cool. When the brine is cool, place the Cornish hens into the brine and refrigerate for 2 to 3 hours.\nPreheat oven to 350 degrees F (175 degrees C). Remove the game hens from the brine, and pat dry. Discard the brine.\nPlace the cut-up grapefruit, orange, lemon, lime, rosemary, and thyme into a microwave-safe bowl, and microwave on High for 2 minutes; with tongs, stuff the fruit and herbs into the cavities of the Cornish hens. Slather each hen with olive oil, and sprinkle with salt and black pepper. Place the stuffed hens into a roasting dish, breast sides up.\nRoast in the preheated oven until no longer pink at the bone and the juices run clear, about 1 hour and 45 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). For extra-crispy skin, turn the oven heat up to 400 degrees F (205 degrees C) for the last 15 minutes of cooking. Allow the hens to rest for 10 minutes before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "5 h ",
    "i": "509435.jpg",
    "o": "",
    "st": "allrecipes"
}