{
    "id": 215951,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Soup:",
        "1 1/2 pounds fresh broccoli",
        "2 tablespoons extra-virgin olive oil",
        "1 tablespoon unsalted butter",
        "1 tablespoon finely chopped garlic",
        "1 cup finely chopped onion",
        "1/2 cup finely chopped celery",
        "Gray salt",
        "2 teaspoons finely chopped fresh thyme leaves",
        "5 cups ProgressoÂ® chicken broth",
        "2 cups packed fresh spinach leaves",
        "2 teaspoons freshly grated lemon peel",
        "1 cup whipping cream or buttermilk (if using buttermilk, use half the lemon peel)",
        "Freshly ground pepper",
        "Gremolata:",
        "1/4 cup ProgressoÂ® panko crispy bread crumbs",
        "2 tablespoons chopped fresh parsley",
        "2 tablespoons pine nuts, toasted"
    ],
    "nut": [
        "Calories > 243 kcal",
        "Carbs > 15 g",
        "Cholesterol > 45 mg",
        "Fat > 18.5 g",
        "Protein > 6.4 g",
        "Sodium > 704 mg"
    ],
    "n": "Very Green Broccoli Soup",
    "a": "Progresso",
    "r": "0",
    "s": 8,
    "des": "\"This creamy, delicate mixture of ProgressoÂ® chicken broth and broccoli will add rich layers of flavor and make you a hero among guests!\"",
    "ins": "Cut broccoli florets from stems. Peel tough outer skin from stems; trim off fibrous ends. Cut stems into 1/2-inch pieces.\nIn 4-quart Dutch oven, heat oil and butter over medium-high heat until butter is melted. Add garlic; cook, stirring occasionally, until light brown. Stir in onion and celery; season with salt. Reduce heat to medium-low; cook about 10 minutes, stirring occasionally, until vegetables are tender.\nMeanwhile, in small bowl, stir together gremolata ingredients; set aside.\nStir thyme, broccoli stems and broth into soup. Heat to boiling. Cook uncovered over medium heat about 3 minutes. Stir in broccoli florets; cook about 7 minutes, stirring occasionally, until broccoli is very tender. Stir in spinach and lemon peel (spinach will wilt).\nIn blender, cover and puree soup in small batches. (At this point, soup can be covered and refrigerated up to 1 day or frozen up to 1 month.) Return soup to Dutch oven; reheat over medium-low heat. Stir in cream; season to taste with additional salt and the pepper.\nLadle soup into warm individual soup bowls. Sprinkle 1 tablespoon gremolata onto each serving. Pass remaining gremolata at table.",
    "pt": "50 m",
    "ct": "",
    "tt": "",
    "i": "979366.jpg",
    "o": "",
    "st": "allrecipes"
}