{
    "id": 215949,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons extra-virgin olive oil",
        "1 small onion, finely chopped",
        "2 cloves garlic, finely chopped",
        "3/4 cup uncooked Arborio rice",
        "1/2 cup dry white wine",
        "2 cups ProgressoÂ® reduced sodium chicken broth, heated",
        "Freshly ground pepper to taste",
        "1 cup chopped fresh spinach leaves",
        "1 tablespoon butter",
        "1/2 cup grated Parmigiano-Reggiano cheese",
        "24 (1/2 inch) cubes mozzarella cheese",
        "1/2 cup all-purpose flour",
        "1 1/2 cups ProgressoÂ® Italian style panko crispy bread crumbs",
        "1 egg",
        "1 tablespoon water",
        "Vegetable oil for frying"
    ],
    "nut": [
        "Calories > 161 kcal",
        "Carbs > 16.7 g",
        "Cholesterol > 14 mg",
        "Fat > 7.9 g",
        "Protein > 4.2 g",
        "Sodium > 312 mg"
    ],
    "n": "Spinach Arancini",
    "a": "Progresso",
    "r": "0",
    "s": 24,
    "des": "\"Arborio rice balls with spinach and Parmigiano-Reggiano and a cube of mozzarella cheese inside are rolled in seasoned panko bread crumbs, then deep fried until golden brown for an impressive and delicious appetizer.\"",
    "ins": "Line cookie sheet with cooking parchment paper. In 3-quart saucepan, heat olive oil over medium-high heat. Add onion; cook about 1 minute, stirring frequently. Add garlic; cook and stir 5 minutes. Reduce heat to medium. Stir in rice and wine; cook 5 to 10 minutes, stirring frequently, until liquid is absorbed. Add 1 cup broth; cook about 10 minutes, stirring occasionally, until broth is absorbed. Add remaining 1 cup broth; cook about 10 minutes, stirring occasionally, until broth is absorbed.\nSeason with pepper. Stir in spinach, butter and Parmigiano-Reggiano cheese. Spread onto cookie sheet. Cover with plastic wrap; refrigerate at least 1 hour 30 minutes or until firm. (Mixture can be refrigerated overnight.)\nOn cookie sheet, shape rice mixture into 12x8-inch rectangle. Cut into 6 rows by 4 rows to make 24 squares. Place 1 mozzarella cheese cube in center of each square; shape rice around cheese cubes to make balls.\nPlace flour and bread crumbs in separate bowls. In another bowl, beat egg and water until blended. Coat each ball with flour, then dip into egg mixture and coat with bread crumbs. Place coated balls on unlined cookie sheet; refrigerate 30 minutes.\nLine platter or shallow pan with paper towels. In 4-quart Dutch oven, heat about 2 inches vegetable oil to 350 degrees F. Fry 8 balls at a time 3 to 4 minutes, turning once, until golden brown. With slotted spoon, remove balls from Dutch oven to towel-lined platter to drain. Serve hot.",
    "pt": "1 h ",
    "ct": "",
    "tt": "",
    "i": "978893.jpg",
    "o": "",
    "st": "allrecipes"
}