{
    "id": 215939,
    "old_rating": "4.54167",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 1/2 pounds bulk chorizo sausage",
        "4 cloves garlic, minced",
        "1 large onion, cut into 1/2-inch pieces",
        "1 (8 ounce) package uncooked rotini pasta",
        "1/4 cup water",
        "2 tablespoons olive oil",
        "1 bunch broccoli rabe, ends trimmed, cut into 2-inch pieces",
        "salt and black pepper to taste",
        "1/2 cup shredded Parmesan cheese"
    ],
    "nut": [
        "Calories > 769 kcal",
        "Carbs > 35.4 g",
        "Cholesterol > 106 mg",
        "Fat > 52.7 g",
        "Protein > 36.6 g",
        "Sodium > 1519 mg"
    ],
    "n": "Chorizo and Broccoli Rabe Pasta",
    "a": "kikikalooki",
    "r": "0",
    "s": 6,
    "des": "\"A quick and easy dish to make. My husband is not an adventurous eater and he loved this.\"",
    "ins": "Heat 1 tablespoon of olive oil in a skillet over medium-high heat. Cook and stir the chorizo, garlic, and onion in the hot oil until the chorizo has browned and no longer pink, and the onion has softened, about 10 minutes. Pour off any excess grease, then transfer to a bowl.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the rotini, and return to a boil. Cook uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink.\nPour the water and 2 tablespoons olive oil into the skillet  that the chorizo was cooked in. Bring to a boil over high heat, then add the broccoli rabe, cover, and cook until tender, about 4 minutes. Uncover, and stir in the chorizo mixture; bring to a simmer. Toss the pasta with the chorizo mixture in a large bowl. Season to taste with salt and black pepper, and sprinkle in the Parmesan cheese. Stir gently before serving.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "3708871.jpg",
    "o": "4539171.jpg,4269462.jpg,4267293.jpg,3507195.jpg,2304323.jpg,1068184.jpg",
    "st": "allrecipes"
}