{
    "id": 216021,
    "old_rating": "4.42202",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 large McIntosh apples - peeled, cored, and chopped",
        "1/4 cup water",
        "2 tablespoons white sugar",
        "1/2 teaspoon ground cinnamon, or to taste",
        "2 cups all-purpose flour",
        "2 cups rolled oats",
        "1 1/2 cups brown sugar",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg (optional)",
        "1 1/2 cups butter"
    ],
    "nut": [
        "Calories > 109 kcal",
        "Carbs > 13.1 g",
        "Cholesterol > 15 mg",
        "Fat > 6.1 g",
        "Protein > 1.1 g",
        "Sodium > 43 mg"
    ],
    "n": "Apple Crisp Cups",
    "a": "weeble",
    "r": "0",
    "s": 48,
    "des": "\"A yummy one-biter! Whenever I ask 'what can I bring?' these top the list!  Sweet cinnamon-scented apples held in a buttery crispy oatmeal cup and  crunchy sweet topping. I like to make sweet treats to share with friends. I came up with this recipe so that I could bake and take apple crisp to share easily with everyone.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease 4 12-cup mini-muffin tins.\nMix apples, water, white sugar, and 1/2 teaspoon of cinnamon together in a saucepan, and bring to a simmer over medium-low heat, stirring occasionally. Simmer until apples are partially cooked, about 5 minutes; remove from heat.\nCombine flour, oats, brown sugar, 1 teaspoon of cinnamon, and nutmeg in a large bowl; cut the butter into the flour mixture with a pastry cutter until the mixture looks like coarse crumbs. Place a heaping tablespoon of the crust mixture into a mini muffin cup, and press it into the cup so that it covers the bottom and pushes up the sides of the cup. Make the crust go all the way to the top of the little muffin cup, and patch any holes with more crust mixture. There will be crust mixture left over. Place about 2 teaspoons of apple filling in the crust. Sprinkle about 1 teaspoon of the remaining crust mixture on the filling.\nBake in the preheated oven until golden brown, 15 to 20 minutes.",
    "pt": "45 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "490285.jpg",
    "o": "4463643.jpg,4254335.jpg,4126764.jpg,4015023.jpg,3107341.jpg,2926651.jpg",
    "st": "allrecipes"
}