{
    "id": 216082,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon active dry yeast",
        "2 cups warm water (100 to 110 degrees F/40 to 45 degrees C)",
        "1/4 cup white sugar",
        "1 tablespoon salt",
        "2 eggs, beaten",
        "1/4 cup vegetable oil",
        "5 1/2 cups all-purpose flour, or more if needed",
        "2 tablespoons poultry seasoning",
        "2 tablespoons dried savory",
        "1 1/2 tablespoons ground dried sage",
        "1 tablespoon dried dill weed (optional)",
        "1 teaspoon ground black pepper",
        "1 teaspoon ground nutmeg (optional)"
    ],
    "nut": [
        "Calories > 215 kcal",
        "Carbs > 37.3 g",
        "Cholesterol > 23 mg",
        "Fat > 4.7 g",
        "Protein > 5.7 g",
        "Sodium > 448 mg"
    ],
    "n": "Savory Stuffing Bread",
    "a": "Rarik",
    "r": "0",
    "s": 16,
    "des": "\"This bread is used to make dressing/stuffing for turkey or other fowl.\"",
    "ins": "Mix yeast, warm water, sugar, salt, eggs, and vegetable oil together in a large bowl. In another bowl, whisk together the flour, poultry seasoning, savory, sage, dill, black pepper, and nutmeg until thoroughly combined. Beat the flour mixture into the wet ingredients, about 1 cup at a time, until the dough is smooth; add up to 1 more cup of flour if needed.\nTurn the dough out onto a floured work surface, and knead until the dough is springy, smooth, and elastic, about 8 minutes. Form the dough into a ball, and place into an oiled bowl. Turn the dough ball around in the bowl to lightly oil the dough, then cover the bowl with a cloth and let the dough rise until doubled in size, about 1 hour.\nGrease 2 9x5-inch loaf pans. Punch down the dough, knead several times to remove air pockets, then cut the dough in half. Shape each half into a log, pinching the seams closed, then place into the prepared loaf pans seam sides down. Lightly cover the pans with a cloth, and let rise until doubled, 45 minutes to 1 hour.\nPreheat oven to 375 degrees F (190 degrees C).\nBake the bread until golden brown, 25 to 30 minutes; remove from pans and cool on wire cooling racks.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "2 h ",
    "i": "4156257.jpg",
    "o": "",
    "st": "allrecipes"
}