{
    "id": 216048,
    "old_rating": "4.9",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 cup Muir GlenÂ® organic crushed tomatoes with basil",
        "2 pounds boneless skinless chicken breasts",
        "1/2 cup chopped onion",
        "1/2 cup diced carrot",
        "1/2 cup diced celery",
        "2 (32 ounce) cartons ProgressoÂ® chicken broth",
        "1/2 teaspoon gray salt or sea salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 dried bay leaf",
        "1 cup uncooked acini de pepe or small round pasta",
        "2 cups chopped, lightly packed mustard greens, spinach, Swiss chard or other greens",
        "1/3 cup shredded Parmesan cheese"
    ],
    "nut": [
        "Calories > 224 kcal",
        "Carbs > 19.9 g",
        "Cholesterol > 49 mg",
        "Fat > 4.3 g",
        "Protein > 24.4 g",
        "Sodium > 899 mg"
    ],
    "n": "Chiarello's Chicken and Pastina Soup",
    "a": "Progresso",
    "r": "0",
    "s": 10,
    "des": "\"This fresh, bright soup with chicken, tomatoes and pasta is loaded with vegetables for a light but satisfying dinner or first course.\"",
    "ins": "Place chicken in 12-inch skillet. Add 1 carton of the broth. Heat to boiling. Reduce heat; cover and simmer 20 minutes or until juice of chicken is clear when center of thickest part is cut (170 degrees F).\nMeanwhile, in 5-quart stockpot, heat oil over medium heat. Add onion, carrot and celery; cook 8 to 10 minutes, stirring occasionally, until vegetables are tender.\nDrain chicken, reserving broth; set chicken aside. Strain broth; add to vegetables. Stir remaining carton of broth, the tomatoes, salt, pepper and bay leaf into stockpot. Heat to boiling. Stir in pasta. Reduce heat; cover and simmer 15 minutes.\nShred or cut chicken into bite-size pieces; add to soup. Stir in greens just until wilted. Remove bay leaf. Serve with a sprinkle of additional freshly ground pepper and the cheese.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "976420.jpg",
    "o": "",
    "st": "allrecipes"
}