{
    "id": 216071,
    "old_rating": "4.64865",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 links pork sausage",
        "2 pounds potatoes, peeled and cubed",
        "1/4 cup butter",
        "2 tablespoons milk (optional)",
        "1 teaspoon dry mustard powder",
        "salt and ground black pepper to taste",
        "1 tablespoon butter",
        "2 large onions, chopped",
        "6 cups beef broth",
        "2 cups red wine"
    ],
    "nut": [
        "Calories > 516 kcal",
        "Carbs > 50.4 g",
        "Cholesterol > 58 mg",
        "Fat > 19.8 g",
        "Protein > 14.1 g",
        "Sodium > 1414 mg"
    ],
    "n": "True Bangers and Mash with Onion Gravy",
    "a": "wsf",
    "r": "0",
    "s": 4,
    "des": "\"Bangers and mash gets its name because sausages used to burst (or bang) while cooking, due to rusk (dried bread) being added to the meat. Mash, meanwhile, refers to the mashed potatoes.  This recipe was a staple at our home in Dublin at Halloween.  It is a very cheap, very traditional supper, and one that truly requires good sausage. Try to use a good quality sausage or perhaps even a bratwurst. Please note that this is a very thin gravy, as is traditional. It will still be very liquidy.\"",
    "ins": "Preheat oven to 200 degrees F (95 degrees C).\nCook the sausage links in a skillet over medium-low heat until browned on all sides, about 5 minutes per side; transfer to an oven-safe dish and move to the preheated oven to keep warm.\nPlace potatoes into a saucepan over medium heat, cover with water, and boil gently until potatoes are tender, 10 to 15 minutes. Drain and allow to steam dry for a minute or two. Mix in 1/4 cup of butter, milk, dry mustard, salt, and black pepper; mash until fluffy and smooth. Set aside.\nMelt 1 tablespoon butter in a skillet over medium-high heat; cook the onions until translucent and just starting to brown, about 8 minutes. Pour in the beef broth and red wine; boil the mixture down to about half its volume, about 10 minutes. Season with salt and black pepper. To serve, place a sausage onto a serving plate with about 1/2 cup of mashed potatoes. Pour the onion gravy over the sausage and potatoes.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "815033.jpg",
    "o": "4507698.jpg,4506815.jpg,4486527.jpg,4417012.jpg,4093467.jpg,4091455.jpg",
    "st": "allrecipes"
}