{
    "id": 216036,
    "old_rating": "3.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 ounces dried mushrooms, chopped",
        "1/2 cup warm water",
        "1 pound ground pork",
        "2 carrots, shredded",
        "1/3 cup diced onion",
        "2 cloves garlic, minced",
        "2 tablespoons soy sauce",
        "1 egg white",
        "1/2 cup applesauce",
        "1/4 cup water",
        "2 tablespoons maple syrup",
        "2 tablespoons soy sauce",
        "2 teaspoons brown sugar"
    ],
    "nut": [
        "Calories > 194 kcal",
        "Carbs > 16.2 g",
        "Cholesterol > 37 mg",
        "Fat > 8.6 g",
        "Protein > 13.9 g",
        "Sodium > 521 mg"
    ],
    "n": "Pork Apple Meatballs",
    "a": "Madchen",
    "r": "0",
    "s": 8,
    "des": "\"Ground pork, applesauce, soy sauce, and carrots give these meatballs a sweet and salty flavor.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Prepare a 2-quart baking dish with cooking spray.\nPlace the dried mushrooms in a bowl. Pour 1/4 cup of warm water over the mushrooms; allow to soak until the mushrooms have rehydrated, about 30 minutes. Drain, reserving the water, and set both the mushrooms and water aside.\nCombine the ground pork, carrots, onion, garlic, 2 tablespoons soy sauce, the drained mushrooms, and the egg white in a large bowl; mix with hands until evenly combined. Form the mixture into 16 meatballs; arrange into the prepared baking dish.\nStir the reserved water from the mushrooms, the applesauce, 1/4 cup water, maple syrup, 2 tablespoons of soy sauce, and brown sugar together in a bowl; pour over the meatballs. Cover the dish with aluminum foil.\nBake in the preheated oven for 45 minutes. Remove the foil from the dish and continue baking until the meatballs are cooked through and no longer pink in the center, about 20 minutes more.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1035807.jpg",
    "o": "",
    "st": "allrecipes"
}