{
    "id": 216079,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 red bell peppers",
        "2 yellow bell peppers",
        "2 ounces pine nuts",
        "1/3 cup golden raisins",
        "1 clove garlic, minced",
        "1/2 cup chopped fresh parsley",
        "1/2 cup olive oil",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 160 kcal",
        "Carbs > 8.4 g",
        "Cholesterol > 0 mg",
        "Fat > 13.8 g",
        "Protein > 2.1 g",
        "Sodium > 4 mg"
    ],
    "n": "Roasted Peppers with Pine Nuts and Parsley",
    "a": "TheChef2010",
    "r": "0",
    "s": 10,
    "des": "\"This recipe is so delicious and easy. I enjoy it cold but it can be eaten immediately as well. I hope you enjoy this recipe!\"",
    "ins": "Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil. Cut the peppers in half from top to bottom; remove the stem, seeds, and ribs, then place the peppers cut sides down onto the prepared baking sheet. Cook under the preheated broiler until the skin of the peppers has blackened and blistered, about 10 minutes. Place the blackened peppers into a bowl, and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 20 minutes. Once cool, remove the skins and discard.\nToast the pine nuts in a small dry skillet over medium-low heat, swirling the pine nuts in the skillet until they turn a light tan color and have a nutty fragrance, 1 to 2 minutes. Remove from heat and pour into a small bowl to prevent them from overcooking.\nSlice the roasted peppers into strips, and arrange decoratively onto a serving platter, alternating red and yellow strips. Sprinkle the peppers with toasted pine nuts, raisins, garlic, and parsley, drizzle with olive oil, and season to taste with salt and black pepper.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "55 m",
    "i": "760837.jpg",
    "o": "",
    "st": "allrecipes"
}