{
    "id": 216066,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 pounds ground beef chuck",
        "1 pound bulk pork sausage",
        "1 large onion, chopped",
        "1 cup crushed saltine crackers",
        "2 eggs, beaten",
        "3 tablespoons Cajun seasoning",
        "1 tablespoon corn kernels",
        "2 pickle slices",
        "3 black olives, halved",
        "2 small slices of green bell pepper",
        "2 cups ketchup"
    ],
    "nut": [
        "Calories > 484 kcal",
        "Carbs > 17.9 g",
        "Cholesterol > 121 mg",
        "Fat > 37.2 g",
        "Protein > 19.8 g",
        "Sodium > 1206 mg"
    ],
    "n": "Halloween Halfling Meatloaf",
    "a": "JILLENA",
    "r": "0",
    "s": 12,
    "des": "\"This is a great tasting and scary meatloaf.  Our guests got a big kick out of it.  I prefer to bake my meatloaf on a slotted broiler pan to let the grease drip off. You can use spicy sausage but I prefer a mild sausage.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nMix together the ground beef, sausage, onion, saltine cracker crumbs, beaten eggs, and cajun seasoning in a bowl until well combined. In a large baking dish, form the meat loaf mixture into a Halfling shape, with a large head, 2 stubby legs, and 2 upraised arms.\nBake in the preheated oven until the meatloaf is no longer pink inside and just starting to turn brown, about 1 hour.  An instant-read thermometer inserted into the center should read at least 165 degrees F (70 degrees C).\nTo decorate the meatloaf's head, pick out about 14 corn kernels, and arrange them into teeth. Place 1 small green pepper slice on each side of the creature's head for ears; place two pickle slices on the face for eyes, then place 2 black olive halves, cut sides down, in the pickle slices to finish the eyes. One more olive half forms the nose. Surround the monster with a background of ketchup \"blood,\" and bake until browned, about 10 more minutes.\nLet the meatloaf rest for 10 minutes before serving. Just before serving, stick a paring knife in the meatloaf's body, and decorate it with a little ketchup blood.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "503124.jpg",
    "o": "4081090.jpg,1614359.jpg,1609824.jpg,1603991.jpg,1597473.jpg,879067.jpg",
    "st": "allrecipes"
}