{
    "id": 216114,
    "old_rating": "4.40741",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 turkey thighs",
        "salt and pepper to taste",
        "1/2 cup all-purpose flour",
        "1 tablespoon poultry seasoning",
        "2 tablespoons olive oil",
        "1 small onion, sliced",
        "1 (8 ounce) package sliced fresh mushrooms",
        "2 cloves garlic, crushed",
        "1 cup chicken broth",
        "1/2 (10.75 ounce) can condensed cream of chicken soup",
        "2 tablespoons dry sherry",
        "1 1/2 teaspoons dried oregano",
        "1 1/2 teaspoons dried parsley",
        "1 teaspoon garlic powder"
    ],
    "nut": [
        "Calories > 403 kcal",
        "Carbs > 21.3 g",
        "Cholesterol > 92 mg",
        "Fat > 16.3 g",
        "Protein > 41.1 g",
        "Sodium > 402 mg"
    ],
    "n": "Turkey Thighs in Brown Sauce",
    "a": "Elizabeth",
    "r": "0",
    "s": 4,
    "des": "\"Turkey thighs are pan seared and then cooked in a sauce of canned soup and broth with onions, mushrooms, garlic and a little sherry wine. Serve the turkey and sauce with hot cooked rice.\"",
    "ins": "Rinse and pat the turkey thighs dry with paper towels, then sprinkle with salt and pepper. In a shallow bowl, mix the flour with poultry seasoning until well combined.\nHeat the olive oil in a large skillet over medium-high heat; dredge the turkey thighs all over with the seasoned flour, shake off excess flour, then cook the turkey thighs in the hot oil until the meat is browned, about 5 minutes per side.\nStir the onion, mushrooms, and garlic into the pan. Stir until the mushrooms have begun to give up their juice and the onions are translucent, about 5 minutes. Whisk the chicken broth, cream of chicken soup, and sherry together in a bowl, and stir in the oregano, parsley, and garlic powder. Pour the mixture over the turkey thighs. Cover the pan, reduce heat to medium-low, and simmer until the turkey meat is no longer pink inside and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Slice the turkey thighs, and serve with sauce.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "1589817.jpg",
    "o": "",
    "st": "allrecipes"
}