{
    "id": 216225,
    "old_rating": "4.46154",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons vegetable oil",
        "1 (5 pound) boneless pork loin roast",
        "3 cups chopped onion",
        "5 carrots, chopped",
        "1 (12 fluid ounce) can or bottle beer",
        "2 teaspoons salt",
        "1/4 teaspoon ground black pepper",
        "1 bay leaf",
        "4 whole cloves"
    ],
    "nut": [
        "Calories > 344 kcal",
        "Carbs > 11.2 g",
        "Cholesterol > 99 mg",
        "Fat > 16.2 g",
        "Protein > 34.1 g",
        "Sodium > 670 mg"
    ],
    "n": "Beer Braised Pork Loin",
    "a": "MARKWILDER55",
    "r": "0",
    "s": 8,
    "des": "\"A delicious way to make an inexpensive cut of meat taste like a million bucks. Spoon sauce over pork to serve along with rice or potatoes.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).\nHeat vegetable oil a heavy pot or dutch oven over medium-high heat. Sear pork in hot oil until brown on all sides, about 10 minutes. Remove roast from pot.\nDrain all but about 3 tablespoons grease from pot. Cook and stir onion and carrots until softened, about 5 minutes.\nStir beer, salt, pepper, bay leaf, and cloves into the onion mixture.\nReturn pork roast to the pot and cover.\nBake in the preheated oven until pork is tender and no longer pink in the center, about 2 hours.\nTransfer roast to a platter and cover loosely with aluminum foil. Remove bay leaf from vegetables.\nPour the beer and vegetable mixture from the Dutch oven into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel and carefully start the blender, using a few quick pulses to get the vegetables moving before leaving it on to puree until smooth.\nBring pureed sauce to a boil in a saucepan over medium-high heat until thickened, stirring often, about 5 minutes. Spoon sauce over pork roast to serve.",
    "pt": "10 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "995202.jpg",
    "o": "",
    "st": "allrecipes"
}