{
    "id": 216226,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 3/4 cups whole wheat flour",
        "1 teaspoon salt",
        "1 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon pumpkin pie spice",
        "1/4 teaspoon ground nutmeg",
        "1 cup white sugar",
        "1/3 cup canola oil",
        "2 large eggs",
        "1 egg white",
        "1/3 cup pumpkin beer",
        "1/2 (15 ounce) can pumpkin puree",
        "1/4 cup chia seeds",
        "1/4 cup water",
        "1/4 cup chopped walnuts (optional)"
    ],
    "nut": [
        "Calories > 218 kcal",
        "Carbs > 31.7 g",
        "Cholesterol > 31 mg",
        "Fat > 9.1 g",
        "Protein > 4.4 g",
        "Sodium > 359 mg"
    ],
    "n": "Double Pumpkin-Beer Bread",
    "a": "sheerblonde05",
    "r": "0",
    "s": 12,
    "des": "\"Doubling the pumpkin by adding pumpkin beer puts a little twist on your typical pumpkin bread recipe. Pumpkin beer and chia seed create an incredibly moist and flavorful bread. It is always fun to explain what's hidden inside too! Chia seed gives a boost of added nutrients, while the leftover beer is great for sipping while you bake! The perfect fall-infused bread!\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Spray a 9x5-inch loaf pan with cooking spray. Combine flour, salt, baking soda, cinnamon, pumpkin pie spice, and nutmeg in a bowl; set aside.\nBeat the sugar, canola oil, whole eggs, egg white, pumpkin beer, and pumpkin puree together in a large bowl until smooth. Combine chia seeds and water in a small bowl, then whisk in the chia seed mixture into the pumpkin mixture until smooth and well-blended. Gradually stir in the flour mixture into the pumpkin mixture. Mix until smooth. Pour batter into the prepared loaf pan, and layer the chopped walnuts on top.\nBake in the preheated oven until a knife inserted into the center comes out clean, about 50 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "2 h ",
    "i": "1551118.jpg",
    "o": "",
    "st": "allrecipes"
}