{
    "id": 216240,
    "old_rating": "4.90909",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 ounces chocolate confectioners' coating",
        "20 red maraschino cherries with stems",
        "3 tablespoons blanched slivered almonds",
        "20 milk chocolate candy kisses, unwrapped",
        "40 small red decorating candies (dragees) (optional)"
    ],
    "nut": [
        "Calories > 96 kcal",
        "Carbs > 11.8 g",
        "Cholesterol > 1 mg",
        "Fat > 6.5 g",
        "Protein > 1.4 g",
        "Sodium > 14 mg"
    ],
    "n": "Mice",
    "a": "lovemykids",
    "r": "0",
    "s": 20,
    "des": "\"Kids love them. I did growing up -- my mom use to make these around Christmas time, but great for anytime! You can make as many as you want. They are great to look at.\"",
    "ins": "Line a baking sheet with parchment paper.\nChop the confectioners' coating into chunks, and place into a microwave-safe bowl. Heat the coating in the microwave oven on High for 30 seconds; then heat again 4 or 5 more times for 10 to 15 seconds each time until the coating is warm (not hot) and melted. Stir well until the chocolate coating is smooth and free of lumps. The coating should be about 95 degrees F (35 degrees C).\nDry the cherries well with paper towels. Holding each cherry by the stem, dip it into the chocolate coating to just reach the bottom of the stem. Carefully lay the cherry on its side, so the stem sticks out the side. This will be the tail. Before the coating sets up, stick the flat side of an unwrapped chocolate kiss opposite the tail, to make a pointy-nosed face. Pick out two nicely shaped slivers of almond, and insert them between the chocolate kiss and the dipped cherry to make little ears. Use a toothpick to make two small dots of melted coating on the face for eyes; stick two little red candies to the coating dots. Repeat with the rest of the cherries. Allow the coating to set until firm and cool, about 30 minutes.",
    "pt": "45 m",
    "ct": "",
    "tt": "",
    "i": "761192.jpg",
    "o": "",
    "st": "allrecipes"
}