{
    "id": 216355,
    "old_rating": "4.54656",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 ounces elbow macaroni",
        "8 ounces processed cheese (such as VelveetaÂ®), cubed",
        "1 (10.75 ounce) can condensed Cheddar cheese soup",
        "1 cup sour cream",
        "1/4 cup freshly shredded Parmesan cheese",
        "1/2 cup milk",
        "salt and ground black pepper to taste",
        "1/2 cup crushed saltine crackers",
        "2 tablespoons butter, melted"
    ],
    "nut": [
        "Calories > 447 kcal",
        "Carbs > 43.2 g",
        "Cholesterol > 58 mg",
        "Fat > 22.4 g",
        "Protein > 18 g",
        "Sodium > 1143 mg"
    ],
    "n": "Easy Pleasy Mac N Cheesy -  US Navy Style",
    "a": "Muffin Mom N Garlic Girl",
    "r": "0",
    "s": 6,
    "des": "\"I deployed with the U.S. Navy on the USS Enterprise, and it was there I had the best mac and cheese of my life. I've spent a number of years trying new recipes to produce the mild, thick and creamy version we were served. After numerous attempts and fails I came up with this. It's so simple and just like we got weekly while we were haze grey and underway.\"",
    "ins": "Preheat  oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking dish.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the macaroni, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink. Transfer the macaroni to a large bowl, and stir in the processed cheese cubes, Cheddar cheese soup, sour cream, Parmesan cheese, milk, salt, and black pepper. Pour into the prepared baking dish. Mix the cracker crumbs with the butter, and sprinkle over the casserole. Cover the casserole with aluminum foil.\nBake in the preheated oven until bubbling, about 30 minutes; remove foil and bake until crumbs are golden brown, 5 to 10 more minutes.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "4042552.jpg",
    "o": "4500844.jpg,4123691.jpg,2858823.jpg,2186050.jpg,2046307.jpg,1873131.jpg",
    "st": "allrecipes"
}