{
    "id": 216329,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour, or as needed",
        "1 tablespoon anise seed",
        "1/2 teaspoon salt",
        "1/2 cup shortening",
        "1/2 cup white sugar",
        "2 tablespoons white sugar",
        "3 small eggs",
        "1 drop anise oil",
        "1/2 cup confectioners' sugar, or as needed"
    ],
    "nut": [
        "Calories > 89 kcal",
        "Carbs > 13.3 g",
        "Cholesterol > 11 mg",
        "Fat > 3.3 g",
        "Protein > 1.5 g",
        "Sodium > 37 mg"
    ],
    "n": "Anise Waffle Cookies",
    "a": "Shannon E",
    "r": "0",
    "s": 36,
    "des": "\"This is a waffle cookie seasoned with anise seed and anise oil.  It is baked on a waffle iron.  It is not a really sweet cookie, but it was sent to soldiers during WWII because they keep well and the flavor seems to get better with each passing day. Lasts about 2 weeks unrefrigerated.  Handed down from my German-Swiss grandmother. You can also use lemon or vanilla flavoring instead of the anise seed and oil; of course, it changes the flavor completely, but if you're looking for a nice 'not too sweet' cookie, this recipe is a good place to start.  My children love making these - it's fun, it's easy.\"",
    "ins": "Preheat a waffle iron according to manufacturer's instructions. Whisk together flour, anise seed, and salt in a bowl.\nIn a separate bowl, mash the shortening until creamy, and stir with all of the sugar, eggs, and anise oil until thoroughly mixed. Stir the flour mixture into the wet ingredients to form a dough. Break off about 1 tablespoon of dough per cookie, and roll into 1-inch balls.\nSpray the waffle iron with cooking spray. Place dough balls onto the iron, close the lid, and bake until the iron stops emitting steam and the cookies are lightly golden brown, 1 to 3 minutes. Check after about 1 minute. Remove the cookies from the iron and sprinkle with confectioners' sugar while still warm. Cool on wire rack.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "536077.jpg",
    "o": "",
    "st": "allrecipes"
}