{
    "id": 216467,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup all-purpose flour",
        "2 tablespoons white sugar",
        "2 egg yolks",
        "1 cup milk",
        "1 teaspoon vanilla extract",
        "2 egg whites",
        "2 tablespoons white sugar",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 296 kcal",
        "Carbs > 44 g",
        "Cholesterol > 215 mg",
        "Fat > 7 g",
        "Protein > 11.9 g",
        "Sodium > 114 mg"
    ],
    "n": "Grandma's Float",
    "a": "Kaydell33",
    "r": "0",
    "s": 2,
    "des": "\"This is a recipe my grandma used to make for us when we were younger every time we went to her house, and we loved it! It is easy to make, and you can play with the flavoring too! Strawberry and vanilla are my favorite, as well adding both flavors into one batch!! :) Hope you enjoy it as much as we have! :)\"",
    "ins": "Whisk the flour and 2 tablespoons of white sugar together in a small bowl until combined; set aside. Whisk together the egg yolks, milk, and 1 teaspoon vanilla extract in a small saucepan until smooth. Place the saucepan over medium-high heat, and stir constantly. Once the mixture is warm, whisk in the flour mixture, and continue cooking until the sauce has thickened, about 5 minutes. Whisk constantly as the sauce cooks to keep it from scorching. Once thick, keep warm over low heat.\nBeat egg whites until foamy in a large glass or metal mixing bowl. Gradually add the remaining 2 tablespoons sugar, continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the egg whites should form a sharp peak that holds its shape. Finally, beat in the remaining 1 teaspoon vanilla extract.\nPour the hot sauce over the egg whites, and gently fold together using a rubber scraper until well incorporated. Do not mix vigorously, or the egg whites will deflate. Serve warm.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "20 m",
    "i": "581477.jpg",
    "o": "",
    "st": "allrecipes"
}