{
    "id": 216433,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 slices bacon",
        "1 tablespoon olive oil",
        "1 onion, diced",
        "1 tablespoon minced garlic",
        "4 jalapeno peppers, seeded and chopped",
        "1 1/2 pounds ground beef",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 tablespoon olive oil",
        "32 corn tortillas",
        "4 roma (plum) tomatoes, diced",
        "1 (8 ounce) package shredded Monterey Jack cheese"
    ],
    "nut": [
        "Calories > 664 kcal",
        "Carbs > 51.5 g",
        "Cholesterol > 97 mg",
        "Fat > 37.8 g",
        "Protein > 31.1 g",
        "Sodium > 628 mg"
    ],
    "n": "Tacos de Alambre",
    "a": "Tracy Rae Bowling",
    "r": "0",
    "s": 8,
    "des": "\"This mild, authentic recipe for beef taco topping is an adaptation of a favorite recipe from a local restaurant in Las Cruces, New Mexico. The steak you use may vary according to what's available and cost-effective at your local grocery. We divide this dish into several meals by refrigerating the beef and vegetable mixture and cooking the bacon fresh each time.\"",
    "ins": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes.  Drain the bacon slices on a paper towel-lined plate, reserving grease in the skillet. Crumble the bacon strips once cool.\nMeanwhile, heat 1 tablespoon of olive oil in a large skillet over medium heat. Stir in the onion, garlic, and jalapeno peppers; cook and stir until the onion has softened and turned translucent, about 5 minutes. Increase the heat to medium-high, and stir in the ground beef; season with salt and pepper. Cook and stir until the ground beef is crumbly and no longer pink, 10 to 12 minutes. Drain off any excess liquid.\nScrape the beef mixture into the skillet of bacon grease. Crumble the bacon into the beef, and stir until thoroughly combined. Keep warm over low heat.\nHeat 1 tablespoon of olive oil in a clean skillet over medium-high heat until hot. Place a tortilla into the pan, and place a generous spoonful of the meat filling onto the lower half of the tortilla. Cook until bubbles begin to form in the tortilla, then fold over the meat. Continue cooking until the taco is crisp and lightly browned on each side, 1 to 2 minutes total. Repeat with the remaining tortillas and meat mixture. Top the tacos with diced tomatoes and shredded Monterey Jack cheese to serve.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "582894.jpg",
    "o": "",
    "st": "allrecipes"
}