{
    "id": 216465,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons extra-virgin olive oil",
        "1 1/2 onion, chopped",
        "2 cloves garlic, pressed",
        "1/2 (750 milliliter) bottle dry white wine (such as Chenin Blanc)",
        "1/2 pound dry brown lentils",
        "1 (32 fluid ounce) container chicken stock",
        "2 teaspoons Italian seasoning",
        "1 teaspoon dried parsley",
        "1 teaspoon garlic powder",
        "1 tablespoon dried minced onion",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 194 kcal",
        "Carbs > 21.1 g",
        "Cholesterol > < 1 mg",
        "Fat > 5.7 g",
        "Protein > 7.4 g",
        "Sodium > 347 mg"
    ],
    "n": "Autumn Lentil Soup",
    "a": "bonappetit",
    "r": "0",
    "s": 8,
    "des": "\"This is a substantial soup with an amazing flavor. Finely minced carrot and fresh herbs are a nice addition to this soup; I add the carrots in with the onions in the extra-virgin olive oil at the start, and the fresh chopped herbs (parsley, cilantro, fresh mint, or whatever the creatures in the garden haven't devoured) just before serving as a garnish. My family prefers this with common brown lentils, but Umbrian or red lentils would work well here too. We have this soup with thin slices of baguette and a salad tossed with balsamic dressing.\"",
    "ins": "Heat the olive oil in a large saucepan or Dutch oven over medium heat. Stir in the onions and garlic; cook until the onions soften, turn translucent, and begin to brown, about 10 minutes. Pour in the white wine, and bring to a boil over high heat. Reduce heat to medium, and simmer 10 minutes.\nStir in the lentils, chicken stock, Italian seasoning, parsley, garlic powder, and dried onion. Bring to a simmer over high heat, then reduce heat to medium-low, cover, and simmer until the lentils are very tender, about 1 1/2 hours. Season to taste with salt and black pepper before serving.",
    "pt": "10 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "1083005.jpg",
    "o": "",
    "st": "allrecipes"
}