{
    "id": 216426,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (10 pound) whole turkey - thawed, neck and giblets removed",
        "1 lemon, cut in half",
        "salt and black pepper to taste",
        "1 small apple, peeled",
        "1 small onion, peeled",
        "1 small potato, peeled",
        "3 ounces butter",
        "6 ounces honey",
        "1 cup chicken stock (optional)"
    ],
    "nut": [
        "Calories > 816 kcal",
        "Carbs > 20.2 g",
        "Cholesterol > 286 mg",
        "Fat > 38.8 g",
        "Protein > 92.7 g",
        "Sodium > 342 mg"
    ],
    "n": "English Honey-Roasted Turkey",
    "a": "JLamb36",
    "r": "0",
    "s": 10,
    "des": "\"Because I usually have very herb- and chestnut-filled stuffing, I wanted a roast turkey that is simple and traditional. I picked up this recipe in England, and absolutely love it.  The gravy made from the pan drippings is heavenly!\"",
    "ins": "Pat the turkey dry inside and out with paper towels. Rub the cut lemon halves lightly over the skin of the turkey. Season inside and out with salt and pepper to taste. Place the lemon halves, apple, onion, and potato into the cavity of the turkey. Place into a close-fitting roasting pan.\nStir the butter and honey together in a small saucepan over medium-low heat until the butter has melted and the mixture is evenly blended. Spoon the honey mixture over the turkey, coating the entire outer surface. Allow to stand 30 minutes, reapplying the honey mixture several times.\nPreheat an oven to 400 degrees F (200 degrees C).\nBake the turkey in the preheated oven for 30 minutes, basting two or three times with the drippings and honey mixture. Reduce the temperature to 350 degrees F (175 degrees C), and cook 30 minutes more, basting frequently. If needed, use a cup of chicken stock to keep the pan juices from drying out.\nCover the turkey with aluminum foil, and continue roasting until no longer pink at the bone and the juices run clear, 1 1/2 to 2 hours longer. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). Remove the foil during the last 15 minutes and baste one last time.  Remove the turkey from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area 15 minutes before slicing.",
    "pt": "45 m",
    "ct": "2 h ",
    "tt": "3 h ",
    "i": "882985.jpg",
    "o": "",
    "st": "allrecipes"
}