{
    "id": 216487,
    "old_rating": "4.61111",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 large eggplants",
        "1 cup uncooked white rice",
        "2 cups water",
        "3 tablespoons olive oil",
        "2 cloves garlic, minced",
        "1/4 cup chopped fennel bulb",
        "1/2 pound bulk hot pork sausage (such as Jimmy DeanÂ®)",
        "1/2 pound ground beef",
        "1/2 cup chopped celery",
        "1/4 cup chopped onion",
        "1/4 cup chopped green bell pepper",
        "1 pinch cayenne pepper, or to taste",
        "1 dash hot pepper sauce (such as TabascoÂ®), or to taste",
        "1/2 cup fresh French bread crumbs",
        "2 1/2 tablespoons butter, melted"
    ],
    "nut": [
        "Calories > 486 kcal",
        "Carbs > 49.5 g",
        "Cholesterol > 58 mg",
        "Fat > 25.3 g",
        "Protein > 18 g",
        "Sodium > 440 mg"
    ],
    "n": "New Orleans Eggplant Casserole",
    "a": "Helen Ann Hebert",
    "r": "0",
    "s": 6,
    "des": "\"This dish may be served as a main course or as a side dish.  It is highly modifiable depending on your taste. Personally, I cannot eat onions and green peppers, so I skip those.  You can use less or more rice depending on whether you wish to serve as a main or a side.  If you do not like spicy food, use mild sausage or all ground beef and no cayenne pepper or hot sauce.  Some Cajun purists may complain, but as a bonafide Coon A**, I can assure you that some of us cannot always eat with such gusto. A true taste of the Big Easy.\"",
    "ins": "Slice the eggplants 3/4 inch thick, and sprinkle each side with salt. Allow slices to drain in colander set in the sink for 2 to 3 hours. Wipe off excess salt, but do not rinse slices. Lay the slices into a large skillet with about 2 or 3 tablespoons of water. Cover, and steam over medium heat until tender, about 15 minutes. Remove and cut the slices into 3/4 inch cubes.\nBring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender and the liquid has been absorbed, 20 to 25 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 2-quart casserole dish.\nHeat olive oil in a large skillet over medium heat, and cook the eggplant cubes for about 10 minutes to slightly dry them, stirring occasionally. Stir in garlic, and cook until fragrant, about 2 more minutes. Transfer the eggplant to a large bowl.\nCook the fennel in skillet until tender, 5 to 8 minutes; transfer into bowl with eggplant. In the same skillet, brown the pork sausage and ground beef, breaking the meat up into crumbles as it cooks, about 10 minutes. Add meat to eggplant mixture. Drain excess fat from skillet; cook celery, onion, and green pepper until the celery has started to become tender and  onion is translucent, 5 to 8 minutes. Transfer vegetables to bowl with eggplant and meat.\nStir cayenne pepper and hot sauce into the mixture, combining the eggplant and meat thoroughly; gently stir in the cooked rice. Check for seasoning, and add salt if necessary. Place the mixture into the prepared casserole dish. Sprinkle the casserole with crumbs, and drizzle with melted butter.\nBake in the preheated oven until hot, about 40 minutes.",
    "pt": "45 m",
    "ct": "1 h ",
    "tt": "4 h ",
    "i": "1564292.jpg",
    "o": "",
    "st": "allrecipes"
}