{
    "id": 216562,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons butter",
        "1/2 white onion, chopped",
        "2 cloves garlic, minced",
        "12 eggs",
        "1/2 cup milk",
        "6 croissants, split - tops set aside and bottoms torn into 1-inch pieces",
        "2 green onions, thinly sliced",
        "4 ounces smoked salmon, chopped",
        "1 cup shredded Monterey Jack cheese",
        "1 cup shredded Swiss cheese",
        "1 cup shredded mozzarella cheese",
        "2 tablespoons chopped fresh dill",
        "1 teaspoon salt",
        "freshly cracked black pepper to taste"
    ],
    "nut": [
        "Calories > 492 kcal",
        "Carbs > 24.1 g",
        "Cholesterol > 358 mg",
        "Fat > 32 g",
        "Protein > 26.9 g",
        "Sodium > 1053 mg"
    ],
    "n": "Croissant and Salmon Breakfast Casserole",
    "a": "SerenaBloom",
    "r": "0",
    "s": 8,
    "des": "\"Delicious breakfast casserole that is great for Sunday brunch or Christmas morning!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nMelt butter in a large skillet over medium heat, and cook and stir the onion and garlic until onion is translucent, about 5 minutes. Remove from heat. In a bowl, beat the eggs with the milk until frothy and thoroughly blended.\nPlace the torn pieces of croissant bottom into a 9x13-inch nonstick baking dish in an even layer. Top the croissant pieces with the cooked onions and garlic in a layer, followed by layers of green onions, smoked salmon, Monterey Jack cheese, Swiss cheese, mozzarella cheese, and dill. Pour the egg mixture evenly over the casserole, and sprinkle with salt and black pepper. Arrange the tops of the croissants over the casserole, pressing them down into the egg mixture to moisten.\nBake the casserole in the preheated oven until the croissant tops are browned and the eggs are set, about 50 minutes. Serve hot.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "833279.jpg",
    "o": "",
    "st": "allrecipes"
}