{
    "id": 216560,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup butter",
        "1/2 cup confectioners' sugar",
        "2 teaspoons water",
        "1/2 teaspoon salt",
        "1 teaspoon vanilla extract",
        "1 teaspoon orange extract (optional)",
        "2 cups all-purpose flour",
        "1 cup quick-cooking rolled oats",
        "1 (16 ounce) package white confectionery candy coating pieces",
        "1 cup flaked coconut",
        "1 teaspoon colored candy sprinkles (optional)"
    ],
    "nut": [
        "Calories > 164 kcal",
        "Carbs > 17.2 g",
        "Cholesterol > 16 mg",
        "Fat > 10 g",
        "Protein > 1.9 g",
        "Sodium > 86 mg"
    ],
    "n": "Pennsylvania Snow Drops",
    "a": "melly",
    "r": "0",
    "s": 36,
    "des": "\"A Christmas cookie that we have made in our family for years; nobody knows where it came from. It's been revised over the years but still is the same.\"",
    "ins": "Preheat  oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nPlace butter and confectioners' sugar into a mixing bowl, and beat with an electric mixer until creamy and well combined. Stir in the water, salt, vanilla extract, orange extract, flour, and quick rolled oats to form a crumbly, dry dough. Pinch off about 1 1/2 tablespoon of dough per cookie, roll into a ball about 1 inch in diameter. Place on the prepared baking sheet about 2 inches apart.\nBake in the preheated oven until the cookies are lightly browned, about 20 minutes. Remove from oven, and cool to a warm temperature.\nWhile cookies are baking, place the confectionery candy pieces into a microwave-safe bowl, and cook in microwave oven with low power for about 10 seconds at a time, stirring once the candy begins to melt, until the coating is liquid, smooth and warm (not hot).\nDip the still-warm cookies in the white coating, and place on prepared baking sheet to cool. While coating is still liquid, sprinkle each cookie with flaked coconut. Decorate some cookies with candy sprinkles, if desired. You can also spoon the coating over the cookies while still on the baking sheet before decorating with the coconut and sprinkles.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "770425.jpg",
    "o": "",
    "st": "allrecipes"
}