{
    "id": 216687,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups vegetable oil for frying",
        "3 eggs",
        "1/4 cup milk",
        "1 cup bread flour",
        "1/2 cup brown sugar and butter flavored breakfast cereal (such as Cap'n CrunchÂ®), finely ground",
        "5 pounds large chicken wings, patted dry with paper towels",
        "3/4 cup unsalted butter, melted",
        "3/4 cup hot pepper sauce (such as Frank's RedHotÂ®)",
        "1/4 cup bourbon whiskey",
        "3 tablespoons honey",
        "1 tablespoon Worcestershire sauce",
        "1 tablespoon habanero pepper sauce"
    ],
    "nut": [
        "Calories > 320 kcal",
        "Carbs > 11.5 g",
        "Cholesterol > 94 mg",
        "Fat > 23.7 g",
        "Protein > 12.8 g",
        "Sodium > 384 mg"
    ],
    "n": "Lubed-Up Hot Wings",
    "a": "Chip Homer",
    "r": "0",
    "s": 15,
    "des": "\"A Pittsburgh favorite! Classic hot wings with a sweet and spicy kick. Serve with bleu cheese or ranch dressing.\"",
    "ins": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nWhisk together eggs and milk in a bowl. In a separate bowl, stir together the bread flour and ground cereal. Coat the wings in the egg mixture, then in the cereal mixture.\nFry the wings, 6 at a time, in the oil until golden brown, 12 to 15 minutes. Let wings drain on paper towels.\nPreheat oven to 200 degrees F (95 degrees C). Line several baking sheets with parchment paper.\nWhile wings are frying, mix the melted butter, hot sauce, bourbon, honey, Worcestershire sauce, and habanero sauce in a large plastic tub with a lid. Place the wings into the sauce, close the lid, and shake to coat wings with sauce.\nPlace the wings on the prepared baking sheets and bake in the preheated oven until the sauce is slightly sticky, about 10 minutes.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4465467.jpg",
    "o": "",
    "st": "allrecipes"
}