{
    "id": 216616,
    "old_rating": "4.88462",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large onion, quartered",
        "1 large carrot, cut into 4 pieces",
        "1 stalk celery, cut into 4 pieces (optional)",
        "1 leftover chicken carcass",
        "10 cloves garlic",
        "15 whole black peppercorns",
        "4 quarts cold water, or more as needed",
        "1 teaspoon sea salt, or to taste"
    ],
    "nut": [
        "Calories > 11 kcal",
        "Carbs > 2.6 g",
        "Cholesterol > 0 mg",
        "Fat > 0.1 g",
        "Protein > 0.4 g",
        "Sodium > 123 mg"
    ],
    "n": "Rapid Chicken Stock",
    "a": "Liam Walshe",
    "r": "0",
    "s": 16,
    "des": "\"This simple yet flavorful chicken stock is great for everything...and the pressure cooker is the magic tool here! You need a decent-sized pressure cooker for this recipe. The result is the same thing you'd get with 8+ hours of conventional simmering. This is a great way to use a leftover chicken carcass from dinner the night before, even if it's one of those rotisserie chickens from the store! I like to season the stock at the end, so that you can accurately control the amount of salt.\"",
    "ins": "Place the onion, carrot, celery, chicken carcass, garlic cloves, and peppercorns into a large pressure cooker. Add water until it reaches 2/3 of the way up the pot (or until you reach the maximum fill line, according to your pressure cooker's instructions) and seal the lid.\nBring the pressure cooker up to full pressure over high heat. Reduce the heat to medium-low and cook, maintaining full pressure, for 30 minutes.\nRemove the pot from the heat and allow the pressure to drop naturally. Do not use quick-release methods.\nWhen the pressure has dropped, remove the lid. Strain the stock into a bowl and discard the chicken bones and vegetables. Let the stock cool to room temperature, and then transfer to the refrigerator (see Editor's Note). When the stock is cold, any fat will have risen to the surface and solidified. Skim the fat off completely, and season to taste with sea salt.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "4458791.jpg",
    "o": "",
    "st": "allrecipes"
}