{
    "id": 216614,
    "old_rating": "4.9",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds venison steaks",
        "1 1/2 teaspoons seasoned salt, divided (see Note)",
        "1 cup all-purpose flour",
        "4 tablespoons vegetable oil",
        "1/2 teaspoon ground cumin",
        "1/2 cup onion, halved and sliced",
        "2 beef bouillon cubes",
        "1/2 teaspoon dried Mexican oregano",
        "1 bay leaf",
        "2 dried red chile peppers",
        "2 cups water"
    ],
    "nut": [
        "Calories > 492 kcal",
        "Carbs > 26.3 g",
        "Cholesterol > 171 mg",
        "Fat > 19.4 g",
        "Protein > 50 g",
        "Sodium > 869 mg"
    ],
    "n": "Texas Venison",
    "a": "Craig",
    "r": "0",
    "s": 4,
    "des": "\"This is a great way to spice up venison for those who tend to shy away from it. It is similar to Carne Guisada, and goes well as a main course or a filling in a tortilla. Venison comes out moist and tender in a slow cooker or pressure cooker. This also works well with beef or pork.\"",
    "ins": "Lightly season the venison steaks with 1/2 teaspoon of Papa's Seasoning Salt (see below). Cut the steaks into bite-sized pieces. Mix the flour with 1 teaspoon of Papa's salt; reserve 1 tablespoon of the flour mixture and set aside. Toss the cubed meat in the seasoned flour.\nHeat the oil in the pressure cooker or a skillet over medium-high heat. Add the meat cubes in batches and cook until richly browned on all sides. Remove the meat and set aside.\nReduce the heat to medium, and stir the reserved tablespoon of seasoned flour and the ground cumin into the pan drippings. Cook and stir until the flour has lost its raw smell and is lightly browned, about 5 minutes. Add the sliced onion and cook, stirring often, until the onion has softened, about 5 minutes.\nReturn the meat to the pan, along with the beef bouillon cubes, Mexican oregano, bay leaf, and chile peppers (remove the stems, but leave them whole). Pour in the water and seal the pressure cooker, turning the heat up to high.\nBring the pressure up to high and reduce the heat to maintain the pressure. Cook at high pressure for 15 minutes. Turn off the heat and let the pressure drop naturally. Remove the lid. Remove the chile peppers and bay leaf; squeeze the pulp from the peppers, returning the pulp to the pan and discarding the skins and the bay leaf. Taste and adjust the seasonings.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "1 h",
    "i": "957637.jpg",
    "o": "",
    "st": "allrecipes"
}