{
    "id": 216643,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "4 potatoes, peeled and cubed",
        "2 cups brown rice",
        "2 beets, peeled and quartered",
        "6 eggs in their shells",
        "2 tablespoons garlic powder",
        "2 tablespoons seasoned salt",
        "1 cup water",
        "salt and pepper to taste",
        "1/4 cup olive oil",
        "water to cover"
    ],
    "nut": [
        "Calories > 281 kcal",
        "Carbs > 41.3 g",
        "Cholesterol > 82 mg",
        "Fat > 9.9 g",
        "Protein > 7.3 g",
        "Sodium > 509 mg"
    ],
    "n": "Parve Cholent",
    "a": "MaLizGa",
    "r": "0",
    "s": 12,
    "des": "\"'Cholent' is a slow-cooking stew made for the Jewish Sabbath. 'Parve' simply means meatless. You may have trouble pronouncing the name but you won't have trouble devouring this simple yet hearty stew. This recipe leaves lots of room for variation, so feel free to personalize to your taste.\"",
    "ins": "Heat 2 tablespoons of olive oil in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more.\nLayer half the potatoes on the bottom of a slow cooker. Add the cooked onions and rice; top with the remaining potatoes and beets.\nNestle the eggs into the mixture: they should be almost completely submerged when you add the water.\nMix the garlic powder and seasoned salt into 1 cup of water. Pour over the cholent. Season with salt and pepper. Drizzle with 1/4 cup of olive oil.\nAdd water to cover. Too much water will make your cholent mushy; not enough may cause it to burn.\nCover with the lid and set your slow cooker on low; cook overnight.",
    "pt": "25 m",
    "ct": "19 h ",
    "tt": "19 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}