{
    "id": 216617,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 large sweet potatoes",
        "1/4 teaspoon salt, or to taste",
        "1/2 cup dark brown sugar",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1 cup orange juice",
        "2 tablespoons butter, cut into pieces"
    ],
    "nut": [
        "Calories > 253 kcal",
        "Carbs > 52.9 g",
        "Cholesterol > 10 mg",
        "Fat > 4 g",
        "Protein > 2.7 g",
        "Sodium > 213 mg"
    ],
    "n": "Pressure Cooker Sweet Potatoes",
    "a": "Spyce",
    "r": "0",
    "s": 6,
    "des": "\"Sweet potatoes are cooked in the pressure cooker and topped with a orange-brown sugar glaze. I love these with roasted or grilled chicken and Southern-style green beans.\"",
    "ins": "Peel and cut sweet potatoes in half lengthwise, then cut each half into 1/4-inch slices. Place the slices into the pressure cooker's steamer basket. Sprinkle slices with salt.\nCombine brown sugar, cinnamon, and nutmeg in a small bowl. Mix well.\nPour orange juice into the cooker (see Editor's Note, below). Place the trivet and the steamer basket with the sweet potatoes into the pot. Sprinkle the potatoes with brown sugar mixture. Place butter pieces on top.\nLock the lid into place and bring the cooker up to full pressure (15 pounds per square inch) over high heat. Once pressure is reached, reduce heat to low and cook for 7 minutes.\nQuickly release the pressure using the method recommended by your cooker's manufacturer. Do not discard the cooking liquid.\nRemove the steamer basket from the cooker and carefully place potatoes into a serving dish. Return the cooker to the stove and bring cooking liquid to a boil over high heat. Reduce the heat to medium and simmer, stirring frequently, until the cooking liquid is reduced and syrupy, 5 to 7 minutes. The mixture should coat the back of a spoon.\nPour syrup over sweet potatoes and serve.",
    "pt": "15 m",
    "ct": "12 m",
    "tt": "30 m",
    "i": "4045606.jpg",
    "o": "",
    "st": "allrecipes"
}