{
    "id": 216751,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (.25 ounce) envelope unflavored gelatin",
        "1/4 cup cold water",
        "2 cups milk",
        "2 eggs, separated",
        "1/4 cup white sugar",
        "1/8 teaspoon salt",
        "1 teaspoon vanilla extract",
        "1/4 cup cold heavy whipping cream",
        "1/2 cup flaked coconut"
    ],
    "nut": [
        "Calories > 162 kcal",
        "Carbs > 15.8 g",
        "Cholesterol > 75 mg",
        "Fat > 8.5 g",
        "Protein > 5.9 g",
        "Sodium > 126 mg"
    ],
    "n": "Elegant Coconut Bavarian Cream",
    "a": "cezar",
    "r": "0",
    "s": 6,
    "des": "\"A family recipe usually saved for special occasions, this looks beautiful served in wine or martini glasses. It has a rich taste with a light texture. I recommend starting early on this, as the dessert needs time to set in the refrigerator. Great for when the oven is occupied with other dishes!\"",
    "ins": "Sprinkle the gelatin over the cold water and set aside to soften for 10 minutes. In a saucepan over medium-high heat, bring the milk just to the boiling point.\nWhisk the egg yolks with the sugar and salt. In a steady stream, pour the hot milk into the egg yolks, whisking constantly.\nAdd the softened gelatin to the hot custard and stir until fully dissolved. Stir in the vanilla extract. Let the mixture cool to room temperature.\nPreheat an oven to 350 degrees F (175 degrees C). Toast the coconut on a baking sheet until golden, about 4 minutes, stirring once or twice. (You may use a toaster oven for this step). Transfer to a plate to cool, reserving about 1 tablespoon toasted coconut for garnishing.\nWhip the egg whites until medium-stiff peaks form; gently fold the egg whites into the cooled custard mixture.\nWhip the cream until medium-stiff peaks form. Fold the cream into the custard mixture, along with the toasted coconut. Pour the Bavarian cream into serving glasses and chill for at least three hours before serving. Garnish with the reserved toasted coconut.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "3 h ",
    "i": "598032.jpg",
    "o": "",
    "st": "allrecipes"
}