{
    "id": 216796,
    "old_rating": "4.65",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "flour for dusting",
        "1 (17.5 ounce) package frozen puff pastry sheets (2 sheets), thawed",
        "water, as needed",
        "6 small tart apples - peeled, cored, and sliced thinly",
        "1 1/2 teaspoons ground cinnamon",
        "1 tablespoon brown sugar",
        "1/4 cup toasted slivered almonds",
        "1/4 cup butterscotch chips",
        "1 tablespoon butter, melted",
        "1/2 teaspoon white sugar"
    ],
    "nut": [
        "Calories > 474 kcal",
        "Carbs > 50 g",
        "Cholesterol > 4 mg",
        "Fat > 28.4 g",
        "Protein > 5.8 g",
        "Sodium > 169 mg"
    ],
    "n": "Cheater's Apple Strudel",
    "a": "Melody Couture",
    "r": "0",
    "s": 8,
    "des": "\"Using prepared puff pastry makes baking this apple strudel a little easier and quicker than some of the more 'traditional' recipes! You can serve this hot or cold. It's delicious topped with cream!\"",
    "ins": "Preheat an oven to 375 degrees F (190 degrees C). Lightly dust a working surface with flour. Line a baking sheet with parchment paper.\nOn your prepared work surface, join the two sheets of puff pastry by their short edges to make a long rectangle. Brush water along edges and press down gently with fingertips to seal.\nMix the apple slices, cinnamon, brown sugar, almonds, and butterscotch chips together in a bowl until evenly combined; spoon the mixture onto one of the long edges of the pastry. Fold one side of pastry over the mixture and roll into a long strudel. Make sure to seal at both ends. Brush pastry with melted butter; make two-inch diagonal slits the length of the strudel with a sharp knife. Transfer to the prepared baking sheet.\nBake in the preheated oven for 15 minutes. Sprinkle the sugar over the top of the strudel and return to oven until the pasty is golden brown and flaky, another 15 to 20 minutes.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "4463875.jpg",
    "o": "4460464.jpg,3056345.jpg,3037240.jpg,801754.jpg,714849.jpg,714848.jpg",
    "st": "allrecipes"
}