{
    "id": 216784,
    "old_rating": "4.39535",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Dough:",
        "1 cup warm milk (110 degrees F/45 degrees C)",
        "3 (0.6 ounce) cakes cake yeast",
        "6 1/2 tablespoons butter, room temperature",
        "2 eggs",
        "1/2 teaspoon ground cardamom",
        "2 tablespoons white sugar",
        "1/4 teaspoon salt",
        "4 cups all-purpose flour, or as needed",
        "Filling:",
        "2/3 cup butter, softened",
        "1/2 cup white sugar",
        "2 tablespoons ground cinnamon"
    ],
    "nut": [
        "Calories > 289 kcal",
        "Carbs > 35.4 g",
        "Cholesterol > 58 mg",
        "Fat > 14.4 g",
        "Protein > 4.9 g",
        "Sodium > 148 mg"
    ],
    "n": "Danish Cinnamon Snails",
    "a": "malene_2",
    "r": "0",
    "s": 15,
    "des": "\"Americans would call these cinnamon rolls--but this version is the original Danish version and it's absolutely wonderful. They are traditionally served with coffee or tea at Christmas time, and they are to die for!\"",
    "ins": "Pour the warm milk into a mixing bowl and mash in the fresh cake yeast. Mix in 6 1/2 tablespoons of soft butter, eggs, cardamom, 2 tablespoons sugar, salt, and 3 1/2 cups of the flour. Use a wooden spoon to mix the dough. If it's very sticky, mix in the remaining 1/2 cup of flour. Cover the bowl and let the dough rise for 30 minutes.\nCream together the 2/3 cup butter and 1/2 cup sugar. Stir in the cinnamon.\nTransfer the dough to a floured surface and knead it until it's firm, about 3 minutes. Divide the dough in half; roll each half into a rectangle no more than 1/2 inch thick. Spread each rectangle with half the filling.\nStack one layer of dough and filling on top of the other rectangle of dough, filling-side up. Roll the dough up, starting with the edge closest to you, to form a long log. Cut the log into 1 inch-thick slices.\nPreheat an oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper, or grease a baking dish or two cake pans.\nPlace the rolls on the prepared baking sheet, spacing them about 3 inches apart. If you like pull-apart rolls, arrange them in a greased baking dish or cake pans, spacing the rolls about 1 inch apart. Place the uneven end pieces on the baking sheet cut-side up for the best presentation. Let the rolls rest 20 minutes before baking.\nBake the snails in the preheated oven until golden brown, about 10 minutes. Pull-apart rolls will take longer to bake: after 10 minutes, reduce the oven temperature to 350 degrees F (175 degrees C) and bake the rolls until the sides are fully set, about 10 minutes longer. Cover the baking dish with foil if the rolls begin to get too brown.",
    "pt": "1 h",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "1060016.jpg",
    "o": "4520642.jpg,4480785.jpg,4467915.jpg,4460140.jpg,3991598.jpg,3048478.jpg",
    "st": "allrecipes"
}