{
    "id": 216742,
    "old_rating": "4.65714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound mild pork sausage (such as Jimmy DeanÂ®)",
        "1 onion, chopped",
        "1 clove garlic, minced",
        "1 red bell pepper, chopped",
        "1 green bell pepper, chopped",
        "1 (2 pound) package frozen shredded hash brown potatoes",
        "12 eggs, beaten",
        "1 (16 ounce) package shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 449 kcal",
        "Carbs > 16.5 g",
        "Cholesterol > 251 mg",
        "Fat > 37.3 g",
        "Protein > 21.8 g",
        "Sodium > 579 mg"
    ],
    "n": "Dutch Oven Mountain Man Breakfast",
    "a": "Mrs. Mik",
    "r": "0",
    "s": 12,
    "des": "\"Our kids request this meal every time we go camping, and seeing as we have about 15 laying chickens, it's a great way to use up eggs! Please note, this makes a LOT! You may want to consider sharing it with your camping friends or, if you're like our family and enjoy leftovers, just save the leftovers for the day you're leaving the campground and need a quick breakfast without a lot of mess and fuss. You can easily re-heat it in a microwave or in a skillet over low heat. Feel free to add more spices and personalize this recipe to suite your taste buds!\"",
    "ins": "Build a campfire and allow the fire to burn until it has accumulated a bed of coals.\nCook and stir the sausage, onion, and garlic in a 12-inch cast iron Dutch oven with lid, raised over the coals to medium-high heat, until the sausage is no longer pink and the onion is tender. Stir in the red bell pepper, green bell pepper, and hash brown potatoes until evenly mixed. Cook, stirring occasionally, until the hash browns are hot and the peppers are tender, about 15 minutes.\nPour the beaten eggs evenly over the top of the potatoes, allowing them to sink into the potatoes. Cover the Dutch oven, and place 6 to 9 coals underneath, and 12 to 18 on top. Allow to bake until the eggs are firm, about 40 minutes. Sprinkle with Cheddar cheese, cover, and continue cooking until the cheese has melted, about 5 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "2249806.jpg",
    "o": "4503131.jpg,3806169.jpg,3424560.jpg,2213594.jpg,810718.jpg,654431.jpg",
    "st": "allrecipes"
}