{
    "id": 216727,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 red potatoes, cubed",
        "3 cloves garlic, peeled",
        "1/4 cup butter, melted",
        "1/2 cup fat free milk",
        "2 tablespoons heavy cream (optional)",
        "1/2 teaspoon salt",
        "1/4 cup grated Parmesan cheese",
        "2 cups shredded cooked chicken",
        "1 (15.25 ounce) can sweet yellow corn, drained",
        "1 (8 ounce) package corn bread mix (such as JiffyÂ®)",
        "1/4 cup white sugar",
        "1 egg",
        "1 tablespoon butter"
    ],
    "nut": [
        "Calories > 371 kcal",
        "Carbs > 47.4 g",
        "Cholesterol > 68 mg",
        "Fat > 14.1 g",
        "Protein > 15.8 g",
        "Sodium > 791 mg"
    ],
    "n": "Redskin Hodge Podge",
    "a": "Krissi Miller",
    "r": "0",
    "s": 9,
    "des": "\"This is a wonderful and fairly easy recipe that incorporates homemade red-skinned mashed potatoes, corn, chicken, and cornbread as the topping.\"",
    "ins": "Place the potatoes and garlic into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two. Combine potatoes and garlic with 1/4 cup melted butter, milk, heavy cream, and salt. Mash the potatoes until smooth, then stir in Parmesan cheese.\nPreheat an oven to 375 degrees F (190 degrees C).\nMix the chicken and corn in a 9x13-inch baking dish, then spread the mixture into an even layer. Spread the mashed potatoes on top; set aside. Combine the cornbread mix, sugar, and egg in a bowl. Spread the mixture over the mashed potatoes.\nBake in the preheated oven until golden brown and a toothpick inserted into the center comes out clean, 20 to 25 minutes. Spread the remaining 1 tablespoon of butter over the cornbread, and allow to melt completely before serving.",
    "pt": "45 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "597951.jpg",
    "o": "",
    "st": "allrecipes"
}