{
    "id": 216743,
    "old_rating": "4.3908",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 1/2 cups white sugar",
        "1/4 cup water",
        "2/3 cup butter",
        "1 (12 ounce) bag semisweet chocolate chips",
        "2 teaspoons vanilla extract",
        "4 eggs",
        "1 (12 ounce) bag semisweet chocolate chips",
        "1 cup coarsely chopped walnuts"
    ],
    "nut": [
        "Calories > 451 kcal",
        "Carbs > 55.4 g",
        "Cholesterol > 67 mg",
        "Fat > 26.4 g",
        "Protein > 5.7 g",
        "Sodium > 228 mg"
    ],
    "n": "Boyfriend Brownies",
    "a": "LC Debra",
    "r": "0",
    "s": 16,
    "des": "\"These are very chocolaty, dense brownies that go great served warm with ice cream!  My brother had a girlfriend that used to make these for him. Try these with pecans instead of walnuts, or using white chocolate chips for half of the chocolate.\"",
    "ins": "Preheat an oven to 325 degrees F (165 degrees C). Combine the flour, baking soda, and salt in a small bowl; set aside. Grease and flour a 9x9-inch baking dish.\nCombine the sugar, water, and butter in a saucepan. Cook and stir over medium heat until the butter has melted and the sugar has dissolved. Remove from the heat and stir in one bag of chocolate chips and the vanilla extract until the chocolate has melted. Pour the mixture into a mixing bowl, and beat in the eggs one at a time until smooth. Fold in the flour mixture until incorporated, then fold in the remaining bag of chocolate chips along with the walnuts. Pour into prepared pan.\nBake in the preheated oven until the top is dry and the edges have started to pull away from the sides of the pan, 45 to 55 minutes. Cool completely before cutting into squares to serve.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "3 h",
    "i": "602408.jpg",
    "o": "3514480.jpg,3295756.jpg,3285638.jpg,973943.jpg,930612.jpg,922422.jpg",
    "st": "allrecipes"
}