{
    "id": 216764,
    "old_rating": "3.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 tablespoon minced fresh garlic",
        "1 tablespoon chopped onion",
        "1/2 red bell pepper, diced",
        "1 cup papaya - peeled, seeded and cubed",
        "1 habanero pepper, seeded and chopped (wear gloves)",
        "1 teaspoon cornstarch",
        "1 tablespoon water",
        "2 tablespoons lime juice",
        "1 tablespoon lime juice",
        "1 tablespoon melted butter",
        "3 (4 ounce) fillets mahi mahi",
        "3 tablespoons sliced almonds",
        "1 pinch salt"
    ],
    "nut": [
        "Calories > 282 kcal",
        "Carbs > 10.4 g",
        "Cholesterol > 92 mg",
        "Fat > 16.8 g",
        "Protein > 22.8 g",
        "Sodium > 130 mg"
    ],
    "n": "Mahi Mahi with Papaya",
    "a": "katyoung99",
    "r": "0",
    "s": 3,
    "des": "\"Crunchy, spicy, with a slightly sweet tanginess.\"",
    "ins": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nHeat olive oil in a saucepan over medium heat. Stir in the garlic and onion; cook and stir until the onion begins to soften, about 2 minutes. Add the red bell pepper, papaya, and habanero pepper. Continue cooking a few more minutes until the bell pepper begins to soften. Stir together the cornstarch, water, and 2 tablespoons of lime juice. Stir into the papaya sauce until thickened, stirring constantly. Keep the sauce warm over very low heat.\nStir 1 tablespoon of lime juice together with the melted butter, and brush on the mahi mahi fillets. Place onto a  broiler pan.\nCook under the preheated broiler for 4 minutes, then turn the fish over, and continue cooking for 4 minutes more. Sprinkle the almonds over the fish and return to the broiler until the almonds are crisp and the fish flakes easily with a fork, about 2 minutes. Season to taste with salt and serve with the papaya sauce.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "40 m",
    "i": "599647.jpg",
    "o": "",
    "st": "allrecipes"
}