{
    "id": 216772,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup dry navy beans",
        "3 cups water",
        "3 cups water",
        "1 large meaty smoked ham bone",
        "6 tablespoons chopped fresh parsley",
        "2 whole bay leaves",
        "3 tablespoons dried minced onion flakes",
        "1 tablespoon minced fresh garlic",
        "1/2 teaspoon dried thyme leaves",
        "1/2 teaspoon dry mustard powder",
        "1/2 teaspoon chili powder",
        "1/2 teaspoon paprika",
        "5 cups water",
        "1 cup sliced celery",
        "1 tablespoon olive oil",
        "1 (28 ounce) can tomato puree",
        "1/2 cup ketchup",
        "3 tablespoons chicken soup base",
        "3 tablespoons molasses",
        "1 tablespoon brown sugar",
        "1/4 teaspoon cracked black pepper, or to taste",
        "1/2 cup uncooked small shell pasta"
    ],
    "nut": [
        "Calories > 154 kcal",
        "Carbs > 29.4 g",
        "Cholesterol > < 1 mg",
        "Fat > 2.1 g",
        "Protein > 6.7 g",
        "Sodium > 931 mg"
    ],
    "n": "Mom's Best Ham and Bean Soup",
    "a": "Sharon Hill",
    "r": "0",
    "s": 12,
    "des": "\"It's a long list of ingredients... but sooo good. My mother made the best Ham and Bean Soup, my recipe is AS CLOSE to hers as I can remember; today my own family and friends love this soup. Oh, my hubby insists this soup alone would be worth another proposal!\"",
    "ins": "Place dry beans and 3 cups of water in a saucepan. Bring to a boil, cover, remove from heat, and allow to stand for 1 hour. Drain and rinse beans.\nPlace 3 more cups fresh water into a large pressure cooker. Add the soaked beans and ham bone, and stir in parsley, bay leaves, dried onion flakes, garlic, thyme, dry mustard, chili powder, and paprika. Seal the pressure cooker, and heat to 15 pounds per square inch. Cook under pressure for 7 minutes; add 1 minute for every 1,000 feet above sea level. Remove from heat, and allow pressure to subside naturally.\nWhen pressure has reduced, open the lid of the cooker. Stir in 5 more cups of water, celery, olive oil, tomato puree, ketchup, chicken soup base, molasses, brown sugar, and cracked black pepper. Bring to a boil, reduce heat to low, and simmer the soup until the beans are tender, about 45 minutes. Stir in shell pasta, and simmer until the pasta is tender, about 15 more minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "634294.jpg",
    "o": "",
    "st": "allrecipes"
}