{
    "id": 216708,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/4 cup margarine",
        "3 tablespoons sunflower seeds",
        "2 tablespoons grated Parmesan cheese",
        "2/3 cup milk, divided",
        "3 tablespoons vegetable oil",
        "1 onion, sliced",
        "2 carrots, chopped",
        "3 turnips, chopped",
        "1 small yam, peeled and diced",
        "2 stalks celery, sliced",
        "2 cups chopped broccoli",
        "1/2 teaspoon ground coriander",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon dried basil",
        "salt and ground black pepper to taste",
        "1 (19 ounce) can diced tomatoes",
        "1 cup vegetable broth"
    ],
    "nut": [
        "Calories > 448 kcal",
        "Carbs > 65.8 g",
        "Cholesterol > 4 mg",
        "Fat > 16.2 g",
        "Protein > 9.9 g",
        "Sodium > 509 mg"
    ],
    "n": "Yam and Turnip Stew with Mini-Biscuits",
    "a": "VeggieBecca",
    "r": "0",
    "s": 6,
    "des": "\"A hearty fall stew with little sunflower seed and Parmesan biscuits to put on top instead of dumplings.  I use the lid from a spice jar to cut them out. I usually make a double recipe of the mini-biscuits as people seem to love them so much.  They really make the stew. Any vegetables will do, in approximately the same quantities.\"",
    "ins": "Preheat an oven to 375 degrees F (190 degrees C).\nWhisk the flour and baking powder together in a mixing bowl. Cut the margarine into the flour mixture with a knife or pastry blender until the mixture resembles fine crumbs. Fold the sunflower seeds and Parmesan cheese into the mixture. Add most of the milk and mix to a firm dough.\nTurn the dough out onto a lightly floured surface and lightly roll to a thickness of 3/8 inch. Cut into 2-inch rounds and arrange on a baking sheet. Brush the tops of the biscuits with the remaining milk.\nBake in the preheated oven until the biscuits are lightly browned and no longer wet in the middle, about 20 minutes. Set aside.\nHeat the oil in a large pot over medium-high heat; cook and stir the onion, carrots, turnips, yam, celery, and broccoli in the hot oil until the vegetables are soft, about 10 minutes. Season with the coriander, oregano, basil, salt, and pepper; add the tomatoes and vegetable broth. Simmer the mixture until hot and the liquid has reduced slightly, about 20 minutes. Serve in bowls topped with the mini-biscuits.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "995762.jpg",
    "o": "",
    "st": "allrecipes"
}