{
    "id": 216713,
    "old_rating": "4.40909",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "2 cloves garlic, minced",
        "1 tablespoon chopped fresh rosemary, or more to taste",
        "salt and ground black pepper to taste",
        "6 skinless, boneless chicken breast halves",
        "1 (8 ounce) package cream cheese, softened",
        "1 (10.5 ounce) can cream of mushroom soup",
        "1 cup white wine"
    ],
    "nut": [
        "Calories > 363 kcal",
        "Carbs > 5.8 g",
        "Cholesterol > 100 mg",
        "Fat > 22.8 g",
        "Protein > 25.7 g",
        "Sodium > 481 mg"
    ],
    "n": "New York Chicken",
    "a": "crankymezzo",
    "r": "0",
    "s": 6,
    "des": "\"I got this recipe from an old boyfriend's mom. It's simple and delicious and makes a great dish for company. Serve over rice or pasta. I like to use spinach fettuccine because it adds color to the dish. But it's ALL good! Broccoli or asparagus makes a great accompanying veggie. If you are making this as a company dish, you can serve it 'Family Style' by placing your rice or pasta on a large dish or platter and putting the chicken and sauce over the top.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).\nHeat the olive oil in a skillet over high heat. Cook the garlic in the hot oil until fragrant, 2 to 3 minutes. Season with the rosemary, salt, and pepper. Add the chicken to the skillet and cook until completely browned, about 5 minutes per side; transfer the chicken to a 9x13-inch baking dish, reserving the pan drippings.\nStir the cream cheese, cream of mushroom soup, white wine, and the drippings from the skillet together in a bowl; pour over the chicken.\nBake in the preheated oven until the chicken is cooked completely and no longer pink in the middle, 45 to 50 minutes.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "615496.jpg",
    "o": "",
    "st": "allrecipes"
}