{
    "id": 216732,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1/4 teaspoon baking soda",
        "1 tablespoon baking powder",
        "1 cup unsweetened cocoa powder",
        "5 tablespoons unsweetened cocoa powder",
        "1 (0.13 ounce) package unsweetened strawberry-flavored drink mix",
        "1/4 teaspoon salt",
        "5 tablespoons butter",
        "2 1/2 cups white sugar",
        "4 eggs",
        "2 1/2 teaspoons vanilla extract, or to taste",
        "1 3/4 cups milk",
        "1/4 cup heavy cream",
        "2 cups heavy cream",
        "2 (0.13 ounce) packages unsweetened strawberry-flavored drink mix",
        "36 ounces white chocolate, chopped"
    ],
    "nut": [
        "Calories > 238 kcal",
        "Carbs > 29 g",
        "Cholesterol > 39 mg",
        "Fat > 13 g",
        "Protein > 3.3 g",
        "Sodium > 85 mg"
    ],
    "n": "Strawberry-Chocolate Mini Cupcakes with White Chocolate Ganache",
    "a": "FutureChefElizabeth",
    "r": "0",
    "s": 48,
    "des": "\"I made these for Valentine's Day 2010, during the school week and on a sprained ankle! SUPER easy to do, and delicious! I drew from different recipes all over the net, but changed things up to make them all my own.\"",
    "ins": "Preheat an oven to 300 degrees F (150 degrees C). Line the cups of four 24-cup mini cupcake pans with paper liners. Sift the flour, baking soda, baking powder, all the cocoa powder, 1 package of strawberry drink mix, and salt in a mixing bowl.\nIn a separate bowl, beat butter and white sugar with an electric mixer on medium speed until light and fluffy; beat the eggs in, one at a time, adding each egg after the previous one has been completely incorporated. Beat in vanilla extract; mix in the flour-cocoa mixture in 4 additions, alternating each time with milk. Reduce mixer speed to low, and beat in the cream. Fill the cupcake cups 1/2 to 3/4 full.\nBake in the preheated oven until a toothpick inserted into the center of a cupcake comes out clean, 10 to 15 minutes. Remove to racks, and allow the cupcakes to cool.\nBring 2 cups of cream almost to a boil in a saucepan over medium-high heat; dissolve the 2 packets of strawberry drink mix into the cream. Stir in the white chocolate until the chunks melt and the mixture becomes melted, smooth, and shiny. Set aside and allow ganache to cool to warm temperature (about 95 degrees F/ 35 degrees C). Frost each cupcake with ganache.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "586455.jpg",
    "o": "",
    "st": "allrecipes"
}