{
    "id": 216800,
    "old_rating": "4.57895",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (7 ounce) beef tenderloin steaks",
        "salt and ground black pepper to taste",
        "1/4 cup butter",
        "1 (6 ounce) can crab, drained",
        "1 pound asparagus, tough ends snapped",
        "1 packet dry Bearnaise sauce mix (such as KnorrÂ®)",
        "1 cup whole milk",
        "1/2 cup butter"
    ],
    "nut": [
        "Calories > 1289 kcal",
        "Carbs > 21.8 g",
        "Cholesterol > 436 mg",
        "Fat > 97.4 g",
        "Protein > 83.2 g",
        "Sodium > 1355 mg"
    ],
    "n": "Jessica's Steak Oscar",
    "a": "Jessica E Wilson",
    "r": "0",
    "s": 2,
    "des": "\"This is a fabulous recipe that I tried in a steakhouse and re-created the recipe.  It is very rich and absolutely divine!\"",
    "ins": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source. Sprinkle the filets with salt and pepper.\nIn a small saucepan over low heat, melt 1/4 cup of butter; gently stir in the crab meat, and simmer while you broil the filets.\nBroil the filets until they reach the desired stage of doneness; for medium (slightly pink in the center), broil 10 to 12 minutes on the first side and 6 minutes on the second side. Set the filets aside to rest.\nPlace a steamer insert into a skillet, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil over high heat. Add the asparagus, recover, and steam until just tender, 2 to 6 minutes depending on thickness.\nWhisk Bearnaise sauce mix with milk in a saucepan. Add 1/2 cup of butter, and bring the sauce to a boil over medium heat, whisking constantly; reduce heat to a simmer, and whisk until sauce has thickened, about 1 minute.\nTo assemble, top each broiled filet with crab meat, then half the asparagus; spoon Bearnaise sauce to taste over the asparagus.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "650810.jpg",
    "o": "",
    "st": "allrecipes"
}