{
    "id": 216868,
    "old_rating": "4.23333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup oyster sauce",
        "3 tablespoons Dijon mustard",
        "3 tablespoons hoisin sauce",
        "2 tablespoons grated fresh ginger",
        "3 tablespoons honey, or to taste",
        "1 1/2 tablespoons soy sauce",
        "2 bunches green onions, cut into 2 inch pieces",
        "8 pork chops",
        "1 1/2 teaspoons cornstarch, or as desired",
        "1 tablespoon water",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 166 kcal",
        "Carbs > 15.6 g",
        "Cholesterol > 36 mg",
        "Fat > 4.6 g",
        "Protein > 15.8 g",
        "Sodium > 491 mg"
    ],
    "n": "Honey Hoisin Pork Chops",
    "a": "Denise",
    "r": "0",
    "s": 8,
    "des": "\"Very quick, easy pork chop recipe!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nWhisk together the oyster sauce, Dijon mustard, hoisin sauce, ginger, honey, and soy sauce in a bowl until combined; stir in the green onions. Spread about 1/4 of the mixture into the bottom of a 9x13-inch baking dish. Arrange the pork chops over the sauce in a single layer, and pour the remaining sauce over the chops, covering them completely.\nBake in the preheated oven until the chops are no longer pink at the center and the juices run clear, 30 to 40 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Baste once or twice while baking.\nDrain the liquid in the baking dish into a saucepan. Turn on the oven's broiler, and place the chops underneath the broiler until caramelized and brown, 1 to 2 minutes.\nWhisk the cornstarch with water in a small bowl, and whisk the mixture into the pan juices. Set the saucepan over medium heat, and bring the sauce to a simmer, whisking constantly until thickened, 1 to 2 minutes. Season to taste with salt and black pepper. Serve sauce with chops.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "2428410.jpg",
    "o": "",
    "st": "allrecipes"
}