{
    "id": 216812,
    "old_rating": "4.375",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup butter",
        "1 onion, chopped",
        "3 stalks celery, chopped",
        "1 (4 ounce) can sliced mushrooms, drained",
        "1 (6 ounce) package long grain and wild rice mix",
        "1 1/2 cups water",
        "1 (10.75 ounce) can condensed golden mushroom soup",
        "1 cup sour cream",
        "1 tablespoon curry powder",
        "4 bone-in chicken thighs, skin removed",
        "salt and ground black pepper to taste",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 642 kcal",
        "Carbs > 50.1 g",
        "Cholesterol > 134 mg",
        "Fat > 36 g",
        "Protein > 30 g",
        "Sodium > 1569 mg"
    ],
    "n": "Curry Chicken and Rice",
    "a": "gubby420",
    "r": "0",
    "s": 4,
    "des": "\"I found this recipe and it sounded so good, but it served 100! I tweaked to serve 4 and use ingredients we like, and the results were great! I've got permission to make again, and I know I will. I love to use bone-in chicken thighs, but boneless breasts or thighs would work very well also.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x9-inch baking dish.\nMelt butter in a large saucepan over medium heat, and cook the onion and celery until the onion is slightly tender, about 3 minutes; stir in mushrooms, and cook 1 more minute, stirring often. Mix in the package of rice mix and water; bring to a boil, cover, and simmer until the rice is tender, about 15 minutes.\nMix the golden mushroom soup, sour cream, and curry powder together in a bowl. Stir about 1 1/2 cup of the soup mixture into the rice, reserving 1/2 cup of soup mixture for later. Spread the rice mixture into the bottom of the prepared baking dish. Sprinkle the chicken thighs with salt and black pepper, and arrange over the rice. Cover the chicken thighs with the reserved 1/2 cup of soup mixture. Sprinkle the casserole with Parmesan cheese.\nBake in the preheated oven until the chicken thighs are no longer pink at the bone and the juices run clear, 50 to 60 minutes. An instant-read thermometer inserted into the thickest part of a thigh, not touching bone, should read  165 degrees F (74 degrees C).",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4107491.jpg",
    "o": "",
    "st": "allrecipes"
}