{
    "id": 216888,
    "old_rating": "4.89948",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup all-purpose flour",
        "3/4 cup bacon drippings",
        "1 cup coarsely chopped celery",
        "1 large onion, coarsely chopped",
        "1 large green bell pepper, coarsely chopped",
        "2 cloves garlic, minced",
        "1 pound andouille sausage, sliced",
        "3 quarts water",
        "6 cubes beef bouillon",
        "1 tablespoon white sugar",
        "salt to taste",
        "2 tablespoons hot pepper sauce (such as TabascoÂ®), or to taste",
        "1/2 teaspoon Cajun seasoning blend (such as Tony Chachere'sÂ®), or to taste",
        "4 bay leaves",
        "1/2 teaspoon dried thyme leaves",
        "1 (14.5 ounce) can stewed tomatoes",
        "1 (6 ounce) can tomato sauce",
        "2 teaspoons gumbo file powder",
        "2 tablespoons bacon drippings",
        "2 (10 ounce) packages frozen cut okra, thawed",
        "2 tablespoons distilled white vinegar",
        "1 pound lump crabmeat",
        "3 pounds uncooked medium shrimp, peeled and deveined",
        "2 tablespoons Worcestershire sauce",
        "2 teaspoons gumbo file powder"
    ],
    "nut": [
        "Calories > 296 kcal",
        "Carbs > 12.1 g",
        "Cholesterol > 144 mg",
        "Fat > 17.9 g",
        "Protein > 20.9 g",
        "Sodium > 855 mg"
    ],
    "n": "Good New Orleans Creole Gumbo",
    "a": "dailyrecipedoctor",
    "r": "0",
    "s": 20,
    "des": "\"I am going to give you my gumbo recipe. I learned to cook from my mother and grandmother who were born and raised in New Orleans and really knew how to cook. Most of the time, you could not get them to write down their recipes because they used a 'pinch' of this and 'just enough of that' and 'two fingers of water,' and so on. This recipe is a combination of both of their recipes which I have added to over the years. Serve over hot cooked rice. The gumbo can be frozen or refrigerated and many people like it better the next day. Bon appetit!\"",
    "ins": "Make a roux by whisking the flour and 3/4 cup bacon drippings together in a large, heavy saucepan over medium-low heat to form a smooth mixture. Cook the roux, whisking constantly, until it turns a rich mahogany brown color. This can take 20 to 30 minutes; watch heat carefully and whisk constantly or roux will burn. Remove from heat; continue whisking until mixture stops cooking.\nPlace the celery, onion, green bell pepper, and garlic into the work bowl of a food processor, and pulse until the vegetables are very finely chopped. Stir the vegetables into the roux, and mix in the sausage. Bring the mixture to a simmer over medium-low heat, and cook until vegetables are tender, 10 to 15 minutes. Remove from heat, and set aside.\nBring the water and beef bouillon cubes to a boil in a large Dutch oven or soup pot. Stir until the bouillon cubes dissolve, and whisk the roux mixture into the boiling water. Reduce heat to a simmer, and mix in the sugar, salt, hot pepper sauce, Cajun seasoning, bay leaves, thyme, stewed tomatoes, and tomato sauce. Simmer the soup over low heat for 1 hour; mix in 2 teaspoons of file gumbo powder at the 45-minute mark.\nMeanwhile, melt 2 tablespoons of bacon drippings in a skillet, and cook the okra with vinegar over medium heat for 15 minutes; remove okra with slotted spoon, and stir into the simmering gumbo. Mix in crabmeat, shrimp, and Worcestershire sauce, and simmer until flavors have blended, 45 more minutes. Just before serving, stir in 2 more teaspoons of file gumbo powder.",
    "pt": "1 h",
    "ct": "2 h ",
    "tt": "3 h ",
    "i": "4539151.jpg",
    "o": "4539151.jpg,4536290.jpg,4532410.jpg,4512502.jpg,4511723.jpg,4507480.jpg",
    "st": "allrecipes"
}