{
    "id": 216912,
    "old_rating": "4.67647",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups uncooked white rice",
        "3 cups water",
        "3 tablespoons butter",
        "1/2 cup chopped onion",
        "1/2 cup chopped celery",
        "3 tablespoons all-purpose flour",
        "1 teaspoon salt",
        "1 1/2 teaspoons curry powder",
        "2 cups milk",
        "1/2 teaspoon white sugar",
        "2 tablespoons lemon juice",
        "1 cup shredded mild Cheddar cheese, divided",
        "1 pound shelled, deveined cooked shrimp",
        "1 pinch paprika, or more to taste"
    ],
    "nut": [
        "Calories > 437 kcal",
        "Carbs > 46.7 g",
        "Cholesterol > 189 mg",
        "Fat > 14.9 g",
        "Protein > 27.3 g",
        "Sodium > 763 mg"
    ],
    "n": "Curried Shrimp Au Gratin",
    "a": "Morrie Shepard Killian",
    "r": "0",
    "s": 6,
    "des": "\"A velvety white sauce holds together shrimp and rice with a wonderful au gratin topping.\"",
    "ins": "Bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Set aside.\nPreheat oven to 375 degrees F (190 degrees C). Grease a 2-quart baking dish.\nMelt butter in a large saucepan, and cook the onion and celery over medium heat until tender, about 10 minutes, stirring occasionally. Whisk in the flour, salt, and curry powder until smooth; let cook for a minute or two. Gradually whisk in the milk, and bring almost to a boil, whisking constantly until thickened, about 5 minutes. Remove from heat, and stir in sugar, lemon juice, and 1/2 cup of Cheddar cheese; whisk until the cheese melts and the sauce is smooth.\nSpread the cooked rice out into the prepared baking dish, and top with the cooked shrimp in an even layer. Cover the shrimp with the cheese sauce; push the tines of a fork all over the casserole between the shrimp to allow the sauce to soak into the rice. Top the casserole with the remaining Cheddar cheese, and garnish with paprika.\nBake in the preheated oven until bubbly and browned, about 30 minutes.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "935611.jpg",
    "o": "",
    "st": "allrecipes"
}