{
    "id": 216948,
    "old_rating": "4.61111",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons vegetable oil",
        "1 1/2 pounds beef skirt steak, cut into strips",
        "kosher salt and ground black pepper to taste",
        "1/2 cup thinly sliced shallots",
        "2 tablespoons minced fresh ginger root",
        "1 teaspoon Thai red curry paste, or to taste",
        "1/2 cup low sodium chicken broth",
        "1 (14 ounce) can coconut milk",
        "1 tablespoon Asian fish sauce",
        "1 1/2 cups sliced zucchini",
        "1 large lime, zested and fruit cut into quarters",
        "1/3 cup chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 440 kcal",
        "Carbs > 11.4 g",
        "Cholesterol > 38 mg",
        "Fat > 35.6 g",
        "Protein > 24.8 g",
        "Sodium > 473 mg"
    ],
    "n": "Deb's Spicy Beef Curry",
    "a": "debola",
    "r": "0",
    "s": 4,
    "des": "\"Make sure you have all your ingredients prepared before heating your pan to ensure a smooth cooking process. Use your preferred vegetables, like zucchini, potato wedges, sugar snap peas, eggplant, etc.; serve over jasmine rice.\"",
    "ins": "Heat vegetable oil in a large skillet over medium-high heat. Sprinkle beef strips lightly with salt and black pepper, and sear the meat in the hot oil until well browned on both sides, 2 to 4 minutes, working in batches. Do not crowd beef. Transfer beef to a plate.\nReduce heat to medium, and cook the shallots until they start to become tender, about 2 minutes; stir in ginger and cook 1 additional minute. Stir in the curry paste, and fry 1 more minute. Mix in the chicken broth, and bring to a boil, scraping up and dissolving any brown flavor bits from the skillet. Stir in the coconut milk and fish sauce.\nIncrease heat to medium-high, and return beef and any juices to the skillet. Stir to coat with sauce, and simmer until tender, 10 to 12 minutes; stir in the zucchini, cover the skillet, and simmer until zucchini are tender, about 8 minutes. Mix in the lime zest; sprinkle with cilantro. Serve with lime wedges.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "713345.jpg",
    "o": "",
    "st": "allrecipes"
}