{
    "id": 216989,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups vanilla wafer crumbs",
        "3 tablespoons butter, softened",
        "2 (14 ounce) cans sweetened condensed milk",
        "1 cup fresh Key lime juice",
        "6 egg yolks",
        "1 teaspoon vanilla extract",
        "1 teaspoon Key lime zest",
        "2 stalks fresh rhubarb, diced",
        "2 cups chopped fresh strawberries",
        "1 cup white sugar",
        "1/2 cup water",
        "2 teaspoons powdered fruit pectin"
    ],
    "nut": [
        "Calories > 834 kcal",
        "Carbs > 133.3 g",
        "Cholesterol > 198 mg",
        "Fat > 29.4 g",
        "Protein > 13.2 g",
        "Sodium > 370 mg"
    ],
    "n": "Breezy Key Lime Pie with Strawberry Rhubarb Glaze",
    "a": "Diamonds_Nine",
    "r": "0",
    "s": 8,
    "des": "\"This tangy, sweet pie is sure to tickle the tastebuds of anyone who loves the crisp, tart flavor of fresh lime and berries. Made in a sweet vanilla crust, it's the perfect end to a light, fresh meal. It's best to start this pie at least 12 hours before you wish to serve it. Garnish with whipped cream, strawberry slices, or fresh twists of lime.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nMix together the vanilla wafer crumbs and butter in a bowl until thoroughly combined, and press the crust into the bottom and up the sides of a 10-inch pie dish.\nBeat the sweetened condensed milk, Key lime juice, egg yolks, vanilla extract, and Key lime zest in a bowl with an electric mixer until smooth; pour the filling into the prepared cookie crust.\nBake the pie in the preheated oven until center of pie is slightly jiggly, about 15 minutes.  Allow to cool for 10 minutes, then refrigerate.\nMix the rhubarb, strawberries, sugar, water, and pectin in a saucepan over medium heat, and bring to a boil. Stirring often, boil until the rhubarb and berries break down and the glaze begins to thicken and resemble jam, about 20 minutes. Remove from heat; cool to lukewarm. Glaze will thicken as it cools. Spread the glaze over the pie, and refrigerate until chilled. For best texture, allow pie to chill at least 8 hours before serving.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "9 h ",
    "i": "970183.jpg",
    "o": "",
    "st": "allrecipes"
}