{
    "id": 216900,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray (optional)",
        "1 egg",
        "1/4 cup vegetable oil",
        "2 (6 ounce) containers vanilla yogurt",
        "1/2 cup half-and-half cream, or more if needed",
        "1 cup bran cereal (such as Fiber OneÂ®), crushed",
        "3/4 cup chopped walnuts",
        "1/2 cup whole wheat flour",
        "1 cup all-purpose flour",
        "1/2 cup malitol brown sugar substitute (such as Sugar TwinÂ®)",
        "1 1/4 teaspoons baking soda",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg"
    ],
    "nut": [
        "Calories > 195 kcal",
        "Carbs > 19.9 g",
        "Cholesterol > 21 mg",
        "Fat > 11.6 g",
        "Protein > 5.3 g",
        "Sodium > 271 mg"
    ],
    "n": "Scrumptious Bran Muffin",
    "a": "delete",
    "r": "0",
    "s": 12,
    "des": "\"I like to optimize every carb or calorie I eat to be healthy as well as delicious.  This recipe combines bran and yogurt to make a really scrumptious muffin! These can also be made with fruit yogurt by leaving out the cinnamon and nutmeg and adding 1/2 cup fresh berries.\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C). Prepare 12 muffin tins with cooking spray.\nWhisk the egg, oil, yogurt, and half-and-half together in a bowl until combined; stir the bran cereal and walnuts into the mixture. Mix the whole wheat flour, all-purpose flour, brown sugar substitute, baking soda, salt, cinnamon, and nutmeg together in a separate bowl; add the flour mixture to the egg mixture and stir just until moistened. It's okay to add a little more half-and-half if the batter is too stiff. Fill each muffin cup about 3/4 full.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 18 minutes. Remove immediately to rack to cool.",
    "pt": "10 m",
    "ct": "18 m",
    "tt": "28 m",
    "i": "966210.jpg",
    "o": "",
    "st": "allrecipes"
}