{
    "id": 217046,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup butter, softened",
        "1/2 cup white sugar",
        "7 tablespoons all-purpose flour",
        "1 teaspoon vanilla extract",
        "2 egg whites, beaten",
        "1 (4 ounce) package cream cheese at room temperature",
        "1 cup confectioners' sugar",
        "1 teaspoon vanilla extract",
        "1/2 (8 ounce) container frozen whipped topping, thawed",
        "17 large fresh strawberries, divided"
    ],
    "nut": [
        "Calories > 199 kcal",
        "Carbs > 26.7 g",
        "Cholesterol > 21 mg",
        "Fat > 9.6 g",
        "Protein > 2.1 g",
        "Sodium > 67 mg"
    ],
    "n": "Cookie Tulips",
    "a": "CookBakeandDecorate",
    "r": "0",
    "s": 12,
    "des": "\"These cookies not only look fancy but they taste amazing too! Super easy to make and will impress the whole family!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper or a silicone sheet liner. Grease the outsides of 12 2-inch diameter baking glasses or small bowls.\nMash the butter and white sugar together in a bowl until smooth, and mix in the flour, 1 teaspoon of vanilla extract, and the egg whites to make a smooth batter. Drop about 2 1/2 tablespoons of the mixture onto the prepared baking sheet, and use a spoon or spatula to spread the dough out into a very thin circle about 7 inches in diameter. Repeat with the remaining batter.\nBake in the preheated oven until the cookies are very lightly browned at the edges and the centers are set, 7 to 9 minutes. Watch them carefully so they don't overbake. Pull the sheet from the oven, and immediately slip a spatula underneath each flat cookie; center and drape them over the greased glasses to harden into small wavy bowls. Allow to cool completely.\nWhile the cookies cool over their molds, beat the cream cheese and confectioners' sugar in a bowl until smooth; mix in 1 teaspoon of vanilla extract.  Remove green tops and cores from 5 strawberries; place them into a small bowl, and mash to a juicy, slightly lumpy texture; mix the strawberries into the cream cheese mixture. Gently fold the whipped topping into the strawberry cream until thoroughly combined.\nSpoon about 3 tablespoons of the strawberry cream into each cookie bowl, then top with a pretty fresh strawberry with green top. Store leftover cookies in an airtight container, and leftover cream in refrigerator.",
    "pt": "45 m",
    "ct": "15 m",
    "tt": "1 h",
    "i": "612263.jpg",
    "o": "",
    "st": "allrecipes"
}