{
    "id": 217031,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (14 ounce) package firm tofu",
        "1 pound ground beef",
        "1/2 cup sliced shiitake mushrooms",
        "2 tablespoons miso paste",
        "1 egg, lightly beaten",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1/4 teaspoon ground nutmeg",
        "1/4 cup mirin (Japanese sweet wine)",
        "2 tablespoons soy sauce",
        "1 teaspoon garlic paste",
        "1/4 teaspoon minced fresh ginger root",
        "1 tablespoon vegetable oil"
    ],
    "nut": [
        "Calories > 307 kcal",
        "Carbs > 8.9 g",
        "Cholesterol > 77 mg",
        "Fat > 18.1 g",
        "Protein > 25.5 g",
        "Sodium > 999 mg"
    ],
    "n": "Japanese Wafu Burger",
    "a": "Mariko eats",
    "r": "0",
    "s": 6,
    "des": "\"These traditional Japanese hamburgers are eaten without a bun. Shiitake mushrooms and tofu make them moist without falling apart, and a mirin glaze adds extra flavor. Absolutely delicious! I like to eat these with cooked daikon (Japanese radish) and rice.\"",
    "ins": "Place the block of tofu onto a plate and place another plate on top. Set a 3 to 5 pound weight on top (a container filled with water works well). Press the tofu for 10 to 15 minutes, then drain off and discard the accumulated liquid. Cut the tofu into 1/2-inch cubes.\nCombine the tofu, ground beef, shiitake mushrooms, miso paste, egg, salt, pepper, and nutmeg in a large bowl. Divide into 6 balls, and flatten into patties.\nStir together the mirin, soy sauce, garlic paste, and ginger in a small bowl. Set aside.\nHeat the vegetable oil in a large skillet over medium-high heat. Brown the burgers on each side, about 2 minutes per side. Reduce the heat to low; cover the pan and cook until the juices run clear, about 5 minutes. Drain and discard any excess grease.\nPour the soy sauce mixture into the pan. Keep moving the pan so the sauce doesn't burn, and flip the burgers occasionally to coat both sides with the sauce. The sauce will thicken and create a shiny glaze on the burgers. When all the sauce has been used up, the burgers are ready.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "614934.jpg",
    "o": "",
    "st": "allrecipes"
}