{
    "id": 217097,
    "old_rating": "4.35714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "8 small red potatoes, halved",
        "1 (16 ounce) jar four cheese Alfredo sauce",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon olive oil",
        "1/4 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "2 cloves garlic, minced",
        "1 1/2 pounds skinless, boneless chicken breast halves, cut into large chunks",
        "4 Roma (plum) tomatoes, quartered",
        "4 cloves garlic, peeled",
        "1 tablespoon chopped fresh rosemary",
        "12 pitted kalamata olives, cut in half"
    ],
    "nut": [
        "Calories > 559 kcal",
        "Carbs > 43.4 g",
        "Cholesterol > 95 mg",
        "Fat > 29.4 g",
        "Protein > 32.2 g",
        "Sodium > 1025 mg"
    ],
    "n": "Roasted Mediterranean Chicken",
    "a": "IrisMac",
    "r": "0",
    "s": 6,
    "des": "\"People go crazy over this dish! Perfect for company, or when you're taking someone a meal. One of my family's favorites. Very easy to make, too.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nPlace potatoes into a microwave-safe bowl, and cook in microwave oven on High setting for 2 minutes; turn potatoes over (watch for steam) and cook 2 more minutes on High. Set potatoes aside.\nMix together the Alfredo sauce, lemon juice, olive oil, salt, black pepper, and garlic in a bowl. Place the chicken pieces into the prepared baking dish, and generously brush chicken with about 1 cup of the mixture. Arrange the potatoes, tomatoes, and garlic cloves around the chicken. Brush the vegetables with the remaining sauce mixture. Sprinkle the chicken and vegetables with rosemary and olives.\nBake in the preheated oven until the chicken is cooked through and the potatoes are tender, about 25 minutes. An instant-read thermometer inserted into the chicken should read at least 160 degrees F (70 degrees C).",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "4468320.jpg",
    "o": "",
    "st": "allrecipes"
}