{
    "id": 217000,
    "old_rating": "4.56682",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup uncooked quinoa, rinsed",
        "2 cups water",
        "1 pound extra lean ground beef",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "4 cloves garlic, minced",
        "1 jalapeno pepper, seeded and minced",
        "1 tablespoon chili powder",
        "1 tablespoon ground cumin",
        "1 (28 ounce) can crushed tomatoes",
        "2 (19 ounce) cans black beans, rinsed and drained",
        "1 green bell pepper, chopped",
        "1 red bell pepper, chopped",
        "1 zucchini, chopped (optional)",
        "1 teaspoon dried oregano leaves",
        "1 teaspoon dried parsley",
        "salt and ground black pepper to taste",
        "1 cup frozen corn kernels, thawed",
        "1/4 cup chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 412 kcal",
        "Carbs > 52.8 g",
        "Cholesterol > 45 mg",
        "Fat > 11.5 g",
        "Protein > 27.5 g",
        "Sodium > 705 mg"
    ],
    "n": "Quinoa Chili",
    "a": "Gingerbreadgirlz",
    "r": "0",
    "s": 8,
    "des": "\"A super delicious chili which can be made vegetarian by excluding the ground beef.  With its unique texture and sweet savory flavor with a hint of spice, this recipe will have your friends asking for seconds!\"",
    "ins": "Bring the quinoa and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the quinoa is tender, and the water has been absorbed, about 15 to 20 minutes.\nHeat a large skillet over medium-high heat and stir in the ground beef. Cook and stir until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease; set beef aside.\nHeat the olive oil in a large pot over medium heat. Stir in the onion, garlic, and jalapeno pepper; cook and stir until the onion has softened and turned translucent, about 5 minutes. Season with chili powder and cumin; cook 1 minute more to release the flavor of the spices. Stir in the tomatoes, black beans, green bell pepper, red bell pepper, zucchini, oregano, and parsley. Season to taste with salt and black pepper. Simmer until the bell peppers are tender, about 20 minutes.\nOnce the red and green peppers are tender, stir in the quinoa, beef, and corn kernels. Return to a simmer, and cook 5 minutes to reheat. Stir in the cilantro to serve.",
    "pt": "30 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "878934.jpg",
    "o": "4502899.jpg,4488706.jpg,3503330.jpg,3503227.jpg,3379515.jpg,2727239.jpg",
    "st": "allrecipes"
}