{
    "id": 217021,
    "old_rating": "4.4375",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1/2 onion, chopped",
        "2 cloves garlic, crushed",
        "1 (15 ounce) can cannellini beans with liquid",
        "2 (14.5 ounce) cans diced tomatoes, drained",
        "1 cup shredded carrots",
        "3/4 pound cooked, shredded chicken",
        "1 (10 ounce) package frozen chopped spinach, thawed and drained",
        "4 cups chopped escarole",
        "1/2 cup shredded Pecorino-Romano cheese, or to taste"
    ],
    "nut": [
        "Calories > 418 kcal",
        "Carbs > 31.7 g",
        "Cholesterol > 71 mg",
        "Fat > 16.6 g",
        "Protein > 32.6 g",
        "Sodium > 768 mg"
    ],
    "n": "Super Filling Cannellini Bean and Escarole Dish",
    "a": "MaraAllen",
    "r": "0",
    "s": 4,
    "des": "\"Super easy and quick, well balanced dish. You can do a lot with it, or keep it as is and you won't regret it. So good on a cold night. If you want a creamier sauce, omit the diced tomatoes. Use any and all vegetables you want! You can use this as a sauce to put over pasta or over rice to get a complete protein with the beans (then you can omit the meat if you want a vegetarian dish).\"",
    "ins": "Heat olive oil in a large saucepan over medium heat, and cook and stir onion and garlic until the garlic turns golden brown and smells toasty, about 6 minutes. Do not let garlic burn. Pour in the cannellini beans, diced tomatoes, and carrots, cover, and bring to a boil. Reduce heat to a simmer, uncover the pot, and allow the mixture to simmer until slightly thickened, 5 to 8 more minutes.\nStir in the chicken and spinach, bring the mixture back to a boil, and mix in the escarole. Simmer until almost all the liquid is gone, about 10 minutes; turn off the heat, sprinkle with cheese, and cover; allow to stand for another 5 to 10 minutes to melt cheese.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "776245.jpg",
    "o": "",
    "st": "allrecipes"
}