{
    "id": 217070,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup butter",
        "1 small onion, minced",
        "1 cup ketchup",
        "3 tablespoons lemon juice",
        "2 tablespoons Worcestershire sauce",
        "3 tablespoons brown sugar",
        "2 tablespoons prepared yellow mustard",
        "salt and ground black pepper to taste",
        "4 (4 ounce) venison steaks",
        "2 teaspoons cornstarch",
        "1 tablespoon water"
    ],
    "nut": [
        "Calories > 337 kcal",
        "Carbs > 31 g",
        "Cholesterol > 110 mg",
        "Fat > 14.3 g",
        "Protein > 23.2 g",
        "Sodium > 1060 mg"
    ],
    "n": "Mom's Venison Barbeque Sauce",
    "a": "BK",
    "r": "0",
    "s": 4,
    "des": "\"We grew up on venison, and this is one of my Mom's great barbeque sauces to make with it.\"",
    "ins": "Preheat an oven to 325 degrees F (165 degrees C).\nMelt the butter in a large skillet over medium heat. Cook and stir the onion in the melted butter until softened, about 5 minutes. Stir the ketchup, lemon juice, Worcestershire sauce, brown sugar, and yellow mustard into the onion and butter; allow mixture to warm completely.\nHeat a separate skillet over medium-high heat. Season the steaks with salt and black pepper; cook in the skillet until browned on each side, 3 to 4 minutes per side. Transfer the steaks to a 9x13-inch baking dish. Pour the sauce from the skillet over the steaks.\nBake in the preheated oven until meat is cooked through and no longer pink in the middle, about 1 hour.\nTransfer the steaks from the baking dish to a platter, shaking any excess sauce from the meat. Stir the cornstarch and water together until smooth in a small bowl, then mix into the hot sauce remaining in the baking dish until the mixture begins to thicken; pour over the steaks to serve.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1560099.jpg",
    "o": "",
    "st": "allrecipes"
}