{
    "id": 217052,
    "old_rating": "4.34783",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup uncooked quinoa",
        "1/2 cup water",
        "2 tablespoons olive oil",
        "1/2 onion, chopped",
        "2 cloves garlic, chopped",
        "1 small apples - peeled, cored and chopped",
        "1/4 cup raisins",
        "2 tablespoons pine nuts",
        "4 mushrooms, chopped",
        "2 tablespoons white wine",
        "1 (1 pound) pork tenderloin",
        "1 pinch ground cinnamon",
        "1 pinch garam masala, or to taste",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 282 kcal",
        "Carbs > 21.2 g",
        "Cholesterol > 49 mg",
        "Fat > 12.5 g",
        "Protein > 21.2 g",
        "Sodium > 44 mg"
    ],
    "n": "Quinoa Stuffed Pork Tenderloin",
    "a": "cameal",
    "r": "0",
    "s": 4,
    "des": "\"I've been searching for stuffing recipes that don't use bread as I try and avoid gluten. This quinoa stuffing was my own solution. The sweetness of the apple and raisins in this dish plays nicely with baked yams. Hopefully there are others who will enjoy it as much as I did.\"",
    "ins": "Bring the quinoa and water to a boil in a saucepan over medium-high heat. Reduce heat to low, cover, and simmer until the quinoa is tender, and the water has been absorbed, about 15 minutes.\nHeat the olive oil in a skillet over medium heat. Cook and stir the onion, garlic, apples, raisins, pine nuts, and mushrooms until the onion has softened and turned translucent, about 8 minutes. Stir in the white wine, and cook another minute until the liquid has evaporated. Combine the apple mixture and quinoa until evenly mixed; set aside.\nPreheat an oven to 425 degrees F (220 degrees C).\nCut the pork tenderloin from one side through the middle horizontally to within one-half inch of the other side. Open the two sides and spread them out like an open book. Place between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the tenderloin with the smooth side of a meat mallet to a thickness of 1/2 inch.\nSeason the tenderloin on both sides with cinnamon, garam masala, salt, and black pepper. Spoon the quinoa filling onto the tenderloin, then roll up and secure with kitchen twine or toothpicks. Place onto a roasting pan.\nRoast in the preheated oven until the pork is no longer pink in the center, about 35 minutes. An instant-read thermometer inserted into the center of the filling should read 145 degrees F (63 degrees C). Cover with aluminum foil, and let rest for 10 minutes before slicing.",
    "pt": "40 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "1089696.jpg",
    "o": "",
    "st": "allrecipes"
}