{
    "id": 217032,
    "old_rating": "4.43478",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup cooked white or brown rice",
        "2 thin slices cooked ham, cubed",
        "2 tablespoons ketchup",
        "1 slice processed cheese food (such as Velveeta Â®) (optional)",
        "2 eggs",
        "salt and pepper to taste",
        "1 tablespoon ketchup",
        "1/4 teaspoon chopped fresh parsley"
    ],
    "nut": [
        "Calories > 521 kcal",
        "Carbs > 59.3 g",
        "Cholesterol > 403 mg",
        "Fat > 20.2 g",
        "Protein > 26.7 g",
        "Sodium > 1300 mg"
    ],
    "n": "Omuraisu (Japanese Rice Omelet)",
    "a": "S. Leigh",
    "r": "0",
    "s": 1,
    "des": "\"Similar in flavor and style to hash browns and eggs, this delicious Japanese dish works wonderfully as breakfast, lunch, or dinner, especially for those not completely ready for the traditional raw fish or white rice. This is my sister's most requested dish.\"",
    "ins": "Heat a skillet over medium heat, and coat with cooking spray. Add the cooked rice, 2 tablespoons ketchup, ham, and cheese, if using. Cook and stir until the ingredients are well combined and heated through, about 8 minutes. Scoop the mixture onto a serving bowl and shape into an oval.\nIn a bowl, beat eggs and salt and pepper. Heat a small skillet coated with cooking spray over medium heat. Add egg mixture; cook over medium heat. As eggs set, lift edges, letting uncooked portion flow underneath. Use a spatula to gently fold the eggs into a cocoon shape. When eggs are completely set, remove from the heat.\nPlace the omelet on top of the rice and run a knife length-wise through the top layer of the omelet. It should open like a butterfly and drape over the rice. Top with the final tablespoon of ketchup and a sprinkle of parsley.",
    "pt": "5 m",
    "ct": "15 m",
    "tt": "20 m",
    "i": "2263691.jpg",
    "o": "4503802.jpg,3334536.jpg,3088100.jpg,2604547.jpg,2309829.jpg,2238239.jpg",
    "st": "allrecipes"
}