{
    "id": 217095,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package linguine pasta",
        "2 skinless, boneless chicken breast halves",
        "1 head romaine lettuce, chopped",
        "1 green bell pepper, cut into 1/2-inch dice",
        "1/2 red onion, cut into 1/4-inch slices",
        "1 cucumber, sliced - or amount to taste",
        "2/3 cup safflower oil",
        "1/3 cup cider vinegar",
        "3/4 cup white sugar",
        "1 tablespoon poppy seeds",
        "1 teaspoon dry mustard powder",
        "4 green onions, chopped"
    ],
    "nut": [
        "Calories > 662 kcal",
        "Carbs > 86 g",
        "Cholesterol > 22 mg",
        "Fat > 28 g",
        "Protein > 20 g",
        "Sodium > 32 mg"
    ],
    "n": "Chicken Poppy Seed Pasta Salad",
    "a": "natalieR",
    "r": "0",
    "s": 6,
    "des": "\"A great tasting and adaptable recipe from my mother-in-law! Poppy Seed dressing, linguine, veggies, and grilled chicken. You just can't stop eating it! Every ingredient can be adjusted to suit the tastes and needs of your family.\"",
    "ins": "Preheat a grill pan over medium-high heat; lightly oil the grill.\nFill a large pot with lightly salted water and bring to a rolling boil. Cook the pasta uncovered, stirring occasionally, until cooked through but is still firm to the bite, about 11 minutes. Drain well.\nWhile pasta is cooking, grill the chicken breast halves until the meat is no longer pink in the middle and the juices run clear, 5 to 8 minutes per side. An instant-read thermometer inserted into the thickest part of a chicken breast should read 160 degrees F (70 degrees C). Allow to rest for about 5 minutes, then slice into bite-size pieces; keep warm.\nIn a large salad bowl, lightly toss together the grilled chicken, hot cooked linguine, romaine, green pepper, red onion, and cucumber.\nIn a separate bowl, whisk together safflower oil, cider vinegar, sugar, poppy seeds, dry mustard powder, and green onions until smooth and evenly blended. Pour the dressing over the salad to serve.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "636728.jpg",
    "o": "",
    "st": "allrecipes"
}