{
    "id": 217180,
    "old_rating": "4.44828",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (12 ounce) package colored candy coating melts, divided",
        "24 plain doughnut holes",
        "24 lollipop sticks",
        "1 tablespoon multicolored candy sprinkles (jimmies), as desired"
    ],
    "nut": [
        "Calories > 131 kcal",
        "Carbs > 14.5 g",
        "Cholesterol > 4 mg",
        "Fat > 7.6 g",
        "Protein > 1.7 g",
        "Sodium > 57 mg"
    ],
    "n": "Cake Pops",
    "a": "faydra999",
    "r": "0",
    "s": 24,
    "des": "\"Birthdays, Easter, baby showers, or just because they are cute and taste good! Got this recipe from a friend and I must share... enjoy! There are many ways to be creative when making these... there are dozens of different types of sprinkles, or you can use different colors of candy melts and no sprinkles if you wish. Almost everything can be bought at a crafts store.\"",
    "ins": "Place about 1/4 cup of candy melts into a small microwave-safe bowl, and melt in the microwave at 40 percent power for 30 seconds; stir the candy coating, and continue to heat for 30 second-intervals until the coating is just warm and completely melted.\nPoke a hole halfway through a doughnut hole with a lollipop stick, then dip the end of the stick into the melted coating and reinsert into the hole. This holds the doughnut hole firmly on the stick. Stick the doughnut pop upright into a block of plastic foam, and set into refrigerator for 1 hour to firm up.\nWhen pops are firmly attached to their sticks, melt the remaining candy coating dots in a microwave-safe bowl on 40 percent power for 1 minute; stir, and melt for 30-second intervals until the coating is warm and smoothly melted. Dip the doughnut hole into the coating, covering it completely. Hold the dipped pop over a bowl, and sprinkle with colored candy sprinkles. Return the decorated pops to the plastic foam block to set.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "839200.jpg",
    "o": "3808026.jpg,3624355.jpg,2577919.jpg,2510553.jpg,1075435.jpg,940010.jpg",
    "st": "allrecipes"
}