{
    "id": 217139,
    "old_rating": "3.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cream Filling:",
        "1/4 cup white sugar",
        "3/4 cup cream cheese, softened",
        "1 tablespoon lemon juice",
        "1 teaspoon lemon zest",
        "Cupcake Batter:",
        "2 1/4 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "3/4 cup butter",
        "1 1/4 cups white sugar",
        "6 eggs at room temperature",
        "1/4 cup fresh lemon juice",
        "2 teaspoons lemon zest"
    ],
    "nut": [
        "Calories > 186 kcal",
        "Carbs > 22.1 g",
        "Cholesterol > 70 mg",
        "Fat > 9.6 g",
        "Protein > 3.4 g",
        "Sodium > 159 mg"
    ],
    "n": "Lemon Cream Cupcakes",
    "a": "Tammy K",
    "r": "0",
    "s": 24,
    "des": "\"Cupcakes with a decadent surprise...cream cheese filling.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Grease 24 muffin cups, or line with paper muffin liners.\nPrepare the filling by beating 1/4 cup sugar, cream cheese, 1 tablespoon lemon juice, and 1 teaspoon lemon zest with an electric mixer until smooth. Scoop the filling into a pastry bag, and set aside. Whisk together the flour, baking powder, and salt in a mixing bowl; set aside.\nBeat butter and 1 1/4 cups sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in 1/4 cup lemon juice and 2 teaspoons lemon zest with the last egg.  Beat in the flour mixture, mixing until just incorporated.\nPour the batter into prepared pans, filling the muffin cups half full. Pipe about 1 tablespoon of the filling onto the center of each cupcake, then top with the remaining batter to fill the muffin cup 3/4 full.\nBake in the preheated oven until the tops are light golden brown, about 15 minutes. Cook completely on a wire rack.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "4467836.jpg",
    "o": "",
    "st": "allrecipes"
}