{
    "id": 217161,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons butter, divided",
        "1 small onion, chopped",
        "1 green bell pepper, chopped",
        "1 1/4 cups diced cooked ham",
        "1 (8 ounce) package sliced fresh mushrooms (optional)",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "salt to taste",
        "1/8 teaspoon ground black pepper",
        "1 cup milk",
        "1 cup shredded sharp Cheddar cheese",
        "6 hard-cooked eggs, chopped",
        "4 English muffins, split and toasted"
    ],
    "nut": [
        "Calories > 636 kcal",
        "Carbs > 37.7 g",
        "Cholesterol > 407 mg",
        "Fat > 39.2 g",
        "Protein > 33.5 g",
        "Sodium > 1115 mg"
    ],
    "n": "Easter Egg Stew",
    "a": "quanahs",
    "r": "0",
    "s": 4,
    "des": "\"Yummy way to use those Easter eggs -- great for brunch!\"",
    "ins": "Heat 1 tablespoon of butter in a skillet over medium heat, and cook and stir the onion and green pepper until the onion is translucent, about 5 minutes; stir in ham, and cook until ham is hot, about 1 more minute. Transfer to a bowl, and set aside. Melt 1 more tablespoon of butter in skillet over medium heat, and cook and stir the mushrooms until they have given up their liquid and started to brown, about 10 minutes. Add the cooked mushrooms to the ham mixture.\nMelt 2 tablespoons of butter in a saucepan over medium heat, and stir in flour, salt, and black pepper. Cook and stir until the flour lightens in color slightly, about 1 minute; gradually whisk in milk, and cook until thickened, whisking constantly. Do not boil. Mix in the Cheddar cheese, and stir until the cheese melts. Reduce heat to a bare simmer, and cook the sauce for about 10 more minutes. Whisk frequently.\nDrain any juices from the ham and mushroom mixture, and stir the mixture into the sauce; mix in the chopped hard-cooked eggs. Bring mixture back to a simmer, and serve over toasted English muffins.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "1124309.jpg",
    "o": "",
    "st": "allrecipes"
}