{
    "id": 217107,
    "old_rating": "4.27273",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "1 tablespoon baking soda",
        "1 teaspoon salt",
        "8 ounces semi-sweet chocolate, chopped",
        "2 cups butter, softened",
        "2 cups brown sugar",
        "1 1/2 cups white sugar",
        "1/2 cup cocoa powder, sifted",
        "2 teaspoons finely chopped chipotle peppers in adobo sauce",
        "4 eggs",
        "1 tablespoon vanilla extract",
        "1 tablespoon water",
        "1 1/2 cups chocolate chips",
        "1/2 cup white sugar"
    ],
    "nut": [
        "Calories > 278 kcal",
        "Carbs > 35.7 g",
        "Cholesterol > 48 mg",
        "Fat > 15.2 g",
        "Protein > 2.9 g",
        "Sodium > 248 mg"
    ],
    "n": "Dark Chocolate Chipotle Cookies",
    "a": "newman'smom",
    "r": "0",
    "s": 36,
    "des": "\"Double chocolate cookie with a little after-kick!\"",
    "ins": "Whisk together flour, baking soda, and salt in a bowl.\nPlace the chopped chocolate into a microwave-safe bowl; melt in the microwave oven at 40 percent power in 30-second intervals; stirring after each melting, until the chocolate is warm and smoothly melted, 1 to 3 minutes. Allow to cool slightly.\nIn a separate large bowl, use an electric mixer to beat the butter, brown sugar, 1 1/2 cup of white sugar, cocoa powder, and chipotle pepper until smooth. Add the eggs one at a time, beating each egg into the mixture before adding the next. Beat in the vanilla extract and water.\nMix the melted chocolate into the butter mixture. Gently stir in the flour mixture until incorporated. Mix in the chocolate chips. Cover bowl, and refrigerate dough for 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nPlace 1/2 cup sugar in a small bowl. Roll dough into small balls.  Roll balls in sugar to coat.  Place the cookies onto the prepared baking sheets, about 2 inches apart.\nBake in the preheated oven until cookies are set, 12 to 14 minutes. Allow to cool on the sheets for a minute or two before removing to racks to finish cooling.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "2980861.jpg",
    "o": "",
    "st": "allrecipes"
}