{
    "id": 217188,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup uncooked long-grain white rice",
        "1 pound ground lamb",
        "3 (10.75 ounce) cans condensed cream of mushroom soup, divided",
        "2 (14.5 ounce) cans stewed tomatoes, divided",
        "2 large red bell peppers, chopped",
        "1 large onion, chopped",
        "1/2 cup lemon juice",
        "1/4 lime, juiced, or to taste",
        "1 tablespoon minced garlic",
        "salt and ground black pepper to taste",
        "1 (8 ounce) jar grape leaves - stemmed, drained, and rinsed, divided"
    ],
    "nut": [
        "Calories > 365 kcal",
        "Carbs > 41.9 g",
        "Cholesterol > 38 mg",
        "Fat > 15.5 g",
        "Protein > 16.1 g",
        "Sodium > 1827 mg"
    ],
    "n": "World's Greatest Grape Leaves (Armenian)",
    "a": "MastahX",
    "r": "0",
    "s": 8,
    "des": "\"This recipe has been passed down for generations direct from Armenia. This is easy to prepare and all ingredients can be found at any major grocery store.\"",
    "ins": "Place rice in a bowl with water to cover; soak for about 1 hour. Drain.\nCombine lamb, 1 can mushroom soup, 1 can tomatoes, red bell peppers, rice, onion, lemon juice, lime juice, garlic, salt, and pepper in a bowl. Mix the filling together with clean hands.\nLine the bottom of a 4-quart pot with a single layer of grape leaves.\nPlace the remaining grape leaves on a flat work surface with smooth side down (ribs of leaves up). Place a rounded tablespoon of filling in the center of each grape leaf. Fold bottom sections of leaf over mixture, fold over sides, and roll toward the top of the leaf into a firm cylinder. Pack stuffed grape leaves tightly in the pot. Pour the remaining 2 cans mushroom soup, 1 can tomatoes, and any remaining filling mixture on top. Cover with a small plate to hold the leaves together.\nCook, covered, on low, until rice is tender and lamb is no longer pink, about 1 hour. Remove from heat; let stand for 20 minutes.",
    "pt": "50 m",
    "ct": "1 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}