{
    "id": 21717,
    "old_rating": "4.48837",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups packed light brown sugar",
        "3/4 cup all-purpose flour",
        "1/2 cup butter, chilled and diced",
        "2 teaspoons ground cinnamon",
        "1 cup chopped walnuts",
        "3 1/4 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "3/4 teaspoon baking soda",
        "3/4 cup butter, room temperature",
        "1 1/2 cups white sugar",
        "3 eggs",
        "2 teaspoons vanilla extract",
        "16 ounces plain low-fat yogurt",
        "2 Granny Smith apples - peeled, cored and finely diced"
    ],
    "nut": [
        "Calories > 482 kcal",
        "Carbs > 68.4 g",
        "Cholesterol > 75 mg",
        "Fat > 21 g",
        "Protein > 7.3 g",
        "Sodium > 234 mg"
    ],
    "n": "Streusel Apple Coffeecake",
    "a": "Kris",
    "r": "0",
    "s": 16,
    "des": "\"Wonderfully moist coffee cake with a layer of apples and streusel in the middle and more streusel on top. Very good.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a Bundt cake pan.\nTo make streusel: In a medium bowl, mix brown sugar, 3/4 cup flour, and cinnamon. Cut in the butter with a fork until crumbly. Stir in walnuts.\nIn a medium bowl, stir together 3 1/4 cups flour, baking powder, and baking soda. In a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time, mixing well after each. Then stir in the vanilla and yogurt. Gently stir in the flour mixture just until blended.\nPour 3 cups of the batter into the Bundt pan, sprinkle with 1/4 of the streusel, and layer with apples. Sprinkle with 1/2 the remaining streusel. Pour in the remaining batter, and top with the remaining 1/4 streusel. Lightly pat the top layer of streusel so it sticks to the cake batter.\nBake 50 to 60 minutes in the preheated oven, or until a toothpick inserted in the center comes out clean. Cool in the pan on a wire rack 15 minutes. Place cookie sheet over pan and carefully invert both. Remove Bundt pan, and let the cake cool completely.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "911756.jpg",
    "o": "4031306.jpg,2665753.jpg,1099130.jpg,912154.jpg,911757.jpg,490196.jpg",
    "st": "allrecipes"
}