{
    "id": 217132,
    "old_rating": "4.08621",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 small onion, very thinly sliced",
        "3 1/2 pounds boneless beef chuck roast",
        "1 teaspoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "4 large cloves garlic, very thinly sliced",
        "2 cups dry red wine",
        "2 (14.5 ounce) cans diced tomatoes, undrained",
        "1 cup beef broth",
        "1 tablespoon Worcestershire sauce",
        "1 tablespoon dried rosemary",
        "1 tablespoon dried oregano",
        "1 tablespoon dried basil",
        "2 teaspoons dried thyme",
        "1 teaspoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "3 tablespoons tomato paste (optional)"
    ],
    "nut": [
        "Calories > 393 kcal",
        "Carbs > 9.6 g",
        "Cholesterol > 90 mg",
        "Fat > 22.6 g",
        "Protein > 25 g",
        "Sodium > 866 mg"
    ],
    "n": "Beef Roast in Red Wine (Carni Arrosto al Vino Rosso)",
    "a": "Lou Kussard",
    "r": "0",
    "s": 8,
    "des": "\"A slow cooker recipe that turns the most economical roast of beef into a tender, succulent, delicious meal. The wine really enhances the flavor of the meat, and non-alcoholic wine can also be used to great success for those who prefer it. Coming home to the aroma of this slow-cooked beef will put you in mind of stepping into a nice Italian restaurant. Very comforting and inviting. Serve over rice or egg noodles.\"",
    "ins": "Place half the sliced onions into the bottom of a slow cooker. Season the roast on all sides with 1 teaspoon of kosher salt and 1 teaspoon of black pepper, and lay the roast on top of the onions. Place the remaining onions and garlic on top of the roast.\nIn a large bowl, mix the red wine, diced tomatoes, beef broth, Worcestershire sauce, rosemary, oregano, basil, thyme, 1 teaspoon kosher salt, and 1 teaspoon black pepper; pour the wine mixture over the roast. Cover the slow cooker, set the cooker to Low, and cook until tender, 8 to 10 hours.\nIf desired, thicken the sauce at the end of cooking by whisking tomato paste with pan juices until thoroughly combined. Set the cooker on High heat, and cook an additional 10 minutes.",
    "pt": "15 m",
    "ct": "8 h",
    "tt": "8 h ",
    "i": "867816.jpg",
    "o": "",
    "st": "allrecipes"
}