{
    "id": 217268,
    "old_rating": "4.3617",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter, softened",
        "3/4 cup packed brown sugar",
        "1 teaspoon vanilla extract",
        "2 1/4 cups all-purpose flour",
        "1 (14 ounce) can sweetened condensed milk",
        "1/2 cup miniature semisweet chocolate chips",
        "1/2 cup toffee baking bits",
        "1 pound chocolate confectioners' coating"
    ],
    "nut": [
        "Calories > 146 kcal",
        "Carbs > 19.3 g",
        "Cholesterol > 10 mg",
        "Fat > 7.9 g",
        "Protein > 2.1 g",
        "Sodium > 38 mg"
    ],
    "n": "Easy Chocolate Chip Cookie Dough Truffles",
    "a": "clapperkidsmom",
    "r": "0",
    "s": 48,
    "des": "\"I made some changes to a recipe that we found in our Taste of Home subscription that was somewhat bland.  It has become a favorite.  I am asked to make these truffles for EVERY occasion - even for other family members to take to work or other celebrations!\"",
    "ins": "Beat the butter and brown sugar with an electric mixer in a large bowl until smooth. Beat in the vanilla extract. Add flour, alternately with sweetened condensed milk, beating well after each addition.  Fold in the chocolate chips and toffee bits; mixing just enough to evenly combine.\nUsing a small cookie scoop, make 1-inch balls and place them on waxed paper lined baking sheets. Refrigerate until firm, about 1 hour.\nMelt the chocolate coating in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes (depending on your microwave).  Do not overheat or coating will scorch.  Dip the dough balls in the chocolate coating, allowing any excess to drip off. Place on waxed-paper lined baking sheets and sprinkle the truffles with additional toffee pieces. Refrigerate until firm, about 15 minutes. Store in the refrigerator.",
    "pt": "1 h ",
    "ct": "",
    "tt": "",
    "i": "695009.jpg",
    "o": "2884758.jpg,2331609.jpg,939717.jpg,815459.jpg,806696.jpg,789966.jpg",
    "st": "allrecipes"
}