{
    "id": 217289,
    "old_rating": "3.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cloves garlic, minced",
        "2 shallots, minced",
        "1/2 cup dry white wine (such as Sauvignon Blanc)",
        "1/2 cup chicken broth",
        "1 teaspoon red wine vinegar",
        "1/2 teaspoon mustard seeds",
        "1 pinch salt, if needed (optional)",
        "1 teaspoon freshly ground black pepper",
        "1 tablespoon chopped fresh thyme",
        "5 (3 ounce) skinless, boneless chicken thighs",
        "3 red potatoes, very finely diced",
        "4 ounces cremini mushrooms, chopped",
        "1/2 pound fresh shelled green peas"
    ],
    "nut": [
        "Calories > 241 kcal",
        "Carbs > 15.9 g",
        "Cholesterol > 53 mg",
        "Fat > 9.2 g",
        "Protein > 18.9 g",
        "Sodium > 64 mg"
    ],
    "n": "Easy Peasy Chicken Bake",
    "a": "teffymae",
    "r": "0",
    "s": 5,
    "des": "\"This was something I discovered in my never-ending quest to find simple, one-pan recipes that serve a nice balance of protein and savory vegetables.  I tend to keep cooked grains around that I just reheat and serve it over.  Barley is my favorite, but it also goes well with quinoa, rice, couscous, etc.  The sauce is delectable.  I like to add in a splash of red wine vinegar to the marinade, as I feel it really brings the flavors to life. Enjoy!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.\nMix together the garlic, shallots, white wine, chicken broth, red wine vinegar, mustard seed, salt, black pepper, and fresh thyme in a bowl, and set aside.\nPlace the chicken thighs into the prepared baking dish, and scatter the potatoes, mushrooms, and peas around the dish. Pour the liquid mixture over the chicken and vegetables, lifting the thighs slightly to allow the flavors to spread through the whole dish.\nBake in the preheated oven until the chicken is no longer pink in the center, the juices run clear, and an instant-read meat thermometer inserted into the center of a thigh reads at least 165 degrees F (75 degrees C), about 40 minutes. Allow dish to stand for 5 to 10 minutes before serving.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}