{
    "id": 217276,
    "old_rating": "4.43478",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups water",
        "1 teaspoon chicken bouillon granules (optional)",
        "2 teaspoons butter",
        "1 (10 ounce) box couscous",
        "2 tablespoons olive oil",
        "1/2 red bell pepper, chopped",
        "1/2 yellow bell pepper, chopped",
        "1/2 orange bell pepper, chopped",
        "1/2 onion, chopped",
        "1/4 teaspoon garlic powder, or to taste",
        "1/2 pound boneless chicken tenders, cut into bite sized pieces",
        "2 (14.5 ounce) cans diced tomatoes",
        "1 (14.5 ounce) can black beans, drained",
        "1 splash dry white wine (optional)",
        "1/4 cup shredded Cheddar cheese (optional)"
    ],
    "nut": [
        "Calories > 584 kcal",
        "Carbs > 70 g",
        "Cholesterol > 66 mg",
        "Fat > 15.1 g",
        "Protein > 36.5 g",
        "Sodium > 935 mg"
    ],
    "n": "Couscous a la Me!",
    "a": "Sabrina",
    "r": "0",
    "s": 4,
    "des": "\"At 9 weeks pregnant with full-on morning sickness and food aversion, I was craving something with black beans, chicken and tomatoes, but couscous sounded good too. After a search online, nothing popped up so I created this. Turned out pretty good. Enjoy! Next time I'm going to add cream cheese and mix it in. I bet it'll be even better.\"",
    "ins": "Bring the water to a boil in a saucepan with the chicken bouillon and the butter; pour over the couscous in a large bowl. Cover the bowl with plastic wrap and allow the couscous to absorb the moisture entirely, 5 to 7 minutes. Fluff with a fork. Set aside.\nHeat the olive oil in a large skillet over high heat. Cook the red, yellow, and orange bell pepper with onion in the hot oil until softened, about 5 minutes; season with the garlic powder. Add the chicken to the skillet and continue cooking until the chicken is no longer pink in the center and the juices run clear, about 5 minutes. Stir the couscous, tomatoes, black beans, and white wine into the mixture; continue cooking and stirring until heated through, 2 to 3 minutes. Top with the cheese to serve.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "35 m",
    "i": "659751.jpg",
    "o": "",
    "st": "allrecipes"
}