{
    "id": 217267,
    "old_rating": "4.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 ounces cream cheese, softened",
        "1 tablespoon sour cream",
        "10 pickled jalapeno pepper slices, or to taste - chopped",
        "2 ciabatta sandwich rolls",
        "4 teaspoons butter",
        "8 tortilla chips, crushed",
        "1/2 cup shredded Colby-Monterey Jack cheese"
    ],
    "nut": [
        "Calories > 528 kcal",
        "Carbs > 40.9 g",
        "Cholesterol > 89 mg",
        "Fat > 34 g",
        "Protein > 16.5 g",
        "Sodium > 1121 mg"
    ],
    "n": "Jalapeno Popper Grilled Cheese Sandwich",
    "a": "BrandyE",
    "r": "0",
    "s": 2,
    "des": "\"This is an awesome spin on a plain grilled cheese sandwich. Feel free to alter it to  your liking. The ciabatta bread is not typical grilled cheese material but the crunch of the buttery grilled chewy bread goes perfect with this jalapeno filling. You can also use sourdough bread.\"",
    "ins": "Combine the cream cheese, sour cream, and pickled jalapeno in a small bowl. Set aside. Preheat skillet over medium heat.\nSlice each roll in half horizontally, then slice the rounded tops off the ciabatta rolls to make a flat top half. Spread 1 teaspoon butter on the doughy cut side of the bottom bun and 1 teaspoon butter on the now flattened top bun. Place half of the cream cheese mixture, half of the crushed chips, and half of the shredded cheese on the non-buttered side of the bottom bun. Place the top half of the bun on the sandwich and place the sandwich on the hot skillet. Repeat with the second sandwich.\nGrill until lightly browned and flip over, about 3 to 5 minutes; continue grilling until cheese is melted and the second side is golden brown.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "20 m",
    "i": "4533238.jpg",
    "o": "4533238.jpg,4466474.jpg,3920554.jpg,3797175.jpg,3465216.jpg,3228367.jpg",
    "st": "allrecipes"
}