{
    "id": 217332,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 quart vegetable oil for frying",
        "4 small eggplants, halved lengthwise",
        "1/2 cup ghee (clarified butter)",
        "1 large onion, finely chopped",
        "2 cloves garlic, minced",
        "2 teaspoons ground coriander",
        "2 teaspoons vindaloo curry powder (optional)",
        "1 teaspoon chili powder",
        "1 teaspoon salt"
    ],
    "nut": [
        "Calories > 264 kcal",
        "Carbs > 12.4 g",
        "Cholesterol > 33 mg",
        "Fat > 24.3 g",
        "Protein > 2.2 g",
        "Sodium > 299 mg"
    ],
    "n": "Indian Stuffed Eggplant",
    "a": "Shana McCoy",
    "r": "0",
    "s": 8,
    "des": "\"A little tricky and time consuming, this dish is a sure show stopper! Similar to potato boats, only spicy instead of cheesy. This dish is totally vegetarian and can be vegan just be substituting veggie oil for the ghee. If you want it mild, don't add the curry or vindaloo spices. If you want some kick to it, add your favorite curry or vindaloo blend. Fantastic with chicken tikka masala and tabouleh!\"",
    "ins": "Scoop the inside out of the eggplant halves, leaving 1/4 inch of flesh attached to the skin. Roughly chop the removed eggplant, and set the shells aside.\nHeat the ghee in a large skillet over medium heat. Cook and stir the onion and garlic until the onion has softened and turned translucent, about 5 minutes. Stir in the coriander, vindaloo powder, chili powder, and salt; continue cooking 2 to 3 minutes until the spices are very fragrant. Stir in the chopped eggplant flesh, and cook until very soft, mashing as you go. Pour in a little water if needed to keep the eggplant from burning. Keep the mashed eggplant hot over low heat.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nDeep fry the eggplant halves in the hot oil until crisp, about 5 minutes. Drain upside-down on a paper towel-lined plate. Once drained, spoon in the reserved filling, and serve hot.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "2351165.jpg",
    "o": "",
    "st": "allrecipes"
}