{
    "id": 217320,
    "old_rating": "4.28571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound thinly sliced carne asada (beef steak)",
        "1/2 pound boneless chicken breast",
        "5 large, shelled shrimp",
        "4 1/2 ounces chorizo (Mexican sausage)",
        "2 nopales (cactus leaves) or zucchini and yellow squash",
        "2 jalapeno peppers",
        "1/4 bunch cilantro",
        "2 green onions",
        "1 large tomato",
        "1/2 teaspoon salt",
        "1/2 teaspoon pepper",
        "1 lime, quartered",
        "1 avocado",
        "1/4 pound queso fresco (Mexican cheese)",
        "1 (16 ounce) jar HERDEZÂ® Salsa Verde",
        "1 (8 ounce) package small tortillas",
        "Stone molcajete (mortar and pestle)"
    ],
    "nut": [
        "Calories > 446 kcal",
        "Carbs > 29.8 g",
        "Cholesterol > 93 mg",
        "Fat > 21.9 g",
        "Protein > 28.9 g",
        "Sodium > 1575 mg"
    ],
    "n": "Rudy's Molcajete Mixto",
    "a": "Herdez",
    "r": "0",
    "s": 6,
    "des": "\"This mixed grill of carne asada, nopales, chicken, shrimp, jalapenos, and chorizo sausage is served in a heated molcajete with queso fresco, salsa, avocado and lime for a delicious Mexican feast.\"",
    "ins": "Using oven mitts, heat the molcajete over the grill or stove.*\nGrill carne asada for five minutes.\nAdd and grill chicken, nopales on one side for five minutes, turn over. Also, add jalapenos turning every two minutes to soften.\nSprinkle salt and pepper over meats. Add and grill chorizo and shrimp. Add green onions and rotate to cook on all sides, about two minutes.\nWhile meat cooks, slice the tomatoes, avocado and cheese into 1/2 inch wedges.\nUsing oven mitts, pour half of the salsa into the heated molcajete.\nRemove the meats and slice in long, thin strips.\nPlace the beef, chicken, shrimp, nopales, and cheese around the inside edge of the bowl. Add the chorizo to the center of the bowl. Add the tomatoes, green onions, avocados and jalapenos around the chorizo. Pour remaining salsa over ingredients.\nPlace the cilantro over the nopales. Place limes on top, to be squeezed when served.\nUse small tortillas to serve.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "976037.jpg",
    "o": "",
    "st": "allrecipes"
}