{
    "id": 217327,
    "old_rating": "4.46875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (8 ounce) package cream cheese, softened",
        "1 (1 ounce) package ranch dressing mix",
        "1 (12 inch) pre-baked pizza crust",
        "3 fresh jalapeno pepper, seeded and sliced",
        "1 (3 ounce) jar cooked real bacon pieces (such as Hormelâ„¢)",
        "1 cup shredded Mexican cheese blend",
        "1 tablespoon butter, melted",
        "3/4 cup seasoned bread crumbs"
    ],
    "nut": [
        "Calories > 416 kcal",
        "Carbs > 36 g",
        "Cholesterol > 63 mg",
        "Fat > 22.5 g",
        "Protein > 19.1 g",
        "Sodium > 1285 mg"
    ],
    "n": "Jalapeno Popper Pizza",
    "a": "bosbaby97",
    "r": "0",
    "s": 8,
    "des": "\"I came up with this idea one day while eating a calzone with a side of Jalapeno Poppers.  I thought a jalapeno popper pizza would be awesome.  I came home and searched online for a recipe like the one I had in mind and found recipes for jalapeno popper pizzas, but none quite like my idea.  We tried it this evening and found it to be delicious and EASY!! This would also make a great appetizer sliced into small squares.  Can't wait to try this with different meats, like sausage or ham!\"",
    "ins": "Preheat an oven to 375 degrees F (190 degrees C).\nStir together the softened cream cheese and ranch dressing mix in a bowl until smooth. Spread the mixture on the pre-baked crust. Sprinkle the jalapeno slices and bacon on top of the cream cheese mixture; then top with the shredded cheese.\nCombine the melted butter and seasoned bread crumbs. Sprinkle the mixture over the top of the pizza. Bake in preheated oven until the bread crumbs are nicely browned and the cheese has melted, about 15 minutes.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "1663980.jpg",
    "o": "1111478.jpg,1013573.jpg,963432.jpg,675264.jpg,650266.jpg,636011.jpg",
    "st": "allrecipes"
}