{
    "id": 217795,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 bunches fresh asparagus, trimmed",
        "3 tablespoons butter",
        "1 red onion, chopped",
        "1 stalk celery, chopped",
        "1 clove garlic, chopped",
        "3 quarts chicken stock",
        "1/2 cup cooking sherry",
        "salt and pepper to taste",
        "1/2 cup heavy cream"
    ],
    "nut": [
        "Calories > 213 kcal",
        "Carbs > 16.2 g",
        "Cholesterol > 44 mg",
        "Fat > 14.8 g",
        "Protein > 6.9 g",
        "Sodium > 1565 mg"
    ],
    "n": "Easy Cream of Asparagus Soup",
    "a": "Miss Diane",
    "r": "0",
    "s": 6,
    "des": "\"This is an easy, delicious recipe I got from a local restaurant. I make this every spring when asparagus is abundant here. I think because of the sherry this soup has a wonderful nutty flavor. This can easily be made as a low-calorie soup by using 1 tablespoon olive oil instead of the butter, and by omitting the heavy cream. Just add a little cornstarch to thicken, if needed.\"",
    "ins": "Chop the asparagus. Set aside 2 cups of the asparagus tips.\nMelt the butter in a stockpot over medium heat. Cook the asparagus, onion, celery, and garlic in the melted butter until beginning to soften, 2 to 3 minutes. Add the sherry and chicken stock; bring the mixture to a gentle boil, reduce heat to medium-low, and simmer for 45 minutes. Remove from heat and allow to cool at least 30 minutes.\nPour the soup into a blender, filling the pitcher no more than halfway. Hold the lid in place with a folded kitchen towel and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Return the blended soup to the stockpot; stir in the reserved asparagus tips and the heavy cream. Cook over medium heat until soup is hot and the asparagus tips are heated through but still crunchy, about 3 minutes. Season with salt and pepper.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "865023.jpg",
    "o": "",
    "st": "allrecipes"
}