{
    "id": 217798,
    "old_rating": "4.82143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup fresh basil leaves",
        "2 cloves garlic, minced",
        "1/4 cup pine nuts",
        "1/2 cup Parmesan cheese",
        "1/4 cup olive oil",
        "2 tablespoons lemon juice",
        "4 cups mini penne pasta",
        "1 tablespoon olive oil",
        "1 tablespoon olive oil",
        "1/4 cup pine nuts",
        "1 cup chopped asparagus",
        "1/2 cup sliced zucchini",
        "1/2 cup sliced Kalamata olives",
        "1/2 cup diced roasted red pepper",
        "1/2 cup chopped sun-dried tomatoes",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 367 kcal",
        "Carbs > 34.4 g",
        "Cholesterol > 9 mg",
        "Fat > 20.6 g",
        "Protein > 12.6 g",
        "Sodium > 413 mg"
    ],
    "n": "Pesto Penne Primavera",
    "a": "Mikey's Kitchen",
    "r": "0",
    "s": 8,
    "des": "\"This is a recipe you can serve hot or cold. A great side-dish or can be a full meal. My kids love this and it's always a hit. You could also add poached or grilled chicken. You can also freeze any leftover pesto for later use.\"",
    "ins": "Combine the basil, garlic, 1/4 cup pine nuts, 1/2 cup Parmesan cheese, 1/4 cup olive oil, and lemon juice in a food processor and blend until well combined and has the texture of fresh pesto; set aside.\nBring a pot of lightly salted water to a boil. Cook the pasta in boiling water until cooked yet firm to the bite, about 11 minutes; drain. Transfer the pasta to a large bowl. Pour 1 tablespoon olive oil over the pasta and toss to coat; set aside.\nHeat 1 tablespoons olive oil in a large skillet over medium heat. Roast the pine nuts in the skillet until lightly browned; remove to a plate and set aside. Add the asparagus, zucchini, Kalamata olives, roasted red pepper, and sun-dried tomatoes to the skillet; cook and stir until hot, 5 to 7 minutes. Stir the pine nuts into the vegetable mixture. Add the pasta and about 1/4 cup of the pesto, or more to your liking, to the skillet and toss to combine. Serve in bowls topped with the grated Parmesan cheese.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "1008473.jpg",
    "o": "",
    "st": "allrecipes"
}