{
    "id": 217775,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter",
        "1 bunch green onions, chopped",
        "1/2 pound fresh mushrooms, chopped",
        "1/4 pound peeled and deveined medium shrimp (30-40 per pound)",
        "1/4 pound walleye fillets, cut into pieces",
        "1/4 pound cooked lobster meat, broken into chunks",
        "1/4 pound cooked crabmeat",
        "2 tablespoons dry sherry",
        "1/2 cup dry white wine (such as Chenin Blanc)",
        "1 (10.75 ounce) can  condensed cream of shrimp soup (such as Campbell'sÂ®)",
        "1 cup half-and-half cream",
        "1 cup dry bread crumbs",
        "1/4 pound shredded Cheddar cheese",
        "1/2 cup dry bread crumbs",
        "1/2 cup freshly grated Parmesan cheese",
        "1/4 cup cold butter, cut into 1/2-inch pieces "
    ],
    "nut": [
        "Calories > 934 kcal",
        "Carbs > 46.4 g",
        "Cholesterol > 272 mg",
        "Fat > 60.7 g",
        "Protein > 46.2 g",
        "Sodium > 1819 mg"
    ],
    "n": "Laura's Seafood Thermidor",
    "a": "Laura Sewall Bossart",
    "r": "0",
    "s": 4,
    "des": "\"Use crab or lobster, or mix it up with some fish. I use individual au gratin dishes to serve. The sauce can be frozen before the topping is added.\"",
    "ins": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nMelt 1/2 cup of butter in a large skillet over medium heat. Stir in the green onions and mushrooms, and cook until the mushrooms have softened, about 5 minutes. Stir in the shrimp and walleye; cook and stir until the shrimp have begun to turn opaque, about 2 minutes. Add the lobster and crab, and cook a few minutes to heat.\nStir in the sherry and white wine. Bring to a simmer, and cook for 2 minutes. Once the shrimp and walleye are no longer translucent in the center, stir in the cream of shrimp soup, half-and-half, 1 cup bread crumbs, and Cheddar cheese until the cheese has melted, and the mixture is bubbly. Pour into a casserole dish, and sprinkle evenly with 1/2 cup breadcrumbs and the Parmesan cheese. Dot with the pieces of cold butter.\nCook under the preheated broiler until the butter has melted and the bread crumbs are golden brown.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "3193765.jpg",
    "o": "",
    "st": "allrecipes"
}