{
    "id": 217846,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tomato",
        "10 dried New Mexico chiles - stemmed, seeded, and cut into strips",
        "2 dried chipotle chiles - stemmed, seeded, and cut into strips",
        "2 dried guajillo chiles - stemmed, seeded, and cut into strips",
        "2 dried ancho chiles - stemmed, seeded, and cut into strips",
        "1 1/2 pounds chopped sweet onion",
        "1/2 head garlic, minced",
        "2 tablespoons dried mustard powder",
        "1 tablespoon sea salt",
        "1 1/2 teaspoons ground black pepper",
        "1 1/2 teaspoons ground coriander",
        "1 1/2 teaspoons ground cloves",
        "2 cups pineapple juice",
        "1 1/2 cups mango juice",
        "1/2 cup cider vinegar",
        "1/2 cup water"
    ],
    "nut": [
        "Calories > 53 kcal",
        "Carbs > 11.1 g",
        "Cholesterol > 0 mg",
        "Fat > 0.6 g",
        "Protein > 1.2 g",
        "Sodium > 269 mg"
    ],
    "n": "Al Pastor Barbeque Sauce",
    "a": "Nicola",
    "r": "0",
    "s": 20,
    "des": "\"This recipe is very spicy, to lower heat replace one each of the chipotle an guajillo for New Mexico or California chili pods. I created this recipe for a camping trip to put on back loin ribs and  people kept coming by and asking me what that amazing smell was, and all 8 racks were gone within 10 minutes after coming off the grill. It's great on: pork ribs/loin/chops/burgers, chicken, beef ribs/burgers/steak, and lamb burgers.\"",
    "ins": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nPlace the tomato on a baking dish, and broil, turning occasionally, until blackened on all sides. Once done, remove, and let cool until.\nMeanwhile, pack the New Mexico chiles, chipotle chiles, guajillo chiles, ancho chiles, onion, and garlic into a half-gallon glass jar. Sprinkle with mustard powder, sea salt, black pepper, coriander, and cloves. Remove the peel from the cooled tomato, cut in half, and squeeze out the seeds. Roughly chop the tomato and place it into the jar. Pour in half of the pineapple juice. Refrigerate at least 2 hours to soften the peppers.\nPlace the chile mixture into a food processor, and pulse several times to roughly chop the peppers. Pour in the remaining pineapple juice, mango juice, and vinegar. Blend well until finely chopped, about 2 minutes. Pour the pepper mixture back into the glass jar, seal with a lid, and refrigerate at least 1 week.\nAfter 1 week, pour the pepper puree back into the food processor, and blend 2 minutes until smooth. Pour into a large saucepan, and bring to a simmer over medium heat. Reduce heat to low, and simmer, stirring occasionally, for 30 minutes. Stir in 1/2 cup water, and return to the food processor. Puree 1 minute.\nPlace a large wire mesh strainer over a clean saucepan, and place 4 to 6 layers of cheesecloth into it to cover. Pour in the pepper puree, and allow to drip into the saucepan for 30 minutes. Gather up the corners of the cheesecloth, and gently twist together to extract all of the liquid from the pepper pulp. Be gentle to ensure that none of the solids are squeezed into the saucepan.\nReturn the saucepan to a simmer over medium heat, then reduce heat to low, and cook 30 minutes until desired thickness has been reached. Remember that it will thicken somewhat as it cools. Let cool, and store in the refrigerator until ready to use.",
    "pt": "45 m",
    "ct": "1 h ",
    "tt": "8 d ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}