{
    "id": 217869,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "For the Cake:",
        "3 1/4 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon salt",
        "3/4 cup butter",
        "2 1/2 cups white sugar",
        "2 teaspoons lemon extract",
        "1 tablespoon lemon zest",
        "1 teaspoon lemon zest",
        "2 tablespoons lemon juice",
        "3 eggs, room temperature",
        "2 cups sour cream",
        "For the Compote:",
        "4 cups frozen pitted sweet cherries",
        "1/4 cup white sugar",
        "2 tablespoons cold water",
        "2 teaspoons cornstarch",
        "1/4 teaspoon almond extract",
        "For the Glaze:",
        "2 tablespoons lemon juice",
        "1 cup confectioners' sugar"
    ],
    "nut": [
        "Calories > 467 kcal",
        "Carbs > 78.1 g",
        "Cholesterol > 66 mg",
        "Fat > 15.8 g",
        "Protein > 5.4 g",
        "Sodium > 141 mg"
    ],
    "n": "Sour Cream Lemon Pound Cake with Cherry Compote",
    "a": "Melissa VanDerLaan",
    "r": "0",
    "s": 16,
    "des": "\"Super moist, refreshing dessert. I serve this at Easter or Mother's Day.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Spray a fluted tube pan (such as a BundtÂ® pan) with cooking spray.\nCombine the flour, baking powder, and salt in a bowl; set aside.\nBeat the butter, 2 1/2 cups sugar, and lemon extract with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Stir in the 1 tablespoon plus 1 teaspoon lemon zest and 2 tablespoons of lemon juice; beat for 30 seconds. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next.\nMix in the flour mixture alternately with the sour cream, mixing until just incorporated. Spoon the batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool the cake in the pan for 10 minutes before removing to cool completely on a wire rack.\nMeanwhile, prepare the compote: combine the cherries, 1/4 cup sugar, water, and cornstarch in a saucepan. Bring to a boil over medium-high heat. Cook for 1 minute, stirring constantly. Remove the compote from the heat and stir in the almond extract. Set aside.\nCombine 2 tablespoons of lemon juice with the confectioners' sugar and mix well. When the cake is completely cool, drizzle the lemon glaze over the top of the cake. Serve the cherry compote with the cake.",
    "pt": "40 m",
    "ct": "1 h",
    "tt": "2 h ",
    "i": "640911.jpg",
    "o": "",
    "st": "allrecipes"
}