{
    "id": 217897,
    "old_rating": "4.36364",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound lean ground turkey",
        "2 large carrots, grated",
        "2 tablespoons dried minced onion",
        "1 diced fresh jalapeno pepper, or to taste",
        "1 (1.25 ounce) package taco seasoning mix",
        "1/2 teaspoon kosher salt",
        "1/4 cup water",
        "hot garlic-pepper sauce (such as TabascoÂ® Garlic Pepper Sauce)",
        "1 cup plain Greek yogurt",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "2 cups shredded queso quesadilla (Mexican melting cheese)",
        "7 (6 inch) flour tortillas",
        "1/2 (14.5 ounce) can red enchilada sauce"
    ],
    "nut": [
        "Calories > 414 kcal",
        "Carbs > 30.9 g",
        "Cholesterol > 84 mg",
        "Fat > 18.5 g",
        "Protein > 29.1 g",
        "Sodium > 1341 mg"
    ],
    "n": "Kelly's Enchiladas",
    "a": "KellyG42",
    "r": "0",
    "s": 7,
    "des": "\"You can't taste the carrot in this enchilada recipe, but it's a good way to add bulk and vegetables--just use a cheese grater or food processor for them.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).\nHeat a large skillet over medium-high heat, and stir in the ground turkey, grated carrots, onion, jalapeno pepper, 1/2 packet of taco seasoning, and kosher salt. Cook and stir until the turkey is crumbly, evenly browned, and no longer pink. Stir in the water, several dashes of hot sauce, and the remaining taco seasoning. Simmer until the water has evaporated.\nCombine the yogurt, cream of chicken soup, and queso quesadilla cheese in a bowl.\nPlace a tortilla onto your work surface, then spoon some of the turkey mixture halfway between the bottom edge and the center of the tortilla. Place 2 to 3 tablespoons of the cheese mixture over the turkey.  Roll the tortilla up to the top edge, forming a tight cylinder. Place in a 7x11 inch baking dish. Repeat with the remaining ingredients.  (There will be unused cheese sauce.)\nStir the enchilada sauce into the remaining cheese mixture. Spoon over the top of the tortillas. Bake in the preheated oven until the sauce is bubbly and the cheese has melted, about 30 to 35 minutes.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "3987126.jpg",
    "o": "",
    "st": "allrecipes"
}