{
    "id": 217845,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "canola oil",
        "1/4 cup honey",
        "2 tablespoons honey",
        "1 tablespoon ancho chile powder",
        "1/2 tablespoon garlic powder",
        "2 teaspoons Mexican-style hot sauce (such as CholulaÂ®)",
        "6 (8 ounce) bone-in chicken breast halves",
        "Sweet Potato-Corn Mash:",
        "5 ears corn",
        "1 tablespoon canola oil, or as needed",
        "salt and ground black pepper to taste",
        "2 large sweet potatoes",
        "1/4 cup heavy whipping cream"
    ],
    "nut": [
        "Calories > 780 kcal",
        "Carbs > 62.9 g",
        "Cholesterol > 141 mg",
        "Fat > 37.5 g",
        "Protein > 50.4 g",
        "Sodium > 288 mg"
    ],
    "n": "Aztec Chicken with Sweet Potato-Corn Mash",
    "a": "Vintage Chef",
    "r": "0",
    "s": 6,
    "des": "\"A great taste of central Mexico with a little heat and quite a bit of flavor! Garnish with two halves grilled plantain or banana and cilantro.\"",
    "ins": "Combine oil, honey, ancho chile powder, garlic, and hot sauce in a bowl; whisk together. Place chicken breasts in a large resealable plastic bag; pour in marinade and close bag. Marinate in refrigerator, 3 hours to overnight.\nPreheat oven to 450 degrees F (230 degrees C).\nPlace sweet potatoes on a baking sheet. Place corn in a shallow baking pan. Brush with canola oil; season with salt and pepper. Cover pan with aluminum foil.\nBake in the preheated oven until corn is roasted and brown, about 25 minutes. Continue baking until sweet potatoes are tender, about 45 minutes more.\nAllow corn and sweet potatoes to cool until easy to handle, about 20 minutes. Cut kernels from ears of corn; transfer half to a blender. Peel and cube sweet potatoes; add to the blender. Add cream; puree. Transfer mash to a bowl; stir in the remaining corn. Season with salt and pepper. Cover and keep warm.\nPreheat grill for medium heat and lightly oil the grate.\nRemove chicken from bag and place on preheated grill; discard remaining marinade. Cook until no longer pink at the bone and the juices run clear, about 6 minutes per side. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\nCut chicken breasts into 3 equal pieces; serve on top of sweet potato-corn mash.",
    "pt": "15 m",
    "ct": "57 m",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}