{
    "id": 217924,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/3 cups crushed strawberries (wash, hull, then crush one layer at a time using potato masher)",
        "1/3 cup unsweetened fruit juice, thawed fruit juice concentrate, or water",
        "1 1/2 tablespoons BallÂ® RealFruitâ„¢ Low or No-Sugar Needed Pectin",
        "1/2 cup granulated sugar, sugar substitute, or honey (or less, depending on taste)",
        "2 BallÂ® or KerrÂ® Half-pint (8 oz) Jars with lids and bands"
    ],
    "nut": [
        "Calories > 16 kcal",
        "Carbs > 4.1 g",
        "Cholesterol > 0 mg",
        "Fat > 0 g",
        "Protein > 0.1 g",
        "Sodium > < 1 mg"
    ],
    "n": "Low Sugar / No Sugar Strawberry Jam",
    "a": "Ball",
    "r": "0",
    "s": 32,
    "des": "\"This jam has all the fresh-fruit flavor of fresh strawberry jam but with less sugar.\"",
    "ins": "Prepare waterbath canner, jars and lids according to manufacturers instructions, if preserving. Prepare and measure ingredients for recipe.\nCombine prepared fruit with fruit juice in a large saucepan. Gradually stir in Ball(R) RealFruit(TM) Low or No-Sugar Needed Pectin\nAdd sugar, sugar substitute or honey, if using. Return mixture to a full rolling boil. Boil hard 1 minute, stirring constantly. Remove from heat. Skim foam if necessary.\nLadle hot jam into hot jars, one at a time, leaving 1/4 inch headspace. Wipe rims. Center lids on jars. Apply bands and adjust to fingertip tight.\nPlace filled jars in canner ensuring jars are covered by 1 to 2 inches of water. Place lid on canner. Bring water to gentle, steady boil.\nProcess jars for 10 minutes, adjusting for altitude*. Turn off heat, remove lid and let jars stand for 5 minutes.\nRemove jars and cool. Check lids for seal after 24 hours. Lid should not flex up and down when center is pressed. Clean and store according to manufacturers instructions.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "976448.jpg",
    "o": "",
    "st": "allrecipes"
}