{
    "id": 217976,
    "old_rating": "4.36585",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) box penne pasta",
        "1 pound hot Italian sausage links, cut into 1-inch pieces",
        "3 cloves garlic, minced",
        "1 tablespoon crushed red pepper flakes",
        "1 pound broccoli rabe, cut into 1 1/2-inch lengths",
        "2 tablespoons grated Parmesan cheese",
        "1/2 cup pasta boiling water",
        "1/4 cup grated Parmesan cheese",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 498 kcal",
        "Carbs > 61.7 g",
        "Cholesterol > 34 mg",
        "Fat > 17.7 g",
        "Protein > 24.8 g",
        "Sodium > 733 mg"
    ],
    "n": "Penne with Sausage and Broccoli Rabe",
    "a": "shannon",
    "r": "0",
    "s": 6,
    "des": "\"Hot Italian sausage with broccoli rabe sauteed and served over penne. You'll love this dish so much and so will your family. Every time I make it I have to double the recipe.\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the penne, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink, reserving 1/2 cup of the water.\nMeanwhile, heat a large skillet over medium-high heat. Cook and stir the sausage pieces, garlic, and red pepper flakes in the hot pan until the sausage is no longer pink on the outside, about 4 minutes. Stir in the broccoli rabe and 2 tablespoons Parmesan cheese. Pour in the reserved 1/2 cup of pasta boiling water. Cover, and cook until the sausage is no longer pink in the center and the broccoli rabe is tender, 5 to 7 minutes.\nStir the cooked pasta, broccoli rabe, and 1/4 cup Parmesan cheese together until evenly mixed. Season to taste with salt and pepper to serve.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "662332.jpg",
    "o": "4538708.jpg,4538706.jpg,4506472.jpg,3508970.jpg,3209421.jpg,2648289.jpg",
    "st": "allrecipes"
}