{
    "id": 217929,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "12 cups sliced, peeled, cored apples, treated to prevent browning* and drained",
        "Water",
        "2 3/4 cups granulated sugar",
        "3/4 cup cooking starch used for preserving, such as ClearJelÂ®",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "2 1/2 cups apple juice",
        "1 1/4 cups cold water",
        "1/2 cup lemon juice",
        "7 BallÂ® or KerrÂ® Pint (16 oz) Jars with lids and bands"
    ],
    "nut": [
        "Calories > 167 kcal",
        "Carbs > 43.3 g",
        "Cholesterol > 0 mg",
        "Fat > 0.2 g",
        "Protein > 0.2 g",
        "Sodium > 12 mg"
    ],
    "n": "Classic Apple Pie Filling",
    "a": "Ball",
    "r": "0",
    "s": 20,
    "des": "\"Having delicious, homemade apple pie filling in the pantry makes pie-baking day extra easy!\"",
    "ins": "Prepare boiling water canner. Heat jars and lids in simmering water until ready for use. Do not boil. Set bands aside.\nBlanch apple slices, working with 6 cups at a time, in a large pot of boiling water for 1 minute. Remove with a slotted spoon and keep warm in a covered bowl.\nCombine sugar, ClearJel(R), cinnamon and nutmeg in a large stainless steel saucepan. Stir in apple juice and cold water. Bring to a boil over medium-high heat, stirring constantly, and cook until mixture thickens and begins to bubble. Add lemon juice, return to a boil and boil for 1 minute, stirring constantly. Remove from heat. Drain apple slices and immediately fold into hot mixture. Before processing, heat, stirring, until apples are heated through.\nLadle hot pie filling into hot jars leaving 1 inch headspace. Remove air bubbles. Wipe rim. Center lid on jar. Apply band until fit is fingertip tight.\nProcess jars in a boiling water canner for 25 minutes, adjusting for altitude. Remove jars and cool. Check lids for seal after 24 hours. Lid should not flex up and down when center is pressed.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "978114.jpg",
    "o": "",
    "st": "allrecipes"
}