{
    "id": 217912,
    "old_rating": "4.44355",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound linguine pasta",
        "1 (8 ounce) skinless, boneless chicken breast, cut into small pieces",
        "salt and ground black pepper to taste",
        "3 tablespoons olive oil",
        "6 whole garlic cloves",
        "4 ounces fresh mushrooms, halved",
        "6 ounces roasted red peppers, drained and chopped",
        "1 (7.5 ounce) jar marinated artichoke hearts, drained and quartered",
        "3 ounces fresh spinach leaves",
        "1/4 cup prepared basil pesto, or to taste",
        "1 tablespoon freshly grated Parmesan cheese, divided (optional)"
    ],
    "nut": [
        "Calories > 512 kcal",
        "Carbs > 53.5 g",
        "Cholesterol > 35 mg",
        "Fat > 23.3 g",
        "Protein > 26.1 g",
        "Sodium > 540 mg"
    ],
    "n": "Spence's Pesto Chicken Pasta",
    "a": "ChezCristy",
    "r": "0",
    "s": 4,
    "des": "\"This is a great recipe that my boyfriend put together on a Sunday evening after a bike ride. You can't go wrong with all of the flavors in this dish!\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\nWhile the pasta is boiling, sprinkle the chicken with salt and black pepper. Heat the olive oil in a large skillet over medium heat, and cook the chicken pieces until lightly browned, about 10 minutes, stirring frequently. Stir in the garlic cloves, mushrooms, roasted red peppers, and artichoke hearts; reduce heat to a simmer, and cook until the mushrooms begin to give off their juices, 5 to 8 minutes. Stir in the spinach, and simmer just until the leaves are wilted, about 2 minutes.\nTransfer the cooked linguine into a bowl, and toss with the basil pesto. Divide the pasta between 2 plates, and serve topped with the chicken mixture. Sprinkle Parmesan cheese over each plate to serve.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "642143.jpg",
    "o": "4476811.jpg,3219419.jpg,2963854.jpg,2703630.jpg,2612932.jpg,1888932.jpg",
    "st": "allrecipes"
}