{
    "id": 217927,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 pounds red bell peppers",
        "1 pound Italian plum tomatoes",
        "2 cloves garlic, unpeeled",
        "1 small white onion",
        "1/2 cup red wine vinegar",
        "2 tablespoons finely chopped fresh basil",
        "1 tablespoon sugar",
        "1 teaspoon salt",
        "5 BallÂ® or KerrÂ® Half-pint (8 oz) Jars with lids and bands"
    ],
    "nut": [
        "Calories > 35 kcal",
        "Carbs > 7.1 g",
        "Cholesterol > 0 mg",
        "Fat > 0.3 g",
        "Protein > 1.1 g",
        "Sodium > 82 mg"
    ],
    "n": "Roasted Red Pepper Spread",
    "a": "Ball",
    "r": "0",
    "s": 30,
    "des": "\"Roasted red pepper and tomato spread with fresh basil looks fabulous and tastes just as good.\"",
    "ins": "Roast red peppers, tomatoes, garlic and onion under a broiler or on a grill at 425 degrees F, turning to roast all sides, until tomatoes and peppers are blistered, blackened and softened and garlic and onion are blackened in spots. Remove from heat.\nPlace pepper and tomatoes in paper bags, secure opening and let cool about 15 minutes. Allow garlic and onion to cool. Peel garlic and onion. Finely chop garlic. Set aside. Finely chop onion, measuring 1/4 cup. Set aside. Peel and seed peppers and tomatoes. Place peppers and tomatoes in a food processor or blender, working in batches, and process until smooth.\nPrepare boiling water canner. Heat jars and lids in simmering water until ready for use. Do not boil. Set bands aside.\nCombine pepper and tomato puree, garlic, onion, vinegar, basil, sugar and salt in a large saucepan. Bring to a boil. Reduce heat and simmer until mixture thickens and mounds on a spoon, about 20 minutes.\nLadle hot spread into hot jars leaving 1/2 inch headspace. Wipe rim. Center hot lid on jar. Apply band and adjust until fit is fingertip tight.\nProcess in a boiling water canner for 10 minutes, adjusting for altitude. Remove jars and cool. Check lids for seal after 24 hours. Lid should not flex up and down when center is pressed.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "978113.jpg",
    "o": "",
    "st": "allrecipes"
}