{
    "id": 217962,
    "old_rating": "4.79",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (12 fluid ounce) can or bottle room temperature beer",
        "1 tablespoon white sugar",
        "2 teaspoons kosher salt",
        "1 (.25 ounce) package active dry yeast",
        "4 1/2 cups bread flour",
        "1/4 cup unsalted butter, melted",
        "1 large egg yolk",
        "1 tablespoon water",
        "10 cups water",
        "2/3 cup baking soda",
        "1/4 cup kosher salt, divided - or to taste",
        "18 hot dogs"
    ],
    "nut": [
        "Calories > 299 kcal",
        "Carbs > 27.2 g",
        "Cholesterol > 41 mg",
        "Fat > 15.8 g",
        "Protein > 9.7 g",
        "Sodium > 4200 mg"
    ],
    "n": "Jan's Pretzel Dogs",
    "a": "What's for dinner, mom?",
    "r": "0",
    "s": 18,
    "des": "\"Hot dogs wrapped in a pretzel are a perfect snack. Perfect for Super Bowl parties or the weekend tailgate!  A little something different using your favorite can of beer instead of water! Delicious!\"",
    "ins": "Heat the beer in a saucepan over low heat until it reaches 110 degrees F (45 degrees C).\nCombine the warm beer, sugar, and 2 teaspoons kosher salt in a bowl.  Sprinkle the yeast on top, and let stand for 5 minutes until the yeast softens and begins to form a creamy foam.\nPlace the bread flour and butter in a bread machine. Add the yeast mixture, then select the dough cycle.\nPreheat an oven to 450 degrees F (230 degrees C).\nLine 2 baking sheets with parchment paper or grease with vegetable oil.\nBeat the egg yolk in a small bowl with 1 tablespoon water; set aside.\nStir baking soda into 10 cups water in a large pot until dissolved, and bring to a boil.\nTurn the dough out onto a lightly-oiled surface, and roll into a 10x20-inch rectangle.\nCut the dough into 18 1-inch wide strips, then wrap each strip tightly around a hot dog in a spiral, pinching the edges to seal, and leaving the ends open. About half an inch of hot dog should peek out of each end of the dough wrapper.\nDrop 2 or 3 dough-wrapped hot dogs into the boiling water for 30 seconds.\nArrange the boiled hot dogs on the prepared baking sheets. Brush each pretzel dog with the egg yolk mixture, and sprinkle with the remaining 1/4 cup salt.\nBake in the preheated oven until golden brown, about 15 minutes.",
    "pt": "35 m",
    "ct": "35 m",
    "tt": "2 h ",
    "i": "4512116.jpg",
    "o": "4512116.jpg,4473242.jpg,3764719.jpg,3237194.jpg,2687249.jpg,2645108.jpg",
    "st": "allrecipes"
}