{
    "id": 217906,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (15.25 ounce) package white cake mix (such as Duncan HinesÂ®)",
        "1 cup water",
        "3 eggs",
        "1/3 cup vegetable oil",
        "1 (14 ounce) package sweetened flaked coconut (such as BakersÂ® Angel FlakeÂ®)",
        "8 drops blue food coloring",
        "8 drops red food coloring",
        "1 (16 ounce) package vanilla frosting",
        "1 (.68 oz. tube) red decorating gel",
        "1 toothpick",
        "24 (4 inch) pieces red licorice strings"
    ],
    "nut": [
        "Calories > 339 kcal",
        "Carbs > 53.2 g",
        "Cholesterol > 23 mg",
        "Fat > 13.3 g",
        "Protein > 2.6 g",
        "Sodium > 233 mg"
    ],
    "n": "Firecracker Cupcakes",
    "a": "Katie",
    "r": "0",
    "s": 24,
    "des": "\"This delicious, festive treat will help your fourth of July become even more special.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease two 12-cup muffin tins or line cups with paper liners.\nCombine cake mix, water, eggs, and oil in a bowl. Stir to moisten; beat with an electric mixer on low speed for 2 minutes. Pour into prepared muffin cups.\nBake cupcakes in the preheated oven until lightly golden, 16 to 20 minutes.\nDivide coconut into 3 equal portions. Place 2 portions into separate resealable plastic bags; place remaining portion on a plate. Add blue food coloring to one bag and red food coloring to the other; seal bags and shake until coconut is evenly colored. Pour colored coconut onto separate plates.\nRemove paper liners from cupcakes; frost tops and sides. Press each cupcake gently into the 3 plates of coconut, completely coating all sides. Draw a star shape on top using the decorating gel. Make a hole in the center of the star with a toothpick; insert a licorice piece \"fuse.\"",
    "pt": "35 m",
    "ct": "16 m",
    "tt": "51 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}