{
    "id": 217996,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 tablespoons butter, divided",
        "3 summer squash, trimmed and cut into bite-size pieces",
        "3 zucchini, trimmed and cut into bite-size pieces",
        "salt and ground black pepper to taste",
        "3 onions, chopped",
        "1 pound shredded sharp white Cheddar cheese",
        "1/2 pound shredded Cheddar cheese",
        "3 tablespoons sweetened condensed milk, divided"
    ],
    "nut": [
        "Calories > 438 kcal",
        "Carbs > 16.8 g",
        "Cholesterol > 97 mg",
        "Fat > 31.3 g",
        "Protein > 24.1 g",
        "Sodium > 562 mg"
    ],
    "n": "Summer Squash and Onion Cheesy Casserole",
    "a": "Coleman Bell",
    "r": "0",
    "s": 8,
    "des": "\"My Great Great Grandmother used to make this when I was young, and it has always been a favorite of my Atlanta and Alabama relatives!  I learned how to make it from my Aunt Edith Russell, while visiting her in Atlanta in the mid-1990s!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x9-inch baking dish with about 1/2 tablespoon of butter.\nMelt remaining 1 tablespoon of butter in a large cast-iron skillet over medium heat, and cook the summer squash and zucchini until the squash pieces begin to brown, 10 to 15 minutes, stirring often. Sprinkle with salt and black pepper, and spread into the bottom of the prepared baking dish. Sprinkle with about 1/3 of the chopped onions.\nMix together the white Cheddar cheese and yellow Cheddar cheese in a bowl until thoroughly combined, and sprinkle about 1/2 cup of the cheese mixture over the onions. Drizzle with about 1 tablespoon of the sweetened condensed milk. Repeat sprinkling cheese, onions, and condensed milk twice more, then top with remaining cheese mixture.\nBake in the preheated oven until the casserole is golden brown and the onions are tender, about 30 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "693645.jpg",
    "o": "",
    "st": "allrecipes"
}