{
    "id": 218090,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 cups water",
        "12 whole dried ancho chiles",
        "1 onion, coarsely chopped",
        "4 large cloves garlic, lightly crushed",
        "1 teaspoon ground cumin",
        "salt to taste",
        "1 tablespoon agave syrup, or to taste",
        "1 tablespoon lemon juice, or to taste",
        "4 fresh chile de arbol peppers, chopped (wear gloves)",
        "2/3 cup hulled green pumpkin seeds",
        "1 teaspoon dried Mexican oregano",
        "2 roma (plum) tomatoes, seeded and chopped"
    ],
    "nut": [
        "Calories > 114 kcal",
        "Carbs > 15.8 g",
        "Cholesterol > 0 mg",
        "Fat > 5 g",
        "Protein > 4.7 g",
        "Sodium > 15 mg"
    ],
    "n": "Authentic Dried Chile-Pepito Enchilada Sauce",
    "a": "shoshi",
    "r": "0",
    "s": 12,
    "des": "\"Real enchilada sauce made from dried chiles and optional ground pumpkin seeds, rich with indigenous flavors. Use in any traditional enchilada recipe.\"",
    "ins": "Bring the water to a boil, and set aside. Rinse and pat the ancho chiles dry, then tear out the stems and cores, and tear open the chiles. Scrape out seeds and veins, leaving the flesh intact. Tear the chiles into 1- to 2-inch pieces.\nPlace the ancho pieces, onion, and garlic into a dry cast-iron skillet over medium-high heat, and toast, stirring constantly, until the chiles are fragrant and show browned spots, about 5 minutes. In a small separate skillet over medium heat, toast the ground cumin just until fragrant, 30 seconds to 1 minute. Watch carefully, the cumin will burn easily. Pour the toasted cumin into the skillet with the ancho mixture; pour in the hot water.\nBring the mixture to a boil, then reduce heat to a simmer and cook until the ancho peppers are rehydrated and moist and the mixture is reduced, about 15 minutes. Season to taste with salt, agave syrup, and lemon juice. Remove from heat and let cool for about 15 minutes.\nPour the ancho mixture into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the mixture moving before leaving it on to puree. Stop the blender after about 30 seconds, and add the chile de arbol peppers, pumpkin seeds, oregano, and roma tomatoes. Puree in batches if needed until smooth and thickened.\nReturn the blended sauce to the cast-iron skillet, bring to a boil, and reduce heat to a simmer. Cook, stirring often, for about 15 more minutes to blend flavors.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "3228618.jpg",
    "o": "",
    "st": "allrecipes"
}