{
    "id": 218075,
    "old_rating": "4.69231",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cloves garlic, minced",
        "2 tablespoons brown sugar",
        "3 tablespoons honey",
        "3 tablespoons soy sauce",
        "3 tablespoons Worcestershire sauce",
        "2 teaspoons ketchup",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon onion powder",
        "1/4 teaspoon ground cinnamon",
        "1/8 teaspoon cayenne pepper",
        "2 (6 ounce) thick-cut boneless pork loin chops"
    ],
    "nut": [
        "Calories > 429 kcal",
        "Carbs > 49.3 g",
        "Cholesterol > 98 mg",
        "Fat > 8.4 g",
        "Protein > 39.5 g",
        "Sodium > 1726 mg"
    ],
    "n": "Grilled Pork Loin Chops",
    "a": "ScorpioGG",
    "r": "0",
    "s": 2,
    "des": "\"Tangy, a little sweet, very moist and very easy to prepare -- you're going to love these grilled chops. They turn out wonderfully tasty with an awesome array of flavors. You might want to throw an extra chop on the grill for leftovers, because you will have a craving for it the next day -- guaranteed.\"",
    "ins": "Mix the garlic, brown sugar, honey, soy sauce, Worcestershire sauce, ketchup, ginger, onion powder, cinnamon, and cayenne pepper together in a bowl. Pour half the mixture into a large plastic zipper bag, and place the pork chops into the marinade. Squeeze the air out of the bag, and seal the bag. Refrigerate 4 to 8 hours, turning occasionally. Refrigerate remaining marinade in the bowl.\nPreheat an outdoor grill for medium heat, and lightly oil the grate.\nRemove the pork chops from the plastic bag, and shake excess droplets of liquid from the chops. Discard the marinade from the plastic bag. Grill chops on the preheated grill, basting with the reserved marinade until meat is browned, no longer pink inside, and shows good grill marks, 8 to 10 minutes per side. A meat thermometer inserted into the thickest part of a chop should read at least 145 degrees F (63 degrees C).\nPour remaining reserved marinade into a saucepan over medium heat, bring to a boil, and reduce heat to a simmer. Cook the marinade until slightly thickened, about 5 minutes, stirring constantly; serve sauce with chops.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "4 h ",
    "i": "4532487.jpg",
    "o": "4532487.jpg,4527631.jpg,4517820.jpg,4500031.jpg,4496753.jpg,4268418.jpg",
    "st": "allrecipes"
}