{
    "id": 218053,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 bunch broccoli rabe, trimmed and cut into 1-inch pieces",
        "1/2 cup uncooked fusilli pasta",
        "3 tablespoons olive oil",
        "2 cloves garlic, roughly chopped",
        "salt and ground black pepper to taste",
        "1 sprig fresh rosemary (optional)",
        "1/2 teaspoon dried Italian herb mix, or to taste",
        "1/4 teaspoon crushed red pepper flakes, or to taste",
        "1/4 cup white wine",
        "1 (14.5 ounce) can diced tomatoes",
        "2 green onions, sliced",
        "1 clove garlic, minced",
        "2 teaspoons grated Parmesan cheese, or to taste"
    ],
    "nut": [
        "Calories > 353 kcal",
        "Carbs > 26.3 g",
        "Cholesterol > 2 mg",
        "Fat > 21.3 g",
        "Protein > 9 g",
        "Sodium > 390 mg"
    ],
    "n": "Fusilli with Rapini (Broccoli Rabe), Garlic, and Tomato Wine Sauce",
    "a": "sophie",
    "r": "0",
    "s": 2,
    "des": "\"Delicious in the spring, cut rapini before it flowers for tender greenery. Absolutely delicious and very easily adaptable for whatever's growing in your garden.\"",
    "ins": "Fill a saucepan with enough water to cover the broccoli rabe, sprinkle in some salt, and bring the salted water to a boil. Stir in the broccoli rabe, and cook until bright green and just starting to become tender, about 2 minutes; drain the rabe, and cool in a bowl of ice water to stop the cooking process. Drain well, and pat dry with paper towels.\nFill a pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the fusilli, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 12 minutes. Drain well in a colander set in the sink.\nWhile the pasta is cooking, heat the olive oil in a saucepan over medium heat, and cook and stir the 2 roughly-chopped garlic cloves until they start to turn translucent, about 2 minutes; sprinkle with salt and black pepper, and stir in rosemary sprig, dried Italian herb mix, and crushed red pepper flakes.\nStir in the blanched rabe, white wine, and tomatoes; remove rosemary sprig, and bring the mixture to a boil. Mix in the cooked fusilli pasta, green onions, and 1 minced clove of garlic; simmer for 1 more minute, and serve topped with a sprinkle of Parmesan cheese.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "4467060.jpg",
    "o": "",
    "st": "allrecipes"
}