{
    "id": 218089,
    "old_rating": "4.125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (12 ounce) can beer",
        "1 tablespoon red wine vinegar",
        "3 tablespoons dark corn syrup",
        "2 tablespoons prepared mustard",
        "4 large cloves garlic, minced",
        "1 teaspoon dried sage",
        "1 tablespoon salt",
        "1 tablespoon ground black pepper",
        "1 small onion, cut into thick slices",
        "8 (1-inch thick) center-cut pork chops"
    ],
    "nut": [
        "Calories > 217 kcal",
        "Carbs > 10 g",
        "Cholesterol > 59 mg",
        "Fat > 7.2 g",
        "Protein > 24.3 g",
        "Sodium > 964 mg"
    ],
    "n": "Beer Brined Pork Chops",
    "a": "Goodie",
    "r": "0",
    "s": 8,
    "des": "\"Tender full-flavored pork chops that are always a crowd pleaser. Great on the grill! Pat dry the meat before you put it on the grill for good grill marks. Also, use a meat thermometer to insure proper cooking.\"",
    "ins": "Whisk the beer, wine vinegar, corn syrup, mustard, garlic, sage, salt, and black pepper together in a bowl; pour into a resealable plastic bag. Add the onion and pork chops, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 12 hours.\nPreheat an outdoor grill for medium heat, and lightly oil the grate.\nRemove the pork chops and onions from the marinade and set aside on a platter. Drain the marinade through a fine-mesh strainer, discarding the strained liquid. Spread the garlic mixture caught in the strainer over the pork chops. Wrap the onions in aluminum foil.\nCook the packet of onions and the pork chops on the preheated grill until the pork is no longer pink in the center, about 7 minutes per side. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "12 h ",
    "i": "659237.jpg",
    "o": "",
    "st": "allrecipes"
}