{
    "id": 218032,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 cup ground pecans",
        "5 eggs, or more if needed",
        "2 cups shredded Colby-Monterey Jack cheese",
        "1 tablespoon minced onion, or to taste",
        "Italian seasoning, or to taste",
        "1 cup crushed cornflakes cereal",
        "1 teaspoon salt (optional)",
        "1/4 cup vegetable oil",
        "1/4 cup distilled white vinegar",
        "1 cup ketchup",
        "1/4 cup grated onion",
        "1 (12 ounce) jar apricot jam",
        "1 teaspoon dried oregano"
    ],
    "nut": [
        "Calories > 647 kcal",
        "Carbs > 64.6 g",
        "Cholesterol > 199 mg",
        "Fat > 38.1 g",
        "Protein > 18.9 g",
        "Sodium > 1376 mg"
    ],
    "n": "Zesty Vegetarian Sweet and Sour Meatballs",
    "a": "thechulita",
    "r": "0",
    "s": 6,
    "des": "\"These meatballs use pecan meal as a meat replacement. They are so good, you don't even miss the meat! This recipe does have eggs and cheese in it, so it is not quite vegan. But those items can be substituted to make it so. The ingredients may sound funny, but the result is amazing! The sauce is very zesty so if you don't want it to be too strong cut down on the vinegar some.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch rectangular baking dish with cooking spray.\nMix the ground pecans, eggs, Colby-Jack cheese, minced onion, Italian seasoning, cornflake crumbs, and salt in a bowl until thoroughly combined. Add another egg if mixture isn't holding together. Shape the mixture into balls, and place into the prepared baking dish.\nBake in the preheated oven until browned and set, about 45 minutes.\nMix together the vegetable oil, vinegar, ketchup, grated onion, apricot jam, and oregano together in a bowl until smooth; pour the sauce over the baked pecan balls, and return to oven until the sauce is bubbling, 5 to 10 more minutes.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1122125.jpg",
    "o": "",
    "st": "allrecipes"
}