{
    "id": 218004,
    "old_rating": "4.73077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 pounds fresh strawberries, sliced",
        "1 cup white sugar",
        "1 cup all-purpose flour",
        "2 tablespoons cornstarch",
        "1 1/2 teaspoons baking powder",
        "5 eggs, separated",
        "1 teaspoon vanilla extract",
        "1 1/4 cups white sugar",
        "1 cup heavy cream",
        "2 tablespoons confectioners' sugar"
    ],
    "nut": [
        "Calories > 475 kcal",
        "Carbs > 81.9 g",
        "Cholesterol > 157 mg",
        "Fat > 14.6 g",
        "Protein > 6.9 g",
        "Sodium > 148 mg"
    ],
    "n": "Petra's Strawberry Shortcake",
    "a": "Petra",
    "r": "0",
    "s": 8,
    "des": "\"As a teenager (born and raised in Germany) I made what we call Biskuitteig weekly, which is similar to sponge cake. I never really liked Bisquick for shortcake and remembered the spongy, tender texture of the Biskuitteig. I altered an old German recipe and came up with this delicious version. Also good with other fruit toppings!\"",
    "ins": "Place the sliced strawberries into a mixing bowl and stir in 1 cup of sugar. Cover, and refrigerate 2 hours to overnight. Stir the strawberries occasionally. The longer they sit in the syrup, the more syrup you will have.\nPreheat an oven to 375 degrees F (190 degrees C). Grease and flour a 9x13-inch baking dish. Whisk the flour together with cornstarch, and baking powder in a mixing bowl.\nBeat the egg yolks in a small bowl with the vanilla extract until smooth; set aside. Whip the egg whites with an electric mixer until very stiff. Slowly add the 1 1/4 cup sugar to the egg whites, a few tablespoons at a time, until the sugar is incorporated and the whites are stiff. Fold in the yolk mixture until almost fully blended into the whites. Fold in the flour mixture until just combined. A few small lumps of flour should remain. Scrape the batter into the prepared baking dish.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 22 to 25 minutes. Cool in the pan for 5 minutes, then invert the cake onto a sheet of waxed paper, and cut into 8 equal pieces. While the cake is cooling, whip the heavy cream with the confectioners' sugar to soft peaks.\nTo assemble the strawberry shortcakes: cut each cake square in half horizontally, and put the bottom halves onto dessert plates. Spoon on the strawberries and syrup, then top with the cake tops. Spoon on whipped cream to serve.",
    "pt": "35 m",
    "ct": "25 m",
    "tt": "3 h",
    "i": "4534620.jpg",
    "o": "4534619.jpg,2271422.jpg,1139221.jpg,1124266.jpg,1104508.jpg,966174.jpg",
    "st": "allrecipes"
}