{
    "id": 218106,
    "old_rating": "4.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup white sugar",
        "1/4 cup black bean sauce",
        "1/4 cup chopped fresh parsley",
        "1/4 cup minced green onions",
        "5 tablespoons soy sauce",
        "3 tablespoons hoisin sauce",
        "2 tablespoons dry sherry",
        "1 tablespoon sesame oil",
        "1 tablespoon vegetable oil",
        "4 teaspoons minced fresh ginger root",
        "2 teaspoons minced garlic",
        "1/2 teaspoon Chinese five-spice powder",
        "2 pounds chicken tenders",
        "12 (6 inch) wooden skewers, or as needed, soaked in water for 30 minutes"
    ],
    "nut": [
        "Calories > 237 kcal",
        "Carbs > 18.2 g",
        "Cholesterol > 66 mg",
        "Fat > 5.5 g",
        "Protein > 27.4 g",
        "Sodium > 812 mg"
    ],
    "n": "Susan's Jee Bow Gai",
    "a": "Susan Rehders",
    "r": "0",
    "s": 8,
    "des": "\"This is an Asian dish that I've had for a long time, and it can be either an appetizer or main dish when served with rice. It originally was supposed to deep fried in small foil packets, but I found that way too messy. Grilling it is oh so yummy! The longer it marinates, the better it is. Personally I prefer it to marinade for 2 days.\"",
    "ins": "Whisk together the sugar, black bean sauce, parsley, green onions, soy sauce, hoisin sauce, sherry, sesame oil, vegetable oil, ginger, garlic, and five-spice powder in a bowl, and pour into a resealable plastic bag. Add the chicken, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator overnight, up to 2 days, turning occasionally.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate. Remove the chicken from the marinade, and shake off excess. Discard the remaining marinade. Weave the chicken tenders onto skewers.\nCook the skewered chicken on the preheated grill until no longer pink in the center and the juices run clear, turning occasionally, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "12 h ",
    "i": "806305.jpg",
    "o": "",
    "st": "allrecipes"
}