{
    "id": 218266,
    "old_rating": "4.58333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 slices bacon",
        "3/4 cup shredded Gouda cheese",
        "1 tablespoon chopped fresh parsley",
        "1 1/2 tablespoons Dijon mustard",
        "1 pound ground beef",
        "1/4 cup bread crumbs",
        "1 egg",
        "3 cloves garlic, chopped",
        "1/2 teaspoon garlic powder",
        "salt and ground black pepper to taste",
        "2 hamburger buns, split and toasted"
    ],
    "nut": [
        "Calories > 853 kcal",
        "Carbs > 37.1 g",
        "Cholesterol > 296 mg",
        "Fat > 48.9 g",
        "Protein > 61.8 g",
        "Sodium > 1365 mg"
    ],
    "n": "Bacon Gouda Patties",
    "a": "mommyluvs2cook",
    "r": "0",
    "s": 2,
    "des": "\"These make great burgers! The beef is simple but the filling is rich and flavorful! Serve with your favorite toppings and buns!\"",
    "ins": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Cool and crumble into a bowl. Stir in the gouda cheese, parsley, and Dijon mustard. Set filling aside.\nPlace the ground beef into a mixing bowl with the bread crumbs, egg, chopped garlic, and garlic powder. Season to taste with salt and black pepper. Mix until evenly blended, and form into 4 very thin patties.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nDivide the filling in half and spread each half onto a patty. Top filling with remaining patties to make 2 stuffed burgers. Press and seal edges tightly together to keep the filling enclosed.\nCook stuffed burgers on the preheated grill until the patties are cooked to your desired degree of doneness and the cheese has melted, 3 to 5 minutes per side for well done. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Serve on toasted hamburger buns.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "973876.jpg",
    "o": "",
    "st": "allrecipes"
}