{
    "id": 218230,
    "old_rating": "3.55556",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (14 ounce) can beef broth",
        "1/2 cup soy sauce",
        "1/2 cup olive oil",
        "1/3 cup lemon juice",
        "5 tablespoons Worcestershire sauce",
        "2 teaspoons minced garlic",
        "2 tablespoons garlic powder, preferably roasted",
        "2 tablespoons dried basil",
        "2 tablespoons dried parsley",
        "1 tablespoon ground black pepper",
        "1 tablespoon vegetable oil",
        "1 (5 pound) beef chuck roast, patted dry with paper towels",
        "1 cup baby carrots",
        "1 cup uncooked elbow macaroni"
    ],
    "nut": [
        "Calories > 648 kcal",
        "Carbs > 18.1 g",
        "Cholesterol > 129 mg",
        "Fat > 46.8 g",
        "Protein > 37.4 g",
        "Sodium > 1266 mg"
    ],
    "n": "Dad's Home With the Kids Slow-Cooker Roast",
    "a": "Kookie",
    "r": "0",
    "s": 8,
    "des": "\"Garlicky-saucy slow cooker recipe that has 3 of 4 food groups. Just add a glass of milk, and Mom will be happy! Use your favorite dried pasta shape.\"",
    "ins": "In a blender, pour the beef broth, soy sauce, olive oil, lemon juice, and Worcestershire sauce; add garlic, garlic powder, basil, parsley, and black pepper. Cover blender, and pulse a few times, then blend thoroughly, about 20 seconds.\nIn a large skillet over medium-high heat, heat the vegetable oil until tiny wisps of smoke rise, then brown the roast on all sides, 2 to 3 minutes per side. Place the roast into a slow cooker. Pour the beef broth mixture from the blender over the roast, set the cooker to Medium, and cover.\nCook until very tender, 5 to 6 hours; add the carrots, recover the cooker, and cook for 10 more minutes; then mix in the macaroni. Cover the cooker, and simmer until macaroni and carrots are tender, about 20 more minutes. Slice beef, and serve with macaroni, carrots, and sauce.",
    "pt": "10 m",
    "ct": "5 h ",
    "tt": "5 h ",
    "i": "809636.jpg",
    "o": "",
    "st": "allrecipes"
}