{
    "id": 218220,
    "old_rating": "4.39535",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (18.25 ounce) box devil's food chocolate cake mix",
        "1 1/2 teaspoons ground ancho chile pepper",
        "1/4 teaspoon cayenne pepper",
        "1 1/4 cups water",
        "1/3 cup vegetable oil",
        "3 eggs",
        "1 teaspoon ground ancho chile pepper",
        "1/8 teaspoon cayenne pepper",
        "1/2 teaspoon ground cinnamon",
        "4 cups confectioners' sugar, or more as needed",
        "1 (8 ounce) package cream cheese, softened",
        "1/2 cup butter, softened",
        "1/2 teaspoon clear vanilla extract, or to taste",
        "24 small dried red chiles"
    ],
    "nut": [
        "Calories > 273 kcal",
        "Carbs > 36.1 g",
        "Cholesterol > 57 mg",
        "Fat > 13.5 g",
        "Protein > 3 g",
        "Sodium > 249 mg"
    ],
    "n": "Cinco de Chili Chocolate Cupcakes with Chili Cream Cheese Frosting",
    "a": "Candice",
    "r": "0",
    "s": 24,
    "des": "\"Dark chocolate cupcakes with a bite! Topped with Chili Cream Cheese Frosting. This recipe was inspired from a combination of recommendations from AR Buzzers. Thanks all! They were a huge hit at our annual Chili Cook-off. Many wanted THEM to be allowed as an entry. Add more chili and cayenne powder to taste. (IF YOU CAN TAKE IT!)\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line 24 cupcake cups with paper liners.\nEmpty the boxed cake mix into a mixing bowl, and whisk in 1 1/2 teaspoon of ground ancho chile and 1/4 teaspoon of cayenne pepper. Using an electric mixer on medium speed, beat in the water, vegetable oil, and eggs; beat for 2 minutes. Spoon the batter into the prepared cupcake cups, filling them 2/3 full.\nBake in the preheated oven until a toothpick inserted into the center of a cupcake comes out clean, 18 to 22 minutes. Remove and cool completely before frosting.\nIn a bowl, sift 1 teaspoon of ground ancho chile, 1/8 teaspoon of cayenne pepper, and the cinnamon with the confectioners' sugar. Beat in the cream cheese and butter with an electric mixer on medium speed until the frosting is smooth; mix in the vanilla extract. Spread the frosting onto the cooled cupcakes in attractive swirls, and poke a small dried chile, stem-side up, into the frosting as a garnish.",
    "pt": "30 m",
    "ct": "18 m",
    "tt": "1 h ",
    "i": "662460.jpg",
    "o": "4512799.jpg,4512798.jpg,4512567.jpg,4512027.jpg,4512026.jpg,4511779.jpg",
    "st": "allrecipes"
}