{
    "id": 218229,
    "old_rating": "4.85714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound thin spaghetti, broken into 1 1/2-inch lengths",
        "salt and ground black pepper to taste",
        "2 cloves garlic, minced, divided",
        "1 tablespoon dried basil, divided",
        "1/4 cup olive oil, divided",
        "2 pints grape tomatoes, diced",
        "1/2 red onion, diced",
        "1 (6 ounce) can small pitted black olives, halved lengthwise",
        "1 (12 ounce) package sliced fresh mushrooms",
        "6 romaine lettuce leaves, torn into bite size pieces"
    ],
    "nut": [
        "Calories > 294 kcal",
        "Carbs > 38.2 g",
        "Cholesterol > 0 mg",
        "Fat > 13.2 g",
        "Protein > 8.2 g",
        "Sodium > 263 mg"
    ],
    "n": "Sarah Rose's Dad's Made-Up Kind of a Salad Sort of Thing",
    "a": "Sarah Rose",
    "r": "0",
    "s": 6,
    "des": "\"A lovely and fresh pasta salad my dad threw together one night that became a favorite. It's also very flexible. As Dad says, 'If you want to put something else in, go ahead, ain't no big deal. As long as no one starts poking it with a fork and mumbling,'had a failed science experiment look like this once, only it smelled better,' you're doin' just fine.'\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the broken spaghetti, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 10 minutes. Drain well in a colander set in the sink. Transfer to a salad bowl while still hot, and season to taste with salt, black pepper, half the minced garlic, half the basil, and 2 tablespoons of olive oil. Refrigerate to chill, about 30 minutes.\nIn another bowl, mix the remaining minced garlic, basil, 2 more tablespoons of olive oil, grape tomatoes, red onion, black olives, and sliced mushrooms. Lightly toss the chilled spaghetti mixture into the grape tomato mixture, and season with salt and black pepper if needed. For best flavor, allow the pasta mixture to chill overnight to blend the flavors.\nJust before serving, toss with the torn romaine lettuce.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "9 h",
    "i": "661329.jpg",
    "o": "",
    "st": "allrecipes"
}