{
    "id": 218201,
    "old_rating": "4.74468",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/3 cups all-purpose flour",
        "1 1/4 cups white sugar",
        "1/3 cup unsweetened cocoa powder",
        "2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 cup sour cream",
        "1/2 cup milk",
        "1/3 cup vegetable oil",
        "2 eggs, beaten",
        "1 teaspoon almond extract",
        "1 1/2 cups fresh dark sweet cherries, pitted and chopped",
        "1 cup miniature semisweet chocolate chips"
    ],
    "nut": [
        "Calories > 370 kcal",
        "Carbs > 54.3 g",
        "Cholesterol > 40 mg",
        "Fat > 16.2 g",
        "Protein > 5.8 g",
        "Sodium > 312 mg"
    ],
    "n": "Double Chocolate Cherry Muffins",
    "a": "kjstrom",
    "r": "0",
    "s": 12,
    "des": "\"I was trying to think of a way to use my overabundance of Bing cherries last summer.  I have an obsession with muffins, so I started brainstorming, and thus was born these wonderful, chocolaty muffins.\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C). Grease 12 jumbo (3 1/2-inch) muffin cups or line with paper baking cups.\nStir together the flour, sugar, cocoa powder, baking powder, baking soda, and salt in a separate large bowl, and make a well in the center; set aside. Whisk together the sour cream, milk, vegetable oil, eggs, and almond extract in a bowl until evenly blended. Pour the sour cream mixture into the well, then stir in the flour mixture until just combined. Fold in the cherries and chocolate chips. Spoon into prepared muffin cups, filling half full.\nBake until a toothpick inserted into centers comes out clean, about 20 to 25 minutes.  Cool in pan on wire rack 5 minutes.  Remove from pan and cool completely on wire rack.  Store tightly covered at room temperature.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "968662.jpg",
    "o": "3664503.jpg,3664502.jpg,3664501.jpg,3537514.jpg,3356441.jpg,3214408.jpg",
    "st": "allrecipes"
}