{
    "id": 218299,
    "old_rating": "4.55556",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package elbow macaroni",
        "2 pounds lean ground beef",
        "1/2 cup chopped onion",
        "2 (8 ounce) cans tomato sauce",
        "1 (14.5 ounce) can diced tomatoes",
        "1 (14 ounce) can whole kernel corn, drained",
        "1 (15 ounce) can kidney beans, rinsed and drained",
        "1 (1.25 ounce) package taco seasoning mix",
        "1 (1.25 ounce) package chili seasoning mix",
        "1 (10.75 ounce) can condensed cheddar cheese soup",
        "1 (10.75 ounce) can milk",
        "1 cup shredded Cheddar cheese",
        "1/2 cup sour cream",
        "1 1/2 teaspoons garlic powder",
        "1/2 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 cup shredded Cheddar cheese",
        "1 cup crushed tortilla chips",
        "1/2 cup sour cream (optional)"
    ],
    "nut": [
        "Calories > 539 kcal",
        "Carbs > 53.1 g",
        "Cholesterol > 81 mg",
        "Fat > 22.8 g",
        "Protein > 30.1 g",
        "Sodium > 1389 mg"
    ],
    "n": "Chili Macaroni Casserole",
    "a": "Beth71",
    "r": "0",
    "s": 12,
    "des": "\"This is a delicious layered dish of chili and macaroni and cheese, topped with tortilla chips and cheese for a nice crunch.  Serve with a dollop of sour cream.  My family loves it!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the macaroni, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink.\nIn a large skillet over medium heat, cook and stir the ground beef with onion until the meat is browned, about 10 minutes. Break the meat up into crumbles as it cooks; drain excess grease. Mix in the tomato sauce, diced tomatoes, corn, kidney beans, taco seasoning, and chili seasoning; bring to a boil, reduce heat to a simmer, and cook, stirring occasionally, for about 20 minutes.\nWhisk the Cheddar cheese soup and milk in a saucepan until smooth, and bring to a simmer over medium-low heat. Whisk in 1 cup of shredded Cheddar cheese, 1/2 cup of sour cream, and garlic powder; season to taste with salt and black pepper.\nArrange the cooked macaroni into the bottom of a 10x15-inch baking dish, and mix with the soup mixture. Pour the ground beef chili over the macaroni, and sprinkle with 1 more cup shredded Cheddar cheese and crushed tortilla chips.\nBake in the preheated oven until the casserole is hot and bubbling and the cheese topping has melted, 20 to 30 minutes. Serve topped with dollops of sour cream.",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "1112490.jpg",
    "o": "3976992.jpg,2839058.jpg,2276872.jpg,2162019.jpg,1056633.jpg,662914.jpg",
    "st": "allrecipes"
}