{
    "id": 218361,
    "old_rating": "4.71739",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 pounds fresh strawberries, hulled and sliced",
        "1/4 cup white sugar",
        "1 quart heavy cream",
        "1 (3.3 ounce) package instant white chocolate pudding mix",
        "1 (6 ounce) container lemon yogurt",
        "2 tablespoons coconut-flavored rum, or to taste, divided (optional)",
        "2 (16 ounce) prepared pound cakes, cubed",
        "2 pints fresh blueberries, or as needed"
    ],
    "nut": [
        "Calories > 537 kcal",
        "Carbs > 50.5 g",
        "Cholesterol > 221 mg",
        "Fat > 36.1 g",
        "Protein > 6.3 g",
        "Sodium > 293 mg"
    ],
    "n": "All American Trifle",
    "a": "Rachel Mehl",
    "r": "0",
    "s": 15,
    "des": "\"This is a creamy, fruity, heavenly dessert. I've been told it's like super-charged strawberry shortcake!\"",
    "ins": "In a bowl, sprinkle the strawberries with sugar; stir to distribute the sugar, and set aside. Chill a large metal mixing bowl and beaters from an electric mixer.\nPour the cream into the chilled mixing bowl, and add white chocolate pudding mix, lemon yogurt, and about 1 tablespoon of coconut rum, if desired; beat until fluffy with an electric mixer set on Medium speed.\nSpread a layer of pound cake cubes into the bottom of a glass 10x15-inch baking dish, and sprinkle the cubes with another tablespoon of coconut rum. Cover the pound cake with a layer of strawberries; sprinkle blueberries over the strawberries. Spread a thick layer of whipped cream over the berries. Repeat the layers several times, ending with a layer of strawberries sprinkled with blueberries and reserving about 1 cup of whipped cream; top the trifle with dollops of whipped cream to serve. Refrigerate leftovers.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "3798137.jpg",
    "o": "4537149.jpg,4533068.jpg,4531836.jpg,4531766.jpg,4521279.jpg,3719516.jpg",
    "st": "allrecipes"
}