{
    "id": 218358,
    "old_rating": "4.7",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 3/4 cups all-purpose flour",
        "1 teaspoon cream of tartar",
        "1 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1/2 cup vegetable shortening",
        "1/2 cup margarine, softened",
        "1 1/2 cups white sugar",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "2 (8 ounce) packages cream cheese, softened",
        "1 cup white sugar",
        "2 teaspoons vanilla extract",
        "3 large bananas, sliced - or as needed",
        "1 tablespoon lemon juice, or as needed",
        "1 (16 ounce) package fresh strawberries, sliced",
        "1 (6 ounce) container fresh blueberries"
    ],
    "nut": [
        "Calories > 302 kcal",
        "Carbs > 38.9 g",
        "Cholesterol > 36 mg",
        "Fat > 15.2 g",
        "Protein > 3.8 g",
        "Sodium > 182 mg"
    ],
    "n": "Patriotic Fruit Pizza",
    "a": "Marcy R.",
    "r": "0",
    "s": 24,
    "des": "\"This is a fun recipe for the 4th of July holiday!  Fresh fruit is a hit on desserts during the summer months! Making this dessert is as fun as eating it! This recipe feeds a lot, but the leftovers are only good a day or two.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Whisk the flour, cream of tartar, baking soda, and salt in a bowl.\nIn a large mixing bowl, mash the vegetable shortening and margarine together until thoroughly combined, and beat in 1 1/2 cup of sugar, eggs, and 1 teaspoon of vanilla extract. Mix in the flour mixture to make a workable dough, and spread the dough out in a rectangle shape onto an ungreased 12x17 inch baking sheet.\nBake in the preheated oven until very lightly browned, 8 to 10 minutes. Allow to cool completely.\nWhile the cookie base is cooling, mash the cream cheese with 1 cup of sugar and 2 teaspoons of vanilla extract in a bowl until smooth. Place sliced bananas in a bowl, and gently toss with lemon juice to prevent browning.\nTo decorate the pizza, spread the cream cheese filling all over the cookie base in an even, smooth layer. Place the blueberries in a square in neat, closely-spaced rows, in the left upper corner for blue stars. Arrange alternating stripes of white bananas and red strawberry slices across the pizza. Refrigerate leftovers.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "1 h",
    "i": "4537084.jpg",
    "o": "4537084.jpg,4537082.jpg,4534920.jpg,4532996.jpg,3719041.jpg,3715104.jpg",
    "st": "allrecipes"
}