{
    "id": 218398,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Sauce:",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "1 large portobello mushroom cap, cut into bite-size pieces",
        "1 (7.75 ounce) can enchilada sauce (such as El Pato Salsa de Chile Fresco Â®)",
        "1 cup water",
        "Grits:",
        "3 cups water",
        "1 cup coarse yellow cornmeal",
        "1/4 cup milk",
        "1/2 cup shredded sharp Cheddar cheese",
        "1 teaspoon bacon salt",
        "1 dash black pepper"
    ],
    "nut": [
        "Calories > 363 kcal",
        "Carbs > 49.8 g",
        "Cholesterol > 21 mg",
        "Fat > 13.5 g",
        "Protein > 10.6 g",
        "Sodium > 510 mg"
    ],
    "n": "Cheesy Grits Mexicano",
    "a": "Mumsy'sCouchPotato",
    "r": "0",
    "s": 3,
    "des": "\"Enchilada sauce with portobello mushrooms and caramelized onions served with sharp Cheddar cheesy grits. I served it to mi hombre guapo and his response, 'Make it again.'\"",
    "ins": "Heat the olive oil in a saucepan over medium heat. Stir in the onion, and cook until the onion is tender and has turned translucent, about 5 minutes. Reduce heat to medium-low, cover, and continue cooking, stirring occasionally, until the onion is dark brown, 15 to 20 minutes. Once caramelized, stir in the portobello mushroom, enchilada sauce, and 1 cup of water. Bring to a simmer and cook 5 minutes. Keep warm over low heat.\nMeanwhile, bring 3 cups of water to a boil in a large saucepan over high heat. Whisk in the cornmeal and turn heat to low. Simmer, whisking the grits frequently until thickened, about 10 minutes. Whisk in the milk once thick, and continue cooking until the grits are tender. Once done, remove from the heat, and whisk in the Cheddar cheese and bacon salt. Season to taste with black pepper and additional bacon salt. Top the grits with the sauce to serve.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "669390.jpg",
    "o": "",
    "st": "allrecipes"
}