{
    "id": 218304,
    "old_rating": "3.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (4 ounce) package cream cheese, softened",
        "1 cup confectioners' sugar, sifted",
        "1 teaspoon vanilla extract",
        "1 tablespoon milk, or as needed",
        "1 1/2 cups all-purpose flour",
        "2 tablespoons white sugar",
        "2 teaspoons baking powder",
        "1 tablespoon unsweetened cocoa powder",
        "1 teaspoon salt",
        "2 eggs",
        "1/4 cup milk",
        "1 cup buttermilk",
        "1 teaspoon vanilla extract",
        "1 teaspoon distilled white vinegar",
        "2 teaspoons red food coloring",
        "1/4 cup melted butter"
    ],
    "nut": [
        "Calories > 597 kcal",
        "Carbs > 79.7 g",
        "Cholesterol > 159 mg",
        "Fat > 25.4 g",
        "Protein > 13.2 g",
        "Sodium > 1099 mg"
    ],
    "n": "Red Velvet Pancakes with Cream Cheese Glaze",
    "a": "Samantha Jones",
    "r": "0",
    "s": 4,
    "des": "\"The first time I had these were at a very cute upscale Breakfast/Brunch Inn. Went home that very day and began recreating the amazing experience I had just had and I've come up with the following masterpiece!\"",
    "ins": "Prepare the cream cheese glaze by beating the cream cheese, confectioners' sugar, and 1 teaspoon vanilla extract in a bowl until smooth. Thin with 1 tablespoon milk or as needed to achieve a pourable consistency. Set aside.\nWhisk the flour, white sugar, baking powder, cocoa powder, and salt together in a bowl until evenly blended; set aside. Beat the eggs in a separate mixing bowl until smooth. Whisk in 1/4 cup milk with the buttermilk, 1 teaspoon vanilla extract, vinegar, and food coloring. Stir in the flour mixture until moistened. Drizzle in the melted butter, and stir until the butter has incorporated and small lumps of flour remain.\nHeat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle, and cook until bubbles form and the edges are dry. Flip, and cook until browned on the other side. Repeat with remaining batter. Drizzle with the cream cheese glaze to serve.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "1006032.jpg",
    "o": "4489066.jpg,3314967.jpg,3264178.jpg,3261103.jpg,1351964.jpg,1351963.jpg",
    "st": "allrecipes"
}