{
    "id": 218322,
    "old_rating": "3.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (2 pound) slabs baby back pork ribs",
        "2 teaspoons steak seasoning, or to taste",
        "1 cup ketchup",
        "3 tablespoons Worcestershire sauce",
        "1 cup honey barbecue sauce",
        "2 onions, cut into 1/2-inch slices"
    ],
    "nut": [
        "Calories > 462 kcal",
        "Carbs > 24.3 g",
        "Cholesterol > 117 mg",
        "Fat > 29.5 g",
        "Protein > 24.9 g",
        "Sodium > 1078 mg"
    ],
    "n": "Traveling Oven-Barbecued Baby Back Ribs",
    "a": "New Orleans Gal",
    "r": "0",
    "s": 8,
    "des": "\"I fixed these ribs for the 4th of July. My son-in-law did not have to brave the heat to barbecue (which he greatly appreciated), and my kitchen was cooled off by the time I returned home after our celebration. Putting the ribs in the already heated slow cooker kept them nice and warm on my 20-minute drive.\"",
    "ins": "Cut the racks of ribs into serving sizes of 2 to 3 ribs. Sprinkle with steak seasoning, and place into a resealable plastic bag; refrigerate overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nMix the ketchup, Worcestershire sauce, and honey barbecue sauce in a bowl, and stir to combine. Place the ribs, bone sides down, in a single layer in a large roasting pan. Place slices of onion on the ribs; cover the pan with foil.\nBake in the preheated oven until ribs are cooked through, about 1 hour. Drain off excess fat.\nPick the onion slices from the ribs, and place them into the bottom of a slow cooker. Top the ribs in the roasting pan with the barbecue sauce mixture, reserving 1/2 cup. Pour the reserved half-cup of barbecue sauce mix over the onions in the slow cooker, and set the cooker to Low. Return the ribs to the oven and bake until tender, an additional 45 minutes, basting several times with sauce.\nRemove the ribs from the roasting pan and gently place into the slow cooker; pour in sauce. Either serve immediately, or cover the cooker for transporting ribs.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "10 h",
    "i": "669205.jpg",
    "o": "",
    "st": "allrecipes"
}