{
    "id": 218360,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 slices thick-cut bacon",
        "1/4 cup all-purpose flour, or more if needed",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "2 eggs",
        "1 tablespoon water",
        "4 boneless, skinless chicken breasts",
        "1 (6 ounce) package corn bread stuffing mix",
        "1/2 cup grated Parmesan cheese",
        "2 tablespoons canola oil",
        "4 slices American cheese"
    ],
    "nut": [
        "Calories > 660 kcal",
        "Carbs > 38.5 g",
        "Cholesterol > 217 mg",
        "Fat > 31.6 g",
        "Protein > 53.2 g",
        "Sodium > 2186 mg"
    ],
    "n": "Chicken American",
    "a": "Jimfitz",
    "r": "0",
    "s": 4,
    "des": "\"I have been making this dish since I was in my early teen years. Instead of using regular bread crumbs, I use a packaged cornbread stuffing to make a more crispy/crunchy coating. The Parmesan cheese  may be increased or decreased depending on your personal taste.  Try switching out the American cheese.  I have made this with Swiss cheese and served sauteed mushrooms and onions to put over the top. I usually serve with steamed broccoli and roasted potatoes.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Place a baking rack over a roasting pan.\nPlace the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until browned but not totally crisp, 5 to 8 minutes. Drain the bacon slices on a paper towel-lined plate.\nMix the flour, salt, and black pepper into a resealable plastic bag, seal the bag, and shake a few times to combine. Beat the eggs with water in a shallow dish. Place the corn bread stuffing mix into a large plastic bag, seal the bag, and roll the stuffing with a rolling pin to crush it into crumbs. Pour the stuffing crumbs into a shallow dish. Mix in the Parmesan cheese.\nRinse chicken breasts, shake off excess water, and place them, one at a time, into the bag containing the flour. Seal the bag and shake well to coat the chicken with flour; shake off excess flour. Dip the floured breast into the beaten egg, then gently but firmly press into the corn stuffing crumbs, turning to coat all sides.\nHeat canola oil in a large skillet over medium heat, and pan fry the breaded chicken breasts until golden brown, about 5 minutes per side. Transfer the chicken breasts to the baking rack; cut the bacon slices in half crosswise, and lay 4 halves on each chicken breast. Top the bacon with a slice of American cheese.\nBake in the preheated oven until the chicken is cooked through and no longer pink inside, the bacon is crisp, and the cheese has melted, 15 to 20 minutes. An instant-read meat thermometer inserted into the thickest part of a breast should read at least 160 degrees F (70 degrees C).",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "973062.jpg",
    "o": "",
    "st": "allrecipes"
}