{
    "id": 218326,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 (3 pound) beef tri-tip roast, fat layer left untrimmed",
        "2 teaspoons garlic pepper seasoning (such as SuzyQ's Santa Maria Valley Style SeasoningÂ®), or to taste",
        "2 tablespoons olive oil",
        "2 tablespoons minced garlic",
        "2 onions, chopped",
        "2 teaspoons ground ancho chile pepper",
        "2 teaspoons cayenne pepper",
        "2 teaspoons ground black pepper",
        "1 1/2 cups white wine",
        "1 (28 ounce) can crushed tomatoes",
        "1 tablespoon chopped fresh cilantro, or to taste"
    ],
    "nut": [
        "Calories > 300 kcal",
        "Carbs > 10.3 g",
        "Cholesterol > 105 mg",
        "Fat > 11.9 g",
        "Protein > 32.1 g",
        "Sodium > 207 mg"
    ],
    "n": "Shredded Tri-Tip for Tacos in the Slow Cooker",
    "a": "Wendy Stevens",
    "r": "0",
    "s": 12,
    "des": "\"This is a recipe I created by marrying two together. You can make it as spicy as you like by adding jalapenos or other chiles. I tried it first on my co-workers and there was nothing left!  Then I made it for my family and they loved it, too. My Hispanic co-workers really liked it, so I guess I passed the 'test!'\"",
    "ins": "Spray the inside of a slow cooker with cooking spray. Season the tri-tip roast with garlic pepper seasoning on both sides.\nHeat olive oil in a large, heavy skillet over medium heat, and sear the roast on all sides until well browned, about 5 minutes per side. Place the tri-tip roast into the slow cooker, fatty side up.\nCook and stir the garlic and onions in the hot skillet until golden brown, about 10 minutes, and season with the ancho chile pepper, cayenne pepper, and black pepper. Place seasoned garlic and onions over the roast in the cooker, and pour in the white wine and crushed tomatoes. Cover the cooker, set to Low, and cook until tender, about 8 hours.\nRemove roast from the cooker, and cut off the fatty layer with a sharp knife (tender meat should cut easily). Place the roast back into the cooker, and shred meat with two forks. If desired, remove some of the liquid from the meat. Stir in cilantro and serve.",
    "pt": "15 m",
    "ct": "8 h",
    "tt": "8 h ",
    "i": "1124913.jpg",
    "o": "",
    "st": "allrecipes"
}