{
    "id": 218347,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup egg whites",
        "1/4 cup white sugar",
        "1/4 cup sifted confectioners' sugar",
        "10 peaches, peeled and cut into chunks",
        "1 pinch ground cinnamon",
        "1 cup heavy cream",
        "1/2 teaspoon confectioners' sugar",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 179 kcal",
        "Carbs > 18.8 g",
        "Cholesterol > 41 mg",
        "Fat > 11 g",
        "Protein > 1.5 g",
        "Sodium > 29 mg"
    ],
    "n": "Pamela's Peachy Meringue Tart",
    "a": "pamelawriter",
    "r": "0",
    "s": 8,
    "des": "\"Heaven! Peaches need to be in season and delicious for this to work.  But when the peaches are good - this is sensational.  It's light and you always want more.  Be generous with your peaches!\"",
    "ins": "Preheat an oven to 300 degrees F (150 degrees C). Draw a 9-inch circle on a piece of wax or parchment paper with a pencil. Place the paper pencil-side down on a baking sheet. Butter and sugar the paper.\nBeat egg whites until foamy in a large glass or metal mixing bowl. Gradually add the white sugar, continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the egg whites should form a sharp peak that holds its shape.  Fold in 1/4 cup confectioners' sugar by gently running the spatula through the center of the bowl, then around the sides of the bowl, repeating until fully incorporated.\nTransfer the egg white mixture to a large pastry bag fitted with a 1/2-inch tip. Pipe a 1/4-inch thick disk inside the circle on the paper. Smooth the meringue with a knife, then pipe another layer along the outside edge of the disk to create a wall.\nBake in the preheated oven until the meringue is completely dry, about 1 1/2 hours. Transfer the meringue shell to a large plate.\nDrain the cut peaches over a strainer set over bowl to collect the peach juice. Sprinkle the peach juice with cinnamon. Transfer the peaches to another bowl.\nBeat heavy cream until foamy in a large glass or metal mixing bowl. Add 1/2 teaspoon confectioners' sugar and vanilla extract, continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the whipped cream should form a sharp peak that holds its shape. Spread a thick layer of whipped cream onto the meringue shell. Spoon the peach chunks over the whipped cream, then drizzle the peach juice on top. Garnish with more whipped cream. Serve immediately.",
    "pt": "45 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "712028.jpg",
    "o": "",
    "st": "allrecipes"
}