{
    "id": 218311,
    "old_rating": "4.64103",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup brown rice flour",
        "1/4 cup coconut flour",
        "3/4 cup sorghum flour",
        "3/4 cup tapioca starch",
        "1 teaspoon baking soda",
        "1 teaspoon xanthan gum",
        "1/4 teaspoon salt",
        "1/4 cup unsweetened cocoa powder, divided",
        "1 cup canola oil",
        "1 1/2 cups white sugar",
        "2 eggs at room temperature",
        "3/4 cup unsweetened applesauce",
        "1 cup buttermilk",
        "1 ounce red food coloring",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 399 kcal",
        "Carbs > 49.8 g",
        "Cholesterol > 32 mg",
        "Fat > 21.4 g",
        "Protein > 3.9 g",
        "Sodium > 198 mg"
    ],
    "n": "Gluten Free Red Velvet Cake",
    "a": "ktonks",
    "r": "0",
    "s": 12,
    "des": "\"This is the cake I am having made for my wedding.  It was certainly a challenge to find somebody to use my recipe and to do it gluten free!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 9-inch round cake pans with gluten-free flour. In a bowl, whisk together the brown rice flour, coconut flour, sorghum flour, tapioca starch, baking soda, xanthan gum, salt, and 3 tablespoons of cocoa powder in a bowl.\nIn a large mixing bowl, beat canola oil and sugar until thoroughly combined, and beat the eggs in one at a time until fully incorporated. Stir in the applesauce. Beat the flour mixture into the wet ingredients, alternating with buttermilk, in several additions, beginning and ending with flour mixture. Mix the remaining 1 tablespoon of cocoa powder with the red food coloring and vanilla extract to make a paste; gently stir into the batter. Pour the batter into the prepared cake pans.\nBake in the preheated oven until a toothpick inserted into the center of a cake comes out clean, about 25 minutes. Allow the cakes to cool completely before frosting.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "2795733.jpg",
    "o": "2795733.jpg,2433190.jpg,1284040.jpg,1090904.jpg,763853.jpg,763852.jpg",
    "st": "allrecipes"
}