{
    "id": 218459,
    "old_rating": "4.80952",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (1 pound) loaf rectangular brioche bread",
        "3 cups fresh strawberries, hulled, divided",
        "2 tablespoons water",
        "2 cups heavy cream, divided",
        "1 teaspoon vanilla extract (optional)",
        "1 tablespoon confectioners' sugar (optional)",
        "6 eggs",
        "2 tablespoons unsalted butter"
    ],
    "nut": [
        "Calories > 1008 kcal",
        "Carbs > 67.2 g",
        "Cholesterol > 563 mg",
        "Fat > 72.8 g",
        "Protein > 23.8 g",
        "Sodium > 614 mg"
    ],
    "n": "Gil's Brioche French Toast",
    "a": "Charles Gilbert, STL, MO",
    "r": "0",
    "s": 4,
    "des": "\"Brioche French toast with homemade strawberry sauce and homemade whip cream, topped with fresh strawberries.\"",
    "ins": "Place a metal mixing bowl and beaters from an electric mixer into the freezer to chill. Trim the end crusts from the brioche bread, and slice the loaf in half; cut each half in half again (4 pieces), and cut each quarter in half to total 8 pieces of brioche.\nPlace 2 cups of strawberries and the water into a saucepan over medium-high heat; cover the pan, and bring to a simmer. Gently steam the berries until they release their juice, about 5 minutes.\nBeat 1 cup of heavy cream, vanilla extract, and confectioners' sugar together with electric mixer in chilled metal bowl with the chilled beaters until the cream forms soft peaks; set aside.\nWhisk the eggs and remaining 1 cup cream together in a large bowl, and place the bread pieces into the mixture, spooning the cream over the bread to coat. Allow to stand for 5 minutes.\nHeat the butter in a skillet over medium heat until fragrant, and lay the coated brioche pieces into the skillet. Cook until the French toast is golden brown, about 3 minutes per side.\nTo serve, place 2 pieces of French toast onto a plate, overlapping slightly. Ladle cooked strawberries and their juice over the French toast, and top with a generous dollop of whipped cream. Top the cream with several fresh strawberries.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "672031.jpg",
    "o": "",
    "st": "allrecipes"
}