{
    "id": 218488,
    "old_rating": "4.65",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Marinade:",
        "2 large onions, chopped",
        "2 garlic cloves, crushed",
        "1/2 cup olive oil",
        "2 tablespoons lemon juice",
        "1 teaspoon dried oregano",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon ground turmeric",
        "1 pinch curry powder",
        "1 teaspoon salt",
        "1 pound beef flank steak, thinly sliced",
        "Tzatziki Sauce:",
        "8 ounces sour cream",
        "2 tablespoons olive oil",
        "1 tablespoon lemon juice",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 tablespoon chopped fresh dill",
        "1 clove garlic, crushed",
        "6 pita bread rounds"
    ],
    "nut": [
        "Calories > 512 kcal",
        "Carbs > 36 g",
        "Cholesterol > 33 mg",
        "Fat > 34.3 g",
        "Protein > 15.7 g",
        "Sodium > 891 mg"
    ],
    "n": "Turkish Kebabs",
    "a": "RACHEY638",
    "r": "0",
    "s": 6,
    "des": "\"This is my version of Turkish kebabs which I made 'off the cuff' after searching unsuccessfully for a recipe online.  The original sandwiches are made from meat that is pressed into a loaf and grilled on a rotating spit. The meat is shaved off as it gets crispy and then put into a pita sandwich. My recipe calls for thin slices of meat to be marinated and then broiled to get the same effect without a huge rotating grill. Serve in a warmed pita with goat cheese, tzatziki sauce, lettuce, tomatoes, onions, and pepperoncinis.\"",
    "ins": "Place the chopped onions in a large ceramic bowl and crush with the bottom of a glass until juice is rendered and onions look translucent. Stir in 2 crushed garlic cloves, 1/2 cup olive oil, 2 tablespoons lemon juice, oregano, 1 teaspoon black pepper, turmeric, curry powder, and 1 teaspoon salt. Mix well; add the sliced beef and toss to coat. Cover the bowl with plastic wrap, and marinate in the refrigerator overnight.\nCombine the sour cream, 2 tablespoons olive oil, 1 tablespoon lemon juice, 1/2 teaspoon salt, 1/2 teaspoon black pepper, dill, and 1 crushed clove of garlic. Mix well; cover the bowl with plastic wrap and refrigerate overnight.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nRemove the meat from the marinade mixture, brushing off extra onions. Spread the slices on a baking sheet without overlapping, and salt to taste. Broil about 3 minutes per side or until browned and crispy, turning halfway through cooking.\nDivide the cooked meat between the pita breads, and drizzle with tzatziki sauce to serve.",
    "pt": "40 m",
    "ct": "10 m",
    "tt": "1 d ",
    "i": "3588657.jpg",
    "o": "",
    "st": "allrecipes"
}