{
    "id": 218487,
    "old_rating": "4.63636",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 cup peeled, seeded, and shredded cucumber",
        "2 1/4 cups plain yogurt",
        "cheesecloth",
        "2 1/2 teaspoons fresh lemon juice",
        "1 tablespoon olive oil",
        "4 cloves garlic, minced",
        "1 tablespoon fresh dill, chopped",
        "1 red onion, thinly sliced",
        "1 teaspoon lemon juice",
        "1 teaspoon ground sumac",
        "1 pound ground beef",
        "1 small sweet onion, minced",
        "1 1/4 teaspoons crushed red pepper flakes",
        "1/2 tablespoon ground coriander",
        "1/2 tablespoon ground cumin",
        "1 tablespoon Urfa biber",
        "1 tablespoon butter, softened",
        "1/2 red bell pepper, chopped",
        "1 teaspoon kosher salt, or to taste",
        "2 tablespoons olive oil",
        "4 hamburger buns"
    ],
    "nut": [
        "Calories > 574 kcal",
        "Carbs > 41.3 g",
        "Cholesterol > 85 mg",
        "Fat > 31.4 g",
        "Protein > 31.6 g",
        "Sodium > 910 mg"
    ],
    "n": "Cyprus Gyro Burger",
    "a": "James",
    "r": "0",
    "s": 4,
    "des": "\"This dish is a delicious crucible of American, Greek, and Turkish cuisine. My entire family and friends love it so much, it makes a regular appearance at all of our cookouts. It's spicy, it's zesty, it's pure deliciousness. Enjoy!\"",
    "ins": "Place the grated cucumber on a heavy-duty paper towel or clean kitchen towel. Top with another towel, and pat dry; set aside. Scoop the yogurt into a large square of fine cheesecloth, twist the ends to close, and squeeze to remove excess moisture.\nTransfer the strained yogurt to a bowl, and stir in 2 1/2 teaspoons of lemon juice. Gradually add 1 tablespoon olive oil, whisking constantly, until fully incorporated. Mix in the garlic, dill, and drained cucumbers; cover and refrigerate.\nCombine the red onion, 1 teaspoon lemon juice, and sumac. Cover and refrigerate.\nPlace the ground beef in a bowl and add the minced onion, red pepper flakes, coriander, cumin, Urfa biber, and butter. Mix gently with your hands until all of the ingredients are well distributed.\nPlace bell pepper in blender and blend until it is mostly pureed. Pour off any excess liquid, and add the bell pepper and kosher salt to the meat; mix well. Divide the meat into 4 equal portions and form into patties slightly larger than the buns, as the patties will shrink a bit.\nPreheat an outdoor grill for high heat, and lightly oil the grate.\nBrush the patties with  2 tablespoons olive oil and grill on high and direct heat about 5 minutes per side or until done to your liking. Place each burger on a bun; top the burgers with cucumber and yogurt tzatziki and the lemon-soaked red onion and sumac mixture.",
    "pt": "1 h",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "828569.jpg",
    "o": "",
    "st": "allrecipes"
}