{
    "id": 218484,
    "old_rating": "3.55556",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 cup red wine",
        "8 cloves garlic",
        "6 bay leaves, crumbled",
        "2 tablespoons coarse salt",
        "freshly ground pepper to taste",
        "3 pounds beef sirloin steak, cut into cubes",
        "bamboo skewers, soaked in water for 60 minutes"
    ],
    "nut": [
        "Calories > 190 kcal",
        "Carbs > 1.4 g",
        "Cholesterol > 59 mg",
        "Fat > 7.8 g",
        "Protein > 23.8 g",
        "Sodium > 1446 mg"
    ],
    "n": "Espetadas (Portuguese Beef Shish Kabobs)",
    "a": "Raquel Teixeira",
    "r": "0",
    "s": 10,
    "des": "\"This is a Portuguese classic dish that originates from the island of Madeira. It involves simple ingredients but delivers amazing flavors. This is a regular staple in the summer, and the first meal I have when I travel to my home country, Madeira. You can add whole garlic cloves, sliced white onions, and red peppers in between the beef on the skewers. Also, for extra delight, you can do it how they do it in the restaurants. They hang the beef on long metal skewers with a chunk of butter on top that melts down the skewer.\"",
    "ins": "Whisk together the red wine, garlic, bay leaves, salt, and black pepper together in a large glass or ceramic bowl. Add the sirloin cubes, and toss to evenly coat. Cover the bowl with plastic wrap and marinate in the refrigerator for 8 hours or overnight.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nRemove the sirloin from the marinade; shake off excess liquid. Discard the remaining marinade. Skewer the beef onto the prepared skewers.\nCook on the preheated grill until the beef cubes start to become firm and are reddish-pink and juicy in the center, 2 to 4 minutes per side for medium-rare.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "8 h ",
    "i": "2546137.jpg",
    "o": "",
    "st": "allrecipes"
}