{
    "id": 218496,
    "old_rating": "3.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 tablespoon olive oil",
        "4 quarts mustard greens, washed and chopped",
        "1 onion, finely chopped",
        "2 tablespoons chopped roasted garlic",
        "1 (8.5 ounce) package dry corn muffin mix",
        "1 (8 ounce) package biscuit mix",
        "2 eggs",
        "1 cup milk",
        "2 tablespoons Dijon mustard",
        "2 teaspoons seasoned meat tenderizer (such as EvergladesÂ® All-Purpose Seasoning), or to taste",
        "2 (3 ounce) precooked ham steaks, chopped",
        "2 cups shredded Mexican cheese blend"
    ],
    "nut": [
        "Calories > 690 kcal",
        "Carbs > 68.3 g",
        "Cholesterol > 125 mg",
        "Fat > 33.8 g",
        "Protein > 30.3 g",
        "Sodium > 2033 mg"
    ],
    "n": "Donnasue's Cornbread Mustard Green Casserole",
    "a": "Donnasue",
    "r": "0",
    "s": 6,
    "des": "\"The reason I created this is my friend Dora. When she gives me fresh mustard greens, there was only so much I could do with them.  I wanted to make a Southern-style dinner casserole that would celebrate some of the traditional foods that I consider Southern.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Spray a 2-quart casserole dish with cooking spray.\nHeat olive oil in a large skillet over medium heat. Cook the mustard greens, onion, and roasted garlic until the onions are translucent and the mustard greens are wilted and reduced, about 10 minutes. Drain greens mixture in a colander if very juicy.\nMix the corn muffin mix, biscuit mix, eggs, and milk together in a large bowl to make a batter; mix in the Dijon mustard and seasoned tenderizing salt, then gently stir in the cooked greens, ham, and Mexican cheese blend until thoroughly combined. Scrape the mixture into the prepared casserole dish.\nBake in the preheated oven until browned and a toothpick inserted into the center of the casserole comes out clean, about 50 minutes. If casserole begins to brown too quickly, cover dish with foil partway through the cooking time. Turn off oven, and allow casserole to stand 15 minutes in the hot oven before serving.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "4098550.jpg",
    "o": "",
    "st": "allrecipes"
}