{
    "id": 218461,
    "old_rating": "4.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons extra-virgin olive oil, or more as needed",
        "1 large onion, chopped",
        "1/2 teaspoon salt",
        "freshly ground black pepper to taste",
        "1/2 teaspoon dried basil",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon dried thyme",
        "2 pounds fresh tomatoes - peeled, seeded and chopped",
        "1/4 cup dry vermouth, or to taste",
        "2 cups chicken broth",
        "1 tablespoon chopped fresh basil",
        "1 tablespoon chopped fresh oregano",
        "1 tablespoon chopped fresh thyme",
        "2 cloves garlic, thinly sliced",
        "1/4 teaspoon freshly ground cinnamon",
        "1 (4 ounce) container crumbled Gorgonzola cheese"
    ],
    "nut": [
        "Calories > 170 kcal",
        "Carbs > 10.9 g",
        "Cholesterol > 22 mg",
        "Fat > 10.4 g",
        "Protein > 6.1 g",
        "Sodium > 710 mg"
    ],
    "n": "'No Soup For You' French Tomato Soup",
    "a": "PJ's kitchen",
    "r": "0",
    "s": 6,
    "des": "\"Exotic spices and flavors of fresh tomatoes from the garden blend with onions, garlic, fresh herbs, dry vermouth and Gorgonzola cheese to present a gourmet soup to serve in an hour. Fills the kitchen with aromas of herbs and spices as it simmers. Serve with French bread or other crusty breads; just add a tossed salad with a mild balsamic vinegar and olive oil and a sprinkle of onion salt and pinch of sugar.\"",
    "ins": "Heat olive oil in a soup pot over medium heat, stir in onion. Cook and stir until golden brown, about 12 minutes; season with salt, black pepper, dried basil, dried oregano, and dried thyme. Cook until dried herbs are fragrant, about 1 more minute, then mix in the tomatoes and vermouth. Bring to a boil, then stir in the chicken broth. Bring soup back to a boil, and reduce heat to a simmer. Mix in the fresh basil, oregano, thyme, and garlic. Cover pot, and cook until tomatoes are tender, about 20 minutes, stirring occasionally.\nSprinkle cinnamon over the soup, and ladle into bowls; top each serving with a spoonful of crumbled Gorgonzola cheese.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "954903.jpg",
    "o": "",
    "st": "allrecipes"
}