{
    "id": 218586,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter, divided",
        "1 (16 ounce) loaf day-old French bread, cut into 1-inch cubes",
        "1 cup chopped walnuts",
        "4 eggs",
        "1 cup heavy cream",
        "1 (14 ounce) can sweetened condensed milk",
        "1 (14 ounce) can coconut milk",
        "1 cup brown sugar",
        "4 teaspoons vanilla extract",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground allspice",
        "1 pinch salt",
        "4 very ripe bananas, mashed"
    ],
    "nut": [
        "Calories > 734 kcal",
        "Carbs > 83.2 g",
        "Cholesterol > 145 mg",
        "Fat > 40.4 g",
        "Protein > 14.7 g",
        "Sodium > 459 mg"
    ],
    "n": "Walnut Banana Bread Pudding",
    "a": "LoavesofLuv",
    "r": "0",
    "s": 10,
    "des": "\"My mom has been making this recipe since I was little. This dessert is a big hit at every barbecue and potluck I bring this to! Sometimes I use pecans instead of walnuts. This is great with coconuts, raisins, and dried cranberries, too!\"",
    "ins": "Grease a 9x13-inch baking dish with 1 tablespoon of butter; place the remaining butter in a saucepan over low heat, and melt the butter. Spread the French bread cubes out into the greased pan, and drizzle the melted butter over the bread.\nPlace the walnuts into a dry skillet over medium-low heat; cook and stir until the walnuts turn a light golden brown and give off a toasted fragrance, about 2 minutes. Watch carefully so they don't burn. Remove from heat, and transfer walnuts into a bowl immediately to cool. Set walnuts aside.\nIn a large mixing bowl, beat the eggs lightly just to break yolks, and mix in the cream, condensed milk, coconut milk, brown sugar, vanilla extract, cinnamon, nutmeg, allspice, and salt. Whisk to thoroughly combine until smooth. Stir in mashed banana and 3/4 cup of walnuts. Pour the banana mixture evenly over the bread cubes, and push bread cubes into the mixture to coat well with the custard. Sprinkle with remaining 1/4 cup of toasted walnuts. Cover the dish with plastic wrap, and refrigerate 8 to 12 hours.\nPreheat oven to 350 degrees F (175 degrees C). Remove plastic wrap, and cover dish with foil.\nBake in the preheated oven for 15 minutes, then remove the foil and return to oven until the top is browned and the edges are pulling away from the pan, about 45 more minutes. Allow to cool before serving.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "10 h ",
    "i": "829687.jpg",
    "o": "4382563.jpg,3697257.jpg,3493315.jpg,2849490.jpg,2266282.jpg",
    "st": "allrecipes"
}