{
    "id": 218573,
    "old_rating": "4.56513",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "1 small onion, diced",
        "1 clove garlic, minced",
        "1 (1 ounce) packet taco seasoning mix",
        "1 (16 ounce) bag frozen Mexican-style corn",
        "1 (12 ounce) can black beans, rinsed and drained",
        "1 (12 ounce) bag shredded Mexican cheese blend",
        "1 (16 ounce) package frozen tater tots",
        "1 (12 fluid ounce) can enchilada sauce"
    ],
    "nut": [
        "Calories > 477 kcal",
        "Carbs > 38.4 g",
        "Cholesterol > 76 mg",
        "Fat > 27 g",
        "Protein > 24.9 g",
        "Sodium > 1305 mg"
    ],
    "n": "Tater Tot Taco Casserole",
    "a": "Irlynda Smith",
    "r": "0",
    "s": 8,
    "des": "\"Just what the grandkids ordered. Tater tots, Mexican food, and cheese! This is one of those meals that you can throw together with ingredients you would normally have on hand. Great for pot luck or a quick meal for unexpected company. Some kids don't like onion or garlic; these can be omitted.\"",
    "ins": "Preheat an oven to 375 degrees F (190 degrees C). Prepare a 9x13-inch baking dish with cooking spray.\nCook the ground beef in a skillet over medium heat until completely browned, 5 to 7 minutes. Add the onion, garlic, taco seasoning mix, frozen Mexican-style corn, and black beans to the ground beef; cook and stir another 10 minutes. Set aside to cool slightly.\nCombine the ground beef mixture in a large bowl with about 3/4 of the Mexican cheese blend and the tater tots; stir to combine.\nPour about 1/3 of the enchilada sauce into the bottom of the prepared baking dish. Add the tater tot mixture to the baking dish; lightly pat the mixture down into a solid, even layer. Pour the remaining enchilada sauce over the tater tot layer.\nBake in the preheated oven for 40 minutes. Sprinkle the remaining Mexican cheese over the casserole and return to oven until the cheese is melted and bubbly, about 5 minutes more.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1095717.jpg",
    "o": "4538997.jpg,4535815.jpg,4532482.jpg,4531449.jpg,4531448.jpg,4519540.jpg",
    "st": "allrecipes"
}