{
    "id": 218541,
    "old_rating": "4.18182",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1 teaspoon baking powder",
        "1/2 teaspoon ground cinnamon",
        "1/8 teaspoon salt",
        "2 large very ripe bananas",
        "1/2 cup caramel macchiato flavored liquid coffee creamer (such as International DelightÂ®)",
        "1/2 cup vegetable oil",
        "2 eggs",
        "2/3 cup white sugar",
        "2 tablespoons instant coffee granules",
        "6 tablespoons unsalted butter",
        "6 tablespoons packed brown sugar",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 334 kcal",
        "Carbs > 43.3 g",
        "Cholesterol > 46 mg",
        "Fat > 17 g",
        "Protein > 3.6 g",
        "Sodium > 185 mg"
    ],
    "n": "Caramel Macchiato Banana Bread",
    "a": "Dianne",
    "r": "0",
    "s": 12,
    "des": "\"Baking banana bread is one of my favorites, and I love nothing more than enjoying a slice with a nice cup of coffee. This was the inspiration for my recipe, which features a coffee infused loaf and a rich caramel glaze.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x5-inch loaf pan with cooking spray. In a bowl, whisk together flour, baking soda, baking powder, cinnamon, and salt.\nIn a large mixing bowl, mash the bananas with a fork until almost smooth, and stir in the coffee creamer, vegetable oil, eggs, sugar, and instant coffee granules until the coffee granules have dissolved. Gradually stir in the flour mixture, about 1/2 cup at a time, until batter is almost smooth, and pour batter into the prepared loaf pan.\nBake in preheated oven until a toothpick inserted into the center of the banana bread comes out clean, about 1 hour. Allow to cool before removing from pan.\nMelt the unsalted butter in a saucepan over medium heat, and mix in the brown sugar and vanilla extract. Bring the mixture to a boil, stirring to dissolve sugar, and reduce heat to a simmer. Simmer the syrup for 3 minutes, allow to cool to a warm but liquid temperature, and pour the glaze over the banana bread. Serve when glaze has set.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "676783.jpg",
    "o": "4517542.jpg,4498656.jpg,4498062.jpg,3933872.jpg,2632527.jpg,2357838.jpg",
    "st": "allrecipes"
}