{
    "id": 218668,
    "old_rating": "4.46154",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup raisins",
        "1 cup all-purpose flour",
        "1 cup whole wheat flour",
        "2/3 cup white sugar",
        "2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1 teaspoon salt",
        "1 tablespoon ground cinnamon",
        "1 teaspoon ground allspice",
        "1/2 cup nonfat dry milk powder",
        "1/4 cup toasted wheat germ",
        "1/4 cup wheat bran",
        "3 tablespoons uncooked farina hot cereal (such as Cream of WheatÂ®)",
        "3 egg whites",
        "1 1/4 cups unsweetened applesauce",
        "1 large carrot, peeled and shredded",
        "1/3 cup vegetable oil",
        "1/4 cup bran cereal",
        "3 tablespoons raw sugar"
    ],
    "nut": [
        "Calories > 174 kcal",
        "Carbs > 30.7 g",
        "Cholesterol > < 1 mg",
        "Fat > 4.5 g",
        "Protein > 4.5 g",
        "Sodium > 254 mg"
    ],
    "n": "Hearty Whole Grain Muffins",
    "a": "babooleena",
    "r": "0",
    "s": 18,
    "des": "\"These muffins are delicious.  My very, very picky son loves them for breakfast and doesn't even realize they are full of good things for him.  You can easily substitute the grains in the recipe for whatever you prefer or have on hand.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line 18 muffin cups with paper liners.\nIn a small bowl, cover the raisins with water, and set aside to plump. In a large mixing bowl, whisk together the all-purpose flour, whole wheat flour, sugar, baking powder, baking soda, salt, cinnamon, allspice, dry milk powder, wheat bran, and farina cereal until thoroughly combined.\nDrain water from the raisins. In a separate bowl, beat the egg whites until frothy, then mix in the drained raisins, applesauce, carrot, vegetable oil, and bran cereal. Pour the liquid ingredients into the flour mixture, and briefly mix just to moisten (do not overmix). Fill muffin cups about 2/3 full, and sprinkle each muffin with about 1/2 teaspoon of  raw sugar.\nBake in the preheated oven until the muffins are set and the tops are golden brown, 25 to 30 minutes. A toothpick inserted into the center of a muffin should come out clean. Serve warm.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "970416.jpg",
    "o": "",
    "st": "allrecipes"
}