{
    "id": 218621,
    "old_rating": "4.05128",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 sleeve buttery round crackers (such as RitzÂ®), crushed",
        "2 tablespoons butter, melted",
        "4 cups water",
        "1 (32 fluid ounce) container chicken stock",
        "salt and ground black pepper to taste",
        "3 skinless, boneless chicken breast halves, cubed",
        "1 (24 ounce) container sour cream, or to taste",
        "1 (26 ounce) can condensed cream of chicken soup"
    ],
    "nut": [
        "Calories > 550 kcal",
        "Carbs > 25.3 g",
        "Cholesterol > 101 mg",
        "Fat > 41.5 g",
        "Protein > 19.5 g",
        "Sodium > 1545 mg"
    ],
    "n": "Easy Creamy Chicken Casserole",
    "a": "K. Miller",
    "r": "0",
    "s": 6,
    "des": "\"This is my mother's recipe and a family favorite. It's one of our comfort foods and regular easy recipes to make through a busy week. Can easily be prepared in advance, then popped in the oven for a nice hot meal.  If making for the first time, add half of the sour cream and taste first. Add more if desired, tasting as you go, to reach desired flavor. Serve over cooked white rice.\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Mix the crackers and melted butter together in a bowl; set aside.\nBring water and chicken stock to a boil in a pot over high heat. Season with salt and black pepper. Add the chicken. Reduce heat to a simmer, and cook, stirring occasionally, until chicken is no longer pink in the center, 5 to 7 minutes. Drain the chicken; set aside. Whisk together the sour cream and cream of chicken soup in a large bowl. Stir in the chicken, then transfer the mixture to a 9x13-inch baking dish. Sprinkle the cracker mixture on top.\nBake in the preheated oven until bubbly, 25 to 30 minutes.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "45 m",
    "i": "687374.jpg",
    "o": "",
    "st": "allrecipes"
}