{
    "id": 218613,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 (10 inch) wooden skewers",
        "1 green bell pepper, cut into large chunks",
        "1 pound peeled and deveined shrimp",
        "1 small zucchini, sliced 1/4-inch thick",
        "1/2 pound skinless, boneless chicken breast - cut into cubes",
        "1/2 pint cherry tomatoes",
        "1 pound beef steak, cut into cubes",
        "24 pearl onions",
        "1/2 pound large fresh mushrooms, halved",
        "1/2 cup olive oil",
        "1/4 teaspoon garlic powder, or to taste",
        "salt and ground black pepper to taste",
        "1 pound fettuccine",
        "2 tablespoons softened butter",
        "1/4 teaspoon garlic powder"
    ],
    "nut": [
        "Calories > 519 kcal",
        "Carbs > 46.5 g",
        "Cholesterol > 135 mg",
        "Fat > 22.3 g",
        "Protein > 34.1 g",
        "Sodium > 165 mg"
    ],
    "n": "Shish Kabob a la Holly",
    "a": "Holly Chadwick",
    "r": "0",
    "s": 8,
    "des": "\"Easy to make. Grilled meat and veggie skewers served over garlic-butter fettuccine. There is nothing like grilled veggies!\"",
    "ins": "Soak the skewers in water for 1 hour.\nOnto each skewer, alternately thread green bell pepper chunks, shrimp, zucchini slices, chicken, cherry tomatoes, steak, onion, mushroom; repeat until skewer is full. Drizzle olive oil over the prepared skewers; season with 1/4 teaspoon garlic powder, salt, and black pepper. Allow to marinate in refrigerator at least 3 hours, turning every 45 minutes.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nBring a pot of lightly salted water to a rolling boil. Cook the fettuccini in the boiling water, stirring occasionally, until cooked through yet firm to the bite, about 8 minutes; drain. Toss the hot pasta in a large bowl with the softened butter and 1/4 teaspoon garlic powder.\nWhile the pasta boils, cook the skewers on the preheated grill, turning frequently until nicely browned on all sides, the shrimp are pink and opaque, and the meat is no longer pink in the center, 10 to 15 minutes. Push the cooked meat and vegetables off the skewer onto the tossed pasta.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "4 h ",
    "i": "682355.jpg",
    "o": "",
    "st": "allrecipes"
}