{
    "id": 218671,
    "old_rating": "4.78519",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup walnuts",
        "1 1/2 cups old-fashioned rolled oats (not instant)",
        "1/3 cup whole wheat flour",
        "1/2 cup ground flax meal",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 teaspoon ground cinnamon",
        "1/2 cup almond butter",
        "1/4 cup canola oil",
        "1/4 cup blue agave nectar",
        "1/3 cup brown sugar",
        "1 egg",
        "1 teaspoon vanilla extract",
        "1/2 cup dried cherries",
        "1 cup semi-sweet chocolate chips"
    ],
    "nut": [
        "Calories > 259 kcal",
        "Carbs > 26.1 g",
        "Cholesterol > 10 mg",
        "Fat > 16.3 g",
        "Protein > 5.1 g",
        "Sodium > 173 mg"
    ],
    "n": "Whole Grain Breakfast Cookies",
    "a": "IrisMac",
    "r": "0",
    "s": 18,
    "des": "\"My sister and I love something sweet with our coffee in the morning. We created this recipe to make a wholesome  breakfast. I generally double the batch and keep them in the freezer. They taste even better frozen (still soft!). Whole grains, fiber, and protein and no butter! Can it really be delicious? Yes! My kids can't keep their fingers out of the batter. I decided to add it to Allrecipes because everyone keeps asking me for the recipe. Enjoy!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line baking sheets with parchment paper.\nPulse the walnuts in a food processor several times to chop; continue processing until the walnuts are ground into flour; transfer to a bowl. Mix in the rolled oats, whole wheat flour, flax meal, baking soda, salt, and cinnamon until thoroughly combined.\nCombine the almond butter, canola oil, agave nectar, brown sugar, egg, and vanilla extract in the food processor and process a few seconds to blend the ingredients well; transfer the almond butter mixture to a large bowl and fold in the dried cherries and chocolate chips. Mix the walnut-oatmeal mixture into the almond butter mixture (dough will be very thick).\nScoop up heaping teaspoons of dough, and form into balls; lay the dough balls onto the prepared baking sheets, about 2 inches apart.\nBake in the preheated oven until lightly browned, 8 to 10 minutes. Remove from oven and flatten the cookies with a spatula. Allow to cool for about 5 minutes on the baking sheets before removing to finish cooling on wire racks.",
    "pt": "25 m",
    "ct": "10 m",
    "tt": "50 m",
    "i": "885973.jpg",
    "o": "4540390.jpg,4538667.jpg,4517047.jpg,4131115.jpg,3930329.jpg,3867301.jpg",
    "st": "allrecipes"
}