{
    "id": 218799,
    "old_rating": "4.21053",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 tablespoons butter",
        "1 onion, chopped",
        "2 pounds zucchini, cut into 1/4-inch slices",
        "2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon chopped fresh parsley",
        "2 tablespoons all-purpose flour",
        "1 cup hot milk",
        "1 tablespoon chicken bouillon granules",
        "1 cup shredded extra-sharp Cheddar cheese",
        "4 slices bread, crumbled",
        "1/2 cup melted butter"
    ],
    "nut": [
        "Calories > 423 kcal",
        "Carbs > 19.8 g",
        "Cholesterol > 94 mg",
        "Fat > 34.9 g",
        "Protein > 10.1 g",
        "Sodium > 1281 mg"
    ],
    "n": "Zucchini Gratin",
    "a": "Heidi O",
    "r": "0",
    "s": 6,
    "des": "\"Delicious layers of cheese, onion and zucchini with a buttery bread crumb topping your family will love!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease an 8x10-inch baking dish.\nMelt 6 tablespoons of butter in a large skillet over medium heat, and cook and stir the onion until soft, about 6 minutes. Mix in the zucchini, and cover the skillet; cook until tender, about 10 minutes. Stir in the kosher salt, black pepper, and parsley, and cook uncovered for 5 more minutes. Stir in flour, and reduce heat to a simmer.\nMix the hot milk and chicken bouillon granules together in a small bowl, stirring until the bouillon has dissolved. Pour the milk into the skillet, and bring to a simmer, stirring constantly until the milk thickens into a sauce, about 5 minutes. Pour the zucchini mixture into the prepared baking dish. Sprinkle with Cheddar cheese. Mix the bread crumbs with 1/2 cup of melted butter, and sprinkle the crumbs over the casserole.\nBake in the preheated oven until the casserole is bubbling and the top has browned, about 20 minutes.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "2186043.jpg",
    "o": "",
    "st": "allrecipes"
}