{
    "id": 218740,
    "old_rating": "4.41667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups penne pasta",
        "5 teaspoons olive oil",
        "4 cloves garlic, minced",
        "1 medium onion, diced",
        "1 (16 ounce) can diced tomatoes with green chilies, drained",
        "1/2 lemon, juiced",
        "1 pound uncooked medium shrimp, peeled and deveined",
        "1/4 cup chopped fresh parsley",
        "salt, to taste",
        "ground black pepper, to taste",
        "1 pinch crushed red pepper flakes, or to taste",
        "grated Parmesan cheese, or to taste (optional)"
    ],
    "nut": [
        "Calories > 470 kcal",
        "Carbs > 61.9 g",
        "Cholesterol > 173 mg",
        "Fat > 10 g",
        "Protein > 34.3 g",
        "Sodium > 344 mg"
    ],
    "n": "Spicy Shrimp and Tomato Scampi",
    "a": "Rachel Timmerman",
    "r": "0",
    "s": 4,
    "des": "\"A twist on shrimp scampi that I threw together for my hungry husband one day, with thing out of the cupboard. It went over so well that it is a regular at our house now.\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the penne, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\nHeat the olive oil in a skillet over medium heat. Stir in the garlic and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the tomatoes; simmer until heated through, about 5 minutes more. Add the lemon juice and shrimp. Cook and stir until the shrimp are bright pink on the outside and the meat is no longer transparent in the center, about 5 minutes. Stir in the parsley, then season with salt, pepper, and red pepper flakes. Serve shrimp and sauce over prepared penne pasta. Sprinkle with Parmesan cheese.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "35 m",
    "i": "1244896.jpg",
    "o": "",
    "st": "allrecipes"
}