{
    "id": 218772,
    "old_rating": "4.60274",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 fresh tomatillos - husked, peeled, and halved",
        "3 Anaheim chile peppers - seeded and halved",
        "3 jalapeno peppers - seeded and halved lengthwise",
        "1 medium onion, halved",
        "1 green bell pepper, seeded and halved lengthwise",
        "1 tablespoon olive oil, or as needed",
        "salt to taste",
        "1 tablespoon olive oil",
        "1 1/2 cups pork shoulder, cut into 1-inch chunks",
        "salt and ground black pepper to taste",
        "2 tomatoes, chopped",
        "4 cloves garlic, chopped",
        "1 beef bouillon cube",
        "1/2 (12 fluid ounce) can or bottle lager-style beer",
        "2 tablespoons chopped fresh oregano",
        "1 tablespoon chopped fresh parsley",
        "1 tablespoon ground cumin",
        "1 teaspoon chili powder",
        "4 ounces cream cheese at room temperature"
    ],
    "nut": [
        "Calories > 174 kcal",
        "Carbs > 8.6 g",
        "Cholesterol > 32 mg",
        "Fat > 12 g",
        "Protein > 7.6 g",
        "Sodium > 210 mg"
    ],
    "n": "Mile High Green Chili",
    "a": "chefclaudiesel",
    "r": "0",
    "s": 8,
    "des": "\"Green chili is a Colorado favorite, it's always a crowd pleaser when we have out-of-state visitors.  Roasting your veggies first gives this recipe a deeper level of flavor. This can be served over rice as a main course, stuffed in enchiladas, or over potatoes and eggs.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nArrange the halved tomatillos, Anaheim chiles, jalapenos, onion, and green bell pepper on a baking sheet. Drizzle the vegetables with 1 tablespoon of olive oil.\nRoast the vegetables in the preheated oven until they begin to show brown spots, about 30 minutes. Allow to cool, then chop vegetables into bite-size pieces.\nHeat 1 more tablespoon of olive oil in a large skillet over high heat, and pan-fry the pork until browned, sprinkling the meat with salt and black pepper as it cooks, about 12 minutes. Transfer the pork cubes to a slow cooker, and stir in the roasted vegetables. Mix in the tomatoes, garlic, beef bouillon cube, beer, oregano, parsley, cumin, and chili powder. Set the cooker on Low, cover, and cook until the pork is very tender, 4 to 6 hours.\nAbout 1/2 hour before serving, place the cream cheese into a bowl, and stir in about 1 tablespoon of the chili liquid until thoroughly combined. Continue stirring in chili broth, a tablespoon at a time, until the cream cheese is almost a liquid. Stir the cream cheese mixture back into the chili.",
    "pt": "30 m",
    "ct": "4 h ",
    "tt": "5 h",
    "i": "1045872.jpg",
    "o": "4140144.jpg,4134805.jpg,3099690.jpg,2433122.jpg,1955858.jpg,1533723.jpg",
    "st": "allrecipes"
}