{
    "id": 218719,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 head cauliflower, broken into florets",
        "1 tablespoon olive oil, or as needed",
        "1 pound ground beef (optional)",
        "1 large onion, chopped",
        "4 cups water",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1 teaspoon ground cumin",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon curry powder",
        "1/2 teaspoon ground turmeric",
        "2 cloves garlic, chopped",
        "2 cups uncooked white rice"
    ],
    "nut": [
        "Calories > 314 kcal",
        "Carbs > 43.3 g",
        "Cholesterol > 34 mg",
        "Fat > 8.8 g",
        "Protein > 14.6 g",
        "Sodium > 352 mg"
    ],
    "n": "Upside Down",
    "a": "Charlie Youakim",
    "r": "0",
    "s": 8,
    "des": "\"A Middle Eastern cauliflower and rice dish.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace the cauliflower florets onto a baking sheet, and brush with olive oil. Bake in the preheated oven until beginning to brown, about 30 minutes. Set aside.\nWhile cauliflower is baking, place ground beef and onion into a large pot over medium heat, and cook and stir until the meat is browned, about 10 minutes. Break the meat apart into crumbles as it cooks. Remove from heat.\nIn a saucepan, bring the water to a boil, and stir in the salt, black pepper, cumin, oregano, curry powder, and turmeric.\nMix the cooked cauliflower and garlic into the ground beef and onion in the large pot, and stir in the white rice. Pour the spiced water into the pot over the rice, and bring to a boil. Reduce heat to a simmer, and cover the pot; cook until the rice is tender and the water has absorbed, 15 to 20 minutes. Remove from heat, and allow to stand covered for 5 to 10 minutes to help dry out the rice.\nTo serve, place a large serving platter on top of the uncovered pot, and flip to turn out the contents onto the platter.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "693785.jpg",
    "o": "",
    "st": "allrecipes"
}