{
    "id": 218783,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter",
        "1/2 cup flour",
        "1 sweet onion (such as VidaliaÂ®), chopped",
        "1 green bell pepper, chopped",
        "celery, chopped",
        "4 green onions, chopped",
        "1/2 cup vegetable broth",
        "3 tablespoons tomato paste",
        "2 pounds cooked and peeled whole crawfish tails",
        "3 cloves garlic, chopped",
        "1/4 cup fresh parsley, chopped",
        "salt and ground black pepper to taste",
        "cayenne pepper to taste",
        "hot sauce to taste",
        "12 puff pastry shells"
    ],
    "nut": [
        "Calories > 411 kcal",
        "Carbs > 23.2 g",
        "Cholesterol > 122 mg",
        "Fat > 29.3 g",
        "Protein > 15.7 g",
        "Sodium > 460 mg"
    ],
    "n": "Doug's Crawfish Pie",
    "a": "Doug Matthews",
    "r": "0",
    "s": 12,
    "des": "\"Crawfish and puff pastry -- does it get any better than that? Spice it up. Have fun with it.\"",
    "ins": "Melt butter in a large skillet on medium heat, then stir in flour; cook until light brown, about 10 minutes. Add sweet onion, green pepper, celery, and  green onions. Cover and simmer on low heat for about one hour, stirring occasionally.\nStir in vegetable broth and tomato paste, and cook until it reaches a creamy consistency. Mix in crawfish tails, garlic, and parsley, then cook for about 15 minutes or until the tails are tender. Stir in salt, black pepper, cayenne pepper, and hot sauce.\nPreheat an oven to 400 degrees F (200 degrees C). Bake the puff pastry shells for 5 to 7 minutes, or until they puff up and start to brown a little. Remove from oven and set aside to cool. Pull off center tops and save. Turn oven down to 350 degrees F (175 degrees C).\nSpoon mixture into puff pastry shells until slightly overfilled. Put extra filling into a pie dish and cover with the remaining puff pastry shell center tops to create 6 small pies and 1 large crawfish pie. Place pies on a baking sheet.\nBake for about 15 minutes, or until the shells are golden brown and the filling has a nice shine to it.",
    "pt": "20 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "723512.jpg",
    "o": "",
    "st": "allrecipes"
}