{
    "id": 218787,
    "old_rating": "4.82051",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 slices bacon",
        "cooking spray",
        "1 1/2 teaspoons olive oil",
        "8 mushrooms, stems removed and chopped and caps reserved",
        "1 clove garlic, minced",
        "1 jalapeno pepper, ribs and seeds removed, finely chopped",
        "1 (3 ounce) package cream cheese, softened",
        "3 tablespoons shredded Cheddar cheese",
        "sea salt to taste",
        "ground black pepper to taste"
    ],
    "nut": [
        "Calories > 151 kcal",
        "Carbs > 2.5 g",
        "Cholesterol > 35 mg",
        "Fat > 13.4 g",
        "Protein > 6.1 g",
        "Sodium > 288 mg"
    ],
    "n": "Jalapeno Popper Mushrooms",
    "a": "CookinBug",
    "r": "0",
    "s": 4,
    "des": "\"My husband loves stuffed jalapenos and I like stuffed mushrooms, so I came up with this recipe that combines the two. Leave some of the seeds or ribs in the jalapeno for more heat! I like to use Neufchatel cheese and turkey bacon for a lower fat version -- it's just as tasty!\"",
    "ins": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Crumble the bacon slices and set aside.\nPreheat an oven to 350 degrees F (175 degrees C). Spray a baking dish with cooking spray.\nHeat the olive oil in a skillet over medium heat. Stir in the chopped mushroom stems, garlic, and jalapeno; cook and stir until the mushrooms release moisture and soften, about 10 minutes. Transfer the mushroom mixture to a bowl, and stir in the cream cheese, cheddar cheese, and bacon. Season with salt and pepper. Spoon the cheese mixture generously into the reserved mushroom caps, and arrange the stuffed caps on the prepared baking dish.\nBake in the preheated oven until cheese begins to brown, 15 to 20 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "699443.jpg",
    "o": "4540249.jpg,4498032.jpg,4129913.jpg,3812536.jpg,3555530.jpg,3546722.jpg",
    "st": "allrecipes"
}