{
    "id": 218741,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 fresh tomatillos, husks discarded and tomatillos rinsed",
        "1 white onion, quartered",
        "2 cloves garlic",
        "2 jalapeno peppers, seeded if desired",
        "1 1/2 cups water, or amount to cover",
        "salt to taste",
        "1/4 cup chopped fresh cilantro",
        "1 tablespoon fresh lime juice, or to taste",
        "3 ripe avocados, halved lengthwise and pitted"
    ],
    "nut": [
        "Calories > 48 kcal",
        "Carbs > 3.7 g",
        "Cholesterol > 0 mg",
        "Fat > 3.8 g",
        "Protein > 0.7 g",
        "Sodium > 3 mg"
    ],
    "n": "Tasty Tomatillo Guacamole",
    "a": "Keiko",
    "r": "0",
    "s": 24,
    "des": "\"A flavorful guacamole that's easy to adjust to your heat or taste preferences.   A little untraditional to make, but won't stay around long.   Great with fresh tortilla chips or as a condiment on many Latin dishes.\"",
    "ins": "Place tomatillos, onion, garlic, and jalapeno peppers into a saucepan over medium heat, and pour in enough water to cover. Bring the mixture to a boil, reduce heat, and simmer until the tomatillos soften and change color from bright green to a yellow-green color, 5 to 8 minutes.\nWith a slotted spoon, transfer vegetables to a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the tomatillo mixture moving before leaving it on to puree. Puree until smooth, about 1 minute; mix in salt, cilantro, and lime juice. Blend again for a few seconds just to mix.\nScoop out the avocado flesh, and place into the blender; blend until well mixed. Adjust salt, cilantro, and lime juice before serving.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "25 m",
    "i": "826518.jpg",
    "o": "",
    "st": "allrecipes"
}