{
    "id": 218895,
    "old_rating": "4.2963",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon canola oil",
        "1 cup minced onion",
        "2 cloves garlic, minced",
        "2 beef bouillon cubes",
        "1/2 cup hot water",
        "3 (6 ounce) cans tomato paste",
        "1 cup granular sucrolose sweetener (such as SplendaÂ®)",
        "3/4 cup Worcestershire sauce",
        "3/4 cup Dijon mustard",
        "3 tablespoons hickory-flavored liquid smoke",
        "1 teaspoon salt",
        "1/2 cup cider vinegar",
        "1 tablespoon hot pepper sauce (such as TabascoÂ®), or to taste"
    ],
    "nut": [
        "Calories > 34 kcal",
        "Carbs > 4.8 g",
        "Cholesterol > < 1 mg",
        "Fat > 1.4 g",
        "Protein > 0.6 g",
        "Sodium > 374 mg"
    ],
    "n": "Sugar-Free BBQ Sauce",
    "a": "heleneshaw",
    "r": "0",
    "s": 40,
    "des": "\"This is a recipe for an amazingly delicious bbq sauce that has no sugar. It's great on ribs, chicken...on anything really!!! I had originally gotten it from a friend years ago, and have since 'tweaked' it up!\"",
    "ins": "Heat the oil in a large saucepan over medium heat, and cook and stir until the onion is translucent, about 5 minutes. Mix the beef bouillon cubes and water in a cup until the cubes are softened and beginning to dissolve, and pour the water and bouillon cubes into the saucepan. Bring to a simmer, stirring to dissolve the cubes. Mix in the tomato paste, sucralose sweetener, Worcestershire sauce, Dijon mustard, liquid smoke flavoring, salt, cider vinegar, and hot pepper sauce. Stir until the sweetener has dissolved.\nBring the sauce to a simmer, reduce heat, and simmer until the flavors have blended, 25 to 30 minutes. Stir frequently. For best flavor, cover and refrigerate overnight. Store in refrigerator up to 1 week.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "3120434.jpg",
    "o": "",
    "st": "allrecipes"
}