{
    "id": 218902,
    "old_rating": "3.85",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 cups unbleached all-purpose flour (such as King ArthurÂ®), or as needed",
        "1 1/4 teaspoons salt",
        "1/2 teaspoon fast-rising dry yeast",
        "1 1/2 cups ice water, or as needed",
        "2 tablespoons olive oil",
        "1 tablespoon granulated garlic",
        "1 tablespoon Italian seasoning",
        "1/2 teaspoon olive oil"
    ],
    "nut": [
        "Calories > 139 kcal",
        "Carbs > 24.7 g",
        "Cholesterol > 0 mg",
        "Fat > 2.8 g",
        "Protein > 3.4 g",
        "Sodium > 244 mg"
    ],
    "n": "Neapolitan-Style Pizza Dough with Garlic and Italian Seasonings",
    "a": "Tony Conti",
    "r": "0",
    "s": 12,
    "des": "\"Neapolitan-style pizza dough variation makes 2 12-ounce pizzas. Apply your sauce, cheese, toppings, and a final spread of cheese to tie it all together.\"",
    "ins": "In a large bowl, mix the flour, salt, and yeast until thoroughly combined. Mix in ice water, scraping the bowl as you mix, until all the flour and water have been incorporated into a soft dough. Mix in 2 tablespoons of olive oil. Turn the dough out onto a floured work surface, and knead until the dough is firm but slightly sticky, mixing in more flour if needed. Knead the granulated garlic and Italian seasoning into the dough. (The kneading step can be done in a bread machine set on the Dough setting.)\nForm the dough into a round, and place into an oiled bowl. Brush the top with 1/2 teaspoon of olive oil, cover the bowl with plastic wrap, and allow the dough to rise until double, 1 to 2 hours. Punch down the dough, and cut in half. Form each half into a 12-inch pizza crust, and place on pizza pans.\nMove a rack to the bottom position in oven, and preheat oven to 450 degrees F (230 degrees C).\nBake the pizza crusts on the bottom rack just until firm, 3 to 7 minutes. Allow the crusts to cool for about 10 minutes before topping with sauce, cheese, or other desired ingredients and returning to oven to bake.",
    "pt": "30 m",
    "ct": "5 m",
    "tt": "1 h ",
    "i": "1123658.jpg",
    "o": "",
    "st": "allrecipes"
}