{
    "id": 218948,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 whole fryer chicken, 3 to 4 pounds",
        "1 tablespoon dried sage, crumbled",
        "salt and ground black pepper to taste",
        "1 tablespoon butter",
        "1 tablespoon olive oil"
    ],
    "nut": [
        "Calories > 697 kcal",
        "Carbs > 0.3 g",
        "Cholesterol > 226 mg",
        "Fat > 44.8 g",
        "Protein > 68.9 g",
        "Sodium > 327 mg"
    ],
    "n": "Whole Chicken In a Pan",
    "a": "Jackie",
    "r": "0",
    "s": 4,
    "des": "\"I can finally make a whole chicken after work for dinner! This quick-cooking method makes crispy skin and beautiful presentation!\"",
    "ins": "Place the chicken breast-side down on a cutting board. With a poultry shears or sharp knife, make two vertical cuts about 1 1/2 inch apart on each side of the backbone, all the way from the neck to the tail. Cut through the bones, and remove the backbone and tail. Open up the chicken so it lays flat.\nWith the chicken still breast side down, use your sharp knife to slice through the cartilage at the top of the breast bone, working from the inside of the chicken. Hold the chicken in your two hands, and bend it backwards to make the breastbone pop out; pull out the breastbone and the cartilage. Use your knife to slice out the ribs from the inside, if you desire. Try not to cut through the skin.\nIn a small bowl, mix the sage, salt, and black pepper. Use your fingers to rub the sage mixture all over the inside and outside of the chicken, and push the seasonings under the skin as well.\nMelt butter with olive oil in a 12-inch heavy skillet over medium-high heat. Have a second heavy skillet (such as a cast-iron skillet) or a heavy Dutch oven ready for flattening the chicken. (If you don't have either of those things, wrap a brick in aluminum foil.) When the oil and butter just begin to give off wisps of smoke, place the chicken into the skillet, skin side down and flat. The \"knees\" of the chicken legs should point towards each other so the legs are flat. Place a piece of aluminum foil on top of the chicken, and weight it down with the heavy skillet or Dutch oven to press the chicken down as it cooks.\nCook the chicken until the skin is crisp and browned, 12 to 15 minutes; carefully remove the weight and foil, and turn the chicken over so the opened-up side is down. Replace the foil and weight, and cook the chicken until the juices run clear and the meat is no longer pink at the bone, about 15 more minutes. An instant-read thermometer inserted into thigh meat, not touching bone, should read at least 160 degrees F (70 degrees C).",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "3481102.jpg",
    "o": "",
    "st": "allrecipes"
}