{
    "id": 218910,
    "old_rating": "4.85714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups turkey broth",
        "1/4 cup margarine",
        "1 (6 ounce) package corn bread stuffing mix",
        "1 pound bulk pork sausage",
        "1 pound ground beef (optional)",
        "1 small onion, chopped",
        "1 egg, beaten",
        "1 pint shucked oysters, drained, or more if desired",
        "turkey giblets, cooked and chopped (optional)",
        "1 teaspoon poultry seasoning",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 391 kcal",
        "Carbs > 17.1 g",
        "Cholesterol > 171 mg",
        "Fat > 23.2 g",
        "Protein > 26.9 g",
        "Sodium > 1059 mg"
    ],
    "n": "Holiday Oyster Stuffing",
    "a": "Nancy",
    "r": "0",
    "s": 10,
    "des": "\"This is my grandmother's oyster stuffing recipe that has been handed down. It is a favorite for Thanksgiving and Christmas and very simple to make. If you cook your turkey at 325 degrees F, it will be perfect if the stuffing is cooked alongside it at that temp as well. It can also be baked in a muffin tin for individual servings.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x9-inch baking dish.\nBring the turkey broth to a boil in a saucepan over medium heat, and melt the margarine in the broth. Stir in the stuffing mix until thoroughly combined. Transfer the stuffing to a large bowl. Stir in pork sausage, ground beef, onion, and egg until the mixture is well combined, and lightly mix in the oysters, turkey giblets, poultry seasoning, salt, and black pepper. Transfer the oyster stuffing to the prepared baking dish, and cover dish with foil.\nBake in the preheated oven until the sausage and ground beef are cooked through and the stuffing is crisp and lightly browned, about 1 hour.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1747139.jpg",
    "o": "",
    "st": "allrecipes"
}