{
    "id": 218982,
    "old_rating": "4.54545",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups egg noodles",
        "cooking spray",
        "3 tablespoons butter",
        "1/4 cup chopped onion",
        "1/4 cup chopped celery",
        "1/4 cup chopped carrots",
        "1/4 cup chopped red bell pepper",
        "2 (10.75 ounce) cans condensed cream of chicken soup",
        "1/2 cup sour cream, or more to taste",
        "2 cups shredded Cheddar cheese",
        "1 (8 ounce) can whole kernel corn, drained",
        "3 cups cubed cooked pork",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/2 cup dry bread crumbs (optional)"
    ],
    "nut": [
        "Calories > 580 kcal",
        "Carbs > 32.9 g",
        "Cholesterol > 142 mg",
        "Fat > 32.9 g",
        "Protein > 38.2 g",
        "Sodium > 1575 mg"
    ],
    "n": "Yummy Pork Noodle Casserole",
    "a": "cjscott",
    "r": "0",
    "s": 6,
    "des": "\"This is my Mom's pork noodle casserole.  The added sour cream gives it a little twist on the usual version.  The added red pepper and corn give it color and flavor.  You can add and subtract any vegetables in this versatile recipe.  This is one of my favorite comfort food recipes.\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the egg noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the noodles have cooked through, but are still firm to the bite, about 5 minutes. Drain well in a colander set in the sink.\nPreheat an oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking pan with cooking spray.\nMelt the butter in a skillet over medium heat. Stir in the onion, celery, carrots, and red bell pepper; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the noodles, cream of chicken soup, sour cream, Cheddar cheese, corn, and cooked pork, then season with salt and black pepper. Transfer mixture into the prepared baking dish. Sprinkle bread crumbs on top.\nBake in the preheated oven until bubbly, 30 to 35 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "4385288.jpg",
    "o": "3913532.jpg,3678512.jpg,3571011.jpg,3530867.jpg,3367726.jpg,1974991.jpg",
    "st": "allrecipes"
}