{
    "id": 218971,
    "old_rating": "3.81818",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 teaspoon vegetable oil",
        "1 pound boneless chicken thighs - cut into bite-size pieces",
        "1 skinless, boneless chicken breast half - cut into bite-size pieces",
        "8 cups water",
        "1 chicken bouillon cube",
        "1 clove garlic, minced",
        "1 teaspoon minced fresh ginger root",
        "2 teaspoons soy sauce",
        "1/2 teaspoon Asian (toasted) sesame oil",
        "1 (7 ounce) can baby corn ears",
        "1 (8 ounce) can sliced water chestnuts, rinsed and drained",
        "1 (10 ounce) bag shredded carrots",
        "1 cup broccoli florets",
        "1 cup shredded napa cabbage",
        "1/2 red bell pepper, chopped",
        "5 green onions, chopped",
        "1 stalk celery, thinly sliced",
        "1 small zucchini, thinly sliced",
        "1 cup snow peas",
        "1 cup sliced fresh mushrooms"
    ],
    "nut": [
        "Calories > 102 kcal",
        "Carbs > 8.1 g",
        "Cholesterol > 28 mg",
        "Fat > 3.5 g",
        "Protein > 9.8 g",
        "Sodium > 206 mg"
    ],
    "n": "Chinese Chicken Vegetable Soup",
    "a": "rlt11_NMC",
    "r": "0",
    "s": 12,
    "des": "\"We had a Chinese restaurant that made two soups that I loved how they tasted. When they went out of business, we looked for someone else that made these two soups, without much luck. Knowing all the ingredients that were there, I went to work to make my own recipe for this very tasty soup. Plus I'm a big fan of 'make it tasty, fast and easy' which this is, when I run the veggies through my food processor. Also when I not feel well, this is one soup that has all what help me feel better.  I also serve this with steamed rice as a side dish for those who want it as well.\"",
    "ins": "Heat the vegetable oil in a large Dutch oven or soup pot over medium-high heat, and cook and stir the chicken thigh and breast meat until the chicken is no longer pink inside, about 3 minutes. When the chicken is cooked, stir in the water, chicken bouillon cube, garlic, ginger, soy sauce, and sesame oil. Bring the soup to a boil, and reduce heat to a simmer.\nStir in the baby corn, water chestnuts, carrots, broccoli florets, napa cabbage, red bell pepper, green onions, celery, zucchini, and snow peas, and simmer until the carrots start to softened, and the broccoli and snow peas turn bright green, 1 to 2 minutes. Mix in the mushrooms, and simmer for 5 more minutes.",
    "pt": "40 m",
    "ct": "15 m",
    "tt": "55 m",
    "i": "910582.jpg",
    "o": "",
    "st": "allrecipes"
}