{
    "id": 218979,
    "old_rating": "4.74074",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil",
        "1 pound ground turkey",
        "1 large onion, diced",
        "1 green bell pepper, chopped",
        "1 small red bell pepper, chopped",
        "2 jalapeno peppers, diced (optional)",
        "4 cloves garlic, minced",
        "2 tablespoons cumin",
        "2 tablespoons chili powder",
        "1 tablespoon white sugar",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon ground thyme",
        "2 cups beef broth",
        "1 (15 ounce) can pinto beans, rinsed and drained",
        "1 (15 ounce) can red beans, drained and rinsed",
        "1 (15 ounce) can diced tomatoes, undrained",
        "1 (15 ounce) can tomato sauce",
        "1 (6 ounce) can tomato paste"
    ],
    "nut": [
        "Calories > 373 kcal",
        "Carbs > 39.7 g",
        "Cholesterol > 56 mg",
        "Fat > 14.7 g",
        "Protein > 25.8 g",
        "Sodium > 1560 mg"
    ],
    "n": "Traditional Chili with Ground Turkey",
    "a": "Jessica Lynn",
    "r": "0",
    "s": 6,
    "des": "\"A traditional style chili that can be made with ground turkey or ground beef. I have made this recipe with ground beef and ground turkey, and they both have a similar flavor. Delicious with sweet corn bread and shredded Cheddar cheese. After the initial cooking on the stove, you can easily transfer this to a slow cooker.\"",
    "ins": "Heat olive oil in a large skillet over medium-high heat and stir in the ground turkey. Cook and stir until the turkey is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Stir in the onion, green and red bell peppers, and jalapeno peppers. Cook and stir until the onion is softened and translucent, about 8 minutes. Add the garlic, cumin, chili powder, sugar, salt, black pepper, and thyme. Continue to cook until fragrant, about 8 more minutes, stirring occasionally.\nStir in the beef broth, pinto beans, red beans, diced tomatoes, tomato sauce, and tomato paste. Bring to a boil, then reduce heat to low. Simmer until thickened, about 45 minutes, stirring occasionally. For a thinner chili, cover the pot when simmering.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4335085.jpg",
    "o": "3976177.jpg,3687718.jpg,3464932.jpg,3464930.jpg,3243500.jpg,2301637.jpg",
    "st": "allrecipes"
}