{
    "id": 219048,
    "old_rating": "4.84106",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup vegetable oil",
        "4 pounds pork shoulder, cut into several large pieces",
        "3 tablespoons kosher salt",
        "1 onion, chopped",
        "1 clove garlic, crushed",
        "3 tablespoons lime juice",
        "1 tablespoon chili powder",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon ground cumin",
        "4 (14.5 ounce) cans chicken broth"
    ],
    "nut": [
        "Calories > 250 kcal",
        "Carbs > 2.3 g",
        "Cholesterol > 62 mg",
        "Fat > 19.1 g",
        "Protein > 16.2 g",
        "Sodium > 2072 mg"
    ],
    "n": "Pork Carnitas",
    "a": "Nette",
    "r": "0",
    "s": 12,
    "des": "\"Many find carnitas a little dry or flavorless.  These have a great, distinctive flavor and are requested by friends and family over and over. Serve with warm, fresh tortillas and salsa.\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C).\nHeat the vegetable oil in a large Dutch oven over high heat. Season the pork shoulder with salt, then arrange the pork in the Dutch oven. Cook until browned on all sides, about 10 minutes. Add the onion, garlic, lime juice, chili powder, oregano, and cumin. Pour in the chicken broth, and bring to a boil. Reduce heat to medium-low, cover, and continue to simmer until pork is very tender, about 2 1/2 hours.\nTransfer the pork shoulder to a large baking sheet, reserving the cooking liquid. Drizzle with a small amount of the reserved cooking liquid and lightly season with salt.\nBake the pork in the preheated oven until browned, about 30 minutes. Drizzle more of the cooking liquid on the meat every 10 minutes, and use two forks to shred the meat as it browns.",
    "pt": "15 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "4516254.jpg",
    "o": "4516254.jpg,4516251.jpg,4511709.jpg,4459575.jpg,4196728.jpg,4173001.jpg",
    "st": "allrecipes"
}