{
    "id": 219066,
    "old_rating": "4.58065",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup white sugar",
        "8 large eggs",
        "12 ounces cream cheese at room temperature",
        "1 (10 ounce) can sweetened condensed milk",
        "1 (15 ounce) can cream of coconut (such as Coco LopezÂ®)",
        "1 (14 ounce) can coconut milk",
        "1 (12 ounce) can evaporated milk",
        "1 tablespoon coconut-flavored rum (such as BacardiÂ® Coconutâ„¢)",
        "2 teaspoons vanilla extract"
    ],
    "nut": [
        "Calories > 398 kcal",
        "Carbs > 41.8 g",
        "Cholesterol > 129 mg",
        "Fat > 23 g",
        "Protein > 8.1 g",
        "Sodium > 160 mg"
    ],
    "n": "Coconut Cheese Flan (Flan de Coco y Queso)",
    "a": "Milly Suazo-Martinez",
    "r": "0",
    "s": 16,
    "des": "\"Flan I made for Christmas Eve 2009 and came out delicious... so I had to write it down.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nIn a heavy skillet over medium-low heat, cook and stir sugar with a wooden spoon until melted and golden, about 10 minutes. Caramel is very hot. Very carefully pour the caramel into a 9-inch round, 3-inch deep baking dish. Swirl dish to cover bottom and sides. The caramel will harden as it cools.\nCombine the eggs, cream cheese, and sweetened condensed milk in a blender. Cover, and blend on High until well combined; transfer to a large bowl. Pour the cream of coconut, coconut milk, evaporated milk, coconut-flavored rum, and vanilla extract into the blender; cover and blend on High until well combined. Pour into the bowl with the cream cheese mixture. Whisk until incorporated. Pour the flan mixture into the caramel-coated baking dish.\nLine a roasting pan with a damp kitchen towel.  Place the filled baking dish on the towel, and place roasting pan in the preheated oven. Fill roasting pan with boiling water to reach halfway up the sides of the baking dish. Bake until the flan is set and a knife inserted in the center comes out clean, about 1 hour. Transfer to a wire rack; cool. Refrigerate flan until ready to serve.\nTo serve, run a knife around the edges of the pan and flip the flan out onto a serving platter. Spoon any caramel remaining in the baking dish over the flan.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "721394.jpg",
    "o": "4206597.jpg,2661989.jpg,2056409.jpg,1904641.jpg,1873807.jpg,1076340.jpg",
    "st": "allrecipes"
}