{
    "id": 219009,
    "old_rating": "4.54545",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "2 teaspoons baking soda",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground cinnamon",
        "3/4 cup chopped walnuts",
        "3/4 cup butter",
        "1/2 cup brown sugar",
        "3/4 cup honey",
        "1 teaspoon vanilla extract",
        "1 egg"
    ],
    "nut": [
        "Calories > 181 kcal",
        "Carbs > 25.6 g",
        "Cholesterol > 23 mg",
        "Fat > 8.2 g",
        "Protein > 2.5 g",
        "Sodium > 175 mg"
    ],
    "n": "Soft, Chewy Rosh Hashanah Honey-Walnut Cookies",
    "a": "FRIENDLYFOOD",
    "r": "0",
    "s": 24,
    "des": "\"This is a GREAT recipe for any honey lovers or for a great cookie for Rosh Hashanah. The honey and walnut flavors together are divine. Yummy, soft and chewy texture, a big hit with kids and everyone else who tries them! Delightful, unique (don't find many cookies that have such a delicious honey flavor) deliciously honey flavored cookie perfect for any time of year. Try it! You'll love it! :)\"",
    "ins": "In a bowl, whisk together the flour, baking soda, salt, and cinnamon; mix in the walnuts.\nIn a separate large bowl, beat the butter and brown sugar together with an electric mixer until fluffy; stir in the honey, vanilla extract, and egg until thoroughly combined. Mix the flour mixture into the wet ingredients just until well combined (don't overmix), and chill the dough for at least 1 hour or overnight.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease baking sheets, or line with parchment paper.\nScoop up about 1 tablespoon of dough per cookie, and roll into a ball; place onto the prepared baking sheets.\nBake until the cookies are just puffy (or a little bit flat in the middle for a gooey texture), 8 to 10 minutes. Allow the cookies to cool on baking sheets for about 5 minutes before removing them to finish cooling on racks.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "3933670.jpg",
    "o": "",
    "st": "allrecipes"
}