{
    "id": 219008,
    "old_rating": "4.63636",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "3 1/2 cups unbleached all-purpose flour",
        "1 tablespoon baking powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "4 teaspoons ground cinnamon",
        "1 teaspoon ground cloves",
        "1/2 teaspoon ground nutmeg",
        "1 cup canola oil",
        "1 cup honey",
        "1 1/2 cups white sugar",
        "1/2 cup brown sugar",
        "3 eggs",
        "1 teaspoon vanilla extract",
        "1 cup strong brewed coffee (decaf is fine)",
        "1/2 cup orange juice",
        "1/4 cup whiskey"
    ],
    "nut": [
        "Calories > 555 kcal",
        "Carbs > 87.3 g",
        "Cholesterol > 46 mg",
        "Fat > 20.4 g",
        "Protein > 5.6 g",
        "Sodium > 309 mg"
    ],
    "n": "Moist Holiday Honeycake",
    "a": "Amybobamy",
    "r": "0",
    "s": 12,
    "des": "\"Spiced fragrant honey cake is a tradition on Rosh Hashanah (the Jewish New Year, which generally falls in September). Unfortunately, most honey cakes turn out to be dry, brick-like things, inedible except with a hot beverage. Some call honey cake the fruitcake of the Jewish people. BUT NOT THIS ONE! This cake is genuinely moist and yummy. It will serve about 12 guests at a holiday meal, but I promise that your family will chisel away at it until it's gone before the morning comes.\"",
    "ins": "Place an oven shelf in an upper position in oven, and preheat oven to 350 degrees F (175 degrees C). Spray a 10-inch fluted tube pan (such as a Bundt(R) pan) with cooking spray.\nIn a bowl, whisk together the unbleached flour, baking powder, baking soda, salt, cinnamon, cloves, and nutmeg until thoroughly combined. In a separate large bowl, whisk together the canola oil, honey, white and brown sugar, eggs, vanilla extract, coffee, orange juice, and whiskey. With an electric mixer, beat the flour mixture into the honey mixture just until the batter is thoroughly incorporated. Pour the batter into the prepared pan.\nBake on upper shelf in the preheated oven until the cake is golden brown and a toothpick inserted into the cake comes out with moist crumbs, about 1 hour. Cool for 20 minutes in the pan before turning the cake out onto a serving platter.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1476532.jpg",
    "o": "4398303.jpg,3949257.jpg,1041885.jpg,822303.jpg,710966.jpg,707789.jpg",
    "st": "allrecipes"
}