{
    "id": 219075,
    "old_rating": "4.52941",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (1 pound) loaf sourdough bread, torn into pieces",
        "1/4 cup butter",
        "1 cup diced onion",
        "1 cup diced celery",
        "1 teaspoon herbes de Provence",
        "1 teaspoon rubbed sage",
        "4 ounces chopped dried apricots",
        "1 cup toasted pecan halves, chopped",
        "salt and freshly ground black pepper to taste",
        "2 cups chicken broth",
        "1 egg, beaten"
    ],
    "nut": [
        "Calories > 291 kcal",
        "Carbs > 36 g",
        "Cholesterol > 32 mg",
        "Fat > 14 g",
        "Protein > 7.8 g",
        "Sodium > 534 mg"
    ],
    "n": "Pecan and Apricot Sourdough Bread Stuffing",
    "a": "Chef John",
    "r": "0",
    "s": 10,
    "des": "\"This savory stuffing is a little tangy and a little sweet. And it's so easy to make that you won't have to wait for a holiday to enjoy this dish with your family.\"",
    "ins": "Preheat oven to 275 degrees F (135 degrees C). Butter an 11x14 inch baking dish, and set aside to bake the stuffing.\nArrange sourdough bread pieces on a baking sheet. Toast the bread in preheated oven until crisp and dry, 20 to 30 minutes. Remove from the oven to cool.  Increase the oven temperature to 350 degrees F (175 degrees C).\nMelt butter in a skillet over medium heat. Stir in the onion and celery; cook and stir until the vegetables are tender, about 10 minutes. Stir in the herbes de Provence and rubbed sage, then stir in the apricots. Turn off the heat, and allow the mixture to rest.\nToss the toasted bread and pecans together in a large bowl. Stir in the celery mixture, then season with salt and pepper. Mix in the chicken broth, one cup at a time. Stir in the egg. Transfer the stuffing to the buttered baking dish.\nBake in the preheated oven until the top is browned, 30 to 35 minutes.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}