{
    "id": 219193,
    "old_rating": "4.48936",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 pounds ground pork",
        "1 small apple - peeled, cored, and chopped",
        "1/2 red onion, chopped",
        "1/2 green or red bell pepper, chopped",
        "1/4 cup teriyaki sauce",
        "1/4 cup apple cider",
        "1 teaspoon ground ginger",
        "1/2 cup bread crumbs",
        "1 teaspoon black pepper",
        "1 teaspoon soy sauce"
    ],
    "nut": [
        "Calories > 284 kcal",
        "Carbs > 10.5 g",
        "Cholesterol > 74 mg",
        "Fat > 16.7 g",
        "Protein > 21.8 g",
        "Sodium > 491 mg"
    ],
    "n": "Asian Pork Burger",
    "a": "Norm Walker",
    "r": "0",
    "s": 8,
    "des": "\"I am a big fan of American classics like burgers and pizza, but sometimes you need to push things a little bit and try to come up with something that is a bit different. My wife and I both love Asian food and we love burgers, so one day I got inspired to whip up this recipe. They turned out amazing the first time; you just have to try these. They are so flavorful you can eat them without a bun. I would recommend putting some extra teriyaki sauce on them.\"",
    "ins": "Mix the ground pork, apple, onion, bell pepper, teriyaki sauce, apple cider, ground ginger, bread crumbs, black pepper, and soy sauce together in a mixing bowl until evenly combined; shape into 8 patties. Chill the patties in the freezer for 30 minutes so they are not soft when placed on the grill.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nCook the burgers on the preheated grill until firm, hot, and no longer pink in the center, about 5 minutes per side. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "4468185.jpg",
    "o": "4468185.jpg,3676985.jpg,3400301.jpg,1992427.jpg,970064.jpg,828037.jpg",
    "st": "allrecipes"
}