{
    "id": 219186,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 pound bulk pork sausage",
        "1/4 cup brown sugar",
        "1 tablespoon butter",
        "4 large eggs",
        "2 tablespoons milk",
        "salt and ground black pepper to taste",
        "1 (8 ounce) package refrigerated crescent rolls",
        "1 cup shredded Colby-Monterey Jack cheese"
    ],
    "nut": [
        "Calories > 529 kcal",
        "Carbs > 25.4 g",
        "Cholesterol > 195 mg",
        "Fat > 36.9 g",
        "Protein > 22.4 g",
        "Sodium > 1208 mg"
    ],
    "n": "Super Easy Breakfast Sausage Loaf",
    "a": "Rick",
    "r": "0",
    "s": 6,
    "des": "\"I was searching for a quick and easy breakfast for a group of picky youngsters and came up with my own super easy breakfast sausage loaf from ingredients normally found in any fridge. This can be as basic as dinner rolls/sausage/eggs/cheese...or jazz it up a bit with onions and green peppers. This can be put together the night before, frozen or made on the fly.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x5-inch loaf pan with cooking spray.\nHeat a large skillet over medium-high heat and stir in the sausage and brown sugar. Cook and stir until the meat is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Transfer sausage to a bowl; wipe the skillet clean.\nMelt the butter in the clean skillet over low heat. In a bowl, whisk together the eggs, milk, salt, and black pepper. Pour the eggs into the skillet. Allow the eggs to cook undisturbed until they begin to set, then gently stir the eggs until the curds are separate and set but not dry, 5 to 7 minutes.\nRoll out the crescent roll dough, and line the bottom and sides of the prepared pan with 3/4 of the dough. Layer the sausage, scrambled eggs, and Colby-Monterey Jack cheese into the pan, then top with the remaining 1/4 of dough. Pinch the corners and sides of the dough together.\nBake in the preheated oven until golden brown, 25 to 30 minutes.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "804109.jpg",
    "o": "",
    "st": "allrecipes"
}