{
    "id": 219185,
    "old_rating": "4.41379",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon ground black pepper",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "1 teaspoon paprika",
        "1 teaspoon dried parsley",
        "1 teaspoon ground cayenne pepper",
        "1 teaspoon kosher salt",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon dried thyme",
        "4 (4 ounce) catfish fillets, skinned",
        "3/4 cup unsalted butter"
    ],
    "nut": [
        "Calories > 466 kcal",
        "Carbs > 2.2 g",
        "Cholesterol > 144 mg",
        "Fat > 43.2 g",
        "Protein > 18.2 g",
        "Sodium > 546 mg"
    ],
    "n": "Cajun Blackened Catfish",
    "a": "Paul Schultz",
    "r": "0",
    "s": 4,
    "des": "\"This is a recipe that I obtained from a very good Cajun friend who is a native of Lafayette, Louisiana. His family  adopted me (friendly) many years ago and we have swapped Cajun and Creole recipes through the years.\"",
    "ins": "In a shallow bowl, mix together the black pepper, garlic powder, onion powder, paprika, parsley, cayenne pepper, kosher salt, oregano, and thyme until thoroughly combined. Press the catfish fillets into the spice mixture to thoroughly coat.\nArrange a portable heat source outdoors, such as a butane burner or side burner of a gas grill. Melt butter in a glass or metal bowl. Light the burner, and place a large cast-iron skillet onto the burner over high heat. Pour about 1/4 cup of melted butter into the skillet; set remaining 1/2 cup of butter aside.\nWhen the butter in the skillet is smoking hot, lay the catfish fillets into the skillet. Cook until the spices are burned onto the fillets and the catfish is opaque and flaky inside, about 3 minutes per side. Don't breathe smoke from burning spices. To serve, pour remaining 1/2 cup of butter over the catfish.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "20 m",
    "i": "4542637.jpg",
    "o": "",
    "st": "allrecipes"
}