{
    "id": 219142,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup all-purpose flour",
        "1 pinch salt",
        "1/2 cup unsalted butter, cubed",
        "2 tablespoons cold water, or as needed",
        "9 tablespoons golden syrup",
        "9 tablespoons dry bread crumbs",
        "zest from 1 lemon",
        "1 tablespoon lemon juice",
        "1 teaspoon ground ginger",
        "1 cup heavy cream"
    ],
    "nut": [
        "Calories > 328 kcal",
        "Carbs > 29.9 g",
        "Cholesterol > 71 mg",
        "Fat > 23 g",
        "Protein > 2.6 g",
        "Sodium > 131 mg"
    ],
    "n": "Treacle Tart II",
    "a": "Tara",
    "r": "0",
    "s": 8,
    "des": "\"This classic English Treacle Tart is sweet and delicious with a hint of ginger and lemon. Topped with unsweetened whipped cream, this lovely tart is perfect for a Sunday brunch or dessert on any occasion. Most of you will remember Treacle Tart from the popular book series, Harry Potter. You can also serve treacle tart with clotted cream or vanilla ice cream! The treacle is so sweet that you want to serve it with something not so sweet, so that the flavors balance.\"",
    "ins": "Put the flour and salt in a large bowl and add the cubes of butter. Use a fork to cut the butter into the flour until you have a mixture that resembles coarse breadcrumbs with no large lumps of butter remaining. Try to work quickly so that it does not become greasy. Using a table knife, stir in just enough of the cold water to bind the dough together. Turn the dough out onto plastic wrap, cover completely, and flatten slightly. Chill in the freezer while you finish the next steps.\nWarm the golden syrup in a saucepan over low heat. Stir the bread crumbs, lemon zest, lemon juice, and ground ginger into the warmed syrup; keep warm on lowest heat setting.\nPreheat an oven to 375 degrees F (190 degrees C).\nRemove the dough from the freezer and turn it out into an ungreased tart or pie pan. Use the plastic wrap to gently press the dough from the center outward, spreading the dough to the edges of the pan, working as quickly as possible to keep from warming the butter.\nStir the golden syrup mixture, and scrape from saucepan onto the dough using a rubber spatula to spread evenly to the edges of the dough.\nBake in the preheated oven until the tart is crisp and golden, 20 to 25 minutes. Allow to cool completely.\nPour the whipping cream into a bowl, and whisk vigorously until it begins to thicken. Continue whisking the cream until thick and smooth; spread over the cooled tart.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}