{
    "id": 219169,
    "old_rating": "4.41304",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup unsalted butter",
        "3 large yellow onions, coarsely chopped",
        "1 teaspoon kosher salt",
        "2 sprigs fresh thyme",
        "1 bay leaf",
        "1/4 cup dry sherry",
        "1 tablespoon sherry vinegar",
        "freshly ground black pepper to taste",
        "3 cups beef broth",
        "2 cups chicken broth",
        "1 cup water",
        "6 (1/4 inch thick) slices French baguette, toasted",
        "6 ounces Gruyere cheese, shredded, or to taste"
    ],
    "nut": [
        "Calories > 253 kcal",
        "Carbs > 11.8 g",
        "Cholesterol > 53 mg",
        "Fat > 17.4 g",
        "Protein > 11.6 g",
        "Sodium > 1226 mg"
    ],
    "n": "Easy French Onion Soup for Guests",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"This is French onion soup made the easy way! It's the perfect starter for fall or winter dinners. The secret is a splash of sherry vinegar and sherry wine. Top with a slice of baguette bread, sprinkle with Gruyere, and broil to golden brown for an impressive first course.\"",
    "ins": "Melt butter in a large skillet over low heat. Cook onions with salt, stirring occasionally, until the onions are soft and golden, about 40 to 45 minutes.\nMix in thyme sprigs and bay leaf. Pour in sherry wine and sherry vinegar, and stir in black pepper. Pour in beef broth, chicken broth, and water. Stir to combine, and allow the soup to simmer gently for one hour.\nLadle soup into heat-proof crocks. Place a slice of toasted baguette on top of each crock, and sprinkle 1 ounce of shredded Gruyere cheese per serving.\nPreheat oven's broiler and set the oven rack about 6 inches from the heat source. Place the filled crocks on a baking sheet, and broil until the cheese is golden and bubbly, about 1 minute.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}