{
    "id": 219174,
    "old_rating": "4.38571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup mashed, cooked butternut squash",
        "1/2 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 pinch cayenne pepper",
        "1/2 cup mascarpone cheese",
        "1 egg yolk",
        "1/3 cup grated Parmesan cheese",
        "1 (16 ounce) package round wonton wrappers",
        "2 tablespoons butter",
        "1 clove garlic, unpeeled",
        "chopped fresh sage to taste",
        "1 tablespoon grated Parmesan cheese, or to taste"
    ],
    "nut": [
        "Calories > 378 kcal",
        "Carbs > 47.4 g",
        "Cholesterol > 79 mg",
        "Fat > 15.9 g",
        "Protein > 11.5 g",
        "Sodium > 742 mg"
    ],
    "n": "Easy Butternut Squash Ravioli",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"These easy butternut squash ravioli are a terrific way to use up leftover roasted butternut squash. They can stand in equally well as either the ideal appetizer or as an elegant main dish for dinner. The secret? Wonton wrappers instead of pasta make these ravioli incredibly easy.\"",
    "ins": "Place cooked squash into a mixing bowl. Add salt, black pepper, and cayenne pepper. Stir in mascarpone cheese, egg yolk, and 1/3 cup Parmesan cheese, mixing until the filling is smoothly combined.\nPlace a wonton wrapper onto a working surface. Wet the tip of a finger in water, and run it all along the outer edge of the wonton skin to moisten. Place about 1 teaspoon of filling in the center of the wonton. Fold the wonton in half to make a half-moon shape, and press the edges to seal. Repeat with the remaining wonton wrappers.\nPlace a deep skillet over medium-low heat. Stir in butter and unpeeled clove of garlic. Meanwhile, bring a saucepan of lightly salted water to a boil.\nDrop the filled raviolis into the boiling water, a few at a time, and cook until they float to the top, about 2 minutes. Drain the raviolis, and transfer them to the skillet. Turn the heat under the skillet up to medium-high, and cook just until the raviolis are infused with garlic flavor, about 2 or 3 more minutes. Sprinkle with chopped sage, more black pepper, and extra Parmesan cheese to taste.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "4525860.jpg",
    "o": "4525860.jpg,4470851.jpg,2782349.jpg,2692383.jpg,1104273.jpg,943950.jpg",
    "st": "allrecipes"
}