{
    "id": 219188,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (4 ounce) salmon fillets",
        "1 lemon, juice only",
        "salt and ground black pepper to taste",
        "4 12x18-inch pieces of parchment paper",
        "1 lemon, thinly sliced",
        "1/2 cup green onions, chopped",
        "8 spears fresh asparagus, cut into 1-1/2 inch pieces",
        "4 teaspoons olive oil"
    ],
    "nut": [
        "Calories > 224 kcal",
        "Carbs > 6.2 g",
        "Cholesterol > 50 mg",
        "Fat > 11.5 g",
        "Protein > 25.5 g",
        "Sodium > 148 mg"
    ],
    "n": "Carly's Salmon En Papillote (In Paper)",
    "a": "carly",
    "r": "0",
    "s": 4,
    "des": "\"Moist, delicious, almost fool-proof salmon. This salmon is wrapped in parchment paper and steamed in the oven. No fishy taste in your mouth, no fishy smell in your house. Just a delicious meal.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nRinse salmon fillets in cold water, place onto a plate, and squeeze a lemon over the salmon. Sprinkle fillets with salt and black pepper.\nFold a piece of parchment paper in half crosswise, and center a salmon fillet on one side of the paper. Place 1 or 2 lemon slices on top of the salmon, and surround with 2 cut-up asparagus spears. Sprinkle 2 tablespoons of green onion over the lemon slices, and fold the parchment paper over the salmon. Fold the edges of the paper over several times, all around the open edges, to seal the salmon into a parchment paper envelope. (Do not tape the parchment paper closed.) Place the sealed envelopes onto a baking sheet, and brush the tops of each packet with about 1 teaspoon of olive oil.\nBake in the preheated oven until the asparagus is tender and the salmon is opaque and slightly flaky, 20 to 25 minutes. To serve, place a packet onto a plate, and cut open the paper to release the aroma.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}