{
    "id": 219296,
    "old_rating": "4.45455",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 (14.5 ounce) cans diced tomatoes",
        "1 tablespoon brown sugar",
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "1 teaspoon ground ginger",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground cumin",
        "1 tablespoon ground coriander",
        "1 1/2 pounds skinless, boneless chicken breast halves, cut into bite size pieces",
        "1 (15 ounce) can garbanzo beans, drained and rinsed",
        "3 pounds fresh pumpkin, peeled and cut into 3/4-inch cubes",
        "salt, or to taste",
        "1 teaspoon cornstarch (optional)",
        "1/4 cup water (optional)"
    ],
    "nut": [
        "Calories > 330 kcal",
        "Carbs > 37.2 g",
        "Cholesterol > 59 mg",
        "Fat > 7.9 g",
        "Protein > 28.4 g",
        "Sodium > 696 mg"
    ],
    "n": "Chicken and Pumpkin Goulash",
    "a": "Bubbe",
    "r": "0",
    "s": 6,
    "des": "\"I needed to use up some chicken, and we had been given a lot of pumpkins...so I began to look for a recipe which would take advantage of my ingredients. However, everything I found was quite spicy and knew would not go over well with my grandchildren. I then came across a recipe which seemed to have promise, and used it as the basis for creating this...a new family favorite! I hope you enjoy as much as my family did.\"",
    "ins": "Set a slow cooker to High, and place diced tomatoes and brown sugar into the cooker; stir to combine.\nHeat olive oil in a non-stick skillet over medium-high heat, and cook and stir onion until lightly browned, about 10 minutes. Mix in the ginger, cinnamon, cumin, and coriander; cook and stir until the spices release their fragrance, about 2 minutes. Stir in the chicken, and cook and stir until chicken is no longer pink. Mix the garbanzo beans into the chicken mixture, and bring to a simmer. Transfer the mixture into the slow cooker, and mix with tomatoes.\nPlace pumpkin into the same skillet, and reduce heat to medium. Cook until the pumpkin is hot and some pieces are slightly browned, about 10 minutes, stirring often. Place pumpkin into the cooker, and cover.\nCook the stew on the High setting for 1 hour; reduce cooker setting to Low, and cook until pumpkin is tender, 3 to 4 more hours. Season with salt and black pepper. If stew seems too liquid, mix cornstarch into water in a small cup until smooth, and stir the slurry into the stew. Cook until thickened, about 30 minutes.",
    "pt": "30 m",
    "ct": "4 h ",
    "tt": "4 h ",
    "i": "1009411.jpg",
    "o": "",
    "st": "allrecipes"
}