{
    "id": 219286,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups graham cracker crumbs",
        "1/2 cup butter, melted",
        "3 (8 ounce) packages cream cheese, softened",
        "3/4 cup white sugar",
        "3/4 cup sour cream",
        "3 eggs at room temperature",
        "1 tablespoon all-purpose flour",
        "1 teaspoon vanilla extract",
        "1/2 cup fresh lime juice",
        "1 jalapeno pepper, seeded and minced"
    ],
    "nut": [
        "Calories > 639 kcal",
        "Carbs > 40.4 g",
        "Cholesterol > 202 mg",
        "Fat > 49.3 g",
        "Protein > 11.1 g",
        "Sodium > 495 mg"
    ],
    "n": "Jalapeno Lime Cheesecake",
    "a": "Jamie Justice Yost",
    "r": "0",
    "s": 8,
    "des": "\"A friend of mine e-mailed me to tell me that he'd dropped his jalapeno into his cheesecake...and that it was awesome! Inspired by my friend's clumsiness, I created this cheesecake. Sweet with a hint of heat at the end--all atop a graham cracker crust. Yum!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nMix the graham cracker crumbs and butter in a large bowl until evenly moistened; press into the bottom of a 9-inch springform pan.\nBake in the preheated oven until the crust has lightly browned and smells toasted, about 5 minutes. Remove from the oven and allow to cool.\nBeat the cream cheese, sugar, and sour cream with an electric mixer in a large bowl until light and fluffy. Beat in  the eggs, one at a time, allowing each egg to blend into the cream cheese mixture before adding the next. Beat the flour, vanilla extract, and lime juice into the cream cheese mixture with the last egg. Fold the jalapeno pepper into the mixture; mixing just enough to evenly combine. Pour into the prepared crust.\nBake in the preheated oven for 15 minutes. Reduce heat to 250 degrees F (120 degrees C) and continue baking until the center has just set, 50 to 55 minutes. Remove from the oven, run the tip of a paring knife around the edges of the pan, set the pan on a wire rack, and allow the cheesecake to cool at room temperature for 1 hour before placing into the refrigerator, and cooling 4 hours to overnight.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "5 h ",
    "i": "728237.jpg",
    "o": "",
    "st": "allrecipes"
}