{
    "id": 219326,
    "old_rating": "4.48387",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup olive oil, divided",
        "1 teaspoon ground black pepper",
        "3 skinless, boneless chicken breast halves",
        "1/2 onion, chopped",
        "1 (8 ounce) package sliced fresh mushrooms",
        "3/4 (8 ounce) can artichoke hearts in water, drained",
        "2 teaspoons Italian seasoning",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons ground black pepper",
        "3/4 cup white wine",
        "4 large roma tomatoes, quartered",
        "6 tablespoons butter"
    ],
    "nut": [
        "Calories > 623 kcal",
        "Carbs > 17.3 g",
        "Cholesterol > 128 mg",
        "Fat > 44.5 g",
        "Protein > 30.4 g",
        "Sodium > 1738 mg"
    ],
    "n": "Easy Tuscan Chicken",
    "a": "RAE0878",
    "r": "0",
    "s": 3,
    "des": "\"This is an amazing dish and easy to make.  It has a wonderful aroma and tastes great with baked or mashed potato, rice or pasta.\"",
    "ins": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nMix 2 tablespoons olive oil and 1 teaspoon black pepper in a small bowl. Dip the chicken breasts into the pepper mixture until well coated, then place the chicken on a baking dish.\nBroil the chicken in the preheated oven until no longer pink in the center and the juices run clear, about 5 minutes on each side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nMeanwhile, heat the remaining 2 tablespoons olive oil in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the mushrooms, artichoke hearts, Italian seasoning, salt, and pepper. Continue to cook and stir for about 6 minutes, then stir in the white wine. Allow the wine to simmer and reduce by half, about 10 minutes.\nStir in the roma tomatoes; cook and still until the tomatoes are warmed through. Stir in the butter until it melts. Serve the sauce over the cooked chicken breast.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "789735.jpg",
    "o": "",
    "st": "allrecipes"
}