{
    "id": 219447,
    "old_rating": "4.57471",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup brown rice",
        "1 cup water",
        "1 pound lean ground beef",
        "2 cloves garlic, minced",
        "1 onion, chopped",
        "2 green bell peppers",
        "2 red bell peppers",
        "2 yellow bell peppers",
        "1 (8 ounce) can natural tomato sauce",
        "1 tablespoon Worcestershire sauce",
        "salt and ground black pepper to taste",
        "1 (8 ounce) can natural tomato sauce",
        "1 teaspoon Italian seasoning",
        "1/4 cup grated Parmesan cheese, optional"
    ],
    "nut": [
        "Calories > 291 kcal",
        "Carbs > 28.9 g",
        "Cholesterol > 52 mg",
        "Fat > 11.1 g",
        "Protein > 19.7 g",
        "Sodium > 523 mg"
    ],
    "n": "Healthier Stuffed Peppers",
    "a": "MakeItHealthy",
    "r": "0",
    "s": 6,
    "des": "\"This healthier stuffed peppers recipe uses an assortment of colored peppers, lean ground beef, brown rice, fresh onion and garlic, and natural tomato sauce. So colorful and so healthy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring brown rice and water to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, 45 to 50 minutes.\nCook and stir beef, garlic, and onion in a skillet over medium heat until meat is evenly browned and onion is softened, about 5 minutes.\nRemove and discard the tops, seeds, and membranes of the green, red, and yellow bell peppers. Arrange peppers in a baking dish with the hollowed sides facing upward. Slice the bottoms off the peppers if necessary so that they stand upright.\nMix the browned beef, cooked rice, 1 can tomato sauce, Worcestershire sauce, salt, and pepper in a bowl. Spoon an equal amount of the mixture into each hollowed pepper. Mix the remaining tomato sauce and Italian seasoning in a bowl, and pour over the stuffed peppers.\nBake in the preheated oven, basting with sauce every 15 minutes, until the peppers are tender, about 1 hour. Sprinkle the peppers with grated Parmesan cheese after baking.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "3124339.jpg",
    "o": "4472055.jpg,4466798.jpg,4466795.jpg,3798041.jpg,3633388.jpg,3605633.jpg",
    "st": "allrecipes"
}