{
    "id": 219480,
    "old_rating": "4.84615",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 cup lemon juice",
        "1 cup dried cranberries",
        "1 1/2 cups shredded cooked turkey",
        "1 cup prepared stuffing",
        "4 ounces cream cheese, softened",
        "1/4 cup thick turkey gravy",
        "1 (14 ounce) package wonton wrappers",
        "salt to taste",
        "3 cups canola oil for frying",
        "2 tablespoons minced onion",
        "1 tablespoon lime juice",
        "1 teaspoon seeded and minced jalapeno pepper - or to taste",
        "1 teaspoon minced garlic",
        "1 teaspoon water"
    ],
    "nut": [
        "Calories > 330 kcal",
        "Carbs > 39.6 g",
        "Cholesterol > 32 mg",
        "Fat > 14.1 g",
        "Protein > 11.7 g",
        "Sodium > 427 mg"
    ],
    "n": "Thanksgiving Leftover Wontons with Cranberry Salsa",
    "a": "JennyJenn",
    "r": "0",
    "s": 10,
    "des": "\"I made this the day after Christmas to use up the leftovers in my fridge and the in-laws LOVED it. It takes a bit of prep time, but it's quite easy. You may even want to try a little cilantro in the cranberry salsa.\"",
    "ins": "Pour the lemon juice over the dried cranberries in a bowl; set aside. Mix the turkey, stuffing, cream cheese, and turkey gravy in a separate bowl until thoroughly combined.\nPlace a wonton wrapper on a work surface; spoon about 1 tablespoon of the filling in the center of the wrapper. Moisten two opposite edges of the wrapper with a finger dipped in water, fold the wrapper in half the long way, and press the edges together with a fork. Sprinkle the wrapper with salt. Repeat with remaining filling and wrappers.\nHeat the canola oil in a large, deep skillet over medium heat; pan-fry the filled wontons in batches until crisp and golden brown, about 2 minutes per side. Drain the fried wontons on paper towels; allow to cool for about 5 minutes to set the filling.\nDrain the lemon juice from the dried cranberries. Place cranberries into a food processor; pulse several times until the cranberries are finely chopped. Transfer to a bowl and mix in the onion, lime juice, jalapeno pepper, garlic, and water. Serve with the hot fried wontons.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "50 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}