{
    "id": 219488,
    "old_rating": "4.5814",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound tilapia fillets, rinsed and patted dry",
        "1 egg",
        "1/3 cup milk",
        "1/2 cup Italian seasoned bread crumbs (such as ProgressoÂ®)",
        "2 teaspoons roasted onion flakes",
        "2 teaspoons minced garlic",
        "1 teaspoon blackened seasoning (such as Old BayÂ®)",
        "2 pinches crushed red pepper flakes (optional)",
        "1/4 teaspoon freshly ground black pepper, or to taste",
        "1/4 teaspoon freshly ground sea salt, or to taste",
        "1 1/2 tablespoons olive oil",
        "2 teaspoons butter"
    ],
    "nut": [
        "Calories > 265 kcal",
        "Carbs > 12.4 g",
        "Cholesterol > 95 mg",
        "Fat > 11.1 g",
        "Protein > 27.8 g",
        "Sodium > 535 mg"
    ],
    "n": "Jeannie's Kickin' Fried Fish",
    "a": "crabbyjean",
    "r": "0",
    "s": 4,
    "des": "\"This was one of those recipes I created when I was cleaning out my spice cabinet! Everyone asks me for this recipe!\"",
    "ins": "Beat the egg with milk in a shallow bowl. In another shallow bowl, mix together the bread crumbs, roasted onion flakes, garlic, blackened seasoning, crushed red pepper flakes, black pepper, and sea salt.\nDip a tilapia fillet into the egg mixture, then press gently into the crumb mixture on both sides; set the coated fillet onto a plate. Repeat with remaining fillets; refrigerate the coated fillets for about 15 minutes to help set the crumbs.\nHeat the olive oil and butter in a cast-iron frying pan over medium heat. Lay the fillets into the skillet, and pan-fry until golden brown on each side, about 3 minutes per side. The fish should be opaque and flaky underneath the coating. Remove and drain fillets on paper towels.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "4508090.jpg",
    "o": "4508090.jpg,4471630.jpg,3948041.jpg,3563642.jpg,3560210.jpg,2969700.jpg",
    "st": "allrecipes"
}