{
    "id": 219455,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cloves garlic, minced",
        "2 tablespoons chopped fresh rosemary",
        "salt and ground black pepper to taste",
        "2 pounds boneless pork loin roast",
        "2 tablespoons olive oil",
        "4 medium carrots, split lengthwise and cut into 2-inch pieces",
        "1 1/2 pounds red potatoes, quartered",
        "2 heads fennel, quartered",
        "2 tablespoons olive oil",
        "1/2 cup white wine"
    ],
    "nut": [
        "Calories > 305 kcal",
        "Carbs > 21.6 g",
        "Cholesterol > 54 mg",
        "Fat > 13.6 g",
        "Protein > 21.9 g",
        "Sodium > 97 mg"
    ],
    "n": "Healthier Roasted Pork Loin",
    "a": "MakeItHealthy",
    "r": "0",
    "s": 8,
    "des": "\"The rosemary flavor and fragrance is even more pronounced in this healthier version of Kathleen's recipe, because we used fresh rosemary rather than dried. We also added fresh carrots, potatoes, and fennel for a delicious and healthy meal!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nCrush garlic with rosemary, salt, and pepper to make a paste. Pierce meat with a sharp knife in several places and press the garlic paste into openings.  Rub meat with remaining garlic mixture and 2 tablespoons olive oil.\nPlace the pork loin into a roasting pan and cook in preheated oven for 45 minutes, basting with pan juices several times. Add the carrots, potatoes, and fennel to the pan and drizzle with 2 tablespoons olive oil.  Season with more salt and pepper. Continue to roast until pork is no longer pink in the center, about 1 1/2 hours.  An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\nRemove roast and vegetables to platter.  Pour wine into pan, and bring to a boil while scraping browned bits of food off bottom of pan with wooden spoon.  Serve with pan juices.",
    "pt": "30 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "1041716.jpg",
    "o": "",
    "st": "allrecipes"
}