{
    "id": 219593,
    "old_rating": "4.72727",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 cups white sugar",
        "2 tablespoons water",
        "5 large eggs",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground cloves",
        "1/8 teaspoon ground ginger",
        "1 pinch ground allspice",
        "1 pinch ground mace",
        "1/3 cup white sugar",
        "1 (15 ounce) can pumpkin puree",
        "1 3/4 cups low-fat milk",
        "1 vanilla bean, split and seeds scraped out and reserved",
        "2 tablespoons hulled toasted pumpkin seeds (optional)"
    ],
    "nut": [
        "Calories > 259 kcal",
        "Carbs > 49.3 g",
        "Cholesterol > 118 mg",
        "Fat > 4.8 g",
        "Protein > 6.9 g",
        "Sodium > 274 mg"
    ],
    "n": "Low-Fat Pumpkin Flan",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"This delicious pumpkin flan is the result of an experiment in replacing the recipe's usual cream and half-and-half with low-fat milk.\"",
    "ins": "Preheat the oven to 300 degrees F (150 degrees C).\nSet eight (5 1/2 ounce) ramekins into a large baking dish.\nStir together 1 1/4 cups sugar and water in a saucepan over medium heat; cook and stir until dark amber, about 10 minutes.\nQuickly divide the caramel among the ramekins; set aside.\nWhisk eggs, cinnamon, salt, cloves, ginger, allspice, mace, and 1/3 cup sugar together in a large bowl. Stir in pumpkin puree until smooth.\nHeat milk in a saucepan over medium-low heat until it starts to gently bubble and steam. Remove from heat.\nPlace vanilla bean seeds and pod in milk. Allow to soak for 10 minutes. Slowly strain hot milk mixture into the egg mixture and whisk to form a thin custard.\nDivide the custard evenly among the ramekins, leaving about 1/4 inch at the top of each.\nFill baking dish with hot water to reach halfway up the sides of the ramekins. Cover the baking dish with heavy-duty aluminum foil.\nBake in the preheated oven until the flan is just set, 45 to 50 minutes.\nRemove ramekins from hot water to cool completely. Cover and refrigerate until cold, at least four hours.\nRun a knife around the inside edge of each ramekin and place an overturned plate on top. Invert and release the flan. Garnish and serve.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "5 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}