{
    "id": 219588,
    "old_rating": "4.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (7 pound) bone-in beef prime rib roast",
        "3 cloves garlic, halved and cut into slivers",
        "3 cloves garlic, minced",
        "1/2 cup prepared horseradish",
        "1 1/2 teaspoons chopped fresh thyme",
        "1 teaspoon dried rosemary",
        "1 1/2 teaspoons kosher salt",
        "freshly ground black pepper to taste",
        "1/4 cup olive oil",
        "3 carrots, peeled and cut into chunks",
        "3 stalks celery, cut into chunks",
        "1 large onion, cut into chunks"
    ],
    "nut": [
        "Calories > 619 kcal",
        "Carbs > 5.9 g",
        "Cholesterol > 118 mg",
        "Fat > 51.7 g",
        "Protein > 30.9 g",
        "Sodium > 437 mg"
    ],
    "n": "Prime Rib Christmas Special",
    "a": "Kathi Richards Smith",
    "r": "0",
    "s": 10,
    "des": "\"This is what I make for Christmas every year, the taste is perfect!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nWith a small sharp knife, make cuts in the meaty side of the beef roast, and insert slivers of garlic into the cuts. Lay the roast in a roasting pan with the rib side down. Mash the 3 cloves of minced garlic, horseradish, thyme, rosemary, kosher salt, black pepper, and olive oil in a bowl to make a paste. Rub the paste all over the roast, including the rib bones. Scatter the carrots, celery, and onion into the roasting pan around the meat.\nRoast the meat in the preheated oven until browned and a quick-read meat thermometer inserted into the thickest part of the roast reads 135 degrees F (57 degrees C), for medium-rare meat, about 2 hours and 20 minutes.\nRemove the roast to a carving board, and allow to rest for 10 minutes. The temperature of the roast should rise to 145 degrees F (65 degrees C).\nPour the pan drippings into a bowl, and skim excess fat. To serve, carve the roast into 1-inch thick slices, arrange slices on a platter, and place vegetables around the meat. Pour the pan juices over the meat and vegetables.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "1080063.jpg",
    "o": "",
    "st": "allrecipes"
}