{
    "id": 219695,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 1/2 cups sifted all-purpose flour",
        "1 teaspoon baking soda",
        "2 teaspoons cream of tartar",
        "1/2 teaspoon salt",
        "1 cup margarine, softened",
        "1 cup butter, softened",
        "1 1/2 cups white sugar",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "2 cups ground pecans",
        "1 cup confectioners' sugar, or more as needed"
    ],
    "nut": [
        "Calories > 86 kcal",
        "Carbs > 9.2 g",
        "Cholesterol > 9 mg",
        "Fat > 5.2 g",
        "Protein > 0.9 g",
        "Sodium > 62 mg"
    ],
    "n": "Grandma's Christmas Cookie",
    "a": "Becky Pittman",
    "r": "0",
    "s": 96,
    "des": "\"My Grandmother used to make these for my mother and me for years. We took it for granted that she would always be here to do so. My mother and I played with the ingredients until we think we have duplicated Grandma's recipe. The light coating of powdered sugar makes these stand out from the other cookies in the tin.\"",
    "ins": "Preheat an oven to 375 degrees F (190 degrees C).\nStir the sifted flour, baking soda, cream of tartar, and salt together in a bowl.\nBeat the margarine, butter and sugar together with an electric mixer in a large bowl until smooth. Add one egg, and continue beating until completely incorporated; add the remaining egg along with the vanilla extract, and beat on low speed until incorporated. Mix the flour mixture into the butter mixture until just incorporated. Gently mix the pecans into the dough with your hands.\nRoll the dough into 1-inch balls; arrange onto baking sheets about 2 inches apart.\nBake in the preheated oven until the edges are golden-brown, 8 to 9 minutes. Allow the cookies to cool on the baking sheet for 8 minutes. Place confectioners' sugar into a bowl, and lightly dip both sides of each warm cookie into the sugar. Tap of excess, and allow cookies to finish cooling.",
    "pt": "15 m",
    "ct": "8 m",
    "tt": "50 m",
    "i": "2966731.jpg",
    "o": "",
    "st": "allrecipes"
}