{
    "id": 219684,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 (18.25 ounce) package yellow cake mix with pudding (such as Betty CrockerÂ®)",
        "3 eggs",
        "1/3 cup rum",
        "1/2 cup water",
        "1/2 cup vegetable oil",
        "1/4 cup rum",
        "1/4 cup water",
        "1 cup white sugar",
        "1/2 cup butter",
        "1 teaspoon confectioners' sugar for sprinkling"
    ],
    "nut": [
        "Calories > 332 kcal",
        "Carbs > 38 g",
        "Cholesterol > 51 mg",
        "Fat > 17.3 g",
        "Protein > 2.7 g",
        "Sodium > 267 mg"
    ],
    "n": "Simple Christmas Rum Cake",
    "a": "BB",
    "r": "0",
    "s": 16,
    "des": "\"This makes a great inexpensive Christmas gift with a pretty presentation using any of the Christmas-themed fluted cake pans. The jellyroll pan with wax paper flip is the best idea I've been able to come up with for the transfer. Please share if you have better ideas!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a fluted tube pan (such as a Bundt(R)) with cooking spray.\nPlace the cake mix, eggs, 1/3 cup of rum, 1/2 cup of water, and the vegetable oil into a large bowl. Beat until smooth with an electric mixer on low speed, about 3 minutes.\nPour the batter into the prepared pan.\nBake in the preheated oven until the cake has risen and the top is lightly golden brown, about 40 minutes. A toothpick inserted into the center of the cake should come out clean.\nWhile cake is baking, make the glaze. In a saucepan over medium heat, combine 1/4 cup of rum, 1/4 cup of water, sugar, and butter. Stir and heat until all the sugar has dissolved and the butter is melted. Turn off heat.\nRemove the cake from the oven. While still hot and in the pan, poke the cake all over with a long skewer to make many deep holes.\nPour the glaze over the hot cake. Allow the cake to cool until the cake separates slightly from the side of the pan, 10 to 12 minutes.\nLine a jellyroll pan or large baking sheet with waxed paper. Carefully place the lined pan over the top of the cake pan, and flip the cake pan over to release the cake onto the waxed paper. If desired, transfer cake to a serving platter.\nLet the cake cool thoroughly and sprinkle lightly with confectioners' sugar before slicing.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "2 h ",
    "i": "1079329.jpg",
    "o": "",
    "st": "allrecipes"
}