{
    "id": 219647,
    "old_rating": "4.53333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup water",
        "6 large firm russet potatoes, scrubbed",
        "1 pint heavy cream at room temperature",
        "1/2 cup unsalted butter at room temperature",
        "2 tablespoons dry instant mashed potato flakes, or as needed (optional)",
        "salt and ground white pepper to taste"
    ],
    "nut": [
        "Calories > 705 kcal",
        "Carbs > 69.8 g",
        "Cholesterol > 149 mg",
        "Fat > 45 g",
        "Protein > 9.8 g",
        "Sodium > 53 mg"
    ],
    "n": "Absolute Best Mashed Potatoes",
    "a": "Linda Sedlak",
    "r": "0",
    "s": 6,
    "des": "\"By using a few clever cooking tips and top quality ingredients, anyone can make firm (not runny) really tasty mashed potatoes to die for...I am always asked to please bring my potatoes, or to tell why my potatoes taste like potatoes with so much flavor. Now my secrets belong to you also. Hugs, and enjoy! Be prepared for compliments :>)\"",
    "ins": "Pour water into a saucepan. Place a large steamer basket into the saucepan over (not touching) the water, and place the potatoes into the basket. Bring the water to a boil. Reduce heat to a simmer, cover the pan and basket with a lid, and steam potatoes until tender in the center, about 20 minutes. A skewer inserted into a potato should easily pierce the center. Using tongs to hold hot potatoes, peel them, and set aside. Reserve potato cooking water.\nPlace 1 cup of cream and the butter into the work bowl of a large stand mixer fitted with mixing paddle, and start the machine on low speed. Mix until the cream and butter are blended; add potatoes, and beat until thoroughly mixed. As potatoes mash, gradually pour in remaining cup of cream. If potatoes are too stiff, beat in reserved potato cooking water, 1 tablespoon at a time. If potatoes are too runny, beat in instant mashed potato flakes, 1 tablespoon at a time, until you reach desired consistency. Season to taste with salt and white pepper.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "778081.jpg",
    "o": "",
    "st": "allrecipes"
}