{
    "id": 219681,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package spaghetti",
        "extra-virgin olive oil, or as needed",
        "1 (10 ounce) bag fresh spinach",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1/4 cup red wine vinegar",
        "1/4 cup balsamic vinegar",
        "2 (14.5 ounce) cans diced tomatoes",
        "1/4 cup chopped fresh basil",
        "1 tablespoon chopped fresh parsley",
        "1 (6 ounce) can sliced black olives, drained (optional)",
        "2 ounces crumbled feta cheese, or to taste"
    ],
    "nut": [
        "Calories > 413 kcal",
        "Carbs > 60.7 g",
        "Cholesterol > 13 mg",
        "Fat > 11.7 g",
        "Protein > 16.1 g",
        "Sodium > 1095 mg"
    ],
    "n": "Quick and Easy Greek Spaghetti",
    "a": "hokiemom",
    "r": "0",
    "s": 4,
    "des": "\"This tangy, veggie-filled, one-pot dish can be made quickly with canned or fresh ingredients. This goes great with a crusty garlic bread or cheesy bread.\"",
    "ins": "Bring a large pot of lightly salted water to a rolling boil. Cook the spaghetti at a boil, stirring occasionally, until the tender yet firm to the bite, about 12 minutes; drain and set aside.\nHeat olive oil in a large saucepan over medium heat; cook and stir the spinach and mushrooms in the hot oil until they give off their liquid, about 10 minutes. Add the red wine vinegar and balsamic vinegar; bring to a boil. Stir the tomatoes, basil, parsley, and black olives into the boiling mixture; continue cooking and stirring, until the flavors blend, about 10 more minutes.\nMix the cooked spaghetti into the tomato mixture and reduce heat to medium-low. Simmer the pasta and sauce until the flavors have blended, 8 to 10 minutes; stir the feta cheese into the pasta. Sprinkle with more feta cheese to serve.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "1456113.jpg",
    "o": "",
    "st": "allrecipes"
}