{
    "id": 219687,
    "old_rating": "4.125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup all-purpose flour",
        "salt, to taste",
        "ground black pepper, to taste",
        "2 pounds beef round steak, cubed",
        "3 tablespoons vegetable oil, or as needed",
        "8 ounces fresh mushrooms, chopped",
        "1 large onion, chopped",
        "1 cup chopped carrot",
        "4 cups beef broth, divided",
        "2 (.87 ounce) packages dry brown gravy mix",
        "1 large potato, cubed",
        "1/4 cup frozen peas",
        "1/4 cup frozen corn",
        "1/4 cup frozen lima beans",
        "1/4 cup frozen cut green beans",
        "1 (10.75 ounce) can condensed cream of mushroom soup (optional)"
    ],
    "nut": [
        "Calories > 303 kcal",
        "Carbs > 27.1 g",
        "Cholesterol > 48 mg",
        "Fat > 10.2 g",
        "Protein > 25.2 g",
        "Sodium > 1004 mg"
    ],
    "n": "Slow Cooker Beef Round Stew",
    "a": "Donna Jeanne",
    "r": "0",
    "s": 10,
    "des": "\"Let this beefy stew cook while you're at work. Serve on rice, or with fresh hot rolls from the oven.\"",
    "ins": "Place the flour in a shallow bowl, and mix with salt and black pepper. Sprinkle beef with more salt and black pepper. Press the beef cubes into the seasoned flour, and tap off the excess flour.\nHeat the vegetable oil in a large skillet over medium heat, and cook the beef cubes until browned on all sides, working in batches. Place the browned beef into a slow cooker. Place the mushrooms, onion, and carrot in the skillet with the last batch of meat; place in the slow cooker. Pour about 1 cup of beef broth into the skillet, and stir to dissolve any brown bits left in the bottom of the skillet. Pour into the slow cooker.\nIn a saucepan over medium heat, whisk the remaining beef broth with the dry gravy mix until smooth. Bring the gravy to a boil, reduce heat to medium low, and simmer until thickened, about 2 minutes. Stir the gravy into the stew. Mix in the potato, frozen peas, corn, lima beans, and green beans. If you prefer a thicker gravy, mix in the cream of mushroom soup.\nPlace the lid on the cooker, set to low heat, and cook until the beef is very tender, about 4 hours. You can cook the stew up to 8 hours if necessary.",
    "pt": "30 m",
    "ct": "4 h ",
    "tt": "4 h ",
    "i": "774532.jpg",
    "o": "",
    "st": "allrecipes"
}