{
    "id": 219679,
    "old_rating": "4.14286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 eggs, separated",
        "2 cups half-and-half cream",
        "2 teaspoons white sugar",
        "1/2 teaspoon salt",
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1 tablespoon melted butter, or as needed"
    ],
    "nut": [
        "Calories > 271 kcal",
        "Carbs > 32 g",
        "Cholesterol > 110 mg",
        "Fat > 12.1 g",
        "Protein > 8.5 g",
        "Sodium > 486 mg"
    ],
    "n": "Danish Ebelskiver",
    "a": "Jim White",
    "r": "0",
    "s": 7,
    "des": "\"These are a light Danish-style pancake that will require an ebelskiver cast iron pan. Serve warm with melted butter.  Can be rolled into powdered sugar or filled with a berry filling.\"",
    "ins": "Beat the egg yolks in a bowl; whisk the half-and-half, sugar, and salt with the egg yolks until thoroughly mixed.\nWhisk the flour, baking powder, baking soda, and cinnamon together in a separate bowl. Beat the flour mixture into the egg mixture just until smooth and most of the lumps are gone.\nWith an electric mixer, beat the egg whites in a bowl until they form stiff peaks. Gently fold the beaten egg whites into the batter.\nBrush melted butter into the round depressions of a cast-iron ebelskiver pan. Place the pan over medium-high heat. When the butter is very hot and smells slightly nutty, pour batter into each depression, filling the round shapes about half to three-quarters full. Allow the ebelskiver to cook until the bottoms are golden brown, 1 to 2 minutes. The inside batter will still be runny.\nUsing a toothpick or wooden skewer, gently push each ebelskiver at an edge to loosen from the pan. Insert the toothpick lightly into a top edge from the inside, and gently lift and rotate the pancake to turn it over. Turn them so the round bottoms are facing upward and the liquid batter in the center of a pancake runs into the bottom of the round depression. Cook until the other side of each pancake is browned, about 1 more minute.\nRemove the finished pancakes from the pan with the toothpick, transfer to a platter, and serve warm.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "873240.jpg",
    "o": "",
    "st": "allrecipes"
}