{
    "id": 219631,
    "old_rating": "3.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2/3 cup vegetable shortening",
        "2 cups white sugar",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "4 cups all-purpose flour",
        "1 cup unsweetened cocoa powder",
        "2 teaspoons baking soda",
        "2 cups milk",
        "3 cups milk",
        "9 tablespoons all-purpose flour",
        "1 1/2 cups vegetable shortening",
        "1 1/2 cups butter",
        "2 1/4 cups white sugar",
        "1 tablespoon vanilla extract"
    ],
    "nut": [
        "Calories > 531 kcal",
        "Carbs > 58 g",
        "Cholesterol > 50 mg",
        "Fat > 32.2 g",
        "Protein > 5.5 g",
        "Sodium > 215 mg"
    ],
    "n": "Nana Bessie's Whoopie Pies",
    "a": "pfogg",
    "r": "0",
    "s": 24,
    "des": "\"I've never been able to find whoopie pies this good!  My grandmother always made them -- the secret is in the filling.  I give them out at Christmas time, everyone looks forward to them.  The recipe makes extra filling -- doubles as a great cake frosting!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nTo make cookies, beat 2/3 cup of vegetable shortening with 2 cups of sugar in a large mixing bowl with an electric mixer until the mixture is creamy. Beat in eggs and 2 teaspoons of vanilla extract until thoroughly combined. Whisk together 4 cups of flour, the cocoa powder, and baking soda until thoroughly mixed, then beat the flour mixture into the vegetable shortening mixture in several additions, alternating with the milk. Beat dough just until smooth.\nDrop dough by tablespoon onto the prepared baking sheets, about 2 inches apart, making the cookies as round as possible. Recipe should yield about 48 cookies.\nBake in the preheated oven until the cookies are set in the middle, 15 to 20 minutes. Watch carefully to avoid burning the cookies. Allow cookies to cool for several minutes on baking sheets before removing to finish cooling on racks.\nTo make the filling, pour 3 cups of milk into a large saucepan over low heat, and whisk in 9 tablespoons of flour until smooth. Allow the mixture to come to a simmer, whisking constantly, until as thick and smooth as pudding, about 3 minutes. Place the thickened mixture into the refrigerator to cool, about 30 minutes.\nIn a large mixing bowl, beat 1 1/2 cup of vegetable shortening with the butter until thoroughly combined, then beat in 2 1/4 cup of sugar and 1 tablespoon vanilla extract until the mixture is thoroughly combined. Beat the cooled milk mixture into the butter mixture until smooth and fluffy, 1 to 2 minutes.\nChoose 2 cookies of the same size, and spread a thick layer of filling on the flat side of a cookie; top with remaining cookie. Repeat with remaining cookies and frosting.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}