{
    "id": 219655,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (3 pound) boneless beef chuck roast, cut into 1-inch cubes",
        "kosher salt to taste",
        "ground black pepper to taste",
        "1/4 teaspoon garlic powder, or to taste",
        "1/3 cup all-purpose flour",
        "1/2 cup vegetable oil",
        "1 large green bell pepper, chopped",
        "2 onions, chopped",
        "1 cup diced celery",
        "3 large cloves garlic, minced",
        "1/4 cup all-purpose flour",
        "4 cups beef broth",
        "3 bay leaves",
        "1 teaspoon dried thyme",
        "2 tablespoons hot sauce",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon dried basil",
        "2 (10 ounce) cans diced tomatoes with green chile peppers (such as RO*TELÂ®)",
        "1 teaspoon salt",
        "1/2 cup chopped fresh parsley leaves"
    ],
    "nut": [
        "Calories > 455 kcal",
        "Carbs > 15.2 g",
        "Cholesterol > 77 mg",
        "Fat > 33.3 g",
        "Protein > 23.5 g",
        "Sodium > 1193 mg"
    ],
    "n": "Grillades",
    "a": "Karen Waters",
    "r": "0",
    "s": 8,
    "des": "\"A warm and delicious way to use stew beef or chuck roast. I serve with grits or white rice and crusty bread for dipping.\"",
    "ins": "Season beef cubes with kosher salt, black pepper, and garlic powder in a large bowl.\nDust beef with 1/3 cup flour and toss lightly to coat.\nHeat vegetable oil in a large pot over medium heat. Cook and stir beef in the hot oil until evenly browned, 7 to 10 minutes.\nRemove beef with slotted spoon; transfer to a bowl.\nStir bell pepper, onion, celery, and garlic into the oil left in the pot; cook and stir until vegetables are lightly browned, 8 to 10 minutes.\nRemove vegetables with a slotted spoon and add to the bowl of beef. Drain oil, reserving about 3 tablespoons in the pot. Reduce heat to low.\nGradually whisk 1/4 cup flour into the reserved oil until you achieve a dark golden-brown roux, 10 to 15 minutes. Stir constantly and watch carefully; roux burns easily.\nSlowly pour beef broth into the roux while stirring; bring to a simmer, and cook until thickened, stirring constantly, about 3 minutes.\nReturn the beef and vegetables to the pot. Add bay leaves, thyme, hot sauce, Worcestershire sauce, basil, tomatoes with green chiles, and 1 teaspoon salt.\nBring to a boil over medium heat, then reduce heat to medium-low and simmer until beef is tender, about 1 1/2 hours, stirring occasionally. Remove bay leaves and stir in chopped parsley to serve.",
    "pt": "25 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}