{
    "id": 219703,
    "old_rating": "4.78947",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup butter, softened",
        "3/4 cup firmly packed light brown sugar",
        "3/4 cup white sugar",
        "2 eggs",
        "1 1/2 teaspoons vanilla extract",
        "1 1/2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "2 teaspoons ground cinnamon",
        "1/2 teaspoon salt",
        "2 cups rolled oats, or as needed",
        "1 cup butterscotch chips, or to taste"
    ],
    "nut": [
        "Calories > 147 kcal",
        "Carbs > 18.9 g",
        "Cholesterol > 24 mg",
        "Fat > 7.1 g",
        "Protein > 1.5 g",
        "Sodium > 114 mg"
    ],
    "n": "Orange's Famous Oatmeal Scotchies!",
    "a": "Orange",
    "r": "0",
    "s": 36,
    "des": "\"These cookies are so good they have a reputation. Don't let me speak for them; make them yourself. Make sure you watch closely; you might not even see them disappear!\"",
    "ins": "Beat the butter, brown sugar, and white sugar with an electric mixer in a large bowl until smooth. Beat the first egg into the butter mixture until completely blended; beat the vanilla into the mixture with the last egg.\nWhisk the flour, baking soda, cinnamon, and salt together in a separate bowl. Beat the flour mixture into the butter mixture about 1/2 cup at a time. Fold the rolled oats and butterscotch chips into the resulting dough. If the dough isn't firm enough, mix in more rolled oats, about 1/4 cup at a time, until dough is of desired consistency.\nRefrigerate the dough for 1 to 2 hours before baking.\nPreheat oven to 350 degrees F (175 degrees C).\nScoop up dough by heaping tablespoonful and roll into balls. Place cookies about 2 inches apart on baking sheets.\nBake in the preheated oven until very lightly browned and cookies are set in the middle, 10 to 12 minutes. Allow cookies to cool for about 5 minutes before removing from baking sheets to finish cooling on wire rack.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "4535272.jpg",
    "o": "",
    "st": "allrecipes"
}