{
    "id": 219774,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup margarine",
        "1 cup chopped celery",
        "1 cup chopped carrot",
        "1/2 onion, chopped",
        "8 slices deli ham, chopped",
        "3 potatoes, peeled and cubed",
        "1 (15 ounce) can whole kernel corn, undrained",
        "1 (15 ounce) can green beans, undrained",
        "water to cover",
        "2 cups bite-size broccoli florets",
        "2 (10.75 ounce) cans  condensed cream of mushroom soup",
        "10 (1 ounce) slices processed cheese food product, Swiss flavor",
        "8 cups 2% milk ",
        "1 teaspoon salt",
        "1/8 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 316 kcal",
        "Carbs > 32.4 g",
        "Cholesterol > 32 mg",
        "Fat > 13.2 g",
        "Protein > 18.2 g",
        "Sodium > 1401 mg"
    ],
    "n": "Hearty Veggie Soup in a Creamy Mushroom Broth",
    "a": "DanaC",
    "r": "0",
    "s": 12,
    "des": "\"This is one of the most delicious vegetable soups I have ever had. It's not your typical veggie soup. It's very filling and good for you. I have also used frozen peas, asparagus, and cauliflower in this recipe, so play around with it with different vegetables. I haven't had any that I didn't like with this broth. It makes a very large pot, so for a smaller family you may want to halve it. I have a family of 10 and there's usually a little bit left over. I serve it with rolls so all the food groups are covered. The cooking times are approximate and may very depending on your stove -- so pay attention to when your veggies are cooked. Stir often so you don't scorch the broth after adding the milk, cheese, and mushroom soup.\"",
    "ins": "Melt the margarine in a large stock pot over medium heat. Cook and stir the celery, carrot, and onion in the melted margarine until the onion is tender and slightly browned, about 10 minutes; add the ham, potatoes, corn, green beans, and enough water to cover the mixture completely. Bring the mixture to a simmer, and cook until the potatoes are cooked nearly through, 30 to 35 minutes.\nStir the broccoli, cream of mushroom soup, Swiss-style cheese food, 2% milk, salt, and black pepper into the soup; cook just until the cheese is melted into the soup, about 5 minutes.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "1066900.jpg",
    "o": "",
    "st": "allrecipes"
}