{
    "id": 219768,
    "old_rating": "4.73333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package linguine pasta",
        "2 tablespoons butter",
        "1 tablespoon olive oil",
        "1/4 cup minced sweet onion",
        "2 cloves garlic, minced",
        "1 (10 ounce) can baby clams, drained with juices reserved (such as Bumble BeeÂ®)",
        "1 tablespoon dry white wine",
        "1 (16 ounce) jar Alfredo sauce (such as ClassicoÂ®)",
        "1 teaspoon grated Parmesan cheese, or to taste (optional)",
        "1 pinch crushed red pepper flakes, or to taste (optional)"
    ],
    "nut": [
        "Calories > 727 kcal",
        "Carbs > 51.4 g",
        "Cholesterol > 108 mg",
        "Fat > 44.9 g",
        "Protein > 31.3 g",
        "Sodium > 1230 mg"
    ],
    "n": "Creamy Linguine with Clam Sauce",
    "a": "Lorraine Williams",
    "r": "0",
    "s": 4,
    "des": "\"Very easy, quick and sinfully satisfying. Great with a tossed green salad with vinaigrette dressing.\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta, stirring occasionally, until cooked through but still slightly firm, about 11 minutes. Drain well.\nHeat the butter and olive oil in a skillet over medium heat until it begins to brown slightly. Stir in the onion; cook and stir until the onion becomes lightly golden, about 10 minutes. Stir in the garlic and cook for 1 minute more. Add the reserved clam juice and wine. Simmer until reduced by half, about 15 minutes. Stir in the Alfredo sauce and clams; cook and stir until heated through, about 5 minutes.\nServe the clam sauce over the linguine, and sprinkle with Parmesan cheese and red pepper flakes.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "45 m",
    "i": "2594547.jpg",
    "o": "",
    "st": "allrecipes"
}