{
    "id": 219784,
    "old_rating": "3.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "3 large white onions, diced",
        "3 large carrots, diced",
        "3 large stalks celery, diced",
        "6 cloves garlic, chopped",
        "1 1/2 quarts vegetable broth",
        "3 tablespoons dried sage",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 81 kcal",
        "Carbs > 13.5 g",
        "Cholesterol > 0 mg",
        "Fat > 2.3 g",
        "Protein > 2 g",
        "Sodium > 386 mg"
    ],
    "n": "Pota Brata (Irish Flag Soup)",
    "a": "Steo",
    "r": "0",
    "s": 8,
    "des": "\"'Brata' is Irish for flag and 'pota' is pot. This winter warming vegetable soup is called flag soup because when you cut the vegetables up it makes the colors of the Irish flag. The French call it 'mirepoix,' the Italians 'soffrito.' Either way, it makes a lovely soup for those chilly winter days. Serve with crusty bread rolls.\"",
    "ins": "Heat the olive oil in a large pot over medium heat; cook and stir the onions, carrots, celery, and garlic in the hot oil until the onions are translucent, 5 to 7 minutes.\nPour the vegetable stock into the pan and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Season with the sage, salt, and black pepper. Reduce heat to low, place a cover on the pot, and cook until the flavors blend, about 1 hour.\nPour the soup into a blender pitcher to no more than half full. Hold the lid of the blender firmly in place. Carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into your serving vessel. Alternately, you can use a stick blender and puree the soup in the cooking pot.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "994837.jpg",
    "o": "",
    "st": "allrecipes"
}