{
    "id": 219720,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 (10 ounce) packages frozen chopped spinach - thawed, drained and squeezed dry",
        "6 eggs",
        "1 cup chopped fresh dill leaves",
        "1 large onion, chopped",
        "1 pound crumbled feta cheese",
        "1/2 pound cottage cheese",
        "1 teaspoon ground black pepper, or to taste",
        "8 sheets phyllo dough, thawed",
        "3 tablespoons olive oil, divided",
        "sour cream for garnish (optional)"
    ],
    "nut": [
        "Calories > 415 kcal",
        "Carbs > 23.4 g",
        "Cholesterol > 198 mg",
        "Fat > 26.3 g",
        "Protein > 24.7 g",
        "Sodium > 1027 mg"
    ],
    "n": "Homemade Spanakopita",
    "a": "momuv2dox",
    "r": "0",
    "s": 8,
    "des": "\"My father and mother survived World War II and immigrated to America. They used food and tradition to overcome their struggles and raise a healthy, joyous family. It's the good memories I have of bringing family together -- and family is of number-one importance to me.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nPlace the spinach, eggs, dill, onion, feta cheese, cottage cheese, and black pepper into a large bowl, and mix well.\nPlace 2 sheets of phyllo dough into the bottom of a 9x13-inch baking dish, and drizzle with about 1 tablespoon of olive oil; top with 2 more sheets of phyllo dough. Spread the spinach filling evenly over the sheets of phyllo, pat it down gently, and top with 2 more sheets of phyllo. Drizzle with 1 more tablespoon of olive oil, and top with the remaining 2 phyllo sheets. Drizzle with remaining 1 tablespoon olive oil.\nBake in the preheated oven until the top is browned and the filling is set, about 1 hour. To serve, cut into squares and top each square with a dollop of sour cream.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4298606.jpg",
    "o": "",
    "st": "allrecipes"
}