{
    "id": 219709,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup water",
        "2 eggs",
        "1 1/4 teaspoons salt",
        "3 tablespoons white sugar",
        "3 2/3 cups bread flour",
        "1 teaspoon active dry yeast",
        "1 egg yolk",
        "1 tablespoon water",
        "1 tablespoon sesame seeds, or more if desired"
    ],
    "nut": [
        "Calories > 185 kcal",
        "Carbs > 33.9 g",
        "Cholesterol > 48 mg",
        "Fat > 2.3 g",
        "Protein > 6.5 g",
        "Sodium > 256 mg"
    ],
    "n": "Hanukkah Star Challah",
    "a": "AMG",
    "r": "0",
    "s": 12,
    "des": "\"When invited to a Hanukkah dinner, I thought of making something appropriate. Finally we decided on a Challah bread shaped as a 6-pointed Star of David.\"",
    "ins": "Place 1 cup of water, eggs, salt, sugar, bread flour, and yeast into the pan of a bread machine in the order recommended by the manufacturer. Select the Dough setting, and start the machine.\nWhen cycle is completed, remove dough from the machine, and set onto a floured work surface for 15 minutes to rest. Cover dough with a towel or large bowl to prevent drying out.\nKnead the dough several times, and cut into 6 equal pieces. Roll each piece out into a rope about 10 inches long and 1 inch in diameter.\nLine a baking sheet with parchment paper. Lay 3 ropes of bread onto the prepared baking sheet, and pinch ropes together firmly at the ends to form a pointed triangle. Weave 3 more ropes over and underneath each point of the first triangle to make a second, interwoven triangle. Pinch it closed tightly at the edges to make a 6-pointed star. Set the baking sheet in a warm place, and allow to rise until doubled, 30 to 45 minutes.\nPreheat the oven to 375 degrees F (190 degrees C). Whisk egg yolk with 1 tablespoon of water, and brush the mixture over the loaf; sprinkle with sesame seeds.\nBake in the preheated oven until the challah is shiny, golden brown, and sounds hollow when tapped, about 35 minutes.",
    "pt": "1 h",
    "ct": "35 m",
    "tt": "2 h ",
    "i": "4320110.jpg",
    "o": "",
    "st": "allrecipes"
}