{
    "id": 219789,
    "old_rating": "3.77273",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "1 onion, chopped",
        "1 teaspoon minced garlic",
        "2 cups water",
        "2 chicken bouillon cubes",
        "2 (14 ounce) cans pumpkin puree",
        "1 (14 ounce) can coconut milk",
        "2 teaspoons ground ginger",
        "2 tablespoons orange juice",
        "1 1/2 teaspoons pumpkin pie spice",
        "1 1/2 teaspoons chili powder"
    ],
    "nut": [
        "Calories > 281 kcal",
        "Carbs > 21.9 g",
        "Cholesterol > 12 mg",
        "Fat > 22.2 g",
        "Protein > 4.4 g",
        "Sodium > 900 mg"
    ],
    "n": "Pumpkin Coconut Milk Soup",
    "a": "Boesie",
    "r": "0",
    "s": 5,
    "des": "\"I modified another Allrecipes pumpkin soup recipe past recognition and decided to add it here to share. It has a little bit of a kick to it from the chili powder, and the orange juice and pumpkin pie spice really bring out the flavors.  It was originally based on 'Daddy's Pumpkin Soup.' I think some lemon juice or orange zest would do as well for the orange juice.\"",
    "ins": "Melt the butter in a large pot over medium heat; cook and stir the onion and garlic in the melted butter until softened, about 5 minutes. Stir the water and chicken bouillon cubes into the mixture; cook and stir until the bouillon cubes have dissolved, 2 to 3 minutes. Stir the pumpkin puree, coconut milk, ginger, orange juice, pumpkin pie spice, and chili powder into the liquid. Bring the soup to a simmer, and cook until heated through, 5 to 7 minutes.\nPour the soup into a blender pitcher to no more than half full. Hold down the lid of the blender firmly in place. Start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth, and pour into a clean pot. Alternately, you can use a stick blender and puree the soup in the pot.\nReturn the pureed soup to medium heat; bring to a simmer and cook another 10 minutes.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "2817350.jpg",
    "o": "",
    "st": "allrecipes"
}