{
    "id": 219760,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (3 pound) whole chickens, each cut into 8 pieces",
        "salt and ground black pepper to taste",
        "1 cup all-purpose flour",
        "2 tablespoons olive oil",
        "1 yellow onion, chopped",
        "1 large green bell pepper, seeded and chopped",
        "6 cloves garlic, minced",
        "1 pound white button mushrooms, quartered",
        "2 teaspoons chopped fresh oregano",
        "1 (28 ounce) can whole peeled tomatoes in juice, coarsely chopped",
        "2 tablespoons tomato paste",
        "3/4 cup white wine",
        "1 1/2 cups chicken stock",
        "3 tablespoons capers, drained and rinsed",
        "2 tablespoons coarsely chopped fresh basil"
    ],
    "nut": [
        "Calories > 587 kcal",
        "Carbs > 23.8 g",
        "Cholesterol > 145 mg",
        "Fat > 29.7 g",
        "Protein > 51 g",
        "Sodium > 543 mg"
    ],
    "n": "Chicken Cacciatore II",
    "a": "krzylittlecara",
    "r": "0",
    "s": 8,
    "des": "\"Great recipe from a high-end cooking store.\"",
    "ins": "Season the chicken pieces with salt and black pepper.\nPlace the flour in a shallow bowl. Press each chicken piece into the flour and tap off excess.\nHeat the olive oil in a large Dutch oven over medium heat until almost smoking hot.\nPan-fry the chicken until golden brown on both sides, about 3 minutes per side. Work in batches so as to not overcrowd the pan. Set the browned chicken aside.\nStir the onion, green bell pepper, and garlic into the Dutch oven; cook, stirring occasionally, until tender, about  5 minutes.\nStir in the mushroom; cook until they release their juice, 5 to 8 more minutes.\nMix in oregano, tomatoes, tomato paste, white wine, and chicken stock; bring to a boil.\nReturn the chicken pieces to the sauce, cover the pan, reduce heat to medium-low, and simmer until the chicken is no longer pink inside and the juices run clear, 30 to 40 minutes.\nStir in capers and sprinkle with basil to serve.",
    "pt": "30 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "4540430.jpg",
    "o": "",
    "st": "allrecipes"
}