{
    "id": 219862,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup bacon drippings",
        "1 carrot, minced",
        "1 cup chopped red bell pepper",
        "1 cup chopped green bell pepper",
        "1 poblano pepper, diced",
        "2 jalapeno peppers, minced",
        "1 habanero pepper, minced",
        "2 cups chopped onion",
        "6 cloves garlic, minced",
        "3 pounds ground beef",
        "2 cups tomato paste",
        "1 cup tomato sauce",
        "1 cup dark beer (such as Negra ModeloÂ®)",
        "2 fluid ounces tequila",
        "1 cup chicken broth",
        "3 tablespoons chili powder",
        "2 teaspoons hot paprika",
        "2 teaspoons ground cumin",
        "1 teaspoon ground coriander",
        "2 teaspoons kosher salt",
        "1 teaspoon cayenne pepper",
        "1 teaspoon ground black pepper",
        "2 teaspoons white pepper",
        "3/4 cup honey",
        "3 tablespoons finely grated ginger, or more to taste"
    ],
    "nut": [
        "Calories > 412 kcal",
        "Carbs > 35.2 g",
        "Cholesterol > 76 mg",
        "Fat > 19.6 g",
        "Protein > 22.8 g",
        "Sodium > 954 mg"
    ],
    "n": "Ginger Honey Drunk Chili",
    "a": "George R.",
    "r": "0",
    "s": 12,
    "des": "\"My unique chili recipe starts each bite with a somewhat-sweet ginger overtone which then melds into a full bodied chile spice. This recipe is the stove-top version but it can easily be done in slow cooker as well (starting with step 4).\"",
    "ins": "Heat bacon drippings in a heavy-bottomed stockpot over medium heat. Cook and stir carrot in the hot drippings for about 3 minutes.\nStir the red bell pepper, green bell pepper, poblano pepper, jalapeno pepper, habanero pepper, and onion with the carrot; cook and stir until tender, 3 to 4 minutes.\nStir in garlic and beef; cook and stir until beef is browned, about 10 minutes. Drain excess grease from the pot.\nStir tomato paste and tomato sauce into the beef mixture. Increase heat to medium-high heat; cook and stir for 2 minutes.\nPour in dark beer, tequila, and chicken broth; bring to a boil.\nReduce heat to medium-low; stir in chili powder, paprika, cumin, coriander, salt, cayenne pepper, black pepper, white pepper, and honey. Simmer for 45 minutes to 2 hours.\nStir grated ginger into the chili about 15 minutes before serving.",
    "pt": "25 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}