{
    "id": 219894,
    "old_rating": "4.86207",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds chicken wings",
        "2 eggs, beaten",
        "1 cup all-purpose flour",
        "1 cup margarine",
        "1/2 cup apple cider vinegar",
        "3 tablespoons soy sauce",
        "3 tablespoons water",
        "1 cup brown sugar",
        "1 teaspoon monosodium glutamate (MSG) (optional)",
        "1/2 teaspoon salt",
        "3 serrano chile peppers, minced (optional)",
        "2 tablespoons grated fresh ginger",
        "2 tablespoons sesame seeds, toasted"
    ],
    "nut": [
        "Calories > 539 kcal",
        "Carbs > 41.8 g",
        "Cholesterol > 81 mg",
        "Fat > 34.4 g",
        "Protein > 15.4 g",
        "Sodium > 868 mg"
    ],
    "n": "Spicy Ginger Chicken Wings",
    "a": "Melissa Killion",
    "r": "0",
    "s": 8,
    "des": "\"These wings are sweet, spicy and sticky but if you're into the sweet ginger but don't like spicy, just leave out the serrano chilies. Make sure to test your chilies, 'cause there can be a lot of variation in heat!\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).\nBlot chicken wings dry with a paper towel.\nBeat the eggs in a bowl, and place the flour in another bowl. Dip chicken wings into the egg, then into the flour to lightly coat, shaking off the excess.\nMelt the margarine in a large skillet over medium high heat.\nPan fry the chicken wings until well browned on all sides, about 10 minutes.\nMeanwhile, gently boil the cider vinegar, soy sauce, water, brown sugar, monosodium glutamate, salt, serrano chile peppers, and ginger in a saucepan over medium heat until thickened, 5 to 7 minutes.\nToss the browned chicken wings in the sauce to coat, then transfer the wings to large baking dish with a slotted spoon. Reserve remaining sauce.\nBake in the preheated oven until the chicken is no longer pink in the center, about 30 minutes, rotating and basting with the reserved sauce after 15 minutes.\nSprinkle sesame seeds on the chicken wings before serving.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "872292.jpg",
    "o": "4530415.jpg,4483163.jpg,3951741.jpg,3370426.jpg,2383117.jpg,1356310.jpg",
    "st": "allrecipes"
}