{
    "id": 219882,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "2 tablespoons cayenne pepper",
        "2 tablespoons paprika",
        "2 teaspoons salt",
        "2 teaspoons ground black pepper",
        "5 pounds chicken wings, cut apart at joints, wing tips discarded",
        "2 quarts vegetable oil for frying",
        "2 cups butter, melted",
        "2 (5 ounce) bottles hot pepper sauce (such as TabascoÂ®)",
        "2 (5 ounce) bottles habanero hot sauce",
        "5 habanero peppers, seeded and chopped (wear gloves)",
        "1 (8 ounce) can crushed pineapple, drained"
    ],
    "nut": [
        "Calories > 541 kcal",
        "Carbs > 23.3 g",
        "Cholesterol > 97 mg",
        "Fat > 44.3 g",
        "Protein > 13.5 g",
        "Sodium > 1504 mg"
    ],
    "n": "Blazing Wings",
    "a": "Jason L",
    "r": "0",
    "s": 15,
    "des": "\"Buffalo wings with an extreme kick! I have a couple friends who like spicy foods, and I was elected to come up with a hot wing for a football party. This recipe can be made hotter if you can find ghost chillies or ghost chilli sauce in replacement of the habanero, and the pineapple adds just enough to keep you coming back for more. The wings are a hit, even without the sauce! Serve with ranch or blue cheese dressing.\"",
    "ins": "Mix the flour, cayenne pepper, paprika, salt, and black pepper in a large resealable plastic bag.\nDrop 5 or 6 wings at a time into the flour mixture. Seal the bag and shake to coat wings with flour.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nGently lower the coated wings into the hot oil and deep-fry until wings are no longer pink in the center and the coating is golden brown, 5 to 10 minutes.\nDrain the wings on paper towels and set aside.\nPlace the butter, hot pepper sauce, habanero pepper sauce, habanero peppers, and pineapple into the pitcher of a blender. Blend the sauce until smooth (do not allow sauce to touch your eyes); pour into a large resealable plastic bag.\nPlace the fried chicken wings into the bag of sauce, 5 or 6 at at a time, seal the bag, and gently shake to coat the wings in the sauce. Remove to a platter for serving.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "1113186.jpg",
    "o": "",
    "st": "allrecipes"
}