{
    "id": 219884,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons Vegetable oil",
        "2 large baking potatoes, cut into 1/2-inch thick slices",
        "salt and ground black pepper to taste",
        "1 tablespoon vegetable oil",
        "1/2 pound ground beef",
        "1 (15 ounce) can black beans, drained",
        "2 tablespoons taco seasoning",
        "2 tablespoons water",
        "8 ounces shredded Cheddar cheese, divided",
        "1/4 cup shredded lettuce",
        "1 small tomato, chopped",
        "1/4 cup sour cream",
        "1/4 cup guacamole"
    ],
    "nut": [
        "Calories > 327 kcal",
        "Carbs > 20 g",
        "Cholesterol > 50 mg",
        "Fat > 20.3 g",
        "Protein > 16.4 g",
        "Sodium > 568 mg"
    ],
    "n": "Mexican Potato Nachos",
    "a": "Lois A Dupre",
    "r": "0",
    "s": 8,
    "des": "\"This is so good, and it's great for a pot luck. Try pepper-jack cheese for the Cheddar for a little more kick.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nPour 2 tablespoons of vegetable oil into a large bowl; toss the potato slices in the oil to coat.\nArrange the slices in a single layer on a baking sheet and sprinkle with salt and black pepper.\nBake in the preheated oven until the potato slices are golden brown, about 20 minutes.\nWhile potato slices are baking, heat 1 tablespoon of vegetable oil in a skillet over medium heat; brown the ground beef in the hot oil, breaking it up into crumbles as it cooks, 8 to 10 minutes. Drain excess grease.\nMix the black beans into the ground beef; stir in the taco seasoning and water. Bring the mixture to a boil and reduce heat to medium-low. Simmer until the flavors have blended, about 10 minutes.\nArrange the potato slices on a serving platter and sprinkle with half the Cheddar cheese.\nTop the potatoes with the meat and bean mixture; sprinkle the remaining cheese on the nachos.\nSpread the lettuce out over the nachos and garnish with tomato and dollops of sour cream and guacamole.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "3099429.jpg",
    "o": "3099429.jpg,2525856.jpg,2248859.jpg,1126452.jpg,1107467.jpg,1096036.jpg",
    "st": "allrecipes"
}