{
    "id": 219809,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (8 ounce) package fresh mushrooms, halved",
        "1 clove garlic, minced",
        "1 teaspoon rosemary",
        "1/4 teaspoon salt",
        "3 tablespoons olive oil",
        "2 tablespoons butter",
        "2 onions, sliced",
        "2 cloves garlic, minced",
        "1 teaspoon chopped fresh thyme",
        "1/2 cup heavy cream, divided",
        "1 (14.5 ounce) can chicken broth",
        "1/2 cup milk",
        "1/4 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 303 kcal",
        "Carbs > 10.6 g",
        "Cholesterol > 61 mg",
        "Fat > 28 g",
        "Protein > 4.6 g",
        "Sodium > 651 mg"
    ],
    "n": "Roasted Mushroom Soup",
    "a": "Coffeecrazed",
    "r": "0",
    "s": 4,
    "des": "\"This is a mushroom lover's dream! As the cold weather rolls in, we'll all be craving simple warm soups. This one is easy and delicious! If making this for a family, I suggest doubling the recipe, as it disappears fast!\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C).\nMix the mushrooms, 1 minced clove garlic, rosemary, and salt together in a bowl. Drizzle the olive oil over the mushroom mixture, and toss to coat evenly; transfer to a baking sheet.\nRoast the mushrooms in the preheated oven until golden brown, about 15 minutes.\nMelt the butter in a large saucepan over medium heat. Stir the onions, 2 minced cloves garlic, and the thyme into the melted butter; cook and stir until the onions are completely soft, 7 to 10 minutes.\nCombine the mushroom mixture and the onion mixture in the bowl of a blender or food processor with about half of the heavy cream; blend on low until combined yet slightly chunky. Return the blended mixture to the stockpot. Stir the remaining heavy cream, the chicken broth, milk, and black pepper through the blended mixture; bring the resulting soup to a simmer, and cook until the flavors are thoroughly combined, at least 15 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "1100150.jpg",
    "o": "",
    "st": "allrecipes"
}