{
    "id": 219911,
    "old_rating": "4.70629",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (8 ounce) center-cut salmon fillets, with skin",
        "1/4 teaspoon kosher salt",
        "1 teaspoon vegetable oil",
        "1 clove garlic, sliced",
        "1 tablespoon chopped fresh tarragon",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "3 tablespoons mayonnaise",
        "1 teaspoon Dijon mustard",
        "1 teaspoon fresh lemon juice",
        "1 pinch cayenne pepper"
    ],
    "nut": [
        "Calories > 496 kcal",
        "Carbs > 2.3 g",
        "Cholesterol > 132 mg",
        "Fat > 33 g",
        "Protein > 45.1 g",
        "Sodium > 520 mg"
    ],
    "n": "Chef John's Salmon",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"I love the combination of tarragon and Italian parsley, but I've used herbs like basil and thyme, which worked wonderfully as well. As far as the fish goes, a center-cut salmon filet is a perfect thickness for this, but other similarly shaped seafood will work.\"",
    "ins": "Season salmon fillets with kosher salt. Line a baking baking sheet with foil and brush lightly with vegetable oil.\nPreheat oven's broiler on high and set the oven rack about 8 inches from the heat source.\nProcess garlic, tarragon, and parsley in a blender or mortar and pestle to form a loose paste.\nMix mayonnaise, Dijon mustard, lemon juice, and cayenne pepper into garlic paste until combined.\nPlace salmon fillets skin side down on the baking sheet. Spoon herb spread over the top and sides of each fillet.\nCook under the preheated broiler until fillets are well-browned, about 5 minutes. Turn the broiler off and turn the oven to 350 degrees F (175 degrees C).\nBake until the internal temperature of the salmon is 130 degrees F (55 degrees C) and salmon flakes easily with a fork, about 3 to 4 minutes.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "25 m",
    "i": "4515870.jpg",
    "o": "4515870.jpg,4483154.jpg,4477995.jpg,4473863.jpg,4466380.jpg,4104736.jpg",
    "st": "allrecipes"
}