{
    "id": 219988,
    "old_rating": "4.7",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "For the Crab Cakes:",
        "2 tablespoons salted butter",
        "1/2 onion, finely chopped",
        "2 stalks celery, finely chopped",
        "1/2 large red bell pepper, finely chopped",
        "1 bunch green onions (green portion only), chopped",
        "1/2 large carrot, finely chopped",
        "3 cloves garlic, minced",
        "1 tablespoon parsley flakes",
        "2 teaspoons Creole seasoning (such as Tony Chachere'sÂ®)",
        "2 teaspoons dried basil",
        "2 teaspoons ground black pepper",
        "1 teaspoon dried dill weed",
        "1/2 teaspoon oregano",
        "1/2 teaspoon dried thyme",
        "2 large eggs, beaten",
        "1 pound lump crabmeat, picked free of shell",
        "9 buttery crackers (such as Keebler ClubÂ® crackers), crushed",
        "3 tablespoons vegetable oil",
        "For the Spicy Cajun Dipping Sauce:",
        "1 cup mayonnaise",
        "1 tablespoon chile-garlic sauce (such as SrirachaÂ®)",
        "2 teaspoons Creole seasoning (such as Tony Chachere'sÂ®)",
        "2 teaspoons parsley flakes",
        "1 teaspoon paprika"
    ],
    "nut": [
        "Calories > 530 kcal",
        "Carbs > 13.3 g",
        "Cholesterol > 144 mg",
        "Fat > 44.2 g",
        "Protein > 21.3 g",
        "Sodium > 1040 mg"
    ],
    "n": "Cajun Crab Cakes (No Breadcrumbs)",
    "a": "Tracy",
    "r": "0",
    "s": 6,
    "des": "\"Two of the most crucial ingredients used in New Orleans cooking are Cajun spice and local seafood! Crab has always been my favorite type of shellfish, but I have never really cared much for crab cakes. The overpowering presence of seasoned breadcrumbs used in most recipes interferes with the sweet and delicate flavors of the fresh lump crabmeat. After years of experimenting with many of New Orleans' most famous crab cake recipes, I have created a flavorful, mouth-watering, delicious piece of work! The key is to use a small amount of crumbled crackers instead of breadcrumbs. I hope you enjoy!\"",
    "ins": "Melt butter in a large, heavy skillet over medium heat. Stir in onion; cook and stir until the onion has softened and turned translucent, about 5 minutes.\nStir in the celery, bell pepper, green onion, carrot, and garlic. Continue to cook and stir until vegetables are tender, about 10 minutes more.\nSeason with 1 tablespoon parsley flakes, 2 teaspoons Creole seasoning, basil, pepper, dill weed, oregano, and thyme. Cook and stir until fragrant, 5 minutes more.\nTransfer cooked vegetables to a large bowl; allow to cool for about 10 minutes. Set skillet aside for later use.\nStir the beaten eggs into the vegetables. Mix in the crabmeat and cracker crumbs with your hands, making sure not to break up the chunks of crab too much.\nShape the crab mixture into 12 small cakes.\nHeat vegetable oil in the skillet over medium high heat.\nPan-fry the crab cakes in batches until golden brown on each side, about 3 minutes.\nTo make dipping sauce: Whisk together the mayonnaise, chile-garlic sauce, 2 teaspoon Creole seasoning, 2 teaspoon parsley flakes, and paprika.",
    "pt": "40 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "1023628.jpg",
    "o": "",
    "st": "allrecipes"
}