{
    "id": 219916,
    "old_rating": "3.94444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 potatoes, peeled and cubed",
        "4 carrots, peeled and cubed",
        "1/4 cup butter",
        "1/2 small onion, chopped",
        "2 cloves garlic, crushed",
        "3 tablespoons all-purpose flour",
        "3 cups milk",
        "2 (5 ounce) cans tuna, drained",
        "1/2 cup frozen peas",
        "1/4 cup butter, melted",
        "1 sleeve buttery round crackers, crushed"
    ],
    "nut": [
        "Calories > 661 kcal",
        "Carbs > 57.9 g",
        "Cholesterol > 95 mg",
        "Fat > 35.4 g",
        "Protein > 28.5 g",
        "Sodium > 597 mg"
    ],
    "n": "Grandma Daly's Tuna and Tater Casserole",
    "a": "janet7th",
    "r": "0",
    "s": 4,
    "des": "\"This tuna casserole is an updated version of a recipe handed down from my grandmother, Elizabeth Kelleher Daly so of course it uses potatoes as its starch. She actually called it California Chicken. I guess to a native Yankee, the joke was that in California, tuna is chicken.\"",
    "ins": "Place the potatoes and carrots into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 15 minutes. Drain vegetables, then cover to keep warm.\nPreheat an oven to 350 degrees F (175 degrees C). Spray a baking dish with cooking spray.\nMelt 1/4 cup butter in a large skillet over medium heat. Stir in onion and garlic; cook and stir until the onion is softened, about 3 minutes.\nSprinkle in the flour and and reduce heat to medium-low. Continue to cook and stir for about 1 minute, whisking out any lumps.\nWhisk in the milk until the mixture thickens, 5 to 7 minutes.\nFlake the tuna, then stir it into the white sauce along with the potatoes, carrots, and peas. Season with salt and black pepper.\nTransfer the tuna mixture to the prepared baking dish.\nMix 1/4 cup of melted butter with the crackers together in a bowl.\nSprinkle the cracker mixture over the tuna and potatoes.\nBake in the preheated oven until the sauce is bubbly, about 30 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "802060.jpg",
    "o": "",
    "st": "allrecipes"
}