{
    "id": 219939,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "1 tablespoon olive oil",
        "1 cup finely chopped celery",
        "1 cup finely chopped carrot",
        "1 clove garlic, minced",
        "1 (32 ounce) carton chicken stock",
        "3 (12 fluid ounce) cans or bottles American-style pale lager beer",
        "1 tablespoon Worcestershire sauce",
        "1 tablespoon hot pepper sauce (such as TabascoÂ®)",
        "2 teaspoons white pepper",
        "2 teaspoons dry mustard powder",
        "2 teaspoons onion powder",
        "2 teaspoons garlic powder",
        "1 teaspoon ground cayenne pepper",
        "2 (10.75 ounce) cans condensed cream of chicken soup",
        "1 (10.75 ounce) can condensed Cheddar cheese soup",
        "1 (1 pound) loaf processed cheese, cubed",
        "1/2 pound block pepperjack cheese, shredded",
        "1/2 pound block sharp Cheddar cheese, shredded"
    ],
    "nut": [
        "Calories > 428 kcal",
        "Carbs > 16.3 g",
        "Cholesterol > 82 mg",
        "Fat > 29.2 g",
        "Protein > 18.6 g",
        "Sodium > 1655 mg"
    ],
    "n": "Big Game Spicy Beer Cheese Soup",
    "a": "Challena",
    "r": "0",
    "s": 12,
    "des": "\"This is an intensely cheesy, spicy rich beer soup that will be a TOUCHDOWN in your home and gone by the end of the game. Serve with popcorn or hunks of sourdough bread for dipping.\"",
    "ins": "Melt the butter with olive oil in a large soup pot or Dutch oven over medium heat.\nCook and stir the celery, carrots, and garlic until soft, about 8 minutes.\nPour in the chicken stock, beer, Worcestershire sauce, hot pepper sauce, white pepper, mustard powder, onion powder, garlic powder, and cayenne pepper; whisk to combine.\nBlend the mixture with a hand blender until smooth. Bring to a boil, reduce heat to low, and simmer 15 minutes.\nStir in the cream of chicken soup and the Cheddar cheese soup; bring soup back to a simmer.\nStir in the processed cheese and allow to melt. When it has melted, slowly mix in the pepperjack and sharp Cheddar cheeses, a little at a time, allowing each addition to melt into the soup before adding the next.\nSimmer the soup over low heat until the cheese has completely melted and the flavors have blended, 15 to 20 more minutes.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}