{
    "id": 219929,
    "old_rating": "4.42424",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 chicken thighs",
        "6 chicken drumsticks",
        "2 tablespoons salt",
        "1 quart cold water, to cover",
        "2 cups cold buttermilk",
        "1 egg, beaten",
        "1 teaspoon chicken seasoning mix (see note)",
        "3 cups all-purpose flour",
        "2 tablespoons chicken seasoning mix (see note)",
        "2 quarts vegetable oil for frying"
    ],
    "nut": [
        "Calories > 946 kcal",
        "Carbs > 52.9 g",
        "Cholesterol > 215 mg",
        "Fat > 58.1 g",
        "Protein > 50.2 g",
        "Sodium > 3673 mg"
    ],
    "n": "Heather's Fried Chicken",
    "a": "Heather Staggs",
    "r": "0",
    "s": 6,
    "des": "\"A wonderful recipe for deep-fried chicken with a Southern taste all its own. The hint of tangy buttermilk under a crispy coating of deliciousness makes this chicken stand out.\"",
    "ins": "Place chicken thighs and drumsticks in a large bowl, cover with cold water, and mix in salt. Cover and refrigerate from 8 hours to overnight.\nRinse chicken thoroughly. Mix buttermilk, beaten egg, and 1 teaspoon chicken seasoning in a large bowl until thoroughly combined.\nPlace chicken pieces into buttermilk mixture and refrigerate 30 minutes to 1 hour.\nHeat vegetable oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nPlace flour and 2 tablespoons chicken seasoning into a shallow bowl and mix until combined. Remove chicken from buttermilk bath, shake off excess buttermilk, and press into flour. Tap off excess flour.\nGently place chicken into hot oil, 3 or 4 pieces at a time; fry chicken until golden brown, 12 to 15 minutes per batch.\nRemove chicken pieces to a cooling rack set over paper towels to remove excess oil before serving.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "9 h ",
    "i": "792656.jpg",
    "o": "4539994.jpg,4006840.jpg,3793962.jpg,3599485.jpg,3287865.jpg,1122757.jpg",
    "st": "allrecipes"
}