{
    "id": 219919,
    "old_rating": "4.4965",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 pounds Yukon Gold potatoes, peeled and cubed",
        "3 cloves garlic, halved",
        "1 pound lean ground beef",
        "2 tablespoons flour",
        "3/4 cup beef broth",
        "3 tablespoons ketchup",
        "4 cups frozen mixed vegetables",
        "1/2 teaspoon black pepper",
        "1/2 cup shredded Cheddar cheese, divided",
        "3/4 cup light sour cream",
        "1 teaspoon salt"
    ],
    "nut": [
        "Calories > 311 kcal",
        "Carbs > 23.5 g",
        "Cholesterol > 59 mg",
        "Fat > 17.2 g",
        "Protein > 16.2 g",
        "Sodium > 546 mg"
    ],
    "n": "Chef John's Shepherd's Pie",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"Shepherd's Pie recipes are traditionally done with lamb, but are great with any ground meat--turkey and beef being the most popular modern versions. Give this great casserole a try, and watch everyone flock to the table.\"",
    "ins": "Place cubed potatoes and garlic in a large pot with enough water to cover. Bring to a boil over high heat; reduce heat to medium-low, cover, and simmer until tender, about 20 minutes.\nPreheat the oven to 375 degrees F (190 degrees C).\nBrown ground beef over medium heat in a skillet. Stir in flour, mixing with beef drippings.\nAdd beef broth, ketchup and vegetables. Stir to combine. Cook for 5 minutes, until thick.\nTransfer beef mixture into an oven-proof casserole dish.\nDrain potatoes and smash them a little bit before adding 1/4 cup of grated cheese and sour cream. Mash together until smooth.\nSpoon potatoes onto the middle of the meat mixture. With a fork, spread potatoes from the center to the edges to form the top layer.\nSprinkle with remaining 1/4 cup of grated cheese.\nBake in the preheated oven for 20-25 minutes, or until cheese is melted and golden. Let cool 15 minutes before serving.",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "3475348.jpg",
    "o": "4526027.jpg,4526025.jpg,4500023.jpg,4488380.jpg,4488379.jpg,4486055.jpg",
    "st": "allrecipes"
}