{
    "id": 219986,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 clove garlic, crushed",
        "1 teaspoon crushed black peppercorns",
        "4 (4 ounce) beef tenderloin steaks, trimmed",
        "olive oil cooking spray",
        "2/3 cup green bell pepper strips",
        "2/3 cup red bell pepper strips",
        "2/3 cup yellow bell pepper strips",
        "1/4 onion, chopped",
        "1 clove garlic, minced",
        "1/2 teaspoon beef bouillon granules",
        "1 teaspoon red curry powder",
        "1/2 teaspoon crushed black peppercorns",
        "1/3 cup fat-free evaporated milk",
        "1/3 cup water"
    ],
    "nut": [
        "Calories > 291 kcal",
        "Carbs > 8.2 g",
        "Cholesterol > 96 mg",
        "Fat > 13 g",
        "Protein > 33.8 g",
        "Sodium > 147 mg"
    ],
    "n": "Steak au Poivre with a Curry Twist",
    "a": "CARMOMOF4",
    "r": "0",
    "s": 4,
    "des": "\"South Beach-type recipe that switches things up by using red curry instead of paprika. The curry sauce is delicious. Often I will double or triple the sauce recipe to use over rice or with chicken.\"",
    "ins": "Mix 1 clove of crushed garlic and 1 teaspoon of crushed peppercorns together in a small bowl. Press a small amount of the mixture on both sides of the steaks.\nPrepare a large nonstick skillet with olive oil cooking spray and place over medium heat. Arrange steaks in a single layer.\nCook the steaks until they are beginning to firm and are hot and slightly pink in the center, about 5 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Remove the steaks to a serving platter and keep warm.\nCook and stir the green, red, and yellow bell pepper strips, the onion, and 1 clove of minced garlic in a clean skillet sprayed with olive oil cooking spray over medium heat until onion is translucent, about 5 minutes; transfer vegetables to a bowl.\nMix the beef bouillon granules, red curry powder, 1/2 teaspoon of crushed peppercorns, evaporated milk, and water into the skillet. Cook and stir over medium heat until the bouillon granules have dissolved.\nContinue to cook the sauce, stirring often, until reduced to 1/2 cup, about 10 minutes; stir in the bell pepper mixture and heat through.\nSpoon the sauce over the steaks to serve.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "871251.jpg",
    "o": "",
    "st": "allrecipes"
}