{
    "id": 219932,
    "old_rating": "4.62069",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups canned black beans, rinsed and drained",
        "2 cups canned white beans, rinsed and drained",
        "2 (14.5 ounce) cans petite diced tomatoes",
        "1 1/2 cups frozen cooked kale",
        "1 tablespoon butter",
        "1/2 cup diced onion",
        "2 tablespoons chili powder, or more to taste",
        "1 tablespoon garlic and herb seasoning, or more to taste",
        "1 1/2 teaspoons salt",
        "2 large skinless, boneless chicken breast halves",
        "4 cups chicken broth",
        "1 cup heavy cream"
    ],
    "nut": [
        "Calories > 344 kcal",
        "Carbs > 32.5 g",
        "Cholesterol > 76 mg",
        "Fat > 14.8 g",
        "Protein > 22.4 g",
        "Sodium > 1364 mg"
    ],
    "n": "Slow Cooker Chicken Chili with Greens and Beans",
    "a": "MamaMcGreevy",
    "r": "0",
    "s": 8,
    "des": "\"Beans, greens and chicken come together with tomatoes in a thick and creamy broth. This recipe, as with most chili recipes, doesn't need to be exact and can be altered to fit your taste or what you have on hand. The choice of greens is up to you - my first choice is kale, but you can use spinach, turnip greens, collards or a combination (my favorite)!  If you use fresh greens, wash and chop them very fine before adding them to the slow cooker.\"",
    "ins": "Place black beans, white beans, tomatoes, and kale in a slow cooker.\nMelt the butter in a large skillet over medium heat. Stir in the onion; cook and stir until softened and translucent, about 5 minutes.\nTransfer the onion to the slow cooker.\nSprinkle with chili powder, garlic and herb seasoning, and salt.\nPlace the chicken breast halves on top, then pour the chicken broth into the slow cooker.\nCook on Low for 6 hours. Remove the chicken breasts, and shred or cut the chicken into bite-size pieces. Stir the shredded chicken back into the chili.\nStir in the heavy cream, allow to heat for a few minutes, and serve.",
    "pt": "15 m",
    "ct": "6 h",
    "tt": "6 h ",
    "i": "1075940.jpg",
    "o": "",
    "st": "allrecipes"
}