{
    "id": 219937,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 quarts water",
        "1/2 cup distilled white vinegar",
        "10 large eggs",
        "1/4 cup mayonnaise",
        "3 tablespoons Dijon mustard, smooth style",
        "2 teaspoons sweet pickle relish juice",
        "1/4 teaspoon onion powder",
        "1 1/2 tablespoons real bacon bits",
        "1 pinch paprika, or more to taste"
    ],
    "nut": [
        "Calories > 60 kcal",
        "Carbs > 0.8 g",
        "Cholesterol > 94 mg",
        "Fat > 4.8 g",
        "Protein > 3.4 g",
        "Sodium > 166 mg"
    ],
    "n": "Big Game Deviled Eggs",
    "a": "Cowboy Mark",
    "r": "0",
    "s": 20,
    "des": "\"I have been making this dish for several years.  I use it primarily for Super Bowl and football parties.  It is great for holidays and it never fails to impress company.  Preparation time is approximately 45 minutes.  Makes 20 deviled egg halves.\"",
    "ins": "Bring water to a boil over high heat and stir in the vinegar. Carefully lower the eggs into the boiling water.\nReturn eggs to a boil over medium heat and boil for 15 minutes.\nTransfer the eggs to a colander set in the sink, and run cold water over the eggs for about 5 minutes to chill.\nPeel the eggs under a light stream of cold water and set aside in cold water to finish chilling, about 10 minutes.\nSlice the eggs lengthwise; scoop the egg yolks into a bowl.\nMash the egg yolks with a fork, then stir in the mayonnaise, 1 tablespoon at a time, until smooth; stir in the Dijon mustard.\nMix in sweet pickle relish juice, onion powder, and bacon bits; stir with the fork until the yolk mixture is thoroughly combined.\nFill each egg white half with the yolk mixture using a spoon.\nDust the deviled eggs with paprika and transfer to a platter.\nCover the platter with plastic wrap and refrigerate until cold and the flavors have blended, at least 1 hour.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "2 h ",
    "i": "2374338.jpg",
    "o": "",
    "st": "allrecipes"
}