{
    "id": 219913,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups packed brown sugar",
        "1 cup water",
        "1/4 cup maple syrup",
        "1 (7 ounce) jar marshmallow creme",
        "2 cups peanut butter",
        "1 1/2 pounds chocolate almond bark (chocolate confectionery coating), broken into chunks",
        "10 (10 inch) flour tortillas",
        "2 cups sugar frosted corn flake cereal, divided",
        "10 large bananas, or as needed"
    ],
    "nut": [
        "Calories > 302 kcal",
        "Carbs > 42.3 g",
        "Cholesterol > 0 mg",
        "Fat > 14.8 g",
        "Protein > 6.6 g",
        "Sodium > 190 mg"
    ],
    "n": "Hound Dog Bites",
    "a": "Peggi Weaver Tebben",
    "r": "0",
    "s": 40,
    "des": "\"So...I had made a batch of peanut butter fluff and was wondering what I could use it on besides ice cream. Then I got to thinking: peanut butter and bananas! Elvis's favorite sandwich. So I developed this recipe, and in honor of the King, I'm calling it Hound Dog Bites!\"",
    "ins": "Stir the brown sugar, water, and maple syrup together in a saucepan until the sugar has dissolved. Bring to a boil, and reduce heat to medium low to keep warm.\nMix the marshmallow creme with the peanut butter in a large bowl, and pour the brown sugar mixture over the peanut butter mixture.\nWith an electric mixer, beat the mixture until fluffy. Refrigerate the fluff.\nTo make the bites, lay a tortilla out onto a work surface. Spread a thin layer of peanut butter fluff onto the tortilla, leaving an edge about 1/4 inch wide all the way around free from spread.\nSprinkle about 1 1/2 tablespoons of frosted flake cereal over the spread.\nLay a banana along one side of the tortilla; if 1 banana is too short to reach the entire length of the tortilla, use 1 1/2 bananas. Tightly roll the tortilla around the banana.\nWith a sharp serrated knife, cut the roll into 1/2-inch thick slices. Lay the slices out flat on waxed paper.\nPlace the chocolate almond bark into a microwave-safe bowl, and microwave for 1 minute; stir the chocolate coating, and continue microwaving at 30-second intervals and stirring until the coating is smooth and warm (not hot).\nDip the bottom of a slice into the coating, covering about 2/3 of the height of the slice.  Place the dipped slice coated side down on a sheet of waxed paper to set. Repeat with remaining slices.\nPlace slices into refrigerator to chill.\nPlace the remaining cereal flakes in a shallow bowl, and lightly crush them.\nDip the other side of the slices into the chocolate coating, and immediately dip the coated area into the crushed flakes. Place the rolls onto waxed paper, flake sides up. Chill the pieces in the refrigerator until the tops have set up.",
    "pt": "1 h",
    "ct": "5 m",
    "tt": "1 h ",
    "i": "2590405.jpg",
    "o": "",
    "st": "allrecipes"
}