{
    "id": 219985,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (4 ounce) beef tenderloin filets",
        "2 tablespoons olive oil",
        "1 shallot, minced",
        "1 teaspoon minced garlic, or to taste",
        "1 cup Pinot Noir (or other semi-dry red wine)",
        "1 pinch garlic salt, or to taste",
        "1 pinch Italian seasoning, or to taste",
        "1 (8 ounce) package cream cheese, softened",
        "2 sheets frozen puff pastry, thawed",
        "1 egg white (optional)",
        "1/4 cup water (optional)"
    ],
    "nut": [
        "Calories > 1231 kcal",
        "Carbs > 59.9 g",
        "Cholesterol > 157 mg",
        "Fat > 84.8 g",
        "Protein > 45.6 g",
        "Sodium > 630 mg"
    ],
    "n": "Beef Vino Puff",
    "a": "ladysig",
    "r": "0",
    "s": 4,
    "des": "\"This is an alteration of Beef Wellington. I don't care for the traditional pate and mushrooms, so I looked for an alternative to put between the meat and pastry. This is what I wound up with. This is heavy and filling, so I generally try to pair it with some light sides like grilled vegetables or a salad.  It works wonderfully well with venison tenderloin instead of beef as well! I also discovered (the hard way) when rolling out puff pastry dough on waxed paper, that it is best to spray the waxed paper with nonstick spray first. Otherwise, it tends to be difficult to get back off.\"",
    "ins": "Preheat oven's broiler and set the oven rack about 6 inches from the heat source.\nPlace beef tenderloin filets in a broiler pan and broil until slightly browned but still very rare, about 2 minutes per side. Remove the filets and set aside to rest; reduce heat to 375 degrees F (190 degrees C).\nHeat olive oil in a skillet over medium heat and cook and stir shallot and garlic until the shallot is translucent, about 5 minutes.\nPour in Pinot Noir, bring to a boil, and cook until sauce is reduced by half, about 10 minutes, stirring often. Stir in garlic salt and Italian seasoning. Reduce heat to low.\nSlowly stir cream cheese into the sauce until you get a creamy purple sauce. Remove the sauce from the heat.\nPlace puff pastry sheets on a work surface and cut each sheet in half crosswise.\nSpoon a generous amount of sauce onto a puff pastry sheet half, and center a tenderloin filet onto the sauce.\nFold the puff pastry sheet over the steak and sauce, and press the edges all the way around to seal. Repeat with remaining steaks. Place the pastry-covered steaks onto a baking sheet.\nWhisk the egg white and water in a bowl and brush the mixture over the tops of the pastry.\nBake in the oven until the pastry is browned and puffed and the steaks are the desired degree of doneness, about 25 minutes. An instant-read meat thermometer inserted into the center of the meat should read at least 145 degrees F (65 degrees C).",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "3264106.jpg",
    "o": "",
    "st": "allrecipes"
}