{
    "id": 219981,
    "old_rating": "4.51852",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 lobster tails, split along the center top",
        "2 teaspoons butter, melted",
        "15 buttery round crackers, crushed",
        "1/2 cup jumbo lump crabmeat",
        "1/4 cup clarified butter",
        "1 tablespoon chopped fresh parsley leaves",
        "1 teaspoon seafood seasoning (such as Old BayÂ®)",
        "1 clove garlic, minced",
        "1 teaspoon lemon zest",
        "1 tablespoon fresh lemon juice",
        "1/4 teaspoon salt, or to taste",
        "1/4 teaspoon freshly ground white pepper, or to taste"
    ],
    "nut": [
        "Calories > 596 kcal",
        "Carbs > 19.4 g",
        "Cholesterol > 203 mg",
        "Fat > 41.4 g",
        "Protein > 35.9 g",
        "Sodium > 1483 mg"
    ],
    "n": "Crab-Stuffed Lobster Tail",
    "a": "Lotus",
    "r": "0",
    "s": 2,
    "des": "\"Lobster tail with a New England-style cracker and crabmeat stuffing. Serve with fresh lemon wedges and homemade dinner rolls for an exquisite but surprisingly simple meal.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nPull the edges of the split lobster shells apart and gently lift the tail meat to rest above the shells. Place the prepared lobster tails on a baking sheet.\nBrush each portion of tail meat with 1 teaspoon melted butter.\nLightly mix the crushed crackers, crabmeat, 1/4 cup of clarified butter, parsley, seafood seasoning, garlic, lemon zest, lemon juice, salt, and white pepper in a bowl until thoroughly combined.\nSpoon half the stuffing onto each lobster tail; press lightly to slightly shape the stuffing so it doesn't fall off.\nBake the lobster tails in the preheated oven until the meat is opaque and the stuffing is golden brown on top, 10 to 12 minutes. An instant-read thermometer inserted into the thickest part of the lobster tail should read 145 degrees F (65 degrees C).",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "855363.jpg",
    "o": "4529745.jpg,4473020.jpg,3270459.jpg,3158734.jpg,3158702.jpg,2539386.jpg",
    "st": "allrecipes"
}