{
    "id": 219971,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour, sifted",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 cup butter, softened",
        "3/4 cup white sugar",
        "1 large egg",
        "2 tablespoons milk",
        "1 1/2 teaspoons vanilla extract",
        "1/2 cup seedless raspberry jam",
        "4 ounces semisweet chocolate chips",
        "2 tablespoons butter"
    ],
    "nut": [
        "Calories > 202 kcal",
        "Carbs > 25.9 g",
        "Cholesterol > 31 mg",
        "Fat > 10.4 g",
        "Protein > 2.2 g",
        "Sodium > 134 mg"
    ],
    "n": "Old Fashioned Butter Valentine Cookies Dipped in Chocolate",
    "a": "LoriLouise",
    "r": "0",
    "s": 24,
    "des": "\"This is my mother's recipe. She handed it down to me years ago and I have been making it with a few of my own changes for about 25 years now.\"",
    "ins": "Sift the flour, baking powder, and salt together in a bowl; set aside.\nBeat the 1 cup butter with the sugar, egg, milk, and vanilla extract in another bowl until well mixed.\nGradually mix the flour mixture into the butter mixture.\nShape the dough into a disk; wrap with plastic wrap and refrigerate for at least 2 hours.\nWorking with half the dough at a time, roll out dough to about 1/8-inch thick.\nCut into cookies with a large heart shaped cookie cutter. Repeat with the remaining half of the dough.\nCut the center of half of the cookies with a smaller heart shaped cookie cutter.\nPlace an open centered cookie on top of a whole cookie to form a sandwich. Arrange cookies on an ungreased baking sheet; set aside.\nPreheat an oven to 400 degrees F (200 degrees C).\nPlace the raspberry jam in a microwave save bowl and heat on high until jam is runny, about 35 seconds.\nFill the center of the cookies with the jam. Refrigerate cookies for 10 minutes.\nBake in the preheated oven until the cookies are firm to the touch, 5 to 8 minutes. Cookies will be pale in color.\nTransfer cookies to a wire rack to cool completely.\nMelt the chocolate and 2 tablespoons butter in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting until smooth, for 1 to 3 minutes, depending on your microwave.\nSpoon chocolate decoratively over half of each cookie.\nPlace cookie on a waxed paper lined baking sheet and refrigerate until the chocolate has set, about 15 minutes.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2062532.jpg",
    "o": "",
    "st": "allrecipes"
}