{
    "id": 219963,
    "old_rating": "4.75701",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup butter",
        "2 cups shiitake mushrooms, sliced",
        "1 pinch salt",
        "1 sprig fresh rosemary, chopped",
        "3 tablespoons all-purpose flour",
        "2 1/2 cups beef broth",
        "salt and pepper to taste",
        "1/2 cup heavy cream",
        "1 (2 1/2 pound) uncooked prepared beef, veal and pork meatloaf"
    ],
    "nut": [
        "Calories > 324 kcal",
        "Carbs > 13.6 g",
        "Cholesterol > 139 mg",
        "Fat > 16.5 g",
        "Protein > 27.9 g",
        "Sodium > 501 mg"
    ],
    "n": "Creamy Mushroom Meatloaf",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"This technique keeps the meatloaf moist, while fortifying the sauce with its flavorful drippings. Regardless, this technique will work with just about any meatloaf recipe out there.\"",
    "ins": "Preheat the oven to 325 degrees F (165 degrees C).\nMelt butter in an oven-safe skillet over medium-high heat. Stir in mushrooms and a pinch of salt; cook and stir until mushrooms begin to brown, about 5 minutes.\nStir in fresh rosemary. Add flour and stir to coat the mushrooms; cook and stir for about 3 minutes.\nWhisk in beef broth, 1/2 cup at a time, whisking constantly to prevent lumps.\nTurn heat to high and bring the sauce to a simmer. Simmer a few minutes until sauce starts to thicken. Season with salt and pepper to taste.\nRemove from heat and stir in heavy cream.\nSlide prepared meatloaf into the sauce. Spoon sauce over the top of the meatloaf.\nBake in the preheated oven until no longer pink in the center, about 1 1/2 hours. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\nRemove pan from the oven and gently remove meatloaf to a serving platter.\nSkim off any extra fat from the surface of the sauce.\nBring the sauce to a boil over medium-high heat to reduce until thick, about 5 minutes.",
    "pt": "15 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "4170331.jpg",
    "o": "4170331.jpg,3612165.jpg,3612152.jpg,1120077.jpg,917368.jpg,912606.jpg",
    "st": "allrecipes"
}