{
    "id": 219964,
    "old_rating": "4.15459",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "butter as needed",
        "2 egg yolks",
        "2 eggs",
        "3 tablespoons white sugar",
        "3 1/2 ounces chopped dark chocolate",
        "5 tablespoons butter",
        "4 teaspoons unsweetened cocoa powder",
        "3 tablespoons flour",
        "1 pinch salt",
        "1/8 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 394 kcal",
        "Carbs > 32 g",
        "Cholesterol > 241 mg",
        "Fat > 28.7 g",
        "Protein > 6.9 g",
        "Sodium > 207 mg"
    ],
    "n": "Chef John's Chocolate Lava Cake",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Legend has it that this dessert was the result of a major catering disaster. The dessert for this particular event was to be individual chocolate cakes, but someone took them out of the ovens too soon and the centers were not cooked enough and still liquefied. Well, there was no time to take them off the plates and bake them more, so the chef simply had his wait staff introduce the dessert as Chocolate 'Lava' Cake! Brilliant!\"",
    "ins": "Generously butter the inside of 4 (5 1/2 ounce) ramekins. Place them in a casserole dish.\nWhisk together egg yolks, eggs, and sugar in a bowl until light, foamy, and lemon colored.\nMelt chocolate and butter in a microwave-safe bowl in 30-second intervals, stirring after each melting, 1 to 3 minutes.\nStir melted chocolate mixture into egg and sugar mixture until combined.\nSift cocoa powder into the mixture; stir to combine.\nSift flour and salt into the mixture; stir to combine into a batter.\nStir vanilla extract into the batter.\nTransfer batter to a resealable plastic bag. Snip one corner of the bag with scissors to create a tip.\nDivide batter evenly between the prepared ramekins; tap gently on the counter to remove any air bubbles.\nRefrigerate 30 minutes.\nPreheat an oven to 425 degrees F (220 degrees C).\nArrange the ramekins in a casserole dish. Pour enough hot tap water into the casserole dish to reach halfway up the sides of the ramekins.\nBake in the preheated over for 15-18 minutes. Set aside to cool for 15 minutes.\nLoosen the edges from the ramekin with a knife. Invert each cake onto a plate and dust with powdered sugar.",
    "pt": "5 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "4539032.jpg",
    "o": "4539032.jpg,4524894.jpg,4503875.jpg,4473879.jpg,4472933.jpg,3772096.jpg",
    "st": "allrecipes"
}