{
    "id": 220004,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 whole chicken",
        "3 parsnips, peeled and cut into bite-size pieces",
        "7 large carrots, cut into bite-size pieces",
        "1 bunch celery, cut into bite-size pieces",
        "1 onion, cut into bite-size pieces",
        "1 bunch fresh dill, chopped",
        "1 bunch fresh parsley, chopped",
        "6 cups water",
        "4 eggs",
        "1/4 cup vegetable oil",
        "1 cup matzo meal",
        "1 quart chicken stock",
        "1 rotisserie chicken, bones removed and meat cut into bite-size pieces",
        "salt and pepper to taste"
    ],
    "nut": [],
    "n": "Angel Family Chicken Soup with Matzo Balls",
    "a": "JacobAngel",
    "r": "0",
    "s": 7,
    "des": "\"This recipe has been passed down for generations in the Angel family. Using fresh ingredients gives this healthy soup a rich flavor.\"",
    "ins": "Place raw chicken in a large stockpot.\nAdd parsnips, carrots, celery, onion, dill, and parsley to the stockpot; cover with water, and boil until the chicken is 200 degrees F (95 degrees C) or begins to fall apart, about 1 hour.\nRemove chicken from the stock and set aside for another use.\nWhisk together eggs and oil in a medium-sized mixing bowl.\nAdd matzo meal to the bowl with eggs and oil, stirring until well combined. Cover and refrigerate for 20 minutes.\nRemove matzo mixture from the refrigerator and gently hand-roll into 1 inch balls. Be careful not to over-roll as this can make the matzo balls tough.\nIn a separate pot, heat chicken stock. Place matzo balls into the stock and simmer until they are soft, at least 1 hour.\nTransfer the matzo balls into the soup pot with the vegetables. Season with salt and pepper to taste.\nTo serve, place pieces of the roasted chicken into soup bowls and ladle the chicken soup with matzo balls over it. Enjoy!",
    "pt": "45 m",
    "ct": "1 h ",
    "tt": "3 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}