{
    "id": 220088,
    "old_rating": "4.70588",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 whole wheat lasagna noodles, dry",
        "1 teaspoon olive oil",
        "2 tablespoons olive oil",
        "3 cloves garlic, minced",
        "1 eggplant, cubed",
        "1 (28 ounce) can Italian herb-flavored tomato sauce",
        "1 cup part-skim ricotta cheese",
        "1 cup low-fat cottage cheese",
        "1 cup shredded part-skim mozzarella cheese",
        "1/4 cup shredded Parmesan cheese",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 egg",
        "2 1/2 cups frozen chopped spinach, thawed and squeezed dry"
    ],
    "nut": [
        "Calories > 206 kcal",
        "Carbs > 23.2 g",
        "Cholesterol > 31 mg",
        "Fat > 7.6 g",
        "Protein > 13.7 g",
        "Sodium > 660 mg"
    ],
    "n": "Low Fat Cheesy Spinach and Eggplant Lasagna",
    "a": "Jen",
    "r": "0",
    "s": 12,
    "des": "\"Lasagna recipe with vegetables and cheese!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nBring a large pot of water to a boil.\nDrop lasagna noodles into water and add 1 teaspoon of olive oil. Cook until noodles are tender but still slightly firm, about 8 minutes.\nDrain water from the noodles and let cool.\nHeat 2 tablespoons olive oil in a large skillet over medium heat.\nCook and stir garlic and eggplant chunks until eggplant is partially cooked, about 7 minutes.\nPour tomato sauce into the skillet and simmer until eggplant is tender, 10 to 15 minutes.\nCombine ricotta cheese, cottage cheese, mozzarella cheese, Parmesan cheese, salt, black pepper, and egg in a bowl.\nMix spinach into ricotta cheese mixture.\nSpread a layer of tomato sauce mixture into the bottom of a 9x12-inch baking dish.\nPlace 4 noodles on top of the sauce, overlapping if necessary.\nSpoon 1/3 of the remaining tomato sauce over noodles.\nSpread 1/3 of the ricotta mixture over the tomato sauce\nRepeat layers twice more, starting with noodles and following with sauce and ricotta mixture.\nTop the lasagna with mozzarella cheese.\nBake in preheated oven until the ricotta filling is set and mozzarella cheese topping is lightly browned, 45 minutes to 1 hour.",
    "pt": "40 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "3582452.jpg",
    "o": "2557786.jpg,2553575.jpg,2504297.jpg,2261996.jpg,1550769.jpg,1096824.jpg",
    "st": "allrecipes"
}