{
    "id": 220018,
    "old_rating": "4.95122",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 1/2 cups chicken stock",
        "3/4 cup old fashioned grits",
        "1/4 cup heavy cream, plus more as needed",
        "1 cup shredded smoked Gouda cheese, or more to taste",
        "1/4 cup butter",
        "8 slices bacon, chopped",
        "3 tablespoons butter",
        "1 tablespoon minced shallot",
        "1 tablespoon minced garlic",
        "1 splash white wine",
        "1 pound jumbo shrimp, peeled and deveined",
        "2 cups chopped spinach",
        "1 cup chopped portobello mushrooms",
        "1/4 cup sliced green onions",
        "2 cups heavy cream",
        "1 dash hot pepper sauce, or to taste",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 839 kcal",
        "Carbs > 21.8 g",
        "Cholesterol > 322 mg",
        "Fat > 70.5 g",
        "Protein > 29.6 g",
        "Sodium > 1083 mg"
    ],
    "n": "Grits a Ya Ya",
    "a": "Irene",
    "r": "0",
    "s": 6,
    "des": "\"A friend of mine made this for a Mardi Gras dinner. It was so delicious, I just had to have the recipe.\"",
    "ins": "Bring the chicken stock to a boil in a saucepan over high heat.\nSlowly pour the grits into the stock while stirring constantly.\nReduce heat to low; simmer until the grits are tender and thick, 15 to 20 minutes, stirring occasionally.\nStir in 1/4 cup heavy cream to thin the grits.\nStir in the Gouda cheese and 1/4 cup butter until melted and smooth.\nWhile the grits are cooking, place the bacon in a large, deep skillet over medium heat; cook until the bacon fat is rendered, about 3 minutes.\nStir in the shallot and garlic; cooking and stirring until the shallots are tender, about 5 minutes.\nPour in the white wine and stir in 3 tablespoons butter, cooking and stirring until the butter has melted.\nDrop the shrimp in the skillet; cook and stir until they are bright pink on the outside and the meat is no longer transparent in the center, about 3 minutes.\nStir in the spinach, mushrooms, and green onions; cook and stir until the spinach wilts, about 2 minutes more.\nRemove the shrimp with a slotted spoon.\nStir in 2 cups heavy cream. Simmer until the cream is reduced by about a third, about 10 minutes.\nSeason with hot sauce, salt, and pepper.\nReturn the shrimp to the skillet to heat through.\nServe shrimp and sauce over the prepared grits.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "944986.jpg",
    "o": "",
    "st": "allrecipes"
}