{
    "id": 220014,
    "old_rating": "4.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "water",
        "salt",
        "1 (2 pound) lobster",
        "1 teaspoon salt",
        "2 pounds russet potatoes, peeled and cut into 2-inch pieces",
        "1/4 cup butter",
        "1/2 cup cream, or more as needed",
        "1/4 teaspoon paprika"
    ],
    "nut": [
        "Calories > 503 kcal",
        "Carbs > 43.6 g",
        "Cholesterol > 178 mg",
        "Fat > 18.3 g",
        "Protein > 40.2 g",
        "Sodium > 5336 mg"
    ],
    "n": "Lobster Mashed Potatoes",
    "a": "mauigirl",
    "r": "0",
    "s": 4,
    "des": "\"I had this amazing dish at a lovely Pacific Northwest steakhouse and I knew I had to figure out how to make this special treat. These potatoes were so delicious, I could have skipped the steak entirely. This is my take on this rich and decadent side dish. This has become one of our traditions on Valentine's Day with a fabulous tenderloin steak. YUMMY! This would work well with your own mashed potato recipe instead of the basic mashed potato recipe listed here. You could certainly do this recipe with lobster tails instead of the whole lobster. You could even use precooked lobster ignoring the lobster cooking instructions. It looks like it is time consuming, but it is so easy and worth the effort for a special meal.\"",
    "ins": "Preheat an oven to 200 degrees F (95 degrees C).\nCombine the water with 2 tablespoons salt in a large pot; bring to a boil\nPlunge lobster into boiling water, cover the pot, and return the water to a boil. Reduce heat to medium-low and cook at a simmer until the lobster becomes bright right, about 10 minutes.\nRemove the lobster from the water and set aside to cool.\nWhen cool enough to handle, clean lobster and pull out tail meat, reserving the tail shell. Crack claws and remove the meat.\nChop the tail meat coarsely and reserve with the intact claw meat in a covered dish; keep warm in the preheated oven.\nPut about 1 inch of water in the bottom of a saucepan with 1 teaspoon salt; bring to boil.\nAdd potatoes to the boiling water; top with intact lobster tail shell.\nCover the saucepan and return the water to a boil. Reduce heat to medium low and cook at a simmer until the potatoes are easily pierced with a fork, 20 to 30 minutes.\nRemove lobster shell and discard.\nDrain the water from the saucepan.\nReduce the heat to low. Gently shake the pan over low heat to dry the potatoes.\nAdd the butter to the potatoes and mash until no lumps remain.\nAdd cream until you get your preferred consistency\nFold in reserved chopped lobster meat.\nSprinkle with paprika to serve.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "784946.jpg",
    "o": "",
    "st": "allrecipes"
}