{
    "id": 220059,
    "old_rating": "4.75493",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil",
        "2 pounds beef chuck roast, cut into 1/2-inch thick strips",
        "salt and pepper to taste",
        "1 tablespoon butter",
        "1/2 medium onion, sliced or diced",
        "8 ounces sliced mushrooms",
        "2 cloves garlic, minced",
        "1 1/2 tablespoons all-purpose flour",
        "1/2 cup white wine",
        "2 cups beef broth, divided",
        "3/4 cup creme fraiche",
        "1 tablespoon fresh chopped chives",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 307 kcal",
        "Carbs > 4.1 g",
        "Cholesterol > 86 mg",
        "Fat > 24.5 g",
        "Protein > 15.8 g",
        "Sodium > 288 mg"
    ],
    "n": "Chef John's Classic Beef Stroganoff",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"This is a fairly lean version of beef stroganoff, as most recipes call for more cream. This is something you can easily adjust to your tastes. I like a little thicker version, with just enough sauce to coat the meat and noodles.\"",
    "ins": "Season beef generously with salt and pepper.\nHeat oil in a large skillet over high heat until nearly smoking. Stir in beef; cook, stirring constantly, for 6-7 minutes, until liquid evaporates and meat browns. Remove meat from the pan and set aside.\nStir butter, mushrooms and onions into the pan; cook and stir over medium heat until the vegetables are lightly browned. Add garlic and stir for 30 seconds. Stir in flour; cook for 1-2 minutes until incorporated.\nStir in wine and 1 cup of stock, scraping the bottom of the pan to release any browned bits. Bring to a simmer, cook for 3-4 minutes, until the sauce thickens.\nReturn beef to the pan. Stir in remaining cup of stock; bring to a simmer and cook on low heat for about 1 hour with the lid on, until the beef is tender and the sauce is thick. Stir every 20 minutes.\nStir in creme fraiche. Stir in chives. Season with salt and pepper to taste.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4526208.jpg",
    "o": "4526208.jpg,4516312.jpg,4510205.jpg,4509891.jpg,4509889.jpg,4475999.jpg",
    "st": "allrecipes"
}