{
    "id": 220092,
    "old_rating": "4.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 cups water",
        "1 leek, halved lengthwise",
        "1 carrot, halved",
        "1 (3 inch) piece fresh ginger, peeled",
        "1 teaspoon whole black peppercorns",
        "2 bone-in chicken breast halves, skin removed",
        "2 1/3 cups all-purpose flour",
        "1/8 teaspoon salt",
        "2 eggs, beaten",
        "1 tablespoon butter",
        "1/3 cup milk, or as needed",
        "2 chicken bouillon cubes, crumbled",
        "3 tablespoons finely chopped fresh ginger",
        "3/4 cup peeled and sliced carrots",
        "1 cup sliced celery",
        "1/4 cup cornstarch",
        "1/4 cup cold water"
    ],
    "nut": [
        "Calories > 240 kcal",
        "Carbs > 37.2 g",
        "Cholesterol > 68 mg",
        "Fat > 4.1 g",
        "Protein > 12.6 g",
        "Sodium > 410 mg"
    ],
    "n": "Comforting Chicken Noodle Soup",
    "a": "shasty",
    "r": "0",
    "s": 8,
    "des": "\"A combination of several recipes I've made over the years to make this warm, comforting soup. Great for warm days, sick days, or just any day. I sometimes serve this with mashed potatoes as well! The more flour on the pasta from rolling it out, the thicker your soup will be.\"",
    "ins": "Pour 10 cups of water into a large soup pot over high heat with the leek, halved carrot, 3-inch piece of ginger, and peppercorns.\nBring to a boil, turn heat to medium-low, and place chicken breasts into the broth\nCover the pot with a lid and simmer the mixture until the chicken is cooked through and tender, 20 to 30 minutes.\nWhile broth is simmering, whisk flour and salt together in a bowl; beat in the eggs, butter, and enough milk to make a stiff but workable dough.\nKnead the dough in the bowl until smooth and slightly springy, about 5 minutes; transfer to a bowl, cover with a cloth, and allow to rest for 10 minutes.\nRoll the noodle dough out on a floured surface to desired thickness (1/4- to 1/8-inch thick); cut into strips.\nRemove chicken breasts, transfer them to a plate, and allow to cool. When cool, remove the bones and shred the meat with a fork.\nStrain and retain the broth; discard spent leek, halved carrot, ginger chunk, and peppercorns.\nPlace strained broth into a large soup pot, bring to a boil, and reduce heat to medium-low. Stir in bouillon cubes, 3 tablespoons of chopped ginger, 3/4 cup sliced carrots, and celery until the bouillon has dissolved. Simmer until the carrots are tender, about 30 minutes.\nGently stir in the noodles, a few at a time. Return broth to a simmer and cook until the noodles are tender, about 10 minutes.\nWhisk cornstarch and 1/4 cup of water until smooth; stir half the mixture into the soup and simmer until thickened, about 3 minutes. If thicker soup is desired, stir in remaining cornstarch mixture. Mix in the chicken to serve.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "788662.jpg",
    "o": "",
    "st": "allrecipes"
}