{
    "id": 220108,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (4 pound) bone-in pork shoulder roast",
        "1 (32 ounce) carton chicken broth",
        "2 cups water, or as needed to cover",
        "2 chicken bouillon cubes",
        "4 teaspoons seasoned salt (such as LAWRY'SÂ®)",
        "2 tablespoons Cajun seasoning",
        "1 tablespoon onion powder",
        "1/4 cup butter",
        "3 large heads bok choy - large outer leaves and base trimmed off, heads thickly sliced",
        "2 bunches fresh cilantro leaves, chopped - divided",
        "1 cup water",
        "2 (8 ounce) packages dried flat rice noodles",
        "crushed red pepper flakes to taste",
        "grated Parmesan cheese to taste",
        "lime wedges"
    ],
    "nut": [
        "Calories > 321 kcal",
        "Carbs > 28.6 g",
        "Cholesterol > 72 mg",
        "Fat > 13.7 g",
        "Protein > 20.4 g",
        "Sodium > 1270 mg"
    ],
    "n": "Pork Yaka Mein a la Dug",
    "a": "dugpark",
    "r": "0",
    "s": 12,
    "des": "\"My spin on 'yaka mein soup' with pork and bok choy. It's a family favorite (for our gluten-free family). Everyone from my 5-year-old to my wife and I can't get enough, especially on a cold or grey day. This recipe generally makes enough for us to have two meals for five people with some lunches left over. Serve with condiments including crushed red pepper flakes, Parmesan cheese, and lime wedges.\"",
    "ins": "Place the pork roast into a slow cooker, pour in the chicken broth, and add 2 cups water or enough to completely cover the roast.\nMix in bouillon cubes, seasoned salt, Cajun seasoning, onion powder, and butter.\nSet cooker on Low and cook until the meat has fallen off the bone, 8 to 10 hours.\nRemove the meat from the broth and shred the pork with two forks; set the meat aside.\nStrain the broth through a fine-mesh strainer, discarding the bones; pour broth into a large pot and bring to a boil. Reduce heat to low and stir the shredded pork back into the broth.\nIf desired, skim excess fat from broth with a large spoon.\nStir in the bok choy, about 3/4 of the chopped cilantro leaves, and 1 cup water. Set aside remaining cilantro leaves for garnish. Simmer the soup while you prepare the rice noodles.\nPlace rice noodles into a large bowl and cover with very hot tap water. Stir to separate the noodles and allow to soak until translucent, 25 to 30 minutes. Drain the noodles.\nTo serve, place about 1/2 cup of rice noodles into a bowl and ladle the soup over the noodles. Sprinkle with reserved cilantro, crushed red pepper flakes, and Parmesan cheese to taste; serve with lime wedges.",
    "pt": "20 m",
    "ct": "8 h",
    "tt": "8 h ",
    "i": "2147259.jpg",
    "o": "",
    "st": "allrecipes"
}