{
    "id": 220106,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package cream cheese",
        "2/3 cup confectioners' sugar",
        "1/4 cup strawberry preserves",
        "1/2 cup dry biscuit mix",
        "2 tablespoons white sugar",
        "2 tablespoons cold butter",
        "2 cups dry biscuit mix",
        "3/4 cup white sugar",
        "2/3 cup milk",
        "1 egg",
        "1/3 cup butter, melted",
        "1/4 cup chopped pecans"
    ],
    "nut": [
        "Calories > 718 kcal",
        "Carbs > 86 g",
        "Cholesterol > 112 mg",
        "Fat > 39.3 g",
        "Protein > 8.9 g",
        "Sodium > 863 mg"
    ],
    "n": "Strawberry Cheesecake Muffins II",
    "a": "jmacsaunders",
    "r": "0",
    "s": 6,
    "des": "\"A moist white cake muffin with a wonderful strawberry cheesecake inside, and a crumb topping with pecans on top.\"",
    "ins": "Cream together the cream cheese and confectioners' sugar in a bowl.\nShape the cream cheese mixture into a log, then wrap with plastic wrap and place in the freezer.\nPlace the strawberry preserves in a small bowl and freeze while preparing the remaining ingredients.\nPlace 1/2 cup biscuit mix and 2 tablespoons white sugar in a bowl.\nCut 2 tablespoons cold butter into the biscuit mix-sugar mixture with a knife or pastry blender until the mixture resembles coarse crumbs; refrigerate crumb mixture.\nPreheat an oven to 375 degrees F (190 degrees C).\nLine 6 extra large muffin cups with paper liners.\nWhisk together 2 cups biscuit mix, 3/4 cup white sugar, milk, egg, and 1/3 cup of melted butter in a bowl.\nFill each prepared muffin cup half full of batter. Reserve remaining batter.\nDivide the cold strawberry preserves evenly over the batter.\nCut the cold cream cheese log into 6 equal pieces, and place each piece on top of the strawberry preserves.\nTop each muffin cup with remaining batter.\nSprinkle muffins with the crumb mixture and chopped pecans.\nBake in the preheated oven until golden brown, about 25 minutes.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "4476318.jpg",
    "o": "",
    "st": "allrecipes"
}