{
    "id": 220119,
    "old_rating": "4.92308",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (3 ounce) package dry crab boil (such as Zatarain'sÂ® Crab & Shrimp Boil)",
        "5 small lobster tails",
        "1 (15 ounce) package double crust ready-to-use pie crust (such as PillsburyÂ®)",
        "5 tablespoons butter",
        "1/2 cup diced onion",
        "1/2 cup diced celery",
        "1/3 cup all-purpose flour",
        "1 1/2 cups chicken broth",
        "3/4 cup milk",
        "1 teaspoon seafood seasoning, such as Old Bayâ„¢",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon freshly ground black pepper",
        "1 1/2 cups frozen mixed vegetables, thawed",
        "1/2 cup diced potato"
    ],
    "nut": [
        "Calories > 587 kcal",
        "Carbs > 46.7 g",
        "Cholesterol > 119 mg",
        "Fat > 33.1 g",
        "Protein > 25.8 g",
        "Sodium > 1058 mg"
    ],
    "n": "Lew's Famous Lobster Pot Pie",
    "a": "AUSTINNETWORK",
    "r": "0",
    "s": 6,
    "des": "\"What's better than chicken pot pie? Lobster Pot Pie!! Wonderful and comforting pot pie that all your family and friends will ask for again and again.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nBring water and crab boil bag to a boil in a large saucepan.\nStir in lobster tails and boil until they turn bright red and the meat becomes opaque, 5 to 8 minutes.\nDrain and cool lobster tails. Remove shells, and dice lobster meat. Transfer to a bowl.\nPlace a pie crust into the bottom of a 9-inch pie pan and set aside.\nHeat butter in a skillet over medium heat.\nCook and stir onion and celery in butter until tender, 5 to 8 minutes.\nStir flour into onion and celery mixture until vegetables are coated with flour.\nCombine chicken broth and milk in a bowl.\nSlowly stir broth and milk into onion, celery, and flour mixture until thickened.\nStir seafood seasoning, garlic powder, and ground black pepper into thickened sauce.\nMix thawed vegetables, diced potato, and cooked lobster meat into the sauce; simmer until potato is tender, about 8 minutes.\nPour lobster filling into the prepared pie crust.\nCover with remaining pie crust ,and seal by crimping the edges of the two crusts together.\nCut an 'X' into top of pie crust with a sharp knife to allow steam to escape during baking.\nBake pie in the preheated oven until crust is golden brown, 40 to 45 minutes.\nRemove from oven and let stand for 10 to 15 minutes to allow sauce to thicken.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "794849.jpg",
    "o": "",
    "st": "allrecipes"
}