{
    "id": 220122,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 quart vegetable oil for frying",
        "1 cup gluten free pancake mix (such as Arrowhead MillsÂ®)",
        "1/2 cup finely chopped onions",
        "1/2 cup finely chopped celery",
        "1/2 cup unsweetened shredded coconut",
        "1/2 cup crushed gluten free crackers (such as GlutinoÂ®)",
        "1 lobster tail, shelled, cleaned, and chopped",
        "1 tablespoon seafood seasoning (such as Old BayÂ®)",
        "1 1/4 teaspoons baking powder",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "2 eggs",
        "1/2 cup evaporated milk",
        "1 tablespoon garlic butter, melted"
    ],
    "nut": [
        "Calories > 444 kcal",
        "Carbs > 38.9 g",
        "Cholesterol > 98 mg",
        "Fat > 28.1 g",
        "Protein > 10.7 g",
        "Sodium > 1231 mg"
    ],
    "n": "Lion's Den Lobster Fritters (Gluten Free)",
    "a": "stanielcaysarah",
    "r": "0",
    "s": 6,
    "des": "\"Lobster, melted garlic butter, and shredded unsweetened coconut are this recipe's tasty ingredients. \nOur home in the Bahamas is called the Lion's Den and that is where this recipe was born. Hubby & I live on a small out-island in the Bahamas and it can be difficult to get gluten free items unless I bring them from the States. I have learned to make the things that I crave out of the ingredients I have on hand. Serve with your favorite dipping sauces or ketchup.\"",
    "ins": "Heat oil in a large pot or deep fryer to 365 degrees F (185 degrees C).\nCombine gluten free pancake mix, onions, celery, coconut, gluten free crackers, lobster meat, seafood seasoning, baking powder, salt, and ground black pepper in a bowl.\nCombine eggs, evaporated milk, and butter in a separate bowl.\nStir egg mixture into dry mixture to form a batter.\nDrop batter by rounded tablespoons into hot oil and fry until golden brown, about 3 minutes.\nRemove and drain fritters on a rack.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "1411336.jpg",
    "o": "",
    "st": "allrecipes"
}