{
    "id": 220100,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup teriyaki sauce",
        "2 cloves garlic, minced",
        "1 (1 inch) piece fresh ginger, grated",
        "1/4 teaspoon crushed red pepper flakes",
        "1 pound skinless, boneless chicken breast halves - cut into bite-size pieces",
        "30 4x4-inch squares aluminum foil, or as needed",
        "oil for deep frying"
    ],
    "nut": [
        "Calories > 119 kcal",
        "Carbs > 2.2 g",
        "Cholesterol > 22 mg",
        "Fat > 8.3 g",
        "Protein > 8.6 g",
        "Sodium > 479 mg"
    ],
    "n": "Paper-Wrapped Chicken",
    "a": "witchywoman",
    "r": "0",
    "s": 12,
    "des": "\"I eat this quite a bit at our local Chinese restaurants, so I recreated it at home and made it even tastier. These are time-consuming, and I recommend using oil in the deep fryer that is ready to change as the marinade will ruin it for cooking anything else. I've also done this technique successfully with squid. I've also added in very thinly sliced onion and green peppers to the marinade and it was really good.\"",
    "ins": "Mix the teriyaki sauce, garlic, ginger, and red pepper flakes in a bowl; stir in the chicken pieces until thoroughly coated.\nCover the bowl and refrigerate the chicken 3 to 4 hours to overnight.\nRemove a piece of chicken from the marinade and place into the center of an aluminum square.\nFold the square diagonally over the chicken piece in a triangle shape; fold up the open edges of the triangle several times and press tightly together to seal the chicken into the foil. Repeat with remaining chicken pieces. Discard the used marinade.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nGently add the sealed foil packets to the hot oil and fry until the chicken is tender and cooked through, 2 to 4 minutes. Drain the packets on paper towels and allow to cool slightly.\nTo serve, tear open the packets along the sealed edges.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "4 h",
    "i": "1148053.jpg",
    "o": "",
    "st": "allrecipes"
}