{
    "id": 220104,
    "old_rating": "4.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package cream cheese",
        "1/2 cup confectioners' sugar",
        "2 teaspoons vanilla extract",
        "12 large fresh strawberries, hulled",
        "2 tablespoons graham cracker crumbs",
        "2 (1 ounce) squares semisweet chocolate chips (optional)",
        "1 teaspoon canola oil (optional)"
    ],
    "nut": [
        "Calories > 123 kcal",
        "Carbs > 10.8 g",
        "Cholesterol > 21 mg",
        "Fat > 8.4 g",
        "Protein > 1.8 g",
        "Sodium > 61 mg"
    ],
    "n": "Strawberry Cheesecake Bites",
    "a": "Alex",
    "r": "0",
    "s": 12,
    "des": "\"Strawberries are stuffed with a cream cheese filling for a cute two-bite dessert. Can be prepared the night before, but not much earlier than that as the berries may become soggy.\"",
    "ins": "Line a baking sheet with waxed paper.\nBeat together the cream cheese, confectioners' sugar, and vanilla extract in a bowl until smooth.\nSpoon the mixture into a piping bag fitted with a large round tip.\nWith a sharp paring knife, cut a cone shape out of the top of each strawberry to leave a small hollow.\nPipe about 1 tablespoon of the cream cheese filling into each strawberry, making sure that the filling overflows a bit out of the top of the strawberry.\nPlace the graham cracker crumbs into a shallow bowl. Dip the filled side of the strawberry into the graham cracker crumbs, coating the exposed filling with crumbs.\nMelt the chocolate and canola oil in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each interval, until warm and smooth, 1 to 3 minutes (depending on your microwave).\nDip the unfilled ends of the strawberries into the melted chocolate and place on the prepared baking sheet; refrigerate until set.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "45 m",
    "i": "1341581.jpg",
    "o": "4521410.jpg,4504000.jpg,4503970.jpg,4486127.jpg,4473696.jpg,4404554.jpg",
    "st": "allrecipes"
}