{
    "id": 220109,
    "old_rating": "4.28571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "2 cups chopped celery",
        "2 cups chopped onion",
        "2 cups chopped green bell pepper",
        "2 cups chopped carrot",
        "6 cloves garlic, chopped",
        "4 (14.5 ounce) cans whole peeled tomatoes with liquid, chopped",
        "4 cups water",
        "2 tablespoons chicken bouillon granules",
        "2 bay leaves",
        "1 tablespoon red pepper flakes (optional)",
        "1 tablespoon smoked paprika (optional)",
        "1 pinch saffron (optional)",
        "1 pinch dried oregano, or to taste (optional)",
        "1 pinch dried basil, or to taste (optional)",
        "1 pinch dried thyme, or to taste (optional)",
        "1 orange, zested (optional)",
        "1 (8 ounce) bottle clam juice (optional)",
        "1 cup white wine (optional)",
        "salt and ground black pepper to taste",
        "6 1-pint canning jars with lids and rings"
    ],
    "nut": [
        "Calories > 49 kcal",
        "Carbs > 6.9 g",
        "Cholesterol > < 1 mg",
        "Fat > 1.5 g",
        "Protein > 1.2 g",
        "Sodium > 229 mg"
    ],
    "n": "Basic Creole Sauce",
    "a": "NancySacTown",
    "r": "0",
    "s": 24,
    "des": "\"I cook a big batch of this sauce and keep in the freezer for when I need to pull together a quick dinner party or supper for my family. Just reheat and add a combination of shrimp, sausage, or chicken and serve over hot rice. Add in a combination of the optional ingredients to make it your own. You will have a meal fit for company.\"",
    "ins": "Heat olive oil in a large pot over medium heat. Stir in celery, onion, green bell pepper, carrot, and garlic; cook and stir until the vegetables are tender, about 10 minutes.\nStir tomatoes with their juice, water, chicken bouillon cubes, and bay leaves into the vegetable mixture.\nStir in red pepper flakes, smoked paprika, saffron, oregano, basil, thyme, orange zest, clam juice, and white wine.\nBring the sauce to a boil, reduce heat to low, and simmer until the flavors have blended, at least 1 hour. Season to taste with salt and black pepper.\nAllow the sauce to cool completely.\nTo store, pour into pint glass canning jars, cover with lids and rings, and place into freezer. Sauce can be frozen up to 3 months before using.",
    "pt": "45 m",
    "ct": "1 h",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}