{
    "id": 220196,
    "old_rating": "4.57692",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons olive oil",
        "1 cup coarsely chopped onion",
        "1/2 cup diced celery",
        "3/4 cup chopped green bell pepper",
        "3/4 cup chopped red bell pepper",
        "2 cloves garlic, minced",
        "1/2 teaspoon cayenne pepper",
        "1 pound andouille sausage, diced",
        "3 cups frozen corn kernels, thawed",
        "2 bay leaves",
        "2 teaspoons dried thyme",
        "6 cups low-sodium chicken broth",
        "3 Yukon Gold potatoes, cut into 1/2-inch cubes",
        "1 cup heavy cream",
        "salt and ground black pepper to taste",
        "1/2 cup chopped cilantro"
    ],
    "nut": [
        "Calories > 439 kcal",
        "Carbs > 28.2 g",
        "Cholesterol > 77 mg",
        "Fat > 31.7 g",
        "Protein > 13.3 g",
        "Sodium > 627 mg"
    ],
    "n": "Andouille Sausage and Corn Chowder",
    "a": "Wyattdogster",
    "r": "0",
    "s": 8,
    "des": "\"This is a slightly spicy, smoky, hearty corn chowder. The recipe was given to me by a dear friend many years ago and the original source is unknown. I have adapted it to suit my family's tastes. If you prefer a thicker chowder, you can stir in a can of creamed corn. Serve this with cornbread or a crusty French loaf for a lovely meal, enjoy!\"",
    "ins": "Heat olive oil in a large pot over medium-high heat. Cook and stir onion, celery, green bell pepper, and red bell pepper in the hot oil until softened, about 5 minutes.\nStir garlic, cayenne pepper, and diced andouille sausage into the onion mixture; continue to cook and stir until the sausage is hot, 1 to 2 minutes more.\nFold corn kernels and bay leaves into the sausage mixture; season with thyme. Allow the mixture to simmer until the corn is warmed, about 1 minute.\nPour chicken broth into the pot; bring the mixture to a boil, reduce heat to medium-low, and cook at a simmer, stirring occasionally, about 30 minutes.\nStir potatoes and heavy cream to the pot, place a cover on the pot, and continue cooking at a simmer until the potatoes are tender, about 20 minutes.\nSeason the chowder with salt and black pepper.\nRemove and discard the bay leaves.\nGarnish with cilantro to serve.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1620455.jpg",
    "o": "4048653.jpg,4005058.jpg,3550376.jpg,2002113.jpg,972747.jpg,952182.jpg",
    "st": "allrecipes"
}