{
    "id": 220184,
    "old_rating": "4.04167",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds fresh broccoli",
        "3 cloves garlic, mashed into a paste",
        "2 tablespoons lemon juice",
        "2 tablespoons rice vinegar",
        "1/2 teaspoon Dijon mustard",
        "1 pinch red pepper flakes, or to taste",
        "1 pinch salt and ground black pepper, or to taste",
        "1/3 cup olive oil"
    ],
    "nut": [
        "Calories > 223 kcal",
        "Carbs > 12.9 g",
        "Cholesterol > 0 mg",
        "Fat > 18.6 g",
        "Protein > 5 g",
        "Sodium > 73 mg"
    ],
    "n": "Easy Broccoli Salad",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"This simple broccoli salad kicks up ordinary broccoli with some lemon and red pepper flakes.\"",
    "ins": "Trim bottoms of broccoli stems and cut off broccoli heads; cut the broccoli heads into quarters. Peel broccoli stems and cut into quarters crosswise.\nBring a large pot of lightly salted water to a boil; reduce heat to medium and cook broccoli until tender when cut with a paring knife but still slightly firm, 5 to 6 minutes.\nTransfer broccoli to a large bowl filled with cold water and chill to stop the cooking process. Drain well. Arrange broccoli in a colander with the florets facing down towards the holes of the colander and allow broccoli to drip for at least 30 minutes.\nWhisk together garlic, lemon juice, rice vinegar, Dijon mustard, red pepper flakes, salt, and black pepper together in a large serving bowl. Slowly drizzle in olive oil while whisking rapidly until the dressing is thick and creamy. Adjust salt, black pepper, and crushed red pepper flakes to taste.\nToss broccoli with the dressing; let stand 5 to 10  minutes to marinate, then toss again. Can be refrigerated up to an hour if you want to serve the salad cold.",
    "pt": "15 m",
    "ct": "5 m",
    "tt": "50 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}