{
    "id": 220167,
    "old_rating": "4.68182",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 potatoes",
        "salt to taste",
        "2 tablespoons olive oil",
        "1 onion, minced",
        "1 green bell pepper, minced",
        "2 teaspoons crushed garlic",
        "1 1/2 pounds lean ground beef",
        "2 cups dry red wine",
        "1 (15 ounce) can tomato sauce",
        "2/3 cup pimiento-stuffed green olives, drained and chopped",
        "1/2 cup capers, drained",
        "1/4 cup golden raisins",
        "1 teaspoon ground cumin",
        "1 pinch dried oregano",
        "1/4 teaspoon black pepper",
        "1/4 teaspoon salt",
        "1 teaspoon olive oil"
    ],
    "nut": [
        "Calories > 471 kcal",
        "Carbs > 29.6 g",
        "Cholesterol > 79 mg",
        "Fat > 22 g",
        "Protein > 26 g",
        "Sodium > 1338 mg"
    ],
    "n": "Cuban-Style Picadillo",
    "a": "lutzflcat",
    "r": "0",
    "s": 6,
    "des": "\"There are many variations of picadillo. This is a savory and traditional Cuban home-cooked meal with ingredients that are readily available in any supermarket. Do not omit wine, as it's really important to the flavor of this dish. Serve with garlic and onion white rice, black beans, and fried ripe plantains. Garnish with strips of ham and roasted red pepper.\"",
    "ins": "Place the potatoes into a large pot with enough water to cover; season with salt. Bring the water to a boil; reduce heat to medium-low, place a cover on the pot, and cook the potatoes at a simmer until tender, about 20 minutes. Drain and set aside to cool.\nHeat 2 tablespoons olive oil in a large Dutch oven over medium heat; cook and stir the onion, green bell pepper, and garlic in the hot oil until the vegetables soften, about 5 minutes.\nCrumble the ground beef into the onion mixture, breaking the meat into smaller pieces as you mix; cook and stir until the beef is completely browned, 7 to 10 minutes. Drain as much fat from the mixture as possible.\nStir the red wine, tomato sauce, olives, capers, golden raisins, cumin, oregano, black pepper, and 1/4 teaspoon salt into the ground beef mixture. Bring to a boil, reduce heat to medium-low, and cook at a simmer until the wine had reduced significantly, 25 to 30 minutes.\nPeel the cooled potatoes and cut into chunks.\nHeat 1 teaspoon olive oil in a skillet over medium heat. Cook the potatoes in the hot oil until browned, about 5 minutes.\nGently fold the cooked potatoes into the simmering ground beef mixture; cook together 5 minutes.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1312850.jpg",
    "o": "",
    "st": "allrecipes"
}