{
    "id": 220129,
    "old_rating": "4.79104",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 teaspoons active dry yeast",
        "4 1/2 cups all-purpose flour, divided",
        "1/2 cup warm water (100 degrees F or 38 degrees C)",
        "1 (12 fluid ounce) can or bottle beer",
        "1 1/2 teaspoons fine salt",
        "all-purpose flour for dusting",
        "1 tablespoon cornmeal"
    ],
    "nut": [
        "Calories > 154 kcal",
        "Carbs > 30.9 g",
        "Cholesterol > 0 mg",
        "Fat > 0.4 g",
        "Protein > 4.3 g",
        "Sodium > 235 mg"
    ],
    "n": "No Knead Beer Bread",
    "a": "Chef John",
    "r": "0",
    "s": 15,
    "des": "\"This really is an easy, fun, and fast recipe, and you'll be amazed at how great the results are, even for the most inexperienced bread maker.\"",
    "ins": "Stir together yeast, 1/2 cup flour and warm water in a large bowl. Cover and let sit in a warm spot for about 30 minutes.\nStir beer, remaining flour and salt into the bowl. Mix until all the flour is incorporated and forms a thick sticky dough that pulls away from the sides of the bowl. Cover and let rise in a warm spot for 2 hours, until doubled in size.\nScrape all the dough from the bowl with a rubber spatula, and place on a well-floured surface. Generously flour the top of the dough and form into a loaf shape.\nSprinkle a baking sheet with cornmeal. Transfer loaf to the baking sheet and sprinkle the top with flour. Cover loosely with a towel and let rise for 30-40 minutes.\nPreheat the oven to 425 degrees F (220 degrees C).\nPlace a small loaf pan of warm water on a lower rack to humidify the oven.\nSlash a long slit in the top of the loaf with a sharp knife or razor. Place the baking sheet on the rack above the pan of warm water in the oven. Bake for 35 minutes, until the loaf is golden brown.\nTransfer to a cooling rack. Let cool completely before slicing and serving.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "3 h ",
    "i": "4487302.jpg",
    "o": "4487302.jpg,4485187.jpg,4484043.jpg,4470983.jpg,4459047.jpg,4436795.jpg",
    "st": "allrecipes"
}