{
    "id": 220178,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "2 small eggplants, thinly sliced",
        "1 pound ground turkey",
        "1 teaspoon Creole-style seasoning (such as Emeril's EssenceÂ®)",
        "1 tablespoon minced garlic",
        "1 (8 ounce) can crushed tomatoes",
        "1 (26 ounce) jar herb garlic tomato sauce",
        "1 teaspoon crushed red pepper",
        "2 (16 ounce) packages frozen mixed vegetables, thawed",
        "1 (8 ounce) package shredded Mozzarella cheese",
        "1 (8 ounce) package shredded Provolone cheese",
        "1/2 cup grated Parmesan cheese",
        "1 (15 ounce) container ricotta cheese",
        "4 egg whites",
        "1/4 cup low-fat (2%) milk",
        "1 teaspoon Italian seasoning"
    ],
    "nut": [
        "Calories > 505 kcal",
        "Carbs > 32.7 g",
        "Cholesterol > 104 mg",
        "Fat > 25.2 g",
        "Protein > 40.5 g",
        "Sodium > 1283 mg"
    ],
    "n": "Irresistible Eggplant Lasagna",
    "a": "Aimee Louise Hertzog",
    "r": "0",
    "s": 8,
    "des": "\"A delicious lasagna using eggplant in place of noodles!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nCook and stir olive oil and eggplant in a skillet over medium-high heat until browned, 5 to 7 minutes. Add water if needed to prevent burning. Set aside.\nSeason ground turkey with Creole seasoning; cook and stir in a pot over medium heat until browned, about 10 minutes.\nStir garlic, crushed tomatoes, tomato sauce, crushed red pepper, and mixed vegetables into ground turkey; simmer 10 minutes.\nCombine Mozzarella cheese, Provolone cheese, and Parmesan cheese in a bowl.\nCombine ricotta cheese, egg whites, milk and Italian seasoning in a separate bowl.\nPour half of tomato sauce into a 13x9 baking dish.\nLayer half of eggplant on top of sauce layer.\nSpoon half of ricotta mixture on top of eggplant.\nSprinkle half of Mozzarella mixture on top of ricotta mixture.\nRepeat layering process with the remaining ingredients.\nCover baking dish with aluminum foil and place pan on baking sheet in case of drips.\nBake in preheated oven for 30 minutes. Remove cover; bake another 15 minutes, until cheese is browned and bubbly.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}