{
    "id": 220113,
    "old_rating": "4.82143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 slices bacon",
        "1 tablespoon bacon drippings",
        "3 tablespoons butter",
        "1 cup chopped onion",
        "1/2 cup diced celery",
        "1/2 cup diced green bell pepper",
        "1/2 cup diced red bell pepper",
        "1 tablespoon minced fresh thyme",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/4 cup minced fresh parsley",
        "1 pinch Creole seasoning, or to taste",
        "5 cloves garlic, minced",
        "1/2 cup beef broth",
        "1 (20 ounce) package frozen corn kernels"
    ],
    "nut": [
        "Calories > 197 kcal",
        "Carbs > 25.1 g",
        "Cholesterol > 21 mg",
        "Fat > 10.3 g",
        "Protein > 5.1 g",
        "Sodium > 608 mg"
    ],
    "n": "Melody's Corn Maque Choux",
    "a": "Melody Dumplin",
    "r": "0",
    "s": 6,
    "des": "\"A common Creole dish that can be served as a side dish to any combination of meat and potatoes, pasta, or rice dishes. A flavorful complement. Prep time depend on whether or not you chop  your own seasonings or use frozen pre-chopped seasonings. Cook time depends on how long it takes to prepare and cook the rest of the meal. Number of servings depends on how much everybody likes it.\"",
    "ins": "Cook bacon in a skillet over medium, turning occasionally, until evenly browned and crisp, about 10 minutes; drain on paper towels. Reserve 1 tablespoon bacon drippings.\nAllow bacon to cool; crumble and set aside.\nMelt butter with the bacon drippings in a large saucepan over medium heat. Cook and stir onion, celery, green bell pepper, red bell pepper, thyme, salt, black pepper, parsley, and Creole seasoning in the butter mixture until onion is translucent, about 8 minutes.\nStir in garlic and cook until fragrant, about 2 more minutes.\nMix in beef broth and corn; bring to a boil.\nCover the saucepan and reduce heat to low; simmer until broth is nearly evaporated and vegetables are tender, about 20 more minutes. Stir in crumbled bacon. Dish can be simmered longer or held over low heat if desired.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "2382776.jpg",
    "o": "3663622.jpg,2436114.jpg,966189.jpg,965661.jpg,965127.jpg,964335.jpg",
    "st": "allrecipes"
}