{
    "id": 220107,
    "old_rating": "4.84",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup mashed fresh strawberries",
        "1/2 cup white sugar",
        "2 tablespoons cornstarch",
        "1 cup water",
        "1 cup milk",
        "6 eggs",
        "1 (8 ounce) package cream cheese, softened",
        "1 teaspoon vanilla extract",
        "3/4 cup white sugar",
        "8 slices bread, cut in half diagonally",
        "1 teaspoon butter",
        "8 sliced fresh strawberries",
        "1 tablespoon confectioners' sugar for dusting",
        "1 cup whipped cream"
    ],
    "nut": [
        "Calories > 436 kcal",
        "Carbs > 52.7 g",
        "Cholesterol > 195 mg",
        "Fat > 21.1 g",
        "Protein > 10.3 g",
        "Sodium > 329 mg"
    ],
    "n": "Strawberry Cheesecake French Toast",
    "a": "Pamela Batovsky",
    "r": "0",
    "s": 8,
    "des": "\"French toast topped with glazed strawberries and stuffed with cheesecake. Soooo good and original. Perfect to impress at a brunch. Serve with mimosas for a fancier brunch-type setting, or just make it for a special Saturday morning breakfast for your family like I do. =)\"",
    "ins": "Preheat an oven to 100 degrees F ( 40 degrees C).\nHeat mashed strawberries and 1/2 cup white sugar in a saucepan over medium heat.\nMix cornstarch and water together in a bowl, then stir into the strawberries.\nCook and stir until thickened, about 5 minutes. Reduce heat to low and simmer while preparing remaining ingredients, stirring occasionally.\nWhisk together the milk and eggs in a bowl; set aside.\nMash cream cheese, vanilla extract, and 3/4 cup white sugar in a bowl until smooth.\nSpread the cream cheese mixture over a triangle-shaped piece of bread, and top with another piece. Repeat with remaining bread and cream cheese mixture to make 8 triangle-shaped sandwiches.\nHeat butter in a large skillet over medium heat.\nDip the sandwiches into the egg mixture, 2 or 3 at a time, and place in the skillet.\nCook until golden brown on both sides, about 3 minutes per side.\nTransfer pan-fried sandwiches to a baking sheet and place in the preheated oven to keep warm while cooking remaining sandwiches.\nTo serve, top French toast with warm strawberry glaze and sliced fresh strawberries and sprinkle with confectioners' sugar. Serve with a dollop of whipped cream.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "967843.jpg",
    "o": "4542604.jpg,4525263.jpg,4510023.jpg,4099998.jpg,3990538.jpg,3925266.jpg",
    "st": "allrecipes"
}