{
    "id": 220158,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (8 ounce) packages refrigerated crescent rolls",
        "1/2 cup mayonnaise",
        "2 tablespoons Dijon mustard",
        "1/2 teaspoon ground black pepper",
        "2 cups chopped cooked turkey",
        "1/2 cup sliced celery",
        "3 tablespoons chopped fresh parsley",
        "1/2 cup dried cranberries",
        "4 ounces shredded Swiss cheese",
        "1 egg, beaten"
    ],
    "nut": [
        "Calories > 472 kcal",
        "Carbs > 30.7 g",
        "Cholesterol > 68 mg",
        "Fat > 29.2 g",
        "Protein > 19.1 g",
        "Sodium > 679 mg"
    ],
    "n": "Turkey Cranberry Wreath Bake",
    "a": "Locke Cooking",
    "r": "0",
    "s": 8,
    "des": "\"This is one of our family favorites for leftover turkey.  Even my children's friends that are picky eaters love it. I've also used store-bought sliced turkey in place of leftovers, and it works great too.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nSeparate crescent roll dough into 16 triangles.\nPlace 8 dough triangles onto a large baking pan, arranging them in a circle with the wide ends together in the center. Pinch the corners of the wide ends together to join the circle.\nPlace a new dough triangle down next to an existing one with the pointed end towards the center. Pinch the two triangles together to make a rectangular-shaped petal. Repeat with remaining 7 triangles to make 8 rectangular dough petals in a circle.\nMix mayonnaise, Dijon mustard, and black pepper together in a bowl.\nLightly toss together cooked turkey, celery, parsley, cranberries, and Swiss cheese in a separate bowl. Stir the mayonnaise mixture into the turkey mixture until well combined.\nScoop up about 1/2 cup of turkey mixture and place at the bottom of a dough rectangle towards the center.\nFold the dough rectangle over the filling from the top towards the center, and pinch the top end down to enclose the filling in a ring-shaped piece of dough. Repeat with remaining filling.\nBrush the wreath with beaten egg.\nBake in the preheated oven until the filling is hot and the crescent roll dough is golden brown, 25 to 30 minutes.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "807098.jpg",
    "o": "807111.jpg,807109.jpg,807107.jpg,807106.jpg,807104.jpg,807103.jpg",
    "st": "allrecipes"
}