{
    "id": 220170,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup heavy cream",
        "1 (3 ounce) package cream cheese, softened",
        "1 tablespoon confectioners' sugar",
        "2 tablespoons milk",
        "1 1/2 teaspoons strawberry jam",
        "1 1/4 cups all-purpose flour",
        "1 3/4 teaspoons baking powder",
        "2 tablespoons white sugar",
        "1/2 teaspoon salt",
        "1/4 cup shortening",
        "1 egg yolk",
        "1/2 cup buttermilk",
        "12 toothpicks",
        "1/2 pound strawberries, cut into 1/2-inch slices",
        "1 tablespoon strawberry jam"
    ],
    "nut": [
        "Calories > 531 kcal",
        "Carbs > 51.1 g",
        "Cholesterol > 117 mg",
        "Fat > 33.3 g",
        "Protein > 8.6 g",
        "Sodium > 617 mg"
    ],
    "n": "Very Dairy Strawberry Shortcake Dip",
    "a": "geranium",
    "r": "0",
    "s": 4,
    "des": "\"This yummy dip recipe got its name because it includes four different kinds of dairy products! It is best served with mini strawberry shortcake skewers.\"",
    "ins": "Beat heavy cream in a large bowl with an electric mixer until stiff peaks form.\nCream together cream cheese, confectioners' sugar, milk, and 1 1/2 teaspoon strawberry jam in a separate large bowl.\nFold whipped cream into the cream cheese mixture.\nCover and refrigerate until ready to serve.\nPreheat an oven to 350 degrees F (175 degrees C).\nWhisk together flour, baking powder, white sugar, and salt in a large bowl.\nCut in shortening with a knife or pastry blender until the mixture resembles coarse crumbs.\nBeat together egg yolk and buttermilk in a small bowl, then stir into the flour mixture until moistened.\nTurn the dough out onto a lightly floured surface and knead for five or six turns. Pat or roll the dough out into a 1/2 inch thick round.\nCut dough out with a 1-inch biscuit cutter and place on a baking sheet.\nBake in the preheated oven until golden brown, 10 to 15 minutes.\nCool on the sheet for 10 minutes before removing to cool completely on a wire rack.\nCut the cooled biscuits in half .\nSkewer half a biscuit on a toothpick, followed by a strawberry slice and another biscuit half.\nSwirl 1 tablespoon strawberry jam decoratively into the chilled dip and serve with the strawberry shortcake skewers.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "967000.jpg",
    "o": "",
    "st": "allrecipes"
}