{
    "id": 220103,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (18.25 ounce) package white cake mix",
        "1 1/4 cups water",
        "1/2 cup vegetable oil",
        "3 eggs",
        "1/2 (3 ounce) package strawberry flavored Jell-OÂ®",
        "1 (14 ounce) can sweetened condensed milk",
        "1 (12 ounce) jar strawberry preserves",
        "1 (12 ounce) container cream cheese frosting",
        "1 (8 ounce) container frozen whipped topping, thawed"
    ],
    "nut": [
        "Calories > 491 kcal",
        "Carbs > 70.4 g",
        "Cholesterol > 43 mg",
        "Fat > 22 g",
        "Protein > 5 g",
        "Sodium > 322 mg"
    ],
    "n": "Strawberry Sweetheart Cake",
    "a": "CookinNurse",
    "r": "0",
    "s": 16,
    "des": "\"Dazzle your sweetie for Valentine's Day or any other day for that matter with this moist and easy treat!\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).\nLightly grease and flour a 9x9-inch square pan and a 9-inch round pan.\nStir together the cake mix, water, vegetable oil, and eggs together in a bowl until smooth.\nMix in the strawberry gelatin until combined.\nDivide the batter evenly between the 2 prepared pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 25 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\nTransfer the square cake onto a large platter.\nCut the round cake in half, then arrange the cut side of the cake along two edges of the square cake to create a heart shape.\nPoke several holes on the top of the cake using the handle of a wooden spoon or spatula.\nPour the sweetened condensed milk over the cake so that it runs into the holes; allow the milk to soak in.\nSpread the strawberry preserves on top of the cake.\nFold the cream cheese frosting into the whipped topping in a bowl until just incorporated.\nSpread the frosting over the top and sides of the cake.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "789041.jpg",
    "o": "",
    "st": "allrecipes"
}