{
    "id": 220249,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound farfalle (bow tie) pasta",
        "1 pound fresh asparagus - tough ends snapped off and spears halved crosswise",
        "cooking spray",
        "3 (10.75 ounce) cans cream of asparagus soup",
        "1 cup milk",
        "2 cooked chicken breast halved - thinly sliced",
        "1 (8 ounce) package shredded Cheddar-Monterey Jack cheese blend"
    ],
    "nut": [
        "Calories > 371 kcal",
        "Carbs > 33.4 g",
        "Cholesterol > 52 mg",
        "Fat > 17.1 g",
        "Protein > 21 g",
        "Sodium > 954 mg"
    ],
    "n": "Cheesy Chicken Asparagus Casserole",
    "a": "Jessica",
    "r": "0",
    "s": 8,
    "des": "\"This easy-to-make casserole was a hit at my house! I used leftovers for part of it, which is always a plus, and it all went together so well. As for the pasta, we had a mix of cooked bow ties, elbows and spirals and they worked great! My 16-month-old daughter loved it, and the leftovers reheated beautifully the next day. Hope you like it as much as we did!\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil. Stir in bow tie pasta and return to a boil. Cook uncovered, stirring occasionally, until tender but still slightly firm, about 12 minutes. Drain well and set aside.\nPlace asparagus into a large skillet with about 1 inch of water. Place over medium heat, bring to a boil, and reduce heat to low. Cover skillet and cook until asparagus pieces are bright green and tender, about 8 minutes; drain well and set aside.\nPreheat oven to 350 degrees F (175 degrees C).\nSpray a 9x13-inch baking dish with cooking spray.\nWhisk cream of asparagus soup with milk in a bowl until smooth.\nSpread the cooked bow tie pasta over the bottom of the baking dish.\nPour about 1/4 of the soup mixture over the pasta, stirring gently to coat pasta with soup.\nLay chicken breast slices over pasta.\nSpread the asparagus over the chicken slices.\nPour remaining soup mixture evenly over the casserole, being sure it soaks through to the bottom of the dish. Top casserole with shredded Cheddar-Monterey Jack cheese.\nBake in the preheated oven until the casserole is hot and the cheese topping is browned and bubbling, about 35 minutes.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "3731420.jpg",
    "o": "",
    "st": "allrecipes"
}