{
    "id": 220267,
    "old_rating": "4.81818",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil",
        "1 small onion, diced",
        "3 cups water",
        "7 cubes chicken bouillon",
        "1 large russet potato, cubed",
        "6 carrots, cubed",
        "3 cups milk",
        "1 (16 ounce) bag frozen broccoli florets",
        "2 cloves garlic, minced",
        "2 teaspoons dried chives",
        "1 bay leaf",
        "1 pinch cayenne pepper, or more to taste",
        "salt and ground black pepper to taste",
        "1 pound processed cheese food (such as Velveeta Â®), sliced"
    ],
    "nut": [
        "Calories > 223 kcal",
        "Carbs > 18.2 g",
        "Cholesterol > 29 mg",
        "Fat > 12 g",
        "Protein > 11.9 g",
        "Sodium > 1165 mg"
    ],
    "n": "Gail's Broccoli Soup",
    "a": "Crystal0",
    "r": "0",
    "s": 12,
    "des": "\"Heartier version of traditional broccoli cheese soup. We would serve this on Christmas Eve before church when I was a kid.\"",
    "ins": "Heat the vegetable oil in a large pot; cook and stir the onion in the hot oil until soft, 5 to 7 minutes.\nPour water and chicken bouillon cubes to the pot; cook and stir until the bouillon dissolves, about 4 minutes.\nStir the potato and carrot into the mixture in the pot; cook another 4 minutes.\nPour milk into the pot; add broccoli, garlic, chives, bay leaf, cayenne pepper, salt, and black pepper to the mixture, stir, and cook until warm, about 4 minutes.\nStir the sliced processed cheese food into the soup, bring to a simmer, and cook and stir until the cheese food is melted completely into the soup, about 5 minutes.\nReduce heat to medium-low and continue cooking until the potatoes and carrots are tender, 10 to 15 minutes.\nRemove and discard the bay leaf to serve.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "954461.jpg",
    "o": "",
    "st": "allrecipes"
}