{
    "id": 220241,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 tablespoons extra-virgin olive oil",
        "1 yellow potato, cut into small dice",
        "1/4 cup finely diced sweet onion",
        "2 teaspoons minced garlic",
        "1 pinch salt and ground black pepper to taste",
        "1/4 cup all-purpose flour",
        "1/2 pint raw oysters, cut into bite-size pieces and liquid reserved",
        "2 1/2 cups skim milk"
    ],
    "nut": [
        "Calories > 553 kcal",
        "Carbs > 55.6 g",
        "Cholesterol > 78 mg",
        "Fat > 24.1 g",
        "Protein > 28 g",
        "Sodium > 288 mg"
    ],
    "n": "Marshall's Dreamy Oyster Stew",
    "a": "ezfromwi",
    "r": "0",
    "s": 2,
    "des": "\"This recipe was originally a higher-fat recipe. But with age and ailments comes restraint and tradeoffs. To try the original recipe, use butter instead of extra-virgin olive oil and whole milk instead of skim. I am not much of a celery fan, especially in mild-flavored foods, but if you like celery, add small diced celery to taste along with the onion, garlic and potato. Serve with crackers of choice. I personally don't use crackers. I feel they detract from enjoying the mild desired flavor and creamy dreaminess.\"",
    "ins": "Heat olive oil in a saucepan over medium heat. Add potato, onion, and garlic to the hot oil, reduce heat to medium-low, and bring the mixture to a simmer. Place a lid on the saucepan and cook the mixture at a simmer, stirring occasionally, until the onion and potato soften, 5 to 7 minutes.\nSeason the potato mixture with salt and black pepper.\nStir flour into the mixture to make a roux. Increase heat to medium and stir the mixture constantly to cook the flour, 3 to 4 minutes.\nPour reserved oyster liquid into the potato mixture. Increase heat to medium-high.\nSlowly stream skim milk into the saucepan while stirring continually; cook and stir until the mixture begins to thicken and bubble, 5 to 7 minutes. Season again with salt and black pepper as needed.\nReduce heat to medium-low. Add oysters to the saucepan; continue to cook and stir until the mixture is thick and the oysters are just cooked through, about 3 minutes.\nTurn off the heat and continue to stir until you are sure soup will not boil after covered. Cover and let stand 10 minutes for the flavors to blend.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}