{
    "id": 220211,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup light olive oil",
        "3 cloves garlic, minced",
        "1 tablespoon chopped fresh basil",
        "1 1/2 teaspoons dried rosemary",
        "1 teaspoon ground thyme",
        "ground black pepper to taste",
        "4 skinless, boneless chicken breast halves",
        "7 ounces hard sourdough pretzels",
        "2/3 cup freshly shredded Parmesan cheese",
        "1 1/2 teaspoons dried parsley",
        "1/2 teaspoon garlic powder"
    ],
    "nut": [
        "Calories > 863 kcal",
        "Carbs > 41.5 g",
        "Cholesterol > 77 mg",
        "Fat > 64.3 g",
        "Protein > 34.4 g",
        "Sodium > 1137 mg"
    ],
    "n": "Pretzel and Parmesan Crusted Chicken",
    "a": "Terri May Stocke",
    "r": "0",
    "s": 4,
    "des": "\"This recipe was inspired by a wedding reception that I attended. The original was stuffed with a creamy white cheese (possibly Gouda).  I omitted the cheese on the inside, and instead opted to add Parmesan to the outside. This is delicious! Crunchy on the outside and moist on the inside. The measurements for the marinade are an estimate.\"",
    "ins": "Whisk together olive oil, minced garlic, basil, rosemary, thyme, and black pepper in a bowl.\nPlace chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the chicken with the smooth side of a meat mallet to a thickness of about 1 inch.\nTransfer chicken breasts to the bowl with the olive oil marinade; cover and refrigerate overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nPlace pretzels and Parmesan cheese into a food processor; pulse until the pretzels are finely crushed and combined with cheese.\nMix in parsley and garlic powder by pulsing once or twice. Transfer the mixture to a shallow dish.\nRemove chicken from the marinade, and shake off excess. Discard the remaining marinade.\nPress chicken into pretzel mixture, coating both sides.\nArrange coated chicken in a baking dish. Sprinkle about 1 tablespoon additional pretzel mixture on top.\nBake chicken breasts in the preheated oven until no longer pink in the center and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nCover chicken with a foil tent and allow to rest for 10 to 15 minutes before slicing and serving.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "8 h ",
    "i": "974913.jpg",
    "o": "",
    "st": "allrecipes"
}