{
    "id": 220245,
    "old_rating": "4.3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound fresh asparagus, trimmed",
        "2 (10.75 ounce) cans condensed cream of mushroom soup",
        "1 cup chicken broth",
        "1 (8 ounce) precooked ham steak, diced - divided",
        "1 cup crushed buttery round crackers",
        "1 cup frozen green beans",
        "1 cup French fried onions",
        "2 cups shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 556 kcal",
        "Carbs > 37.3 g",
        "Cholesterol > 43 mg",
        "Fat > 37 g",
        "Protein > 17 g",
        "Sodium > 1643 mg"
    ],
    "n": "My Asparagus Casserole",
    "a": "Tammi",
    "r": "0",
    "s": 8,
    "des": "\"I had some wonderful asparagus that I found at a farmer's market that I wanted to use as a main dish. I found a recipe for an asparagus casserole that looked intriguing. I didn't have as much fresh asparagus as the recipe called for, so I decided to add green beans to the mix, along with a few other items to really give this casserole a bit more substance. This was the best casserole of any kind that I think I've ever had. My husband hasn't been able to stop eating it either, even the next day!\"",
    "ins": "Place asparagus spears into a large skillet and pour in about 1 inch of water. Bring to a boil, cover skillet, and steam until the asparagus is very tender, about 20 minutes, adding more water if needed. Transfer to a plate and set aside.\nPreheat oven to 400 degrees F (200 degrees C).\nGrease a 2-quart casserole dish.\nLay the asparagus into the bottom of the prepared casserole dish.\nWhisk together cream of mushroom soup and chicken broth in a bowl; pour half the soup mixture over the asparagus.\nSprinkle in half the diced ham.\nSpread cracker crumbs evenly over the ham.\nSpread green beans over the cracker crumbs.\nPour remaining soup mixture over the casserole and sprinkle on the remaining ham.\nArrange French-fried onions over the top of the casserole, and cover the casserole with a lid.\nBake in the preheated oven until the casserole is bubbling, about 30 minutes.\nRemove from oven, and sprinkle Cheddar cheese over the casserole in an even layer.\nReturn to oven without covering casserole; bake until the cheese is melted, another 5 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "1982288.jpg",
    "o": "",
    "st": "allrecipes"
}