{
    "id": 220209,
    "old_rating": "4.572",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1/2 cup milk",
        "1/2 cup prepared ranch dressing",
        "1/2 cup all-purpose flour",
        "1 cup dry bread crumbs",
        "1/2 cup grated Parmesan cheese",
        "1/2 teaspoon seasoned salt",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon celery salt",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon onion powder",
        "1/2 teaspoon ground paprika",
        "1/2 teaspoon dried parsley",
        "1/4 teaspoon dried basil",
        "cooking spray",
        "8 (6 ounce) tilapia fillets"
    ],
    "nut": [
        "Calories > 357 kcal",
        "Carbs > 17.8 g",
        "Cholesterol > 71 mg",
        "Fat > 12.8 g",
        "Protein > 39.8 g",
        "Sodium > 550 mg"
    ],
    "n": "Baked Parmesan Tilapia",
    "a": "Mike",
    "r": "0",
    "s": 8,
    "des": "\"A quick and yummy way to prepare crispy tilapia the whole family will love, without frying. I get asked to make this several times a week by everyone in my family, especially the kids!\"",
    "ins": "Preheat an oven to 425 degrees F (220 degrees C).\nLine an 11-17-inch baking sheet with aluminum foil and lightly spray with cooking spray.\nMix milk and ranch dressing in a shallow bowl. Place flour in a separate shallow bowl; set aside.\nWhisk together bread crumbs, Parmesan cheese, seasoned salt, black pepper, celery salt, garlic powder, onion powder, paprika, parsley, and basil in a bowl.\nSpray bread crumb mixture with cooking spray until damp, then whisk bread crumbs. Repeat spraying and whisking 3 more times to lightly moisten crumb mixture with cooking spray.\nTransfer crumb mixture to a large resealable plastic bag.\nGently press tilapia fillets into the flour to coat, and shake off the excess flour.\nDip the fillets into the ranch dressing mixture.\nPlace all the fillets into the resealable plastic bag; seal bag and shake to coat fish with bread crumb mixture.\nArrange tilapia on prepared baking sheet. Lightly spray the breaded fish with cooking spray.\nBake in the preheated oven until the fish is easily flaked with a fork, 20 to 25 minutes.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "4508058.jpg",
    "o": "4508058.jpg,4474043.jpg,4469641.jpg,3923208.jpg,3880237.jpg,3709872.jpg",
    "st": "allrecipes"
}