{
    "id": 220270,
    "old_rating": "4.68966",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons salt, or as needed",
        "2 pounds eggplant, peeled and sliced into 1/2-inch rounds",
        "1 egg",
        "1/2 cup water",
        "1 cup matzo meal",
        "1 tablespoon olive oil",
        "1 large onion, chopped",
        "1 red bell pepper, chopped",
        "1 cup sliced mushrooms (optional)",
        "3 tablespoons olive oil, or as needed",
        "1 (26 ounce) jar tomato basil pasta sauce",
        "1 (8 ounce) package fresh part-skim mozzarella, sliced"
    ],
    "nut": [
        "Calories > 372 kcal",
        "Carbs > 35.4 g",
        "Cholesterol > 66 mg",
        "Fat > 19.5 g",
        "Protein > 17.6 g",
        "Sodium > 3860 mg"
    ],
    "n": "Jewish Eggplant Lasagna",
    "a": "Melissa Rand",
    "r": "0",
    "s": 5,
    "des": "\"This is a yummy and easy Jewish eggplant lasagna! Preparation can be done ahead of time, refrigerated and baked later in the day. Various colored peppers can be used to make the dish more attractive.\"",
    "ins": "Sprinkle salt over eggplant slices. Place in a colander or large bowl for 30 minutes and allow eggplant to release extra liquid.\nPreheat the oven to 350 degrees F (175 degrees C).\nRinse eggplant slices with cold water and lightly press dry with paper towels or a clean dish towel.\nWhisk egg and water in a bowl.\nMeasure matzo meal into a separate shallow bowl.\nDip eggplant slices into egg mixture and then press both sides into matzo meal. Set aside breaded eggplant; do not stack.\nHeat 1 tablespoon olive oil in a frying pan over medium heat; cook and stir onion, red bell pepper, and mushrooms in hot oil until lightly browned, 6 to 8 minutes. Remove and set aside.\nHeat 3 tablespoons of olive oil in the same frying pan over medium heat.\nPlace a layer of eggplant slices in the pan and cook until lightly browned, about 3 minutes. Flip and cook other side until browned, about 3 minutes, adding more olive oil as needed.\nSpread 1/2 cup of tomato basil sauce in bottom of a 9x13 baking dish.\nPlace a layer of cooked eggplant on top of pasta sauce.\nCover eggplant layer with half of mushroom mixture.\nLayer the remaining eggplant slices on top of mushroom mixture, followed by remaining half of mushroom mixture.\nPour pasta sauce over all the layers.\nTop casserole with sliced mozzarella cheese.\nCover dish with aluminum foil.\nBake in preheated oven until sauce is bubbling, about 45 minutes.\nRemove from oven and remove aluminum foil. Return to oven until mozzarella cheese is lightly browned, about 5 minutes.\nCool for 15 minutes to allow the lasagna to set up.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "866901.jpg",
    "o": "",
    "st": "allrecipes"
}