{
    "id": 220264,
    "old_rating": "4.81818",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "6 crimini mushrooms, sliced",
        "3 cloves garlic, chopped",
        "1 pinch salt and ground black pepper, or to taste",
        "1 tablespoon olive oil",
        "8 spears fresh asparagus, trimmed and cut into 2-inch pieces",
        "1/2 pound applewood-smoked bacon, cut into 2-inch pieces",
        "1 (12 inch) prepared flatbread pizza crust",
        "3/4 cup prepared marinara sauce",
        "1/2 cup shredded mozzarella cheese",
        "1/2 cup shredded Asiago cheese"
    ],
    "nut": [
        "Calories > 332 kcal",
        "Carbs > 33.6 g",
        "Cholesterol > 28 mg",
        "Fat > 16.2 g",
        "Protein > 16.4 g",
        "Sodium > 761 mg"
    ],
    "n": "Rustic Flatbread Pizza",
    "a": "smerki",
    "r": "0",
    "s": 6,
    "des": "\"Applewood-smoked bacon, cremini mushrooms, asparagus, and Asiago cheese all come together on a thin, crunchy flatbread to create a hearty and delicious main. Preparation may take some time, but the finished product is well worth every second. Serve alongside a fresh green salad for nice balance.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nLine a baking sheet with aluminum foil.\nHeat 1 tablespoon olive oil in a skillet over medium heat, and stir in mushrooms and garlic; sprinkle with salt and black pepper. Cook and stir until the mushrooms have given off their juice and the juice has evaporated, about 10 minutes. Remove from heat and set mushroom mixture aside.\nHeat 1 more tablespoon olive oil in a separate large skillet over medium-high heat until very hot, and place asparagus into the skillet. Cook, stirring occasionally, until asparagus pieces are very well browned (almost but not quite burned in spots), about 8 minutes. Remove asparagus from skillet and set aside.\nReduce heat to medium, and cook bacon in the same skillet until crisp, about 10 minutes; stir often. Drain excess grease as the bacon cooks, for crisper pieces.\nRemove bacon pieces and place on a paper towel-lined plate; blot with paper towels to reduce grease.\nPlace the flatbread crust onto the prepared baking sheet, and spread marinara sauce over the crust.\nSpread the mushrooms and garlic evenly over the pizza.\nSpread asparagus over the pizza.\nArrange bacon pieces on the pizza.\nSprinkle mozzarella cheese all over the pizza, followed by Asiago cheese.\nBake in the preheated oven until the cheeses are melted and bubbling, 12 to 15 minutes.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "3029821.jpg",
    "o": "",
    "st": "allrecipes"
}