{
    "id": 220262,
    "old_rating": "4.52941",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 slices bacon",
        "24 spears fresh asparagus, trimmed",
        "1 (8 ounce) package cream cheese, softened",
        "2 tablespoons finely chopped chives",
        "12 slices white bread, crusts removed",
        "2 tablespoons butter, melted",
        "3 tablespoons grated Parmesan cheese, divided"
    ],
    "nut": [
        "Calories > 185 kcal",
        "Carbs > 14.5 g",
        "Cholesterol > 32 mg",
        "Fat > 11.6 g",
        "Protein > 6.2 g",
        "Sodium > 365 mg"
    ],
    "n": "Asparagus Roll Ups",
    "a": "luckoftheIrish",
    "r": "0",
    "s": 12,
    "des": "\"Fun way to eat asparagus! Have the kids help out while making them, and they will enjoy them even more!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nGrease a baking sheet.\nPlace bacon in a large, deep skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate.\nWhen bacon is cool, crumble and set aside in a bowl.\nPlace asparagus spears into a large skillet and pour in about 1 inch of water. Place over medium heat, cover the skillet, and simmer asparagus until bright green and slightly tender, about 5 minutes. Remove asparagus and set aside.\nPlace cream cheese and chives into the bowl with bacon and stir to evenly combine.\nRoll each bread slice with a rolling pin on a work surface until the slices are thin and flat.\nSpread cream cheese mixture evenly over each slice of bread.\nCenter 2 asparagus spears on a bread slice, and roll the slice around the asparagus into a tidy and compact cylinder. Place seam side down onto the prepared baking sheet. Repeat with remaining ingredients.\nBrush each roll with melted butter and sprinkle each with about 1 1/2 teaspoon Parmesan cheese.\nBake in the preheated oven until lightly golden brown and hot, 10 to 12 minutes.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "807036.jpg",
    "o": "3829443.jpg,3587632.jpg,3545757.jpg,3430220.jpg,3429434.jpg,3172332.jpg",
    "st": "allrecipes"
}