{
    "id": 220276,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound bacon, chopped",
        "1/4 cup reserved bacon drippings",
        "2 cups fresh asparagus, cut into 1-inch pieces",
        "1 (10 ounce) package frozen chopped spinach - thawed, drained and squeezed dry",
        "3 cloves garlic, chopped (optional)",
        "2 tablespoons lemon zest",
        "2 cups Alfredo Sauce",
        "1 (16 ounce) package uncooked rotini pasta",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 548 kcal",
        "Carbs > 49.2 g",
        "Cholesterol > 47 mg",
        "Fat > 31.8 g",
        "Protein > 17.9 g",
        "Sodium > 932 mg"
    ],
    "n": "I Dream of Spinach",
    "a": "Alphaminx",
    "r": "0",
    "s": 8,
    "des": "\"A delicious pasta dish with bacon, spinach, asparagus and a hint of lemony goodness. The sauce is Alfredo but it's almost unrecognizable.  This is one of my 5-year-old's favorite suppers.\"",
    "ins": "Place bacon in a large skillet and cook over medium-high heat, stirring often, until evenly browned, about 10 minutes. Remove bacon with a slotted spoon and drain on a paper towel-lined plate. Reserve 1/4 cup of bacon drippings in the skillet.\nPlace asparagus, spinach, and garlic into the skillet with the bacon drippings; cook and stir over medium heat  until the asparagus is tender, 8 to 10 minutes.\nSprinkle in lemon zest and toss to combine; thoroughly mix in bacon and Alfredo sauce. Reduce heat to medium-low and bring sauce to a simmer.\nFill a large pot with lightly salted water and bring to a rolling boil. Stir in rotini and return to a boil. Cook uncovered, stirring occasionally, until the pasta has cooked through but is still slightly firm, about 8 minutes. Drain well.\nTransfer the rotini to a serving bowl and top with Alfredo sauce mixture.\nSprinkle with Parmesan cheese to serve.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "1518373.jpg",
    "o": "",
    "st": "allrecipes"
}