{
    "id": 220248,
    "old_rating": "4.55556",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound fresh asparagus, trimmed and cut into 1 1/2-inch pieces",
        "1 tablespoon olive oil",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1/4 onion, thinly sliced",
        "1 (4 ounce) packet saltine crackers, crushed",
        "1 cup shredded sharp Cheddar cheese",
        "1/4 teaspoon ground black pepper",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1/2 cup milk",
        "1/2 cup coarsely chopped pecans"
    ],
    "nut": [
        "Calories > 336 kcal",
        "Carbs > 27 g",
        "Cholesterol > 21 mg",
        "Fat > 21.2 g",
        "Protein > 12 g",
        "Sodium > 700 mg"
    ],
    "n": "Asparagus and Mushroom Casserole",
    "a": "hembrees",
    "r": "0",
    "s": 6,
    "des": "\"A fresh twist on the holiday casserole my mom always made.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nGrease a 1 1/2-quart baking dish.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Cover pan and bring the water to a boil. Add asparagus, cover, and steam until just tender, 5 to 8 minutes.\nHeat olive oil in a large skillet; cook and stir mushrooms and onion until the mushrooms have given off their liquid, 5 to 8 minutes. Stir in the asparagus, tossing vegetables just until hot. Remove from heat.\nMix saltine cracker crumbs, sharp Cheddar cheese, and black pepper together in a bowl; spread half the mixture into the bottom of the prepared baking dish.\nSpoon the asparagus mixture over the crumb mixture.\nWhisk the cream of mushroom soup and milk together in a bowl until smooth, and pour the soup mixture over the asparagus mixture.\nSpread the remaining crumb-cheese mixture over the casserole and sprinkle with pecans.\nBake in the preheated oven until the casserole is bubbling, about 30 minutes.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "3819884.jpg",
    "o": "",
    "st": "allrecipes"
}