{
    "id": 220265,
    "old_rating": "4.05882",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 slices bacon, cut into 1/2-inch pieces",
        "1 pound fresh asparagus, trimmed and cut into 1-inch pieces",
        "1/2 pound fresh peas",
        "1 onion, chopped",
        "1/2 lemon, juiced",
        "salt and ground black pepper to taste",
        "1 pound fresh fettuccine pasta",
        "3 tablespoons heavy cream",
        "5 ounces shredded Italian three-cheese blend"
    ],
    "nut": [
        "Calories > 423 kcal",
        "Carbs > 54.6 g",
        "Cholesterol > 91 mg",
        "Fat > 14 g",
        "Protein > 20.8 g",
        "Sodium > 435 mg"
    ],
    "n": "Creamy Asparagus and Peas Pasta",
    "a": "Judy",
    "r": "0",
    "s": 6,
    "des": "\"This recipe is inspired by both Jaime Oliver's Creamy Shells and Peas recipe and a local restaurant's version. However, I've never been tempted to make Jaime's; I'm sure it tastes awesome but I decided to tweak it to my heart's content. Mine is very fast to make and very fresh tasting.\"",
    "ins": "Place bacon in a large saucepan and cook over medium-high heat until bacon is evenly browned, about 10 minutes. Stir occasionally while cooking. Drain the bacon grease from the pan, and transfer bacon to a paper towel-lined plate.\nBring a large pot of water to a boil and stir in asparagus and peas; stir occasionally and cook until the vegetables are slightly softened but still bright green, about 5 minutes. Drain and set aside.\nCook and stir onion until translucent over medium heat in the same pan as bacon, about 5 minutes; stir in asparagus, peas, and bacon pieces.\nSqueeze lemon juice over the asparagus mixture; season with salt and black pepper.\nBring a large pot of salted water to a boil and stir in the fettuccine; cook, stirring often, until fettuccine are tender, about 5 minutes. Drain well.\nStir hot fettuccine into the pan with asparagus mixture over medium-low heat and toss gently to combine.\nStir in cream and bring mixture to a simmer.\nSprinkle cheese blend over the mixture and allow to stand until the cheese melts, about 5 minutes; stir cheese lightly into the fettuccine and vegetables to serve.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "803023.jpg",
    "o": "4457862.jpg,3469338.jpg,802124.jpg,802122.jpg,801380.jpg,797046.jpg",
    "st": "allrecipes"
}