{
    "id": 220218,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds halibut",
        "1/2 teaspoon seafood seasoning (such as Old BayÂ®)",
        "1 tablespoon lemon juice",
        "1 teaspoon cold butter, thinly sliced",
        "1 cup mayonnaise",
        "1 cup sour cream",
        "1 cup cream cheese, softened",
        "2 (4 ounce) cans diced green chiles",
        "2 green onions, chopped",
        "1 teaspoon chopped fresh parsley",
        "salt and ground black pepper to taste",
        "8 (8 inch) flour tortillas",
        "1 cup heavy cream, or as needed",
        "1 cup shredded mozzarella cheese",
        "1/4 cup Parmesan cheese"
    ],
    "nut": [
        "Calories > 807 kcal",
        "Carbs > 33.3 g",
        "Cholesterol > 151 mg",
        "Fat > 58.1 g",
        "Protein > 37.2 g",
        "Sodium > 1056 mg"
    ],
    "n": "Mom's Halibut Enchiladas",
    "a": "Michelle Smith Wuscher",
    "r": "0",
    "s": 8,
    "des": "\"My mom from Alaska brings us delicious fresh halibut several times a year, and this is my favorite recipe for using it.  It's rich, creamy, and wonderful!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nPlace halibut in a 9x13 inch baking dish. Sprinkle with seafood seasoning and lemon juice. Dot halibut with butter slices.\nBake in the preheated oven until fish flakes easily with a fork, 15 to 20 minutes.\nRemove pan from oven and cool halibut slightly. Flake into bite sized pieces in the baking dish.\nCombine mayonnaise, sour cream, and cream cheese in a large bowl.\nCarefully stir in flaked halibut, diced green chiles, green onions, parsley, salt, and black pepper.\nSpoon filling onto tortillas in a line down the center, and roll them around the filling into a cylinder shape.\nGrease a 9x15 inch baking dish.\nPlace rolled tortillas seam sides down in the prepared baking dish.\nPour heavy cream over rolled tortillas, using as much as needed to cover.\nTop with mozzarella and Parmesan cheeses.\nBake in the preheated oven until cheese is browned and bubbling, about 45 minutes.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}