{
    "id": 220213,
    "old_rating": "4.72059",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups grated Parmesan cheese",
        "1 (16 ounce) package penne pasta",
        "4 skinless, boneless chicken breast halves",
        "3 egg whites, lightly beaten",
        "2 (16 ounce) jars Alfredo sauce",
        "2 (14.5 ounce) cans Italian-style diced tomatoes",
        "1 (8 ounce) can tomato sauce",
        "1/4 teaspoon red pepper flakes, or to taste",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1 (8 ounce) package fresh spinach",
        "1 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 1024 kcal",
        "Carbs > 73.5 g",
        "Cholesterol > 141 mg",
        "Fat > 59.6 g",
        "Protein > 54.6 g",
        "Sodium > 2569 mg"
    ],
    "n": "Penne Rosa with Parmesan Crusted Chicken",
    "a": "MandaGreens",
    "r": "0",
    "s": 6,
    "des": "\"Penne pasta in a red pepper-flecked tomato cream sauce tossed with mushrooms, spinach, and topped with Parmesan chicken. I also serve with a fresh Caesar salad.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nLine a baking sheet with parchment paper.\nPlace 2 cups Parmesan cheese into a shallow bowl.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in penne and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\nDip chicken breasts into the beaten egg whites.\nPress chicken into Parmesan cheese in shallow bowl to coat both sides.\nGently toss between your hands so any cheese that hasn't stuck can fall away. Place the chicken on prepared baking sheet.\nBake chicken breasts in the preheated oven until no longer pink in the center and the juices run clear, about 18 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nMeanwhile, heat Alfredo sauce, diced tomatoes, tomato sauce, and red pepper flakes in a large saucepan over low heat. Allow to simmer while you finish the remaining steps.\nHeat a large skillet over medium high heat; cook and stir mushrooms and spinach until mushrooms are tender, about 5 minutes.\nStir vegetables into the sauce.\nPlace the penne pasta into a serving bowl; slice chicken breasts and arrange over the pasta.\nPour sauce over the pasta and chicken, and sprinkle remaining 1 cup Parmesan cheese on top.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "1462651.jpg",
    "o": "3587462.jpg,3212513.jpg,2553347.jpg,2376428.jpg,1792153.jpg,1761818.jpg",
    "st": "allrecipes"
}