{
    "id": 220286,
    "old_rating": "4.79167",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 pounds very lean beef, visible fat trimmed and cut against the grain into 1/4 inch-thick strips",
        "3/4 cup Worcestershire sauce",
        "3/4 cup soy sauce",
        "1 1/2 tablespoons brown sugar",
        "1 tablespoon onion powder",
        "1 tablespoon garlic powder",
        "1 tablespoon ground black pepper",
        "1 teaspoon liquid smoke, or more to taste",
        "1/4 teaspoon cayenne pepper",
        "1/4 teaspoon coriander seeds",
        "3/4 cup water, or as needed",
        "1/4 teaspoon coriander seeds (optional)",
        "ground black pepper to taste (optional)"
    ],
    "nut": [
        "Calories > 169 kcal",
        "Carbs > 3.8 g",
        "Cholesterol > 68 mg",
        "Fat > 4 g",
        "Protein > 27.9 g",
        "Sodium > 569 mg"
    ],
    "n": "Mike's Peppered Beef Jerky",
    "a": "Michael D.",
    "r": "0",
    "s": 24,
    "des": "\"If you like the peppered beef jerky in the bag, you will absolutely love this.\"",
    "ins": "Place beef strips on a solid, level surface. Firmly pound beef with the tenderizing side of a meat mallet until the meat fibers are slightly broken but the strips still hold their shape.\nMix Worcestershire sauce, soy sauce, brown sugar, onion powder, garlic powder, black pepper, liquid smoke, cayenne pepper, and coriander seeds in a large bowl until brown sugar has dissolved.\nPlace beef strips into the bowl; add enough water to allow marinade to cover the meat. Stir to incorporate water and submerge the beef in marinade, cover the bowl, and refrigerate for 24 hours.\nPreheat oven to 300 degrees F (150 degrees C).\nRemove beef strips from marinade, shake off excess, and lay the strips onto oven-proof racks. Do not overlap the strips.\nBake the beef strips in the preheated oven until an instant-read thermometer inserted into the thickest strip reads at least 150 degrees F (65 degrees C).\nRemove strips from oven and place onto racks of a food dehydrator so the strips don't overlap.\nIf desired, sprinkle strips with more coriander seeds and black pepper.\nTurn on the dehydrator, set machine's temperature for 155 degrees F (70 degrees C), and dry the jerky until leathery, about 9 hours. Rotate the racks from top to bottom every 1 1/2 hours for even drying. A piece of jerky should crack but not break in half when folded. Store in refrigerator.",
    "pt": "25 m",
    "ct": "10 h",
    "tt": "1 d ",
    "i": "2380930.jpg",
    "o": "",
    "st": "allrecipes"
}