{
    "id": 220277,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds fresh asparagus, trimmed and cut into 1-inch pieces",
        "10 hard-cooked eggs, peeled and sliced in half lengthwise",
        "1 (4.5 ounce) can deviled ham spread",
        "1 tablespoon heavy cream",
        "1 teaspoon grated onion",
        "3/4 teaspoon dry mustard powder",
        "1/2 teaspoon Worcestershire sauce",
        "1/2 teaspoon salt",
        "6 tablespoons butter",
        "6 tablespoons all-purpose flour",
        "3 cups milk",
        "2 cups shredded mild Cheddar cheese",
        "1/4 teaspoon dry mustard powder",
        "salt to taste",
        "1/8 teaspoon ground black pepper",
        "1 cup crushed corn flake cereal",
        "2 tablespoons butter, melted"
    ],
    "nut": [
        "Calories > 652 kcal",
        "Carbs > 33.1 g",
        "Cholesterol > 414 mg",
        "Fat > 44.9 g",
        "Protein > 32.2 g",
        "Sodium > 971 mg"
    ],
    "n": "Baked Deviled Eggs with Asparagus",
    "a": "Nana J",
    "r": "0",
    "s": 6,
    "des": "\"My family lives in Louisiana, and this recipe (something different) was handed down from my Mom years ago.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nCook asparagus in a large pot of lightly salted boiling water until tender, 5 to 8 minutes. Drain well and set aside.\nScoop yolks out of hard-cooked eggs and transfer to a bowl; mash yolks with a fork.\nMash deviled ham spread, cream, onion, 3/4 teaspoon dry mustard powder, Worcestershire sauce, and 1/2 teaspoon salt into the yolks until thoroughly combined.\nFill cavities in egg halves with the yolk mixture; set deviled eggs aside.\nMelt 6 tablespoons of butter in a saucepan over medium heat, and whisk flour into butter until smooth and bubbling.\nWhisk in milk, a little at a time, until the sauce is smooth and thickened; reduce heat to low and simmer for 5 minutes.\nWhisk in Cheddar cheese, 1/4 teaspoon dry mustard powder, salt to taste, and black pepper; stir sauce until cheese is melted and incorporated.\nSpread asparagus into the bottom of a 9x13-inch baking dish.\nArrange the deviled eggs on top of asparagus; pour the cheese sauce evenly over the deviled eggs.\nMix crushed corn flakes with 2 tablespoons melted butter in a bowl; sprinkle over the casserole.\nBake in the preheated oven until the sauce bubbles and the topping is browned, about 20 minutes.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}