{
    "id": 220322,
    "old_rating": "4.71053",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 ounces bacon, cut into 1 inch pieces",
        "8 ounces smoked sausage, sliced",
        "12 ounces boneless, skinless chicken thighs, cubed",
        "1 onion, diced",
        "salt and pepper to taste",
        "2 cups chicken broth, plus more if needed",
        "2 (15 ounce) cans cannellini beans, drained and rinsed",
        "1 1/2 teaspoons minced fresh rosemary",
        "1 1/2 teaspoons minced fresh thyme",
        "cayenne pepper to taste",
        "1/4 cup melted butter",
        "1 cup bread crumbs",
        "1/2 cup finely grated Parmigiano-Reggiano"
    ],
    "nut": [
        "Calories > 906 kcal",
        "Carbs > 72.2 g",
        "Cholesterol > 142 mg",
        "Fat > 44.2 g",
        "Protein > 54.4 g",
        "Sodium > 2072 mg"
    ],
    "n": "Chef John's Quick Cassoulet",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"We've taken some short cuts to make a quick version of the French classic, cassoulet. Chicken thighs replace the classic, and time-consuming, duck confit; canned beans replace dried; and bacon serves as a convenient substitute for other, more involved smoked pork options.\"",
    "ins": "Add bacon to a large, cold oven-ready skillet. Place over medium heat and cook for 10-12 minutes, until almost crisp. Transfer to a bowl, reserving the grease in the pan.\nStir in sausage slices; cook 3-4 minutes. Add chicken thigh pieces; cook and stir for 5 minutes, until browned. Remove meat to the plate with bacon. Discard all the oil, but don't wipe out the pan.\nAdd chopped onion and turn the heat to medium-low; cook and stir for 5 minutes, until the onions are translucent. Add 1 cup of chicken stock.\nMash about 1/4 of the beans in a small bowl, stir all the beans into the pan.\nStir in cayenne, rosemary and thyme. Add reserved meat back to the pan. Stir in remaining cup of stock or more if needed to cover. Return to simmer.\nMix bread crumbs, Parmigiano-Reggiano and melted butter together in a small bowl.\nPreheat the oven's broiler and set the oven rack about 7 inches from the heat source.\nSprinkle the cassoulet with half the bread crumb mixture. Place under the broiler and cook about 5 minutes, until browned.\nRemove the pan and push bread crumbs down into the cassoulet. Top with remaining bread crumb mixture. Return to oven and continue broiling 5 more minutes, until browned.\nTurn off the broiler and leave in the oven for 15 minutes. Remove and let sit for 5 minutes. Enjoy.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4502938.jpg",
    "o": "4502938.jpg,4481118.jpg,4075088.jpg,2703541.jpg,2241631.jpg,1083006.jpg",
    "st": "allrecipes"
}