{
    "id": 220376,
    "old_rating": "4.34211",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "2 cups uncooked elbow macaroni",
        "1/2 cup butter",
        "2 (12 ounce) cans evaporated milk",
        "1 tablespoon ground black pepper",
        "3 eggs",
        "1 teaspoon salt",
        "4 cups shredded Cheddar cheese",
        "1 pinch paprika, or to taste (optional)"
    ],
    "nut": [
        "Calories > 621 kcal",
        "Carbs > 29.8 g",
        "Cholesterol > 197 mg",
        "Fat > 43.1 g",
        "Protein > 29 g",
        "Sodium > 919 mg"
    ],
    "n": "Southern Macaroni and Cheese Pie",
    "a": "dameionec",
    "r": "0",
    "s": 8,
    "des": "\"Macaroni and Cheese Pie is a staple of all good Southern family dinners, church dinners and socials.\"",
    "ins": "Preheat the oven to 425 degrees F (220 degrees C).\nSpray a 9x13-inch casserole dish with cooking spray.\nFill a large pot with lightly salted water and bring to a boil. Stir in the macaroni and return to a boil. Cook pasta uncovered, stirring occasionally, until it has cooked through but is still slightly firm, about 8 minutes; drain.\nSlowly melt butter in a large pot over low heat. Stir in evaporated milk and black pepper; cook until heated through.\nWhisk eggs in a bowl until smooth; whisk about 1/2 cup of the evaporated milk mixture into the eggs, 1 tablespoon at a time, until thoroughly incorporated. Whisk the egg mixture back into the saucepan with evaporated milk mixture. Continue to heat gently, whisking constantly, until the evaporated milk mixture almost comes to a simmer and the sauce thickens.\nGently mix salt and cooked macaroni into the sauce and stir to combine.\nSpoon 1/4 of the macaroni mixture in a layer into the bottom of the prepared casserole dish and top with 1 cup shredded Cheddar cheese. Repeat layers three more times; top last cheese layer with paprika to taste.\nBake in the preheated oven until casserole is bubbling, about 20 minutes.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "4527372.jpg",
    "o": "4527372.jpg,4523929.jpg,4459519.jpg,4370980.jpg,4363506.jpg,4204450.jpg",
    "st": "allrecipes"
}