{
    "id": 220343,
    "old_rating": "3.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 cups water",
        "1 cup barley",
        "4 cups beef broth",
        "1 cup milk",
        "2 tablespoons olive oil",
        "1 cup diced onion",
        "1/2 cup diced celery",
        "1/2 cup diced carrot",
        "1 tablespoon finely chopped garlic",
        "1 (6 ounce) package sliced white mushrooms",
        "1/2 cup chopped brown beech mushrooms",
        "1/2 cup chopped oyster mushrooms",
        "1/4 cup dried shiitake mushrooms",
        "1/4 cup dried black mushrooms, broken into small pieces",
        "1 (10.75 ounce) can condensed cream of mushroom soup (optional)",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground mixed peppercorns"
    ],
    "nut": [
        "Calories > 271 kcal",
        "Carbs > 38.5 g",
        "Cholesterol > 3 mg",
        "Fat > 9.6 g",
        "Protein > 10.3 g",
        "Sodium > 1092 mg"
    ],
    "n": "Slow Cooker 5-Mushroom Barley Soup",
    "a": "Doug N",
    "r": "0",
    "s": 6,
    "des": "\"This hearty version of an American classic soup is inspired by 'Chef Jakey' of the long-gone 'Steak Pub' in 1970's Monticello, NY. Long ago, I lived and worked in the upstate New York resort  town of Monticello. As an electrical contractor, one of my clients was an upscale restaurant called 'The Steak Pub.' They had an Asian head chef named 'Jakey.' During winter months when business was slow, we spent hours doing electrical upgrades. Inevitably, we would be there at lunch time, and Jakey would invite us to his specialty, Mushroom Barley Soup, with hot sourdough. The addition of the cream of mushroom soup gives a creamier end result. Serve hot with sourdough or other fine bread, or garlic rounds.\"",
    "ins": "Heat water in a slow cooker set to High until hot; add barley, beef broth, milk, olive oil, onion, celery, carrot, garlic, white mushrooms, brown beech mushrooms, oyster mushrooms, shiitake mushrooms, black mushrooms, cream of mushroom soup, salt, and ground mixed peppercorns to the slow cooker.\nCover and cook on High for 1 hour.\nRemove shiitake mushrooms with a slotted spoon and chop into 1/2-inch pieces. Reduce heat setting to Low and continue cooking 7 hours more.",
    "pt": "20 m",
    "ct": "8 h",
    "tt": "8 h ",
    "i": "4240177.jpg",
    "o": "",
    "st": "allrecipes"
}