{
    "id": 220346,
    "old_rating": "4.14894",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "9 lasagna noodles",
        "1/2 pound ground beef",
        "1 onion, chopped",
        "4 fresh mushrooms, sliced",
        "2 cloves garlic, crushed",
        "2 (14.5 ounce) cans Italian-flavored crushed tomatoes",
        "1 eggplant, peeled and thinly sliced",
        "2 cups mozzarella and cheddar cheese blend"
    ],
    "nut": [
        "Calories > 254 kcal",
        "Carbs > 26.3 g",
        "Cholesterol > 35 mg",
        "Fat > 9.7 g",
        "Protein > 16.4 g",
        "Sodium > 339 mg"
    ],
    "n": "Eggplant and Ground Beef Lasagna",
    "a": "Bethany T.",
    "r": "0",
    "s": 8,
    "des": "\"I couldn't decide if I wanted lasagna or moussaka the other night; this came out as a yummy combo of the two! Spinach lasagna noodles work well in this if you can get them. Also, try ground lamb in place of the beef for another variation.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nGrease the bottom and sides of 9x13 inch baking dish.\nBring a large pot of lightly salted water to a rolling boil. Cook the lasagna noodles at a boil until tender yet firm to the bite, about 10 minutes; drain and set aside.\nCook and stir ground beef, onion, mushrooms, and garlic in a skillet over medium heat until the beef is completely browned, about 10 minutes.\nStir canned tomatoes into ground beef; simmer until sauce has formed, 3 to 4 minutes.\nPour about one-fourth of the sauce into the bottom of the prepared baking dish.\nLayer noodles on top of sauce.\nSpread a thin layer of sauce on top of noodles.\nPlace a layer of eggplant slices on top of noodle and sauce layer.\nSprinkle about one-fourth of the cheese on top of eggplant slices.\nRepeat layering with remaining ingredients, until ending with a layer of sauce topped with remaining cheese.\nBake in preheated oven until cheese is bubbly and brown on top, about 40 minutes.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "997756.jpg",
    "o": "3960202.jpg,3209316.jpg,3174970.jpg,2609462.jpg,1341970.jpg,1270229.jpg",
    "st": "allrecipes"
}