{
    "id": 220428,
    "old_rating": "4.3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup canned roasted red peppers, drained",
        "2 cups chicken broth",
        "2/3 cup grated Parmesan cheese",
        "1/2 cup chopped fresh cilantro, packed",
        "2 tablespoons cornstarch",
        "1 tablespoon seeded and chopped jalapeno pepper",
        "1 teaspoon chopped garlic, or more to taste",
        "1 tablespoon chopped fresh cilantro, or more to taste",
        "1 tablespoon chopped fresh chives, or more to taste",
        "1 (12 ounce) package angel hair pasta",
        "1 tablespoon olive oil",
        "5 (4 ounce) fillets boneless salmon fillets"
    ],
    "nut": [
        "Calories > 474 kcal",
        "Carbs > 43.2 g",
        "Cholesterol > 66 mg",
        "Fat > 18.8 g",
        "Protein > 31.7 g",
        "Sodium > 895 mg"
    ],
    "n": "Roasted Red Pepper Salmon Pasta",
    "a": "David Van Klinken",
    "r": "0",
    "s": 5,
    "des": "\"Simply an awesome flavor combination of Pacific Northwest and Italian cuisine!\"",
    "ins": "Preheat outdoor grill for medium heat and lightly oil the grate.\nPuree roasted red peppers in a food processor; transfer to a cold large skillet.\nStir chicken broth, Parmesan cheese, 1/2 cup cilantro, cornstarch, jalapeno pepper, and garlic into red pepper puree.\nBring red pepper mixture to a boil over medium-high heat, stirring constantly, until thickened, about 10 minutes. Keep warm.\nBring a large pot of lightly salted water to a boil. Stir angel hair and olive oil into the boiling water, stirring occasionally until cooked through but firm to the bite, 4 to 5 minutes. Drain.\nCook salmon, skin side up, until skin begins to loosen, about 5 minutes. Remove from grill and peel skin. Continue cooking on other side until salmon flakes easily with a fork, about 5 minutes.\nDivide angel hair pasta among 5 warm plates. Nestle a salmon fillet into each pasta portion. Drizzle red pepper sauce around salmon onto pasta. Garnish with 1 tablespoon cilantro and chives.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "2802193.jpg",
    "o": "",
    "st": "allrecipes"
}