{
    "id": 220446,
    "old_rating": "4.3125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 1/2 cups all-purpose flour",
        "2/3 cup unsweetened cocoa powder",
        "1 1/4 teaspoons baking soda",
        "1 teaspoon salt",
        "1/4 teaspoon baking powder",
        "1 2/3 cups white sugar",
        "2/3 cup butter, softened",
        "1 1/4 cups water",
        "1 teaspoon vanilla extract",
        "2 eggs",
        "2 cups chocolate chips (optional)",
        "2 tablespoons all-purpose flour (optional)",
        "1 cup butter, softened",
        "1/4 cup Irish cream liqueur (such as BaileysÂ®)",
        "2 teaspoons vanilla extract",
        "3 drops green food coloring (optional)",
        "3 cups confectioners' sugar, or more as needed"
    ],
    "nut": [
        "Calories > 367 kcal",
        "Carbs > 51.4 g",
        "Cholesterol > 49 mg",
        "Fat > 17.9 g",
        "Protein > 3.1 g",
        "Sodium > 267 mg"
    ],
    "n": "Chocolate Cupcakes with Bailey's Creme Frosting",
    "a": "pinkegobox",
    "r": "0",
    "s": 24,
    "des": "\"Perfect for that St. Patrick's Day party or if you want something chocolatey and delicious!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nLine 24 muffin cups with paper liners.\nWhisk together 2 1/2 cups flour, cocoa powder, baking soda, salt, and baking powder in a large bowl until thoroughly mixed.\nBeat in white sugar, 2/3 cup butter, water, 1 teaspoon vanilla extract, and eggs to make a smooth batter.\nPlace chocolate chips into a bowl and mix with 2 tablespoons flour until the chips are coated; fold chocolate chips into the batter.\nDivide batter between the prepared muffin cups, filling each cup about 2/3 full.\nBake in the preheated oven until a toothpick inserted into the center of a cupcake comes out clean, about 20 minutes. Remove from oven and let cool completely.\nWhile cupcakes are cooling, beat 1 cup butter, Irish cream liqueur, 2 teaspoons vanilla extract, and green food coloring with an electric mixer in a large bowl until mixture is smooth, thick, and evenly colored.\nReduce mixer speed to low and beat in confectioners' sugar, 1 cup at a time, until frosting is desired consistency. Beat in more confectioners' sugar to make a stiffer frosting.\nSpread frosting on cooled cupcakes.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "1 h",
    "i": "812608.jpg",
    "o": "",
    "st": "allrecipes"
}