{
    "id": 220447,
    "old_rating": "4.78295",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup Irish stout beer (such as GuinnessÂ®)",
        "1 cup butter",
        "3/4 cup unsweetened cocoa powder",
        "2 cups all-purpose flour",
        "2 cups white sugar",
        "1 1/2 teaspoons baking soda",
        "3/4 teaspoon salt",
        "2 large eggs",
        "2/3 cup sour cream",
        "2/3 cup heavy whipping cream",
        "8 ounces bittersweet chocolate, chopped",
        "2 tablespoons butter",
        "1 teaspoon Irish whiskey, or more to taste",
        "1/2 cup butter, softened",
        "3 cups confectioners' sugar, or more as needed",
        "3 tablespoons Irish cream liqueur (such as BaileysÂ®), or more to taste"
    ],
    "nut": [
        "Calories > 387 kcal",
        "Carbs > 48.8 g",
        "Cholesterol > 61 mg",
        "Fat > 20.3 g",
        "Protein > 3.3 g",
        "Sodium > 253 mg"
    ],
    "n": "Chocolate Beer Cupcakes With Whiskey Filling And Irish Cream Icing",
    "a": "MeowTheCow08",
    "r": "0",
    "s": 24,
    "des": "\"These cupcakes are made from scratch with a stout beer, then filled with an Irish whiskey-chocolate filling and topped off with some Irish cream icing. These are perfect for St. Patrick's Day.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nLine 24 muffin cups with paper liners.\nBring Irish stout beer and 1 cup butter to a boil in a saucepan and set aside until butter has melted, stirring occasionally. Mix in cocoa powder until smooth.\nWhisk together flour, sugar, baking soda, and salt in a bowl until thoroughly combined.\nBeat eggs with sour cream in a large bowl with an electric mixer on low until well combined. Slowly beat in the beer mixture, then the flour mixture; beat until the batter is smooth.\nDivide batter between the prepared cupcake cups, filling each cup about 2/3 full.\nBake in the preheated oven until a toothpick inserted into the center of a cupcake comes out clean, about 17 minutes.\nCool the cupcakes completely. Cut cores out of the center of each cupcake with a sharp paring knife. Discard cores.\nBring cream to a simmer in a saucepan over low heat; stir in bittersweet chocolate until melted.\nMix in 2 tablespoons butter and Irish whiskey until butter is melted; let mixture cool to room temperature. Filling will thicken as it cools.\nSpoon the filling into the cored cupcakes.\nFor frosting, whip 1/2 cup butter in a bowl with an electric mixer until fluffy, 2 to 3 minutes.\nSet mixer to low speed and slowly beat in confectioners' sugar, 1 cup at a time, until frosting is smooth and spreadable. Beat in the Irish cream liqueur; adjust thickness of frosting with more confectioners' sugar if needed.\nSpread frosting on filled cupcakes.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "4507205.jpg",
    "o": "4507205.jpg,4486233.jpg,4485852.jpg,4468727.jpg,3864506.jpg,3841655.jpg",
    "st": "allrecipes"
}