{
    "id": 220414,
    "old_rating": "4.53846",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "2 pounds ground beef",
        "2 cups diced poblano peppers",
        "1 teaspoon salt",
        "1 (16 ounce) jar salsa",
        "1/2 teaspoon dried oregano",
        "1 teaspoon ground dried chipotle pepper",
        "2 (8.5 ounce) boxes dry corn muffin mix (such as JiffyÂ®)",
        "2 eggs",
        "2/3 cup milk, divided",
        "4 ounces shredded Cheddar cheese, divided",
        "4 ounces shredded Monterey Jack cheese, divided",
        "8 ounces frozen corn, thawed"
    ],
    "nut": [
        "Calories > 640 kcal",
        "Carbs > 54.3 g",
        "Cholesterol > 146 mg",
        "Fat > 31.8 g",
        "Protein > 34.7 g",
        "Sodium > 1556 mg"
    ],
    "n": "Hot Tamale Pie",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"While this tamale pie has very little to do with its south-of-the-border namesake, it's a really delicious recipe all the same.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nSpray a 9x13-inch casserole dish with cooking spray.\nCook and stir ground beef in a Dutch oven over medium-high heat until meat starts to brown and release juices, about 5 minutes.\nReduce heat to medium and stir in poblano peppers, salt, salsa, oregano, and chipotle powder; cook and stir until seasoned beef is crumbly and no longer pink, about 10 minutes.\nMix one package of corn muffin mix in a large bowl with 1 egg and 1/3 cup of milk. Whisk to combine. In a separate large bowl, mix the second package of corn muffin mix with 1 egg, 1/3 cup of milk and half the Cheddar and Monterey Jack cheeses.\nSpread the prepared corn muffin mixture without cheese into the prepared baking dish. Sprinkle corn over the muffin mix, followed by remaining half of the cheeses, then the beef mixture.\nSpoon the corn muffin mix with cheese on top of the beef and carefully spread over the top with a fork, leaving about half an inch from the edges of the pan.\nBake in the preheated oven for 50-60 minutes, until golden brown.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4521625.jpg",
    "o": "4521625.jpg,4482023.jpg,4464311.jpg,4460694.jpg,4020957.jpg,3996384.jpg",
    "st": "allrecipes"
}