{
    "id": 220452,
    "old_rating": "4.63333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup buttermilk, divided",
        "1 1/2 cups golden raisins",
        "1/2 cup butter, melted - divided",
        "4 cups all-purpose flour",
        "1/4 cup white sugar",
        "1 tablespoon baking powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 egg"
    ],
    "nut": [
        "Calories > 305 kcal",
        "Carbs > 51.6 g",
        "Cholesterol > 37 mg",
        "Fat > 8.8 g",
        "Protein > 6.2 g",
        "Sodium > 370 mg"
    ],
    "n": "Mom's Irish Soda Bread",
    "a": "Katie O'",
    "r": "0",
    "s": 12,
    "des": "\"Authentic Irish soda bread does not contain raisins, but I like mine with raisins so I include them. This is a very easy and delicious recipe.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nGrease a 9-inch deep-dish pie plate.\nSpoon 1 tablespoon of the buttermilk into a small bowl; place remainder of 1 cup  buttermilk into a separate bowl.\nStir golden raisins into the larger amount of buttermilk and allow raisins to soak while you complete the remaining steps.\nSpoon 1 tablespoon of the melted butter into the small bowl with the tablespoon of buttermilk; stir to combine and set aside. Set remaining melted butter aside.\nWhisk together flour, sugar, baking powder, baking soda, and salt in a bowl.\nMake a well in the center of the dry ingredients, pour in reserved butter, and stir until the mixture resembles coarse crumbs.\nMix the egg into the flour mixture until thoroughly combined.\nMix the soaked raisins with buttermilk into dough and shape dough into a ball.\nPlace the ball of dough into prepared pie dish and lightly pat dough down so top is slightly domed.\nUse a sharp knife to cut two crisscrossing lines through the center of the loaf about 1/4 inch deep.\nThoroughly brush buttermilk and butter mixture over the loaf, getting the mixture into the crevices.\nBake in the preheated oven until loaf is golden brown and a toothpick inserted into the center comes out clean, 55 minutes to 1 hour.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "807108.jpg",
    "o": "4486828.jpg,4484015.jpg,4484014.jpg,3383086.jpg,2157424.jpg,2116633.jpg",
    "st": "allrecipes"
}