{
    "id": 220422,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 portobello mushroom caps",
        "1/4 cup balsamic vinegar",
        "1 red bell pepper",
        "1 yellow bell pepper",
        "8 ounces uncooked fettuccine pasta",
        "1 tablespoon olive oil",
        "1 tablespoon butter",
        "1/4 pound fresh asparagus, trimmed and cut into 1-inch pieces",
        "1 clove garlic, minced",
        "1 teaspoon Italian herb seasoning",
        "1 pinch crushed red pepper flakes, or to taste",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 320 kcal",
        "Carbs > 54.1 g",
        "Cholesterol > 8 mg",
        "Fat > 8 g",
        "Protein > 11.6 g",
        "Sodium > 37 mg"
    ],
    "n": "Roasted Portobello Mushroom Fettuccine",
    "a": "Dee Eberhart",
    "r": "0",
    "s": 4,
    "des": "\"This is my version of a recipe I encountered while traveling. It was so good that I had to recreate it at home for my family. This is really good served with crusty bread and a nice riesling. Enjoy!\"",
    "ins": "Place portobello mushroom caps into a large resealable plastic bag and pour in balsamic vinegar. Seal the bag and shake several times to coat mushrooms with vinegar; set aside to marinate.\nSet an oven rack about 6 inches from broiler's heat source, and preheat oven's broiler.\nLine a baking sheet with aluminum foil.\nCut red and yellow bell peppers in half from top to bottom; remove stems, seeds, and ribs. Place the peppers cut sides down onto the prepared baking sheet.\nCook under the preheated broiler until the skin of the peppers has blackened and blistered, about 5 minutes.\nPlace the blackened peppers into a bowl and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 20 minutes. Once cool, remove the skins and discard. Chop roasted peppers.\nTurn oven's temperature to 500 degrees F (260 degrees C).\nRemove portobello mushroom caps from bag, shake off excess vinegar, and arrange onto a baking sheet.\nRoast mushrooms until tender and they give off their liquid, 5 to 8 minutes. Remove mushrooms from oven and set aside. Chop mushrooms when cool enough to handle.\nFill a large pot with lightly salted water and bring to a boil. Stir in fettuccine and return to a boil. Cook the pasta until tender but still slightly firm, about 8 minutes; drain.\nHeat olive oil and butter in a large skillet over medium heat until butter has melted; cook and stir asparagus with garlic, Italian seasoning, crushed red pepper flakes, salt, and black pepper until asparagus is tender but still bright green, about 3 minutes.\nMix portobello mushrooms and roasted peppers into asparagus mixture and toss fettuccine with the vegetables until combined.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "2557284.jpg",
    "o": "",
    "st": "allrecipes"
}