{
    "id": 220417,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (3 1/2) pound chicken, giblets removed",
        "1 onion, peeled and quartered",
        "1 rib celery, cut in chunks",
        "2 teaspoons kosher salt",
        "3 cloves garlic, lightly smashed",
        "1 tablespoon ketchup",
        "2 quarts cold water, or more as needed"
    ],
    "nut": [
        "Calories > 421 kcal",
        "Carbs > 7.5 g",
        "Cholesterol > 108 mg",
        "Fat > 25.8 g",
        "Protein > 37.6 g",
        "Sodium > 1334 mg"
    ],
    "n": "Roasted Chicken Broth",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Start this flavorful chicken broth by roasting the chicken first, then use all the dark meat to fortify the broth.\"",
    "ins": "Preheat the oven to 400 degrees F (200 degrees C).\nPlace chicken, onion, and celery in a Dutch oven. Sprinkle salt over the top of the chicken.\nRoast chicken, uncovered, in the preheated oven until chicken is no longer pink inside, the skin is browned, and an instant-read thermometer inserted into the thickest part of a thigh reads 160 degrees F (70 degrees C), 45 minutes to 1 hour.\nTransfer chicken to a plate until cool enough to handle. Once cool, pick the meat from the bones; set aside chicken breast meat in a bowl for another purpose. Cover bowl of breast meat with plastic wrap and refrigerate. Discard chicken skin.\nRemove chicken fat from Dutch oven, leaving the brown flavor bits in the bottom of the Dutch oven. (See note for reserving drippings if desired.)\nPlace the Dutch oven over medium-high heat. Return chicken bones and dark meat from drumsticks and thighs to the pot. Add garlic cloves, ketchup and cold water. Bring to a boil, and use a spoon to scrape up and dissolve the brown flavor bits from the bottom of the Dutch oven. Reduce heat to low and simmer for 3 hours, adding more water if needed to retain same level.\nAs broth simmers, occasionally skim off and discard any foam that rises to the surface.\nRemove and discard bones, meat and vegetables. Strain broth through a fine mesh sieve to serve or use in recipes.",
    "pt": "25 m",
    "ct": "3 h ",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}