{
    "id": 220419,
    "old_rating": "4.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 skinless, boneless chicken breast halves",
        "12 small red potatoes",
        "2 tablespoons olive oil, divided",
        "2 teaspoons sea salt",
        "2 teaspoons garlic powder",
        "2 teaspoons lemon and herb seasoning",
        "1 teaspoon onion powder",
        "1 teaspoon dried basil",
        "1/2 teaspoon ground black pepper",
        "6 slices Havarti cheese, folded in half",
        "3 (.9 ounce) packages hollandaise sauce mix (such as KnorrÂ®)",
        "3 cups milk",
        "3/4 cup butter",
        "1 teaspoon ground white pepper",
        "1 teaspoon dried basil",
        "1 pinch garlic powder (optional)",
        "1 pound fresh asparagus, trimmed",
        "1 (8 ounce) package imitation crabmeat, chopped",
        "1/4 teaspoon paprika"
    ],
    "nut": [
        "Calories > 924 kcal",
        "Carbs > 71.7 g",
        "Cholesterol > 200 mg",
        "Fat > 50.7 g",
        "Protein > 50.4 g",
        "Sodium > 1639 mg"
    ],
    "n": "Baked Chicken Oscar Dinner (Yep, the Whole Shebang)",
    "a": "TL in SA",
    "r": "0",
    "s": 6,
    "des": "\"Baked chicken with creamy Havarti cheese, crab, and hollandaise sauce is served with crisp asparagus and roasted red potatoes. Measurements do not have to be exact. Season to taste.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nPlace chicken breasts into a 9x13-inch baking dish.\nPlace red potatoes into a separate 8x8-inch baking dish.\nDrizzle 1 tablespoon olive oil over chicken breasts and 1 tablespoon oil over potatoes.\nCombine sea salt, 2 teaspoons garlic powder, lemon and herb seasoning, onion powder, 1 teaspoon dried basil, and black pepper in a small bowl. Sprinkle chicken and potatoes each with half the seasoning mix.\nCover both baking dishes with aluminum foil.\nBake chicken and potatoes in the preheated oven for 40 to 45 minutes; remove chicken and top each breast with a folded slice of Havarti cheese. Return chicken to oven and bake until Havarti cheese is melted, chicken is no longer pink inside and juices juices run clear, about 5 more minutes.\nRemove chicken and potatoes from oven and allow to rest covered for 5 minutes.\nWhisk hollandaise sauce mix with milk in a saucepan over medium heat; bring to a boil and stir in butter until melted. Reduce heat to low and simmer sauce until thickened, about 1 minute. Remove from heat and stir in white pepper, 1 teaspoon dried basil, and 1 pinch garlic powder.\nPlace asparagus into a skillet over medium heat. Pour water into skillet about 1-inch deep and bring to a boil. Cover skillet and steam asparagus just until tender but still bright green, 2 to 4 minutes.\nTo serve, place each chicken breast onto a serving plate and top breasts with imitation crab meat.\nPour about 2 tablespoons of hollandaise sauce over each serving and place several spears of asparagus on top; drizzle 2 more tablespoons of sauce over each portion. Serve remaining hollandaise sauce on the side. Garnish with a pinch of paprika and serve with 2 red potatoes on each serving plate.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "800332.jpg",
    "o": "",
    "st": "allrecipes"
}