{
    "id": 220467,
    "old_rating": "4.82248",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound beets, peeled and sliced",
        "1 cup red quinoa",
        "2 cups water",
        "1/2 cup olive oil",
        "1/2 cup red wine vinegar",
        "1 1/2 teaspoons white sugar",
        "1 clove garlic, crushed",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "2 green onions, sliced",
        "3 ounces arugula, chopped",
        "5 ounces goat cheese, crumbled"
    ],
    "nut": [
        "Calories > 379 kcal",
        "Carbs > 25.6 g",
        "Cholesterol > 19 mg",
        "Fat > 26.9 g",
        "Protein > 9.9 g",
        "Sodium > 552 mg"
    ],
    "n": "Quinoa, Beet, and Arugula Salad",
    "a": "slmcm",
    "r": "0",
    "s": 6,
    "des": "\"Quinoa has a light, fluffy texture when cooked, and can be used as an alternative to white rice or couscous in most dishes. The arugula has a  rich peppery taste, and has an exceptionally strong flavor for a leafy green which goes well with the slightly nutty flavor of the quinoa.\"",
    "ins": "Place a steamer insert into a saucepan, and fill with water to just below the bottom of the steamer. Cover pan and bring the water to a boil. Add beets, cover pan, and steam until just tender, 7 to 10 minutes. Set aside.\nBring quinoa and 2 cups water a saucepan over high heat. Reduce the heat to medium-low, cover, and simmer until the quinoa is tender and the liquid has been absorbed, about 15 minutes.\nWhile the quinoa is cooking, whisk olive oil, red wine vinegar, sugar, garlic, salt, and black pepper together in a large bowl.\nRemove quinoa from heat, then immediately add half of the vinegar dressing while fluffing the quinoa with a fork; reserve remaining dressing. Cover and refrigerate quinoa until cool, at least 1 hour.\nStir green onions, arugula, goat cheese, beets, and remaining dressing into cooled quinoa mixture. Toss lightly before serving.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "2648808.jpg",
    "o": "4486800.jpg,4483206.jpg,4001862.jpg,3818546.jpg,3801241.jpg,3799671.jpg",
    "st": "allrecipes"
}