{
    "id": 220426,
    "old_rating": "4.52941",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 large eggplant, peeled and sliced into 1/3-inch strips",
        "1 pound ground beef",
        "1/2 cup olive oil",
        "1 teaspoon Italian seasoning, or to taste",
        "1 (8 ounce) package grated Parmesan cheese, divided",
        "1 (16 ounce) container ricotta cheese",
        "1 egg",
        "1 (16 ounce) jar spaghetti sauce",
        "1 (14.5 ounce) can diced tomatoes",
        "2 tablespoons ketchup",
        "1 (6 ounce) container feta cheese",
        "8 ounces frozen chopped spinach, thawed and drained"
    ],
    "nut": [
        "Calories > 598 kcal",
        "Carbs > 26.3 g",
        "Cholesterol > 120 mg",
        "Fat > 39.9 g",
        "Protein > 34.9 g",
        "Sodium > 1159 mg"
    ],
    "n": "Jorge's Pasta-less Eggplant Lasagna",
    "a": "ChefJorge",
    "r": "0",
    "s": 8,
    "des": "\"Roasted eggplant strips take the place of pasta strips and feta cheese takes the place of mozarella. This is a fun and delicious twist on the Italian favorite.\"",
    "ins": "Soak eggplant slices in a large bowl of lightly salted water for 30 minutes. Drain and pat dry with paper towels.\nCook and stir ground beef in a skillet over medium heat until browned, 5 to 7 minutes. Remove from heat.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nWhisk olive oil and Italian seasoning together in a bowl.\nBrush both sides of eggplant slices with the seasoned olive oil.\nArrange eggplant slices on a baking sheet and place in preheated oven; broil until browned, 2 to 4 minutes on each side.\nSet oven to 400 degrees F (200 degrees C).\nMeasure 1 cup of Parmesan cheese and set aside.\nStir ricotta cheese, egg, and remaining Parmesan cheese together in a bowl.\nStir spaghetti sauce, diced tomatoes, and ketchup together in a separate bowl.\nSpread a small amount of spaghetti sauce mixture in the bottom of a casserole dish.\nTop spaghetti sauce mixture with a layer of broiled eggplant slices.\nCover eggplant layer with a layer of the ricotta mixture.\nSprinkle a layer of feta on top of the ricotta mixture.\nCover feta layer with ground beef layer.\nSprinkle a layer of spinach on top of ground beef.\nRepeat with remaining ingredients, ending with a final layer of eggplant topped with the reserved 1 cup Parmesan cheese.\nBake in the preheated oven until sauce is bubbling and cheese is browned, about 40 minutes.\nLet cool for 10 minutes before serving.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1566236.jpg",
    "o": "",
    "st": "allrecipes"
}