{
    "id": 220448,
    "old_rating": "4.58824",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup evaporated milk",
        "1 cup light brown sugar, packed",
        "1 cup white sugar",
        "3/4 cup unsalted butter, room temperature",
        "1/4 teaspoon salt",
        "1/4 cup Irish cream liqueur",
        "1 teaspoon vanilla extract",
        "2 1/4 cups confectioners' sugar, sifted"
    ],
    "nut": [
        "Calories > 135 kcal",
        "Carbs > 23.1 g",
        "Cholesterol > 13 mg",
        "Fat > 4.6 g",
        "Protein > 0.3 g",
        "Sodium > 25 mg"
    ],
    "n": "Fudge of the Irish",
    "a": "cynjne",
    "r": "0",
    "s": 32,
    "des": "\"It's really Christmas once this fudge is made. This festive fudge is always the star of my annual cookie tray exchange and a requested gift by friends and family. I like to shop every year for unique gift wrap. Whether it's Chinese take-out boxes or miniature tins, it's enjoyed by all.\"",
    "ins": "Grease an 8-inch square baking pan and line with 2 pieces of parchment paper about 14 inches long; allow the ends of the paper to hang over the sides of the pan by several inches.\nStir evaporated milk, light brown sugar, white sugar, unsalted butter, and salt in a heavy saucepan over medium heat until the mixture forms a thick, smooth syrup.\nBring to a boil, reduce heat to medium-low, and cook until a candy thermometer inserted into the center of the boiling syrup without touching the bottom of the pan reads 238 degrees F (112 degrees C), 20 to 30 minutes. Stir often. Candy temperature will rise slowly at first, then more quickly as temperature increases; watch carefully.\nRemove saucepan from heat and stir in the Irish cream liqueur and vanilla extract until thoroughly combined.\nScrape the mixture into the work bowl of a large stand mixer fitted with beaters; set the machine on low speed and mix in confectioners' sugar in 3 additions, allowing the sugar to blend in completely before adding the next addition. Scrape down the bowl frequently and mix fudge until completely smooth, about 2 minutes.\nScrape fudge into the prepared baking pan and place on a level surface to cool and set up, 3 to 5 hours.\nUse the parchment paper ends as handles to lift the fudge out of the baking pan before slicing into cubes for serving.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "3 h ",
    "i": "959114.jpg",
    "o": "4227126.jpg,3920748.jpg,3633088.jpg,2601162.jpg,1812072.jpg,856241.jpg",
    "st": "allrecipes"
}