{
    "id": 220407,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound dried thin rice noodles",
        "4 cups very hot water",
        "1 tablespoon vegetable oil",
        "3/4 cup firm tofu, cubed",
        "1/4 cup fresh basil leaves",
        "2 tablespoons vegetable oil",
        "3/4 cup chicken, cut into cubes",
        "1/2 cup small black tiger shrimp, peeled and deveined",
        "1 1/2 teaspoons paprika",
        "2 eggs, beaten",
        "7 tablespoons vegetable oil",
        "3 cloves garlic, minced",
        "1/2 cup white vinegar",
        "1/2 cup fish sauce",
        "1 tablespoon brown sugar",
        "2 teaspoons ketchup",
        "2 teaspoons tamarind paste",
        "1 teaspoon hot chili sauce (such as SrirachaÂ®)",
        "2 lemon grass stalks, minced",
        "1/2 cup water, if needed (optional)",
        "3 tablespoons chopped roasted peanuts (optional)",
        "1 cup bean sprouts",
        "1 lime, cut in wedges",
        "4 green onions, thinly sliced"
    ],
    "nut": [
        "Calories > 560 kcal",
        "Carbs > 58.3 g",
        "Cholesterol > 94 mg",
        "Fat > 29.3 g",
        "Protein > 16.8 g",
        "Sodium > 1653 mg"
    ],
    "n": "Ultimate Pad Thai",
    "a": "hungryhungry",
    "r": "0",
    "s": 6,
    "des": "\"This recipe, though it contains a number of ingredients, is really easy to make. It is a hit at parties and can be modified to be a vegetarian dish as well.\"",
    "ins": "Soak rice noodles in a bowl with 4 cups hot water, or as needed to cover, until noodles are slightly softened, about 15 minutes; drain.\nHeat 1 tablespoon vegetable oil in a wok over medium heat.\nCook and stir tofu and basil leaves in hot oil until basil is crisp and tofu is golden, about 10 minutes. Remove tofu-basil mixture and set aside.\nHeat 2 tablespoons vegetable oil in the same skillet; cook and stir chicken, shrimp and paprika until chicken is no longer pink in the center and shrimp are bright pink on the outside and no longer transparent in the center, 5 to 8 minutes.\nPour eggs into chicken and shrimp; stir until eggs are lightly cooked, 2 to 3 minutes. Remove and set aside.\nHeat 7 tablespoons vegetable oil in a clean wok over medium heat. Cook and stir garlic in hot oil until fragrant, a few seconds.\nStir white vinegar, fish sauce, brown sugar, ketchup, tamarind paste, and hot chili sauce into garlic until the brown sugar has dissolved; simmer for 1 minute.\nStir lemon grass and drained rice noodles into wok until sauce is almost absorbed, 2 to 3 minutes. Pour 1/2 cup water into the skillet if noodles are still too firm.\nStir tofu with basil, peanuts, chicken and shrimp mixture, and bean sprouts into noodles; cook and stir until fully heated and combined with sauce, 1 to 2 minutes.\nGarnish with lime wedges and green onions.",
    "pt": "35 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}