{
    "id": 220439,
    "old_rating": "3.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package uncooked penne pasta",
        "1 tablespoon olive oil",
        "1 pound fresh broccoli florets",
        "1 pound fresh asparagus, trimmed and cut into 1 1/2-inch pieces",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1/4 cup thinly sliced onion",
        "1 clove garlic, minced",
        "1/2 cup pine nuts",
        "salt to taste",
        "2 tablespoons butter",
        "3 tablespoons all-purpose flour",
        "1 teaspoon salt",
        "2 cups milk",
        "1 cup prepared pesto",
        "salt and ground black pepper to taste",
        "1 tablespoon pine nuts"
    ],
    "nut": [
        "Calories > 530 kcal",
        "Carbs > 56.6 g",
        "Cholesterol > 23 mg",
        "Fat > 26.5 g",
        "Protein > 21.5 g",
        "Sodium > 599 mg"
    ],
    "n": "Penne with Creamy Pesto Sauce",
    "a": "lompoc sheri",
    "r": "0",
    "s": 8,
    "des": "\"This is a recipe I concocted with ingredients on hand, including my homemade pesto. My family loved it! Serve vegetarian or top with a cooked chicken breast.\"",
    "ins": "Fill a large pot with lightly salted water and bring to a boil. Stir in penne and return to a boil. Cook pasta uncovered, stirring occasionally, until cooked through but still slightly firm, about 11 minutes; drain.\nHeat olive oil in a large skillet over medium heat and cook and stir broccoli, asparagus, mushrooms, onion, garlic, and 1/2 cup pine nuts until the broccoli and asparagus are tender, about 8 minutes. Season with salt to taste.\nMelt butter in a large saucepan over medium heat and stir in flour and 1 teaspoon salt until smooth. Slowly whisk in milk until thoroughly combined, bring to a simmer, and reduce heat to medium-low. Simmer sauce, whisking constantly, until thickened, about 3 minutes.\nRemove sauce from heat and whisk in prepared pesto. Season to taste with salt and black pepper.\nPour pesto sauce into skillet with broccoli mixture; gently stir in penne pasta until thoroughly combined. Sprinkle with 1 tablespoon pine nuts to serve.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "3513597.jpg",
    "o": "",
    "st": "allrecipes"
}