{
    "id": 220442,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup vegetable shortening",
        "1 1/2 cups white sugar",
        "2 eggs",
        "1 cup buttermilk",
        "2 tablespoons unsweetened cocoa powder",
        "1 teaspoon salt",
        "1 teaspoon vanilla extract",
        "2 1/2 cups sifted all-purpose flour",
        "2 tablespoons red food coloring, or as needed",
        "2 tablespoons green food coloring, or as needed",
        "3/4 teaspoon baking soda",
        "1 1/2 teaspoons distilled white vinegar",
        "3/4 teaspoon baking soda",
        "1 1/2 teaspoons distilled white vinegar"
    ],
    "nut": [
        "Calories > 290 kcal",
        "Carbs > 46.4 g",
        "Cholesterol > 32 mg",
        "Fat > 9.9 g",
        "Protein > 4.6 g",
        "Sodium > 385 mg"
    ],
    "n": "Red and Green Velvet Cake!",
    "a": "arielxxlynn",
    "r": "0",
    "s": 12,
    "des": "\"I wanted to make something creative for Christmas, but I didn't want to make a simple red velvet cake. So this is what I came up with! A very colorful red and green velvet cake! This is fairly simple, and meant to prevent dirtying up a lot of dishes.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nGrease a 9x13-inch sheet pan.\nMash vegetable shortening and sugar together in a large bowl until smooth and creamy; beat in eggs until fully incorporated.\nStir buttermilk, cocoa powder, salt, and vanilla extract into the shortening mixture until the liquid ingredients are an even color and texture.\nSift flour into the liquid ingredients until combined.\nPour half the batter into a separate bowl.\nLightly stir red food color into one bowl of batter and green food color into the other bowl of batter.\nQuickly fold 3/4 teaspoon baking soda and 1 1/2 teaspoon white vinegar into the bowl of red batter; quickly fold 3/4 teaspoon baking soda and 1 1/2 teaspoon white vinegar into the bowl of green batter.\nPour the red and green batters into the prepared sheet pan in alternating colors.\nBake in the preheated oven until the cake is lightly browned on top and a toothpick inserted in the center comes out clean, 25 to 30 minutes. Allow to cool completely before frosting.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "1078090.jpg",
    "o": "",
    "st": "allrecipes"
}