{
    "id": 220440,
    "old_rating": "2.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "3 tablespoons butter",
        "1 pound asparagus (the thinner the better), trimmed",
        "1 pound sliced fresh mushrooms",
        "2 large tomatoes, chopped",
        "1 lemon, juiced",
        "1/2 cup butter",
        "1 pound uncooked shrimp, peeled and deveined",
        "1 pound sea scallops",
        "1 lemon, juiced",
        "2 tablespoons butter",
        "1/4 teaspoon salt",
        "1/2 lemon, juiced",
        "1 (16 ounce) package angel hair pasta",
        "2 (8 ounce) packages shredded Italian cheese blend with Asiago cheese (such as SargentoÂ®)"
    ],
    "nut": [
        "Calories > 654 kcal",
        "Carbs > 39.5 g",
        "Cholesterol > 201 mg",
        "Fat > 37.9 g",
        "Protein > 41.6 g",
        "Sodium > 1000 mg"
    ],
    "n": "Sea-Purb Seafood Pasta",
    "a": "Carolyn Mantia",
    "r": "0",
    "s": 8,
    "des": "\"A nice light seafood dish, always a crowd pleaser.\"",
    "ins": "Heat olive oil and 3 tablespoons butter in a large skillet over medium-high heat; cook and stir asparagus until tender and browned, about 10 minutes.\nStir mushrooms into the skillet and cook and stir until they have given off their liquid, about 5 more minutes. Stir in tomatoes and cook until softened, 2 to 3 minutes; mix in juice of 1 lemon. Set the vegetables aside.\nMelt 1/2 cup butter in a separate large skillet over medium heat and cook and stir shrimp and scallops in butter until shrimp are bright pink and the seafood is slightly opaque, 3 to 5 minutes. Mix juice of 1 lemon into seafood, turn heat to low, and continue to cook seafood until fully opaque, 3 more minutes. Drain excess liquid if necessary, leaving 2 tablespoons of liquid in skillet.\nBring a large pot of water to a boil and stir in 2 tablespoons butter, salt, and juice of half a lemon. Stir angel hair pasta into the boiling water and cook until pasta is tender but still slightly firm, about 5 minutes. Stir occasionally during cooking; drain well and transfer to a large bowl.\nDrain liquid from asparagus mixture if needed, and stir vegetables into the pasta.\nLightly toss vegetables and angel hair pasta with 1 package of Italian cheese blend; mix in the cooked shrimp and scallops.\nMix  remaining package of Italian cheese blend into pasta mixture and allow to stand until cheese melts, about 3 minutes; toss again and serve.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "4100483.jpg",
    "o": "",
    "st": "allrecipes"
}