{
    "id": 220418,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound chicken breast tenderloins",
        "1 pinch garlic salt, or to taste",
        "1 pinch seasoned salt, or to taste",
        "1 pound uncooked penne pasta",
        "2 tablespoons butter",
        "1/4 cup grated Parmesan cheese",
        "2 tablespoons olive oil",
        "1 pound fresh asparagus, trimmed and cut crosswise into thirds",
        "1 pinch garlic salt, or to taste"
    ],
    "nut": [
        "Calories > 458 kcal",
        "Carbs > 58.2 g",
        "Cholesterol > 56 mg",
        "Fat > 12.9 g",
        "Protein > 28.8 g",
        "Sodium > 269 mg"
    ],
    "n": "Chicken and Asparagus with Penne Pasta",
    "a": "sandiq",
    "r": "0",
    "s": 6,
    "des": "\"Easy dinner that tastes amazing.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nCover a baking sheet with aluminum foil.\nSpread the chicken breast tenderloins on the baking sheet and sprinkle with garlic salt and seasoned salt.\nBake chicken in the preheated oven until no longer pink in the center and the juices run clear, about 15 minutes. Set aside; when cool enough to handle, cut tenderloins into bite-size pieces.\nFill a large pot with lightly salted water, bring to a boil, and stir in penne. Cook pasta at a boil, stirring occasionally, until penne are cooked through but still slightly firm, about 11 minutes; drain.\nTransfer penne back to cooking pot and stir in butter and Parmesan cheese until pasta is coated.\nHeat olive oil in a skillet over medium heat; place asparagus into the hot oil and sprinkle with garlic salt. Cook and stir until asparagus are tender, about 7 minutes.\nTransfer penne pasta into a large serving bowl and top with asparagus and chicken tenderloin pieces. Lightly mix asparagus and chicken into the pasta to serve.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "841187.jpg",
    "o": "4488220.jpg,4476719.jpg,3178297.jpg,3027416.jpg,2794805.jpg,2671740.jpg",
    "st": "allrecipes"
}