{
    "id": 220593,
    "old_rating": "4.65957",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 ounces vegan sour cream (such as TofuttiÂ®)",
        "1/2 cup water",
        "3 tablespoons dried minced onion",
        "2 tablespoons all-purpose flour",
        "2 teaspoons vegan no-beef bouillon",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon dried basil",
        "1/4 teaspoon ground black pepper",
        "1/2 cup dry red wine",
        "1 tablespoon olive oil",
        "2 tablespoons soy sauce",
        "1 tablespoon balsamic vinegar",
        "2 cloves garlic, minced",
        "2 large portobello mushroom caps, stems and gills removed",
        "cooking spray",
        "1/4 cup water, or as needed (optional)"
    ],
    "nut": [
        "Calories > 259 kcal",
        "Carbs > 25.9 g",
        "Cholesterol > 0 mg",
        "Fat > 13.5 g",
        "Protein > 3.3 g",
        "Sodium > 778 mg"
    ],
    "n": "Vegan Portobello Stroganoff",
    "a": "Percy Lee Owen",
    "r": "0",
    "s": 4,
    "des": "\"A vegan version of an old classic. Meaty marinated portobellos give this dish the taste and mouth-feel of the original.\"",
    "ins": "Whisk vegan sour cream, 1/2 cup water, minced onion, flour, vegan bouillon, garlic powder, basil, and black pepper in a bowl. Cover and refrigerate.\nPreheat oven to 400 degrees F (200 degrees C).\nWhisk red wine, olive oil, soy sauce, balsamic vinegar, and garlic in another bowl.\nArrange mushroom caps with gill sides up in a baking dish and pour red wine mixture on top. Marinate for 20 minutes, then cover baking dish with aluminum foil.\nBake mushrooms in the preheated oven for 30 minutes. Remove foil, flip mushrooms, and continue baking until very tender, about 10 minutes more. Set aside to cool; dice mushrooms.\nHeat a saucepan sprayed with cooking spray over medium heat. Cook and stir mushrooms in sauce pan until lightly browned, about 5 minutes; reduce heat to low.\nStir sour cream sauce into mushrooms. Continue to cook and stir until thickened, 1 to 2 minutes more. If the sauce becomes too thick, stir in 1/4 cup water.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "935759.jpg",
    "o": "4506224.jpg,4476322.jpg,4146403.jpg,4090440.jpg,3826255.jpg,2907947.jpg",
    "st": "allrecipes"
}