{
    "id": 220529,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Brine:",
        "8 cups water",
        "1 1/4 cups kosher salt",
        "2 tablespoons white sugar",
        "Pickling Spice:",
        "1 cinnamon stick, broken into pieces",
        "12 whole juniper berries",
        "8 whole cloves",
        "8 whole allspice berries",
        "1 teaspoon mustard seeds",
        "1 teaspoon black peppercorns",
        "1/2 teaspoon ground ginger",
        "2 bay leaves, crumbled",
        "1 (6 pound) beef brisket, or larger, as desired",
        "Corned Beef Dinner:",
        "water to cover",
        "1 teaspoon sea salt",
        "2 pounds celery root (celeriac), peeled and cut into cubes",
        "2 pounds red potatoes, cut into cubes",
        "1 pound rutabagas, peeled and cut into cubes",
        "4 carrots - peeled, halved lengthwise, and cut into 1/2-inch strips",
        "4 parsnips - peeled, halved lengthwise, and cut into 1/2-inch strips",
        "2 onions, sliced",
        "1 head cabbage, cut into eighths"
    ],
    "nut": [
        "Calories > 318 kcal",
        "Carbs > 28.9 g",
        "Cholesterol > 61 mg",
        "Fat > 13.5 g",
        "Protein > 21.3 g",
        "Sodium > 6559 mg"
    ],
    "n": "O'Kee's Healthy Gray Corned Beef Brisket from Scratch",
    "a": "Dana Kee",
    "r": "0",
    "s": 18,
    "des": "\"Plan 2 weeks for prep! 'Gray Corned Beef' omits the meat pinking saltpeter, which isn't the traditional preparation method anyway; this version will taste 'beefier.' The result is far less salty than commercially-prepared corned beef, and you can have fun creating your own pickling spices to create a complex flavor. While the color might not appeal to you, having corned beef without nitrates will. Serve with oatmeal Irish soda bread and stone-ground mustard.\"",
    "ins": "Bring 8 cups water to a boil in a pot. Stir salt and sugar into boiling water until dissolved; remove from heat and add cinnamon stick pieces, juniper berries, cloves, allspice berries, mustard seeds, peppercorns, ginger, and crumbled bay leaves.\nLet brine cool to room temperature, at least 1 hour.\nPlace brisket in a large ceramic or glass dish deep enough to keep brisket submerged in brine. Pour brine over brisket. Place something atop the brisket to weigh it down and keep it submerged in liquid. Cover dish tightly with plastic wrap.\nBrine brisket in refrigerator, checking brine level every day, for 7 to 10 days.\nRemove brisket from brine and rinse under cool running water. Discard brine.\nPlace brisket in a large slow cooker crock; add enough cool water to cover brisket by several inches and season with sea salt.\nCook on High for 2 hours; add celery root, red potatoes, rutabagas, carrots, parsnips, and onions. Cooking on Low until the vegetables are softened and the brisket is hot, and grey in the center, about 30 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).\nRemove brisket to a cutting board and cover tightly with aluminum foil.\nArrange cabbage wedges into the slow cooker; continue cooking until all vegetables are tender, 20 to 30 minutes.\nSlice corned beef into thin slices and serve with the vegetables.",
    "pt": "25 m",
    "ct": "2 h ",
    "tt": "7 d ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}