{
    "id": 220538,
    "old_rating": "4.45833",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "1 onion, diced",
        "1 green bell pepper, diced",
        "5 potatoes, diced",
        "1 (16 ounce) bag frozen chopped broccoli, thawed",
        "1 pound diced cooked ham",
        "1 (8 ounce) package sliced fresh mushrooms",
        "2 stalks celery, diced",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1 (8 ounce) container sour cream",
        "1 (4 ounce) package cream cheese",
        "6 ounces shredded Monterey Jack cheese",
        "1/2 cup buttery round crackers (such as RitzÂ®), crushed"
    ],
    "nut": [
        "Calories > 568 kcal",
        "Carbs > 41.8 g",
        "Cholesterol > 79 mg",
        "Fat > 34.5 g",
        "Protein > 24.6 g",
        "Sodium > 1306 mg"
    ],
    "n": "Ham and Potato Casserole",
    "a": "RJVDK",
    "r": "0",
    "s": 8,
    "des": "\"My wife had a craving for ham and potatoes and we had several items we wanted to use up. We didn't cook the celery with the onion and green pepper to add some additional crunch, but they could be cooked together.  We used reduced-fat ingredients throughout and had great success.  We found that there were no spices needed as the vegetables were a great flavor combination! This recipe ended up being a winner with everyone in the family!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nSpray a skillet with cooking spray. Cook and stir onion and green pepper over medium heat until onions are translucent, 5 to 7 minutes.\nSpray a 9x13-inch baking dish with cooking spray.\nCombine cooked onion, green pepper, potatoes, broccoli, ham, mushrooms, and celery in the prepared baking dish, stirring to distribute the vegetables and ham.\nStir cream of mushroom soup, sour cream, and cream cheese together in the same skillet used for onion and green pepper; mix until combined and smooth.\nStir soup mixture into vegetable and ham mixture until combined. Mix in the Monterey Jack cheese.\nBake in preheated oven until vegetables are tender and sauce is bubbling, about 35 minutes.\nSprinkle with cracker crumbs and return to oven until topping is lightly browned, about 5 minutes.",
    "pt": "25 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "2612811.jpg",
    "o": "2612808.jpg,2288731.jpg,2274867.jpg,2137739.jpg,1126464.jpg,882333.jpg",
    "st": "allrecipes"
}