{
    "id": 220505,
    "old_rating": "4.73214",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup butter",
        "1 large yellow onion, chopped",
        "2 leeks, white and pale-green parts only, rinsed and coarsely chopped",
        "4 cloves garlic, smashed",
        "1 stalk celery, cut into chunks",
        "4 cups vegetable stock",
        "5 potatoes, peeled and cubed",
        "1 cup vegetable stock",
        "1 1/4 cups sliced baby carrots",
        "3 tablespoons chopped green onion",
        "3/4 cup heavy cream",
        "salt and ground black pepper to taste",
        "6 tablespoons shredded Cheddar cheese (optional)"
    ],
    "nut": [
        "Calories > 408 kcal",
        "Carbs > 45.8 g",
        "Cholesterol > 70 mg",
        "Fat > 22.2 g",
        "Protein > 8.3 g",
        "Sodium > 544 mg"
    ],
    "n": "Irish Root Soup",
    "a": "Erincorks",
    "r": "0",
    "s": 6,
    "des": "\"A hearty potato soup that goes great with soda bread and an Irish stout.\"",
    "ins": "Melt the butter in a large stockpot over medium heat; cook and stir the onion, leeks, garlic, and celery in the melted butter until tender, about 10 minutes.\nPour 4 cups vegetable stock into the stockpot; add the potatoes. Bring the mixture to a boil, reduce heat to medium-low, and cook the mixture at a simmer 20 minutes.\nDivide the stock mixture into 3 batches with equal amounts of liquid and vegetables; set aside to cool for 30 minutes.\nPour 1 batch of the stock mixture into a blender, filling the pitcher no more than halfway. Hold the blender lid firmly in place and carefully start the blender; use a few quick pulses to get the mixture moving before leaving it on to puree. Repeat process with second batch. Return the pureed batches to the stockpot.\nDivide third batch into two equal batches. Puree only one of the two batches before returning both to the stockpot.\nBring 1 cup vegetable stock to a simmer in a small pot over medium-low heat. Cook the carrots in the simmering stock until soft, 5 to 7 minutes; add to the puree in the stockpot.\nStir the green onion and heavy cream through the puree; continue cooking another 5 minutes.\nSeason with salt and pepper; top with Cheddar cheese to serve.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "995236.jpg",
    "o": "4473769.jpg,3798503.jpg,3098933.jpg,1712823.jpg,996492.jpg,808829.jpg",
    "st": "allrecipes"
}