{
    "id": 220586,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 shallot, thinly sliced",
        "1 tablespoon olive oil",
        "1 1/2 pounds sweet Italian sausage links",
        "1 (16 ounce) package refrigerated gnocchi",
        "1/4 cup unsalted butter",
        "1/3 cup milk",
        "1 (8 ounce) package shredded Italian cheese blend",
        "1 tablespoon chopped fresh basil"
    ],
    "nut": [
        "Calories > 903 kcal",
        "Carbs > 30.2 g",
        "Cholesterol > 162 mg",
        "Fat > 69.8 g",
        "Protein > 38.9 g",
        "Sodium > 1968 mg"
    ],
    "n": "Bangers and Gnocchi with a Roasted Shallot and Cheese Sauce",
    "a": "Jose Napoleon Cuasay Artiaga I",
    "r": "0",
    "s": 4,
    "des": "\"A classic with a twist and a bit of extra effort. It's a unique dish packed with flavor.\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C).\nToss sliced shallot with olive oil in a heavy pot or dutch oven until well coated.\nArrange sausages atop shallot mixture.\nBake in the preheated oven until the sausage is no longer pink in the center, turning sausages occasionally to brown evenly, 25 to 30 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).\nTransfer sausages to a platter; cover and set aside.\nMelt butter in the pot used to cook the sausage over medium heat. Stir in milk and bring to a low simmer.\nGradually stir in about 3/4 of the Italian cheese blend until melted; reserve the remaining cheese for topping. Remove cheese sauce from heat, stirring occasionally to keep sauce smooth.\nBring a large pot of lightly salted water to a rolling boil. Cook the gnocchi at a boil until it floats to the top, about 3 minutes; drain.\nServe sausage and gnocchi topped with cheese sauce and sprinkle with reserved cheese and basil.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "45 m",
    "i": "812399.jpg",
    "o": "",
    "st": "allrecipes"
}