{
    "id": 220502,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 pounds fresh tomatillos, husks removed",
        "2 large onions (keep the skin on)",
        "2 poblano peppers",
        "1 head garlic",
        "3 chipotle peppers in adobo sauce",
        "2 (12 fluid ounce) cans or bottles lager-style beer",
        "1 tablespoon ground cumin",
        "1 tablespoon salt",
        "1 tablespoon ground black pepper",
        "4 tablespoons vegetable oil",
        "4 pounds cubed lamb stew meat"
    ],
    "nut": [
        "Calories > 487 kcal",
        "Carbs > 24.6 g",
        "Cholesterol > 124 mg",
        "Fat > 22.4 g",
        "Protein > 41.9 g",
        "Sodium > 1011 mg"
    ],
    "n": "Paddy's Chile Verde",
    "a": "wsf",
    "r": "0",
    "s": 8,
    "des": "\"One Easter I was unable to find a leg of lamb to roast, as is traditional in my family. The best I could find was chunks of lamb, in my local Mexican market. So I decided to defy tradition and use the ingredients around me. Best Irish-Mexican Easter EVER! Serve with toasted flaked almonds, crumbled cotija cheese, and homemade croutons.\"",
    "ins": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nArrange the tomatillos, onions, poblano peppers, and garlic on a baking sheet.\nCook the vegetables under the broiler until the skins are charred on the side facing the heater elements; turn the vegetables and continue cooking until equally charred, 3 to 5 minutes per side.\nRemove and discard the root and outer skin from the onion and garlic; remove and discard the stem and seeds from the peppers.\nWorking in batches, combine some of the tomatillos, onion, poblano peppers, garlic, chipotle peppers in adobo sauce, lager-style beer, cumin, salt, and pepper in a blender to about half full. Holding the lid in place, pulse a few times to get the mixture moving before leaving the blender on to puree to a smooth texture; pour into a slow cooker.\nHeat the oil in a large saucepan. Cook and stir the lamb cubes in the hot oil until browned on all side, about 5 minutes; transfer to the slow cooker.\nCook on High for 4 hours.",
    "pt": "30 m",
    "ct": "4 h ",
    "tt": "4 h ",
    "i": "997743.jpg",
    "o": "",
    "st": "allrecipes"
}