{
    "id": 220585,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups heavy whipping cream",
        "1 1/2 cups whole milk",
        "1 cup white sugar",
        "1 vanilla bean",
        "6 egg yolks, beaten",
        "1 (12 fluid ounce) can or bottle Irish stout beer (such as GuinnessÂ®)"
    ],
    "nut": [
        "Calories > 376 kcal",
        "Carbs > 30.9 g",
        "Cholesterol > 240 mg",
        "Fat > 26.8 g",
        "Protein > 4.7 g",
        "Sodium > 47 mg"
    ],
    "n": "GuinnessÂ® Ice Cream",
    "a": "ScandoGirl",
    "r": "0",
    "s": 8,
    "des": "\"Subtle smoky/chocolatey flavors make this ice cream a divine treat for St. Patrick's Day or any day. Don't skimp on the cream! How about a scoop on top of a brownie or chocolate cake?\"",
    "ins": "Combine cream, milk, and sugar in a saucepan over medium heat. Stir until sugar has dissolved, about 5 minutes.\nSplit the vanilla bean lengthwise with a sharp knife and scrape seeds into cream mixture. Place bean pod into mixture and bring to a boil. Remove from heat and discard vanilla bean pod.\nPlace egg yolks in a bowl. Gradually whisk in 1 cup hot cream mixture.\nWhisk the egg yolk mixture back into the saucepan and place over medium heat. Whisk constantly until slightly thickened, about 2 to 3 minutes. Mixture should coat the back of a spoon. Do not let the mixture boil.\nTransfer cream mixture to a bowl and chill until cold, at least 2 hours to overnight.\nSimmer Irish stout beer in a saucepan over low heat until reduced to 2/3 cup, about 15 minutes. Chill the stout beer syrup at least 2 hours to overnight.\nWhisk together chilled cream mixture and beer syrup; pour into an ice cream maker and freeze according to manufacturer's directions.\nWhen machine has finished, pack ice cream into a airtight container and store in freezer.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "5 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}