{
    "id": 220696,
    "old_rating": "4.63636",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon salt",
        "5 cups water",
        "1/2 (16 ounce) package fusilli pasta",
        "1 1/2 bunches Swiss chard, leaves sliced, stems reserved",
        "1 tablespoon chicken bouillon granules",
        "2 (3.5 ounce) links Italian sausage",
        "1 tablespoon butter",
        "1/8 teaspoon red pepper flakes",
        "1 onion, chopped",
        "3 cloves garlic, crushed",
        "2 tablespoons balsamic vinegar",
        "1 (15 ounce) can kidney beans, rinsed and drained",
        "1 tomato, chopped",
        "salt and ground black pepper to taste",
        "1 (6 ounce) container crumbled feta cheese"
    ],
    "nut": [
        "Calories > 580 kcal",
        "Carbs > 69.2 g",
        "Cholesterol > 63 mg",
        "Fat > 22.7 g",
        "Protein > 27.7 g",
        "Sodium > 2159 mg"
    ],
    "n": "Swiss Chard, Sausage, Pasta, and Bean Casserole",
    "a": "Katie",
    "r": "0",
    "s": 4,
    "des": "\"Lots of chard this summer so decided to whip up a new dish...surprise, surprise, the kids ate it all up and asked for more!\"",
    "ins": "Preheat the oven to 375 degrees F (190 degrees C).\nBring 1 teaspoon salt and water to a boil. Stir in the fusilli, and return to a boil. Cook the pasta uncovered, stirring occasionally for about 6 minutes.\nStir Swiss chard stems and chicken bouillon granules into pasta and water. Continue cooking until pasta has cooked through but is still slightly firm, about 6 more minutes. Reserve 1 cup of the cooking liquid. Drain pasta and chard stems.\nHeat a large skillet over medium-high heat. Cook sausage links until evenly browned and no longer pink in the center. Transfer sausage to a plate and slice.\nHeat butter and red pepper flakes over medium heat in the skillet used to cook sausage; cook and stir onion and garlic in butter until tender and onion is translucent, about 5 minutes.\nStir sliced Swiss chard leaves and balsamic vinegar into onion mixture and cook, stirring occasionally, until chard leaves are tender, about 5 minutes.\nMix kidney beans and tomato into chard leaf and onion mixture; continue to cook for 3 more minutes.\nStir pasta, chard stems, and 1/2 of the reserved cooking liquid into the vegetables. Season with salt and black pepper. If the sauce becomes too dry, add remaining cooking liquid.\nTransfer pasta mixture to a large baking dish.\nArrange sliced sausage and crumbled feta cheese atop pasta, pressing the mixture down.\nBake in the preheated oven until feta cheese begins to melt, about 15 minutes.  Turn on the oven's broiler and broil until cheese is browned, 3 to 5 more minutes.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "50 m",
    "i": "888275.jpg",
    "o": "",
    "st": "allrecipes"
}