{
    "id": 220622,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 small boiling potatoes",
        "1/4 cup fat-free sour cream",
        "1 pound asparagus",
        "6 cups vegetable broth",
        "2 tablespoons olive oil",
        "1 cup chopped onion",
        "2 cloves garlic, crushed",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1 clove garlic, crushed",
        "1/4 cup dry white wine (optional)",
        "1 pinch cayenne pepper",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 167 kcal",
        "Carbs > 23.7 g",
        "Cholesterol > 2 mg",
        "Fat > 5.3 g",
        "Protein > 6 g",
        "Sodium > 485 mg"
    ],
    "n": "Guilt-Free Cream of Asparagus Soup",
    "a": "Lucia Dargis",
    "r": "0",
    "s": 6,
    "des": "\"I love this recipe because it is so easy to make and filling. If doing a low-carb diet you can eliminate the potato. I have also substituted the asparagus with broccoli and/or spinach.\"",
    "ins": "Place the potatoes into a small pot with enough water to cover; bring to a boil, then reduce heat to medium-low, place a cover on the pot, and simmer until tender, about 20 minutes.\nDrain the potatoes and transfer to a bowl; add the sour cream and mash lightly; scrape into the bowl of a blender.\nCut asparagus into 3 parts: woody ends, tips, and center pieces.\nCombine the woody ends of the asparagus with the vegetable broth in a stockpot; bring to a boil and cook until the woody ends are tender. Remove woody ends with a slotted spoon and discard.\nRemove 2 tablespoons broth to a bowl with the asparagus tips. Transfer remainder of stock to blender with the potatoes.\nChop the middle segments of the asparagus.\nHeat olive oil in a skillet over low-heat; cook and stir the chopped asparagus, chopped onion, and 2 crushed cloves garlic in the hot oil until the asparagus is tender, about 10 minutes. Add to the broth in the blender, reserving oil in the skillet.\nBlend the mixture in the blender on high until smooth and creamy; return to the stockpot.\nCook and stir the sliced mushrooms and 1 crushed garlic clove in the remaining oil over medium-low heat until the mushrooms soften, 3 to 5 minutes. Add the white wine; cook another 1 to 2 minutes. Stir the mushroom mixture into the soup.\nHeat the asparagus tips and broth in the microwave for 2 minutes; stir into the soup.\nSeason the soup with cayenne pepper, salt, and black pepper.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "1583968.jpg",
    "o": "",
    "st": "allrecipes"
}