{
    "id": 220620,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound fresh green beans, trimmed and cut into bite-size pieces",
        "1 tablespoon extra-virgin olive oil",
        "1 pound fresh asparagus, trimmed and cut into bite-size pieces",
        "1 tablespoon extra-virgin olive oil",
        "1/2 red onion, chopped",
        "2 cups cherry tomatoes, halved",
        "1/4 cup chopped fresh parsley",
        "kosher salt to taste",
        "ground black pepper to taste",
        "1 tablespoon extra-virgin olive oil, or as desired (optional)"
    ],
    "nut": [
        "Calories > 86 kcal",
        "Carbs > 8.8 g",
        "Cholesterol > 0 mg",
        "Fat > 5.3 g",
        "Protein > 2.7 g",
        "Sodium > 59 mg"
    ],
    "n": "Green Bean and Asparagus Salad",
    "a": "Sarah",
    "r": "0",
    "s": 8,
    "des": "\"Very tasty salad of roasted asparagus and green beans. I got the inspiration when I was indecisive about choosing between the two vegetables for a side dish. Roasting the vegetables brings out their great flavor and the addition of cherry tomatoes, onion, and fresh parsley give it a lovely color.\"",
    "ins": "Preheat an oven to 400 degrees F (200 degrees C).\nToss green bean pieces and 1 tablespoon olive oil in a bowl until the green beans are evenly coated; spread onto a baking sheet.\nRoast green beans in preheated oven until tender, about 10 minutes.\nToss asparagus pieces and 1 tablespoon oil in a bowl until the asparagus is evenly coated; spread onto the baking sheet with the partially roasted green beans.\nContinue roasting the green bean and asparagus mixture until tender, 10 to 12 minutes.\nToss the roasted green beans and asparagus with red onion, cherry tomatoes, and parsley in a large bowl; season with kosher salt and black pepper. Drizzle with olive oil to taste, if desired.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "850644.jpg",
    "o": "4509462.jpg,3925890.jpg,3669502.jpg,3523411.jpg,2850310.jpg,2419648.jpg",
    "st": "allrecipes"
}