{
    "id": 220603,
    "old_rating": "3.88462",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 skinless, boneless chicken breast halves, cut into 1/4-inch wide strips",
        "1 lime, juiced",
        "1/2 teaspoon ground cumin",
        "1/4 teaspoon paprika",
        "1/4 teaspoon chili powder",
        "1/8 teaspoon cayenne pepper, or to taste",
        "1/8 teaspoon ground black pepper, or to taste",
        "1 tablespoon olive oil",
        "1 red bell pepper, cut into 1/4 inch strips",
        "1/2 large red onion, sliced 1/4-inch thick",
        "4 (6 inch) corn tortillas",
        "1/4 cup sour cream, divided",
        "1/2 cup shredded Cheddar-Monterey Jack cheese blend, divided",
        "1 cup shredded lettuce, divided",
        "1/2 cup diced tomato, divided"
    ],
    "nut": [
        "Calories > 257 kcal",
        "Carbs > 19.7 g",
        "Cholesterol > 49 mg",
        "Fat > 12.6 g",
        "Protein > 17.4 g",
        "Sodium > 136 mg"
    ],
    "n": "Swanny's Killer Fajitas",
    "a": "Huge",
    "r": "0",
    "s": 4,
    "des": "\"This is a great basic fajita recipe which can be tweaked to accommodate the whole family. Add some black beans or Spanish rice. Easy to spice up or down. Top each serving with a sprinkle of fresh cilantro and spoonfuls of sour cream, taco sauce, and guacamole.\"",
    "ins": "Place chicken strips in a bowl and stir in lime juice, cumin, paprika, chili powder, cayenne pepper, and black pepper; marinate chicken for 15 to 30 minutes.\nHeat a large skillet or wok over medium heat and pour in olive oil. Cook and stir red bell pepper and onion in the hot oil until softened, about 5 minutes; move vegetables to the outer edge of the skillet.\nPlace chicken strips with marinade in the center of the skillet and cook and stir until chicken is no longer pink in the center and juices run clear, about 3 minutes; cook and stir chicken and vegetables together until liquid in skillet has evaporated, about 2 more minutes. Set chicken and vegetables aside.\nPlace corn tortillas on a microwave-safe plate with damp paper towels separating each tortilla. Cook in microwave until tortillas are hot and flexible, about 30 seconds.\nPlace corn tortillas onto 4 serving plates; spread each tortilla with 1 tablespoon sour cream.\nTop each tortilla with 1/4 of the chicken and vegetable mixture; sprinkle with 2 tablespoons shredded Cheddar-Monterey Jack cheese blend.\nSprinkle each tortilla with 1/4 cup lettuce and 2 tablespoons diced tomato.\nTop with any other desired toppings; repeat with remaining tortillas and ingredients.",
    "pt": "30 m",
    "ct": "5 m",
    "tt": "50 m",
    "i": "1023709.jpg",
    "o": "4463691.jpg,1126973.jpg,1126233.jpg,1126154.jpg,818545.jpg,809578.jpg",
    "st": "allrecipes"
}