{
    "id": 220772,
    "old_rating": "4.27586",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "1/2 yellow onion, chopped",
        "1 (14 ounce) can refried beans",
        "1 cup shredded sharp Cheddar cheese",
        "1 (1 ounce) package taco seasoning",
        "6 (9 inch) flour tortillas",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "8 ounces sour cream",
        "1/2 cup salsa, or to taste (optional)",
        "1 1/2 cups shredded sharp Cheddar cheese"
    ],
    "nut": [
        "Calories > 745 kcal",
        "Carbs > 51.9 g",
        "Cholesterol > 118 mg",
        "Fat > 43.7 g",
        "Protein > 35.2 g",
        "Sodium > 1724 mg"
    ],
    "n": "Court's Creamy and Quick Burritos",
    "a": "Courtney Servantes",
    "r": "0",
    "s": 6,
    "des": "\"This is a simple recipe that my family loves. I passed it along to my mom several years ago and she loves it as well. I sometimes add in a can of green chilies along with a diced jalapeno to the meat mixture. Hope all will enjoy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nCook ground beef and onion in a skillet over medium heat until the beef is completely browned, 7 to 10 minutes. Drain excess grease from the skillet.\nStir refried beans, 1 cup Cheddar cheese, and taco seasoning into the drained ground beef mixture.\nSpoon ground beef mixture down the center of each tortilla. Roll the tortillas around the beef filling.\nStir cream of mushroom soup, sour cream, and salsa together in a bowl.\nSpread about 1/2 the cream of mushroom soup mixture into the bottom of a 9x13-inch baking dish.\nArrange rolled tortillas into a single layer in the baking dish with the seam side down.\nPour remaining cream of mushroom soup mixture over the tortillas.\nTop with 1 1/2 cups Cheddar cheese.\nBake in preheated oven until cheese is bubbly and melted, 30 to 35 minutes.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "4464357.jpg",
    "o": "",
    "st": "allrecipes"
}