{
    "id": 220780,
    "old_rating": "3.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 thick slices bacon, diced",
        "1 tablespoon bacon drippings",
        "3 leeks, thinly sliced (white and pale green parts only)",
        "2 stalks celery, chopped",
        "2 cloves garlic, minced",
        "4 red potatoes, cut into 1-inch pieces",
        "4 cups chicken broth",
        "2 cups water",
        "1/2 teaspoon dried thyme",
        "1/2 teaspoon ground paprika",
        "1 pinch cayenne pepper",
        "salt and ground black pepper to taste",
        "3 sprigs fresh thyme",
        "1 cup frozen sweet corn",
        "1/2 cup milk",
        "18 large tiger shrimp",
        "2 tablespoons cornstarch",
        "1 tablespoon water",
        "1 tablespoon chopped fresh parsley"
    ],
    "nut": [
        "Calories > 284 kcal",
        "Carbs > 39.8 g",
        "Cholesterol > 80 mg",
        "Fat > 7.5 g",
        "Protein > 15.7 g",
        "Sodium > 950 mg"
    ],
    "n": "Leek and Potato Soup with Shrimp and Corn",
    "a": "angie",
    "r": "0",
    "s": 6,
    "des": "\"A sweet and fragrant broth-based soup, seasoned with fresh thyme and finished with a touch of milk. Shrimp and corn add sweetness, and the broth can be easily adjusted for richness - use milk to keep it light, or cream to give it more of a chowder consistency.\"",
    "ins": "Cook and stir bacon in a skillet over medium heat  until evenly browned, about 10 minutes. Drain bacon on a paper towel-lined plate, reserving about 1 tablespoon bacon grease in the skillet.\nCook and stir leeks and celery in bacon grease over medium heat until leeks soften, about 5 minutes.\nStir garlic into leek mixture until fragrant, about 2 minutes more. Transfer mixture to a slow cooker.\nPlace drained bacon, potatoes, chicken broth, 2 cups water, dried thyme, paprika, cayenne pepper, salt, and black pepper in the slow cooker.\nTie sprigs of fresh thyme together with kitchen string and add to the slow cooker.\nCook on High for 4 hours; add corn and cook for 1 more hour.\nReduce heat to Low; stir in milk and cook uncovered until slightly thickened, 30 to 40 minutes.\nMeanwhile, bring a pot of water a boil. Cook tiger shrimp in boiling water until they are bright pink and no longer translucent in the center, about 3 minutes. Drain. Allow shrimp to cool slightly before peeling.\nMix cornstarch and 1 tablespoon water in a bowl until combined.\nStir cornstarch mixture into slow cooker and heat until the soup thickens, about 3 minutes.\nStir peeled shrimp and parsley into soup. Remove fresh thyme sprigs and season soup with salt and black pepper before serving.",
    "pt": "35 m",
    "ct": "6 h",
    "tt": "6 h ",
    "i": "1090291.jpg",
    "o": "",
    "st": "allrecipes"
}