{
    "id": 220769,
    "old_rating": "4.9",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (1 pound) loaves frozen bread dough, thawed",
        "2 raisins",
        "2 sliced almonds",
        "1 egg, beaten",
        "6 lettuce leaves"
    ],
    "nut": [
        "Calories > 264 kcal",
        "Carbs > 44 g",
        "Cholesterol > 19 mg",
        "Fat > 4.2 g",
        "Protein > 9.8 g",
        "Sodium > 516 mg"
    ],
    "n": "Bunny Bread",
    "a": "icook",
    "r": "0",
    "s": 10,
    "des": "\"I love this bunny bread. I make it every Easter and have it at my Easter dinner.  Sometimes I cut a hole in the tummy and fill with dip, or eat it as bread with dinner. S0 easy to make and my kids love helping me. I have also made this with rosemary bread and wheat bread.\"",
    "ins": "Grease a baking sheet.\nCut off 1/4 of the dough from 1 loaf and form into a pear-shaped ball for the bunny head.\nForm the remaining 3/4 loaf into a fat oval shape for the body. Place the body onto the prepared baking sheet and attach the head by pinching the 2 pieces together.\nMake narrow cuts, about 3/4 in deep, on each side of head for whiskers.\nCut second loaf of dough into 4 equal pieces. Roll 2 pieces into 16-inch ropes. Fold each rope in half, and pinch the ends to the head to form ears.\nCut the third piece of dough in half and shape into 2 ovals about 3 1/2 inches long for back paws. Attach the paws to the bottom sides of the body. Make two 1-inch cuts on the paws for toes.\nCut the remaining dough into 3 pieces. Form 2 pieces into balls and pinch on sides for front paws.\nDivide the remaining piece of dough into 3 equal pieces and roll into 1-inch balls. Press the dough balls onto the  the face to form two cheeks and a nose.\nPress raisins onto the face to make eyes.\nPress almond slices close together onto face to make bunny teeth.\nCover and let dough rise in a warm place until doubled, 30 to 45 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBrush the loaf lightly with beaten egg.\nBake in the preheated oven until golden brown, 25 to 30 minutes. Remove to a wire rack to cool.\nTo serve, line a serving platter with lettuce leaves and place the bunny in the center.",
    "pt": "45 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "1122530.jpg",
    "o": "",
    "st": "allrecipes"
}