{
    "id": 220767,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1/2 cup white sugar",
        "1/2 teaspoon salt",
        "3/4 cup cold butter, cut into chunks",
        "1 egg",
        "1 teaspoon vanilla extract",
        "1 cup water",
        "1/2 cup uncooked white rice",
        "2 cups whole milk",
        "1 (15 ounce) container ricotta cheese, drained",
        "1 cup white sugar",
        "1 tablespoon lemon juice",
        "1 tablespoon grated lemon zest",
        "6 eggs",
        "1 (15 ounce) can crushed pineapple, well drained"
    ],
    "nut": [
        "Calories > 359 kcal",
        "Carbs > 48.6 g",
        "Cholesterol > 116 mg",
        "Fat > 14.2 g",
        "Protein > 9.8 g",
        "Sodium > 275 mg"
    ],
    "n": "Easter Rice Pie",
    "a": "TINATED",
    "r": "0",
    "s": 16,
    "des": "\"This recipes makes 2 Easter pies with rice and pineapple filling.\"",
    "ins": "Grease two 9-inch pie plates.\nPulse flour, baking powder, 1/2 cup sugar, and salt in a food processor several times until combined.\nPlace butter into the flour mixture and pulse just until butter resembles coarse crumbs. Mix in 1 egg and vanilla extract; process until dough holds together, about 30 seconds.\nPlace dough on a well-floured work surface, divide in half, and roll each piece into a 9-inch round crust.\nFit crusts into the prepared pie plates and freeze for 1 hour.\nBring water to a boil in a saucepan; stir in rice and return to a boil. Reduce heat to medium-low, cover, and cook until rice has absorbed the water, about 20 minutes.\nStir milk into the rice and bring to a simmer; cook until thickened, stirring often, about 10 more minutes. Set rice mixture aside to cool.\nPreheat oven to 325 degrees F (165 degrees C).\nBeat ricotta cheese, 1 cup sugar, lemon juice, lemon zest, and 6 eggs together in a bowl until smooth. Stir in cooked rice mixture and crushed pineapple until thoroughly combined.\nDivide the filling between the 2 cold pie crusts.\nBake in the preheated oven until the filling is set and the tops are golden brown, about 90 minutes. Cool on racks.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "3 h",
    "i": "817925.jpg",
    "o": "",
    "st": "allrecipes"
}