{
    "id": 220750,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 pound ground turkey",
        "1/2 onion, chopped",
        "4 cloves garlic, chopped",
        "2 tablespoons minced fresh ginger root",
        "1/2 teaspoon red pepper flakes",
        "2 sweet potatoes, cut into 1/2-inch pieces",
        "6 cups water, or as needed to cover",
        "2 1/4 cups water",
        "1 (10 ounce) box couscous",
        "1/2 cup peanut butter",
        "2 cups Swiss chard, cut into 3-inch pieces",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 531 kcal",
        "Carbs > 58.5 g",
        "Cholesterol > 56 mg",
        "Fat > 21.5 g",
        "Protein > 28.1 g",
        "Sodium > 224 mg"
    ],
    "n": "Sweet Potato and Peanut Stew",
    "a": "ChollaCat",
    "r": "0",
    "s": 6,
    "des": "\"This recipe makes me feel good. It's very different. There a number of steps, so you can't just put it on the stove and leave it, but the results make it worthwhile. Can be made with ground turkey or vegetarian, and it's dairy-free.\"",
    "ins": "Heat olive oil in a large soup pot over medium-high heat. Cook and stir turkey, onion, and garlic in the hot oil until turkey is crumbly, evenly browned, and no longer pink.\nSeason turkey mixture with ginger and red pepper flakes.\nStir sweet potatoes into pot and cover with 6 cups water. Simmer until sweet potatoes are tender, about 10 minutes.\nMeanwhile, bring 2 1/4 cups water to a boil in a saucepan. Remove from the heat and stir in couscous. Cover and let stand for 10 minutes, then fluff with a fork; set aside.\nMix peanut butter with about 1 cup liquid from the sweet potato stew in a bowl until smooth. Pour peanut butter mixture back into the pot.\nMix Swiss chard into stew and cook until tender, stirring often, about 5 minutes. Season with salt and black pepper.\nServe stew spooned over couscous.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "2717596.jpg",
    "o": "",
    "st": "allrecipes"
}