{
    "id": 220771,
    "old_rating": "3.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "2 cups milk",
        "1 (8 ounce) package cream cheese, cubed",
        "1/2 cup shredded Swiss cheese",
        "1 teaspoon salt",
        "1 teaspoon ground nutmeg",
        "4 cups frozen country-style (cubed) hash brown potatoes, thawed",
        "1 zucchini, shredded",
        "1 tablespoon butter, melted",
        "1/4 cup dried bread crumbs"
    ],
    "nut": [
        "Calories > 329 kcal",
        "Carbs > 20.1 g",
        "Cholesterol > 71 mg",
        "Fat > 23.4 g",
        "Protein > 10.5 g",
        "Sodium > 631 mg"
    ],
    "n": "Mom's Easter Potato-Zucchini Casserole",
    "a": "Karen Delegan",
    "r": "0",
    "s": 6,
    "des": "\"This is an easy make-ahead crowd pleaser to accompany a ham or roast. Don't tell the kids there's zucchini in it and they will never know! I always double the recipe since it goes fast. Broccoli can be substituted for the zucchini.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nGrease an 8x10-inch casserole dish.\nMelt 2 tablespoons butter in a large pot over medium heat; stir in flour until smooth and let the paste simmer for 1 minute, stirring constantly.\nGradually whisk in milk, about 1/2 cup at a time, and bring to a simmer. Whisk constantly until sauce is smooth and thickened, about 5 minutes.\nWhisk in cream cheese and Swiss cheese until melted; stir in salt and nutmeg.\nMix hash brown potatoes and zucchini into the cheese mixture until thoroughly combined.\nTransfer potato mixture to the prepared casserole dish.\nBake in the preheated oven until bubbling, about 35 minutes.\nMix 1 tablespoon melted butter and bread crumbs together in a bowl. Sprinkle topping over the casserole and return to oven; bake until topping is lightly golden brown, 10 to 15 more minutes.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "856031.jpg",
    "o": "",
    "st": "allrecipes"
}