{
    "id": 220781,
    "old_rating": "3.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 quart peanut oil for frying, or as needed",
        "1 large beet, peeled and sliced paper-thin",
        "1 large sweet potato, peeled and sliced paper-thin",
        "1 turnip, peeled and sliced paper-thin",
        "1 parsnip, peeled and sliced paper-thin",
        "1 golden beet, peeled and sliced paper-thin",
        "sea salt to taste",
        "freshly cracked black pepper to taste",
        "1 tablespoon malt vinegar, or to taste",
        "1 cup plain Greek yogurt",
        "1/4 cup chopped fresh parsley",
        "1 tablespoon chopped fresh mint",
        "1 clove garlic, finely minced",
        "4 green onions, finely chopped",
        "2 tablespoons lemon juice, or to taste",
        "salt and ground white pepper to taste"
    ],
    "nut": [
        "Calories > 275 kcal",
        "Carbs > 25 g",
        "Cholesterol > 8 mg",
        "Fat > 18.2 g",
        "Protein > 4.6 g",
        "Sodium > 124 mg"
    ],
    "n": "Root Veggie Crisps with Greek Yogurt Dip",
    "a": "wsf",
    "r": "0",
    "s": 6,
    "des": "\"My better half could not eat potatoes for a year (it's a long story), and used to make her own potato chips (crisps) from other sources, such as sweet potatoes and beets. The secret to this recipe is to slice the vegetables ultra thin. I use a mandolin or the slicing blade on my food processor. This makes a unique appetizer for a Super Bowl party!\"",
    "ins": "Heat oil in a deep-fryer or large saucepan to 360 degrees F (182 degrees C).\nCarefully fry beet, sweet potato, turnip, parsnip, and golden beet slices in the hot oil, working in batches, until golden brown, 2 to 4 minutes.\nRemove vegetable chips with a slotted spoon and transfer to paper towels to drain. Allow to dry and cool.\nSeason chips with sea salt, cracked black pepper, and malt vinegar to taste.\nCombine yogurt, parsley, mint, garlic, and green onions together in a bowl. Stir lemon juice, salt, and white pepper into yogurt mixture to your taste preference.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "3433684.jpg",
    "o": "",
    "st": "allrecipes"
}