{
    "id": 220705,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (18.25 ounce) package chocolate cake mix",
        "1 1/4 cups water",
        "1/3 cup vegetable oil",
        "3 eggs",
        "2 (3.9 ounce) packages instant chocolate pudding mix",
        "2 cups milk",
        "2 cups frozen whipped topping, thawed",
        "1 tablespoon chocolate sprinkles",
        "72 mini chocolate candy-coated Easter eggs"
    ],
    "nut": [
        "Calories > 211 kcal",
        "Carbs > 28.7 g",
        "Cholesterol > 25 mg",
        "Fat > 10 g",
        "Protein > 3.2 g",
        "Sodium > 329 mg"
    ],
    "n": "Carlee's Celebrate Spring Cupcakes",
    "a": "CC<3's2bake",
    "r": "0",
    "s": 24,
    "des": "\"Cupcakes with creamy chocolate surprise centers and a cute little bird's nest on top of creamy chocolate frosting. Made these in honor of my daughter, Carlee.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nGrease 24 muffin cups or line with paper liners.\nPlace chocolate cake mix, water, vegetable oil, and eggs in a mixing bowl. Beat with an electric mixer on medium speed until thoroughly combined, about 2 minutes.\nFill prepared muffin cups 2/3 full with batter.\nBake in the preheated oven until a toothpick inserted into the center of a cupcake comes out clean, 19 to 23 minutes.\nAllow cupcakes to cool thoroughly.\nBeat the 2 packages of pudding mix with milk in a bowl using an electric mixer until thickened, about 2 minutes.\nBeat thawed whipped topping into pudding mixture to make a creamy filling.\nSpoon about 1 1/2 cup chocolate pudding filling into a pastry bag fitted with a large piping tip.\nPress the piping tip into the center of each cupcake and fill cupcake with about 1 1/2 tablespoon of pudding mixture.\nSpoon a heaping tablespoon of remaining pudding mixture about 1 1/2 inches across into the center of each cupcake to make a nest. Press chocolate sprinkles into edges of the nests; place 3 mini chocolate eggs into each nest.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "809268.jpg",
    "o": "",
    "st": "allrecipes"
}