{
    "id": 220784,
    "old_rating": "4.23077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup butter",
        "1/4 cup minced red bell pepper",
        "1/4 cup minced green bell pepper",
        "1/2 cup minced yellow onion",
        "1 jalapeno pepper, minced (optional)",
        "1 Anaheim pepper, seeded and minced",
        "2 cloves garlic, minced",
        "1/2 teaspoon dried Mexican oregano",
        "1/2 teaspoon salt",
        "1 pinch ground white pepper",
        "1/4 teaspoon cayenne pepper, or to taste (optional)",
        "1 1/2 cups half-and-half",
        "1 cup shredded Monterey Jack cheese",
        "1 cup sour cream",
        "1/4 cup butter",
        "1 pound medium shrimp, peeled, deveined, and halved lengthwise",
        "1/2 pound bay scallops",
        "1/2 cup chopped green onion",
        "1 tomato - peeled, seeded, and chopped",
        "12 (9 inch) flour tortillas",
        "2 cups shredded Monterey Jack cheese",
        "1/2 cup chopped green onion",
        "1 tomato - peeled, seeded, and chopped"
    ],
    "nut": [
        "Calories > 502 kcal",
        "Carbs > 36.1 g",
        "Cholesterol > 134 mg",
        "Fat > 28.8 g",
        "Protein > 24.8 g",
        "Sodium > 818 mg"
    ],
    "n": "Seafood Enchiladas con Queso",
    "a": "BAJATHECAT",
    "r": "0",
    "s": 12,
    "des": "\"Creamy enchiladas with just a bit of zip! Use your food processor to make this in a snap. Serve on plate decorated with a dollop of guacamole and a dollop of sour cream.\"",
    "ins": "Melt 1/4 cup butter in a large saucepan over medium heat. Cook and stir red bell pepper, green bell pepper, onion, jalapeno pepper, Anaheim pepper, garlic, and oregano in the melted butter until peppers are tender, about 5 minutes. Season with salt, white pepper, and cayenne pepper.\nPour half-and-half into pepper mixture and bring to a boil, scraping any brown bits from the bottom of the pan. Reduce heat to medium-low; simmer until slightly thickened, about 3 minutes.\nSlowly stir 1 cup Monterey Jack cheese into the cream sauce until melted, about 5 minutes; remove from heat.\nStir sour cream into the sauce.\nPreheat oven to 350 degrees F (175 degrees C).\nMelt 1/4 cup butter in a large skillet over medium-high heat. Cook and stir shrimp, scallops, and 1/2 cup green onion in melted butter until shrimp begin to turn pink, about 2 minutes.\nStir 1 chopped tomato and half the cream sauce into shrimp mixture.\nSpoon about 1/3 cup shrimp mixture onto each tortilla. Roll tortilla tightly around the filling to form an enchilada. Arrange enchiladas seam sides down in 9x16-inch baking dish.\nPour remaining sauce and any remaining shrimp mixture and over enchiladas.\nCover baking pan with aluminum foil.\nBake in the preheated oven until bubbly, about 30 minutes. Remove foil and sprinkle enchiladas with 2 cups Monterey Jack cheese.\nReturn baking dish to oven; bake until cheese is melted, about 5 minutes.\nScatter 1/2 cup green onion and remaining chopped tomato over enchiladas to serve.",
    "pt": "1 h",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "875888.jpg",
    "o": "",
    "st": "allrecipes"
}