{
    "id": 220794,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 thin slices prosciutto",
        "4 skinless, boneless chicken breast halves - pounded to 1/4-inch thickness",
        "1 ripe mango - peeled and cut into eight 1-inch wide strips",
        "1 cup all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon curry powder",
        "1/8 teaspoon ground black pepper",
        "1/8 teaspoon finely crumbled dried thyme",
        "2 eggs, beaten",
        "2 cups unsweetened shredded coconut",
        "vegetable oil for deep frying, or as needed",
        "1 lime, juiced",
        "1 lime, cut into wedges"
    ],
    "nut": [
        "Calories > 420 kcal",
        "Carbs > 22.1 g",
        "Cholesterol > 83 mg",
        "Fat > 30 g",
        "Protein > 17.9 g",
        "Sodium > 270 mg"
    ],
    "n": "Caribbean Coconut Chicken Bites",
    "a": "Jerri Reed",
    "r": "0",
    "s": 8,
    "des": "\"This recipe translates into finger food and hors d'oeuvres as easily as it is served for a main course.\"",
    "ins": "Place a prosciutto slice on each chicken breast. Trim prosciutto to fit inside the chicken breast with a 1/2-inch border of chicken.\nPlace 2 slices mango in the center of each prosciutto slice.\nRoll the chicken breast lengthwise to completely enclose the mango and prosciutto. Tuck and pinch the ends to seal rolls tightly.\nArrange chicken rolls on a baking sheet and refrigerate until very firm, about 30 minutes.\nCombine flour, salt, curry powder, black pepper, and thyme in a bowl. Pour mixture onto a plate.\nPour beaten eggs onto a separate plate.\nSprinkle coconut onto a third plate.\nSlice chicken rolls into 1 to 1 1/2-inch pieces.\nRoll chicken in the flour mixture and shake off any excess flour.\nCoat chicken in the beaten egg until completely covered; allow excess egg to drip off.\nRoll chicken in coconut.\nArrange the coated chicken rolls on a plate in a single layer. Cover and refrigerate to allow coating to set, 15 minutes.\nPreheat oven to 325 degrees F (165 degrees C).\nHeat enough vegetable oil in a deep, heavy skillet to immerse chicken rolls. Turn heat to medium.\nFry half the chicken rolls in the hot oil until golden brown, about 4 minutes.\nRemove chicken rolls with a slotted spoon and drain on several layers of paper towels. Repeat with remaining chicken rolls.\nPlace chicken rolls on a baking sheet.\nBake in the preheated oven until chicken is no longer pink in the center and juices run clear, about 10 minutes.\nSplash chicken rolls with lime juice and serve alongside lime wedges.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "2493297.jpg",
    "o": "",
    "st": "allrecipes"
}