{
    "id": 220897,
    "old_rating": "4.76",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 1/3 cups water",
        "2/3 cup uncooked grits",
        "1/4 teaspoon salt",
        "1/4 cup butter",
        "1/2 teaspoon minced garlic",
        "2 green onions, diced",
        "1 (16 ounce) package frozen shrimp, peeled and deveined - thawed",
        "1 teaspoon lemon juice",
        "2 pinches cayenne pepper, or to taste",
        "salt and ground black pepper to taste",
        "1/4 cup butter",
        "3/4 cup cubed processed cheese food (such as VelveetaÂ®)"
    ],
    "nut": [
        "Calories > 419 kcal",
        "Carbs > 6.8 g",
        "Cholesterol > 260 mg",
        "Fat > 32.4 g",
        "Protein > 25.4 g",
        "Sodium > 991 mg"
    ],
    "n": "Momma's Shrimp and Cheese Grits",
    "a": "NOLAMom",
    "r": "0",
    "s": 4,
    "des": "\"I have tried a number of shrimp and grits recipes, but have not found one I really like. So I decided to experiment a bit and created a simple but delicious recipe that will surely please the taste buds. In New Orleans we like our cayenne pepper, so use less if you don't like so much heat.\"",
    "ins": "Bring water to a boil in a saucepan; stir grits and salt into the boiling water, cover, and reduce heat to low. Simmer grits until tender, 15 to 20 minutes. Remove from heat and keep warm.\nMelt 1/4 cup butter in a pan over medium heat; cook and stir garlic until softened, about 2 minutes. Stir in green onions, cooking until green onions are wilted, another 4 minutes.\nMix shrimp into the garlic and green onions and cook until shrimp are firm and pink, about 5 minutes. Stir in lemon juice, cayenne pepper, salt, and black pepper.\nJust before serving, mix 1/4 cup butter into the cooked grits, followed by processed cheese. Mix thoroughly until creamy and cheese is melted. Season with salt and black pepper.\nPlace grits in a bowl, top with the shrimp, and pour pan sauce over shrimp and grits to serve.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "2009154.jpg",
    "o": "4522014.jpg,4508541.jpg,4463517.jpg,4441882.jpg,4036191.jpg,4032670.jpg",
    "st": "allrecipes"
}