{
    "id": 220865,
    "old_rating": "4.11765",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons vegetable oil",
        "1 pound cubed beef stew meat",
        "1 large onion, diced",
        "2 cloves garlic, minced",
        "1 (8 ounce) package sliced button mushrooms",
        "1 (32 ounce) carton beef stock",
        "salt to taste",
        "ground black pepper to taste",
        "1 (8 ounce) package wide egg noodles",
        "3 tablespoons cornstarch",
        "1/2 cup cold water"
    ],
    "nut": [
        "Calories > 518 kcal",
        "Carbs > 54.8 g",
        "Cholesterol > 107 mg",
        "Fat > 17.1 g",
        "Protein > 35 g",
        "Sodium > 151 mg"
    ],
    "n": "Simple Beef Tips and Noodles",
    "a": "Dennis Errichiello",
    "r": "0",
    "s": 4,
    "des": "\"This is one of my family favorites; it's a great starter recipe for using a pressure cooker. It is wonderful any time of year, but we like it best in the cooler weather. Very quick and easy to make after a day at work. It can also be made in a slow cooker.\"",
    "ins": "Heat oil in the pressure cooker over medium-high heat and stir in beef cubes. Cook until the beef is browned on all sides; remove beef and set it aside. Drain and discard excess grease.\nLower the heat to medium and add onion; cook and stir until onion has softened and turned translucent, about 5 minutes. Stir in garlic and mushrooms and continue to cook about 5 minutes more, until garlic is fragrant but not brown.\nPour in beef stock, beef stew meat, and any accumulated drippings; season with salt and pepper. Return to high heat, seal the lid, and bring to full pressure.\nReduce the heat to low, maintaining full pressure, and cook for 20 minutes.\nWhile the stew is cooking, bring a large pot of lightly salted water to a boil. Stir in noodles and cook until tender, stirring often, about 8 minutes. Drain and set aside.\nRemove the pressure cooker from the heat and allow the pressure to drop naturally. Dissolve cornstarch into 1/2 cup of cold water. When the pressure has dropped, remove the lid and whisk in the cornstarch mixture. Bring the beef and mushrooms back to a boil and cook, stirring constantly, for 2 minutes or until the sauce has thickened. Pour the beef over the noodles and serve.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "939281.jpg",
    "o": "",
    "st": "allrecipes"
}