{
    "id": 220870,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup dried chickpeas",
        "1/2 teaspoon baking soda",
        "1 tablespoon water",
        "1 1/3 tablespoons sesame seeds",
        "2 teaspoons ground cumin",
        "1 teaspoon salt",
        "1 teaspoon baking powder",
        "1 teaspoon ground coriander",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon red chili powder",
        "1/2 teaspoon white sugar",
        "1/4 teaspoon ground turmeric",
        "1 pinch asafoetida powder",
        "1 quart vegetable oil for frying, or as needed"
    ],
    "nut": [
        "Calories > 262 kcal",
        "Carbs > 20.8 g",
        "Cholesterol > 0 mg",
        "Fat > 17.7 g",
        "Protein > 6.7 g",
        "Sodium > 582 mg"
    ],
    "n": "Authentic Falafels",
    "a": "Kathleen Woods Rubino",
    "r": "0",
    "s": 6,
    "des": "\"These falafels are the closest thing to NYC street vendor falafels! Made the traditional way with dried soaked chickpeas! Great on a pita with lettuce, cucumber and yogurt. Asafoetida is usually found in Middle Eastern or Indian food stores. If you prefer, you can use 2 to 3 garlic cloves and 1 small chopped onion instead. This is a great base recipe, customize it to your own tastes.\"",
    "ins": "Place dried chickpeas in a bowl. Fill with water to cover; stir in baking soda. Soak at least 8 hours or overnight in refrigerator. Drain.\nPlace soaked and drained chickpeas in a blender or food processor; blend to a paste.\nPour water into chickpea paste and blend until smooth. Scrape down sides of blender with spatula if needed.\nPlace sesame seeds, cumin, salt, baking powder, coriander, black pepper, red chili powder, sugar, turmeric, and asafoetida powder in blender with chickpea paste; blend until well mixed. Transfer chickpea mixture to a bowl.\nChill chickpea mixture in refrigerator to allow flavors to blend, at least 1 hour and up to two days.\nPour vegetable oil to a depth of 1 inch in a deep skillet over medium heat and heat to 370 degrees F (188 degrees C).\nScoop up chickpea mixture by heaping tablespoons and form into balls the size of ping pong balls.\nFry balls in hot oil until golden brown, 3 to 5 minutes on each side.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "9 h ",
    "i": "4501457.jpg",
    "o": "",
    "st": "allrecipes"
}