{
    "id": 220820,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups dried pinto beans",
        "1 tablespoon butter",
        "1 onion, chopped",
        "2 stalks celery, chopped",
        "1/2 teaspoon minced garlic",
        "2 (14 ounce) cans beef broth",
        "2 cups tomato juice",
        "2 tablespoons white sugar",
        "4 potatoes, diced",
        "2 carrots, diced",
        "3/4 teaspoon dried oregano",
        "1/2 teaspoon salt",
        "3/4 teaspoon ground black pepper",
        "1 (13 ounce) package smoked sausage",
        "1/2 cup chopped fresh parsley"
    ],
    "nut": [
        "Calories > 444 kcal",
        "Carbs > 52 g",
        "Cholesterol > 35 mg",
        "Fat > 17.1 g",
        "Protein > 22.2 g",
        "Sodium > 1364 mg"
    ],
    "n": "Pinto Bean and Sausage Soup",
    "a": "jobblychef",
    "r": "0",
    "s": 8,
    "des": "\"The woman who owned and made the soups at my favorite deli was retiring. I asked her why, and she said, 'I'm an old lady, I'm tired of getting up early for work.' She gave me the recipe to one of my favorites. I made a few tweaks, it's DELICIOUS.\"",
    "ins": "Cover pinto beans with water in a bowl and allow to soak overnight. Drain.\nMelt butter in a 6-quart stock pot over medium heat. Cook and stir onion and celery in butter until vegetables are tender, about 5 minutes.\nStir garlic into onion mixture until fragrant, about 1 minute more.\nStir beef broth, tomato juice, sugar, and drained pinto beans into the vegetable mixture and bring to a boil; reduce heat to medium-low and simmer until beans are tender, about 1 hour and 15 minutes.\nMix potatoes, carrots, oregano, salt, and black pepper into the bean soup; simmer until potatoes are tender, about 30 minutes more.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nPlace smoked sausage on a baking sheet.\nBake sausage in the preheated oven until browned, about 10 minutes.\nCut sausage into quarters, then slice. Add sausage and parsley to the soup; continue to simmer for 10 more minutes.",
    "pt": "20 m",
    "ct": "2 h",
    "tt": "10 h ",
    "i": "1533690.jpg",
    "o": "",
    "st": "allrecipes"
}