{
    "id": 220849,
    "old_rating": "4.27273",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "8 uncooked lasagna noodles",
        "2 tablespoons olive oil",
        "1 pound ground turkey",
        "1 (8 ounce) package sliced fresh mushrooms",
        "2 tablespoons Italian seasoning",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 (10 ounce) package frozen chopped spinach, thawed and drained",
        "2 cloves garlic, minced",
        "1 (20 ounce) jar marinara sauce",
        "1/2 cup shredded mozzarella cheese",
        "1/2 cup ricotta cheese",
        "1/4 cup grated Parmesan cheese",
        "1 1/2 cups shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 385 kcal",
        "Carbs > 32.2 g",
        "Cholesterol > 68 mg",
        "Fat > 17 g",
        "Protein > 27.6 g",
        "Sodium > 653 mg"
    ],
    "n": "Bab's Turkey Mushroom Lasagna Rolls",
    "a": "javaqueen",
    "r": "0",
    "s": 8,
    "des": "\"A short ingredient list makes this a weeknight possibility. It works great at potlucks, card parties or big family gatherings. What I love about it is that everyone has an individual serving and service is simple. Toss up a salad and dinner is done! Servings can vary depending on how hungry everyone is. Kids usually eat one and hungry husbands can easily eat two. You be your own family's judge. Rest assured everyone will love these.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nSpray a large baking dish with cooking spray.\nBring a large pot of lightly salted water to a boil. Cook lasagna in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain and reserve pasta in a bowl of cold water.\nHeat olive oil in a large skillet over medium-high heat. Cook and stir turkey, mushrooms, Italian seasoning, salt, and black pepper until turkey is evenly browned.\nStir spinach and garlic into turkey mixture until heated through, about 1 minute more; remove from heat and allow to cool slightly.\nSpread about 1/2 cup marinara sauce on the bottom of the prepared baking dish.\nDrain lasagna noodles.\nStir 1/2 cup mozzarella cheese, ricotta cheese and parmesan cheese into the turkey mixture until well mixed.\nSpread about 1/4 cup turkey and cheese mixture down the center of each lasagna noodle, leaving a space about 2 inches long at the end of the noodle.\nRoll the noodle up from the opposite end and arrange on prepared baking dish seam sides down. Repeat with remaining rolls.\nPour remaining marinara sauce over lasagna rolls.\nBake in the preheated oven until sauce is bubbly, 30 to 40 minutes. Sprinkle remaining 1 1/2 cups mozzarella cheese over the rolls and return to oven.\nContinue baking until cheese is melted, about 5 minutes more.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "876708.jpg",
    "o": "",
    "st": "allrecipes"
}