{
    "id": 220834,
    "old_rating": "4.96154",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds ground venison",
        "1 onion, chopped",
        "1 (6 ounce) box dry instant stuffing mix",
        "2 eggs, beaten",
        "2 tablespoons Worcestershire sauce",
        "2 tablespoons ketchup",
        "1/4 cup spicy tomato-vegetable juice cocktail (such as V8Â®) (optional)",
        "1 teaspoon prepared yellow mustard",
        "10 ounces fresh morel mushrooms",
        "8 slices sharp Cheddar cheese",
        "6 slices bacon",
        "1/2 cup barbeque sauce (such as Sweet Baby Ray'sÂ®)",
        "2 tablespoons grated Parmesan cheese (optional)",
        "1 pinch salt and ground black pepper, or to taste"
    ],
    "nut": [
        "Calories > 421 kcal",
        "Carbs > 27.7 g",
        "Cholesterol > 164 mg",
        "Fat > 17 g",
        "Protein > 36.6 g",
        "Sodium > 1041 mg"
    ],
    "n": "Big D's Mushroom and Cheese-Stuffed Venison Loaf",
    "a": "Dave Eilts",
    "r": "0",
    "s": 8,
    "des": "\"A moist and flavorful comfort food. Very easy to make. A dish that would please anyone. My family never liked venison until now. I make my own venison burger (mixed with pork and smoked bacon) to die for. Makes the best meatloaf sandwiches or subs (trust me) for work or hunting (awesome cold). Works excellent with beef too. Your friends and family will beg for more. Good thing I like to hunt (the rest of my side of family doesn't).\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nMix ground venison, onion, stuffing mix, eggs, Worcestershire sauce, ketchup, vegetable juice cocktail, and yellow mustard in a large bowl with your hands until thoroughly combined.\nPlace half the venison mixture into a 9x11-inch casserole dish; pat the meat mixture into an even layer.\nSpread morel mushrooms over meat; top with Cheddar cheese slices.\nSpread remaining half of venison mixture over cheese slices; pat down to form an even layer and press the edges together to seal in the mushrooms and cheese.\nArrange bacon slices over the meatloaf; spread barbeque sauce evenly over the loaf. Sprinkle with Parmesan cheese.\nBake in the preheated oven until the meatloaf is browned and an instant-read meat thermometer inserted into the thickest part of the loaf reads 160 degrees F (70 degrees C), about 1 hour and 15 minutes.\nDrain excess grease and allow loaf to stand for 5 minutes before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4155553.jpg",
    "o": "",
    "st": "allrecipes"
}