{
    "id": 220808,
    "old_rating": "4.66917",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1/2 cup butter, melted",
        "1 1/2 cups brown sugar",
        "24 maraschino cherries",
        "1 (20 ounce) can crushed pineapple",
        "1 (18.25 ounce) package pineapple cake mix (such as Duncan HinesÂ® Pineapple Supreme)",
        "3 eggs",
        "1 1/3 cups pineapple juice",
        "1/3 cup vegetable oil",
        "1 tablespoon confectioners' sugar for dusting, or as needed"
    ],
    "nut": [
        "Calories > 236 kcal",
        "Carbs > 38.6 g",
        "Cholesterol > 33 mg",
        "Fat > 9 g",
        "Protein > 1.5 g",
        "Sodium > 174 mg"
    ],
    "n": "Pineapple Upside Down Cupcakes",
    "a": "Bri",
    "r": "0",
    "s": 24,
    "des": "\"Love to make these little guys for family gatherings or just as treats for home to pack into lunches. Easy recipe to make. Adaptations can be made to make this completely from scratch. This is just a yummy simplified version!\"",
    "ins": "Move an oven rack into the middle of the oven. Preheat oven to 350 degrees F (175 degrees C).\nSpray 24 muffin cups with cooking spray.\nLine a work surface with waxed paper.\nSpoon 1 teaspoon melted butter into the bottom of each sprayed muffin cup.\nSpoon 1 tablespoon brown sugar in each muffin cup.\nPress a maraschino cherry into the center of the brown sugar in each muffin cup.\nSpoon a heaping tablespoon of crushed pineapple over the cherry and compact it with the back of a spoon into an even layer.\nMix pineapple cake mix, eggs, pineapple juice, and vegetable oil in a large bowl with electric mixer on low speed until moistened, about 30 seconds. Turn mixer speed to medium and mix for 2 minutes.\nPour pineapple cake batter into the muffin cups, filling them to the top; do not overfill.\nBake in the preheated oven until a toothpick inserted into the center of a cupcake comes out clean, about 20 minutes.\nAllow cupcakes to cool at least 5 minutes before inverting muffin cups onto the waxed paper to release. Serve with pineapple and cherry sides up. Sprinkle cupcakes lightly with confectioners' sugar.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "3440247.jpg",
    "o": "4537766.jpg,4534624.jpg,4512447.jpg,4487340.jpg,4481365.jpg,4481358.jpg",
    "st": "allrecipes"
}