{
    "id": 220832,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 large fresh morel mushrooms",
        "1 (8 ounce) package cream cheese at room temperature",
        "1/2 (8 ounce) package imitation crabmeat, minced",
        "1 teaspoon finely chopped green onion, or to taste",
        "1/4 cup dry breading mix (such as Drake's Crispy FrymixÂ®)",
        "2 cups vegetable oil for frying, or as needed"
    ],
    "nut": [
        "Calories > 117 kcal",
        "Carbs > 4.1 g",
        "Cholesterol > 22 mg",
        "Fat > 10.2 g",
        "Protein > 2.5 g",
        "Sodium > 193 mg"
    ],
    "n": "Stuffed Morel Mushrooms",
    "a": "Kelly Cooper Root",
    "r": "0",
    "s": 12,
    "des": "\"This is a once-a-year treat, seafood and cream cheese-stuffed whole morel mushrooms. The taste is simply to die for. White morels are best. Harvest at the end of the season. Hint: The end of the season produces the biggest morel mushrooms.\"",
    "ins": "Gently clean whole morel mushrooms of dirt and grit; place mushrooms, stem sides down, in a colander and drain for about 5 minutes.\nTrim bottoms of the hollow stems, so the hole is big enough for filling.\nMix cream cheese, crabmeat, and green onion in a bowl until evenly combined.\nSpoon mixture into a heavy resealable plastic bag. Force the cream cheese mixture into a corner of the bag. Cut a small snip off the corner of the bag.\nInsert cut tip of the plastic bag into the hollow stem of each mushroom and fill the mushrooms with the cream cheese mixture.\nPlace dry breading mix in a shallow bowl. Roll the stuffed mushrooms in the dry mix; tap off excess breading.\nHeat vegetable oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nDeep-fry the stuffed mushrooms until the breading is golden brown and the mushrooms are tender, 3 to 4 minutes. Allow to drain on paper towels.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "25 m",
    "i": "3536405.jpg",
    "o": "",
    "st": "allrecipes"
}