{
    "id": 220854,
    "old_rating": "4.7998",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/3 cup plain bread crumbs",
        "1/2 cup milk",
        "2 tablespoons olive oil",
        "1 onion, diced",
        "1 pound ground beef",
        "1 pound ground pork",
        "2 eggs",
        "1/4 bunch fresh parsley, chopped",
        "3 cloves garlic, crushed",
        "2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon red pepper flakes",
        "1 teaspoon dried Italian herb seasoning",
        "2 tablespoons grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 82 kcal",
        "Carbs > 1.7 g",
        "Cholesterol > 32 mg",
        "Fat > 5.5 g",
        "Protein > 6.2 g",
        "Sodium > 192 mg"
    ],
    "n": "Chef John's Italian Meatballs",
    "a": "Chef John",
    "r": "0",
    "s": 30,
    "des": "\"Homemade meatballs are a very easy to make, and since we skip the very messy step of pan-frying these before they hit the sauce, it becomes downright simple. Here I use a standard half-beef/half-pork mixture. You can substitute water or beef broth for the milk, if preferred.\"",
    "ins": "Cover a baking sheet with foil and spray lightly with cooking spray.\nSoak bread crumbs in milk in a small bowl for 20 minutes.\nHeat olive oil in a skillet over medium heat. Cook and stir onions in hot oil until translucent, about 20 minutes.\nMix beef and pork together in a large bowl. Stir onions, bread crumb mixture, eggs, parsley, garlic, salt, black pepper, red pepper flakes, Italian herb seasoning, and Parmesan cheese into meat mixture with a rubber spatula until combined. Cover and refrigerate for about one hour.\nPreheat an oven to 425 degrees F (220 degrees C).\nUsing wet hands, form meat mixture into balls about 1 1/2 inches in diameter. Arrange onto prepared baking sheet.\nBake in the preheated oven until browned and cooked through, 15 to 20 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "2 h ",
    "i": "4541507.jpg",
    "o": "4541507.jpg,4531471.jpg,4529660.jpg,4508155.jpg,4507816.jpg,4507344.jpg",
    "st": "allrecipes"
}