{
    "id": 220874,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 tablespoons butter, divided",
        "1 shallot, minced",
        "1/2 red pepper, diced",
        "1/2 green pepper, diced",
        "1 green onion, sliced",
        "Salt and pepper to taste",
        "1/2 zucchini, diced",
        "2 cups sweet corn, fresh or frozen",
        "2 tablespoons water",
        "4 teaspoons Cajun or Creole seasoning, divided",
        "1/3 cup half and half",
        "20 jumbo shrimp, peeled, deveined, and tails removed"
    ],
    "nut": [
        "Calories > 358 kcal",
        "Carbs > 21.4 g",
        "Cholesterol > 304 mg",
        "Fat > 16.5 g",
        "Protein > 32.9 g",
        "Sodium > 887 mg"
    ],
    "n": "Shrimp and Sweet Corn Maque Choux",
    "a": "Real Butter",
    "r": "0",
    "s": 4,
    "des": "\"A spicy Southern dish, Shrimp & Sweet Corn Maque Choux is satisfying and ready in under 30 minutes. This is my recreation of the Emeril Lagasse dish we had his restaurant, NOLA, in New Orleans. Fresh vegetables are the key to this recipe, which cook quickly and retain their bright, crisp flavors.\"",
    "ins": "Melt 2 tablespoons butter in a large skillet over medium heat. Add shallot, red and green peppers, and green onion. Season with salt and pepper, and saute until soft, about 5 minutes.\nAdd zucchini, sweet corn, water and 2 teaspoons Cajun or creole seasoning to the skillet. Cook until zucchini is tender, about 2 minutes. Add half and half, and stir. Turn off heat.\nMeanwhile, season shrimp with remaining 2 teaspoons Cajun or creole seasoning. Melt butter in a separate skillet and cook shrimp in four batches, about 2 minutes on each side, or until curled, pink and cooked all the way through. Do not overcook.\nDivide corn mixture between four plates. Top each plate with 5 cooked shrimp, and serve immediately.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "823397.jpg",
    "o": "2568376.jpg,1092840.jpg,986165.jpg,963917.jpg,826890.jpg,822835.jpg",
    "st": "allrecipes"
}