{
    "id": 220875,
    "old_rating": "4.7619",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 pounds baby Yukon Gold potatoes",
        "3 tablespoons olive oil",
        "Salt and pepper",
        "4 slices white bread",
        "3 cloves garlic",
        "1/4 cup fresh flat-leaf parsley",
        "1/2 cup butter, melted",
        "4 skinless, boneless chicken breast halves, butterflied",
        "1/2 pint cherry tomatoes",
        "1/4 cup black olives",
        "1 lemon, zested",
        "1 tablespoon olive oil",
        "1/2 cup feta cheese",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "1 (7 ounce) bag arugula"
    ],
    "nut": [
        "Calories > 769 kcal",
        "Carbs > 50 g",
        "Cholesterol > 154 mg",
        "Fat > 48.4 g",
        "Protein > 35.7 g",
        "Sodium > 850 mg"
    ],
    "n": "Deconstructed Chicken Kiev",
    "a": "Real Butter",
    "r": "0",
    "s": 4,
    "des": "\"An updated and unique version of the banquet hall classic, this Chicken Kiev is turned inside out. The buttery filling is on the outside as the coating, instead of hidden inside. Bread crumbs, lots of butter, garlic, and parsley make this chicken the best chicken you have ever eaten. Serve with roasted potatoes, tomato and Feta salsa, and fresh arugula. The perfect weeknight meal, and sophisticated enough for dinner guests.\"",
    "ins": "Preheat oven to 400 degrees F. Toss potatoes with olive oil, salt, and pepper. Roast for 20 to 25 minutes before adding chicken (follow next steps to prepare chicken before roasting).\nAdd the bread to a food processor. Pulse until it turns into crumbs. Take the breadcrumbs out, and set aside. Pulse the garlic and parsley until finely chopped. Add the breadcrumbs back, and pour in melted butter. Pulse again until it coats all of the breadcrumbs.\nPress the bread mixture onto the chicken breasts. Put the chicken into the oven with the potatoes and bake until cooked through, about 15-20 minutes.\nMeanwhile, halve the tomatoes, toss with olives, lemon zest, 1 tablespoon of olive oil, salt, pepper and parsley. Stir in Feta. Set aside.\nLayer arugula on the bottom of the plate. Add the chicken breasts, top with tomato and feta salsa. Serve with roasted potatoes.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "982362.jpg",
    "o": "1027577.jpg,1014570.jpg,1011469.jpg,967630.jpg,825916.jpg,823761.jpg",
    "st": "allrecipes"
}