{
    "id": 220803,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons canola oil",
        "20 New Mexico dried red chile pods, stemmed and seeded",
        "10 dried chile de arbol peppers, stemmed and seeded",
        "1 large yellow onion, chopped",
        "3 cloves garlic, chopped",
        "1 quart chicken stock, or more if needed",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander",
        "1 teaspoon dried oregano",
        "1 tablespoon honey (optional)"
    ],
    "nut": [
        "Calories > 371 kcal",
        "Carbs > 52.3 g",
        "Cholesterol > < 1 mg",
        "Fat > 8.1 g",
        "Protein > 11.7 g",
        "Sodium > 712 mg"
    ],
    "n": "New Mexico Red Chile Sauce",
    "a": "Cookincwgrl",
    "r": "0",
    "s": 4,
    "des": "\"Red chile is a staple of the New Mexican and West Texan diet, and this recipe is my grandmother's recipe. When I make it, it reminds me of the smells of her cooking in her kitchen, fresh corn tortillas, beans, and red chile peppers. You can kick up the spiciness by adding more arbol chile pods.\"",
    "ins": "Coat the bottom of a heavy saucepan with oil; add chile pods. Toast over medium heat until aromatic, about 3 minutes.\nStir in onion and garlic; cook and stir until fragrant, about 5 minutes. Add enough chicken stock to allow pods to float; simmer until they develop the texture of wet leather, 5 to 7 minutes.\nFill blender halfway with chile-stock mixture. Cover and hold lid down with a potholder; pulse a few times before leaving on to blend. Pour into a bowl; repeat with remaining mixture. Strain sauce through a fine mesh strainer into a saucepan over medium heat. Discard solids.\nStir cumin, coriander, and oregano into the saucepan; add honey. Cook until sauce is thick and evenly coats the back of a spoon, about 10 minutes.",
    "pt": "20 m",
    "ct": "23 m",
    "tt": "43 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}