{
    "id": 220868,
    "old_rating": "4.52041",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 cup brown sugar",
        "3/4 cup reduced-sodium soy sauce",
        "1/4 cup cider vinegar",
        "2 tablespoons ground ginger",
        "2 tablespoons garlic powder",
        "1 teaspoon ground black pepper",
        "1 (20 ounce) can crushed pineapple",
        "1 cup chicken stock",
        "3 pounds boneless, skinless chicken thighs",
        "2 tablespoons cornstarch (optional)",
        "2 tablespoons cold water (optional)"
    ],
    "nut": [
        "Calories > 352 kcal",
        "Carbs > 31 g",
        "Cholesterol > 103 mg",
        "Fat > 11.4 g",
        "Protein > 30.7 g",
        "Sodium > 1009 mg"
    ],
    "n": "Pressure Cooker Teriyaki Chicken",
    "a": "LESLIESAMI",
    "r": "0",
    "s": 8,
    "des": "\"I combined other teriyaki recipes to make up a yummy version for my favorite cooker: my electric pressure cooker. I used a mix of boneless skinless thighs and chicken tenders. Serve with spaghetti or rice noodles and broccoli...YUM!!\"",
    "ins": "Combine brown sugar, soy sauce, cider vinegar, ginger, garlic powder, pepper, crushed pineapple and juice, and chicken stock in a bowl and stir until the brown sugar is dissolved.\nPlace chicken thighs in the pressure cooker and pour in the sauce. Stir gently to coat. Bring the pressure cooker up to high pressure over high heat, then reduce the heat to low, maintaining high pressure. Cook for 20 minutes.\nStir cornstarch into cold water and set aside.\nReduce the pressure using the rapid-release method. Use a slotted spoon to transfer the chicken to a serving dish; cover with foil and set aside. Whisk the cornstarch mixture into the sauce, bring the mixture to a boil, and cook, stirring frequently, until the sauce has thickened, about 3 minutes. Serve the chicken topped with the teriyaki sauce.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "3804857.jpg",
    "o": "4538423.jpg,4496812.jpg,3925789.jpg,3824874.jpg,3188802.jpg,3122393.jpg",
    "st": "allrecipes"
}