{
    "id": 220975,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 teaspoon unsweetened cocoa powder for dusting, or as needed",
        "2 (8 ounce) packages semi-sweet chocolate squares, coarsely chopped",
        "1/2 cup butter",
        "5 large eggs, separated",
        "1 tablespoon vanilla extract",
        "1/4 cup white sugar",
        "1/4 cup chocolate chips",
        "1/4 cup crushed almonds",
        "1 teaspoon confectioners' sugar for dusting, or as needed",
        "1/2 teaspoon unsweetened cocoa powder for dusting, or as needed"
    ],
    "nut": [
        "Calories > 399 kcal",
        "Carbs > 34.4 g",
        "Cholesterol > 117 mg",
        "Fat > 28.6 g",
        "Protein > 7.2 g",
        "Sodium > 101 mg"
    ],
    "n": "Passover Double Chocolate Almond Torte",
    "a": "Stephanie C.",
    "r": "0",
    "s": 10,
    "des": "\"A flourless chocolate torte, fudgy and rich, but kosher for Passover.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nGrease a 9-inch springform pan and dust with 1/2 teaspoon unsweetened cocoa powder.\nMelt chopped chocolate squares and butter in a heavy saucepan over low heat, stirring until smooth, 5 to 10 minutes.\nWhisk egg yolks and vanilla extract together in a large bowl.\nGradually whisk chocolate and butter mixture into egg yolk mixture until well blended.\nBeat egg whites in a separate bowl with an electric mixer on high speed until soft peaks form. Gradually beat sugar into egg whites until sugar dissolves and egg whites hold stiff peaks.\nFold 1/3 of the egg white mixture into chocolate mixture. Gently fold in remaining egg white mixture until just blended and batter is smooth and fluffy.\nSpread batter evenly into prepared springform pan.\nBake in the preheated oven until sides begin to pull away from pan and top is set in center, about 25 minutes.\nLet torte cool in pan on a wire rack for 10 minutes before removing the sides of pan.\nPlace chocolate chips into a microwave-safe bowl and heat in microwave on full power for 1 minute. Stir the chips. Continue to heat in 15-second intervals, stirring after each time, until the chocolate chips have melted and are warm and smooth. Do not overheat.\nDrizzle melted chocolate chips onto torte. Sprinkle crushed almonds and a dusting of confectioners' sugar and 1/2 teaspoon unsweetened cocoa powder, or as needed,  onto the torte before serving..",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "2481793.jpg",
    "o": "",
    "st": "allrecipes"
}