{
    "id": 220902,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds Alaskan king crab legs, thawed if frozen",
        "3 cups chicken broth",
        "1 cup grits",
        "2 cups shredded Cheddar cheese, or more to taste",
        "2/3 cup diced tomatoes with green chile peppers (such as RO*TELÂ®) (optional)",
        "3 tablespoons butter",
        "2 tablespoons olive oil",
        "1 green bell pepper, seeded and minced",
        "1 sweet onion, minced",
        "2 teaspoons minced garlic"
    ],
    "nut": [
        "Calories > 399 kcal",
        "Carbs > 8.8 g",
        "Cholesterol > 120 mg",
        "Fat > 24.9 g",
        "Protein > 33.8 g",
        "Sodium > 2131 mg"
    ],
    "n": "Charleston Crab and Grits",
    "a": "PantherLover",
    "r": "0",
    "s": 6,
    "des": "\"A family favorite! Easy, delicious, comforting cheesy grits and crab. Great as an appetizer or a meal on its own. If you like spicy, add an entire can of diced tomatoes with green chiles.\"",
    "ins": "Bring a large pot of lightly salted water to a boil and place a steamer insert into the pot. Break crab legs apart at joints. Place king crab legs into the steamer, cover pot, reduce heat to medium, and steam crab legs until fragrant, 6 to 8 minutes. Remove crab leg segments. When cool enough to handle, crack the crab leg shells, pick off shells, and remove meat.\nBring chicken broth to a boil in a saucepan; slowly stir in grits. Reduce heat to low, cover pan, and simmer grits until tender, about 20 minutes. Stir grits occasionally.\nWhen grits are thickened and tender, stir Cheddar cheese and diced tomatoes with green chiles into grits until the cheese is smoothly melted.\nMelt butter with olive oil in a large skillet over medium heat. When mixture begins to bubble, stir in green bell pepper and sweet onion; cook until softened, 3 to 4 minutes. Stir in garlic and cook until fragrant, about 2 minutes.\nCook and stir crab meat into bell pepper and onion until crab meat is heated through. Gently mix the cheese grits into the crab mixture; simmer 3 to 5 minutes to blend flavors, and serve.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "2536403.jpg",
    "o": "",
    "st": "allrecipes"
}