{
    "id": 220943,
    "old_rating": "4.73077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon salt",
        "1/4 teaspoon baking soda",
        "7 tablespoons unsalted butter, chilled in freezer and cut into thin slices",
        "3/4 cup cold buttermilk",
        "2 tablespoons buttermilk for brushing"
    ],
    "nut": [
        "Calories > 143 kcal",
        "Carbs > 17 g",
        "Cholesterol > 19 mg",
        "Fat > 7.1 g",
        "Protein > 2.8 g",
        "Sodium > 321 mg"
    ],
    "n": "Chef John's Buttermilk Biscuits",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"This deceptively simple recipe can come out a million different ways with some very minor variations on the ingredients and amounts. This one's my favorite - flaky, but not dry; chewy, but not tough; crisp in just the right spots.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nLine a baking sheet with a silicone baking mat or parchment paper.\nWhisk flour, baking powder, salt, and baking soda together in a large bowl.\nCut butter into flour mixture with a pastry blender until the mixture resembles coarse crumbs, about 5 minutes.\nMake a well in the center of butter and flour mixture. Pour in 3/4 cup buttermilk; stir until just combined.\nTurn dough onto a floured work surface, pat together into a rectangle.\nFold the rectangle in thirds. Turn dough a half turn, gather any crumbs, and flatten back into a rectangle. Repeat twice more, folding and pressing dough a total of three times.\nRoll dough on a floured surface to about 1/2 inch thick.\nCut out 12 biscuits using a 2 1/2-inch round biscuit cutter.\nTransfer biscuits to the prepared baking sheet. Press an indent into the top of each biscuit with your thumb.\nBrush the tops of biscuits with 2 tablespoons buttermilk.\nBake in the preheated oven until browned, about 15 minutes.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "4541164.jpg",
    "o": "4541164.jpg,4537147.jpg,4534405.jpg,4534401.jpg,4534373.jpg,4523615.jpg",
    "st": "allrecipes"
}