{
    "id": 221044,
    "old_rating": "4.72727",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (4 pound) beef brisket",
        "1 large onion, sliced",
        "2 (14.5 ounce) cans beef broth",
        "2 (15 ounce) cans French onion soup",
        "2 (12 fluid ounce) cans or bottles beer"
    ],
    "nut": [
        "Calories > 394 kcal",
        "Carbs > 11.3 g",
        "Cholesterol > 78 mg",
        "Fat > 26.6 g",
        "Protein > 22.1 g",
        "Sodium > 1050 mg"
    ],
    "n": "Alane's Hanukkah Brisket",
    "a": "Marlene",
    "r": "0",
    "s": 10,
    "des": "\"This brisket will literally fall apart in your mouth. The recipe was given to me by my Jewish friend. We made it for a work potluck and it was a hit.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace a large roasting pan over medium-high heat and sear beef brisket, fat side down at first, until browned on all sides, about 3 minutes per side. Remove brisket and set aside.\nPlace onion slices into the bottom of the roasting pan; pour 1 can beef broth, 1 can French onion soup, and 1 can beer over the onions.\nLay the brisket into the roasting pan; pour remaining cans of beef broth, French onion soup, and beer over the brisket. Cover the roasting pan with a lid.\nBake in the preheated oven for 3 hours. Remove from oven and let stand for 30 minutes.\nRemove cooled brisket from roasting pan and wrap tightly in aluminum foil. Pour pan juices and onion into a food storage container and cover tightly with a lid. Refrigerate beef and pan juices overnight.\nThe next day, preheat oven to 350 degrees F (175 degrees C). Pour pan juices and onion into a 9x13-inch baking dish.\nUnwrap the brisket, cut away any visible fat, and slice thinly across the grain of the meat. Place brisket slices into the pan juices.\nReturn to oven and bake until pan juices are thickened and meat is hot, about 45 more minutes.",
    "pt": "15 m",
    "ct": "4 h ",
    "tt": "12 h ",
    "i": "1125215.jpg",
    "o": "",
    "st": "allrecipes"
}