{
    "id": 221003,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package bacon",
        "2/3 cup milk",
        "2 tablespoons all-purpose flour",
        "10 potatoes, peeled and sliced",
        "2 onions, sliced",
        "3 pounds cubed fully cooked ham",
        "2 (16 ounce) packages shredded Cheddar cheese",
        "2 tablespoons salt",
        "2 tablespoons ground black pepper"
    ],
    "nut": [
        "Calories > 644 kcal",
        "Carbs > 29 g",
        "Cholesterol > 125 mg",
        "Fat > 41.2 g",
        "Protein > 38.9 g",
        "Sodium > 2710 mg"
    ],
    "n": "Scalloped Potatoes with Ham and Bacon",
    "a": "bountiful-life",
    "r": "0",
    "s": 15,
    "des": "\"These are delicious. I love making them, the taste is great. We kept working to improve the recipe until it was exactly the way we wanted it.\"",
    "ins": "Place the bacon in a large skillet and cook over medium-high heat, turning occasionally, until slices begin to brown, about 5 minutes. Drain the bacon slices on a paper towel-lined plate.\nTransfer partially cooked bacon to the bottom of a large roasting pan.\nPreheat oven to 350 degrees F (175 degrees C).\nWhisk milk and flour together in a bowl; set aside.\nLayer about one-third of the potatoes over the bacon, followed by half the onion and half the ham.\nScatter one-fourth of the Cheddar cheese atop the ham.\nPour one-third of the milk mixture over the cheese and season with salt and black pepper.\nRepeat the layers of potato, onion, ham, Cheddar Cheese, milk mixture, salt, and black pepper.\nArrange the final third of potatoes in the roasting pan; pour remaining milk mixture on top.\nScatter the remaining Cheddar cheese over the potato mixture.\nCover roasting pan with aluminum foil.\nBake in the preheated oven until potatoes are tender, about 2 hours.",
    "pt": "40 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}