{
    "id": 221006,
    "old_rating": "4.77083",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 quart cold water",
        "1/3 cup kosher salt",
        "1/2 cup white sugar",
        "1 (4 pound) whole chicken, cut into 4 pieces",
        "1 pint cherry tomatoes",
        "3 habanero peppers, seeded",
        "4 cloves garlic",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon dried thyme",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon cayenne pepper",
        "1 tablespoon vegetable oil",
        "2 tablespoons prepared Thai sweet chili sauce"
    ],
    "nut": [
        "Calories > 490 kcal",
        "Carbs > 22.6 g",
        "Cholesterol > 129 mg",
        "Fat > 25.3 g",
        "Protein > 41.5 g",
        "Sodium > 5252 mg"
    ],
    "n": "Cherry Bomb Chicken",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"Thanks to the magic of brining, this really will almost guarantee a juicy, tasty piece of chicken.\"",
    "ins": "Combine water, kosher salt, and sugar in a saucepan over low heat; cook until sugar and salt dissolve, 4 to 5 minutes. Set aside to cool to room temperature.\nScore the skin side of each piece of chicken 2 to 3 times, about 1/8 inch deep. Place chicken pieces in a large bowl or lidded container.\nPuree cherry tomatoes, habanero peppers, garlic, and allspice with the salt and sugar mixture in a blender until smooth.\nPour tomato brine over chicken pieces, making sure all pieces are covered. Refrigerate 4 to 6 hours.\nRemove chicken pieces and transfer to a plate or baking sheet lined with paper towels. Pat chicken pieces dry with more paper towels.\nPreheat an outdoor grill for high heat and lightly oil the grate.\nCombine thyme, cumin, black pepper, cayenne pepper, and oil in a small bowl.\nBrush each chicken piece with thyme and oil mixture.\nCook chicken, skin side down, on the preheated grill for 1 to 2 minutes. Turn each piece and move to indirect heat. Cook until well-browned and meat is no longer pink in the center, 30 to 35 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\nBrush each piece with Thai sweet chile sauce. Transfer to a plate and allow chicken to rest for 10 minutes before serving.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "5 h ",
    "i": "2252699.jpg",
    "o": "2252699.jpg,2085015.jpg,2049598.jpg,2049508.jpg,2032735.jpg,2027563.jpg",
    "st": "allrecipes"
}