{
    "id": 221084,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 skinless, boneless chicken breasts",
        "2 teaspoons Italian seasoning",
        "5 slices bacon, chopped",
        "1 (16 ounce) package tri-color rotelle pasta",
        "1/2 cucumber, sliced",
        "2 roma (plum) tomatoes, seeded and chopped",
        "1 (2.25 ounce) can sliced black olives",
        "1/2 (14 ounce) can artichoke hearts, drained and quartered",
        "5 green onions, sliced",
        "1/4 cup vinegar",
        "1 (16 ounce) jar Alfredo sauce"
    ],
    "nut": [
        "Calories > 455 kcal",
        "Carbs > 47.9 g",
        "Cholesterol > 45 mg",
        "Fat > 21.8 g",
        "Protein > 19.3 g",
        "Sodium > 862 mg"
    ],
    "n": "Chicken Alfredo Pasta Salad",
    "a": "Sunflower",
    "r": "0",
    "s": 8,
    "des": "\"This recipe is SO GOOD and is super easy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chicken breasts onto a roasting pan; season with Italian seasoning,\nCook chicken in preheated oven until no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Set aside to cool completely.\nCook and stir bacon in a large, deep skillet over medium-high heat until crisp, about 10 minutes; drain on a paper towel-lined plate until cool.\nBring a large pot of lightly salted water to a boil; cook the rotelle pasta at a boil until tender yet firm to the bite, about 8 minutes; drain. Rinse the pasta in cold water until cooled; drain.\nCombine chicken, bacon, pasta, cucumber, tomatoes, black olives, artichoke hearts, and green onions in a large bowl.\nPour vinegar and Alfredo sauce over the pasta mixture; stir to combine.\nCover bowl with plastic wrap. Refrigerate at least 1 hour before serving.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "1356489.jpg",
    "o": "",
    "st": "allrecipes"
}