{
    "id": 221070,
    "old_rating": "4.7381",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 (4 ounce) bone-in chicken thighs with skin",
        "1 tablespoon ground black pepper",
        "2 teaspoons ground cumin",
        "1 teaspoon salt",
        "18 cherry peppers in brine (such as PeppadewÂ®)",
        "6 ounces fresh Italian sausage",
        "2 tablespoons olive oil",
        "1 onion, sliced",
        "1 pinch salt",
        "4 cloves garlic, crushed",
        "1 tablespoon herbes de Provence",
        "1/2 teaspoon crushed red pepper flakes",
        "1 cup sliced pepperoncini peppers, with liquid",
        "2 cups chicken stock",
        "1 (14 ounce) can artichoke hearts, drained and chopped",
        "1/2 cup pitted kalamata olives",
        "1 tablespoon chopped fresh basil",
        "1 tablespoon chopped fresh oregano",
        "1 tablespoon chopped fresh marjoram"
    ],
    "nut": [
        "Calories > 389 kcal",
        "Carbs > 15.7 g",
        "Cholesterol > 75 mg",
        "Fat > 25.2 g",
        "Protein > 25 g",
        "Sodium > 2487 mg"
    ],
    "n": "Spicy Mediterranean Chicken with Sausage-Stuffed Cherry Peppers",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"This is an intense food experience, not for the bland palates of the world: succulent chicken thighs, artichoke hearts, olive, pepperoncini, and sausage-stuffed cherry peppers!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chicken thighs in a large bowl; season with black pepper, cumin, and 1 teaspoon salt. Set aside.\nStuff each cherry pepper generously with Italian sausage. Set aside.\nHeat olive oil in Dutch oven over medium-high heat. Place chicken thighs, skin-side down, in pan and brown, about 5 minutes. Turn chicken over and brown other side, about 1 minute. Remove chicken from pan.\nCook onion in the Dutch oven with pinch of salt over medium-high heat; cook and stir until caramelized, about 5 minutes. Reduce heat to medium; stir in garlic, herbes de Provence, and crushed red pepper.\nStir in pepperoncini and juices; cook until warmed through, about 2 minutes. Remove from heat.\nPlace chicken, skin-side up, in a single layer on top of the onions and pepperoncinis in the Dutch oven. Pour stock into the pan until almost covering the chicken.\nSprinkle artichoke hearts, olives, and stuffed cherry peppers over top of chicken.\nReturn to medium-high heat and bring to a simmer.\nCover and roast in preheated oven until sausage is cooked through and liquid is bubbling, about 1 hour.\nGarnish with chopped basil, oregano, and marjoram.",
    "pt": "35 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4127824.jpg",
    "o": "4127824.jpg,3113033.jpg,1972742.jpg,1812722.jpg,1804286.jpg,1775682.jpg",
    "st": "allrecipes"
}