{
    "id": 221080,
    "old_rating": "4.59242",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 skinless, boneless chicken breast halves",
        "salt and fresh ground pepper to taste",
        "1 tablespoon olive oil",
        "2 tablespoons butter",
        "1 tablespoon all-purpose flour",
        "3/4 cup chicken broth",
        "2 tablespoons minced green onions",
        "1/2 teaspoon chipotle chile powder, or more to taste"
    ],
    "nut": [
        "Calories > 333 kcal",
        "Carbs > 4.1 g",
        "Cholesterol > 104 mg",
        "Fat > 22.2 g",
        "Protein > 28.3 g",
        "Sodium > 188 mg"
    ],
    "n": "Chicken Breasts with Chipotle Green Onion Gravy",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"This delicious chicken recipe includes a simple exercise in pan gravy perfection. If I only had one day to teach someone how to cook, you better believe this archetypal sauce recipe would be one of the first things I'd demonstrate.\"",
    "ins": "Place chicken breast halves between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1/2-inch. Season with salt and pepper to taste.\nHeat olive oil in a skillet on high heat until it begins to shimmer, about 1 minute. Reduce heat to medium; cook chicken breasts until browned and no longer pink inside, about 5 minutes per side. Transfer cooked chicken to a warm plate and loosely cover with aluminum foil.\nMelt butter in the skillet; stir in flour and cook for about 2 minutes. Stir in chicken broth, scraping up any browned bits from the bottom of the pan; cook and stir until gravy begins to simmer and thicken, 1 to 2 minutes.\nStir in green onions and chipotle chile powder.\nReturn chicken breasts to the skillet and cook until heated through, 1 to 2 minutes.",
    "pt": "5 m",
    "ct": "15 m",
    "tt": "20 m",
    "i": "4529118.jpg",
    "o": "4529118.jpg,4526821.jpg,4520686.jpg,4518827.jpg,4508096.jpg,4504881.jpg",
    "st": "allrecipes"
}