{
    "id": 221090,
    "old_rating": "4.55882",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup plain low-fat Greek yogurt",
        "1/2 lemon, juiced",
        "1 tablespoon lemon zest",
        "1 tablespoon olive oil",
        "4 cloves garlic, crushed",
        "1 tablespoon paprika",
        "1 teaspoon herbes de Provence",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1 (5 pound) whole chicken, cut into 8 pieces",
        "1/2 cup plain low-fat Greek yogurt",
        "1 tablespoon lemon juice",
        "1 teaspoon harissa",
        "1 pinch salt"
    ],
    "nut": [
        "Calories > 523 kcal",
        "Carbs > 5.8 g",
        "Cholesterol > 169 mg",
        "Fat > 29.9 g",
        "Protein > 55.2 g",
        "Sodium > 590 mg"
    ],
    "n": "Grilled Lemon Yogurt Chicken",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"There is something special about what yogurt does to chicken in its smoky, sizzling time over charcoal. It imparts a tangy flavor that lifts all the other flavorings. It tenderizes slightly, without turning the meat into mush. It grills to a caramelized dark brown without tasting burnt.\"",
    "ins": "Whisk together the 1/2 cup yogurt, the juice from 1/2 lemon, lemon zest, olive oil, garlic, paprika, herbes de Provence, 1 teaspoon salt, and black pepper in a bowl. Pour into a resealable plastic bag. Add chicken, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in refrigerator for at least 3 hours.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nCombine 1/2 cup yogurt, 1 tablespoon lemon juice, and harissa in a small bowl. Set aside.\nRemove chicken from bag and transfer to a plate or baking sheet lined with paper towels. Pat chicken pieces dry with more paper towels. Season with pinch of salt.\nGrill chicken, skin-side down, on the preheated grill for 2 minutes. Turn each piece and move to indirect heat.\nGrill, turning often, with lid down until well-browned and meat is no longer pink in the center, 30 to 35 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C).\nServe chicken with the yogurt harissa mixture on the side.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "3 h ",
    "i": "4458610.jpg",
    "o": "4458610.jpg,3870907.jpg,3870905.jpg,3621507.jpg,1099313.jpg,1024335.jpg",
    "st": "allrecipes"
}