{
    "id": 221015,
    "old_rating": "4.54545",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "1/2 cup white sugar",
        "2 teaspoons ground cinnamon",
        "2 teaspoons baking soda",
        "1 teaspoon baking powder",
        "1 teaspoon salt",
        "1/2 teaspoon ground ginger",
        "1 (20 ounce) can crushed pineapple in juice, drained and juice reserved",
        "1 cup brown sugar",
        "1 (8 ounce) carton egg substitute (such as Egg BeatersÂ®)",
        "2/3 cup vegetable oil",
        "1 tablespoon vanilla extract",
        "2 cups shredded carrots",
        "1 cup shredded zucchini",
        "1 cup raisins",
        "3/4 cup confectioners' sugar"
    ],
    "nut": [
        "Calories > 337 kcal",
        "Carbs > 58.3 g",
        "Cholesterol > < 1 mg",
        "Fat > 10 g",
        "Protein > 5 g",
        "Sodium > 379 mg"
    ],
    "n": "Carrot Cake of My Dreams!",
    "a": "Molly",
    "r": "0",
    "s": 16,
    "des": "\"Very dense, moist carrot cake, full of fruit. In a taste test against a more traditional butter-based carrot cake, my co-workers thought mine must be the more sinful! But no, it's practically VIRTUOUS!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nGrease a fluted tube pan (such as Bundt(R)).\nCombine flour, white sugar, cinnamon, baking soda, baking powder, salt, and ginger in a large bowl.\nWhisk drained pineapple, brown sugar, egg substitute, vegetable oil, and vanilla extract together in a separate bowl until smooth.\nStir pineapple mixture, carrots, zucchini, and raisins into flour mixture just until flour is moistened.\nPour batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted in the cake comes out clean, 55 to 65 minutes.\nCool in the pan for 10 minutes; remove cake from pan and cool completely on a wire rack, about 30 minutes.\nWhisk reserved pineapple juice, 1 tablespoon at a time, with confectioners' sugar until a spreadable glaze forms. Drizzle over cooled cake.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "2751422.jpg",
    "o": "",
    "st": "allrecipes"
}