{
    "id": 221016,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 potato, peeled and cubed (optional)",
        "1 (18 ounce) jar creamy peanut butter",
        "1 egg white, beaten until foamy",
        "1/2 cup margarine",
        "1 (16 ounce) package confectioners' sugar, or as needed",
        "1 (12 ounce) bag chocolate chips"
    ],
    "nut": [
        "Calories > 408 kcal",
        "Carbs > 44.3 g",
        "Cholesterol > 0 mg",
        "Fat > 24.9 g",
        "Protein > 8.4 g",
        "Sodium > 195 mg"
    ],
    "n": "Great Grandma's Peanut Butter Eggs",
    "a": "Kristin",
    "r": "0",
    "s": 18,
    "des": "\"You can make these easy peanut butter eggs yourself any size or shape. They are a MUST HAVE during the Easter holiday...I used the least amount of paraffin wax I could to make the chocolate shiny. Add coconut, nuts, or raisins if desired.\"",
    "ins": "Place potato into a saucepan and cover with water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 15 minutes. Drain. Mash potato in a bowl until no lumps remain; set aside to cool.\nMix peanut butter, egg white, margarine, and confectioners' sugar in a bowl to make a stiff mixture that holds its shape when formed. Mix in the cooled mashed potato.\nCover and refrigerate peanut butter filling overnight.\nPlace chocolate chips into a microwave-safe bowl and heat in microwave on high power for 1 minute; stir. Continue to heat and stir the chocolate chips in 15-second intervals until just warm and smoothly melted; do not overheat.\nScoop up about 1 tablespoon (or desired amount) of peanut butter filling, form into an egg shape, and dip into the melted chocolate. Set chocolate-covered egg aside on waxed paper to set up. Repeat with remaining filling and chocolate. Refrigerate leftovers.",
    "pt": "1 h",
    "ct": "15 m",
    "tt": "9 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}