{
    "id": 221191,
    "old_rating": "4.7835",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "1/2 cup green onions, white and light green parts only, thinly sliced",
        "2 cloves garlic, minced",
        "salt",
        "1 (14 ounce) can artichoke hearts, drained and chopped",
        "1 (10 ounce) package frozen chopped spinach , thawed, drained and squeezed dry",
        "8 ounces cream cheese",
        "1/2 cup shredded Gruyere cheese",
        "1/2 cup finely grated Parmigiano-Reggiano cheese",
        "1/4 teaspoon hot sauce",
        "1 pinch ground nutmeg",
        "salt and freshly ground black pepper to taste",
        "1/4 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 284 kcal",
        "Carbs > 8.8 g",
        "Cholesterol > 71 mg",
        "Fat > 22.9 g",
        "Protein > 12.7 g",
        "Sodium > 637 mg"
    ],
    "n": "Chef John's Hot Spinach Artichoke Dip",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"I've always enjoyed hot spinach artichoke dip, but it always struck me as a little oily. \nI decided to try a mayo-less version, and then raised the stakes even higher by excluding the sour cream as well. To counter this, a bit more cheese was added, and the results were amazing. A rich, creamy, cheesy, not greasy dip.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nMelt butter in a saucepan over medium-low heat; stir in onions and pinch of salt. Cook, stirring occasionally, until onions are soft, about 5 minutes. Stir garlic into onions and remove from heat.\nMix green onion mixture, spinach, artichoke hearts, cream cheese, Gruyere, Parmigiano-Reggiano, hot sauce, nutmeg, salt, and pepper in a large bowl until combined.\nSpoon artichoke mixture into two ramekins. Top each with shredded mozzarella cheese.\nBake in the preheated oven until tops are golden brown and bubbling, about 25 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "4497510.jpg",
    "o": "4497510.jpg,4465520.jpg,4460082.jpg,4429683.jpg,4425056.jpg,4372354.jpg",
    "st": "allrecipes"
}