{
    "id": 221162,
    "old_rating": "4.64646",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 (5 ounce) boneless sirloin steaks",
        "salt and freshly ground black pepper to taste",
        "1/2 cup beef broth",
        "1 1/2 tablespoons barbeque sauce",
        "1 dash hot pepper sauce",
        "freshly ground black pepper",
        "1 teaspoon cold butter, or more to taste",
        "1 tablespoon vegetable oil"
    ],
    "nut": [
        "Calories > 318 kcal",
        "Carbs > 4.6 g",
        "Cholesterol > 81 mg",
        "Fat > 22 g",
        "Protein > 24.1 g",
        "Sodium > 409 mg"
    ],
    "n": "Minute Steaks with Barbeque Butter Sauce",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"Everyone knows that a minute steak is only as good as the pan sauce, and this recipes offers an ultra-simple barbeque butter sauce. There's only a small amount of butter, but the way it blends with the beef broth and barbeque sauce, the effect is amplified.\"",
    "ins": "Place each steak between two sheets of heavy plastic (or inside a resealable freezer bag) on a solid, level surface. Firmly pound each steak with the smooth side of a meat mallet to a thickness of 1/4-inch. Remove steaks from plastic.\nGenerously season each steak with salt and ground black pepper. Set aside.\nCombine beef broth, barbeque sauce, hot sauce, and black pepper in a bowl. Add chilled butter to broth mixture but do not stir.\nHeat oil in a large skillet over high heat until it just begins to smoke, about 1 minute. Place each steak in the pan; sear for 45 to 60 seconds on each side. Remove steaks from skillet and set them aside to rest.\nPour the broth mixture into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Stir occasionally until butter is melted and incorporated, about 2 minutes.\nSpoon broth and butter mixture over steak and serve.",
    "pt": "5 m",
    "ct": "2 m",
    "tt": "7 m",
    "i": "4487043.jpg",
    "o": "4487043.jpg,4469097.jpg,4267255.jpg,3688311.jpg,2726986.jpg,2323625.jpg",
    "st": "allrecipes"
}