{
    "id": 221127,
    "old_rating": "4.20408",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound beef tenderloin, cut into 1/2 inch strips",
        "1/4 cup orange juice",
        "1/4 cup seasoned rice vinegar",
        "2 tablespoons soy sauce",
        "1 tablespoon hot chile paste (such as sambal oelek)",
        "1 tablespoon brown sugar, or to taste",
        "2 cloves garlic, minced",
        "1/4 cup water",
        "1 teaspoon cornstarch",
        "cooking spray",
        "2 tablespoons grated orange zest",
        "1 bunch green onions, sliced - white parts and tops separated",
        "salt and freshly ground black pepper to taste"
    ],
    "nut": [
        "Calories > 267 kcal",
        "Carbs > 16.8 g",
        "Cholesterol > 58 mg",
        "Fat > 14.3 g",
        "Protein > 18.7 g",
        "Sodium > 888 mg"
    ],
    "n": "Spicy Orange Zest Beef",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"This spicy orange zest beef recipe is not supposed to be Chinese food, or even Americanized Chinese take-out food. It is a lower-fat alternative while still a quick, easy, and surprisingly flavorful meal.\"",
    "ins": "Combine beef, orange juice, rice vinegar, soy sauce, hot chili paste, brown sugar, and garlic in a large bowl. Cover and refrigerate for 1 to 2 hours.\nStrain beef in a colander set over a large bowl, allowing beef to drain thoroughly, about 5 minutes. Reserve marinade.\nStir water and cornstarch into the bowl of marinade. Whisk until cornstarch is dissolved, set aside.\nSpray skillet with cooking spray and place over high heat. Cook beef for 1 minute without stirring; cook and stir for an additional minute.\nStir in light parts of green onion and orange zest; cook for 30 seconds.\nStir in marinade and green onion tops; cook and stir until beef is no longer pink inside and sauce is reduced and thick, about 2 to 3 minutes.\nSeason with salt and black pepper to taste.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "2 h",
    "i": "2533386.jpg",
    "o": "2533386.jpg,2303898.jpg,1906346.jpg,1470529.jpg,1389374.jpg,836916.jpg",
    "st": "allrecipes"
}