{
    "id": 221139,
    "old_rating": "4.55051",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/3 cup ranch dressing",
        "1 teaspoon hot chile paste (such as sambal oelek)",
        "4 skinless, boneless chicken breast halves - cut into 1 inch pieces",
        "24 (1-inch) pieces red onion",
        "12 slices thick cut bacon",
        "salt and black pepper to taste",
        "12 (6 inch) bamboo skewers, soaked in water for 2 hours"
    ],
    "nut": [
        "Calories > 441 kcal",
        "Carbs > 21.3 g",
        "Cholesterol > 118 mg",
        "Fat > 20.2 g",
        "Protein > 42.4 g",
        "Sodium > 402 mg"
    ],
    "n": "Bacon Ranch Chicken Skewers",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"These bacon ranch chicken skewers were intended to star at your next tailgate cookout. They are easy, interesting, and incredibly adaptable.\"",
    "ins": "Whisk together ranch dressing and hot chile paste in a large bowl.\nMix in chicken pieces and toss to evenly coat. Cover the bowl with plastic wrap and marinate in the refrigerator for 1 to 3 hours.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nRemove chicken from the bag and transfer to a plate or baking sheet lined with paper towels. Pat chicken pieces dry with more paper towels.\nThread a piece of onion about 1 1/2 inches down the skewer.\nThread the end portion of one strip of bacon onto skewer so the rest of the strip is hanging down. Skewer on a piece of chicken; thread on the next portion of the bacon. Turn the skewer so that the long end of the bacon is again hanging down. Repeat this process of skewering and turning until the entire strip of bacon is threaded, using 4 to 5 chicken pieces.\nThread a second piece of onion onto the end of the skewer.\nRepeat steps 5 through 7 for all twelve skewers.\nSeason chicken skewers with salt and pepper as desired.\nCook the skewers on the preheated grill, turning every 3 to 4 minutes, until nicely browned on all sides and the meat is no longer pink in the center, 12 to 16 minutes total per skewer. Serve with ranch dressing as a dipping sauce.",
    "pt": "30 m",
    "ct": "16 m",
    "tt": "2 h ",
    "i": "4537917.jpg",
    "o": "4537917.jpg,4523588.jpg,3344111.jpg,2432711.jpg,1129826.jpg,896889.jpg",
    "st": "allrecipes"
}