{
    "id": 221101,
    "old_rating": "3.29412",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup pureed strawberries",
        "1/4 cup 2% milk",
        "6 eggs",
        "1 tablespoon vanilla extract",
        "2 1/4 cups sifted cake flour",
        "1 3/4 cups white sugar",
        "4 teaspoons baking powder",
        "1 teaspoon salt",
        "3/4 cup butter, softened",
        "2 (8 ounce) packages cream cheese, softened",
        "1/2 cup butter, softened",
        "2 cups confectioners' sugar",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 641 kcal",
        "Carbs > 74.5 g",
        "Cholesterol > 185 mg",
        "Fat > 35.1 g",
        "Protein > 8.7 g",
        "Sodium > 641 mg"
    ],
    "n": "Best Ever Strawberry Cake",
    "a": "Cassidylea16",
    "r": "0",
    "s": 12,
    "des": "\"This type of strawberry cake recipe with all-natural strawberry flavoring (no gelatin) is quite rare and difficult to find. This strawberry cake tastes light and fresh, never too sweet. A truly excellent recipe that always turns out fluffy and oh-so moist. Topped with the rich and delicious cream cheese frosting, this cake is truly the best ever. It was a handwritten recipe I found in my mom's recipe book, but I assume she found it elsewhere.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nGrease and flour two 8-inch cake pans.\nMix pureed strawberries, milk, eggs, and 1 tablespoon vanilla extract together in a small bowl; transfer to the bowl of a stand mixer.\nBeat flour, white sugar, baking powder, and salt into strawberry mixture on Low; add butter and continue beating on Low until evenly combined.\nStop mixer, scrape sides, and beat again for about 30 seconds.\nDivide batter evenly between the two prepared cake pans.\nBake in the preheated oven until a toothpick inserted into the center of each cake comes out clean, about 25 minutes. Cool the cakes in the pans for about 10 minutes; transfer to wire racks to completely cool, about 30 minutes.\nBeat cream cheese and butter together in a medium bowl until smooth. Gradually beat confectioners' sugar into cream cheese mixture until creamy and fluffy; stir in 1 teaspoon vanilla extract.\nSpread about 1/2 the frosting on top of 1 cake. Place second cake on top of frosting layer; spread the remaining frosting on top of second cake and around sides of both cakes.",
    "pt": "40 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "846554.jpg",
    "o": "",
    "st": "allrecipes"
}