{
    "id": 221157,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 teaspoon butter, or as needed",
        "1 tablespoon olive oil",
        "1/4 teaspoon ground white pepper",
        "1/2 teaspoon smoked paprika",
        "1/8 teaspoon cayenne pepper",
        "1 shallot, minced",
        "2 cups cannellini (white kidney) beans, rinsed and drained",
        "1/4 teaspoon tomato paste",
        "2 tablespoons dry sherry",
        "1 teaspoon soy sauce",
        "1 tablespoon melted butter",
        "salt to taste",
        "2 tablespoons chopped fresh parsley, or as desired",
        "1 pinch paprika, or as desired"
    ],
    "nut": [
        "Calories > 90 kcal",
        "Carbs > 11 g",
        "Cholesterol > 4 mg",
        "Fat > 3.7 g",
        "Protein > 2.8 g",
        "Sodium > 258 mg"
    ],
    "n": "White Bean Pate",
    "a": "LoveNRoquette",
    "r": "0",
    "s": 8,
    "des": "\"A tasty alternative to a traditional liver pate. Serve with crusty bread or pita chips. This can be prepared 24 hours ahead.\"",
    "ins": "Lightly grease a serving bowl with butter.\nPour olive oil into a skillet; add white pepper, smoked paprika, and cayenne pepper. Place the skillet over medium heat and warm the spices until fragrant, 2 to 3 minutes.\nStir shallot into the warm oil and spices; cook and stir until the shallot begins to change color, 3 to 5 minutes.\nStir cannellini beans and tomato paste into the shallot and spice mixture. Cook and stir while mashing the beans thoroughly, about 5 minutes.\nStir sherry and soy sauce through the mashed bean mixture; cook until the liquid evaporates, 1 to 2 minutes.\nRemove the skillet from heat. Stir melted butter through the bean mixture; season with salt. Pack the bean mixture into the prepared bowl.\nChill in refrigerator at least 1 hour; garnish with parsley and paprika to serve.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "828397.jpg",
    "o": "",
    "st": "allrecipes"
}