{
    "id": 221109,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "1/4 teaspoon salt",
        "1/4 teaspoon baking soda",
        "1 1/2 cups butter, softened",
        "3 cups white sugar",
        "6 eggs",
        "1 cup sour cream",
        "1 teaspoon vanilla extract",
        "1 (7 ounce) package sweetened flaked coconut",
        "1 cup milk",
        "2 tablespoons cornstarch",
        "1 cup white sugar",
        "1/2 cup butter, softened",
        "1/2 cup solid vegetable shortening",
        "2 teaspoons vanilla extract",
        "1/2 (7 ounce) package sweetened flaked coconut"
    ],
    "nut": [
        "Calories > 694 kcal",
        "Carbs > 79.9 g",
        "Cholesterol > 138 mg",
        "Fat > 40 g",
        "Protein > 6.6 g",
        "Sodium > 313 mg"
    ],
    "n": "Aunt Connie's Coconut Cake",
    "a": "Diana",
    "r": "0",
    "s": 16,
    "des": "\"Aunt Connie made this cake for special occasions. It is as wonderful as she was, and I remember her every time I make it.\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C).\nGrease a 10-inch tube pan.\nCombine flour, salt, and baking soda in a bowl.\nBeat 1 1/2 cup butter and 3 cups sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color.\nBeat eggs one at a time into butter mixture, allowing each egg to blend completely before adding the next. Beat in sour cream and 1 teaspoon vanilla extract with the last egg.\nGradually stir flour mixture into egg mixture, mixing until just incorporated.\nFold in 7 ounces flaked coconut, mixing just enough to evenly combine. Pour the batter into prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 90 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.\nWhisk milk and cornstarch in a saucepan over medium heat until mixture becomes very thick, stirring constantly, about 5 minutes; set aside to cool completely.\nBeat 1 cup sugar, 1/2 cup butter, and shortening with an electric mixer in a bowl until mixture is smooth and creamy.\nBeat cooled milk paste and 2 teaspoons vanilla extract into sugar mixture to achieve a light and creamy frosting.\nSpread frosting over completely cooled cake and sprinkle remaining 3 1/2 ounces flaked coconut over the frosting.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "1030817.jpg",
    "o": "",
    "st": "allrecipes"
}