{
    "id": 221146,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (18.25 ounce) package yellow cake mix",
        "1 (14.5 ounce) can pure pumpkin",
        "3/4 cup light brown sugar",
        "1/2 cup vegetable oil",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon ground nutmeg",
        "4 eggs",
        "1/2 cup butter",
        "1/2 cup light brown sugar",
        "1/2 cup chopped pecans, or more to taste"
    ],
    "nut": [
        "Calories > 490 kcal",
        "Carbs > 59.9 g",
        "Cholesterol > 83 mg",
        "Fat > 26.9 g",
        "Protein > 4.9 g",
        "Sodium > 450 mg"
    ],
    "n": "Too Cool For School Pumpkin Spice Cake",
    "a": "Stephanie Suker",
    "r": "0",
    "s": 12,
    "des": "\"I found this recipe in the teacher's lounge. An unnamed source placed copies of this recipe on a table. It is so delicious and very moist!!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nGrease a fluted tube pan (such as a Bundt(R)).\nPlace cake mix into a large mixing bowl. Beat in pumpkin, 3/4 cup brown sugar, vegetable oil, cinnamon, allspice, and nutmeg with an electric mixer until cake mix is moistened, about 1 minute. Beat in eggs; continue beating batter for 2 more minutes. Pour batter into prepared tube pan.\nMelt butter with 1/2 cup brown sugar in a saucepan over low heat until brown sugar has dissolved; stir in pecans. Spoon half the pecan mixture over the cake batter.\nBake cake in the preheated oven until lightly browned at the edges and a toothpick inserted into the center of the cake comes out clean, about 1 hour.\nCool cake in pan for 15 to 20 minutes, then invert cake onto serving platter. Allow cake to cool completely before drizzling the remaining half of the pecan topping over the cake.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "2 h",
    "i": "870530.jpg",
    "o": "",
    "st": "allrecipes"
}