{
    "id": 221197,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 egg, separated",
        "1 tablespoon water",
        "1 prepared 9-inch single pie crust",
        "2 eggs",
        "1 cup milk",
        "2 tablespoons canola oil",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1/2 cup chopped onion",
        "1/4 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 (6 ounce) bag fresh spinach, chopped",
        "1/4 teaspoon dried tarragon",
        "1/4 teaspoon paprika",
        "1/8 teaspoon cayenne pepper",
        "1 1/4 cups shredded white Cheddar cheese",
        "1 small zucchini, thinly sliced into rounds",
        "1/4 cup shredded white Cheddar cheese"
    ],
    "nut": [
        "Calories > 387 kcal",
        "Carbs > 20.5 g",
        "Cholesterol > 126 mg",
        "Fat > 27.6 g",
        "Protein > 15.8 g",
        "Sodium > 507 mg"
    ],
    "n": "Spinach Mushroom Quiche with Tarragon",
    "a": "ANNEJ4",
    "r": "0",
    "s": 6,
    "des": "\"A yummy veggie quiche with hearty flavor from the mushrooms. Use soy milk, 2%, whole - whatever you prefer.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace egg white of 1 egg into a small bowl and whisk with water until foamy. Set the egg yolk aside in a large bowl.\nFit pie crust into a 9-inch pie dish. Brush egg white mixture over the edges and inside of crust. Poke holes into the inside and up the sides of the crust with a fork.\nBake crust in the preheated oven until the egg white glaze cooks onto the crust, about 5 minutes.\nPour any remaining egg white mixture into the large bowl with the yolk; whisk in 2 more eggs and milk until thoroughly combined. Set egg mixture aside.\nHeat canola oil in a large skillet over medium heat; cook and stir mushrooms and onion until the mushroom's liquid has evaporated, 9 to 15 minutes. Season with salt and black pepper.\nTurn off heat and stir spinach into hot mushrooms to wilt. Mix in tarragon, paprika, and cayenne pepper.\nGently stir mushroom-spinach mixture into eggs and milk. Fold 1 1/4 cup of white Cheddar cheese into the filling.\nPour mushroom-spinach filling into the prebaked pie crust and arrange slices of zucchini in a decorative pattern on top of the filling. Top with 1/4 cup white Cheddar cheese in an even layer.\nPlace the quiche onto a baking sheet and bake in the oven until top is lightly browned and a knife inserted into the middle of the quiche comes out clean, 35 to 40 minutes.\nAllow quiche to cool on the hot baking sheet for 5 minutes before removing to finish cooling on a wire rack until serving temperature, 10 to 15 more minutes.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "2891301.jpg",
    "o": "",
    "st": "allrecipes"
}