{
    "id": 221140,
    "old_rating": "4.35714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "8 ounces uncooked spaghetti, broken into 1 inch pieces",
        "2 cloves garlic, minced",
        "1 1/2 cups chicken broth",
        "1/2 teaspoon red pepper flakes, or to taste",
        "salt to taste",
        "2 tablespoons freshly grated Parmigiano-Reggiano cheese, or to taste",
        "1 tablespoon chopped fresh flat-leaf parsley"
    ],
    "nut": [
        "Calories > 516 kcal",
        "Carbs > 86.1 g",
        "Cholesterol > 8 mg",
        "Fat > 10.4 g",
        "Protein > 17.6 g",
        "Sodium > 1968 mg"
    ],
    "n": "Broken Spaghetti Risotto",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"This pasta dish is not really risotto; it only refers to the similar technique used in that famous Italian dish. Like the grains of Arborio rice, pieces of broken pasta are tossed in hot butter or oil before the liquid is added, but here we're going even further, and toasting it to a gorgeous nut-brown. This gives the dish its signature look, as well as adds a subtle nutty flavor.\"",
    "ins": "Heat oil in a saucepan over medium heat; add spaghetti and toast, stirring constantly, until golden brown, 3 to 5 minutes.\nStir garlic into spaghetti pieces and cook for 30 seconds.\nPour in 1/2 cup broth and increase heat to medium high. Stir spaghetti and broth until all the liquid is absorbed, 2 to 3 minutes. Repeat this process until all of the stock is absorbed and noodles are desired tenderness, about 10 minutes.\nReduce heat to low. Season spaghetti with salt and red pepper flakes to taste. Remove from heat.\nStir Parmigiano-Reggiano cheese and parsley into spaghetti and serve.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "25 m",
    "i": "4524606.jpg",
    "o": "4524606.jpg,4465632.jpg,3663885.jpg,3462608.jpg,2307237.jpg,1107833.jpg",
    "st": "allrecipes"
}