{
    "id": 221173,
    "old_rating": "3.82759",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup white sugar",
        "1/2 cup shortening",
        "2 eggs, room temperature",
        "1 teaspoon vanilla extract",
        "1 cup mashed fresh strawberries",
        "1/2 teaspoon baking soda",
        "2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "2 cups confectioners' sugar",
        "1/4 cup butter, room temperature",
        "1/4 cup mashed fresh strawberries"
    ],
    "nut": [
        "Calories > 264 kcal",
        "Carbs > 41.5 g",
        "Cholesterol > 31 mg",
        "Fat > 10.1 g",
        "Protein > 2.6 g",
        "Sodium > 142 mg"
    ],
    "n": "Aunt Kate's Strawberry Cake",
    "a": "Drea217",
    "r": "0",
    "s": 16,
    "des": "\"This recipe dates back to the early 1900's and was made by my grandmother's sister Kate. I have the fondest memories of my grandmother and my mother making this when strawberries came into season. The cake itself is not very sweet, although the icing is. The balance is perfect. I make this for many occasions, and my secret taste testers have remarked how wonderful it is. Just a side note: using fresh, sweet strawberries is the key.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nGrease a cake pan.\nBeat white sugar and shortening together until light and fluffy.\nBeat eggs, one at a time, into sugar mixture until well mixed; stir in vanilla extract.\nStir 1 cup strawberries and baking soda in a large bowl until baking soda is dissolved. This will help strawberries foam and rise in the cake.\nWhisk flour and salt together in a separate bowl. Stir flour mixture and strawberry mixture by hand, into sugar mixture, alternating flour mixture, then strawberry mixture, beginning and ending with flour mixture.\nPour batter into prepared cake pan.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 25 to 30 minutes.\nBeat confectioners' sugar, butter, and 1/4 cup strawberries in a bowl with an electric mixer until blended; frost the cooled strawberry cake.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "878461.jpg",
    "o": "2825592.jpg,2335810.jpg,2135404.jpg,1028392.jpg,1026724.jpg,1024351.jpg",
    "st": "allrecipes"
}