{
    "id": 221142,
    "old_rating": "4.70677",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons melted butter",
        "18 graham crackers, crushed",
        "1/4 cup all-purpose flour",
        "1 cup sour cream",
        "1 tablespoon vanilla extract",
        "4 (8 ounce) packages cream cheese",
        "1 1/2 cups white sugar",
        "2/3 cup milk",
        "4 eggs",
        "1 teaspoon finely grated lemon zest",
        "1 teaspoon finely grated orange zest"
    ],
    "nut": [
        "Calories > 556 kcal",
        "Carbs > 46.9 g",
        "Cholesterol > 161 mg",
        "Fat > 37 g",
        "Protein > 10.5 g",
        "Sodium > 408 mg"
    ],
    "n": "New York-Style Cheesecake",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"This is my favorite recipe for New York-style cheesecake, and includes a great technique for letting the citrus-kissed cake finish in the oven, so that no crack forms when the cake cools.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nLightly grease the bottom and sides of a 9-inch springform pan.\nMix graham cracker crumbs and melted butter in a bowl until evenly moistened. Press crumb mixture into the bottom and about 1/2-inch up the sides of the springform pan.\nWhisk flour, sour cream, and vanilla extract in bowl. Set aside.\nStir cream cheese and sugar with a wooden spoon in a large bowl until evenly incorporated, 3 to 5 minutes.\nPour milk into cream cheese mixture and whisk until just combined.\nWhisk in eggs, one at a time, stirring well after each addition.\nStir in lemon zest, orange zest, and sour cream mixture; whisk until just incorporated.\nPour mixture into prepared springform pan.\nBake in the preheated oven until the edges have nicely puffed and the surface of the cheesecake is firm except for a small spot in the center that will jiggle when the pan is gently shaken, about 1 hour.\nWhen the cheesecake is done, turn off the oven and let it cool in the oven for 3 to 4 hours. This prevents any cracks from forming on the top of the cheesecake.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "4 h ",
    "i": "4536435.jpg",
    "o": "4536435.jpg,4536434.jpg,4522045.jpg,4515072.jpg,4468030.jpg,4411386.jpg",
    "st": "allrecipes"
}