{
    "id": 221205,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup caramel ice cream topping",
        "3 1/2 cups milk",
        "1 (14 ounce) can sweetened condensed milk (such as Eagle BrandÂ®)",
        "1 (3.5 ounce) package instant vanilla pudding mix",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon salt",
        "1 1/2 cups coarsely chopped pecans, or more to taste"
    ],
    "nut": [
        "Calories > 250 kcal",
        "Carbs > 36.4 g",
        "Cholesterol > 13 mg",
        "Fat > 10.6 g",
        "Protein > 4.9 g",
        "Sodium > 285 mg"
    ],
    "n": "Pecan Caramel Ice Cream",
    "a": "rlt11_NMC",
    "r": "0",
    "s": 16,
    "des": "\"This recipe is one that my cousin made up using her mother's basic recipe when we were teenagers. It tastes like pecan pie with ice cream. It became one of the family's favorites. Nowadays we use our stand mixer's nice attachment, the ice cream bowl - or on-the-counter ice cream makers - and it still comes out great. I mix this up of a morning or the night before I plan to make it. One reason for this was the longer it sets, the better the flavors blend into cream mixture, making a much better flavored ice cream and a faster freeze time.\"",
    "ins": "Place caramel ice cream topping into a microwave-safe container and heat in microwave until slightly warmed and softened, 10 to 30 seconds.\nWhisk caramel topping, milk, sweetened condensed milk, instant vanilla pudding mix, vanilla extract and salt in a large mixing bowl until pudding mix has dissolved and batter is smooth.\nCover bowl and chill batter thoroughly, at least 6 hours to overnight.\nPour chilled batter into an ice cream maker and freeze according to manufacturer's instructions; stir pecans into soft ice cream at end of freezing time.\nServe soft if desired. If a harder ice cream is preferred, pack pecan ice cream into a lidded container and freeze to desired consistency.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "970626.jpg",
    "o": "",
    "st": "allrecipes"
}