{
    "id": 221200,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 teaspoons olive oil",
        "5 green onions, chopped",
        "2 cloves garlic, finely chopped",
        "1 (6 ounce) bag fresh baby spinach",
        "1 1/2 teaspoons olive oil",
        "8 fresh mushrooms, sliced",
        "4 eggs",
        "8 ounces sheep-milk feta cheese, crumbled",
        "1 pound jalapeno yogurt cheese, shredded"
    ],
    "nut": [
        "Calories > 342 kcal",
        "Carbs > 3.6 g",
        "Cholesterol > 159 mg",
        "Fat > 26.7 g",
        "Protein > 20.7 g",
        "Sodium > 735 mg"
    ],
    "n": "Crustless Spinach and Mushroom Quiche",
    "a": "ChefChris",
    "r": "0",
    "s": 8,
    "des": "\"I decided to make a quiche so I could have something delicious to eat in the mornings for breakfast. I searched the web and found a few quiche recipes and then adapted my own from the basic ingredients. This was, to my surprise, super easy AND super delicious. Use lactose-free margarine instead of olive oil if desired, and jalapeno yogurt cheese, goat-milk Cheddar, or some combination. Enjoy!\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C).\nHeat 1 1/2 teaspoon olive oil in a nonstick oven-safe skillet over medium heat; cook and stir green onions and garlic in the hot oil until the garlic is fragrant but not browned, about 1 minute. Stir in spinach, cover skillet, and cook until spinach is wilted, about 5 minutes. Transfer spinach to a large bowl.\nHeat 1 1/2 teaspoon olive oil in same skillet and turn heat to medium-high. Cook and stir mushrooms until lightly browned, about 5 minutes; remove from heat.\nSqueeze any moisture from spinach mixture and stir into mushrooms. Beat eggs in a bowl until thoroughly combined. Stir eggs into the spinach-mushroom mixture; thoroughly stir in feta and jalapeno yogurt cheeses.\nSpoon the mixture back into the skillet; use a spoon to level surface. Wipe any filling from edge of skillet above the filling with a paper towel.\nBake in the preheated oven until the quiche is golden brown, about 45 minutes. Let cool slightly before cutting into slices.",
    "pt": "25 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "943874.jpg",
    "o": "",
    "st": "allrecipes"
}