{
    "id": 221225,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 dried chipotle peppers",
        "12 roma (plum) tomatoes",
        "1/4 yellow onion, coarsely chopped",
        "2 cloves garlic, or more to taste",
        "2 tablespoons white vinegar",
        "2 teaspoons salt",
        "1 pinch ground black pepper, or to taste (optional)",
        "1 lime, juiced, or more to taste (optional)"
    ],
    "nut": [
        "Calories > 16 kcal",
        "Carbs > 3.7 g",
        "Cholesterol > 0 mg",
        "Fat > 0.2 g",
        "Protein > 0.7 g",
        "Sodium > 391 mg"
    ],
    "n": "Red-Ribbon Roasted Salsa",
    "a": "feistykitty",
    "r": "0",
    "s": 12,
    "des": "\"This recipe originated from a recipe that was supposed to duplicate that of my favorite Mexican restaurant. I've heavily modified the original recipe and like this variation SO much more! It's relatively easy. This makes a medium-hot salsa. I've named it 'Red-Ribbon' because it took second place at my company salsa competition last Cinco de Mayo (lost first in a tie-breaker!).\"",
    "ins": "Fill a saucepan with water, stir in dried chipotle peppers, and bring to a boil. Reduce heat to low and simmer until peppers are soft, about 30 minutes. Drain and let cool. When peppers are cool, remove stems, cut open peppers, and remove seeds. Set peppers aside.\nPreheat an outdoor grill for high heat and lightly oil the grate.\nGrill tomatoes on hot grate until skin blackens and begins to peel, turning tomatoes often to blacken all sides, about 10 minutes. Set grilled tomatoes aside to cool.\nPlace grilled tomatoes, chipotle peppers, yellow onion, white vinegar, salt, black pepper, and lime juice into a food processor; pulse a few times, then process until almost pureed.\nRefrigerate until flavors have blended, at least 2 hours to overnight.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "3 h",
    "i": "893577.jpg",
    "o": "",
    "st": "allrecipes"
}