{
    "id": 221268,
    "old_rating": "4.76",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 cup sugar",
        "2 teaspoons cornstarch",
        "3 egg whites, room temperature",
        "1 teaspoon vanilla extract",
        "3/4 teaspoon white vinegar",
        "2 cups heavy cream",
        "3 tablespoons confectioners' sugar",
        "1 teaspoon vanilla extract",
        "1 pint whole strawberries, stems removed"
    ],
    "nut": [
        "Calories > 210 kcal",
        "Carbs > 18.4 g",
        "Cholesterol > 54 mg",
        "Fat > 14.8 g",
        "Protein > 1.9 g",
        "Sodium > 29 mg"
    ],
    "n": "Chef John's Pavlova with Strawberries",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"This dessert is fun to make and eat. Fresh fruit, especially berries and kiwis, balances the sweet, gooey crunch.\"",
    "ins": "Preheat oven to 250 degrees F (120 degrees C).\nLine a baking sheet with a silicone baking mat or parchment paper.\nWhisk sugar and cornstarch in a bowl. Set aside.\nBeat egg whites in a bowl until they are foamy and have a thick, ribbony texture, 2 to 3 minutes.\nPour 1/4 of the sugar mixture into the egg whites; whisk until completely incorporated, about 30 seconds. Repeat for the rest of the sugar mixture, whisking after each addition, until all of the sugar mixture is incorporated and the egg whites are glossy and thick.\nPour vanilla and vinegar into egg white mixture; whisk until you can lift your beater or whisk straight up and the egg whites form a sharp peak that holds its shape, 2 to 3 minutes.\nSpoon egg white mixture onto prepared baking sheet; spread out into a 2-inch high by 6-inch wide disc.\nBake in the preheated oven for 1 hour.\nTurn off the oven, crack open the oven door and let the Pavlova cool for one hour.\nWhip cream, sugar, and vanilla extract in a bowl until soft peaks form, 3 to 4 minutes.\nTransfer Pavlova to a serving plate. Top with whipped cream and fresh strawberries.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "2 h ",
    "i": "4532430.jpg",
    "o": "4532430.jpg,4529612.jpg,4516284.jpg,4502642.jpg,4472681.jpg,3439351.jpg",
    "st": "allrecipes"
}