{
    "id": 221296,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound thinly sliced chicken breast meat",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "2 tablespoons olive oil",
        "14 slices precooked bacon, chopped",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1 cup Alfredo sauce (such as ClassicoÂ®)",
        "1 teaspoon butter, or more if needed",
        "5 large flour tortillas",
        "2 cups shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 880 kcal",
        "Carbs > 65.6 g",
        "Cholesterol > 121 mg",
        "Fat > 46.2 g",
        "Protein > 49.6 g",
        "Sodium > 2178 mg"
    ],
    "n": "Carbonara Quesadillas",
    "a": "Tina D",
    "r": "0",
    "s": 5,
    "des": "\"Chicken, bacon, mozzarella, mushrooms, and creamy Alfredo sauce are all inside a warm, crunchy quesadilla! Fun and easy to make. Impressively great flavor! Try these tonight!\"",
    "ins": "Season chicken with salt and black pepper.\nHeat olive oil in a large skillet over medium heat. Cook and stir chicken in the hot oil until chicken is fully cooked and no longer pink in the center, 8 to 10 minutes. Remove chicken from skillet and set aside. Pour out any excess grease from the pan.\nCook and stir bacon and mushrooms in the same skillet over medium heat until mushrooms are lightly browned, about 5 minutes. Reduce heat to low.\nSlice chicken into bite-size strips.\nStir Alfredo sauce and chicken strips into mushroom mixture; simmer for a few minutes.\nMelt butter in a separate large skillet. Place a tortilla in the melted butter.\nScoop about 1/5 chicken alfredo mixture onto 1 half of warm tortilla.\nSprinkle about 1/5 mozzarella cheese over chicken alfredo mixture layer; fold tortilla in half. Cook until bottom of tortilla is lightly browned and mozzarella is melted, 3 to 5 minutes.\nCarefully flip quesadilla with a spatula and lightly brown the other side of tortilla, 3 to 5 minutes. Repeat with remaining tortillas and filling.\nSlice quesadillas into thirds to serve.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "873653.jpg",
    "o": "",
    "st": "allrecipes"
}