{
    "id": 221269,
    "old_rating": "4.05263",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons butter",
        "1/2 cup diced onion",
        "1/2 cup chopped jalapeno peppers",
        "1/2 cup diced celery",
        "1 pinch salt",
        "1/2 teaspoon seafood seasoning (such as Old BayÂ®)",
        "1/4 teaspoon cayenne pepper",
        "1 1/2 tablespoons all-purpose flour",
        "2 1/2 cups water",
        "1/2 pound sweet corn kernels",
        "2 ounces fresh crabmeat",
        "1 cup water",
        "1/2 pound sweet corn kernels",
        "2 cloves peeled garlic",
        "6 ounces fresh crabmeat",
        "1/4 cup heavy cream",
        "1 teaspoon Spanish paprika (preferably sweet)",
        "1 bunch thinly sliced green onion for garnish",
        "1 pinch cayenne pepper"
    ],
    "nut": [
        "Calories > 197 kcal",
        "Carbs > 21.8 g",
        "Cholesterol > 46 mg",
        "Fat > 9 g",
        "Protein > 10.5 g",
        "Sodium > 217 mg"
    ],
    "n": "Creole Crab and Corn Chowder",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"Ideally you would make this in the middle of summer with ears of fresh, sweet-as-sugar corn. You can also make a perfectly fine version of this chowder using a premium-quality, extra-sweet, frozen corn.\"",
    "ins": "Melt butter in a Dutch oven over medium heat; stir in onion, jalepeno peppers, celery, and a pinch of salt. Cook until onions are soft and translucent, 7 to 10 minutes.\nStir seafood seasoning and cayenne pepper into onion mixture; cook for 30 seconds.\nSprinkle flour over onion mixture; cook and stir until mixture is slightly thickened, about 2 minutes.\nPour 2 1/2 cups water, 1/2 pound corn kernels, and 2 ounces crabmeat into the onion mixture; increase heat to medium-high and bring to simmer.\nPlace 1 cup water, 1/2 pound corn kernels, and garlic into a blender. Cover and puree until smooth.\nPour corn puree into the Dutch oven and bring mixture to a boil. Reduce heat to low; simmer until chowder is thicker and the color deepens, about 45 minutes.\nStir 6 ounces of crabmeat, paprika, and heavy cream into chowder. Season with salt and pepper to taste; garnish with green onions and a pinch of cayenne pepper.",
    "pt": "25 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}