{
    "id": 221227,
    "old_rating": "4.55615",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups cold water",
        "1/4 cup kosher salt",
        "1/4 cup honey",
        "4 boneless skinless chicken breast halves",
        "1/4 cup buttermilk",
        "1 cup all-purpose flour",
        "1 teaspoon black pepper",
        "1/2 teaspoon garlic salt",
        "1/2 teaspoon onion salt",
        "cayenne pepper to taste",
        "vegetable oil for frying"
    ],
    "nut": [
        "Calories > 481 kcal",
        "Carbs > 49.4 g",
        "Cholesterol > 65 mg",
        "Fat > 21.5 g",
        "Protein > 22.8 g",
        "Sodium > 6378 mg"
    ],
    "n": "Honey-Brined Fried Chicken Breasts",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Is there anything less inspiring than a boneless-skinless chicken breast? How do we turn this culinary snoozer into something worthwhile? Fry it.\"",
    "ins": "Mix cold water, kosher salt, and honey in a large bowl; stir until salt dissolves. Add chicken breasts, and weigh them down with a plate to keep them completely submerged. Cover entire bowl with plastic wrap and refrigerate for 1 hour.\nRemove bowl from refrigerator; drain and dry chicken. Pour buttermilk over chicken in a large bowl. Set aside at room temperature for 15 minutes.\nCombine flour, black pepper, garlic salt, onion salt, and cayenne pepper in a large bowl.\nCoat each chicken breast in flour mixture until well covered on all sides; place flour-coated chicken breasts on a cooling rack to dry for 15 minutes.\nHeat vegetable oil in a large skillet to 350 degrees F (175 degrees C). Cook chicken breasts until browned and no longer pink in the center, about 10 to 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nTransfer chicken to a cooling rack; allow to cool for 5 minutes.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "3764567.jpg",
    "o": "3764567.jpg,3635813.jpg,3187839.jpg,3172928.jpg,2030470.jpg,1683289.jpg",
    "st": "allrecipes"
}