{
    "id": 221274,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "CriscoÂ® Original No-Stick Cooking Spray",
        "Slider Buns:",
        "2 (6.5 ounce) packages Martha WhiteÂ® Yellow Cornbread Mix",
        "1/2 cup Martha WhiteÂ® All-Purpose Flour",
        "1 1/2 cups milk",
        "1/4 cup sour cream",
        "1 large egg",
        "3 tablespoons chopped chives",
        "8 slices bacon, cooked and crumbled",
        "3/4 cup crumbled Gorgonzola cheese",
        "Burgers:",
        "2 tablespoons butter",
        "1 medium yellow onion, sliced into thin rings",
        "1 1/2 pounds ground chuck",
        "1 large egg",
        "1/2 cup Italian-style bread crumbs",
        "2 cloves garlic, minced",
        "1 teaspoon salt",
        "1/2 teaspoon pepper",
        "12 small slices (0.5 oz each) Cheddar cheese",
        "Chipotle Mayo:",
        "1/2 cup mayonnaise",
        "1 chipotle pepper in adobo sauce",
        "1 teaspoon adobo sauce from chipotle peppers"
    ],
    "nut": [
        "Calories > 1143 kcal",
        "Carbs > 64.5 g",
        "Cholesterol > 231 mg",
        "Fat > 77.7 g",
        "Protein > 46 g",
        "Sodium > 2216 mg"
    ],
    "n": "Bacon and Gorgonzola Cornbread Sliders with Chipotle Mayo",
    "a": "MarthaWhiteÂ®",
    "r": "0",
    "s": 6,
    "des": "\"Cornbread muffins baked with crumbled Gorgonzola and bacon are split like buns for these beefy sliders with spicy chipotle mayo.\"",
    "ins": "Heat oven to 400 degrees F.  Spray 2 cast iron straight-sided muffin pans (6 cups each) with no-stick cooking spray.  Stir together cornbread mix, flour, milk, sour cream, and egg in medium bowl until well blended.  Stir in chives, bacon, and cheese.  Fill prepared muffin pans 3/4 full.  Bake 10 to 12 minutes or until golden brown.  (Any remaining batter may be made into additional muffins.)\nMelt butter in a 12-inch Lodge cast iron skillet over medium-low heat.  Add onions.  Cook until onions are translucent, 8 to 10 minutes.  Remove onions and set aside.\nCombine ground chuck, egg, bread crumbs, garlic, salt, and pepper in large bowl.  Blend well.  Divide into 12 equal portions.  Pat out into thin burgers.  Cook in skillet over medium to medium-high heat until done.  Top each burger with slice of cheese.\nCombine mayonnaise, chipotle pepper and adobo sauce.  Slice cornbread to make buns.  Spread thin layer of chipotle mayo on top and bottom.  Place burger on bottom halves.  Top with onions.  Place top on burger.",
    "pt": "20 m",
    "ct": "",
    "tt": "",
    "i": "986166.jpg",
    "o": "",
    "st": "allrecipes"
}