{
    "id": 221272,
    "old_rating": "4.38144",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 teaspoons butter",
        "1 teaspoon olive oil",
        "4 links chicken and apple sausage",
        "1 onion, sliced",
        "1 pinch salt and freshly ground black pepper to taste",
        "3 cloves garlic, crushed",
        "3 cups apple cider or apple juice",
        "1 pound small Yukon Gold potatoes, scrubbed but not peeled",
        "1 1/2 pounds finely shredded green cabbage",
        "salt and freshly ground black pepper to taste",
        "2 tablespoons Dijon mustard, for garnish",
        "2 tablespoons chopped fresh parsley, for garnish"
    ],
    "nut": [
        "Calories > 441 kcal",
        "Carbs > 63.5 g",
        "Cholesterol > 108 mg",
        "Fat > 14.1 g",
        "Protein > 17.7 g",
        "Sodium > 706 mg"
    ],
    "n": "Chicken Apple Sausage with Cabbage",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"This is a great cold weather meal, although it's delicious anytime of the year.\"",
    "ins": "Combine butter and olive oil in a Dutch oven over medium heat; add sausages and cook until browned on all sides,  6 to 8 minutes.\nStir onion, pinch of salt, and pinch of pepper in with the sausages. Cook and stir until onions are slightly translucent and caramelized, about 5 minutes.\nStir garlic into sausage mixture; cook and stir for 30 seconds.\nPour apple cider into sausage mixture; increase heat to medium-high and stir in potatoes. Bring to a simmer.\nPour cabbage over top of sausage mixture and reduce heat to medium-low. Cover and simmer until potatoes are tender, 20 to 25 minutes. Remove sausages and potatoes from the Dutch oven and set aside.\nIncrease heat to high, simmer liquid until thick and reduced by half, about 5 minutes.\nReturn potatoes and sausages to the Dutch oven and remove from heat. Season with salt and pepper to taste. Garnish with mustard and parsley.",
    "pt": "10 m",
    "ct": "45 m",
    "tt": "55 m",
    "i": "3119546.jpg",
    "o": "3119546.jpg,3116201.jpg,3112012.jpg,3103525.jpg,3092738.jpg,3088234.jpg",
    "st": "allrecipes"
}