{
    "id": 221228,
    "old_rating": "4.87013",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 eggplant, cubed",
        "2 tablespoons olive oil",
        "salt and freshly ground black pepper to taste",
        "1/3 cup finely minced onion",
        "1 pinch crushed red pepper flakes, or to taste",
        "1 1/2 cups chicken broth",
        "1 cup marinara sauce",
        "1/4 cup plain dry bread crumbs",
        "1 large egg",
        "1 1/2 tablespoons Greek yogurt",
        "1/4 cup finely minced onion",
        "4 cloves garlic, finely minced",
        "1 1/2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon ground cumin",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground coriander",
        "1 pound ground lamb",
        "cayenne pepper to taste",
        "1 tablespoon chopped fresh mint"
    ],
    "nut": [
        "Calories > 426 kcal",
        "Carbs > 21.9 g",
        "Cholesterol > 125 mg",
        "Fat > 26.6 g",
        "Protein > 25.3 g",
        "Sodium > 1644 mg"
    ],
    "n": "Little Lamb Meatballs in a Spicy Eggplant Tomato Sauce",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"I love lamb, and once in a while I enjoy it in small, spherical portions.\"",
    "ins": "Preheat the oven to 450 degrees F (230 degrees C).\nLine a baking sheet with parchment paper or silicone baking mats.\nCombine eggplant, olive oil, salt and black pepper in a large skillet over medium-high heat. Cook and stir until eggplant begins to soften, about 5 minutes.\nMix in minced onion and red pepper flakes. Reduce heat to medium; cook and stir until onion softens, 4 minutes.\nStir in chicken broth and marinara sauce. Reduce heat to medium-low and simmer until sauce mixture has reduced by half, about 30 minutes.\nWhisk bread crumbs, egg, and Greek yogurt in a large bowl until the bread crumbs absorb all the liquid, about 3 minutes.\nMix onions, garlic, Kosher salt, black pepper, cumin, cinnamon, and coriander into the bread crumb mixture.\nCrumble lamb into bread crumb spice mixture; stir in cayenne pepper.\nForm lamb mixture into small meatballs and transfer to prepared baking sheet. Place baking sheet into the preheated oven and bake until browned, but still pink inside, about 10 minutes.\nRemove meatballs from the oven and stir into simmering sauce. Simmer over low heat until sauce begins to thicken, 30 to 45 minutes.\nGarnish with chopped fresh mint.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4530484.jpg",
    "o": "4530484.jpg,4498061.jpg,3337967.jpg,3295034.jpg,2269193.jpg,2252788.jpg",
    "st": "allrecipes"
}