{
    "id": 221322,
    "old_rating": "4.41667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound chicken thighs, cut into 1/2-inch pieces",
        "3/4 teaspoon salt",
        "1 pinch ground white pepper",
        "1 tablespoon sunflower seed oil",
        "24 wooden skewers",
        "Peanut Sauce:",
        "1 cup water",
        "5 tablespoons peanut butter",
        "2 tablespoons kecap manis (sweet soy sauce)",
        "1 tablespoon brown sugar",
        "2 cloves garlic, minced",
        "1/2 teaspoon salt",
        "1 tablespoon lime juice"
    ],
    "nut": [
        "Calories > 326 kcal",
        "Carbs > 8.9 g",
        "Cholesterol > 70 mg",
        "Fat > 21.8 g",
        "Protein > 24.9 g",
        "Sodium > 1339 mg"
    ],
    "n": "Indonesian Chicken Skewers with Peanut Sauce (Satay Ayam)",
    "a": "lenakurniasih",
    "r": "0",
    "s": 4,
    "des": "\"I'm Indonesian but I live in Spain. I'd like to share with you my recipe of satay ayam. It has helped me a lot to overcome my homesickness. I hope this dish will be one of your favorite Asian dishes. You will not be able to resist the sweet and salty taste of the peanut sauce!\"",
    "ins": "Combine chicken thighs, 3/4 teaspoon salt, white pepper, and sunflower seed oil in a bowl. Cover and refrigerate for 1 to 2 hours.\nSoak wooden skewers in water to prevent burning during cooking.\nBring water, peanut butter, kecap manis, brown sugar, garlic, and 1/2 teaspoon salt to a boil in a small saucepan; stir to combine. Remove from heat and add lime juice.\nThread marinated chicken onto skewers. Set about 2 tablespoons peanut sauce aside in a small bowl and brush the sauce in the bowl over chicken.\nHeat a grill pan or large skillet over medium-high heat. Arrange chicken skewers in batches on grill pan and cook until chicken is no longer pink in the center, 1 to 2 minutes per side. Serve skewers with remaining peanut sauce from the saucepan.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "1672873.jpg",
    "o": "",
    "st": "allrecipes"
}