{
    "id": 221356,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups whole almonds",
        "boiling water to cover",
        "2/3 cup chopped dried apricots",
        "8 Medjool dates, pitted and chopped",
        "4 1/2 cups unbleached all-purpose flour",
        "1 tablespoon ground cinnamon",
        "2 teaspoons ground ginger",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon ground cloves",
        "1/2 teaspoon ground cardamom",
        "1/2 teaspoon salt",
        "2 eggs",
        "1 cup brown sugar",
        "1 cup honey",
        "1/4 cup blackstrap molasses",
        "1 tablespoon water",
        "2 teaspoons almond extract",
        "2 teaspoons grated orange zest",
        "1 teaspoon grated lemon zest",
        "3/4 cup confectioners' sugar",
        "2 tablespoons whole milk",
        "1 teaspoon lemon zest"
    ],
    "nut": [
        "Calories > 188 kcal",
        "Carbs > 34.8 g",
        "Cholesterol > 10 mg",
        "Fat > 4.5 g",
        "Protein > 3.9 g",
        "Sodium > 61 mg"
    ],
    "n": "Holiday Lebkuchen (German Spice Cookies)",
    "a": "Shae's Mama",
    "r": "0",
    "s": 36,
    "des": "\"Since my mother's parents came from Nuremberg and Munich, Germany, lebkuchen has been a holiday tradition in my family ever since I was little. We don't like the usual candied citrus peel, however, so I use apricots and dates instead. Great served with hot tea.\"",
    "ins": "Cover almonds with boiling water in a bowl. Let stand for 1 to 2 minutes and drain. Rinse with cold water and drain again. Pat almonds dry and remove skin. Allow almonds to dry on paper towels.\nPlace half the almonds in a food processor; pulse until finely chopped. Add apricots and dates; pulse until fruit is chopped. Reserve remaining 1 cup almonds.\nCombine flour, cinnamon, ginger, baking powder, cloves, cardamom, and salt in bowl. Beat eggs, brown sugar, honey, molasses, water, almond extract, orange zest, and 1 teaspoon lemon zest in a large bowl with an electric mixer until smooth. Add apricot mixture, blending until evenly distributed. Gradually stir in flour mixture on medium speed until dough comes together. Cover dough with plastic wrap and refrigerate for 8 hours to overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nTurn dough onto a lightly floured surface and roll out to about 1/2-inch thick. Cut out cookies with a 2 1/2 to 3-inch diameter cookie cutter. Arrange cookies about 1 inch apart on ungreased baking sheets.\nLightly press 3 almonds into each cookie with tips towards the center to create a star pattern.\nBake in preheated oven until cookies begin to brown, about 12 minutes. Cool in the pans for 10 minutes before removing to cool on a wire rack.\nMeanwhile, whisk confectioners' sugar, milk, and 1 teaspoon lemon zest in a bowl until glaze is smooth. Brush warm cookies with glaze and allow cookies to cool completely.",
    "pt": "40 m",
    "ct": "15 m",
    "tt": "8 h ",
    "i": "903381.jpg",
    "o": "",
    "st": "allrecipes"
}