{
    "id": 221360,
    "old_rating": "4.575",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups water",
        "1 cup red wine",
        "1 cup cider vinegar",
        "1 lemon, sliced",
        "1/2 large onion, diced",
        "1 clove garlic, diced",
        "10 whole cloves",
        "2 bay leaves",
        "2 tablespoons white sugar",
        "2 tablespoons salt",
        "1 tablespoon juniper berries, crushed (optional)",
        "1 teaspoon whole peppercorns",
        "1 (4 pound) boneless beef chuck roast",
        "2 cups chopped onions",
        "2 cups chopped carrots",
        "1 cup diced celery",
        "8 gingersnap cookies, crushed"
    ],
    "nut": [
        "Calories > 455 kcal",
        "Carbs > 17.9 g",
        "Cholesterol > 103 mg",
        "Fat > 26.8 g",
        "Protein > 27.8 g",
        "Sodium > 1875 mg"
    ],
    "n": "Kate's Easy German Sauerbraten",
    "a": "kateshort",
    "r": "0",
    "s": 8,
    "des": "\"This is a slow-cooker version of a classic German recipe. Sauerbraten is often served with red cabbage and spaetzle noodles.\"",
    "ins": "Heat water, red wine, cider vinegar, lemon, 1/2 onion, garlic, cloves, bay leaves, white sugar, salt, juniper berries, and peppercorns in a saucepan over medium heat until sugar is dissolved, about 5 minutes. Allow marinade to cool and pour into a resealable plastic bag. Add beef roast, coat with marinade, squeeze out excess air, and seal bag. Marinate in the refrigerator 2 to 3 days, turning the roast twice a day.\nPlace onions, carrots, and celery in a slow cooker. Remove roast from marinade and place atop vegetables. Strain marinade and pour 2 1/2 cups over roast; reserve remaining marinade.\nCover and cook roast on Low for 8 hours. Turn slow cooker off. Transfer roast to a cutting board and cover with aluminum foil. Strain cooking liquid into a large bowl and return vegetables to slow cooker to rest.\nHeat about 3 cups cooking liquid and gingersnaps in a saucepan over medium-high heat, adding reserved marinade as needed, until gravy is thickened, about 10 minutes.\nSlice roast and serve with vegetables and gravy.",
    "pt": "30 m",
    "ct": "8 h ",
    "tt": "2 d ",
    "i": "1052841.jpg",
    "o": "",
    "st": "allrecipes"
}