{
    "id": 221328,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound ground beef",
        "1 pound ground pork",
        "1 small onion, finely diced",
        "1 cup shredded carrots",
        "1 (8 ounce) can water chestnuts, chopped",
        "2 tablespoons minced garlic",
        "1 egg",
        "1/2 cup oyster sauce",
        "salt and ground black pepper to taste",
        "100 lumpia wrappers (egg roll wrappers)",
        "1 egg, beaten",
        "1 quart vegetable oil for frying"
    ],
    "nut": [
        "Calories > 122 kcal",
        "Carbs > 10.4 g",
        "Cholesterol > 23 mg",
        "Fat > 6.5 g",
        "Protein > 5 g",
        "Sodium > 125 mg"
    ],
    "n": "Blue's Lumpia",
    "a": "yelley",
    "r": "0",
    "s": 50,
    "des": "\"These lumpia are the only thing my Filipina mom can cook that actually taste good and don't pose a fire hazard to her kitchen. They're made a bit differently, the meat mixture isn't cooked before rolling. They can be made ahead of time and frozen. My family requests these all the time and they're always the first thing gone. If you don't want to make your own dipping sauce, our favorite is LaChoyÂ® brand sweet and sour sauce.\"",
    "ins": "Mix beef, pork, onion, carrots, water chestnuts, garlic, 1 egg, oyster sauce, salt, and black pepper in a large bowl until well blended.\nPlace about 1 tablespoon beef-pork mixture on an egg roll wrapper with one corner facing you. Fold corner closest to you over filling; fold two side corners toward center and continue rolling wrapper tightly around meat. Brush a small amount of beaten egg over the top corner and press to seal. Repeat with remaining filling and wrappers. Store rolls in a covered container.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nFry rolls in batches until golden brown, about 7 minutes. Drain on a paper towel-lined plate. Serve immediately.",
    "pt": "1 h ",
    "ct": "30 m",
    "tt": "2 h",
    "i": "1060398.jpg",
    "o": "",
    "st": "allrecipes"
}