{
    "id": 221361,
    "old_rating": "4.71212",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds beef rump roast",
        "2 large onions, chopped",
        "1 cup red wine vinegar, or to taste",
        "1 cup water",
        "1 tablespoon salt",
        "1 tablespoon ground black pepper",
        "1 tablespoon white sugar",
        "10 whole cloves, or more to taste",
        "2 bay leaves, or more to taste",
        "2 tablespoons all-purpose flour",
        "salt and ground black pepper to taste",
        "2 tablespoons vegetable oil",
        "10 gingersnap cookies, crumbled"
    ],
    "nut": [
        "Calories > 456 kcal",
        "Carbs > 20.9 g",
        "Cholesterol > 100 mg",
        "Fat > 22.3 g",
        "Protein > 40.7 g",
        "Sodium > 1682 mg"
    ],
    "n": "Traditional Sauerbraten",
    "a": "Chris Simpler",
    "r": "0",
    "s": 6,
    "des": "\"I found two slightly different hand written versions of this, my Grandmother's recipe. Born in Nekkar am Rhein in the 1904, she naturally learned to cook traditional German meals as a young woman and didn't rely on a cookbook. I try to capture the nuance in this. Serve with potato dumplings.\"",
    "ins": "Place beef rump roast, onions, vinegar, water, 1 tablespoon salt, 1 tablespoon black pepper, sugar, cloves, and bay leaves in a large pot. Cover and refrigerate for 2 to 3 days, turning meat daily. Remove meat from marinade and pat dry with paper towels, reserving marinade.\nSeason flour to taste with salt and black pepper in a large bowl. Sprinkle flour mixture over beef.\nHeat vegetable oil in a large Dutch oven or pot over medium heat; cook beef until brown on all sides, about 10 minutes. Pour reserved marinade over beef, cover, and reduce heat to medium-low. Simmer until beef is tender, 3 1/2 to 4 hours. Remove beef to a platter and slice.\nStrain solids from remaining liquid and continue cooking over medium heat. Add gingersnap cookies and simmer until gravy is thickened about 10 minutes. Serve gravy over sliced beef.",
    "pt": "15 m",
    "ct": "4 h",
    "tt": "2 d ",
    "i": "888826.jpg",
    "o": "",
    "st": "allrecipes"
}