{
    "id": 221422,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package roll sausage, such as Jimmy DeanÂ®",
        "1/2 cup Italian bread crumbs",
        "2 tablespoons dried minced onion",
        "1/2 teaspoon paprika",
        "1/2 teaspoon garlic powder",
        "4 slices white bread, crusts removed",
        "1 tablespoon warm water, or more as needed",
        "1 sheet puff pastry, thawed",
        "1 egg yolk, beaten",
        "1 tablespoon water"
    ],
    "nut": [
        "Calories > 134 kcal",
        "Carbs > 8.6 g",
        "Cholesterol > 19 mg",
        "Fat > 9.6 g",
        "Protein > 3.3 g",
        "Sodium > 141 mg"
    ],
    "n": "Mum's Aussie Sausage Rolls",
    "a": "eaperry",
    "r": "0",
    "s": 24,
    "des": "\"My mother grew up in Australia and made these for me all the time. They are certainly the most delicious sausage rolls you will ever eat!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil.\nMix sausage, bread crumbs, onion, paprika, and garlic powder together in a bowl.\nTear bread slices into pieces and place in a bowl; add 1 tablespoon warm water to moisten. Add to sausage mixture; stir until well combined.\nUnfold puff pastry sheet; roll out to to an approximately 16x12-inch rectangle. Cut the sheet lengthwise into 3 equal sections and transfer to the prepared baking sheet. Mix beaten egg with 1 tablespoon water and glaze all edges of pastry sections.\nDivide sausage mixture into 3 equal portions. Spread 1 portion down the middle of each pastry strip. Roll pastry edges up and pinch together, forming 3 long pastry-covered sausages. Turn rolls over and glaze with egg mixture. Slice each roll into 8 equal portions.\nBake in the preheated oven until golden brown, about 20 minutes.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}