{
    "id": 221537,
    "old_rating": "4.375",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup all-purpose flour",
        "1 teaspoon Italian seasoning",
        "salt and ground black pepper to taste",
        "1 pound chicken tenders, pounded thin",
        "2 tablespoons butter, divided",
        "1 onion, sliced",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1 (10.75 ounce) can  condensed golden mushroom soup",
        "1 1/4 cups Marsala wine"
    ],
    "nut": [
        "Calories > 458 kcal",
        "Carbs > 36.3 g",
        "Cholesterol > 87 mg",
        "Fat > 11.9 g",
        "Protein > 30.9 g",
        "Sodium > 751 mg"
    ],
    "n": "Quick and Tasty Chicken Marsala",
    "a": "Holly8358",
    "r": "0",
    "s": 4,
    "des": "\"Canned Golden Mushroom soup is the trick to this quick and tasty spin on chicken Marsala. Serve over angel hair pasta and French bread.\"",
    "ins": "Stir flour, Italian seasoning, salt, and black pepper together in a shallow dish. Press chicken tenders into the flour to coat on all sides; shake to remove excess flour.\nMelt 1 teaspoon butter in a large skillet over medium heat. Cook and stir chicken tenders in the melted butter until lightly browned on all sides, 2 to 3 minutes. Remove chicken from skillet to a plate and cover to keep warm.\nMelt remaining butter in the skillet. Cook onion slices in the melted butter until translucent, about 5 minutes. Stir the mushrooms into the cooked onions; cook and stir until the mushrooms are browned, 2 to 3 minutes more. Return the chicken to the skillet.\nWhisk mushroom soup and Marsala wine together in a bowl; pour over the chicken mixture. Place a cover on the skillet, reduce heat to medium-low, and cook until the chicken is cooked through and no longer pink in the center, about 20 minutes.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "1313812.jpg",
    "o": "",
    "st": "allrecipes"
}