{
    "id": 221551,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons all-purpose flour",
        "1/2 teaspoon paprika",
        "2 skinless, boneless chicken breast halves",
        "2 tablespoons butter",
        "1/2 pound sliced chanterelle mushrooms",
        "4 tablespoons butter",
        "salt and ground black pepper, or to taste",
        "1 cup chicken broth",
        "1/2 cup dry Marsala wine",
        "1 teaspoon dried tarragon, crushed"
    ],
    "nut": [
        "Calories > 645 kcal",
        "Carbs > 25.3 g",
        "Cholesterol > 163 mg",
        "Fat > 38.6 g",
        "Protein > 30.4 g",
        "Sodium > 817 mg"
    ],
    "n": "Chicken with Chanterelle Mushrooms and Marsala Wine",
    "a": "Kelly",
    "r": "0",
    "s": 2,
    "des": "\"A fortunate mistake in forgetting to marinate the chicken in additional ingredients made me come up with this last-minute preparation. It's chanterelle season in Oregon, and I love to use this wild mushroom as often as I can in the fall.\"",
    "ins": "Stir flour and paprika together in a shallow dish. Remove and set aside 1 tablespoon of the flour mixture for later use. Dredge the chicken in the flour mixture to coat evenly.\nMelt 2 tablespoons butter in a skillet over medium heat; cook and stir chanterelle mushrooms in melted butter until they release their liquid and begin to brown, about 5 minutes. Transfer mushrooms to a bowl and set aside.\nMelt 4 tablespoons butter in the skillet. Cook the chicken breasts in the melted butter until browned, about 3 minutes per side; season with salt and pepper.\nReturn the cooked mushrooms to the skillet and stir in chicken broth, reserved 1 tablespoon of flour-paprika mixture, Marsala wine, and dried tarragon. Place a cover on the skillet, reduce heat to low, and cook until the sauce is thick, the chicken is no longer pink in the center, and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center of a chicken breast should read at least 165 degrees F (74 degrees C).",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "971587.jpg",
    "o": "",
    "st": "allrecipes"
}