{
    "id": 221887,
    "old_rating": "4.67517",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 chicken breast halves, boneless, skin-on",
        "salt and ground black pepper to taste",
        "2 tablespoons olive oil",
        "8 ounces fresh mushrooms, sliced 1/4 inch thick",
        "1 pinch salt",
        "1/2 cup water",
        "1 tablespoon butter",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 320 kcal",
        "Carbs > 3.7 g",
        "Cholesterol > 80 mg",
        "Fat > 22.4 g",
        "Protein > 27.1 g",
        "Sodium > 105 mg"
    ],
    "n": "Chef John's Chicken and Mushrooms",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"This chicken and mushrooms recipe video is an experiment in extreme self-control; I wanted to challenge myself to make a chicken and mushrooms recipe using only chicken and mushrooms.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nSeason chicken on all sides with salt and ground black pepper.\nHeat olive oil over medium-high heat in an ovenproof skillet. Place chicken skin-side down in skillet and cook until browned, about 5 minutes.\nTurn chicken over; stir mushrooms with a pinch of salt into skillet. Increase heat to high; cook, stirring mushrooms occasionally, until mushrooms shrink slightly, about 5 minutes.\nTransfer skillet to the preheated oven and cook until chicken is no longer pink in the center and the juices run clear, 15 to 20 minutes. An instant-read thermometer inserted into the center should read 165 degrees F (74 degrees C). Transfer chicken breasts to a plate and loosely tent with foil; set aside.\nSet skillet on the stovetop over medium-high heat; cook and stir mushrooms until brown bits start to form on the bottom of the pan, about 5 minutes. Pour water into the skillet, and bring to a boil while scraping the browned bits off of the bottom of the pan. Cook until water is reduced by half, about 2 minutes. Remove from heat.\nStir in any accumulated juices from the chicken into the skillet. Stir butter into mushroom mixture, stirring constantly until butter is completely melted and incorporated.\nSeason with salt and pepper. Spoon mushroom sauce over chicken and serve.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "4501602.jpg",
    "o": "4501602.jpg,4486651.jpg,4483486.jpg,4461344.jpg,4209733.jpg,4152864.jpg",
    "st": "allrecipes"
}