{
    "id": 221839,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups uncooked rice",
        "1 cup urad dal",
        "2 teaspoons fenugreek seeds",
        "6 cups water",
        "salt to taste",
        "6 tablespoons cooking oil, divided",
        "6 teaspoons butter, divided"
    ],
    "nut": [
        "Calories > 612 kcal",
        "Carbs > 94.2 g",
        "Cholesterol > 11 mg",
        "Fat > 18.8 g",
        "Protein > 14.8 g",
        "Sodium > 80 mg"
    ],
    "n": "Indian Crisp Rice Pancake (Dosa)",
    "a": "RADHIKA GHATAGE",
    "r": "0",
    "s": 6,
    "des": "\"The famous South Indian dosa is made with fermented batter of rice and urad dal. There are innumerable variations of the basic, which are very easy to learn or invent once you have the basics right. Good dosa should be spongy, red, and crisp on the outside, and white and soft on the inside. Serve with coconut chutney.\"",
    "ins": "Rinse the rice and the urad dal in a mesh strainer; place in a bowl and add fenugreek seeds. Cover with water; soak for 2 to 4 hours. Drain, reserving the soaking water.\nGrind rice and urad dal in a blender, using enough reserved soaking water to reach the consistency of cake batter. Mix in salt; cover and place in a warm spot until batter is risen and fermented, 6 to 8 hours.\nStir fermented batter gently. Heat 1 teaspoon oil on a griddle over medium heat; wipe quickly with a wet cloth to diffuse heat.\nSpread a large ladleful of batter quickly, thinly, and evenly over the griddle using the back of the ladle. Increase heat to high. Spread 2 teaspoons of oil on the surface of the dosa and cover with a lid; cook until top is spongy, 1 to 2 minutes. Remove lid; cook until bottom is crispy, about 1 minute more. Spread 1 teaspoon of butter on top of the dosa; transfer to a plate. Wipe griddle with a wet cloth and repeat with remaining batter.",
    "pt": "10 m",
    "ct": "2 m",
    "tt": "8 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}