{
    "id": 221900,
    "old_rating": "4.6875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cloves garlic, crushed",
        "1/2 cup vegetable oil",
        "1/4 cup coarsely ground fresh black pepper",
        "2 tablespoons smoked paprika",
        "2 teaspoons ground coriander",
        "1 teaspoon dry mustard",
        "1/2 teaspoon ground white pepper",
        "1/4 teaspoon cayenne pepper",
        "4 pounds corned beef brisket"
    ],
    "nut": [
        "Calories > 4709 kcal",
        "Carbs > 32.6 g",
        "Cholesterol > 980 mg",
        "Fat > 383.9 g",
        "Protein > 273.2 g",
        "Sodium > 22099 mg"
    ],
    "n": "Easy Homemade Pastrami",
    "a": "Chef John",
    "r": "0",
    "s": 1,
    "des": "\"Great pastrami is not the easiest thing to find west of the Catskills, so a few years ago I embarked on a mission to find a way to turn the common corned beef into something similar. My goal was to come up with a reasonable substitute that could be done in less than a day at home, without a smoker, or any other special equipment. Impossible? No!\"",
    "ins": "Mix garlic and vegetable oil in a small bowl. Set aside for 1 hour.\nPreheat oven to 225 degrees F (110 degrees C).\nCombine black pepper, paprika, coriander, dry mustard, white pepper, and cayenne pepper in a large bowl. Set aside.\nCover a baking sheet with a large sheet of heavy-duty aluminum foil. Coat aluminum foil with prepared garlic oil. Lay corned beef brisket on foil and brush with remaining garlic oil.\nCover all sides of corned beef brisket completely with pepper mixture, reserving 1 to 2 tablespoons.\nWith fat side of corned beef brisket up, wrap in the sheet of aluminum foil. Place wrapped corned beef on another sheet of aluminum foil with the seam and fat side down. Place double-wrapped corned beef on a third sheet of aluminum foil (seam down), and wrap again.\nBake in the preheated oven for 6 hours.\nRemove pastrami from the oven and let cool to room temperature, about 3 hours.\nWith pastrami still wrapped in aluminum foil, place in a freezer bag or other plastic bag and refrigerate for 8 to 10 hours.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nLine a baking sheet with aluminum foil.\nRemove pastrami from refrigerator, unwrap, and place on the prepared baking sheet. Sprinkle top with 1 to 2 tablespoons of remaining pepper mixture.\nPlace pastrami in the oven, 6 to 8 inches below broiler heat. Broil briefly to brown surface, about 3 to 4 minutes. Remove pastrami from the oven and slice thinly, about 1/8-inch slices.\nHeat a large skillet over low heat.\nHeat pastrami slices in the skillet with a few drops of water until fat begins to turn from white to translucent, about 5 minutes.",
    "pt": "1 h ",
    "ct": "6 h ",
    "tt": "15 h ",
    "i": "4529062.jpg",
    "o": "4529062.jpg,4051304.jpg,3535193.jpg,3124698.jpg,2189870.jpg,1967728.jpg",
    "st": "allrecipes"
}