{
    "id": 221999,
    "old_rating": "4.2963",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 pounds beef short ribs",
        "1 teaspoon garam masala",
        "salt and freshly ground pepper to taste",
        "1 pinch ground cayenne pepper, or to taste",
        "1 onion, chopped",
        "2 tablespoons tomato paste",
        "2 teaspoons vegetable oil",
        "1 teaspoon red curry paste, or to taste",
        "6 cloves garlic, peeled",
        "2 cups chicken broth",
        "1 cup coconut milk",
        "1 teaspoon fish sauce, or to taste",
        "2 bay leaves",
        "1 star anise",
        "1 head cauliflower, chopped",
        "4 green onions, chopped",
        "1 cup basil leaves, fresh, chopped"
    ],
    "nut": [
        "Calories > 1144 kcal",
        "Carbs > 17.4 g",
        "Cholesterol > 189 mg",
        "Fat > 98.3 g",
        "Protein > 48.9 g",
        "Sodium > 798 mg"
    ],
    "n": "Short Rib and Cauliflower Curry",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"This simple, braised beef short ribs recipe combines the best of our country's classic stews with the exotic spices we associate with the cuisine of Asia.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nLine a baking sheet with aluminum foil; oil lightly.\nPlace short ribs on the baking sheet and season on all sides with garam masala, salt, black pepper, and cayenne pepper.\nBake short ribs in the preheated oven until browned, about 20 minutes.\nCombine onion, tomato paste, vegetable oil, and red curry paste in a large Dutch oven over medium heat until onion begins to soften, about 3 minutes.\nStir in garlic cloves and cook until garlic is lightly browned, about 5 minutes.\nStir in chicken broth, coconut milk, fish sauce, bay leaves, and star anise. Increase heat to medium-high and bring to a simmer.\nTransfer browned short ribs into coconut milk mixture. Reduce the oven temperature to 300 degrees F (150 degrees C) and bake until ribs are tender when pierced with a fork, 3 hours.\nRemove Dutch oven from the oven, transfer short ribs to a small bowl, and set aside.\nReturn Dutch over to the stove top over high heat. Skim fat from top as it begins to boil and remove any bones that may have fallen from the meat.\nStir in cauliflower and cover Dutch oven. Cook until cauliflower is tender, about 5 minutes.\nRemove bones from short ribs and place meat in the Dutch oven. Stir in green onions and basil leaves; season with salt and pepper to taste.",
    "pt": "10 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}