{
    "id": 221918,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (7.75 ounce) can Mexican-style hot tomato sauce",
        "1/2 cup sour cream",
        "1/2 cup mayonnaise",
        "1/4 cup green salsa",
        "1 lime, juiced",
        "1 tablespoon olive oil",
        "1/2 cup diced onion",
        "2 cloves garlic, crushed, or to taste",
        "1 1/2 cups diced rotisserie chicken meat",
        "1 cup finely shredded Monterey jack cheese",
        "1 (10 ounce) bag shredded lettuce, chilled",
        "1 (4 ounce) can sliced black olives",
        "1/2 cup crushed tortilla chips"
    ],
    "nut": [
        "Calories > 270 kcal",
        "Carbs > 7.7 g",
        "Cholesterol > 37 mg",
        "Fat > 23 g",
        "Protein > 9.3 g",
        "Sodium > 469 mg"
    ],
    "n": "Layered and Tossed Spicy Chicken Taco Salad",
    "a": "Parizienne",
    "r": "0",
    "s": 8,
    "des": "\"If you like tacos, you'll love this taco salad. It's made with chicken and green salsa, but you could use ground or shredded beef and red salsa instead. It's based on a salad from a little drive-through Mexican place I used to visit when I lived in southern California. Yummmmy! This one is a big hit with kids. Our picky eaters love it. Use Monterey jack, Cheddar, or colby-jack cheese.\"",
    "ins": "Whisk tomato sauce, sour cream, mayonnaise, green salsa, and lime juice together in a bowl until combined. Refrigerate the dressing while making salad.\nHeat olive oil in a skillet over medium heat and cook onion in hot oil until translucent, about 5 minutes; stir often. Mix garlic into onion and remove from heat; stir cooked chicken in skillet and allow chicken to warm.\nTransfer chicken mixture to a large salad bowl and sprinkle with Monterey jack cheese; cheese will warm and soften. Top chicken and cheese with cold lettuce and pour dressing over salad. Sprinkle in black olives. Toss salad thoroughly with dressing and sprinkle with crushed tortilla chips to serve.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "856357.jpg",
    "o": "",
    "st": "allrecipes"
}