{
    "id": 221953,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 ounces beef tenderloin, trimmed and cut into 1/8-inch thin slices",
        "1 1/2 tablespoons lemon juice",
        "1 teaspoon Dijon mustard",
        "2 tablespoons extra virgin olive oil",
        "1 pinch cayenne pepper",
        "salt and ground black pepper to taste",
        "1 cup baby arugula leaves",
        "1 ounce Parmigiano-Reggiano cheese shavings",
        "2 teaspoons capers",
        "salt and ground black pepper to taste",
        "1 ounce Parmigiano-Reggiano cheese shavings"
    ],
    "nut": [
        "Calories > 413 kcal",
        "Carbs > 3.2 g",
        "Cholesterol > 65 mg",
        "Fat > 34.8 g",
        "Protein > 21.4 g",
        "Sodium > 999 mg"
    ],
    "n": "Heart-Shaped Carpaccio",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"This would make for a creative, and visually arresting start to a Valentine's Day dinner menu.\n Most carpaccios are pounded very, very thin, but if you're using a really nice piece of beef tenderloin, why smash it so flat? Since it's naturally tender and buttery, I like it to keep a little bit of its texture, instead of being mashed too thin.\"",
    "ins": "Lay half the beef slices in the shape of a heart in between two sheets of plastic wrap on a solid, level surface. Gently pound the beef with the smooth side of a meat mallet until about 1/8-inch thick. Transfer beef to a plate, maintaining the heart shape, and refrigerate. Repeat with the remaining slices to form a second heart.\nWhisk lemon juice, Dijon mustard, olive oil, cayenne pepper, salt, and black pepper, cayenne pepper in a bowl.\nCombine arugula, 1 ounce Parmigiano-Reggiano shavings, and capers in a bowl. Drizzle 1 tablespoon of the lemon juice mixture over arugula mixture and toss to coat.\nPlace half of the arugula mixture on top of beef. Drizzle lemon juice mixture over arugula and beef; season with salt and black pepper to taste and top with Parmigiano-Reggiano shavings. Repeat with remaining heart.",
    "pt": "15 m",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}