{
    "id": 221939,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons extra-virgin olive oil",
        "1 tablespoon butter",
        "3 cloves garlic, chopped",
        "1 small onion, chopped",
        "1 small red bell pepper, chopped",
        "1 pinch Italian seasoning, or to taste",
        "2 tablespoons all-purpose flour",
        "1/2 cup dry white wine",
        "1 cup canned chicken broth",
        "1/2 cup half-and-half",
        "2 (10 ounce) packages frozen chopped spinach, thawed and drained",
        "1 (14 ounce) can artichoke hearts in water, drained and chopped",
        "3 cups shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 158 kcal",
        "Carbs > 7.9 g",
        "Cholesterol > 25 mg",
        "Fat > 9.2 g",
        "Protein > 10 g",
        "Sodium > 423 mg"
    ],
    "n": "Spinach Artichoke Dip",
    "a": "aharoldsen",
    "r": "0",
    "s": 12,
    "des": "\"This is a family favorite. It is great to serve with crusty bread, tortilla chips, and vegetables. You can substitute vegetable stock for chicken broth, or to eliminate wine add an extra 1/2 cup of stock. Keep warm in a small slow cooker or fondue pot.\"",
    "ins": "Heat olive oil and butter together in a saucepan. Cook and stir garlic, onion, and red bell pepper in hot oil mixture until onion is lightly transparent, about 5 minutes; season with Italian seasoning and continue cooking and stirring another 2 minutes. Sprinkle flour over the onion mixture; stir to incorporate. Whisk white wine into the onion mixture; bring to a simmer and cook until the liquid has reduced by half, 7 to 10 minutes.\nPour chicken stock into the saucepan and bring to a boil. Stir half-and-half into the mixture, cook until it just begins to bubble and stir spinach, artichokes, and mozzarella cheese into the mixture; cook and stir until the cheese has fully melted, about 5 minutes.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "2538454.jpg",
    "o": "",
    "st": "allrecipes"
}