{
    "id": 221949,
    "old_rating": "4.83607",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound dried black-eyed peas",
        "1 pound pork neck bones",
        "3 slices bacon, cut into 1/2-inch pieces",
        "1 cup diced onion",
        "1 cup diced celery",
        "1 cup diced carrot",
        "3 cloves garlic, chopped",
        "6 cups cold water",
        "1 bay leaf",
        "1 teaspoon dried thyme",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ground black pepper",
        "1 pinch cayenne pepper, or to taste",
        "1 (10 ounce) can diced tomatoes with green chile peppers",
        "1 teaspoon salt",
        "6 ounces smoked ham, diced",
        "1 bunch kale, ribs removed and leaves torn into pieces"
    ],
    "nut": [
        "Calories > 463 kcal",
        "Carbs > 45.5 g",
        "Cholesterol > 65 mg",
        "Fat > 15.4 g",
        "Protein > 37.4 g",
        "Sodium > 1233 mg"
    ],
    "n": "Black-Eyed Peas with Pork and Greens",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"This recipe features black-eyed peas, and three kinds of pork. How can that not bring good fortune?\n This is my variation of Hoppin' John, which is black-eyed peas, rice, and pork stewed together, usually served with some kind of greens and cornbread.\"",
    "ins": "Place black-eyed peas into a large container and cover with several inches of cool water; let stand 8 hours to overnight. Drain and set aside.\nCook pork necks and bacon in a Dutch oven over medium heat until lightly browned, about 5 minutes.\nStir in onion, celery, and carrot; cook and stir until softened, 6 to 7 minutes. Stir in garlic and cook 1 minute.\nPour cold water and black-eyed peas into pork mixture; increase heat to high.\nStir in bay leaf, thyme, cumin, black pepper, and cayenne pepper. Bring mixture to a simmer, reduce heat to low, cover, and simmer for 45 minutes.\nStir in tomatoes and salt. Simmer uncovered until beans are tender, about 40 minutes.\nRemove neck bones from mixture; separate any meat from bones, return meat to Dutch oven, and discard bones.\nStir in diced ham and kale; cook until greens are tender, 10 to 15 minutes. Serve over rice.",
    "pt": "25 m",
    "ct": "2 h",
    "tt": "10 h ",
    "i": "4408919.jpg",
    "o": "4408919.jpg,4408912.jpg,4056312.jpg,3066536.jpg,3066287.jpg,3066283.jpg",
    "st": "allrecipes"
}