{
    "id": 222003,
    "old_rating": "4.92308",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 cup dried currants",
        "4 3/4 cups all-purpose flour",
        "1 tablespoon baking powder",
        "3/4 teaspoon baking soda",
        "1/2 cup white sugar",
        "1 1/4 teaspoons salt",
        "1 cup chilled unsalted butter, cut into 1/2-inch cubes",
        "1 tablespoon chilled unsalted butter, cut into 1/2-inch cubes",
        "1 1/2 cups buttermilk",
        "1 teaspoon lemon zest",
        "2 tablespoons melted butter",
        "1/4 cup coarse sugar crystals"
    ],
    "nut": [
        "Calories > 428 kcal",
        "Carbs > 58.7 g",
        "Cholesterol > 50 mg",
        "Fat > 19 g",
        "Protein > 6.7 g",
        "Sodium > 493 mg"
    ],
    "n": "Currant Scones",
    "a": "jennifermo",
    "r": "0",
    "s": 12,
    "des": "\"Hands-down the best scones I've ever had; moist and delicious! Eat immediately until your stomach aches, then eat some more.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nCover currants with warm water in a bowl and set aside to moisten.\nSift flour, baking powder, and baking soda in the bowl of a stand mixer. Using the paddle attachment at low speed, mix white sugar and salt into the flour mixture. Add all the unsalted butter to the mixer bowl and mix on low speed until butter cubes reduce to the size of small peas, about 30 seconds.\nDrain currants and discard soaking water; mix currants, buttermilk, and lemon zest into the flour mixture on low speed just until the dough starts to hold together.\nTurn dough out onto a lightly floured work surface and gently shape into a rectangle 18 inches long, 5 inches wide, and 1 1/2 inches thick. Brush dough with melted butter and sprinkle with sugar crystals.\nCut the dough in half crosswise with a sharp knife; cut each half into thirds, and cut each third diagonally to make 12 triangular-shaped scones. Place on the prepared baking sheet.\nBake in the preheated oven until scones are lightly golden brown, about 18 minutes. Eat warm.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "1108379.jpg",
    "o": "4530958.jpg,4522349.jpg,4483386.jpg,3629270.jpg,2759865.jpg,2570104.jpg",
    "st": "allrecipes"
}