{
    "id": 222004,
    "old_rating": "4.42105",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 tablespoon olive oil",
        "1 eggplant, diced",
        "1/2 cup onion, chopped",
        "6 cloves garlic, minced",
        "1 (14.5 ounce) can diced tomatoes",
        "1 zucchini, peeled and diced",
        "1 yellow squash, diced",
        "1/2 cup chopped fresh mushrooms",
        "1/2 cup chopped green bell pepper",
        "1 tablespoon dried Italian seasoning",
        "salt and ground black pepper to taste",
        "1 (12 ounce) package dry fettuccine pasta",
        "1 (16 ounce) jar Alfredo sauce",
        "1 cup canned pumpkin puree",
        "1 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 566 kcal",
        "Carbs > 61.7 g",
        "Cholesterol > 43 mg",
        "Fat > 29.1 g",
        "Protein > 19 g",
        "Sodium > 1063 mg"
    ],
    "n": "Ratatouille Fettuccine Alfredo",
    "a": "Robin Hamilton",
    "r": "0",
    "s": 6,
    "des": "\"Ratatouille meets Alfredo for a vegetarian feast! You can adjust the vegetables to taste, adding more or less of each vegetable to your personal taste.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a 2 1/2-quart baking dish with cooking spray.\nHeat olive oil in a large skillet over medium heat; cook and stir eggplant, onion, and garlic until softened, about 8 minutes. Stir in diced tomatoes, zucchini, yellow squash, mushrooms, green bell pepper, and Italian seasoning; season with salt and black pepper. Bring the mixture to a boil and reduce heat to low; simmer until vegetables are tender, about 20 minutes.\nFill a large pot with lightly salted water and bring to a rolling boil. Stir in fettuccine, bring back to a boil, and cook pasta over medium heat until cooked through but still firm to the bite, about 8 minutes. Drain.\nMix Alfredo sauce with pumpkin in a bowl until smooth. Spread fettuccine into the prepared baking dish in an even layer, and spoon Alfredo sauce mixture over pasta. Top pasta with cooked vegetables, and sprinkle mozzarella cheese over the top.\nBake in the preheated oven until the casserole is bubbling and the cheese has melted, about 20 minutes.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "911798.jpg",
    "o": "",
    "st": "allrecipes"
}