{
    "id": 222081,
    "old_rating": "4.23077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 pounds winter squash, peeled, seeded and cut into chunks",
        "1 pound fingerling potatoes, split lengthwise",
        "1/2 pound carrots, split lengthwise and cut into 2-inch pieces",
        "2 tablespoons extra-virgin olive oil",
        "salt and ground black pepper to taste",
        "1 (3 pound) whole chicken, giblets removed",
        "1/2 cup butter, divided",
        "1 stalk celery, leaves removed"
    ],
    "nut": [
        "Calories > 568 kcal",
        "Carbs > 25.2 g",
        "Cholesterol > 138 mg",
        "Fat > 37.2 g",
        "Protein > 33.6 g",
        "Sodium > 307 mg"
    ],
    "n": "Healthier Juicy Roasted Chicken",
    "a": "MakeItHealthy",
    "r": "0",
    "s": 6,
    "des": "\"For a healthier version of juicy roasted chicken, we use butter instead of margarine, omit powder seasoning, and include vegetables in the roasting process.\"",
    "ins": "Preheat oven to 425 degrees F (218 degrees C).\nToss squash, potatoes, carrots, olive oil, salt, and pepper in a roasting pan. Spread into a single layer and place a V-rack on top. Season chicken generously inside and out with salt and pepper. Place 1 tablespoon butter in the chicken cavity. Arrange dollops of remaining butter between skin and flesh of breast meat. Cut celery into 3 or 4 pieces and place in cavity of chicken.\nBake in preheated oven for 30 minutes. Turn heat down to 375 degrees F (190 degrees C) and continue baking until no longer pink at the bone and juices run clear, about 30 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C). Remove the chicken from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area for 10 minutes before slicing.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "848862.jpg",
    "o": "",
    "st": "allrecipes"
}