{
    "id": 222006,
    "old_rating": "4.61887",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (6 ounce) can tomato paste",
        "1/2 onion, chopped",
        "1/4 cup minced garlic",
        "1 tablespoon olive oil",
        "3/4 cup water",
        "salt and ground black pepper to taste",
        "1 small eggplant, trimmed and very thinly sliced",
        "1 zucchini, trimmed and very thinly sliced",
        "1 yellow squash, trimmed and very thinly sliced",
        "1 red bell pepper, cored and very thinly sliced",
        "1 yellow bell pepper, cored and very thinly sliced",
        "3 tablespoons olive oil, or to taste",
        "1 teaspoon fresh thyme leaves, or to taste",
        "3 tablespoons mascarpone cheese"
    ],
    "nut": [
        "Calories > 275 kcal",
        "Carbs > 25 g",
        "Cholesterol > 13 mg",
        "Fat > 19.1 g",
        "Protein > 5.7 g",
        "Sodium > 353 mg"
    ],
    "n": "Disney's Ratatouille",
    "a": "Juli Warfel Bitler",
    "r": "0",
    "s": 4,
    "des": "\"The beautiful ratatouille served up in the movie by the same name. Long and narrow vegetables work best. Serve over a bed of brown rice, couscous, pasta or other starch, or with crusty bread.\"",
    "ins": "Preheat the oven to 375 degrees F (190 degrees C).\nSpread tomato paste into the bottom of a 10x10-inch baking dish. Sprinkle with onion and garlic and stir in 1 tablespoon olive oil and water until thoroughly combined. Season with salt and black pepper.\nArrange alternating slices of eggplant, zucchini, yellow squash, red bell pepper, and yellow bell pepper, starting at the outer edge of the dish and working concentrically towards the center. Overlap the slices a little to display the colors. Drizzle the vegetables with 3 tablespoons olive oil and season with salt and black pepper. Sprinkle with thyme leaves. Cover vegetables with a piece of parchment paper cut to fit inside.\nBake in the preheated oven until vegetables are roasted and tender, about 45 minutes. Serve with dollops of mascarpone cheese.",
    "pt": "45 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4538328.jpg",
    "o": "4538328.jpg,4538079.jpg,4537142.jpg,4536737.jpg,4536655.jpg,4527381.jpg",
    "st": "allrecipes"
}