{
    "id": 222186,
    "old_rating": "4.68182",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup fresh asparagus, trimmed",
        "1/2 cup ricotta cheese",
        "1/4 cup olive oil",
        "2 cloves garlic, minced",
        "1 pinch red pepper flakes, or to taste",
        "salt and freshly ground black pepper to taste",
        "2 tablespoons heavy cream",
        "2 tablespoons chopped herbs, such as basil, parsley, rosemary, thyme (optional)",
        "1 pound pizza dough (see footnote for recipe link)",
        "1 tablespoon flour, for dusting",
        "1/2 cup diced smoked ham",
        "1/2 cup shredded sharp white Cheddar cheese",
        "1 tablespoon finely grated Parmigiano-Reggiano cheese"
    ],
    "nut": [
        "Calories > 1214 kcal",
        "Carbs > 118.5 g",
        "Cholesterol > 90 mg",
        "Fat > 61.9 g",
        "Protein > 43.7 g",
        "Sodium > 2323 mg"
    ],
    "n": "Pizza with Ham, Asparagus, and Ricotta",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"Every once in a while I get a craving for a non-tomato sauce, or 'white' pizza. 'New pizza ideas' is always a popular food wish, and I hope this ricotta spread inspires lots of pizza experimentation in your kitchen.\"",
    "ins": "Preheat an oven to 550 degrees F (285 degrees C).\nBring a large pot of lightly salted water to a boil. Add asparagus and cook uncovered until just tender, about 2 minutes. Drain in a colander, then immediately immerse in ice water for several minutes. Once asparagus is cold, drain well and set aside.\nCombine ricotta, olive oil, garlic, red pepper flakes, salt, black pepper, and heavy cream in a small bowl. Stir in fresh herbs (if using) and set aside.\nTo shape the pizza dough, sprinkle the countertop and dough surface with flour and lightly pat flat. Use a rolling pin to form a thin disk about 9 inches in diameter. Transfer to a baking sheet.\nSpread ricotta mixture over crust, top with ham and asparagus. Sprinkle with Cheddar and Parmigiano-Reggiano cheeses.\nPlace baking sheet on the bottom rack of the preheated oven and bake for 5 minutes. Transfer the baking sheet to the top rack and bake for an additional 5 minutes.",
    "pt": "20 m",
    "ct": "12 m",
    "tt": "37 m",
    "i": "4509122.jpg",
    "o": "4509122.jpg,3042217.jpg,1113751.jpg,1012792.jpg,1001617.jpg,1001614.jpg",
    "st": "allrecipes"
}