{
    "id": 222291,
    "old_rating": "4.30435",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 slices hearty country bread",
        "3 cups water",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "1/4 cup fresh spinach leaves (optional)",
        "3 cloves garlic, chopped",
        "2 (5 ounce) cans tuna, drained and flaked",
        "6 mushrooms, diced (optional)",
        "1 zucchini, diced (optional)",
        "1 stalk celery, diced (optional)",
        "2 eggs",
        "1 tablespoon chopped fresh dill, or more to taste (optional)",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon dried basil",
        "1/4 teaspoon oregano",
        "1 tablespoon olive oil, or as needed"
    ],
    "nut": [
        "Calories > 43 kcal",
        "Carbs > 3 g",
        "Cholesterol > 19 mg",
        "Fat > 1.8 g",
        "Protein > 3.8 g",
        "Sodium > 133 mg"
    ],
    "n": "Tuna Fish Patties",
    "a": "Shalvie",
    "r": "0",
    "s": 24,
    "des": "\"This is a great recipe I came up with to get rid of leftover bread. I generally use the contents of my vegetable drawer here so I kind of throw in whatever I have at the time, so you can use your own judgment. They taste really nice when eaten with sour cream or low-fat mayo or even on their own -  though my husband prefers ketchup. I generally use this recipe as a guideline, so have fun with it!\"",
    "ins": "Soak bread in water in a large shallow dish until softened completely; remove from dish and squeeze as much water from bread as possible.\nHeat 1 tablespoon olive oil in a non-stick skillet over medium heat; cook and stir onion, spinach, and garlic in the hot oil until the onion softens, about 5 minutes.\nMix the onion mixture with softened bread, tuna, mushrooms, zucchini, celery, eggs, dill, salt, pepper, basil, and oregano in a large bowl until combined. Form the mixture into about 24 thin, palm-size patties.\nHeat 1 tablespoon olive oil in a large skillet over medium heat; cook the patties in the skillet until cooked through, 2 to 3 minutes per side.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "35 m",
    "i": "2767657.jpg",
    "o": "3514022.jpg,3309144.jpg,3305093.jpg,949815.jpg,949814.jpg,949813.jpg",
    "st": "allrecipes"
}