{
    "id": 222369,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup all-purpose flour",
        "1 cup stale beer, room temperature",
        "4 eggs, room temperature",
        "2 tablespoons vegetable oil",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon salt",
        "4 bananas, sliced 1/4-inch thick",
        "1 lemon, juiced, or as needed",
        "1 (8 ounce) package cream cheese",
        "1/4 cup brown sugar",
        "1 cup whipped topping",
        "1 cup white sugar",
        "1/2 cup boiling water",
        "3 tablespoons cornstarch",
        "1/2 cup water",
        "3 tablespoons butter",
        "8 teaspoons vegetable oil, divided"
    ],
    "nut": [
        "Calories > 516 kcal",
        "Carbs > 61.3 g",
        "Cholesterol > 135 mg",
        "Fat > 27 g",
        "Protein > 7.7 g",
        "Sodium > 231 mg"
    ],
    "n": "Beer Batter Crepes with Banana Cream Cheese Filling",
    "a": "Ronn Brown",
    "r": "0",
    "s": 8,
    "des": "\"Easy Sunday brunch. Kids love the caramel flavoring. Serve with additional whipped topping and a dash of nutmeg.\"",
    "ins": "Whisk flour, beer, eggs, 2 tablespoons vegetable oil, nutmeg, and salt in a large bowl to form a smooth batter.\nToss bananas with enough lemon juice to coat in a separate bowl.\nBeat the cream cheese and brown sugar together in a separate bowl until light and fluffy; fold whipped topping into cream cheese mixture to form the cheese filling. Set aside.\nHeat white sugar in a saucepan over medium heat, stirring constantly, until melted and brown, 2 to 4 minutes. Remove sauce pan from heat and stir boiling water into melted sugar. Return to heat and stir until it forms a smooth and clear syrup.\nWhisk cornstarch and 1/2 cup water together in a small bowl; add to syrup in saucepan. Simmer over low heat, stirring constantly, until thick and clear, 5 to 7 minutes. Whisk butter into syrup to form a caramel sauce.\nHeat 1 teaspoon vegetable oil in an 8-inch crepe pan over medium heat. Pour about 1/4 cup crepe batter into heated oil. Tip and rotate the skillet until batter covers the entire area. Cook until the batter turns from wet to moist, and the edges begin to curl away from the sides of the skillet. Flip crepe and continue cooking until lightly golden on the other side. Place crepe onto a plate, and cover with a kitchen towel to keep moist. Repeat with remaining batter, lightly oiling the skillet as needed with 1 teaspoon vegetable oil each time to keep the crepes from sticking.\nAssemble crepes by spreading about 2 tablespoons caramel sauce over each crepe. Spread 1/8 the cream cheese filling onto the caramel layer; top with 1/8 the bananas. Roll the crepe around the bananas and place seam-side down on a serving platter. Repeat with remaining crepes and ingredients. Drizzle remaining caramel sauce over crepes.",
    "pt": "1 h",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "2574907.jpg",
    "o": "",
    "st": "allrecipes"
}