{
    "id": 222319,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup whole milk",
        "3/4 cup white sugar",
        "1 vanilla bean, slit lengthwise, seeds scraped",
        "1 pinch salt",
        "5 egg yolks",
        "1 (8 ounce) package white chocolate chips",
        "2 cups heavy whipping cream",
        "1 teaspoon vanilla extract",
        "1 (12 ounce) package frozen raspberries"
    ],
    "nut": [
        "Calories > 343 kcal",
        "Carbs > 29.3 g",
        "Cholesterol > 146 mg",
        "Fat > 23.8 g",
        "Protein > 4.3 g",
        "Sodium > 79 mg"
    ],
    "n": "White Chocolate and Raspberry Ice Cream",
    "a": "pelicangal",
    "r": "0",
    "s": 12,
    "des": "\"A very rich and yummy ice cream made with a custard base.\"",
    "ins": "Heat milk, sugar, vanilla bean and seeds, and salt in a saucepan over medium heat until warm, about 5 minutes.\nWhisk egg yolks and about 1 cup warm milk mixture in a bowl; stir egg mixture into saucepan. Continue to cook and stir until custard thickens enough to coat the back of a spoon, 5 to 7 minutes. Remove vanilla bean. Stir white chocolate chips into custard until melted. Pour custard into a large bowl and stir in heavy cream and vanilla extract. Cover and refrigerate until chilled.\nPour the chilled mixture into an ice cream maker and freeze according to manufacturer's directions until it reaches \"soft-serve\" consistency.\nHeat raspberries in a saucepan over medium heat until raspberries begin to fall apart, 7 to 10 minutes. Press raspberries through a sieve over a bowl to remove the seeds; discard seeds.\nGently swirl raspberries into the soft ice cream creating ribbons of raspberries. Transfer ice cream to a one- or two-quart lidded plastic container; cover surface with plastic wrap and seal. For best results, ice cream should ripen in the freezer for at least 2 hours or overnight.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "3 h ",
    "i": "1126127.jpg",
    "o": "",
    "st": "allrecipes"
}