{
    "id": 222356,
    "old_rating": "4.81818",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 ears corn on the cob, husks and silk removed",
        "2 teaspoons olive oil",
        "salt and ground black pepper to taste",
        "1 red bell pepper",
        "1 yellow bell pepper",
        "1 1/2 pints small heirloom tomatoes, halved",
        "1 small red onion, halved and thinly sliced",
        "1 bunch fresh basil, coarsely chopped",
        "6 ounces mixed salad greens",
        "2 tablespoons olive oil, or to taste",
        "balsamic vinegar, or to taste"
    ],
    "nut": [
        "Calories > 116 kcal",
        "Carbs > 16.6 g",
        "Cholesterol > 0 mg",
        "Fat > 5.4 g",
        "Protein > 3 g",
        "Sodium > 21 mg"
    ],
    "n": "Roasted Corn and Heirloom Tomato Salad",
    "a": "Dean",
    "r": "0",
    "s": 8,
    "des": "\"Colorful and refreshing salad using flavorful summer vegetables. The grilled vegetables and crisp tastes complement many grilled meats.  You can substitute cherry tomatoes for the baby heirloom tomatoes.\"",
    "ins": "Preheat grill for medium heat and lightly oil the grate.\nRub ears of corn with 2 teaspoons olive oil and sprinkle with salt and black pepper; roast the ears on the preheated grill, turning occasionally, until the kernels are lightly browned, 10 to 15 minutes. Place red and yellow bell pepper on the grill and roast until the skins are blistered and lightly charred, turning often, about 15 minutes. Remove corn and bell peppers and let cool.\nCut the kernels from the cobs and place into a large bowl. Peel skins from bell peppers, seed, and cut the peppers into 1-inch pieces; mix peppers and corn together. Lightly toss with heirloom tomatoes, red onion, and basil. Cover and refrigerate until serving time.\nJust before serving, mix in the salad greens and drizzle salad with 2 tablespoons olive oil and balsamic vinegar. Lightly toss to coat with dressing and season with salt and black pepper.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "972143.jpg",
    "o": "",
    "st": "allrecipes"
}