{
    "id": 222367,
    "old_rating": "4.11765",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 eggs",
        "1/4 teaspoon salt",
        "2 cups all-purpose flour",
        "2 cups milk",
        "1/4 cup vegetable oil",
        "1/2 teaspoon ground cinnamon",
        "4 Granny Smith apples, peeled and diced",
        "1/2 cup white sugar",
        "2 teaspoons cinnamon",
        "2 tablespoons water",
        "2 tablespoons cornstarch",
        "1 tablespoon water",
        "1 1/2 tablespoons milk",
        "8 teaspoons vegetable oil, divided"
    ],
    "nut": [
        "Calories > 361 kcal",
        "Carbs > 50.4 g",
        "Cholesterol > 75 mg",
        "Fat > 14.8 g",
        "Protein > 7.9 g",
        "Sodium > 127 mg"
    ],
    "n": "Yummy Apple Cinnamon Crepes",
    "a": "DancingCupcake11",
    "r": "0",
    "s": 8,
    "des": "\"My spin on the classic crepe. The apple filling gives them a nice flavor and my family loves them!\"",
    "ins": "Whisk eggs and salt together in a bowl. Gradually stir flour into eggs, alternately with 2 cups milk until fully incorporated. Beat 1/4 cup vegetable oil and 1/2 teaspoon cinnamon into flour mixture. Refrigerate batter for at least 1 hour.\nMix apples, sugar, 2 teaspoons cinnamon, and 2 tablespoons water in a pot.\nWhisk cornstarch and 1 tablespoon water in a small bowl; pour into apple mixture.\nSimmer apple mixture over medium heat, stirring often, until thickened, 8 to 10 minutes. Keep warm.\nWhisk 1 1/2 tablespoons milk into chilled batter.\nHeat about 1 teaspoon vegetable oil in a crepe or frying pan over medium heat. Pour about 1/3 cup batter into the heated oil; tip and rotate the crepe pan until the batter covers the entire area. Cook until the edges begin to curl away from the sides of the pan, about 30 seconds; flip the crepe and continue cooking until lightly golden on the other side, about 30 more seconds. Remove crepe from pan, add more oil, and repeat with remaining batter.\nSpoon the apple filling into each crepe; fold crepe over the filling and serve.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "2 h",
    "i": "862190.jpg",
    "o": "4374845.jpg,2169168.jpg,1958561.jpg,1563054.jpg,1399721.jpg,1098416.jpg",
    "st": "allrecipes"
}