{
    "id": 222398,
    "old_rating": "4.63636",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (28 ounce) cans plum tomato puree",
        "1/2 pound hot Italian sausage, sliced into bite-sized pieces",
        "1/2 pound mild Italian sausage, sliced into bite-sized pieces",
        "2 pounds ground chuck",
        "salt to taste",
        "ground black pepper to taste",
        "1 large onion, diced",
        "3 cloves garlic, diced",
        "1 1/2 cups water",
        "1 (12 ounce) can tomato paste",
        "1/4 cup grated Parmesan cheese",
        "1 tablespoon dried basil, or to taste",
        "1 tablespoon dried oregano, or to taste",
        "1 tablespoon dried parsley, or to taste"
    ],
    "nut": [
        "Calories > 215 kcal",
        "Carbs > 15.1 g",
        "Cholesterol > 37 mg",
        "Fat > 11.9 g",
        "Protein > 13.8 g",
        "Sodium > 828 mg"
    ],
    "n": "Mama Palomba's Spaghetti Sauce",
    "a": "Linda T",
    "r": "0",
    "s": 16,
    "des": "\"I got this recipe 30-plus years ago from a neighbor's mother who lived in Italy. It is delicious and always well received. Sub all or part of the ground beef and sausage for turkey or chicken products to lighten the recipe.\"",
    "ins": "Heat tomato puree in a large pot over medium-low heat; simmer while prepared the remaining ingredients.\nHeat a skillet over medium heat; cook and stir hot Italian sausage, mild Italian sausage, and ground chuck until browned and cooked through, 10 to 15 minutes. Season with salt and pepper. Remove cooked sausage and chuck with a slotted spoon and transfer to the simmering tomato puree.\nCook and stir onion and garlic in the same skillet used for browning meat until onions are lightly browned, 5 to 8 minutes. Transfer onion mixture to meat mixture.\nStir water and tomato paste in the same skillet used for onion mixture over low heat until slightly thickened, about 15 minutes; add to the sauce in the pot. Sprinkle Parmesan cheese, basil, oregano, and parsley over the sauce; stir to combine. Simmer over low heat, stirring occasionally, for 3 hours.",
    "pt": "30 m",
    "ct": "3 h ",
    "tt": "4 h",
    "i": "3604629.jpg",
    "o": "4517638.jpg,3997057.jpg,1074792.jpg,880996.jpg,834479.jpg,834477.jpg",
    "st": "allrecipes"
}