{
    "id": 222341,
    "old_rating": "4.67857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons olive oil, divided",
        "4 ounces Merguez sausage, casing removed",
        "1/2 cup diced red bell pepper",
        "2 ounces fresh goat cheese, crumbled",
        "5 small round summer squashes, halved",
        "salt and pepper to taste",
        "1 tablespoon dry bread crumbs, or more as needed",
        "2 teaspoons olive oil"
    ],
    "nut": [
        "Calories > 148 kcal",
        "Carbs > 6.1 g",
        "Cholesterol > 24 mg",
        "Fat > 10.6 g",
        "Protein > 8.1 g",
        "Sodium > 84 mg"
    ],
    "n": "Chef John's Stuffed Summer Squash",
    "a": "Chef John",
    "r": "0",
    "s": 5,
    "des": "\"I always smile when I hear chefs say you should never cover-up or overpower the natural flavors of the main ingredient. Sometimes you should, and this Merguez sausage and goat cheese stuffed summer squash recipe is a perfect example.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with aluminum foil and lightly coat it with 1 teaspoon olive oil.\nHeat 1 teaspoon olive oil in a nonstick pan over medium heat. Stir in sausage and red bell pepper. Cook, stirring to break up sausage into small pieces, until sausage is browned and bell pepper is soft and sweet, 7 to 8 minutes. Drain off any fat.\nStir goat cheese and sausage mixture in a bowl until well combined. Set aside.\nHollow out a 3/4-inch deep well in the center of each squash half. Place each piece on the prepared baking sheet, cut-side up. Season with salt and black pepper; fill each with 1 to 2 tablespoons cheese and sausage mixture. Top each squash with breadcrumbs and lightly drizzle with remaining 2 teaspoons olive oil.\nBake in the preheated oven until filling is golden and squash is tender, about 30 minutes.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}