{
    "id": 222396,
    "old_rating": "4.92308",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon butter",
        "4 cups cubed Italian bread",
        "1 tablespoon butter",
        "1/2 onion, diced",
        "1 pinch salt",
        "1 cup chicken stock",
        "1/4 cup heavy cream",
        "1 teaspoon fresh thyme leaves",
        "freshly ground black pepper to taste",
        "1 ounce crumbled Gorgonzola cheese",
        "1 tablespoon crumbled Gorgonzola cheese"
    ],
    "nut": [
        "Calories > 247 kcal",
        "Carbs > 21 g",
        "Cholesterol > 47 mg",
        "Fat > 15.4 g",
        "Protein > 6.1 g",
        "Sodium > 589 mg"
    ],
    "n": "Savory Gorgonzola Bread Pudding",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Maybe it's because meat is so expensive, but I find cooks get very conservative when it comes to choosing accompaniments for a steak dinner. No one ever got in trouble serving a baked potato, but sometimes you have to take a chance.\"",
    "ins": "Preheat oven to 200 degrees F (95 degrees C).\nGenerously grease 4 ramekins with 1 tablespoon butter. Set aside.\nPlace bread cubes in a single layer on a baking sheet and bake in the preheated oven until dry, about 20 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nMelt 1 tablespoon butter in a skillet over medium heat. Stir in onion and salt; cook, stirring, until onions are light golden brown, 5 to 7 minutes.\nStir chicken stock, cream, thyme, and black pepper into skillet; bring mixture to a boil and remove from heat.\nStir bread cubes and chicken stock mixture in a large bowl until well combined. Stir in 1 ounce crumbled gorgonzola cheese. Divide mixture evenly between 4 prepared ramekins. Top each with a small crumble of gorgonzola.\nBake in the preheated oven until golden brown, 15 to 20 minutes.",
    "pt": "10 m",
    "ct": "45 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}