{
    "id": 222353,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 bun-length hot dogs (such as GwaltneyÂ® Bun Sized Jumbo Franks)",
        "1 quart vegetable oil for frying",
        "2 cups all-purpose flour",
        "1 cup corn meal",
        "1 cup buttermilk",
        "2 large eggs",
        "2 tablespoons white sugar",
        "2 tablespoons bacon drippings",
        "2 teaspoons salt",
        "2 teaspoons baking powder",
        "1 pinch garlic powder",
        "8 sturdy bamboo skewers"
    ],
    "nut": [
        "Calories > 519 kcal",
        "Carbs > 43.6 g",
        "Cholesterol > 96 mg",
        "Fat > 32.6 g",
        "Protein > 13.1 g",
        "Sodium > 1440 mg"
    ],
    "n": "Corn Cob Puppies (Corn Dogs)",
    "a": "Lewis Miller",
    "r": "0",
    "s": 8,
    "des": "\"This is my own tried and true original corn dog recipe that I have tweaked and modified to my own personal taste. If you like fair dogs, you will love these! After cooking, place corn dog on a towel on a paper plate or wrap in a towel, top with mustard or ketchup, and enjoy!\"",
    "ins": "Place hot dogs into a large pot of simmering water and keep hot.\nHeat vegetable oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nWhisk flour, corn meal, buttermilk, eggs, sugar, bacon drippings, salt, baking powder, and garlic powder in a large bowl until moistened; beat batter until smooth, 2 to 3 minutes.\nRemove a hot dog from the water and blot completely dry with paper towels; skewer the hot dog lengthwise with a bamboo skewer. Using the skewer end as a handle, roll the hot dog in the batter to thoroughly coat.\nRoll the corn dog in the hot oil with the same continuous rolling motion, setting the batter; continue to roll the corn dog in the hot oil until deep golden brown, 2 to 3 minutes. Alternately, lay corn dog into hot oil after initial rolling to finish cooking the batter, about 1 minute per side. Drain corn dogs on paper towels to blot excess oil.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "882596.jpg",
    "o": "",
    "st": "allrecipes"
}