{
    "id": 222433,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter, melted",
        "1/4 cup brown sugar",
        "1/4 cup white sugar",
        "1/2 (14 ounce) can sweetened condensed milk",
        "1 cup semi-sweet chocolate chips",
        "2 tablespoons butter",
        "1/4 cup heavy whipping cream",
        "1/2 cup vanilla yogurt",
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "36 pecan halves (optional)",
        "2 tablespoons chocolate syrup, or to taste (optional)"
    ],
    "nut": [
        "Calories > 128 kcal",
        "Carbs > 15.7 g",
        "Cholesterol > 13 mg",
        "Fat > 6.8 g",
        "Protein > 1.9 g",
        "Sodium > 61 mg"
    ],
    "n": "Chocolate Mums",
    "a": "Beth",
    "r": "0",
    "s": 36,
    "des": "\"This is a recipe I developed on Mother's Day! My mum was actually out of town at the time, but I came up with the recipe with the plan to serve them to her when she got back. In the picture, I have garnished one of the cookies with a pecan half and chocolate syrup drizzled over the top. They are really good this way. But they are fantastic plain, too, especially when they are fresh out of the oven and warm! Enjoy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease two baking sheets.\nStir 1/2 cup melted butter, brown sugar, and white sugar together in a large bowl; add sweetened condensed milk and stir.\nPlace chocolate chips in a microwave-safe bowl; melt in microwave on high for 90 seconds. Stir and continue melting in microwave in 30-second increments until smooth. Stir 2 tablespoons butter into melted chocolate until melted into the chocolate. Stir heavy whipping cream into chocolate.\nPour chocolate mixture into sugar mixture; stir yogurt into the resulting mixture. Add flour and baking powder and stir to incorporate. Drop about a tablespoon of batter per cookie onto the prepared baking sheet, leaving about 1 inch between each cookie.\nBake in the preheated oven until edges are crispy, 15 to 17 minutes. Garnish each cookie with a pecan half and a drizzle of chocolate syrup.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "836950.jpg",
    "o": "",
    "st": "allrecipes"
}