{
    "id": 222491,
    "old_rating": "4.85714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 cups chopped zucchini",
        "4 cups chopped onion",
        "1 red bell pepper, chopped",
        "1 yellow bell pepper, chopped",
        "1/4 cup kosher salt",
        "4 cups white sugar",
        "2 1/2 cups cider vinegar",
        "1 tablespoon cornstarch",
        "2 teaspoons celery seed",
        "1 teaspoon ground turmeric",
        "6 half pint canning jars with lids and rings"
    ],
    "nut": [
        "Calories > 59 kcal",
        "Carbs > 14.6 g",
        "Cholesterol > 0 mg",
        "Fat > 0.1 g",
        "Protein > 0.4 g",
        "Sodium > 359 mg"
    ],
    "n": "Zucchini Relish with Sweet Peppers",
    "a": "Sarah Walker",
    "r": "0",
    "s": 64,
    "des": "\"This is better than the relish you buy in the store. I can't keep it on my shelf. I have the town asking for this relish.  And I'm not a big fan of relish but I love this. Uses lots of zucchini for this time of year. Try it. You'll love it!\"",
    "ins": "Toss zucchini, onion, red bell pepper, and yellow bell pepper with kosher salt in a large bowl. Allow vegetables to rest for 8 hours; rinse and drain vegetables thoroughly.\nHeat vegetables, sugar, cider vinegar, cornstarch, celery seed, and turmeric over medium heat until thickened, about 50 minutes.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the zucchini mixture into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 30 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all).",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "10 h ",
    "i": "1037462.jpg",
    "o": "",
    "st": "allrecipes"
}