{
    "id": 222587,
    "old_rating": "4.95",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 potatoes",
        "6 slices bacon",
        "1 (6.5 ounce) package pizza crust mix",
        "1/2 cup water",
        "1/4 cup olive oil",
        "1 tablespoon butter, melted",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon dried Italian seasoning",
        "1/2 cup sour cream",
        "1/2 cup Ranch dressing",
        "3 green onions, chopped",
        "1 1/2 cups shredded mozzarella cheese",
        "1/2 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 440 kcal",
        "Carbs > 32.5 g",
        "Cholesterol > 43 mg",
        "Fat > 28.2 g",
        "Protein > 14.4 g",
        "Sodium > 627 mg"
    ],
    "n": "Baked Potato Pizza",
    "a": "Brent BeSaw",
    "r": "0",
    "s": 8,
    "des": "\"Perfect for Super Bowl parties or any other gathering, this pizza is loaded with bacon, green onions, cheese, and sour cream. It tastes just like a baked potato!\"",
    "ins": "Preheat an oven to 450 degrees F (230 degrees C). Scrub and dry potatoes, then prick several times with a fork and place onto a baking sheet.\nBake in preheated oven until potatoes are easily pierced with a fork, 50 minutes to 1 hour. Remove, cool, and peel.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels; crumble.\nPreheat oven to 400 degrees F (205 degrees C). Lightly grease a pizza pan.\nMix pizza crust mix, water, and oil in a large bowl with a fork until ingredients combine. When dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Let stand for 5 minutes. Shape dough into a flat circle and place on pizza pan. Build up edges slightly.\nBake pizza dough in preheated oven until crust is firm and begins to brown, 5 to 6 minutes.\nToss butter with garlic powder, Italian seasoning, and potatoes in a large bowl. Combine sour cream and ranch dressing in a small bowl; spread over crust. Top with potato mixture, bacon, onions, mozzarella cheese, and Cheddar cheese.\nBake in preheated oven until cheese is melted and lightly browned, 15 to 20 minutes. Let stand 5 minutes before cutting.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "3394494.jpg",
    "o": "2971838.jpg,2052495.jpg,1783366.jpg,1597450.jpg,1278312.jpg,962675.jpg",
    "st": "allrecipes"
}