{
    "id": 222578,
    "old_rating": "4.09091",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 quarts fresh strawberries, hulled and sliced",
        "2 tablespoons white sugar",
        "1 (8 ounce) package cream cheese, softened",
        "1 pint heavy whipping cream",
        "2 tablespoons confectioners' sugar",
        "1 teaspoon vanilla extract",
        "1 (10 inch) angel food cake, cut in cubes",
        "1/2 quart fresh strawberries, hulled and sliced"
    ],
    "nut": [
        "Calories > 321 kcal",
        "Carbs > 29.1 g",
        "Cholesterol > 75 mg",
        "Fat > 21.7 g",
        "Protein > 4.6 g",
        "Sodium > 281 mg"
    ],
    "n": "Strawberry Shortcake with Cheesecake Whipped Cream",
    "a": "sophie",
    "r": "0",
    "s": 12,
    "des": "\"I cheat and use prepackaged angel food cake, but I absolutely, always, use fresh fruit and make the whipped cheesecake cream myself. I use a cream cheese whipped cream so that I stays looking nice when it has to sit around on a buffet for a few hours. Since the cream cheese gives it stability you can use WAY less sugar than traditional whipped cream calls for.\"",
    "ins": "Mix 1 1/2 quarts strawberries and white sugar in a large bowl; gently mash strawberries with a potato masher. Cover and refrigerate.\nBeat cream cheese in a bowl until light and fluffy; set aside. Beat heavy cream in another bowl until soft peaks form; add whipped cream cheese and continue to beat until stiff peaks form. Lift your beater or whisk straight up: the cream should form a sharp peak that holds its shape. Beat confectioners' sugar and vanilla extract into cream cheese mixture.\nLayer about half the angel food cake in a large bowl or trifle. Spread a third of the cream cheese mixture over the cake and top with a layer of mashed strawberries. Repeat the layers, finishing with a final layer of the cream cheese mixture. Arrange the remaining 1/2 quart strawberry slices decoratively. Chill until ready to serve.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "855834.jpg",
    "o": "",
    "st": "allrecipes"
}