{
    "id": 222679,
    "old_rating": "3.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (6 ounce) boneless pork cutlets, about 1/2-inch thick",
        "2 (6 ounce) top round beef cutlets",
        "8 ounces Genoa salami, thinly sliced",
        "6 hard-cooked eggs, sliced",
        "Italian flat leaf parsley, chopped",
        "4 cloves garlic, minced",
        "1 cup Pecorino Romano cheese (such as LocatelliÂ®), grated",
        "kitchen twine",
        "1 tablespoon extra-virgin olive oil",
        "6 cups spaghetti sauce, or as desired (see note for recipe link)"
    ],
    "nut": [
        "Calories > 235 kcal",
        "Carbs > 13.6 g",
        "Cholesterol > 116 mg",
        "Fat > 13 g",
        "Protein > 14.7 g",
        "Sodium > 725 mg"
    ],
    "n": "Bon Appetit's Braciole",
    "a": "Buon Appetito",
    "r": "0",
    "s": 16,
    "des": "\"A old family recipe for 'brazzoles.' These beef and pork rollups are made with a filling of salami, hard-boiled eggs, garlic, parsley, and cheese. Use your judgment on the amounts of parsley, garlic and grated cheese--you want to flavor them, but not overpower with one particular flavor. The amounts of ingredients always vary according to the size of the braciola meat.\"",
    "ins": "Place pork between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the pork with the smooth side of a meat mallet to a thickness of 1/8 inch (1/3 cm). Pound beef to the same thickness.\nLay the meats out on a work surface with the short side facing you and top them with layers of salami, eggs, parsley, minced garlic, and Pecorino Romano cheese.\nRoll up the meats to form short, fat rolls with a lot of stuffing; secure them with twine. Roll them tightly to prevent the stuffing from escaping. Refrigerate until your pasta sauce is simmering and you're ready to brown the meat.\nHeat olive oil in a skillet over medium-high heat. Pan-fry the rolls on each side until brown, about 5 minutes per side. (Cook the braciole in batches if they won't all fit in the skillet.)\nBring spaghetti sauce to a simmer over low heat and cook braciole in the sauce until tender, about 2 hours.",
    "pt": "40 m",
    "ct": "2 h ",
    "tt": "3 h",
    "i": "843510.jpg",
    "o": "",
    "st": "allrecipes"
}