{
    "id": 222615,
    "old_rating": "4.78788",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (8 ounce) cans refrigerated crescent rolls",
        "4 ounces thinly sliced deli ham, chopped",
        "4 ounces cream cheese, softened",
        "1/2 cup milk",
        "1 egg, separated",
        "7 eggs",
        "1/4 teaspoon salt",
        "ground black pepper to taste",
        "1/4 cup chopped red bell pepper",
        "2 tablespoons chopped green onion",
        "1 teaspoon butter",
        "1/2 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 558 kcal",
        "Carbs > 32.1 g",
        "Cholesterol > 293 mg",
        "Fat > 36.9 g",
        "Protein > 21.7 g",
        "Sodium > 1145 mg"
    ],
    "n": "Scrambled Egg Brunch Bread",
    "a": "tiberlady",
    "r": "0",
    "s": 6,
    "des": "\"Perfect for brunch, this beautiful braid is filled with eggs, ham, and cheese. Using refrigerated crescent rolls makes it a snap to prepare.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a baking sheet.\nUnroll each tube of crescent dough, but do not separate rectangles. Place side-by-side on prepared baking sheet with long sides touching; press and seal seams and perforations. Arrange ham lengthwise down center third of rectangle.\nBeat cream cheese and milk in a bowl. Separate one egg, placing egg white aside. Stir egg yolk, remaining eggs, salt, and pepper into cream cheese mixture; fold in red pepper and onion.\nMelt butter in a large skillet over medium heat; pour egg mixture into skillet and cook until just set, about 5 minutes. Remove from heat and spoon eggs over ham; sprinkle with Cheddar cheese.\nCut 1-inch-wide strips towards the center to within 1/2-inch of filling on each long side of dough. Starting at one end, fold alternating strips at an angle across filling; pinch ends to seal and tuck under. Beat reserved egg white and brush over dough.\nBake in preheated oven until golden, 25 to 28 minutes.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "4513543.jpg",
    "o": "4513543.jpg,4511208.jpg,4503760.jpg,4503690.jpg,4503200.jpg,4501344.jpg",
    "st": "allrecipes"
}