{
    "id": 222665,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 yellow onion, diced",
        "1 teaspoon minced garlic",
        "2 roma (plum) tomatoes, diced",
        "2 teaspoons za'atar",
        "1 teaspoon paprika",
        "1 teaspoon ground cumin",
        "1 teaspoon garlic powder",
        "1/2 teaspoon black pepper",
        "1/8 teaspoon cayenne pepper (optional)",
        "1 cup carrot juice",
        "4 cups water",
        "1 cube chicken bouillon",
        "1 cube tomato-flavored bouillon",
        "1 cup red lentils",
        "1/4 cup bulgur",
        "1 tablespoon lemon juice",
        "1 tablespoon minced fresh cilantro (optional)",
        "6 tablespoons sour cream (optional)"
    ],
    "nut": [
        "Calories > 227 kcal",
        "Carbs > 34 g",
        "Cholesterol > 6 mg",
        "Fat > 6 g",
        "Protein > 10.8 g",
        "Sodium > 224 mg"
    ],
    "n": "Red Lentil and Bulgur Soup",
    "a": "sggeiger",
    "r": "0",
    "s": 6,
    "des": "\"This fantastic one-pot recipe is easy and filling. Don't skip the blender step - adding the puree back to the pot with the remaining lentils and bulgur creates a to-die-for combination texture that's both al dente and creamy smooth. Great for a casual home cooked meal but good enough to serve to guests! It's even a hit with kids and people sensitive to spicy foods - just be sure to leave out the cayenne.\"",
    "ins": "Heat olive oil in a stockpot over low heat; cook and stir onion in the hot oil until softened, 3 to 5 minutes. Add garlic and cook until fragrant, about 1 minute.\nCook and stir tomatoes, za'atar, paprika, cumin, garlic powder, black pepper, and cayenne pepper into onion mixture; stir to coat. Add carrot juice, water, chicken bouillon cube, tomato-flavored bouillon cube, lentils, and bulgur; cook over low heat until lentils are tender and bulgur has absorbed liquid, 30 to 40 minutes.\nLadle about 2/3 the lentil mixture into a blender and puree until smooth. Return puree to stockpot and stir. Simmer over low heat for about 5 more minutes to blend flavors. Remove from heat; stir lemon juice and cilantro into soup. Top individual servings with a dollop of sour cream.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "2069993.jpg",
    "o": "",
    "st": "allrecipes"
}