{
    "id": 222672,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 tomatoes",
        "ice water",
        "1 tablespoon olive oil",
        "2 cloves garlic, minced",
        "1/2 cup chopped fresh cilantro",
        "1 lemon, zested and juiced",
        "3 tomatoes, diced",
        "2 green bell peppers, diced",
        "2 ripe mangoes - peeled, pitted, and diced",
        "1/2 Spanish onion, diced",
        "2 cloves garlic, minced",
        "1 tablespoon vinegar",
        "1 1/2 habanero peppers, diced"
    ],
    "nut": [
        "Calories > 86 kcal",
        "Carbs > 17 g",
        "Cholesterol > 0 mg",
        "Fat > 2.2 g",
        "Protein > 2 g",
        "Sodium > 16 mg"
    ],
    "n": "Lemon Zest Mango Salsa",
    "a": "Josue",
    "r": "0",
    "s": 8,
    "des": "\"This version of a classic Spanish salsa combines a slow-cooked tomato sauce including zest of lemon, cilantro, ripe mangos, and lemon juice. For hot salsa use 3 habanero peppers. For 'fuego' (fire) use 3 Habanero and 3 Jamaican peppers. Goes great with chips, chicken, rice, or beans.\"",
    "ins": "Bring a large pot of water to a boil; add 6 tomatoes. Boil tomatoes until skin starts to peel, 1 to 2 minutes. Remove tomatoes with a slotted spoon and place in a bowl of ice water until cool enough to handle, about 5 minutes. Peel skin, cut in half, and remove seeds. Blend seeded tomatoes in a blender until smooth.\nHeat olive oil in a skillet over high heat. Cook and stir 2 cloves garlic until fragrant, 1 to 2 minutes. Add pureed tomatoes, cilantro, and lemon zest; bring to a boil, lower heat, cover, and simmer about 1 hour.\nPlace 3 diced tomatoes, green bell pepper, mangoes, onion, and 2 cloves garlic in a large bowl. Pour tomato mixture into bowl; stir to coat. Add lemon juice, vinegar, and habanero peppers; mix well. Chill in refrigerator for at least 30 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}