{
    "id": 222734,
    "old_rating": "4.77778",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons active dry yeast",
        "1 cup warm water",
        "3 cups all-purpose flour",
        "1 tablespoon white sugar",
        "1 tablespoon dried oregano",
        "1 teaspoon salt",
        "1 egg",
        "1 tablespoon extra-virgin olive oil",
        "1 (15 ounce) can diced tomatoes",
        "1 (6 ounce) can tomato paste",
        "1/2 small onion, chopped",
        "1 tablespoon dried oregano",
        "1 clove garlic, finely chopped",
        "1 teaspoon onion powder",
        "1 teaspoon kosher salt",
        "1 pinch ground black pepper",
        "1 1/4 cups shredded mozzarella cheese",
        "1/2 cup chopped green bell pepper (optional)",
        "1/2 cup chopped onion (optional)",
        "1/2 cup sliced fresh mushrooms (optional)",
        "1/4 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 397 kcal",
        "Carbs > 63.4 g",
        "Cholesterol > 49 mg",
        "Fat > 8.7 g",
        "Protein > 17.4 g",
        "Sodium > 1291 mg"
    ],
    "n": "Homemade Veggie Pizza",
    "a": "Bird",
    "r": "0",
    "s": 6,
    "des": "\"Of course, you could just order out, but nothing beats a homemade pizza. The sauce is so easy and hearty everyone will think you were in the kitchen all day cooking this up!\"",
    "ins": "Sprinkle yeast over warm water in a small bowl. The water should be no more than 100 degrees F (40 degrees C). Let stand for 5 minutes until yeast softens and begins to form a creamy foam.\nSift flour, sugar, 1 tablespoon oregano, and 1 teaspoon salt into a large bowl. Mix egg and oil into dry ingredients; stir in yeast mixture. When dough has pulled together, turn out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, then place dough in bowl and turn to coat with oil. Cover with a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) until doubled in volume, about 1 hour.\nPreheat oven to 450 degrees F (235 degrees C). Lightly grease a baking sheet.\nCook and stir diced tomatoes, tomato paste, onion, 1 tablespoon oregano, garlic, onion powder, 1 teaspoon salt, and pepper in a saucepan over medium heat. Cook until sauce has thickened, 15 to 20 minutes.\nPunch down dough and turn it out onto a lightly floured surface. Use a knife to divide dough into two equal pieces--do not tear. Shape dough into rounds and let rest for 10 minutes. Form dough into rectangles, and place onto prepared baking sheet. Spoon tomato sauce over dough. Sprinkle with 1 1/4 cup mozzarella cheese; top with bell pepper, onion, and mushroom. Sprinkle 1/4 cup mozzarella cheese over top.\nBake in preheated oven until crust is browned and crisp and cheese has melted, 20 to 25 minutes.",
    "pt": "40 m",
    "ct": "35 m",
    "tt": "2 h ",
    "i": "1278775.jpg",
    "o": "4499184.jpg,4432131.jpg,3246778.jpg,2278824.jpg,2232015.jpg,2187421.jpg",
    "st": "allrecipes"
}