{
    "id": 222718,
    "old_rating": "4.54054",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (12 ounce) rib eye steak",
        "1 tablespoon soy sauce",
        "1 teaspoon Montreal steak seasoning, or to taste",
        "1/2 lemon, juiced",
        "2 tablespoons rice vinegar",
        "2 tablespoons olive oil",
        "2 tablespoons white sugar",
        "1/2 teaspoon sesame oil",
        "1/4 teaspoon garlic powder",
        "2 pinches red pepper flakes",
        "10 leaves romaine lettuce, torn into bite-size pieces",
        "1/2 large English cucumber, cubed",
        "1 avocado - peeled, pitted, and diced",
        "1 tomato, cut into wedges",
        "1 carrot, grated",
        "4 thin slices red onion",
        "3 tablespoons toasted sesame seeds"
    ],
    "nut": [
        "Calories > 704 kcal",
        "Carbs > 38.9 g",
        "Cholesterol > 61 mg",
        "Fat > 52.6 g",
        "Protein > 26 g",
        "Sodium > 1000 mg"
    ],
    "n": "Grilled Steak Salad with Asian Dressing",
    "a": "Joanne Zalapski Samchyk",
    "r": "0",
    "s": 2,
    "des": "\"BBQ steak salad with a sesame-rice vinegar dressing.\"",
    "ins": "Season both side of the rib eye steak with soy sauce and steak seasoning. Cover and refrigerate at least 1 hour to overnight.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nGrill steak on preheated grill until firm, reddish-pink, and juicy in the center, about 6 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Transfer steak to a platter, sprinkle with lemon juice, and cover loosely with aluminum foil. Allow meat to rest for about 10 minutes, then cut into strips.\nWhisk rice vinegar, olive oil, sugar, sesame oil, garlic powder, and red pepper flakes together in a small bowl. Combine lettuce, cucumber, avocado, tomato, carrot, red onion, and steak strips in a large bowl. Pour rice vinegar dressing over salad and toss to coat. Sprinkle with sesame seeds to serve.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "842769.jpg",
    "o": "3727184.jpg,3685926.jpg,3679458.jpg,3658914.jpg,3648242.jpg,2551429.jpg",
    "st": "allrecipes"
}