{
    "id": 222791,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup warm water",
        "2 tablespoons brown sugar",
        "1 (.25 ounce) package active dry yeast",
        "1 cup whipped cream cheese",
        "1/2 cup chopped almonds",
        "3 tablespoons milk",
        "2 tablespoons vegetable oil",
        "2 tablespoons honey",
        "1 tablespoon salt",
        "1 1/2 cups all-purpose flour",
        "1 1/2 cups whole wheat flour"
    ],
    "nut": [
        "Calories > 272 kcal",
        "Carbs > 36.2 g",
        "Cholesterol > 17 mg",
        "Fat > 12 g",
        "Protein > 7.2 g",
        "Sodium > 778 mg"
    ],
    "n": "Cream Cheese and Almond Wheat Bread",
    "a": "neonate6211",
    "r": "0",
    "s": 10,
    "des": "\"Great variation of wheat bread.\"",
    "ins": "Mix warm water, brown sugar, and yeast in a large mixing bowl; stir well. Let stand until the yeast softens and begins to form a creamy foam, about 5 minutes. Grease a separate large bowl and set aside.\nStir whipped cream cheese, almonds, milk, vegetable oil, honey, and salt into the yeast mixture. Transfer to a blender; blend until creamy and smooth.\nSlowly stir all-purpose flour and cream cheese mixture together in a large bowl; add whole-wheat flour. Stir to make a smooth dough.\nTurn dough onto a floured surface; knead until smooth and springy, about 8 minutes. Place dough in the greased bowl, turning once to grease the top of the dough. Cover bowl with a towel and let sit until double in size, about 45 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 5x9-inch bread pan.\nPunch dough down and knead again on a floured surface; form into a loaf. Place dough in the greased bread pan. Let rise in a warm place until double in size, 45 minutes.\nBake in the preheated oven until bread is done in the middle and top is browned, 50 to 60 minutes. Cover bread with aluminum foil if it gets too dark during the cooking process.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "2 h ",
    "i": "870867.jpg",
    "o": "",
    "st": "allrecipes"
}