{
    "id": 222726,
    "old_rating": "4.71233",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil, divided",
        "3 carrots, peeled and quartered lengthwise",
        "2 large tomatoes, quartered",
        "1 large onion, cut into 8 wedges",
        "1/2 small butternut squash - peeled, seeded, and cut lengthwise into 1/2-inch thick wedges",
        "1 Yukon Gold potatoes",
        "6 cloves garlic, unpeeled",
        "salt and ground black pepper to taste",
        "4 (4 ounce) links sweet Italian sausage, casings removed",
        "2 (4 ounce) links hot Italian sausage, casings removed",
        "6 1/4 cups vegetable broth, or more if needed",
        "4 cups finely chopped kale leaves",
        "3 sprigs thyme",
        "1 bay leaf",
        "1 (15 ounce) can garbanzo beans, rinsed and drained",
        "1 (15 ounce) can kidney beans, rinsed and drained"
    ],
    "nut": [
        "Calories > 564 kcal",
        "Carbs > 56.2 g",
        "Cholesterol > 50 mg",
        "Fat > 27.3 g",
        "Protein > 26.3 g",
        "Sodium > 1687 mg"
    ],
    "n": "Roasted Vegetable and Kale Soup",
    "a": "Betsy B",
    "r": "0",
    "s": 6,
    "des": "\"Roasted vegetables, pureed and cooked with broth, kale, and a nice mix of Italian sausages make up this hearty soup. This soup brings out the rich flavors of kale and leaves out its typical bitterness. This soup is a winter staple in our family.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Brush a jelly roll pan with a thin coat of olive oil.\nArrange carrots, tomatoes, onion, squash, potatoes, and garlic on the prepared pan. Drizzle remaining olive oil over the vegetables; season with salt and pepper. Turn the vegetables with a spoon to help coat evenly with the oil.\nRoast in preheated oven until browned and tender, turning occasionally, 20 to 30 minutes. Set vegetables aside.\nWhile the vegetables roast, place a large skillet over medium heat. Crumble sweet Italian sausage and hot Italian sausage into the skillet. Pour 1/4 cup vegetable broth over the sausage. Cook, breaking the sausage apart with a spoon as it cooks, until the sausage is cooked through and no longer pink, 7 to 9 minutes. Transfer sausage to a paper towel-lined plate to drain.\nCut squash and carrots into 1/2-inch pieces; set aside.\nPeel garlic cloves; place in a blender with roasted tomatoes and onion and blend until smooth. Pour the mixture into a large pot.\nPour 1/2 cup broth onto the jelly roll pan. Scrape any browned bits from the surface of the pan with a wooden spoon or spatula; pour broth and browned bits into the pot with the blended tomato mixture.\nPour remaining vegetable broth into the pot. Add kale, thyme, and bay leaf to the mixture; bring to a boil. Reduce heat to medium-low and simmer until the kale is tender, about 30 minutes. Add sausage, carrots, potatoes, squash, garbanzo beans, and kidney beans to the soup; continue cooking until hot, about 10 minutes. Thin the soup with more vegetable broth as desired. Season with salt and black pepper. Discard thyme sprigs and bay leaf to serve.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1307886.jpg",
    "o": "3202258.jpg,3154193.jpg,3150990.jpg,2962839.jpg,2106421.jpg,1940692.jpg",
    "st": "allrecipes"
}