{
    "id": 222761,
    "old_rating": "4.55556",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons milk",
        "1 egg yolk",
        "2 3/4 cups milk",
        "1 cup coconut milk",
        "1 tablespoon butter",
        "1/3 cup Arborio rice",
        "1/4 cup white sugar",
        "salt to taste",
        "1/8 teaspoon vanilla extract",
        "1/4 cup finely diced mango",
        "1 pinch Chinese five-spice powder"
    ],
    "nut": [
        "Calories > 361 kcal",
        "Carbs > 39.6 g",
        "Cholesterol > 73 mg",
        "Fat > 19.5 g",
        "Protein > 8.9 g",
        "Sodium > 199 mg"
    ],
    "n": "Coconut Milk Rice Pudding",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"The coconut milk gave the pudding a layer of subtle sweetness, and also inspired the fresh mango garnish, which really elevated these bowls of comforting goodness.\"",
    "ins": "Beat 2 tablespoons milk with egg yolk in a small bowl. Set aside.\nCombine 2 3/4 cups milk and coconut milk in a saucepan over medium heat. When mixture just begins to steam, reduce heat to low.\nMelt butter in a saucepan over medium heat. Stir in rice and cook for 1 minute. Pour in 1/2 cup coconut milk mixture; stir constantly until liquid is completely absorbed and rice is creamy. Repeat this process until the milk mixture is completely incorporated and the rice has a tender, yet slightly firm consistency, 20 to 30 minutes.\nStir sugar and salt into the rice mixture. Remove from heat. Slowly whisk in egg yolk mixture until completely incorporated and the mixture is custard color, about 1 minute. Whisk in vanilla.\nCool pudding to room temperature, cover with plastic wrap, and refrigerate until well-chilled, at least 3 hours. Garnish with mango and Chinese five-spice powder.",
    "pt": "5 m",
    "ct": "30 m",
    "tt": "3 h ",
    "i": "3322460.jpg",
    "o": "3322460.jpg,2205054.jpg,2056747.jpg,995087.jpg,869277.jpg,856314.jpg",
    "st": "allrecipes"
}