{
    "id": 222700,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups dry black garbanzo beans (kala channa)",
        "water to cover",
        "3 cups water",
        "2 tomatoes, finely chopped",
        "1 onion, finely chopped",
        "1 jalapeno pepper, finely chopped",
        "3 tablespoons vegetable oil",
        "1 teaspoon salt",
        "1/2 teaspoon ground turmeric",
        "1/2 teaspoon ground red chile pepper",
        "4 dried red chile peppers (optional)",
        "water as needed",
        "2 tablespoons chopped fresh cilantro",
        "1 tablespoon finely chopped onion"
    ],
    "nut": [
        "Calories > 388 kcal",
        "Carbs > 52 g",
        "Cholesterol > 0 mg",
        "Fat > 14.6 g",
        "Protein > 15.3 g",
        "Sodium > 989 mg"
    ],
    "n": "Kala Chola Pakistani-Style",
    "a": "Anthro",
    "r": "0",
    "s": 4,
    "des": "\"'Kala Chola' is a Pakistani dish that can be served as a meal, with rice, or just on its own. It is made with kala chana, which is in the family of garbanzo beans. You can find them in Indian/Pakistani stores or in the Indian/Pakistani section of an international store. It is really tasty and very popular in my home. According to my mom (a diabetic), kala chana are high in fiber and low in fat. It is great for people with blood sugar problems. Serve by garnishing with onion and cilantro with basmati rice. Hope you all enjoy it.\"",
    "ins": "Place garbanzo beans in a large bowl. Pour enough water over the beans to cover by several inches. Soak 8 hours to overnight. Rinse and drain the garbanzo beans thoroughly.\nCombine garbanzo beans, 3 cups water, tomatoes, 1 finely chopped onion, jalapeno pepper, vegetable oil, salt, turmeric, ground red chile pepper, and dried whole chiles in a large pot over medium-high heat; bring to a boil, reduce heat to medium-low, and cook until the garbanzo beans are tender, 3 to 4 hours, adding water as needed to keep about 1 inch of liquid at the bottom of the pot.\nGarnish with cilantro and 1 tablespoon finely chopped onion to serve.",
    "pt": "20 m",
    "ct": "3 h ",
    "tt": "11 h ",
    "i": "837373.jpg",
    "o": "",
    "st": "allrecipes"
}