{
    "id": 222867,
    "old_rating": "3.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound lean ground beef",
        "3 zucchini, peeled and cut into chunks",
        "2 large potatoes, peeled and cut into chunks",
        "2 Anaheim chile peppers, chopped",
        "1 onion, chopped",
        "2 bay leaves",
        "1 teaspoon beef bouillon granules",
        "1/2 teaspoon salt, or more to taste",
        "1/4 teaspoon ground black pepper, or more to taste",
        "water, to cover",
        "1/3 cup cold water",
        "2 tablespoons cornstarch",
        "2 dashes Worcestershire sauce (optional)"
    ],
    "nut": [
        "Calories > 281 kcal",
        "Carbs > 31 g",
        "Cholesterol > 50 mg",
        "Fat > 9.6 g",
        "Protein > 18.4 g",
        "Sodium > 335 mg"
    ],
    "n": "Zucchini Stew by Bob",
    "a": "redly",
    "r": "0",
    "s": 6,
    "des": "\"My Dad took the veggies I had brought him from a friend's garden and just invented this one morning. His original recipe used BocaÂ® crumbles. I like to make it with hamburger or ground turkey. This recipe was invented as vegetarian. You can add more Anaheims for a spicier stew.\"",
    "ins": "Heat a large pot over medium-high heat. Crumble ground beef into the skillet; cook and stir until the beef is completely browned, 5 to 7 minutes. Drain and discard any excess grease.\nStir zucchini, potatoes, Anaheim chile peppers, onion, bay leaves, beef bouillon granules, salt, and black pepper into the ground beef. Pour enough water over the mixture to cover by 2 to 3 inches. Bring the mixture to a simmer over medium-low heat; cook at a simmer until the potatoes are tender, about 30 minutes.\nWhisk 1/3 cup water and cornstarch together in a small bowl. Slowly pour the cornstarch slurry into the stew while stirring. Continue cooking until thickened, about 5 minutes. Stir Worcestershire sauce into the stew; season with salt and black pepper.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "2598477.jpg",
    "o": "",
    "st": "allrecipes"
}