{
    "id": 222847,
    "old_rating": "4.61905",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package thin whole-wheat spaghetti",
        "1 tablespoon olive oil",
        "2 tablespoons olive oil",
        "1 1/4 pounds skinless, boneless chicken thighs, cut into strips",
        "1 pinch salt and freshly ground pepper to taste",
        "1/2 cup dry white wine",
        "1/2 cup chicken stock",
        "1 1/2 cups heavy cream",
        "2 tablespoons chopped fresh mint",
        "1 1/2 tablespoons chopped fresh thyme",
        "2 teaspoons honey",
        "1 teaspoon lemon zest",
        "1 teaspoon sherry vinegar",
        "1/2 teaspoon salt"
    ],
    "nut": [
        "Calories > 1054 kcal",
        "Carbs > 92.1 g",
        "Cholesterol > 203 mg",
        "Fat > 58.8 g",
        "Protein > 41.1 g",
        "Sodium > 417 mg"
    ],
    "n": "Thyme Mint Chicken Pasta",
    "a": "Michelle English",
    "r": "0",
    "s": 4,
    "des": "\"This is a great dish to serve when you are tired of the normal Alfredo or spaghetti. Great flavors and very aromatic. You can use pork or ham instead of the chicken to change it up. You can also add fresh grape tomatoes, mushrooms, onion, or broccoli. I am sure there are many other varieties; these are just what i have used in the past.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 12 minutes; drain. Toss spaghetti with 1 tablespoon olive oil to keep from sticking together.\nMeanwhile, heat 2 tablespoons olive oil in a large skillet over medium-high heat. Season chicken generously with salt and pepper. Cook the chicken in hot oil until lightly browned and just cooked through, 3 to 5 minutes per side. Drain on a paper towel-lined plate.\nPour white wine into the skillet; bring to a boil while scraping the browned bits off of the bottom of the pan with a wooden spoon. Add chicken stock; continue cooking until the volume of liquid reduces by about half. Stir cream, mint, thyme, honey, lemon zest, sherry vinegar, and 1/2 teaspoon salt into the liquid; cook until the volume of the liquid reduces again by about half. Stir cooked pasta into the sauce to coat. Return chicken to the skillet and cook until hot, about 5 minutes. Season with salt and pepper to serve.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "1366352.jpg",
    "o": "",
    "st": "allrecipes"
}