{
    "id": 222920,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 single 9-inch pie crust",
        "1 (8 ounce) package cream cheese, softened",
        "1/3 cup creamy peanut butter",
        "1 cup confectioners' sugar",
        "1 cup whipped topping (such as Cool WhipÂ®)",
        "1 (3.4 ounce) package instant French vanilla pudding mix",
        "1 (3.9 ounce) package instant chocolate pudding mix",
        "2 1/2 cups milk",
        "1 cup whipped topping (such as Cool WhipÂ®), or more as needed",
        "3 (2 ounce) bars milk chocolate candy bar, shaved",
        "1/4 cup crushed peanuts, or as needed"
    ],
    "nut": [
        "Calories > 660 kcal",
        "Carbs > 73 g",
        "Cholesterol > 42 mg",
        "Fat > 37.7 g",
        "Protein > 11.1 g",
        "Sodium > 706 mg"
    ],
    "n": "World's Largest Peanut Butter Cup",
    "a": "SNOOKCOOK",
    "r": "0",
    "s": 8,
    "des": "\"This is the best peanut butter pie out there! You make this and your family will beg for more! It is a bit time-consuming to make, but well worth it!\"",
    "ins": "Preheat an oven to 450 degrees F (230 degrees C).\nPress pie crust dough into the bottom of a 9-inch pie pan. Prick sides and bottom of dough with a fork.\nBake in the preheated oven until lightly browned, 10 to 12 minutes. Cool completely.\nBeat cream cheese, peanut butter, and confectioners' sugar together in a bowl until smooth. Fold 1 cup whipped topping into cream cheese mixture. Spread into cooled pie crust. Chill in refrigerator until set, 1 hour.\nMix vanilla pudding mix and chocolate pudding mix with milk in a bowl until pudding starts to set up, about 2 minutes; spread over cream cheese mixture in pie crust. Spread 1 cup whipped topping over the pie. Sprinkle with shaved chocolate and peanuts. Chill in refrigerator before serving, about 1 hour.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "2 h ",
    "i": "4461458.jpg",
    "o": "",
    "st": "allrecipes"
}