{
    "id": 222991,
    "old_rating": "4.76923",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds ground beef",
        "1/4 onion, chopped",
        "1/2 (1.25 ounce) package spicy chili seasoning mix",
        "1 (15 ounce) can ranch-style beans",
        "1 (10 ounce) can diced tomatoes with green chile peppers",
        "1 (14.5 ounce) can diced tomatoes",
        "2 cups self-rising flour",
        "1 cup buttermilk",
        "2 cups vegetable oil for frying, or as needed"
    ],
    "nut": [
        "Calories > 588 kcal",
        "Carbs > 49.4 g",
        "Cholesterol > 93 mg",
        "Fat > 26.1 g",
        "Protein > 36 g",
        "Sodium > 1569 mg"
    ],
    "n": "Oklahoma Indian Tacos",
    "a": "Melanie2008",
    "r": "0",
    "s": 6,
    "des": "\"We used to get these at county fairs in Oklahoma when I was growing up! So good! A delicious chili mixture served on top of out-of-this-world fried bread and trimmed with all your favorite taco trimmings, like shredded cheese, lettuce, chopped tomatoes, black olives, and salsa.\"",
    "ins": "Preheat oven to 200 degrees F (95 degrees C).\nCook and stir ground beef in a large skillet over medium heat with onion until the meat is brown and crumbly, about 10 minutes; drain excess grease. Stir in chili seasoning mix, ranch-style beans, and diced tomatoes with green chilies. Bring the mixture to a boil, reduce heat to low, and simmer until the ground beef mixture is thick, about 10 minutes; let simmer while you finish remaining steps.\nMix self-rising flour with buttermilk in a bowl (dough will be very sticky). Scoop up about 1/4 cup of dough and gently pat into a 5-inch circle on a well-floured work surface.\nHeat vegetable oil in a heavy skillet until a deep-frying thermometer placed in the center of the oil, not touching the bottom, reads 400 degrees F (205 degrees C). Gently place a dough circles into the hot oil and fry until golden brown on both sides, turning once, about 3 minutes per side. Fry bread will expand in size as it cooks. Drain the fried bread pieces on paper towels and place on baking sheets. Transfer to the oven to keep warm while you finish frying the bread.\nTop fried bread with ground beef mixture to serve.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "3830184.jpg",
    "o": "",
    "st": "allrecipes"
}