{
    "id": 222968,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon olive oil",
        "1 green bell pepper, chopped",
        "1 yellow bell pepper, chopped",
        "1 onion, chopped",
        "4 cloves garlic, minced",
        "salt and ground black pepper to taste",
        "2 (14.5 ounce) cans no-salt-added diced tomatoes",
        "1/2 cup white wine",
        "1/2 cup chopped fresh parsley, divided",
        "1/2 teaspoon dried basil",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon red pepper flakes",
        "8 ounces whole-wheat spaghetti",
        "12 ounces cooked shrimp",
        "1/2 cup grated Pecorino-Romano cheese, or to taste (optional)"
    ],
    "nut": [
        "Calories > 423 kcal",
        "Carbs > 62 g",
        "Cholesterol > 169 mg",
        "Fat > 5 g",
        "Protein > 31.2 g",
        "Sodium > 313 mg"
    ],
    "n": "Spaghetti Diablo with Shrimp",
    "a": "Scott Koeneman",
    "r": "0",
    "s": 4,
    "des": "\"The sauce was tangy and sharp, mellow by my standards for spice, but just right for Nancy and Quinn. Topped with the shrimp, Pecorino cheese and some parsley, it was very satisfying.\"",
    "ins": "Heat oil in a Dutch oven over medium-high heat. Cook and stir green bell pepper, yellow bell pepper, onion, and garlic in hot oil until tender, 5 to 7 minutes. Season the mixture with salt and pepper.\nStir tomatoes, wine, 1/4 cup parsley, basil, oregano, and red pepper flakes into the bell pepper mixture; bring to a boil, reduce heat to low, and put a cover on the Dutch oven. Cook, stirring occasionally, until the tomatoes break down, about 2 hours.\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water until nearly cooked through, about 10 minutes; drain.\nStir drained pasta and cooked shrimp into the tomato sauce; cook until the pasta is cooked completely through yet firm to the bite, 2 to 3 minutes more. Serve with remaining parsley and Pecorino-Romano cheese.",
    "pt": "15 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "1017059.jpg",
    "o": "",
    "st": "allrecipes"
}