{
    "id": 222988,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 slices bacon",
        "1/3 cup packed brown sugar",
        "1 teaspoon vegetable oil, or as needed",
        "1 1/2 cups all-purpose flour",
        "3 tablespoons white sugar",
        "1 1/2 teaspoons baking powder",
        "10 fluid ounces dad's favorite beer, or more if needed",
        "3 tablespoons unsalted butter, melted",
        "1/2 teaspoon salt",
        "1/2 teaspoon vanilla extract (optional)"
    ],
    "nut": [
        "Calories > 331 kcal",
        "Carbs > 44.4 g",
        "Cholesterol > 29 mg",
        "Fat > 11.9 g",
        "Protein > 8 g",
        "Sodium > 604 mg"
    ],
    "n": "Father's Day Mancake Pancakes",
    "a": "AllieGeekPi",
    "r": "0",
    "s": 6,
    "des": "\"Perfect breakfast for dads on their special day. These mancakes with beer and bacon mixed in are sure to make your dad smile.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil. Place a wire rack on top of baking sheet; place bacon strips on wire rack.\nBake in the preheated oven for 10 minutes; remove from oven and sprinkle tops of bacon strips with half the brown sugar. Return to oven and bake 10 more minutes. Remove from oven and flip bacon to other side; sprinkle with remaining brown sugar and bake until bacon is crisp and brown sugar is golden brown, 10 to 15 more minutes. Remove bacon, let cool, and crumble into small pieces.\nLightly grease a skillet with vegetable oil and place over medium-high heat.\nWhisk flour, white sugar, and baking powder in a large bowl; in a separate bowl, whisk beer, melted butter, salt, and vanilla extract. Lightly stir the liquid ingredients into the flour mixture to make a smooth batter. Stir candied bacon pieces into the batter.\nPour batter into the hot skillet 1/2 cup at a time and cook until edges are browned, about 2 minutes; flip pancake and cook until golden brown and the center is set, 3 to 5 more minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "973745.jpg",
    "o": "",
    "st": "allrecipes"
}