{
    "id": 222981,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pastry for a 9-inch pie crust",
        "1 (8 ounce) package cream cheese, at room temperature  ",
        "1/2 cup white sugar",
        "1 cup fresh strawberries, hulled and halved",
        "3/4 cup white sugar",
        "3/4 cup strawberry juice",
        "1/4 cup cornstarch",
        "1/4 cup lemon juice",
        "5 cups fresh strawberries, hulled and halved"
    ],
    "nut": [
        "Calories > 393 kcal",
        "Carbs > 56.9 g",
        "Cholesterol > 31 mg",
        "Fat > 17.7 g",
        "Protein > 4.4 g",
        "Sodium > 202 mg"
    ],
    "n": "Rock Creek Lake Fresh Strawberry Pie",
    "a": "SUUNKISSED",
    "r": "0",
    "s": 8,
    "des": "\"A unique strawberry pie adapted similar to the one served at Rock Creek Lake Resort in northern California. Resort owner Sue King's pies are famous to the locals, and her pies have even been written about in Sunset Magazine! Fresh strawberries in a glaze are spooned over a baked pie crust covered in sweetened cream cheese. Can also substitute peaches for strawberries and use orange juice to make peach pie, Rock Creek-style.\"",
    "ins": "Preheat the oven to 375 degrees F (190 degrees C). Press pie crust pastry into a 9-inch pie pan; prick with a fork in 1-inch intervals.\nBake pie crust in the preheated oven until golden, 15 to 20 minutes. Cool completely on a rack.\nBeat cream cheese and 1/2 cup sugar in a bowl until smooth; spread evenly over cooled bottom of pie crust.\nBlend 1 cup strawberries, 3/4 cup sugar, strawberry juice, and cornstarch in a blender until smooth. Transfer to a 3-quart pan over medium-high heat. Cook and stir until mixture boils and thickens, about 4 minutes. Remove from heat and stir in lemon juice.\nStir remaining 5 cups strawberries into the hot strawberry glaze; mix to coat. Let cool until tepid, about 25 minutes. Pour onto cream cheese layer in pie crust. Chill until set and firm enough to slice, at least 3 hours and up to 1 day.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "3 h ",
    "i": "1129380.jpg",
    "o": "",
    "st": "allrecipes"
}