{
    "id": 223023,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds ground beef",
        "2 tablespoons kosher salt",
        "2 tablespoons dried oregano",
        "2 tablespoons dried basil",
        "1 1/2 tablespoons ground black pepper",
        "1 tablespoon dried rosemary",
        "1 tablespoon chili powder",
        "2 eggs",
        "1/2 cup finely chopped onion",
        "1/4 cup finely chopped cilantro",
        "4 cloves garlic, finely chopped",
        "1 cup Italian-seasoned bread crumbs",
        "1 (45 ounce) jar traditional-flavor pasta sauce"
    ],
    "nut": [
        "Calories > 438 kcal",
        "Carbs > 36.3 g",
        "Cholesterol > 121 mg",
        "Fat > 20.4 g",
        "Protein > 26.4 g",
        "Sodium > 2450 mg"
    ],
    "n": "Not-So-Traditional Spaghetti and Meatballs",
    "a": "Eve",
    "r": "0",
    "s": 8,
    "des": "\"Everyone will wonder what you did differently this time around. The secret is cilantro. Cilantro is wonderful in guacamole but it takes on a whole different flavor in these delicious meatballs. Trust me, I've made these for many potlucks and everyone always loves them. Even people who swear they hate cilantro. Serve the meatballs and sauce over spaghetti.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Place wire racks over 2 baking sheets lined with aluminum foil.\nCombine beef, salt, oregano, basil, black pepper, rosemary, and chili powder in a large bowl. Stir in eggs, onion, cilantro, and garlic until evenly distributed. Gradually incorporate bread crumbs until mixture is moist but not gooey.\nScoop up meat mixture using a mini ice cream scoop and shape into balls that are slightly smaller than golf balls. Arrange meatballs on prepared wire racks.\nBake in the preheated oven until golden, about 30 minutes. Flip and continue baking until browned on the other side, about 15 minutes more.\nTransfer meatballs to a large pot; pour in pasta sauce. Bring to a simmer; cook until flavors combine, at least 30 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "3513196.jpg",
    "o": "",
    "st": "allrecipes"
}