{
    "id": 223021,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound uncooked medium shrimp, peeled and deveined",
        "1 tablespoon low-sodium soy sauce",
        "1 teaspoon grated lime zest",
        "1/2 (16 ounce) package dry rice stick noodles",
        "1/4 cup lime juice",
        "3 tablespoons low-sodium soy sauce",
        "3 tablespoons honey",
        "1 tablespoon sesame oil",
        "1 teaspoon grated lime zest",
        "1/2 teaspoon anchovy paste",
        "1/4 teaspoon hot pepper sauce",
        "1 1/2 cups diced fresh peaches",
        "1 cup shredded napa cabbage",
        "2 carrots, shredded",
        "1/4 cup chopped fresh cilantro",
        "2 tablespoons chopped fresh basil",
        "2 cloves garlic, minced",
        "16 cherry tomatoes",
        "6 skewers"
    ],
    "nut": [
        "Calories > 437 kcal",
        "Carbs > 73 g",
        "Cholesterol > 173 mg",
        "Fat > 4.8 g",
        "Protein > 25.1 g",
        "Sodium > 851 mg"
    ],
    "n": "Grilled Shrimp and Rice Noodle Salad",
    "a": "Kim Nichols",
    "r": "0",
    "s": 4,
    "des": "\"A quick and refreshing dish with a Thai flair.\"",
    "ins": "Preheat grill for medium heat and lightly oil the grate.\nCombine shrimp, 1 tablespoon soy sauce, and lime zest in a bowl. Allow shrimp to marinate at room temperature while preparing remaining ingredients.\nBring a large pot of water to a boil. Add rice stick noodles to boiling water and remove from heat. Cook until noodles have cooked through, but are still firm to the bite, 3 to 5 minutes. Rinse will cold water until chilled; drain well.\nWhisk lime juice, remaining 3 tablespoons soy sauce, honey, sesame oil, remaining 1 teaspoon lime zest, anchovy paste, and hot pepper sauce in a large bowl. Add peaches, cabbage, carrots, cilantro, basil, and garlic and toss to coat. Stir rice noodles into vegetable mixture until combined; set aside.\nThread about 8 shrimp on 4 wooden skewer by piercing shrimp through the tail and the upper body. Pierce cherry tomatoes onto remaining 2 skewers.\nPlace shrimp and tomato skewers on preheated grill. Cook tomatoes until they begin to split, about 3 minutes per side; transfer to a platter. Continue to cook shrimp until they are bright pink on the outside and is no longer transparent in the center, 2 to 3 minutes more. Remove tomatoes and shrimp from skewers.\nTransfer noodle salad to a large platter. Surround salad with tomatoes and shrimp; drizzle any remaining lime dressing over shrimp.",
    "pt": "45 m",
    "ct": "10 m",
    "tt": "55 m",
    "i": "3753681.jpg",
    "o": "",
    "st": "allrecipes"
}