{
    "id": 223069,
    "old_rating": "4.53",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (9 inch) unbaked pie crust (see footnote for recipe link)",
        "3 cups rhubarb, sliced 1/4-inch thick",
        "1 cup fresh strawberries, quartered",
        "3 large eggs",
        "1 1/2 cups white sugar",
        "3 tablespoons milk",
        "3 tablespoons all-purpose flour",
        "1/4 teaspoon freshly grated nutmeg",
        "1 tablespoon butter, diced",
        "2 tablespoons strawberry jam",
        "1/4 teaspoon water"
    ],
    "nut": [
        "Calories > 342 kcal",
        "Carbs > 57.4 g",
        "Cholesterol > 74 mg",
        "Fat > 11.1 g",
        "Protein > 4.8 g",
        "Sodium > 159 mg"
    ],
    "n": "Strawberry Rhubarb Custard Pie",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"One of the most delicious and easiest pie recipes I know. I got this wonderful recipe from my mother Pauline, who I believe got it from my Aunt Angela. I love all their pies, but this might be my favorite.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Place rolled-out pie crust in a 9-inch pie plate and set on a baking sheet lined with parchment paper or a silicone baking mat.\nCombine rhubarb and strawberries in a bowl; transfer to the pie crust, distributing evenly.\nWhisk eggs, sugar, milk, flour, and nutmeg together in a medium bowl. Slowly pour filling over rhubarb mixture until it just reaches the top edge of the crust. Scatter diced butter evenly over the top of the filling. Lightly tap and shake the baking sheet to remove any air bubbles.\nTransfer pie to the preheated oven and bake, turning halfway through, until rhubarb is tender and custard is set, about 1 hour.\nMix strawberry jam and water in a small bowl; heat in the microwave until warm, about 15 seconds. Glaze the top of the pie with the jam mixture and let cool. Refrigerate until ready to serve.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "2 h ",
    "i": "4537267.jpg",
    "o": "4537267.jpg,4534984.jpg,4521838.jpg,4517374.jpg,4515436.jpg,4385928.jpg",
    "st": "allrecipes"
}