{
    "id": 223002,
    "old_rating": "4.53704",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "24 jumbo shrimp, peeled and deveined",
        "1 cup cornstarch",
        "1 tablespoon garlic powder",
        "1 1/4 teaspoons salt",
        "1 teaspoon ground black pepper",
        "1/2 cup canola oil",
        "1 cup tupelo honey",
        "1 tablespoon grated orange zest",
        "2 tablespoons fresh lemon juice",
        "1/4 teaspoon cayenne pepper, or to taste"
    ],
    "nut": [
        "Calories > 289 kcal",
        "Carbs > 51 g",
        "Cholesterol > 160 mg",
        "Fat > 2.3 g",
        "Protein > 17.6 g",
        "Sodium > 551 mg"
    ],
    "n": "Honey Orange Firecracker Shrimp",
    "a": "James & Peteeboy",
    "r": "0",
    "s": 8,
    "des": "\"Colossal-size shrimp seasoned and fried crispy with honey, orange, garlic, and red pepper. You can dress this up with either orange, lemon, or lime zest and fresh thinly-sliced basil.\"",
    "ins": "Wash shrimp well and submerge in cold water in a bowl; set shrimp aside.\nPlace cornstarch, garlic powder, salt, and black pepper in a large plastic bowl with a tight-fitting lid, close the lid, and shake several times to mix. Place half the wet shrimp into the container, cover, and shake to coat shrimp with cornstarch mixture. Remove shrimp to a platter and repeat with remaining shrimp.\nHeat canola oil in a large skillet over medium heat until the oil is hot and shimmering but not smoking. Tap excess cornstarch from the shrimp and pan-fry in batches until shrimp are opaque inside and brown and crisp outside, 2 to 3 minutes per side. Drain cooked shrimp on paper towels while you fry the remaining shrimp.\nClean skillet and pour in honey; bring to a boil over medium heat and stir in orange zest, lemon juice, and cayenne pepper. Serve hot shrimp on a serving platter drizzled with honey sauce to taste.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "2365361.jpg",
    "o": "4533197.jpg,4509560.jpg,3770495.jpg,3692546.jpg,3600975.jpg,2312843.jpg",
    "st": "allrecipes"
}