{
    "id": 223031,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds thick-cut bacon, divided",
        "1/4 cup barbeque seasoning, or to taste",
        "2 (3.5 ounce) links bulk Italian sausage",
        "1 cup finely shredded Cheddar and Monterey Jack cheese blend",
        "2 green onions, thinly sliced",
        "1/4 cup diced fresh jalapeno pepper (optional)",
        "4 cloves garlic, minced",
        "1 (18 ounce) bottle barbeque sauce, divided",
        "wood chips, soaked"
    ],
    "nut": [
        "Calories > 426 kcal",
        "Carbs > 27.1 g",
        "Cholesterol > 66 mg",
        "Fat > 25.6 g",
        "Protein > 21 g",
        "Sodium > 3264 mg"
    ],
    "n": "Smoked Bacon Bomb",
    "a": "Rubyduck75",
    "r": "0",
    "s": 8,
    "des": "\"This really is the bomb! Bacon-wrapped sausage stuffed with cheese, onions, jalapenos, and more bacon is as artery-clogging as it is delicious! Serve on freshly baked biscuits.\"",
    "ins": "Stack and weave 1 1/2 pounds bacon slices into a 12-inch square lattice. Sprinkle with 1 tablespoon barbeque seasoning.\nPlace the remaining bacon in a large skillet and cook over medium-high heat, turning occasionally, until crispy, about 10 minutes.\nPlace sausage in a 1-gallon resealable plastic bag. Seal the bag most of the way; flatten and shape the sausage into a large square. Cut away the plastic bag and discard; place the sausage square on the bacon lattice.\nChop the cooled bacon slices into rough pieces and sprinkle over the sausage square. Sprinkle Cheddar Jack cheese, green onions, jalapenos, and garlic on top. Drizzle with barbeque sauce and sprinkle the remaining barbeque seasoning on top.\nRoll the sausage square into a log. Wrap the bacon lattice over the sausage log and roll tightly.\nPlace the roll, seam side-down, onto wire racks. Place the racks into the smoker. Add wood chips according to manufacturer's directions. Smoke until no longer pink in the center, about 2 hours, spooning the juices and melted barbeque sauce over the roll during the last 20 to 30 minutes of cooking. An instant-read thermometer inserted into the center should read at least 165 degrees F (75 degrees C).\nRemove bacon bomb from the smoker; pour the remaining 1 cup barbeque sauce over the top and let rest for 30 minutes before slicing.",
    "pt": "40 m",
    "ct": "2 h ",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}