{
    "id": 223058,
    "old_rating": "4.6087",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package penne pasta",
        "1/4 pound uncooked medium shrimp, peeled and deveined (optional)",
        "1 avocado, peeled and pitted",
        "1/2 lemon, juiced",
        "1/2 cup fresh basil, or more to taste",
        "2 tablespoons grated Romano cheese",
        "2 cloves garlic",
        "salt and ground black pepper to taste",
        "1/4 cup olive oil, or as needed",
        "1/4 cup diced cherry tomatoes, or more to taste (optional)",
        "2 tablespoons grated Romano cheese, or more to taste",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 480 kcal",
        "Carbs > 50.3 g",
        "Cholesterol > 51 mg",
        "Fat > 24.5 g",
        "Protein > 16.6 g",
        "Sodium > 145 mg"
    ],
    "n": "Creamy Avocado Pesto - Delish!",
    "a": "Nicmic921",
    "r": "0",
    "s": 4,
    "des": "\"A creamy pesto without the cream! This pesto sauce is delicious and I guarantee you'll never make it a different way again! Double recipe for a full pound of pasta.\"",
    "ins": "Fill a large pot with lightly salted water and bring to a boil. Stir in penne, and return to a boil. Cook pasta uncovered, stirring occasionally, until mostly cooked through, but still firm to the bite, 8 to 10 minutes. Add shrimp to boiling water and cook until shrimp are bright pink on the outside and the meat is no longer transparent in the center, 2 to 3 minutes. Drain penne and shrimp; transfer back to empty pot.\nBlend avocado, lemon juice, basil, 2 tablespoons Romano cheese, garlic, salt, and black pepper in a food processor until smooth. Add olive oil and pulse until creamy. Remove blade from food processor and stir diced tomatoes into the creamy pesto. Transfer pesto to pot with pasta and shrimp; stir to coat. Serve with about 2 tablespoons Romano cheese, salt, and black pepper.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "25 m",
    "i": "1196976.jpg",
    "o": "4532813.jpg,4464164.jpg,4069030.jpg,4028549.jpg,3662846.jpg,3407605.jpg",
    "st": "allrecipes"
}