{
    "id": 223052,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 pound dry fava beans",
        "cold water, as needed",
        "3 tablespoons olive oil",
        "1 clove garlic, peeled",
        "1 bay leaf",
        "1 small onion, peeled",
        "3 sprigs fresh parsley",
        "1 pinch saffron threads",
        "3 tablespoons dry bread crumbs",
        "1 pound clams in shells",
        "1 pinch salt",
        "1/4 teaspoon vinegar",
        "3/4 cup water",
        "salt to taste"
    ],
    "nut": [
        "Calories > 221 kcal",
        "Carbs > 28.8 g",
        "Cholesterol > 6 mg",
        "Fat > 7.6 g",
        "Protein > 10.4 g",
        "Sodium > 64 mg"
    ],
    "n": "Asturian Beans with Clams",
    "a": "wakaru",
    "r": "0",
    "s": 6,
    "des": "\"A typical dish from Asturias, Spain. The best way to eat beans!\"",
    "ins": "Place the beans in a large container and cover with several inches of cool water; let stand for 8 hours or overnight. Drain.\nTransfer the beans o a saucepan, cover with cold water, and bring the water just to boiling over high heat.\nPour the olive oil into a large pot. Add the garlic clove, bay leaf, whole peeled onion, and parsley sprigs. (If you have kitchen twine, tie the parsley sprigs together so they'll be easier to remove.)\nWhen the water and beans are boiling, drain the beans and pour them into the pot with the olive oil and seasonings. Add fresh cold water to cover. Cover the pan and cook the beans over very low heat until just tender, about 1 1/2 hours. Remove the onion and parsley sprigs.\nCrush the saffron threads in a mortar and pestle, place into a small bowl, and add a little of the bean-cooking water to soften the threads. Pour the saffron into the beans and mix well. Sprinkle the bread crumbs over the beans, cover the pan, and cook for another 30 minutes or until the beans are very tender.\nScrub the clams in cold water with a pinch of salt and a few drops of vinegar. While the beans are simmering, transfer the clams to a skillet with 3/4 cup of water or wine (see Cook's Note). Cover the pan and bring the water to a boil, stirring occasionally, until all of the clams have opened. Discard any clams that don't open. Remove the clams from the cooking liquid with a slotted spoon and set aside. Strain the cooking liquid through a cheesecloth-lined strainer to remove any sand and add the liquid to the beans.\nWhen the beans are tender, add salt to taste and stir in the reserved clams. Ladle the beans and clams into bowls and serve.",
    "pt": "40 m",
    "ct": "2 h",
    "tt": "10 h ",
    "i": "1892936.jpg",
    "o": "",
    "st": "allrecipes"
}