{
    "id": 223019,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup millet",
        "2 cups water",
        "2 cubes vegetable bouillon",
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "2 garlic cloves, crushed",
        "1/2 pound ground beef",
        "3 tablespoons tomato paste",
        "1 teaspoon paprika",
        "1 teaspoon cumin",
        "1/4 teaspoon cayenne pepper",
        "1/4 teaspoon ground black pepper",
        "1 tablespoon chopped fresh cilantro",
        "1/4 cup chopped feta cheese",
        "4 large red bell peppers, tops removed and set aside and seeds removed"
    ],
    "nut": [
        "Calories > 374 kcal",
        "Carbs > 31.4 g",
        "Cholesterol > 49 mg",
        "Fat > 20.3 g",
        "Protein > 16.5 g",
        "Sodium > 324 mg"
    ],
    "n": "Millet and Beef Stuffed Peppers",
    "a": "jamiet",
    "r": "0",
    "s": 4,
    "des": "\"Millet is rich in B vitamins, calcium, iron, potassium, magnesium, zinc, and contain no gluten. In this recipe, rice is substituted with millet and the result tastes great!\"",
    "ins": "Preheat an oven to 450 degrees F (230 degrees C). Grease a baking dish.\nCombine millet, water, and vegetable bouillon in a saucepan; bring to a boil. Reduce heat to low, cover, and simmer until water is absorbed, about 15 minutes.\nHeat olive oil in a skillet over medium heat; cook and stir onion and garlic until onion is tender, 8 to 10 minutes. Add ground beef and cook until beef is crumbly and browned, 8 to 10 minutes. Stir in tomato paste, paprika, cumin, cayenne pepper, and black pepper; stir and simmer to combine flavors, about 5 minutes.\nMix cooked millet, cilantro, and feta cheese into ground beef mixture. Spoon mixture into red bell peppers; place in prepared baking dish.\nBake in the preheated oven until peppers are slightly tender, 15 to 20 minutes. Place the tops back on the peppers; bake until peppers are tender, 10 to 15 more minutes.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1915644.jpg",
    "o": "",
    "st": "allrecipes"
}