{
    "id": 223101,
    "old_rating": "4.61225",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package spaghetti",
        "2 tablespoons soy sauce",
        "2 tablespoons oyster sauce",
        "2 tablespoons brown sugar",
        "2 teaspoons fish sauce",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon ground ginger",
        "2 teaspoons vegetable oil",
        "1 pound uncooked medium shrimp, peeled and deveined",
        "1 cup chopped broccoli",
        "1/4 yellow onion, thinly sliced",
        "3 crimini mushrooms, sliced",
        "2 cloves garlic, minced",
        "2 large eggs"
    ],
    "nut": [
        "Calories > 834 kcal",
        "Carbs > 109.5 g",
        "Cholesterol > 531 mg",
        "Fat > 14.3 g",
        "Protein > 63.9 g",
        "Sodium > 2240 mg"
    ],
    "n": "Easy Shrimp Lo Mein",
    "a": "Dreamshards8",
    "r": "0",
    "s": 2,
    "des": "\"Making a delicious Chinese dish is super easy. For better searing results, use a seasoned wok.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water until cooked through yet firm to the bite, about 12 minutes; drain.\nMix soy sauce, oyster sauce, brown sugar, fish sauce, garlic powder, and ground ginger in a bowl until the sugar dissolves.\nHeat oil in a large skillet or wok over medium heat; cook and stir shrimp in hot oil until they start to change color, 1 to 2 minutes. Add broccoli, onion, and mushrooms; cook until just beginning to soften, 3 to 5 minutes. Stir garlic through the vegetable mixture. Push the vegetables to one side of the pan. Cook the eggs in the clear space in the pan, scrambling lightly, until no longer moist, 3 to 5 minutes. Stir the cooked egg with shrimp and vegetables. Add the cooked noodles and the sauce; cook and stir until hot and evenly mixed, about 2 minutes more. Serve immediately.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "35 m",
    "i": "1093741.jpg",
    "o": "4472377.jpg,3544897.jpg,3465480.jpg,3150582.jpg,2941401.jpg,2741298.jpg",
    "st": "allrecipes"
}