{
    "id": 223100,
    "old_rating": "4.30769",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (8 ounce) package angel hair pasta",
        "1 teaspoon sesame oil",
        "3/4 cup water",
        "1/4 cup soy sauce",
        "2 tablespoons cornstarch",
        "1 tablespoon oyster sauce",
        "1/2 teaspoon ground ginger",
        "1 tablespoon vegetable oil",
        "1 pound medium shrimp - peeled, deveined, and cut into 1/2-inch pieces",
        "1 tablespoon vegetable oil",
        "3/4 cup sliced green bell pepper",
        "3/4 cup chopped celery",
        "3/4 cup broccoli florets",
        "3/4 cup snap peas",
        "1/2 cup onion slices",
        "1/2 cup shredded cabbage",
        "1 clove garlic, minced"
    ],
    "nut": [
        "Calories > 378 kcal",
        "Carbs > 43.3 g",
        "Cholesterol > 173 mg",
        "Fat > 10.7 g",
        "Protein > 27.3 g",
        "Sodium > 1272 mg"
    ],
    "n": "Quick Shrimp Lo Mein",
    "a": "alice",
    "r": "0",
    "s": 4,
    "des": "\"This shrimp lo mein is easy to prepare and tastes wonderful! Can double the sauce if you like more. Can add additional water or broth to sauce if you like it less thick. Use whatever combination of vegetables you like for about 4 cups total. You can also serve the vegetables and shrimp over the noodles, as opposed to tossing them together.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook angel hair in the boiling water until cooked through yet firm to the bite, 4 to 5 minutes; drain. Toss with sesame oil in a bowl to coat.\nMix water, soy sauce, cornstarch, oyster sauce, and ground ginger into a sauce a small bowl.\nHeat 1 tablespoon vegetable oil in a large skillet or wok over medium-high heat. Cook and stir shrimp in hot oil until pink, 2 to 3 minutes. Remove shrimp from skillet to a bowl and return pan to heat.\nHeat remaining 1 tablespoon vegetable oil in the pan. Cook and stir bell pepper, celery, broccoli, snap peas, onion, cabbage, and garlic in oil until slightly tender, about 5 minutes. Pour prepared sauce over vegetable mixture; stirring continually, bring to a simmer and cook until slightly thickened, 30 to 45 seconds. Return shrimp to the pan; cook 1 minute more. Add drained pasta; toss to coat.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "889986.jpg",
    "o": "4530748.jpg,4511484.jpg,4110444.jpg,2824094.jpg,2681641.jpg,2681617.jpg",
    "st": "allrecipes"
}