{
    "id": 223170,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup finely diced white onion",
        "1/8 cup finely diced bell pepper ",
        "3/8 cup cut in half and thinly sliced white mushrooms",
        "2 teaspoons steak sauce",
        "1 pound lean ground beef",
        "4 whole wheat buns",
        "2 teaspoons steak sauce",
        "8 leaves lettuce",
        "4 slices large beefsteak tomato",
        "1 ripe Fresh California Avocado, peeled, seeded, and sliced",
        "1 batch Steakhouse Lite Ranch Sauce (optional, recipe below):",
        "4 tablespoons light ranch dressing",
        "2 tablespoons steak sauce"
    ],
    "nut": [],
    "n": "California Avocado Steakhouse Burger",
    "a": "Avocado Commission",
    "r": "0",
    "s": 4,
    "des": "\"This beef and veggie burger adds extra produce to your burger patty making it more flavorful and juicy. Then it is topped with Fresh California Avocado, lettuce and tomato. It is great served with the Steakhouse Lite Ranch Sauce and fresh veggies like carrots and celery for dipping, making this a produce packed meal. Good source of Vitamin C, Calcium and Iron.\"",
    "ins": "In a bowl mix together the onion, bell pepper, mushrooms, steak sauce and lean ground beef. Mix very thoroughly with your hands to combine all ingredients.\nDivide the mixture into equal portions. With your hands press each portion into a ball and then shape into a patty.\nIn a saute pan or on a flat griddle over medium low heat place the patties and grill for about 4 minutes, flip and grill an additional 4 minutes or until meat is thoroughly cooked.\nWhile beef and veggie burgers are grilling toast the buns.\nTop each bun base with the beef and veggie burger, then drizzle each with 1/2 tsp. steak sauce. Top with the lettuce, tomato, Fresh California Avocado and bun top.\nOptional: serve with Steakhouse Lite Ranch Sauce for dipping.",
    "pt": "10 m",
    "ct": "8 m",
    "tt": "18 m",
    "i": "983347.jpg",
    "o": "",
    "st": "allrecipes"
}