{
    "id": 223196,
    "old_rating": "4.75771",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1 (9 inch) unbaked pie crust (see footnote for recipe link)",
        "8 slices bacon, cut into 1 inch pieces",
        "1/2 cup chopped leeks (white and pale green parts only)",
        "1/2 cup chopped onion",
        "salt and freshly ground black pepper to taste",
        "1 pinch cayenne pepper, or more to taste",
        "3 eggs",
        "2 egg yolks",
        "1 cup heavy cream",
        "3/4 cup milk",
        "1 teaspoon chopped fresh thyme",
        "6 ounces shredded Gruyere cheese"
    ],
    "nut": [
        "Calories > 491 kcal",
        "Carbs > 14.5 g",
        "Cholesterol > 206 mg",
        "Fat > 41.4 g",
        "Protein > 15.6 g",
        "Sodium > 472 mg"
    ],
    "n": "Chef John's Quiche Lorraine",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"In my opinion, a proper quiche should be rich, custardy, and luxurious--not some kind of dense, baked omelet. This has only enough eggs and yolks to hold things together, but that means you need to let it cool to just warm before serving, to fully enjoy the experience.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nRoll pie dough to fit a 9 inch pie plate. Place bottom crust in pie plate and chill for at least 20 minutes before baking. Line the chilled pie crust with foil and fill halfway up with dried beans, rice, or baking weights. Bake in the preheated oven for 7 minutes. Remove foil and weights and bake until golden brown, about 5 minutes.\nReduce oven to 325 degrees F (165 degrees C).\nCook bacon in a skillet over medium heat until browned and cooked through, 8 to 10 minutes. Remove from pan to drain. Blot out some of the oil from the skillet, leaving 1 to 2 teaspoons. Add leeks, onion, salt, black pepper, and cayenne pepper. Cook and stir until tender and browned, 5 to 7 minutes. Set aside.\nWhisk eggs, egg yolks, cream, and milk together in a large bowl. Add thyme and stir to combine.\nSprinkle 1/3 onion-leek mixture on the bottom of the baked crust. Top with 1/3 cooked bacon and 1/3 Gruyere cheese. Ladle in half the egg mixture. Sprinkle with 1/3 the onion-leek mixture, 1/3 bacon, and 1/3 cheese. Pour in remaining egg mixture and top with remaining onion-leek mixture, bacon, and cheese.\nBake filled quiche in the preheated oven until browned and set, but no longer jiggly in the center, 40 to 45 minutes. Allow to cool slightly before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4533838.jpg",
    "o": "4533838.jpg,4533229.jpg,4484225.jpg,4482633.jpg,4412573.jpg,4394961.jpg",
    "st": "allrecipes"
}