{
    "id": 223138,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 bamboo skewers",
        "1 cucumber - peeled, seeded, and shredded",
        "1 (12 ounce) container Greek-style yogurt",
        "2 cloves garlic, minced",
        "2 sprigs fresh dill, chopped",
        "salt and freshly ground black pepper to taste",
        "2 skinless, boneless chicken breasts, cut into 1/2-inch strips",
        "2 sprigs fresh oregano, chopped",
        "2 cloves garlic, minced",
        "1 lemon, juiced",
        "2 tablespoons extra-virgin olive oil",
        "salt and freshly ground black pepper to taste",
        "3 Roma tomatoes, diced",
        "1 cucumber - peeled, seeded, and diced",
        "1/2 red onion, cut into thin 1-inch-long strips",
        "2 tablespoons extra-virgin olive oil",
        "1/2 lemon, juiced",
        "8 pita bread rounds",
        "4 ounces feta cheese, cut into 1/4-inch slices"
    ],
    "nut": [
        "Calories > 688 kcal",
        "Carbs > 70.1 g",
        "Cholesterol > 77 mg",
        "Fat > 31 g",
        "Protein > 31.9 g",
        "Sodium > 944 mg"
    ],
    "n": "High Seas Chicken Souvlaki",
    "a": "elchivo",
    "r": "0",
    "s": 4,
    "des": "\"This traditional Greek dish is even easy to make in a small galley-style kitchen. Grill marinated chicken and pile it into warm pita bread with yogurt sauce, vegetables, and feta cheese.\"",
    "ins": "Soak the bamboo skewers in water for 30 to 40 minutes.\nPlace shredded cucumber in a fine mesh sieve and press out excess liquid; allow to drain for 15 minutes.\nCombine yogurt, 2 cloves minced garlic, shredded cucumber, dill, salt, and pepper in a small bowl. Set aside in the refrigerator to chill.\nPlace chicken in a bowl and add the oregano, 2 cloves minced garlic, lemon juice, 2 tablespoons olive oil, salt, and pepper in a large bowl; stir thoroughly and set aside in the refrigerator to chill for 20 minutes.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nCombine tomatoes, diced cucumber, onion, 2 tablespoons olive oil, salt, and pepper in a bowl. Toss to combine.\nSkewer the marinated chicken.\nGrill the chicken skewers, squeezing with juice from 1/2 a lemon while cooking, until browned and no longer pink inside, about 5 minutes on each side.\nHeat the pita bread on the grill until warmed through, 1 to 2 minutes on each side. Top each heated pita bread round with chicken from 1 skewer, 1 to 2 spoonfuls of yogurt sauce, and tomato salad. Top with feta cheese slices.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}