{
    "id": 223171,
    "old_rating": "4.74775",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 pound ground turkey",
        "2 (10.75 ounce) cans tomato soup",
        "1 1/4 cups water",
        "1 tablespoon minced garlic",
        "1 (15 ounce) can chickpeas (garbanzo beans), drained and rinsed",
        "1 (15 ounce) can red kidney beans, drained and rinsed",
        "1/2 cup chopped carrot",
        "1/4 cup mango chutney",
        "3 tablespoons curry powder",
        "1 teaspoon onion powder",
        "salt and ground black pepper to taste",
        "1/2 cup coconut milk, divided"
    ],
    "nut": [
        "Calories > 312 kcal",
        "Carbs > 43.4 g",
        "Cholesterol > 28 mg",
        "Fat > 9.7 g",
        "Protein > 16.4 g",
        "Sodium > 890 mg"
    ],
    "n": "Coconut Curry Chili",
    "a": "usmcwifey",
    "r": "0",
    "s": 6,
    "des": "\"The coconut, curry, and mango chutney really put the flavor in this one. I put this together one night with what I had, and loved the results. It tastes better the next day, just like most chili. This freezes well. Seriously, you have to try it.  Serve by itself, with rice, and/or with naan bread.\"",
    "ins": "Break the ground turkey into small pieces into a large skillet over medium heat. Cook and stir the turkey, continuing to break it into smaller pieces, until completely browned, 5 to 7 minutes. Drain as much grease as possible from the turkey.\nCombine tomato soup, water, and minced garlic in a large pot; bring to a boil. Add the turkey to the pot and return the mixture to a boil and reduce heat to medium-low. Stir chickpeas, red kidney beans, carrot, chutney, curry powder, onion powder, salt, and black pepper through the turkey mixture; bring to a simmer, place a cover on the pot, and cook until the chickpeas are tender, about 15 minutes.\nStir 1/4 cup coconut milk through the chili, return cover to the pot, and simmer another 15 minutes. Pour the remaining 1/4 cup coconut milk into the chili, stir, and simmer 30 minutes more.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1066431.jpg",
    "o": "4523457.jpg,3341911.jpg,2471356.jpg,1758211.jpg,1102892.jpg,997831.jpg",
    "st": "allrecipes"
}