{
    "id": 223242,
    "old_rating": "4.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups sorghum flour",
        "1 cup tapioca starch",
        "1/4 cup white sugar",
        "4 teaspoons baking powder",
        "2 teaspoons xanthan gum",
        "1/2 teaspoon salt",
        "2 chicken eggs, separated",
        "2 duck eggs, separated",
        "3 1/2 cups unsweetened vanilla-flavored almond milk",
        "1/2 cup unsweetened applesauce",
        "2 teaspoons vanilla extract",
        "cooking spray"
    ],
    "nut": [
        "Calories > 298 kcal",
        "Carbs > 56 g",
        "Cholesterol > 161 mg",
        "Fat > 3.9 g",
        "Protein > 8.3 g",
        "Sodium > 426 mg"
    ],
    "n": "Gluten Free Waffles!!",
    "a": "Gen",
    "r": "0",
    "s": 10,
    "des": "\"Being new to a gluten-free diet can be frustrating, but it doesn't mean you have to avoid the foods you enjoy. Made with sweet sorghum flour and tapioca starch, these waffles will be nice and crispy on the outside, while light and fluffy on the inside! Separating the eggs is optional, but worth the extra work! Instead of regular syrup, top with apple butter, greek yogurt, or berries. My husband and son love peanut butter on their waffles. You can add 1-2 teaspoon of cinnamon for extra flavor.\"",
    "ins": "Preheat a waffle iron according to manufacturer's instructions. Spray iron with cooking spray.\nMix sorghum flour, tapioca starch, sugar, baking powder, xanthan gum, and salt in a large bowl.\nBeat chicken and duck egg whites until foamy in a large glass or metal mixing bowl until soft peaks form. Lift your beater or whisk straight up: the egg whites will form soft mounds rather than a sharp peak.\nBeat egg yolks, almond milk, applesauce, and vanilla extract together in a large bowl. Continue beating while gradually adding the flour mixture; blend until smooth. Fold the egg whites into the batter.\nPour 2/3 cup batter onto preheated waffle iron. Cook until golden brown.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "2056470.jpg",
    "o": "",
    "st": "allrecipes"
}