{
    "id": 223214,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup brown rice",
        "1 cup water",
        "1 tablespoon olive oil",
        "4 green onions, chopped",
        "4 cloves garlic, minced",
        "1 (12 ounce) jar marinated artichoke hearts, drained and chopped",
        "1 large tomato, diced",
        "1 teaspoon dried basil",
        "1 teaspoon red pepper flakes",
        "1 teaspoon ground black pepper",
        "4 large red bell peppers, tops and seeds removed",
        "8 teaspoons crumbled feta cheese, divided"
    ],
    "nut": [
        "Calories > 267 kcal",
        "Carbs > 38.6 g",
        "Cholesterol > 6 mg",
        "Fat > 10.8 g",
        "Protein > 8.2 g",
        "Sodium > 425 mg"
    ],
    "n": "Nick's Feta and Artichoke Stuffed Peppers",
    "a": "Nick",
    "r": "0",
    "s": 4,
    "des": "\"Red bell peppers stuffed with a mixture of rice, spices, artichoke hearts, and feta cheese. A flavorful way to make stuffed peppers that my wife adores.\"",
    "ins": "Preheat the oven to 375 degrees F (190 degrees C).\nBring rice and water to a boil in a saucepan. Reduce the heat to medium-low, cover, and simmer until the rice is tender and the liquid has been absorbed, 45 to 50 minutes.\nHeat olive oil in a skillet over medium-low heat; cook and stir green onions and garlic until fragrant, 1 to 2 minutes. Add artichoke hearts, tomato, basil, red pepper flakes, and black pepper. Cook and stir artichoke mixture until heated through, about 5 minutes. Stir in rice and remove from heat.\nCrumble about 1 teaspoon feta cheese into the bottom of each red bell pepper. Spoon rice mixture into each red bell pepper to fill halfway. Crumble another teaspoon feta cheese over filling; top with more filling. Place red bell peppers in a glass baking dish.\nBake in the preheated oven until feta cheese has melted and red bell peppers are slightly tender, about 15 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "3090147.jpg",
    "o": "",
    "st": "allrecipes"
}