{
    "id": 223233,
    "old_rating": "4.44828",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 egg whites",
        "6 tablespoons superfine (castor) sugar",
        "1 cup finely ground almonds",
        "1 1/2 teaspoons finely ground almonds",
        "1 1/3 cups confectioners' sugar"
    ],
    "nut": [
        "Calories > 61 kcal",
        "Carbs > 11.4 g",
        "Cholesterol > 0 mg",
        "Fat > 0.9 g",
        "Protein > 2.3 g",
        "Sodium > 7 mg"
    ],
    "n": "French Macaroons",
    "a": "crazymary98",
    "r": "0",
    "s": 24,
    "des": "\"Fantabulous colored, bite-sized macaroons. Divide batter into thirds and color one-third pink and flavor with raspberry flavoring; color one-third yellow and flavor with lemon flavoring; color one-third pale blue and flavor with vanilla. Fill and make sandwich cookies with filling of choice, like peach jam or strawberry preserves.\"",
    "ins": "Preheat oven to 320 degrees F (160 degrees C). Line baking sheets with parchment paper or a silicon mat.\nWhisk egg whites in a clean metal mixing bowl until thick, about 5 minutes; whisk the superfine sugar into the egg whites until thick, glossy, and the mixture holds stiff peaks, 5 to 8 more minutes. Place a sieve over the bowl containing egg whites and sieve both amounts of almond meal and confectioners' sugar into the egg white mixture. Gently fold the almond meal and confectioners' sugar into the egg whites, retaining as much air as possible.\nSeparate the meringue into separate bowls to flavor and color, if desired. Spoon the meringue into a piping bag fitted with a 3/8-inch tip. Pipe 1-inch disks of meringue onto the prepared baking sheets, leaving about 2 inches between cookies.\nLet the cookies stand at room temperature for about 15 minutes to form a thin skin. Pick up the baking sheets and let drop from several inches above the work surface to adhere cookies to the baking sheets.\nBake in the preheated oven until tops are dry, about 15 minutes; let cool completely on the baking sheets before peeling off the parchment paper.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "900211.jpg",
    "o": "4539019.jpg,4520009.jpg,4520008.jpg,3936948.jpg,3533434.jpg,3479327.jpg",
    "st": "allrecipes"
}