{
    "id": 223342,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 sweet onion (such as VidaliaÂ®), chopped",
        "1 (15.5 ounce) can canned chili starter (such as BUSH'S Chili MagicÂ®)",
        "2 tablespoons dried oregano",
        "2 cups chicken broth",
        "1/2 sweet onion (such as VidaliaÂ®), chopped",
        "1 green bell pepper, chopped",
        "1 jalapeno pepper, minced",
        "2 teaspoons ground cumin",
        "1 1/2 tablespoons unsweetened cocoa powder",
        "1 1/2 tablespoons chili powder",
        "2 teaspoons garlic salt",
        "2 teaspoons paprika",
        "1 teaspoon cayenne pepper",
        "1 1/4 pounds ground lean turkey",
        "1 pound lean ground pork",
        "1 (28 ounce) can diced tomatoes with green chile peppers (such as RO*TELÂ®)",
        "1 (14.5 ounce) can fire-roasted diced tomatoes with garlic",
        "1 (14.5 ounce) can diced tomatoes with green peppers and onions"
    ],
    "nut": [
        "Calories > 272 kcal",
        "Carbs > 18.1 g",
        "Cholesterol > 72 mg",
        "Fat > 11.9 g",
        "Protein > 23.3 g",
        "Sodium > 1409 mg"
    ],
    "n": "Turkey and Pork Chili",
    "a": "NENADD",
    "r": "0",
    "s": 10,
    "des": "\"I'm on a constant quest to provide lean but still delicious food for my family. This is my most recent take on chili. Top with your favorite garnishes, or enjoy as is!\"",
    "ins": "Coat a large saucepan with cooking spray and cook 1 chopped sweet onion over medium heat until tender, about 5 minutes. Add chili starter, oregano, and chicken broth; increase heat to medium-high and simmer for 20 minutes.\nCoat a large stock pot with cooking spay and cook remaining 1/2 chopped sweet onion, green bell pepper, and jalapeno pepper over medium heat until tender, 5 to 8 minutes. Add ground cumin, cocoa powder, chili powder, garlic salt, paprika, and cayenne pepper; cook 2 minutes. Mix in ground turkey and pork; cook and stir until meat is crumbly, evenly browned, and no longer pink, about 10 more minutes. Drain and discard any excess grease.\nStir diced tomatoes with green chiles, fire-roasted tomatoes, and diced tomatoes with green peppers and onions into chili; simmer for about 3 hours.",
    "pt": "15 m",
    "ct": "3 h ",
    "tt": "4 h ",
    "i": "2050552.jpg",
    "o": "",
    "st": "allrecipes"
}