{
    "id": 223340,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (13 ounce) package whole-wheat penne",
        "2 tablespoons olive oil, divided",
        "1 pound boneless, skinless chicken breast halves, sliced into thin strips",
        "4 cloves garlic, minced",
        "1 pinch red pepper flakes",
        "2 tomatoes, chopped",
        "salt and ground black pepper to taste",
        "4 cups fresh spinach",
        "1 1/2 cups marinara sauce",
        "1 (6 ounce) container nonfat plain Greek yogurt",
        "1 bunch fresh basil, chopped",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 612 kcal",
        "Carbs > 81.1 g",
        "Cholesterol > 70 mg",
        "Fat > 13.7 g",
        "Protein > 43.8 g",
        "Sodium > 719 mg"
    ],
    "n": "Healthier Penne Rosa with Chicken",
    "a": "JAIM71",
    "r": "0",
    "s": 4,
    "des": "\"This healthy twist on penne rosa is just as delicious as the original. Substituting fat-free Greek yogurt instead of heavy cream and whole wheat pasta makes this dish a much lower-calorie and lower-fat option. Add grilled chicken to up the protein!\"",
    "ins": "Fill a large pot with lightly salted water and bring to a boil. Stir in penne and return to a boil. Cook pasta uncovered, stirring occasionally, until cooked through, but still firm to the bite, about 11 minutes. Drain.\nHeat 1 tablespoon olive oil in a skillet over medium heat. Add chicken; cook and stir until no longer pink in the center and the juices run clear, about 5 minutes. Transfer chicken to a plate. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nHeat remaining 1 tablespoon oil in the same skillet. Add garlic and red pepper flakes; cook and stir until garlic begins to soften, about 2 minutes. Stir in tomatoes; cook until tender, about 5 minutes. Season with salt and pepper. Remove from heat. Stir in spinach; cover and let stand until wilted, about 2 minutes.\nPour marinara sauce into a separate saucepan over medium heat. Cook until heated through, about 5 minutes. Transfer 1/2 the sauce into a bowl; stir in yogurt. Whisk mixture into the rest of the marinara in the saucepan.\nUncover tomatoes and spinach and place back over low heat. Stir in penne, sauce, and basil; cook until heated through, about 5 minutes. Divide penne into bowls and serve topped with chicken and Parmesan cheese.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}