{
    "id": 223357,
    "old_rating": "4.54762",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large eggplant, ends trimmed",
        "2 teaspoons sea salt, or as needed",
        "1 cup all-purpose flour",
        "3 eggs, beaten",
        "1 cup dried bread crumbs",
        "vegetable oil for frying, or as needed",
        "2 cups ricotta cheese",
        "1/2 cup grated Romano cheese",
        "1 tablespoon minced garlic",
        "salt and ground black pepper to taste",
        "2 cups prepared pasta sauce"
    ],
    "nut": [
        "Calories > 376 kcal",
        "Carbs > 39 g",
        "Cholesterol > 98 mg",
        "Fat > 16.9 g",
        "Protein > 17.2 g",
        "Sodium > 990 mg"
    ],
    "n": "Stuffed Eggplant Parmesan Rolls",
    "a": "Nikki Wilson",
    "r": "0",
    "s": 8,
    "des": "\"Had this for the first time at a take-out pizza and pasta place in southern California. We all loved it so much that we came up with our own version that is just as good as the take-out one. This has become an all-time favorite in our house. Serve with your favorite tomato sauce, cream sauce, or other topping sauce. We serve this over spaghetti noodles, then top with favorite sauce sprinkled with cheese. Or just eat as they are straight from the oven.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9x13-inch baking dish with butter.\nSlice eggplant into 1/4-inch thick slices lengthwise; discard the end slices with skin. Lay the eggplant slices on paper towels and sprinkle both sides generously with sea salt. Let slices drain for 30 minutes; rinse and pat dry with paper towels.\nPlace flour, eggs, and bread crumbs in separate shallow bowls. Dip each eggplant slice in flour and shake off excess; dip into egg and then into bread crumbs.\nHeat vegetable oil in a large skillet over medium heat and fry the slices until golden brown, about 5 minutes per side. Drain on paper towels, place on baking sheets, and refrigerate eggplant for 10 minutes.\nMix ricotta cheese, Romano cheese, and garlic in a bowl; season to taste with salt and black pepper. Place a cooled eggplant slice onto a work surface and mound 1/3 to 1/2 cup of cheese mixture in the center; roll up slice and place seam side down into the prepared baking sheet. Repeat with remaining slices and cheese filling.\nBake rolls in the preheated oven until filling is hot, about 25 minutes.",
    "pt": "30 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "3319565.jpg",
    "o": "3142397.jpg,2792335.jpg,2779016.jpg,2746683.jpg,1620157.jpg,922411.jpg",
    "st": "allrecipes"
}