{
    "id": 223316,
    "old_rating": "4.37037",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "3 tablespoons butter",
        "5 slices bacon, diced",
        "3/4 cup diced onion",
        "1 teaspoon minced garlic",
        "8 chard leaves, stems removed and leaves thinly sliced",
        "2 cups shredded zucchini",
        "3 eggs",
        "1 teaspoon salt",
        "freshly ground black pepper to taste",
        "1 cup all-purpose flour",
        "1 teaspoon baking powder",
        "3/4 cup finely shredded Swiss cheese"
    ],
    "nut": [
        "Calories > 142 kcal",
        "Carbs > 11.5 g",
        "Cholesterol > 65 mg",
        "Fat > 7.8 g",
        "Protein > 6.9 g",
        "Sodium > 445 mg"
    ],
    "n": "Savory Zucchini Chard Muffins",
    "a": "Kennedy Miller Schultz",
    "r": "0",
    "s": 12,
    "des": "\"I adapted a potato muffin recipe to create these savory muffins that helped use up my overflowing stock of vegetables from my garden! You could add any kind of fresh herb if you like, but they are very flavorful on their own. Serve a couple as a main dish with a side salad, or use as a veggie side to a meat dish. Yummy!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Generously spray 12 muffin cups with cooking spray.\nMelt butter in a skillet over medium heat; add bacon. Cook gently until bacon begins to curl, 3 to 5 minutes. Add onion, garlic, and chard leaves; cook and stir until chard has wilted, stirring occasionally, 5 to 8 minutes.\nTransfer chard mixture to a large bowl; stir in zucchini, eggs, salt, and black pepper. Add flour and baking powder; mix until flour is evenly distributed and moistened. Stir in Swiss cheese. Spoon batter into prepared muffin tin.\nBake in the preheated oven until edges of muffin turn golden brown, about 20 minutes.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}