{
    "id": 223359,
    "old_rating": "4.58621",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup Italian-seasoned bread crumbs",
        "1/4 cup grated Parmesan cheese",
        "1 pinch red pepper flakes, or to taste",
        "1 eggplant - trimmed, peeled, and sliced 1/2-inch thick",
        "1/2 cup olive oil",
        "1 (6 ounce) can tomato paste",
        "1 1/2 (6 ounce) cans water",
        "1/4 teaspoon dried basil",
        "1/4 teaspoon dried oregano",
        "1/4 teaspoon dried parsley",
        "1 clove garlic, crushed",
        "1 teaspoon brown sugar",
        "sea salt and ground black pepper to taste",
        "1 (8 ounce) package fresh mozzarella cheese, sliced",
        "3/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 389 kcal",
        "Carbs > 14.4 g",
        "Cholesterol > 41 mg",
        "Fat > 30.6 g",
        "Protein > 14.5 g",
        "Sodium > 680 mg"
    ],
    "n": "Eggplant Parmesan With Easy Homemade Sauce",
    "a": "Brenda",
    "r": "0",
    "s": 6,
    "des": "\"I wasn't an eggplant lover until a friend gave me this recipe which I have tweaked and updated. The few ingredients in the sauce is far tastier than canned sauce and makes the dish. All you need is a side salad and crusty bread to make a meal!\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Grease an 8x14-inch baking dish.\nMix seasoned bread crumbs, 1/4 cup Parmesan cheese, and red pepper flakes in a shallow bowl. Brush eggplant slices with olive oil and press into bread crumb mixture to coat. Lay slices onto a baking sheet and bake in the preheated oven until browned and tender, about 15 minutes. Remove eggplant and reduce oven temperature to 375 degrees F (190 degrees C).\nWhisk tomato paste and water in a saucepan, place over medium heat, and bring to a simmer. Stir in basil, oregano, parsley, garlic, brown sugar, sea salt, and black pepper.\nPlace eggplant slices into prepared baking dish, overlapping the slices. Spoon tomato sauce over eggplant and top with mozzarella cheese and 3/4 cup Parmesan cheese.\nBake in the preheated oven until cheese is melted, about 15 minutes. If desired, broil for 1 to 2 more minutes to give the cheese topping a golden color. Let stand for 5 minutes before serving.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "867454.jpg",
    "o": "",
    "st": "allrecipes"
}