{
    "id": 223389,
    "old_rating": "4.52688",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups brown rice",
        "4 cups water",
        "2 tablespoons cornstarch",
        "2 teaspoons white sugar",
        "6 tablespoons soy sauce",
        "1/4 cup white wine",
        "1 tablespoon minced fresh ginger",
        "1 pound boneless beef round steak, cut into thin strips",
        "1 tablespoon vegetable oil",
        "3 cups broccoli florets",
        "2 carrots, thinly sliced",
        "1 (6 ounce) package frozen pea pods, thawed",
        "2 tablespoons chopped onion",
        "1 (8 ounce) can sliced water chestnuts, undrained",
        "1 cup Chinese cabbage",
        "2 large heads bok choy, chopped",
        "1 tablespoon vegetable oil"
    ],
    "nut": [
        "Calories > 665 kcal",
        "Carbs > 104.6 g",
        "Cholesterol > 39 mg",
        "Fat > 13.8 g",
        "Protein > 30.5 g",
        "Sodium > 1594 mg"
    ],
    "n": "Flavorful Beef Stir-Fry",
    "a": "Kitchenista Jane",
    "r": "0",
    "s": 4,
    "des": "\"A beef stir-fry that has wonderful flavors without using a ton of spices. Fresh ginger mixes will with the soy sauce and makes a quick and easy sauce. Lots of veggies add color and crunch.\"",
    "ins": "Bring brown rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until rice is tender, and liquid has been absorbed, 45 to 50 minutes.\nCombine cornstarch, sugar, soy sauce, and wine in a small bowl until smooth. Stir in ginger; toss beef in sauce to coat.\nHeat 1 tablespoon oil in a large skillet over medium-high heat. Cook and stir broccoli, carrots, pea pods, and onion for 1 minute. Stir in water chestnuts, Chinese cabbage, and bok choy; cover and simmer until vegetables are tender, about 4 minutes. Remove from skillet and keep warm.\nIn same skillet, heat 1 tablespoon oil over medium-high heat. Cook and stir beef until desired degree of doneness, about 2 minutes per side for medium. Return vegetables to skillet; cook and stir until heated through, about 3 minutes. Serve over rice.",
    "pt": "10 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "3759728.jpg",
    "o": "4540247.jpg,4488318.jpg,4022901.jpg,3963334.jpg,3818691.jpg,3811595.jpg",
    "st": "allrecipes"
}