{
    "id": 223394,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 quarts water",
        "1/2 cup salt",
        "20 cucumbers, cut into 1/8-inch slices",
        "ice cubes",
        "6 cups white sugar",
        "4 cups water",
        "4 cups apple cider vinegar",
        "4 teaspoons ground turmeric",
        "4 teaspoons mustard seed",
        "1 teaspoon celery seed"
    ],
    "nut": [
        "Calories > 116 kcal",
        "Carbs > 28.5 g",
        "Cholesterol > 0 mg",
        "Fat > 0.2 g",
        "Protein > 0.8 g",
        "Sodium > 1122 mg"
    ],
    "n": "Deb's Bread and Butter Pickles",
    "a": "droseboom",
    "r": "0",
    "s": 50,
    "des": "\"This pickle recipe was handed down to me. I have been making these for at least 20 years from cucumbers my Dad grows in his garden. I give them to friends and family and have trouble keeping up with the orders. The recipe is the star here as these are the best bread and butter pickles I've ever found. These don't need to be refrigerated until you open a jar.\"",
    "ins": "Stir 2 quarts water and salt in a large pot until salt is dissolved. Submerge cucumbers in the water. Add ice to the water to keep cold. Let cucumbers soak for 2 hours.\nDrain salt water from pot. Rinse and drain cucumber slices twice.\nStir sugar, 4 cups water, apple cider vinegar, turmeric, mustard seed, and celery seed together in a large pot; bring to a boil. Reduce heat to low; add cucumber slices. Simmer until the cucumbers are completely hot, but do not bring to a boil, about 10 minutes.\nSterilize canning jars and lids in boiling water for at least 5 minutes. Pack the cucumbers into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nLet cucumbers pickle 2 weeks before eating, shaking each jar once daily.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "14 d ",
    "i": "1034957.jpg",
    "o": "4539801.jpg,4536464.jpg,3891798.jpg,3808956.jpg,3691293.jpg,3623603.jpg",
    "st": "allrecipes"
}