{
    "id": 223356,
    "old_rating": "4.37209",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons olive oil",
        "1 shallot, chopped",
        "1 clove garlic, minced",
        "1/2 green bell pepper, diced",
        "1/2 eggplant, cubed",
        "1 tomato, seeded and diced",
        "1 small zucchini, diced",
        "salt and pepper to taste",
        "1 1/4 cups self-rising flour",
        "3 eggs",
        "1/3 cup milk",
        "1/3 cup olive oil",
        "1 1/2 cups shredded Swiss cheese"
    ],
    "nut": [
        "Calories > 300 kcal",
        "Carbs > 18.9 g",
        "Cholesterol > 89 mg",
        "Fat > 20.3 g",
        "Protein > 10.7 g",
        "Sodium > 321 mg"
    ],
    "n": "French Veggie Loaf",
    "a": "spanishdona",
    "r": "0",
    "s": 8,
    "des": "\"I found this savory loaf recipe in the Alsace region of France. It is wonderfully moist, and because of the density of the veggie mixture, it doesn't rise too much. So be sure to pour all of the batter into the pan.  You can add or substitute other veggies of your choice. And enjoy!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour a 9x5-inch loaf pan.\nHeat 2 tablespoons olive oil in a large skillet over medium heat and cook and stir shallot, garlic, green bell pepper, eggplant, tomato, and zucchini until soft, 10 to 15 minutes. Season vegetables with a sprinkling of salt and black pepper as they cook.\nWhisk self-rising flour with eggs and milk in a large mixing bowl until smoothly combined; whisk in olive oil. Gently fold vegetables into flour mixture; stir in Swiss cheese. Pour batter into the prepared loaf pan.\nBake loaf in the preheated oven until a toothpick inserted in the middle comes out clean, about 45 minutes. Let cool 10 minutes in the pan before removing to finish cooling on a wire rack; slice when cooled.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "875430.jpg",
    "o": "3715314.jpg,2549299.jpg,2549295.jpg,2307919.jpg,2268569.jpg,2091297.jpg",
    "st": "allrecipes"
}