{
    "id": 223481,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/4 teaspoons active dry yeast",
        "1 1/2 teaspoons white sugar",
        "1 1/8 cups warm water - 110 to 115 degrees F (43 to 45 degrees C)",
        "3 cups all-purpose flour",
        "1/2 cup corn oil",
        "1 1/2 teaspoons kosher salt"
    ],
    "nut": [
        "Calories > 299 kcal",
        "Carbs > 37 g",
        "Cholesterol > 0 mg",
        "Fat > 14.3 g",
        "Protein > 5.3 g",
        "Sodium > 362 mg"
    ],
    "n": "The Real Chicago Deep Dish Pizza Dough",
    "a": "owensjo",
    "r": "0",
    "s": 8,
    "des": "\"I have it on good authority  that this is the real deep dish pizza dough that's used in Chicago. The real thing is nothing like bread, or even pizza, dough. It is a buttery, flaky crust that is achieved by: 1) using corn oil (not butter) and 2) minimal mixing and kneading times. The pizza itself is built with cheese, toppings, and sauce, in that order. I suggest you use 6-in-1Â® tomatoes which are far superior to other brands. ClassicoÂ® ground tomatoes are very similar. Contrary to popular opinion, cornmeal is not used in the dough by Chicago pizzerias.\"",
    "ins": "Dissolve yeast and sugar in warm water in a bowl. Let stand for 5 to 10 minutes until the yeast softens and begins to form a creamy foam.\nCombine yeast mixture, flour, corn oil, and kosher salt in a large stand mixer with a hook attachment; knead until dough holds together but is still slightly sticky, about 2 minutes.\nForm dough into a ball and transfer to a buttered bowl, turning to coat. Cover bowl with a towel and allow dough to rise at room temperature until double in size, 6 hours.\nPunch down dough and let rest for 10 to 15 minutes. Press dough into a 10-inch deep dish pizza pan.",
    "pt": "10 m",
    "ct": "",
    "tt": "",
    "i": "935879.jpg",
    "o": "4527475.jpg,4527192.jpg,4134985.jpg,3216865.jpg,3068382.jpg,2721259.jpg",
    "st": "allrecipes"
}