{
    "id": 223402,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (8 ounce) cans refrigerated crescent rolls",
        "1/2 cup white sugar",
        "1/4 cup brown sugar",
        "1 tablespoon ground cinnamon",
        "1/4 cup crushed walnuts",
        "1 Golden Delicious apple, diced",
        "1 cup butter, softened",
        "1 1/2 cups white sugar",
        "1 (12 fluid ounce) can or bottle caffeinated citrus-flavored soda (such as Mountain DewÂ®)"
    ],
    "nut": [
        "Calories > 696 kcal",
        "Carbs > 87.3 g",
        "Cholesterol > 61 mg",
        "Fat > 37.5 g",
        "Protein > 4.9 g",
        "Sodium > 613 mg"
    ],
    "n": "Apple Walnut Cinnamon Rolls",
    "a": "Jenny",
    "r": "0",
    "s": 8,
    "des": "\"A good combo of apple pie and cinnamon rolls for the ones with a sweet tooth. Top with whipped cream!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nRoll 1 can of crescent rolls out on a cutting board. Make one single piece of dough by rolling the dough with a rolling pin to a 9x13-inch rectangle; make sure the seams don't separate. Repeat with remaining can of crescent rolls. Set 1 dough sheet atop the other to make a double crust.\nMix 1/2 cup white sugar, brown sugar, cinnamon, crushed walnuts, and diced apples in a bowl. Sprinkle evenly over the dough.\nRoll the dough lengthwise, so you end up with a long tube. Cut into 1-inch slices. Place the rolls into prepared dish facing up.\nMelt butter with 1 1/2 cup white sugar in a saucepan over medium-high heat. Cook and stir until sugar dissolves completely, about 5 minutes. Remove saucepan from heat and whisk citrus-flavored soda into the butter mixture; pour over cinnamon rolls.\nBake in preheated oven until golden brown and no longer doughy in the middle, about 30 minutes. Set aside to cool slightly, 5 to 10 minutes. Flip the rolls out of the baking dish onto baking sheet and allow the sticky sauce to drip over the rolls.",
    "pt": "30 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "2985284.jpg",
    "o": "",
    "st": "allrecipes"
}