{
    "id": 223596,
    "old_rating": "4.64516",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup all-purpose flour",
        "1/4 cup seasoned bread crumbs",
        "2 teaspoons garlic salt",
        "1 teaspoon freshly ground black pepper",
        "4 (6 ounce) skinless, boneless chicken breast halves, pounded thin",
        "8 bacon strips",
        "1 onion, sliced",
        "1/4 teaspoon lemon-pepper seasoning",
        "1/4 teaspoon Italian seasoning",
        "1/4 teaspoon salt",
        "1/8 teaspoon red pepper flakes, or more to taste",
        "1/4 cup packed brown sugar",
        "1/2 cup shredded Colby-Monterey Jack cheese"
    ],
    "nut": [
        "Calories > 664 kcal",
        "Carbs > 34.5 g",
        "Cholesterol > 152 mg",
        "Fat > 35.7 g",
        "Protein > 48.7 g",
        "Sodium > 1823 mg"
    ],
    "n": "Smothered Chicken Breasts",
    "a": "Stephanie (Nussear) Back",
    "r": "0",
    "s": 4,
    "des": "\"After reading this recipe here, it sounded so good that I had to put my personal touches to it. I'm not particularly fond of chicken breasts unless they're flattened to a pulp and delicately browned after being dredged in flour. After that I followed the original recipe except I added crushed red peppers and Italian seasoning. I served this with fettuccine alfredo and roasted asparagus on the side. Delizioso!\"",
    "ins": "Mix flour, bread crumbs, garlic salt, and black pepper together in a bowl. Coat each chicken breast with flour mixture.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove bacon with a slotted spoon, reserving bacon drippings; drain bacon on paper towels.\nCook and stir coated chicken breasts in the bacon drippings until chicken is no longer pink in the center and juices run clear, about 5 minutes per side; remove and keep warm.\nCook and stir onion, lemon-pepper seasoning, Italian seasoning, salt, red pepper flakes, and brown sugar in the same skillet until onion is golden brown, 10 to 15 minutes.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nArrange chicken breasts on a baking sheet; top each breast with 2 bacon slices. Top with caramelized onion and Colby-Monterey Jack cheese.\nBroil chicken breasts until cheese is melted and bubbling, 1 to 3 minutes.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "45 m",
    "i": "1007037.jpg",
    "o": "4543713.jpg,4543707.jpg,4322124.jpg,4223798.jpg,3047362.jpg,2988847.jpg",
    "st": "allrecipes"
}