{
    "id": 223555,
    "old_rating": "4.28571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon sea salt",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon dried thyme",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon dried rosemary",
        "1/8 teaspoon paprika",
        "5 tablespoons unsalted butter, melted",
        "2 Cornish game hens",
        "1/2 cup white wine",
        "1 (15 ounce) can tart cherries, drained",
        "1 1/2 cups red wine",
        "1/4 cup pulp-free orange juice",
        "1 tablespoon packed brown sugar",
        "2 tablespoons unsalted butter",
        "1 tablespoon all-purpose flour, or as needed"
    ],
    "nut": [
        "Calories > 646 kcal",
        "Carbs > 19.7 g",
        "Cholesterol > 204 mg",
        "Fat > 41.4 g",
        "Protein > 27.2 g",
        "Sodium > 531 mg"
    ],
    "n": "Cornish Hen with Tart Cherry Sauce",
    "a": "Slim Cooker",
    "r": "0",
    "s": 4,
    "des": "\"This was an idea I had for a long time but never got around to doing it and it came out fantastic couldn't have hoped for better. My wife and I loved it. The tart cherries complement the flavorful rub on the hen perfectly. For golden brown crispy skin increase temperature to 375 degrees F (190 degrees C) for last 10 minutes of cooking.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nCombine sea salt, black pepper, thyme, garlic powder, rosemary, and paprika in a bowl. Place hens on a baking sheet and evenly brush with 5 tablespoons butter. Rub hens with spice mixture.\nBake hens in preheated oven until no longer pink at the bone and the juices run clear, about 1 1/2 hours, basting every 1/2 hour with white wine.  An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C).\nMix cherries, red wine, orange juice, and brown sugar in a saucepan; bring to a boil for 2 to 3 minutes. Reduce heat to medium-low, stir in 2 tablespoons butter, and cook until sugar is dissolved and butter is melted, about 10 minutes. Sprinkle flour into the sauce; whisk until thickened, 2 to 3 minutes. Drizzle cherry sauce over cooked hens.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1078923.jpg",
    "o": "",
    "st": "allrecipes"
}