{
    "id": 223511,
    "old_rating": "4.82143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups water",
        "3 tablespoons white sugar, or more to taste",
        "1 tablespoon butter",
        "1 teaspoon salt",
        "1 1/2 cups cornmeal, or as needed",
        "3 cups vegetable oil for frying",
        "vegetable oil",
        "1/2 cup mayonnaise, or to taste",
        "1/4 cup ketchup",
        "1 pinch garlic salt, or to taste (optional)"
    ],
    "nut": [
        "Calories > 421 kcal",
        "Carbs > 36.7 g",
        "Cholesterol > 12 mg",
        "Fat > 29.6 g",
        "Protein > 2.9 g",
        "Sodium > 676 mg"
    ],
    "n": "Deep Fried Corn Meal Sticks (Sorullitos de Maiz) with Dipping Sauce",
    "a": "Marisa Nicholls",
    "r": "0",
    "s": 6,
    "des": "\"Also referred to as Latin or Spanish Corn Fritters, can be prepared with or without cheese. This version is Puerto Rican style. These deep fried corn meal sticks are crunchy on the outside and buttery sweet on the inside and are great for brunch, as a dinner appetizer, or as a snack at anytime of the day. These can also be prepared cheese-filled; just add a little piece of your favorite cheese inside your shape before frying. Yum!\"",
    "ins": "Bring water to a boil in a saucepan and stir in sugar, butter, and salt until sugar has dissolved. Turn heat to low and whisk in 1 cup of cornmeal until smooth. Stir in remaining 1/2 cup cornmeal to make a very thick, workable dough.\nHeat 3 cups vegetable oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Grease your hands well with 2 teaspoons of oil and scoop about 3 tablespoons of cornmeal dough; roll the dough into a ball, then shape into a 3-inch long stick about 1/2 inch wide. Repeat with remaining dough, oiling your hands as needed. Deep-fry the cornmeal sticks until golden brown, working in batches of 3 or 4 at a time. Drain fried cornmeal sticks on paper towels and keep warm.\nMix mayonnaise, ketchup, and garlic salt in a bowl until well combined; serve cornmeal sticks with the sauce for dipping.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "877128.jpg",
    "o": "4034056.jpg,2880040.jpg,2378048.jpg,2259985.jpg,2092789.jpg,1498452.jpg",
    "st": "allrecipes"
}