{
    "id": 223532,
    "old_rating": "4.39623",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups all-purpose flour",
        "1/2 cup confectioners' sugar",
        "1/2 teaspoon salt",
        "1 cup butter",
        "4 eggs",
        "1/3 cup lime juice",
        "1/4 cup all-purpose flour",
        "2 cups white sugar",
        "2 teaspoons grated lime peel, or more to taste",
        "1/2 teaspoon baking powder",
        "1 drop green food coloring, or as desired (optional)",
        "1 1/2 cups confectioners' sugar",
        "1 tablespoon lime juice",
        "1 teaspoon grated lime peel (optional)"
    ],
    "nut": [
        "Calories > 152 kcal",
        "Carbs > 24.3 g",
        "Cholesterol > 34 mg",
        "Fat > 5.8 g",
        "Protein > 1.6 g",
        "Sodium > 83 mg"
    ],
    "n": "Lime Bars",
    "a": "Jeanne16",
    "r": "0",
    "s": 36,
    "des": "\"A different take on the lemon bars we all love. I actually prefer them to lemon. This is my favorite bar cookie and I'm asked to bring it when going to a potluck or picnic. The recipe says it serves 36, but you can't eat just one of these delicious, tangy lime bars. You can omit the glaze and sprinkle with powdered sugar if that's your preference.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 12x15-inch baking dish.\nMix 2 cups flour, 1/2 cup confectioners' sugar, and salt in a bowl; cut in butter with a pastry cutter until crust mixture resembles crumbs. Pat crust evenly into bottom of the prepared baking dish.\nBake crust in the preheated oven for 10 minutes.\nWhisk eggs, 1/3 cup lime juice, 1/4 cup flour, white sugar, 2 teaspoons lime peel, baking powder, and food coloring in a bowl; pour over the crust.\nReturn baking dish to oven; bake until filling is set, about 25 minutes. Cool thoroughly.\nWhisk 1 1/2 cup confectioners' sugar, 1 tablespoon lime juice, and 1 teaspoon grated lime peel to make a smooth glaze; spread evenly over cooled lime bars. Let glaze set before serving.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "3 h",
    "i": "866903.jpg",
    "o": "3765355.jpg,1813962.jpg,1116121.jpg,1097422.jpg,1073187.jpg,972069.jpg",
    "st": "allrecipes"
}