{
    "id": 223540,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 gallon water, or as needed to cover",
        "1/4 cup pickling salt",
        "8 cucumbers, finely chopped",
        "5 onions, finely chopped",
        "1 head cauliflower, finely chopped",
        "2 red bell peppers, finely chopped",
        "4 large apples, cored and finely chopped",
        "6 cups white sugar",
        "4 cups vinegar",
        "3 cups water",
        "1 cup all-purpose flour",
        "1/4 cup dry mustard powder",
        "1 teaspoon ground turmeric"
    ],
    "nut": [
        "Calories > 113 kcal",
        "Carbs > 27.6 g",
        "Cholesterol > 0 mg",
        "Fat > 0.3 g",
        "Protein > 1.1 g",
        "Sodium > 468 mg"
    ],
    "n": "Yellow Relish",
    "a": "Sue Walker",
    "r": "0",
    "s": 60,
    "des": "\"Make this summer relish for hot dogs and burgers. Great - kids love it!\"",
    "ins": "Bring 1 gallon water to a boil in a large pot and dissolve pickling salt in the boiling water. Place cucumbers, onions, cauliflower, red bell peppers, and apples into a large bowl or crock and pour the boiling water over the vegetables. Allow to stand overnight and drain the next morning.\nTransfer vegetables to a large stock pot and mix in sugar, vinegar, 3 cups water, flour, dry mustard powder, and turmeric until thoroughly combined. Bring the relish to a boil and reduce heat to medium-low; simmer until vegetables are cooked through and soft, about 20 minutes.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the relish into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process relish for 15 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
    "pt": "1 h",
    "ct": "35 m",
    "tt": "10 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}