{
    "id": 223556,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups warm water",
        "1/4 cup molasses",
        "1 (.25 ounce) package active dry yeast",
        "2 tablespoons canola oil",
        "1 1/2 cups bread flour, plus more for kneading",
        "1 cup whole-wheat flour",
        "1 cup rye flour",
        "1/3 cup cornmeal",
        "1/4 cup unsweetened cocoa powder",
        "2 tablespoons vital wheat gluten",
        "1 teaspoon salt"
    ],
    "nut": [
        "Calories > 231 kcal",
        "Carbs > 43.6 g",
        "Cholesterol > 0 mg",
        "Fat > 3.9 g",
        "Protein > 6.9 g",
        "Sodium > 239 mg"
    ],
    "n": "Best Ever Pumpernickel Loaf",
    "a": "AFLYNN6",
    "r": "0",
    "s": 10,
    "des": "\"I have been looking and looking for a GREAT pumpernickel recipe since my bread machine broke. This is a conglomeration of a number of different recipes, tweaked until it is just right. I think I finally found the perfect loaf! Serve with honey butter.\"",
    "ins": "Stir warm water, molasses, and yeast together in the bowl of a stand mixer. Let stand until the yeast softens and begins to form a creamy foam, about 5 minutes. Add canola oil.\nMix bread flour, whole-wheat flour, rye flour, cornmeal, cocoa powder, vital wheat gluten, and salt in a bowl. Add slowly to yeast mixture. Fit the mixer with the dough hook attachment; turn to medium speed and let dough mix for 15 minutes.\nTurn dough onto a floured surface; knead by hand until no longer sticky, but smooth and elastic, adding more flour as needed, 3 to 5 minutes. Grease a large bowl.\nTransfer dough to greased bowl, turning to coat dough on all sides. Cover bowl; let rise in a warm area until doubles in size, 30 minutes. Grease a loaf pan.\nPunch dough down and transfer to greased loaf pan. Cover and let rise in a warm area for 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven until loaf sounds hollow when tapped, 40 to 50 minutes. Cool on a wire rack.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "2 h ",
    "i": "1016034.jpg",
    "o": "",
    "st": "allrecipes"
}