{
    "id": 223589,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 dried black mushrooms",
        "1/4 cup dry soybeans",
        "10 chestnuts",
        "16 cups water",
        "2 cups long-grain rice",
        "2 tablespoons vegetable oil",
        "1 pound bok choy, cut into 1-inch pieces",
        "12 fresh water chestnuts",
        "10 red dates",
        "2 teaspoons salt",
        "1 (6 ounce) skinless, boneless chicken breast, diced"
    ],
    "nut": [
        "Calories > 339 kcal",
        "Carbs > 63.4 g",
        "Cholesterol > 11 mg",
        "Fat > 5.2 g",
        "Protein > 10.6 g",
        "Sodium > 648 mg"
    ],
    "n": "La Pa Congee (Porridge)",
    "a": "Heather LeaMing",
    "r": "0",
    "s": 8,
    "des": "\"Congee is rice cooked with large amounts of water or chicken stock. It is good for convalescents, as it is meant for a tired stomach. The Chinese eat congee for breakfast and supper. It be accompanied by eggs, salted peanuts, fish, or ham. This was a traditional congee in our family. We prepared this congee with eight ingredients: red dates, fresh water chestnuts, soybeans, bok choy, fresh chestnuts, ham, or chicken. This is the congee my family has served for more than one hundred years. It is highly nourishing!\"",
    "ins": "Place the dried black mushrooms and soybeans into 2 separate large containers and cover each with several inches of cool water; let stand 8 hours to overnight.\nRinse and drain the mushrooms and soy beans. Trim tough stems from mushrooms; cut each mushroom into halves.\nBring a pot of water to a boil. With a sharp knife, cut an X shape into the peel of each chestnut. Add chestnuts to the boiling water; cook until hot, 3 to 4 minutes. Drain and plunge immediately into a large bowl of ice water to stop from cooking further. Drain and set aside. When cool enough to handle, peel the chestnuts from the shells and discard the skins and peels. Set the peeled chestnuts aside.\nBring 16 cups water and long-grain rice to a boil in a large pot. Reduce heat to medium-low and cook at a simmer for 30 minutes.\nHeat oil in a wok or large skillet over medium-high heat to 400 degrees F (200 degrees C). Cook and stir bok choy in hot oil quickly, about 1 minute; add to the rice.\nStir peeled chestnuts, black mushrooms, soy beans, water chestnuts, red dates, and salt into the rice. Bring the mixture to a boil, reduce heat to medium-low, and simmer 30 minutes. Stir chicken into the rice mixture, bring again to a boil, reduce heat to medium-low, and simmer until chicken is no longer pink in the middle, about 10 minutes.",
    "pt": "45 m",
    "ct": "1 h ",
    "tt": "9 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}