{
    "id": 223591,
    "old_rating": "4.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "16 cups thinly sliced cucumbers",
        "8 white onions, sliced thinly",
        "1/3 cup pickling salt",
        "3 cloves garlic, halved",
        "cracked ice, or as needed",
        "4 cups white sugar",
        "3 cups cider vinegar",
        "2 tablespoons mustard seed",
        "1 1/2 teaspoons ground turmeric",
        "1 1/2 teaspoons celery seed",
        "6 1-quart canning jars with lids and rings"
    ],
    "nut": [
        "Calories > 149 kcal",
        "Carbs > 35.9 g",
        "Cholesterol > 0 mg",
        "Fat > 0.4 g",
        "Protein > 1.4 g",
        "Sodium > 1236 mg"
    ],
    "n": "Bea and Bill's Bread and Butter Pickles",
    "a": "Matt Henchen",
    "r": "0",
    "s": 30,
    "des": "\"These are the pickles that were present at every family event. One taste and memories of summer and our grandparents - Bill and Beatrice Cooper - come flooding back. Enjoy!\"",
    "ins": "Combine cucumbers, onions, pickling salt, and garlic in a large pot. Place enough cracked ice atop the cucumber mixture to cover by at least 2 inches.\nCover the pot with a lid and refrigerate 3 to 12 hours. Drain all liquid from the mixture. Discard any remaining pieces of ice. Remove the garlic and set aside.\nBring the sugar, vinegar, mustard seed, turmeric, and celery seed to a boil in a separate large saucepan, stirring frequently. Add the cucumber and onion mixture; return to a boil. Reduce heat to medium-low and cook at a simmer until cucumbers and onion are soft,  5 to 10 minutes.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the cucumber and onion mixture into the hot, sterilized jars, filling the jars to within 1/2 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.\nPlace jars in a canning pot with at least an inch of water covering all of the jars and boil for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). If you have a can that does not seal, just stick it in the fridge and eat that jar first. Store in a cool, dark area, and wait at least 3 hours before opening.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "6 h ",
    "i": "872293.jpg",
    "o": "",
    "st": "allrecipes"
}