{
    "id": 223529,
    "old_rating": "4.47059",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup white vinegar",
        "1/4 cup fish sauce",
        "2 tablespoons white sugar",
        "2 tablespoons lime juice",
        "1 clove garlic, minced",
        "1/4 teaspoon red pepper flakes",
        "1/2 teaspoon canola oil",
        "2 tablespoons chopped shallots",
        "2 skewers",
        "8 medium shrimp, with shells",
        "1 (8 ounce) package rice vermicelli noodles",
        "1 cup finely chopped lettuce",
        "1 cup bean sprouts",
        "1 English cucumber, cut into 2-inch matchsticks",
        "1/4 cup finely chopped pickled carrots",
        "1/4 cup finely chopped diakon radish",
        "3 tablespoons chopped cilantro",
        "3 tablespoons finely chopped Thai basil",
        "3 tablespoons chopped fresh mint",
        "1/4 cup crushed peanuts"
    ],
    "nut": [
        "Calories > 659 kcal",
        "Carbs > 112.3 g",
        "Cholesterol > 36 mg",
        "Fat > 12.8 g",
        "Protein > 26.2 g",
        "Sodium > 2565 mg"
    ],
    "n": "Vermicelli Noodle Bowl",
    "a": "Allrecipes",
    "r": "0",
    "s": 2,
    "des": "\"Many Vietnamese dishes are perfect for hot weather. This simple noodle salad combines fresh herbs, rice vermicelli, cucumber, bean sprouts, and more, topped with grilled shrimp. Tossed with a tangy sweet and sour sauce, it's a simple and satisfying dinner.\"",
    "ins": "Whisk together vinegar, fish sauce, sugar, lime juice, garlic, and red pepper flakes in small bowl. Set the sauce aside.\nHeat vegetable oil a small skillet over medium heat. Add shallots; cook and stir and softened and lightly caramelized, about 8 minutes.\nPreheat an outdoor grill for medium heat and lightly oil the grate. Skewer 4 shrimp on each skewer and grill until they turn pink and are charred on the outside, 1 to 2 minutes per side. Set aside.\nBring a large pot of water to a boil. Add vermicelli noodles and cook until softened, 12 minutes. Drain noodles and rinse with cold water, stirring to separate the noodles.\nAssemble the vermicelli bowl by placing the cooked noodles in one half of each serving bowl and the lettuce and bean sprouts in the other half. Top each bowl with cucumbers, carrots, daikon, cilantro, Thai basil, mint, peanuts, and the caramelized shallots. Serve with shrimp skewers on top and sauce on the side. Pour sauce over the top and toss thoroughly to coat before eating.",
    "pt": "35 m",
    "ct": "25 m",
    "tt": "1 h",
    "i": "4482316.jpg",
    "o": "4482316.jpg,4482061.jpg,3657916.jpg,3203431.jpg,2354736.jpg,2324848.jpg",
    "st": "allrecipes"
}