{
    "id": 223600,
    "old_rating": "4.46667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/4 cups all-purpose flour",
        "3/4 cup white sugar",
        "3/4 cup unsalted butter, cut into 1-inch pieces",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon salt",
        "3/4 cup sour cream",
        "1 teaspoon almond extract",
        "1 egg",
        "1 (8 ounce) package cream cheese, softened",
        "1/4 cup white sugar",
        "1 egg",
        "1/2 cup raspberry preserves",
        "1/2 cup sliced almonds"
    ],
    "nut": [
        "Calories > 419 kcal",
        "Carbs > 45.7 g",
        "Cholesterol > 88 mg",
        "Fat > 24.1 g",
        "Protein > 6.3 g",
        "Sodium > 198 mg"
    ],
    "n": "Raspberry Cream Cheese Coffee Cake",
    "a": "springfield70",
    "r": "0",
    "s": 12,
    "des": "\"This is a wonderful alternative to those standard cinnamon-walnut-streusel coffee cake recipes. It's perfect for a brunch or a special family gathering. Prepping the batter in a food processor makes it quick and easy to assemble. You can substitute different preserves - apricot, cherry and blueberry all work well.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9-inch spring-form pan.\nCombine flour, 3/4 cup sugar, and butter in a food processor; pulse until mixture resembles coarse crumbs. Remove 1 cup of mixture from food processor and set aside. To remaining mixture in processor add baking soda, baking powder, salt, sour cream, almond extract, and 1 egg; process until batter is just combined and smooth. Spread batter evenly into bottom and 2 inches up sides of prepared pan.\nBeat cream cheese, 1/4 cup sugar, and 1 egg together in a bowl until smooth; pour into batter-lined pan and spread evenly. Spread raspberry preserves carefully over cheese filling.\nStir reserved crumb mixture and sliced almonds together in a small bowl; sprinkle over the layer of raspberry preserves.\nBake in preheated oven until filling is set and crust is deep golden brown, 45 to 55 minutes. Cool 15 minutes before removing side of pan. Chill completely before serving, about 1 hour.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "2 h",
    "i": "4465862.jpg",
    "o": "",
    "st": "allrecipes"
}