{
    "id": 22379,
    "old_rating": "4.53125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 envelope (1 tablespoon) unflavored gelatin",
        "1/4 cup water",
        "4 eggs, separated",
        "1 1/4 cups white sugar",
        "1 1/4 cups pumpkin",
        "2/3 cup evaporated milk",
        "1/4 teaspoon salt",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon ground nutmeg",
        "1/4 teaspoon ground ginger",
        "1 recipe pastry for a 9 inch single crust pie"
    ],
    "nut": [
        "Calories > 317 kcal",
        "Carbs > 47.1 g",
        "Cholesterol > 99 mg",
        "Fat > 11.8 g",
        "Protein > 7.4 g",
        "Sodium > 251 mg"
    ],
    "n": "Pumpkin Chiffon Pie",
    "a": "Carla  A. Lightsey, Houston, Texas",
    "r": "0",
    "s": 8,
    "des": "\"You will be the hit of your holiday dinner with this Pumpkin Chiffon Pie. It is a recipe that's been in our family for years, but I want to share it so everybody can enjoy it for the Holidays!!!  You will never want to use any other pumpkin pie recipe from now on. A wonderful option is to sprinkle the finished pie with almond toffee brickle chips. (Note: This recipe contains raw eggs. We recommend that pregnant women, young children, the elderly and the infirm do not consume raw eggs. For more information visit our Hints and Tips pages.)\"",
    "ins": "Mix the gelatin and water in a small bowl, and set aside.\nIn a medium bowl, beat the egg yolks until thick. Mix in 3/4 cup sugar, pumpkin, evaporated milk, salt, cinnamon, allspice, nutmeg and ginger.\nIn a double broiler, cook the mixture over boiling water, stirring constantly, until thick. Mix in the gelatin. Stir to dissolve. Remove from heat and allow the mixture to thicken until it mounds when dropped by the spoonful.\nIn a clean, dry medium bowl, beat the egg whites until soft peaks form. Gradually mix in the remaining 1/2 cup sugar, and continue beating until firm. Fold in the pumpkin mixture. Transfer to the pie crust. Chill until firm, about 1 hour.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}