{
    "id": 22387,
    "old_rating": "4.0625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons yellow cornmeal",
        "6 cups bread flour",
        "2 (.25 ounce) packages rapid rise yeast",
        "2 teaspoons salt",
        "2 1/2 cups warm water (120 to 130 degrees F/50 degrees C)"
    ],
    "nut": [
        "Calories > 154 kcal",
        "Carbs > 30.8 g",
        "Cholesterol > 0 mg",
        "Fat > 0.7 g",
        "Protein > 5.3 g",
        "Sodium > 234 mg"
    ],
    "n": "Essence of Bread",
    "a": "David Klaproth",
    "r": "0",
    "s": 20,
    "des": "\"This is about as simple as a bread recipe can be.  It's great tasting, crusty, yeasty, coarse-textured, satisfying bread.  I'm a guy, and I can make this perfect every time.  This bread is the exact of opposite of all the other soft, fine-textured, preservative laden, over-priced supermarket breads. It's easiest if you use a stand-type mixer with bread hooks.  If you don't have one, buy one.  It'll be the most-used appliance in your kitchen, next to the toaster.\"",
    "ins": "Heat oven to warm (about 110 degrees F/45 degrees C). Spray two 9x5 inch loaf pans with non-stick cooking spray, add just enough cornmeal to coat.\nIn the bowl of an upright mixer, combine the flour, yeast and salt; stir well to combine. Pour in the water; mix until a stiff dough forms. Lightly oil a large bowl, place the dough in the bowl. Cover with a damp cloth and let rise in preheated oven for 15 minutes.\nDeflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into two lightly greased 9x5 inch loaf pans. With very sharp knife, cut shallow slash in tops of loaves. Lightly dust loaves with flour, cover with towel,  and put back in oven.  Let rise until at least doubled, about 45 minutes.  Remove loaves from oven, keep covered, and preheat oven to 425 degrees F (220 degrees C).\nReturn uncovered loaves to preheated oven. Bake until golden brown and loaves sound hollow when tapped on the top.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "2635686.jpg",
    "o": "",
    "st": "allrecipes"
}