{
    "id": 22392,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 (0.6 ounce) cakes compressed fresh yeast",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "4 cups hot water",
        "3/4 cup white sugar",
        "1 tablespoon salt",
        "1/2 cup shortening",
        "15 cups bread flour"
    ],
    "nut": [
        "Calories > 124 kcal",
        "Carbs > 22.9 g",
        "Cholesterol > 0 mg",
        "Fat > 1.9 g",
        "Protein > 3.5 g",
        "Sodium > 98 mg"
    ],
    "n": "Fresh Yeast Bread",
    "a": "ANNAXENA",
    "r": "0",
    "s": 72,
    "des": "\"Pre-slice and freeze these loaves. Then simply defrost, heat and rub butter over top for a 'fresh out of the oven' taste.\"",
    "ins": "In a small bowl, dissolve yeast in warm water. Let stand 10 minutes.\nIn a very large bowl, combine hot water, white sugar, salt and shortening. Stir to dissolve shortening; let cool to lukewarm. Add the yeast mixture and 6 cups of flour; beat well. Stir in the remaining flour, 1 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 15 minutes.\nLightly oil two large bowls Divide the dough in half and place each half in a bowl; turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nDeflate dough, form into rounds and let rise again until doubled, about 30 minutes.\nDeflate the dough and turn it out onto a lightly floured surface. Divide the dough into six equal pieces and form into loaves. Place the loaves into six lightly greased 9x5 inch loaf pans. Cover the loaves and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven for 35 to 40 minutes, until loaves are golden brown and bottoms sound hollow when tapped.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "3 h ",
    "i": "4374744.jpg",
    "o": "",
    "st": "allrecipes"
}