{
    "id": 22574,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup bacon grease",
        "2 (8.5 ounce) packages corn bread mix",
        "2/3 cup milk",
        "2 eggs",
        "1 onion, diced",
        "1 green bell pepper, diced",
        "1 cup butter, divided",
        "2 (16 ounce) packages herb seasoned stuffing mix",
        "4 (14.5 ounce) cans chicken broth",
        "2 tablespoons poultry seasoning",
        "3 tablespoons baking powder"
    ],
    "nut": [
        "Calories > 525 kcal",
        "Carbs > 69.6 g",
        "Cholesterol > 63 mg",
        "Fat > 22.3 g",
        "Protein > 11 g",
        "Sodium > 1654 mg"
    ],
    "n": "Suzanne's Down Home Southern Dressing",
    "a": "Suzanne Hayes",
    "r": "0",
    "s": 15,
    "des": "\"This is a dressing or stuffing served as a side dish with chicken or turkey.  Chicken may be de-boned and added to dressing if you prefer.  This is real southern cookin' y'all!  Everyone tells me this dressing is so good it makes their tongues wanna slap their brains out!  Hope you enjoy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).  Generously coat a 9x13 inch baking dish with bacon grease.\nMix corn bread mix with milk and egg according to package directions.  In a medium skillet over medium heat, cook onion and bell pepper in 1/2 cup butter until tender.  Stir onion mixture into corn bread batter.  Pour into prepared 9x13 inch pan.\nBake in preheated oven 35 to 40 minutes, until golden brown.  Cool completely.  Increase oven temperature to 375 degrees F (190 degrees C).\nProcessed cooled corn bread in a food processor until soft and mushy.  Pour into a large aluminum roasting pan.  Stir in herbed stuffing mix.  Stir in chicken broth, a can at a time, until mixture is well moistened, but not soupy.  Stir in poultry seasoning and baking powder.  Dot with remaining butter, and press butter down into dressing.\nBake in preheated oven until puffed and golden, 30 to 45 minutes.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}