{
    "id": 22621,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 pounds round steak, cut into small pieces",
        "1 cup apple cider",
        "4 Granny Smith apples - peeled, cored and finely diced",
        "1 1/3 cups white sugar",
        "2 1/2 cups dried currants",
        "2 1/2 cups raisins",
        "1/2 pound chopped candied mixed fruit peel",
        "1/2 cup butter",
        "1 (16 ounce) jar sour cherry preserves",
        "1 teaspoon ground ginger",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon salt",
        "1 (16 ounce) can pitted sour cherries, drained with liquid reserved",
        "1 recipe pastry for a 9 inch double crust pie",
        "2 tablespoons heavy cream"
    ],
    "nut": [
        "Calories > 1106 kcal",
        "Carbs > 181.2 g",
        "Cholesterol > 80 mg",
        "Fat > 37.5 g",
        "Protein > 20.7 g",
        "Sodium > 521 mg"
    ],
    "n": "Old Time Mincemeat Pie",
    "a": "ONEMINA",
    "r": "0",
    "s": 8,
    "des": "\"An old-fashioned mincemeat pie filling made with meat and sour cherries.\"",
    "ins": "In a Dutch oven, combine beef and apple cider. Bring to a boil, then reduce heat to a simmer. Cover and cook for about 20 minutes, or until meat is tender. Remove meat and coarsely chop, then return it to the pot.\nStir in chopped apples, sugar, currants, raisins, citrus peel, butter and cherry preserves. Add ginger, cloves, nutmeg, cinnamon and salt. Let simmer, uncovered, over low heat until mixture is very thick, about 90 minutes. Stir in cherries and remove from heat.\nRefrigerate tightly covered for at least a week before using.\nPreheat oven to 350 degrees F (175 degrees C). Put filling in unbaked pie shell and place pastry on top. Crimp edges and poke several holes in top pastry. Brush top with cream and sprinkle with sugar.\nBake in preheated oven for 40 minutes, or until golden brown.",
    "pt": "45 m",
    "ct": "40 m",
    "tt": "7 d ",
    "i": "319194.jpg",
    "o": "",
    "st": "allrecipes"
}