{
    "id": 22675,
    "old_rating": "3.15385",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 1/2 cups sifted all-purpose flour",
        "1 teaspoon salt",
        "1 egg, lightly beaten",
        "1 cup warm water",
        "2 cups poppy seeds",
        "3/4 cup white sugar",
        "1 teaspoon ground cinnamon",
        "1/2 cup butter, melted",
        "9 apples - peeled, cored and diced",
        "3/4 cup heavy cream"
    ],
    "nut": [
        "Calories > 320 kcal",
        "Carbs > 40.4 g",
        "Cholesterol > 37 mg",
        "Fat > 16.1 g",
        "Protein > 6 g",
        "Sodium > 178 mg"
    ],
    "n": "German Apple Strudel",
    "a": "Jo Vandevelde",
    "r": "0",
    "s": 18,
    "des": "\"This recipe was handed down to me by my Austrian-born Grandmother and I make it all the time, so please do trust me!  I am sincere!\"",
    "ins": "In a large bowl, combine flour, salt, egg and water and stir vigorously until mixture forms a dough. Turn out onto a floured surface and knead 10 minutes, until smooth and elastic. Cover with plastic wrap and let rest 1 hour.\nGrind poppy seeds in a food processor or spice grinder, if desired. Combine poppy seeds, sugar, and cinnamon in a medium bowl and mix well; set aside.\nPreheat oven to 400 degrees F (200 degrees C). Grease a 9x13-inch baking dish.\nPlace the dough on a large work surface covered with a clean cotton sheet. Stretch the dough slightly to form a large rectangle. Pour the melted butter over the dough to moisten. Carefully stretch the dough into a large rectangle as big as your work surface will allow. The dough should be very thin and translucent.\nSprinkle the poppy seed mixture evenly over the stretched dough. Distribute the apples evenly over the poppy seed mixture. Sprinkle with about one half of the cream. Roll each side of the dough carefully to the middle and fold the ends under the strudel. Cut the strudel in half and place the two halves side by side in the prepared dish. Sprinkle with the remaining cream.\nBake in preheated oven until pastry is golden brown, about 1 hour. Allow to cool before slicing.",
    "pt": "1 h",
    "ct": "1 h",
    "tt": "3 h",
    "i": "30730.jpg",
    "o": "",
    "st": "allrecipes"
}