{
    "id": 22706,
    "old_rating": "4.37037",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 (6 ounce) shelled raw lobster tails",
        "1 tablespoon butter",
        "1 tablespoon minced celery",
        "1 green onion, minced",
        "1 1/2 teaspoons all-purpose flour",
        "1/8 teaspoon dry mustard",
        "1/8 teaspoon cayenne pepper",
        "1/3 cup cold milk",
        "1 (6 ounce) can crabmeat, drained and flaked",
        "2 tablespoons dry bread crumbs"
    ],
    "nut": [
        "Calories > 251 kcal",
        "Carbs > 6.1 g",
        "Cholesterol > 148 mg",
        "Fat > 8.1 g",
        "Protein > 36.4 g",
        "Sodium > 718 mg"
    ],
    "n": "Crab Stuffed Lobster Rayna",
    "a": "Rayna Jordan",
    "r": "0",
    "s": 4,
    "des": "\"To die for! I serve these to company on special occasions with warm garlic and lemon butter. My guests are still talking about the first time I whipped these up over five years ago!\"",
    "ins": "Preheat grill for medium heat.\nButterfly the lobster tails by carefully cutting a slit down the top side, without cutting all the way through to the bottom. Flip the tail over, and carefully cut the shiny membrane without cutting the meat on the underside. This will prevent the tails from curling as they cook. Set tails aside.\nIn a skillet, melt the butter over medium heat. Cook and stir the celery and green onion in butter until tender. Stir in the flour, dry mustard, and cayenne pepper. Using a wire whisk, mix in cold milk slowly, whisking constantly to prevent lumps from forming. Continue cooking, stirring occasionally, until thickened. Remove from heat. Stir in crab meat and bread crumbs. Spoon crab mixture into lobster tails.\nArrange tails on the preheated grill, and close the lid. Cook for 12 minutes, or until lobster meat is opaque and the crab mixture is heated through.",
    "pt": "20 m",
    "ct": "27 m",
    "tt": "47 m",
    "i": "947283.jpg",
    "o": "",
    "st": "allrecipes"
}