{
    "id": 22798,
    "old_rating": "4.45455",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "PASTRY",
        "1/2 cup butter",
        "1 cup water",
        "1 cup all-purpose flour",
        "3 eggs",
        "FILLING",
        "1 pint heavy cream, whipped",
        "2 (3.4 ounce) packages instant vanilla pudding mix",
        "2 1/2 cups milk",
        "FROSTING",
        "1 (16 ounce) container prepared chocolate frosting",
        "1 cup heavy cream, whipped (optional)",
        "1 (4 ounce) jar maraschino cherries (optional)",
        "1 cup chopped walnuts (optional)"
    ],
    "nut": [
        "Calories > 651 kcal",
        "Carbs > 46.8 g",
        "Cholesterol > 168 mg",
        "Fat > 49.7 g",
        "Protein > 8.7 g",
        "Sodium > 251 mg"
    ],
    "n": "Christmas Eclair Pie",
    "a": "ANDROMEDA050456",
    "r": "0",
    "s": 11,
    "des": "\"This dessert is so scrumptious, my kids eat it up fast! It's exactly what it sounds like!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).  Grease and flour a pizza pan. Grease the bottom of a small glass bowl and place in center of pan.\nIn a small saucepan over medium heat, combine butter and water; bring to a boil.  Remove from heat and stir in flour, stirring until thickened.  Stir in eggs, one at a time, stirring well after each.   Pour batter around bowl, forming a ring.\nBake in preheated oven for 40 minutes.  Turn off the heat and allow pastry to rise another 15 minutes.  Do not open the oven door while pastry is rising.  After the 15 minutes, remove pastry from oven and cool completely.  Cut through the pastry horizontally, making a bottom and a top.\nBeat together the milk and pudding mix.  Stir pudding mixture into whipped cream and beat until thick.  Spread filling in pastry bottom, and then replace pastry top.\nHeat the prepared chocolate frosting for a few seconds in the microwave, to make it pourable.  Pour over filled pastry, letting it drip down the sides.\nIf desired, pipe dots of whipped cream on top, sprinkle with walnuts, and place a cherry on each whipped cream dot.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}