{
    "id": 227984,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 (6 ounce) container fresh blueberries",
        "1 (6 ounce) container fresh blackberries",
        "1/2 cup orange juice",
        "3 tablespoons white sugar",
        "1 cup all-purpose flour",
        "1 1/2 tablespoons baking powder",
        "1 cup white sugar",
        "1/2 cup butter, melted",
        "1 egg",
        "1 1/2 tablespoons vanilla extract",
        "1/2 cup miniature white chocolate chips (optional)",
        "1/2 cup brown sugar (optional)"
    ],
    "nut": [
        "Calories > 435 kcal",
        "Carbs > 69.3 g",
        "Cholesterol > 56 mg",
        "Fat > 16.5 g",
        "Protein > 3.9 g",
        "Sodium > 382 mg"
    ],
    "n": "Blackberry and Blueberry Cobbler",
    "a": "Dana Souza",
    "r": "0",
    "s": 8,
    "des": "\"A delicious, moist, blackberry and blueberry cobbler. This soft pastry dessert is lightly sweet with fresh berries and white chocolate morsels. Pair up with vanilla ice cream to create the perfect dessert.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Spray an 8x8-inch baking dish with cooking spray.\nStir blueberries, blackberries, orange juice, and 3 tablespoons white sugar together in a bowl. Allow berries to stand 20 to 30 minutes to accumulate juice.\nWhisk flour with baking powder in a bowl until thoroughly combined. Mix 1 cup sugar with melted butter, egg, and vanilla extract in a separate bowl until thoroughly combined. Whisk flour mixture gradually into the liquid ingredients to make a smooth batter.\nSpread a thin layer of batter over bottom of the prepared baking dish; top with berry mixture and juices. Spoon remaining batter over berries and spread into an even top layer; sprinkle top with white chocolate chips and brown sugar.\nBake in the preheated oven until the cobbler is golden brown, the filling is bubbling, and the chips have melted, 30 to 35 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "1026889.jpg",
    "o": "",
    "st": "allrecipes"
}