{
    "id": 228090,
    "old_rating": "4.32692",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup water",
        "1 spaghetti squash, halved lengthwise and seeded",
        "1 1/2 pounds ground beef",
        "1 white onion, diced",
        "1 tablespoon extra-virgin olive oil",
        "1 cup sliced mushrooms",
        "1 zucchini, diced",
        "1 green bell pepper, chopped",
        "1 red bell pepper, chopped",
        "1 (14.5 ounce) can crushed tomatoes",
        "1 (8 ounce) can crushed tomatoes",
        "1/4 cup chopped fresh basil, or to taste",
        "1/4 cup chopped fresh oregano, or to taste",
        "1/4 cup chopped fresh thyme, or to taste",
        "1 tablespoon red pepper flakes, or to taste",
        "1/2 cup extra-virgin olive oil, divided"
    ],
    "nut": [
        "Calories > 388 kcal",
        "Carbs > 14.5 g",
        "Cholesterol > 52 mg",
        "Fat > 29.9 g",
        "Protein > 17 g",
        "Sodium > 167 mg"
    ],
    "n": "Spaghetti Squash with Paleo Meat Sauce",
    "a": "rubymemphis",
    "r": "0",
    "s": 8,
    "des": "\"I made some spaghetti and it turned out so good and super filling. One batch could last you the entire week! Chicken or turkey can be substituted for the ground beef. Try adding Italian herbs, like parsley, oregano, and fennel.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPour water into a baking dish. Place squash halves with cut sides down in baking dish; roast for until tender, 30 to 40 minutes.\nWhile squash is baking, cook and stir ground beef and onions in a skillet over medium-high heat until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Set beef aside.\nHeat 1 tablespoon olive oil in a skillet over medium heat; cook and stir mushrooms, zucchini, green and red bell peppers, both amounts of crushed tomatoes, basil, oregano and thyme. Simmer over medium heat until vegetables are cooked through and tender, about 10 minutes. Add the ground beef and onions; stir to combine. Simmer on low heat, stirring occasionally, while you finish preparing spaghetti squash.\nScrape the inside of hot spaghetti squash halves with a fork to shred the squash into strands; divide onto 8 plates. Drizzle each serving of spaghetti squash with 1 tablespoon extra-virgin olive oil and top each serving with a generous amount of meat sauce.",
    "pt": "40 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "4504495.jpg",
    "o": "4504495.jpg,3998875.jpg,3800088.jpg,3664330.jpg,3547910.jpg,2934331.jpg",
    "st": "allrecipes"
}