{
    "id": 228035,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 clove garlic, minced",
        "1 small eggplant, peeled and cut into 1/4-inch slices",
        "1 1/2 teaspoons minced fresh basil",
        "1 tablespoon grated Parmesan cheese",
        "1/2 cup ricotta cheese",
        "1 (10 ounce) can diced tomatoes with green chile peppers",
        "1 1/2 teaspoons minced fresh basil",
        "1 dash Worcestershire sauce, or to taste",
        "1/2 cup shredded mozzarella cheese",
        "1 tablespoon grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 362 kcal",
        "Carbs > 19.5 g",
        "Cholesterol > 42 mg",
        "Fat > 24.7 g",
        "Protein > 18.6 g",
        "Sodium > 895 mg"
    ],
    "n": "Spicy Eggplant Parmesan",
    "a": "Jacki222",
    "r": "0",
    "s": 2,
    "des": "\"I've changed the recipe to make it spicier plus added ricotta cheese to make it more hearty. If spicy is not your thing, you can get diced tomatoes with green chilies in a mild version.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Grease a baking sheet.\nCombine olive oil and garlic in a bowl; brush over both sides of the eggplant slices. Arrange on the prepared baking sheet.\nBake in preheated oven until golden brown, about 5 minutes. Transfer to cool on a wire rack.\nReduce oven heat to 350 degrees F (175 degrees C). Grease a 1-quart baking dish.\nArrange half the eggplant slices in the prepared baking dish. Sprinkle with 1 1/2 teaspoons basil and 1 tablespoon Parmesan cheese. Spread ricotta cheese over eggplant. Pour tomatoes over ricotta cheese and sprinkle with remaining 1 1/2 teaspoons basil. Season with Worcestershire sauce. Top with remaining sliced eggplant and spread with mozzarella cheese and 1 tablespoon Parmesan cheese. Cover baking dish with aluminum foil.\nBake in preheated oven for 20 minutes and remove foil. Continue baking until cheese is melted, about 5 minutes more.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "1117478.jpg",
    "o": "",
    "st": "allrecipes"
}