{
    "id": 228136,
    "old_rating": "4.1",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 slices bacon",
        "16 thick fresh asparagus spears",
        "1/2 lemon, juiced",
        "16 slices multi-grain bread, crusts removed",
        "1 (8 ounce) package cream cheese, softened",
        "2 tablespoons minced fresh chives",
        "1/4 cup butter, melted",
        "3 tablespoons grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 154 kcal",
        "Carbs > 11.9 g",
        "Cholesterol > 31 mg",
        "Fat > 10.5 g",
        "Protein > 5.7 g",
        "Sodium > 299 mg"
    ],
    "n": "Asparagus Roll-Ups",
    "a": "smbassref",
    "r": "0",
    "s": 16,
    "des": "\"These roll-ups are simply divine. A friend shared the recipe after serving them at a church brunch, where they disappeared fast. They make a unique finger food, a side dish at supper, or a lovely lunch served with soup.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a baking sheet.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels. Crumble bacon when cooled.\nCook asparagus in a skillet with a small amount of water over medium heat until crisp and tender, about 6 to 8 minutes; drain and sprinkle with lemon juice.\nFlatten bread slices with a rolling pin.\nStir cream cheese, crumbled bacon, and chives together in a small bowl until evenly mixed. Spread 1 tablespoon of the cream cheese mixture onto each slice of bread and top with an asparagus spear. Roll the bread tightly around the asparagus; arrange onto prepared baking sheet with seam side down. Brush the tops of the rolls with melted butter and sprinkle with Parmesan cheese.\nBake in preheated oven until lightly browned, 10 to 12 minutes.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "974129.jpg",
    "o": "",
    "st": "allrecipes"
}