{
    "id": 228275,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon butter",
        "1 large sweet onion (such as VidaliaÂ®), cut into chunks",
        "6 eggs",
        "1/2 cup whole milk",
        "10 ounces shredded Jarlsberg cheese",
        "2 ounces freshly grated Parmesan cheese",
        "2 bunches Swiss chard, stems and leaves separated",
        "1 teaspoon fresh thyme leaves",
        "1 pinch nutmeg",
        "salt and ground black pepper to taste",
        "1 prepared 10-inch pie crust"
    ],
    "nut": [
        "Calories > 506 kcal",
        "Carbs > 29.7 g",
        "Cholesterol > 134 mg",
        "Fat > 34.1 g",
        "Protein > 20.6 g",
        "Sodium > 627 mg"
    ],
    "n": "Farm Share Quiche",
    "a": "amykallesten",
    "r": "0",
    "s": 8,
    "des": "\"What started as an easy, delicious way to use the Swiss chard we got in our farm share quickly became a reason to go out and buy it at the farmer's market! Sophisticated enough to serve at brunch, this quiche also fits right in as finger food at summer picnics. We especially love it when most of the ingredients come from our farm share and we use fresh eggs from our neighbor's chickens. Friends who initially raised their eyebrows at Swiss chard not only request I make it, they ask for the recipe. Serve warm or at room temperature.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nMelt butter in large skillet over medium heat. Cook and stir onion in melted butter until soft, about 7 minutes; transfer to large bowl.\nBlend eggs, milk, Jarlsberg cheese, and Parmesan cheese in a food processor or blender; pour into bowl with the onion. Add chard, thyme, nutmeg, salt, and black pepper; mix. Pour egg mixture into prepared pie crust.\nBake in preheated oven until a knife inserted into the center of the quiche comes out clean, 40 to 45 minutes.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "4098674.jpg",
    "o": "",
    "st": "allrecipes"
}