{
    "id": 228284,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "2 large onions, cut into 1-inch squares",
        "3 tablespoons chopped fresh sage",
        "salt and freshly ground black pepper to taste",
        "3 pounds butternut squash - peeled, seeded, and cut into 1/2-inch cubes",
        "2 cloves garlic, minced",
        "3/4 teaspoon salt",
        "10 tablespoons heavy whipping cream",
        "1 cup fresh bread crumbs",
        "1 1/2 tablespoons butter, melted"
    ],
    "nut": [
        "Calories > 176 kcal",
        "Carbs > 21.7 g",
        "Cholesterol > 28 mg",
        "Fat > 10.1 g",
        "Protein > 2.4 g",
        "Sodium > 238 mg"
    ],
    "n": "Butternut Squash Gratin",
    "a": "lyss8",
    "r": "0",
    "s": 10,
    "des": "\"This is an amazing side dish for Thanksgiving, the holidays, or anytime. There are never any leftovers when I make this.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a gratin baking dish with butter.\nHeat 1 tablespoon butter and olive oil in a large skillet over low heat; add onions and sage. Cover and cook, stirring occasionally, until onions are browned, about 25 minutes. Season with salt and black pepper.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add squash, cover, and steam until tender, 10 to 20 minutes. Transfer squash to prepared gratin dish; toss with garlic and 3/4 teaspoon salt. Add the caramelized onions to the pan and gently mix to combine.\nWarm cream in a saucepan over low heat; pour over squash mixture. Stir to coat. Combine bread crumbs and 1 1/2 tablespoons melted butter together in a bowl; sprinkle over squash mixture.\nBake in the preheated oven until gratin is bubbling and breadcrumbs are browned, 20 to 25 minutes.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "1080383.jpg",
    "o": "",
    "st": "allrecipes"
}