{
    "id": 22823,
    "old_rating": "4.68923",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 cups unbleached all-purpose flour",
        "1 tablespoon light brown sugar",
        "1 1/3 cups warm water (110 degrees F/45 degrees C)",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons olive oil",
        "1 (.25 ounce) package active dry yeast",
        "1 egg",
        "1 tablespoon water",
        "2 tablespoons cornmeal"
    ],
    "nut": [
        "Calories > 105 kcal",
        "Carbs > 20.6 g",
        "Cholesterol > 9 mg",
        "Fat > 0.9 g",
        "Protein > 3.1 g",
        "Sodium > 179 mg"
    ],
    "n": "Italian Bread Using a Bread Machine",
    "a": "Destiny",
    "r": "0",
    "s": 20,
    "des": "\"Wonderful Italian bread made in a bread machine then baked in the oven.\"",
    "ins": "Place flour, brown sugar, warm water, salt, olive oil and yeast in the pan of the bread machine in the order recommended by the manufacturer. Select dough cycle; press Start.\nDeflate the dough and turn it out onto a lightly floured surface. Form dough into two loaves. Place the loaves seam side down on a cutting board generously sprinkled with cornmeal.  Cover the loaves with a damp cloth and let rise, until doubled in volume about 40 minutes. Meanwhile, preheat oven to 375 degrees F (190 degrees C).\nIn a small bowl, beat together egg and 1 tablespoon water. Brush the risen loaves with egg mixture. Make a single long, quick cut down the center of the loaves with a sharp knife. Gently shake the cutting board to make sure that the loaves are not sticking. If they stick, use a spatula or pastry knife to loosen. Slide the loaves onto a baking sheet with one quick but careful motion.\nBake in preheated oven for 30 to 35 minutes, or until loaves sound hollow when tapped on the bottom.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "3 h ",
    "i": "178935.jpg",
    "o": "4471820.jpg,4459787.jpg,4459494.jpg,4124828.jpg,4115363.jpg",
    "st": "allrecipes"
}