{
    "id": 228303,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup water",
        "1/2 cup granular sucrolose sweetener (such as SplendaÂ®)",
        "1 tablespoon cornstarch",
        "1 1/4 cups blueberries, mashed",
        "1 tablespoon lemon juice",
        "1 quart half-and-half",
        "1 cup milk",
        "1 cup granular sucralose sweetener (such as SplendaÂ®)",
        "1/2 cup sugar-free French vanilla liquid coffee creamer",
        "1 (1 ounce) package fat-free, sugar-free cheesecake pudding mix",
        "2 teaspoons vanilla extract"
    ],
    "nut": [
        "Calories > 120 kcal",
        "Carbs > 9.3 g",
        "Cholesterol > 23 mg",
        "Fat > 8.1 g",
        "Protein > 2.4 g",
        "Sodium > 111 mg"
    ],
    "n": "Blueberry Cheesecake Ice Cream-My Way",
    "a": "buttercup904",
    "r": "0",
    "s": 16,
    "des": "\"When unable to find any sugar-free ice cream at my local grocery, this recipe adapted easily to my dietary needs. It also offered great variety by using different fruits, nuts, flavorings, and pudding mixes.\"",
    "ins": "Stir water, 1/2 cup sucralose sweetener, and cornstarch together in a small saucepan over medium heat until sugar and cornstarch dissolve completely. Stir blueberries and lemon juice into the liquid; bring to a boil, reduce heat to medium-low, and cook at a simmer until slightly thickened, about 5 minutes. Transfer the blueberry mixture to a bowl, cover with plastic wrap, and refrigerate until chilled completely, about 1 hour.\nWhisk half-and-half, milk, 1 cup sucralose sweetener, coffee creamer, pudding mix, and vanilla extract together in a large mixing bowl. Fill ice cream maker 2/3-full; freeze according to manufacturer's directions. Refrigerate remaining mixture.\nTransfer finished ice cream from ice cream maker to a large bowl; keep in freezer.\nWhisk remaining half-and-half mixture and pour into ice cream maker; freeze according to manufacturer's directions.\nTop first batch of ice cream with the blueberry mixture; add the second batch of ice cream. Swirl together and freeze until ready to serve.",
    "pt": "25 m",
    "ct": "10 m",
    "tt": "6 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}