{
    "id": 228321,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter",
        "1 cup white sugar",
        "2 (1 ounce) squares unsweetened baking chocolate, chopped",
        "2 eggs",
        "3/4 cup all-purpose flour",
        "1 tablespoon brandy-based orange liqueur (such as Grand MarnierÂ®) (optional)",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon salt",
        "1/4 cup butter",
        "1 (1 ounce) square unsweetened baking chocolate, chopped",
        "1 tablespoon brandy-based orange liqueur (such as Grand MarnierÂ®)",
        "1/2 cup confectioners' sugar",
        "1 1/2 cups chocolate confectioners' coating",
        "1/4 cup bittersweet chocolate chips"
    ],
    "nut": [
        "Calories > 186 kcal",
        "Carbs > 20.8 g",
        "Cholesterol > 30 mg",
        "Fat > 12.2 g",
        "Protein > 2.3 g",
        "Sodium > 70 mg"
    ],
    "n": "Brownie Pops",
    "a": "michellekb",
    "r": "0",
    "s": 25,
    "des": "\"Brownie lollipops - a delicious brownie-candy combination! Easy to make and versatile enough to decorate for any occasion! Substitute white chocolate coating for chocolate if you like. Decorate with sprinkles or your favorite topping.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking pan.\nPlace 1/2 cup butter and white sugar in a microwave-safe bowl. Heat in microwave on high until butter is melted, about 1 minute. Stir 2 ounces baking chocolate into butter-sugar mixture until chocolate melts. Stir in eggs; mix well. Add flour, 1 tablespoon orange liqueur, vanilla extract, and salt; stir to combine. Pour batter into the prepared baking dish.\nBake in the preheated oven until the top is dry and the edges have started to pull away from the sides of the pan, 20 to 25 minutes. Remove from oven and cool completely.\nPlace remaining 1/4 cup butter in a large microwave-safe bowl. Heat in microwave on high until melted, about 30 seconds. Stir 1 ounce baking chocolate into melted butter until chocolate melts. Stir in orange liqueur and 1/2 cup confectioners' sugar. Crumble the cooled brownies into the mixture; stir to combine.\nForm brownie mixture into 1-inch balls; arrange on a baking sheet. Refrigerate until firm, about 2 hours. Insert a lollipop stick into each brownie ball.\nMelt chocolate coating and chocolate chips in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Keep warm.\nDip each brownie pop into the chocolate coating, allowing excess chocolate to drip back into the saucepan. Transfer the coated brownie pops onto a baking sheet or set upright into a piece of craft foam. Allow coating to set, about 1 hour.",
    "pt": "45 m",
    "ct": "25 m",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}