{
    "id": 228319,
    "old_rating": "4.49142",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "1/2 sleeve buttery round crackers (such as RitzÂ®), crushed",
        "2 tablespoons butter",
        "1 pound thick-cut cod loin",
        "1/2 lemon, juiced",
        "1/4 cup dry white wine",
        "1 tablespoon chopped fresh parsley",
        "1 tablespoon chopped green onion",
        "1 lemon, cut into wedges"
    ],
    "nut": [
        "Calories > 280 kcal",
        "Carbs > 9.3 g",
        "Cholesterol > 71 mg",
        "Fat > 16.1 g",
        "Protein > 20.9 g",
        "Sodium > 282 mg"
    ],
    "n": "Perfect Ten Baked Cod",
    "a": "Pam",
    "r": "0",
    "s": 4,
    "des": "\"Simple, fast, and delicious describes this baked cod recipe. Bake for two sets of 10 minutes each and you have the perfect ten dinner! This recipe was a favorite request from a local restaurant. They closed after years in business and we are happy to share a version of their most requested recipe. I serve this with rice pilaf and fresh spinach that has been lightly seared in olive oil and garlic. Yummy!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPlace 2 tablespoons butter in a microwave-safe bowl; melt in microwave on high, about 30 seconds. Stir buttery round crackers into melted butter.\nPlace remaining 2 tablespoons butter in a 7x11-inch baking dish. Melt in the preheated oven, 1 to 3 minutes. Remove dish from oven.\nCoat both sides of cod in melted butter in the baking dish.\nBake cod in the preheated oven for 10 minutes. Remove from oven; top with lemon juice, wine, and cracker mixture. Place back in oven and bake until fish is opaque and flakes easily with a fork, about 10 more minutes.\nGarnish baked cod with parsley and green onion. Serve with lemon wedges.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "35 m",
    "i": "4541530.jpg",
    "o": "4541530.jpg,4540066.jpg,4538733.jpg,4535987.jpg,4534501.jpg,4533499.jpg",
    "st": "allrecipes"
}