{
    "id": 228381,
    "old_rating": "4.58333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 recipe pastry for a single 9-inch pie crust",
        "3 tomatoes, thinly sliced",
        "2 teaspoons salt",
        "3 cloves garlic, minced",
        "1/4 cup chopped fresh basil",
        "1/2 cup shredded Cheddar cheese",
        "1/2 cup shredded mozzarella cheese",
        "1/4 cup mayonnaise"
    ],
    "nut": [
        "Calories > 221 kcal",
        "Carbs > 13.3 g",
        "Cholesterol > 15 mg",
        "Fat > 16.5 g",
        "Protein > 5.5 g",
        "Sodium > 828 mg"
    ],
    "n": "Summer Tomato Pie",
    "a": "Elizabeth",
    "r": "0",
    "s": 8,
    "des": "\"This is a simple but delicious side dish. It could also be a main course for a vegetarian. \n\nIt's great for using all those wonderful summer tomatoes from the garden! You can change the cheeses to fit your taste as well as the seasoning.  Blue cheese and fennel, Swiss cheese and thyme, Gouda and dill, whatever your favorites are.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nPress pie crust into a 9-inch pie pan; prick bottom and sides with fork.\nBake crust in the preheated oven until lightly browned, 10 to 12 minutes. Cool completely.\nReduce oven temperature to 350 degrees F (175 degrees C).\nPlace tomatoes in a single layer of a colander; sprinkle with salt. Let sit for about 10 minutes to release moisture. Blot excess moisture with a paper towel. Arrange 1 layer of tomato slices around the bottom of the cooled pie crust, overlapping the slices. Sprinkle half the garlic and half the basil onto tomato layer. Sprinkle half the Cheddar cheese and half the mozzarella cheese over basil layer. Repeat layering with remaining tomatoes, garlic, basil, Cheddar cheese, and mozzarella cheese. Spread mayonnaise over the top mozzarella cheese layer.\nBake in the preheated oven until cheese is melted and bubbling, about 30 minutes. Cool on a wire rack.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "1014136.jpg",
    "o": "4530757.jpg,4516854.jpg,3977512.jpg,3969968.jpg,3925807.jpg,3916478.jpg",
    "st": "allrecipes"
}