{
    "id": 228332,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup water",
        "1 cup oats",
        "1 1/2 cups water",
        "1 cup millet",
        "1/2 cup diced onion",
        "1/2 cup diced carrot",
        "1/2 cup diced celery",
        "1/2 cup diced potato",
        "1/4 cup safflower oil",
        "1/4 cup tamari sauce",
        "1 teaspoon ground allspice",
        "1/4 teaspoon ground nutmeg",
        "4 whole cloves",
        "salt and ground black pepper to taste",
        "1 recipe pastry for a 9-inch double crust pie",
        "1 egg, beaten (optional)"
    ],
    "nut": [
        "Calories > 340 kcal",
        "Carbs > 40 g",
        "Cholesterol > 23 mg",
        "Fat > 16.8 g",
        "Protein > 7.7 g",
        "Sodium > 642 mg"
    ],
    "n": "Millet Pie",
    "a": "kphanie",
    "r": "0",
    "s": 8,
    "des": "\"This is the best meatless meat pie you'll ever have! Millet and oats are the base, Christmas meat pie spices are the secret! Even non-vegetarians will be fooled! This makes a pretty big pie, it is possible to make two with this much filling. Serve with ketchup, fruit, onion chutney, or anything that means 'Holidays' to you!\"",
    "ins": "Bring 1 cup water and oats to a boil in a saucepan; reduce heat and simmer until water is absorbed, 10 minutes. Bring 1 1/2 cups water and millet to a boil in a separate saucepan; reduce heat and simmer until water is absorbed and millet is tender, 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine oats, millet, onion, carrot, celery, potato, safflower oil, tamari, allspice, nutmeg, cloves, salt, and black pepper together in a large bowl; mix well.\nPress 1 pie crust pastry into a 9-inch pie pan. Pour filling into pie crust. Top with second pie crust pastry; pinch edges together. Pierce a few areas of the top crust to allow pie to ventilate during baking. Brush top crust with beaten egg.\nBake pie in the preheated oven until crust is golden brown, about 40 minutes.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4016774.jpg",
    "o": "",
    "st": "allrecipes"
}