{
    "id": 228363,
    "old_rating": "4.67949",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 teaspoon kosher salt",
        "1/2 teaspoon caraway seeds",
        "1/2 teaspoon dried sage",
        "1/4 teaspoon fennel seeds",
        "1/4 teaspoon coriander seeds",
        "1/4 teaspoon dried rosemary",
        "2 tablespoons paprika",
        "2 teaspoons garlic powder",
        "2 teaspoons all-purpose flour",
        "1 teaspoon onion powder",
        "5 tablespoons vegetable oil",
        "1 (4 pound) broiler-fryer chicken, cut in half lengthwise"
    ],
    "nut": [
        "Calories > 495 kcal",
        "Carbs > 3.1 g",
        "Cholesterol > 129 mg",
        "Fat > 34.5 g",
        "Protein > 41.5 g",
        "Sodium > 446 mg"
    ],
    "n": "Crispy Roasted Chicken",
    "a": "Doc Simonson",
    "r": "0",
    "s": 6,
    "des": "\"This oven-roasted chicken is inspired by the Brathaehnchen served commonly in Bavarian Biergartens, small shops, and food carts. You can serve this chicken with many side dishes, but favorites are fried potatoes or spaetzle and a nice garden salad. Weiss beer doesn't hurt at all!\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nIn a spice grinder or mortar, combine kosher salt, caraway seeds, sage, fennel, coriander, and rosemary. Grind to a coarse powder. Transfer spice mixture to a bowl and stir in paprika, garlic powder, flour, and onion powder; mix in vegetable oil to make a smooth paste.\nPat chicken halves dry with paper towels and tuck wing tips up behind the back. Brush spice paste onto chicken halves, coating both sides, taking care to season under wings and legs. Place chicken halves in baking dish or roasting pan with skin sides up, leaving space around chicken so halves aren't touching.\nRoast in preheated oven until a thermometer inserted in a thigh reads 165 degrees F (74 degrees C), about 1 hour. Remove from oven and let rest for 10 minutes before slicing.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1000798.jpg",
    "o": "4483552.jpg,2958537.jpg,2806183.jpg,2793716.jpg,2067331.jpg,2067328.jpg",
    "st": "allrecipes"
}