{
    "id": 228450,
    "old_rating": "4.41629",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups peeled and cubed potatoes",
        "2 stalks celery, chopped",
        "1 large carrot, sliced",
        "3 cups water",
        "3 tablespoons butter",
        "2 cups cubed fully cooked ham",
        "2 tablespoons chopped green bell pepper",
        "2 teaspoons chopped onion",
        "1/4 cup butter",
        "3 tablespoons all-purpose flour",
        "1 cup milk, or more as needed",
        "1/8 teaspoon salt",
        "1/8 teaspoon ground black pepper",
        "1 cup shredded Cheddar cheese",
        "1/2 cup dry bread crumbs"
    ],
    "nut": [
        "Calories > 304 kcal",
        "Carbs > 16.9 g",
        "Cholesterol > 60 mg",
        "Fat > 21.1 g",
        "Protein > 12 g",
        "Sodium > 641 mg"
    ],
    "n": "Ham Casserole",
    "a": "Jodster",
    "r": "0",
    "s": 8,
    "des": "\"This is true comfort food. I'm from the Midwest so we're big on casseroles and one dish meals. Especially during winter.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace potatoes, celery, and carrot in a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and transfer to a 2-quart baking dish.\nMelt 3 tablespoons butter in a large skillet over medium heat; cook and stir ham, green bell pepper, and onion until vegetables are tender, about 5 minutes. Transfer ham mixture to baking dish and mix with potatoes.\nMelt remaining 1/4 cup butter in a clean skillet; cook and stir flour in melted butter until smooth, about 3 minutes. Gradually stir in milk and season with salt and black pepper. Bring to a boil, stirring constantly, until thickened, about 2 minutes. Add Cheddar cheese; stir until melted. Pour cheese mixture over ham and potatoes. Sprinkle with bread crumbs.\nBake in preheated oven until bubbly, 25 to 30 minutes. Allow casserole to rest for 5 to 10 minutes before serving.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1081675.jpg",
    "o": "4507675.jpg,4506270.jpg,4390606.jpg,3438368.jpg,3045164.jpg,2906964.jpg",
    "st": "allrecipes"
}