{
    "id": 228430,
    "old_rating": "4.63333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 package active dry yeast",
        "1 1/4 cups warm water (100 to 110 degrees F/40 to 45 degrees C)",
        "3 1/2 cups all-purpose flour, or as needed - divided",
        "1 1/2 teaspoons salt",
        "1/4 cup vegetable shortening"
    ],
    "nut": [
        "Calories > 172 kcal",
        "Carbs > 28 g",
        "Cholesterol > 0 mg",
        "Fat > 4.7 g",
        "Protein > 4 g",
        "Sodium > 292 mg"
    ],
    "n": "Traditional Pita Breads",
    "a": "Dennis Morazan",
    "r": "0",
    "s": 12,
    "des": "\"This is a great pita bread recipe I got from a friend who works at a great Greek restaurant here in my town. Slice pita in half and fill pockets with your favorite filling, or for dipping, cut into wedges and pan fry in a little olive oil.\"",
    "ins": "Sprinkle yeast over warm water in a mixing bowl and allow to stand until the yeast forms a creamy foam, about 5 minutes. Mix in 2 cups of flour, salt, and shortening; beat for 2 minutes with a fork. Stir in as much of the remaining 1 1/2 cup flour as needed.\nTurn dough out onto a floured surface and knead until smooth and elastic, kneading in more flour if dough is sticky. Form into a ball, cover with a kitchen towel, and let rest in a warm area for 15 minutes.\nPreheat oven to 500 degrees F (260 degrees C).\nDivide dough into 12 equal portions; flour your hands and roll each piece into a ball. Cover dough balls with a kitchen towel and let rest for 10 minutes. Flatten the balls into rounds on a floured surface, cover with kitchen towel, and let rest 10 more minutes. Gently roll each dough ball into a circle about 6 inches in diameter on a floured surface. Place pita breads in a single layer on ungreased baking sheets.\nBake in preheated oven until the pita breads puff up, 3 to 4 minutes. Flip breads over with a spatula, return to oven, and bake 2 more minutes. Let cool on wire racks before cutting pita breads in half and gently separating  tops and bottoms to form pockets for filling.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "4462469.jpg",
    "o": "",
    "st": "allrecipes"
}