{
    "id": 228488,
    "old_rating": "4.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup vegetable oil",
        "1 (4 to 6 pound) whole chicken, cut into pieces",
        "1 onion, chopped",
        "1 green bell pepper, chopped",
        "2 cloves garlic, minced",
        "2 cloves garlic",
        "1 (14.5 ounce) can stewed tomatoes",
        "1 cup rice",
        "2 teaspoons salt, or to taste",
        "1 teaspoon dried oregano",
        "1/2 teaspoon ground black pepper",
        "1 bay leaf",
        "2 cups chicken stock, or as needed to cover",
        "1 cup green peas",
        "1/2 cup sliced black olives",
        "1/2 cup raisins",
        "1/4 cup chopped pimento peppers"
    ],
    "nut": [
        "Calories > 535 kcal",
        "Carbs > 36.3 g",
        "Cholesterol > 142 mg",
        "Fat > 20.2 g",
        "Protein > 50.5 g",
        "Sodium > 1105 mg"
    ],
    "n": "Arroz Con Pollo",
    "a": "RPOVARCHUK",
    "r": "0",
    "s": 8,
    "des": "\"Wonderful homey chicken dish. This is a recipe from a relative in Panama. Fluff the rice carefully with a fork before serving, and enjoy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat vegetable oil in a Dutch oven over medium heat; cook and stir chicken pieces until browned, 5 to 10 minutes. Remove chicken with a slotted spoon and place on a plate. Cook and stir onion, green bell pepper, minced garlic, and whole garlic cloves in the same Dutch oven until onion is softened, about 5 minutes.\nReturn chicken to the onion mixture. Add tomatoes, rice, salt, oregano, black pepper, and bay leaf. Pour in enough chicken stock to cover all the ingredients.\nBake chicken-rice mixture in the preheated oven until rice is tender and chicken is no longer pink in the center and the juices run clear, about 1 hour and 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\nStir peas, olives, raisins, and pimento peppers into the chicken-rice mixture. Bake until warmed through, an additional 15 minutes.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "3482170.jpg",
    "o": "4106642.jpg,4082604.jpg,3542684.jpg,3542662.jpg,3427808.jpg,3175156.jpg",
    "st": "allrecipes"
}