{
    "id": 228415,
    "old_rating": "4.54545",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups whole wheat flour",
        "1/2 cup white sugar",
        "2 teaspoons baking powder",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon salt",
        "1 cup skim milk",
        "1 egg",
        "2 tablespoons butter, softened",
        "1 tablespoon vegetable oil",
        "2 cups fresh blueberries",
        "1/2 cup brown sugar (optional)",
        "1/2 teaspoon ground cinnamon (optional)"
    ],
    "nut": [
        "Calories > 321 kcal",
        "Carbs > 60.1 g",
        "Cholesterol > 42 mg",
        "Fat > 7.7 g",
        "Protein > 7 g",
        "Sodium > 321 mg"
    ],
    "n": "Jumbo Whole Wheat Blueberry Muffins",
    "a": "LisaAnn",
    "r": "0",
    "s": 6,
    "des": "\"I received free blueberries recently. I admit I never actually tasted a real one before. Always the boxed muffin kind. I loved them. Recently switched to whole wheat, so I wanted to try a new muffin recipe out. This is the one that not only turned out great, but filling as well. When I was eating it, I was craving eggs. Next time I will have to remember to throw in a fried egg or two on the side. I made 6 jumbo muffins.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line 6 jumbo muffin cups with paper liners.\nWhisk whole wheat flour, white sugar, baking powder, 1/2 teaspoon cinnamon, and salt together in a bowl. In a separate bowl, whisk skim milk, egg, softened butter, and vegetable oil. Mix the liquid ingredients into the whole wheat flour mixture to make a smooth batter, and gently fold in blueberries. Spoon batter into the prepared muffin cups, filling them to the top.\nCombine brown sugar with 1/2 teaspoon cinnamon in a bowl and spoon the mixture onto the muffins, if desired.\nBake in the preheated oven until the muffins are golden brown and a toothpick inserted into the center of a muffin comes out clean, 20 to 25 minutes.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "3293516.jpg",
    "o": "",
    "st": "allrecipes"
}