{
    "id": 228434,
    "old_rating": "4.47826",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/2 cups all-purpose flour",
        "3/4 cup unsweetened cocoa powder",
        "1 teaspoon baking soda",
        "1 cup white sugar",
        "1 cup firmly packed brown sugar",
        "1 cup butter, softened",
        "2 teaspoons vanilla extract",
        "2 eggs",
        "48 chocolate-covered caramel candies (such as RoloÂ®)",
        "2 tablespoons white sugar",
        "4 ounces chocolate almond bark (chocolate confectioners coating) (optional)"
    ],
    "nut": [
        "Calories > 125 kcal",
        "Carbs > 18.1 g",
        "Cholesterol > 18 mg",
        "Fat > 5.8 g",
        "Protein > 1.6 g",
        "Sodium > 64 mg"
    ],
    "n": "RoloÂ®-Filled Chocolate Cookies",
    "a": "Malorylarson",
    "r": "0",
    "s": 48,
    "des": "\"A family favorite and always the first to go at bake sales. These cookies are soft and fudgy with warm caramel in the middle. Best served warm.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nMix flour, cocoa powder, and baking soda together in a small bowl. Beat 1 cup white sugar, brown sugar, and butter together in a large bowl until light and fluffy. Add vanilla extract and eggs; beat well. Stir flour mixture into sugar mixture; mix well.\nLightly flour hands. Shape about 1 tablespoon dough around 1 chocolate-covered caramel candy, covering it completely. Repeat with remaining dough and caramel candies.\nPlace 2 tablespoons white sugar in a small bowl. Press one side of each ball into sugar. Place balls, sugar sides up, onto a baking sheet, about 2 inches apart.\nBake in the preheated oven until cookie is set and slightly cracked, 7 to 10 minutes. Cool on the baking sheet for about 2 minutes. Transfer cookies to a wire rack to cool completely.\nMelt almond bark in a saucepan over low heat. Drizzle over cookies.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "4509992.jpg",
    "o": "",
    "st": "allrecipes"
}