{
    "id": 228464,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 quarts water, or as needed",
        "1 cup whole wheat berries",
        "1/8 teaspoon salt",
        "3 1/2 cups walnut pieces",
        "2 cups confectioners' sugar",
        "Garnish:",
        "2 tablespoons blanched slivered almonds",
        "1/4 cup cold heavy whipping cream"
    ],
    "nut": [
        "Calories > 172 kcal",
        "Carbs > 17.9 g",
        "Cholesterol > 3 mg",
        "Fat > 10.9 g",
        "Protein > 3.1 g",
        "Sodium > 16 mg"
    ],
    "n": "Zito (Zhito/Koljivo) - Serbian Wheat Pudding",
    "a": "Vesna",
    "r": "0",
    "s": 24,
    "des": "\"This simple, hearty dessert of cooked, ground wheat fortified with ground nuts and sugar is central to Serbian culture. It symbolizes life and death, harvest and renewal, and is presented at certain special occasions: Slava (the family's saint day), Christmas, and memorial services. Serve by the heaping tablespoon in very small, decorative bowls, like custard cups, topped with a dollop of whipped cream.\"",
    "ins": "Bring a kettle of water to boil. Continue to refill and heat as needed as the source for water in boiling the wheat.\nPlace wheat berries in a 2- to 3-quart saucepan. Cover with water, about two inches above the level of the berries. Bring to a rolling boil and let boil for 15 seconds. Drain; discard water.\nAdd new water to the wheat, the same amount as before. Repeat until you've brought wheat and water to a boil seven times. During the seventh boil, add the salt. Do not drain.\nRemove the pan from the heat, cover, and wrap with towels (see Cook's Note). Let rest at room temperature overnight.\nThe next day, drain any water that hasn't been absorbed overnight. Grind the wheat berries thoroughly in a food processor or a meat grinder. (If you use a blender, you must work in very small batches.) Transfer wheat to a bowl and set aside. Grind the walnuts until fine; add the confectioners' sugar and process until nuts form a fine meal. Add the ground wheat and pulse until mixed.\nSpoon koljivo into a serving dish, preferably a clear glass trifle bowl with straight sides. Garnish by sticking slivered almonds all over the top, like a porcupine.\nWhip the cream in a glass or metal bowl with electric mixer on high speed until stiff peaks form. Serve by the heaping tablespoon in small decorative bowls or custard cups, topped with a dollop of whipped cream.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "9 h",
    "i": "2302708.jpg",
    "o": "",
    "st": "allrecipes"
}