{
    "id": 228592,
    "old_rating": "4.69231",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup shredded Cheddar cheese",
        "1 (9 inch) unbaked pastry shell",
        "1 cup diced cooked chicken",
        "1 cup chopped fresh spinach",
        "1/2 cup chopped sweet onion (such as VidaliaÂ®)",
        "3/4 cup shredded Cheddar cheese",
        "3 eggs",
        "3/4 cup half-and-half",
        "1/2 cup mayonnaise",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground black pepper",
        "1 pinch salt-free seasoning blend (such as Mrs. Dash), or to taste",
        "1 pinch herbes de Provence, or to taste"
    ],
    "nut": [
        "Calories > 352 kcal",
        "Carbs > 13.1 g",
        "Cholesterol > 107 mg",
        "Fat > 28.4 g",
        "Protein > 11.5 g",
        "Sodium > 402 mg"
    ],
    "n": "Spinach Quiche with Chicken",
    "a": "wetteland",
    "r": "0",
    "s": 8,
    "des": "\"Quiche works very well. Add seasonings of your family's choice for more variety. Use ham, bacon, or whatever protein. This quiche needs flavor boosters, so use your spice cabinet. Easily make this a Tex-Mex dish with diced green chiles and a touch of cumin. You could also add crumbled freshly cooked bacon to add more flavor. I served this with sliced avocado and tomatoes for a perfect light dinner.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nSprinkle 1/4 cup Cheddar cheese in pastry shell. Mix chicken, spinach, onion, and remaining 3/4 cup Cheddar cheese in a bowl; transfer mixture to pastry shell.\nWhisk eggs, half-and-half, mayonnaise, salt, black pepper, seasoning blend, and herbes de Provence in another bowl; pour over chicken mixture.\nBake in the preheated oven until a knife inserted into the center comes out clean, 35 to 40 minutes. Let stand for 15 minutes before slicing and serving.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "880904.jpg",
    "o": "4484898.jpg,4484897.jpg,4220649.jpg,3615763.jpg,3529742.jpg,2250825.jpg",
    "st": "allrecipes"
}