{
    "id": 228566,
    "old_rating": "4.60256",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 carrots, peeled and chopped",
        "1/2 head cauliflower, trimmed and chopped",
        "1 1/2 teaspoons olive oil",
        "2 cloves garlic, chopped",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "3 cups vegetable broth, or more if needed",
        "1 tablespoon curry powder",
        "1 cup coconut milk",
        "1/2 lime, juiced"
    ],
    "nut": [
        "Calories > 143 kcal",
        "Carbs > 13.4 g",
        "Cholesterol > 0 mg",
        "Fat > 9.8 g",
        "Protein > 3 g",
        "Sodium > 680 mg"
    ],
    "n": "Roasted Carrot and Cauliflower Curried Soup",
    "a": "jes5ika",
    "r": "0",
    "s": 6,
    "des": "\"This restaurant-quality soup is hearty and very tasty! I didn't have onions at home when I made this. Although the soup turned out really flavorful without them, I will probably add an onion or two next time I make it. Garnish with basil, wonton noodles, and sour cream.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPlace carrots and cauliflower in a casserole dish; toss with olive oil, garlic, salt, and black pepper.\nRoast carrot mixture in the preheated oven for 20 minutes; stir and roast until vegetables are tender and slightly charred, another 25 minutes. Remove from oven and stir.\nBring vegetable broth to a boil in a large pot. Stir in curry powder and add the roasted vegetables. Cover and boil soup until vegetables are soft, 8 to 10 minutes. Remove from heat.\nBlend the soup with a potato masher or an immersion blender until smooth. Return pot to burner on medium heat. Stir coconut milk and lime juice into soup; simmer until heated through, 5 to 10 minutes.",
    "pt": "10 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1105612.jpg",
    "o": "4212970.jpg,3553457.jpg,3173997.jpg,2265986.jpg,1597204.jpg,1586031.jpg",
    "st": "allrecipes"
}