{
    "id": 228535,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup raw cleaned pumpkin seeds (preferably from a sugar pumpkin)",
        "4 cups water",
        "4 teaspoons salt",
        "1 tablespoon unsalted butter",
        "1 tablespoon white sugar",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground cloves",
        "1/8 teaspoon ground cardamom",
        "1 tablespoon white sugar, or to taste"
    ],
    "nut": [
        "Calories > 62 kcal",
        "Carbs > 7.8 g",
        "Cholesterol > 4 mg",
        "Fat > 3 g",
        "Protein > 1.5 g",
        "Sodium > 1168 mg"
    ],
    "n": "Pumpkin Pie Seeds",
    "a": "cr0ybot",
    "r": "0",
    "s": 8,
    "des": "\"The pumpkins are carved, the pies are baked, but how should you toast those pumpkin seeds? My favorite variation by far are these sweet pumpkin pie-spiced seeds. \nI've tried the stovetop method for coating the seeds, but they were too sticky and hard for my tastes, and easy to burn too. Try this baking method instead and they'll turn out perfectly toasted and crunchy.\"",
    "ins": "Place pumpkin seeds, water, and salt in a saucepan, bring to a boil, and reduce heat to medium; boil seeds for 10 minutes. Drain seeds but do not rinse. Pat seeds dry with paper towels and spread out onto a work surface or a baking sheet for 30 minutes to dry.\nPreheat oven to 250 degrees F (120 degrees C). Line a baking sheet with aluminum foil.\nMelt butter in a large microwave-safe bowl until melted, about 1 minute. Toss seeds in the melted butter and mix in 1 tablespoon sugar, cinnamon, ginger, nutmeg, cloves, and cardamom; toss again to coat seeds thoroughly with spices. Spread seeds out onto the prepared baking sheet in a single layer.\nBake in the preheated oven until toasted and crunchy, 45 minutes to 1 hour. Stir several times during baking. Sprinkle toasted seeds with 1 tablespoon sugar or as desired; cool before serving.",
    "pt": "10 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "882009.jpg",
    "o": "",
    "st": "allrecipes"
}