{
    "id": 228542,
    "old_rating": "3.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "1 large spaghetti squash, halved and seeded",
        "1 acorn squash, halved and seeded",
        "1 large sweet potato",
        "3 cups baby carrots",
        "1 onion, diced",
        "1/4 cup honey",
        "1 teaspoon ground cinnamon",
        "1 pinch salt",
        "1 pinch ground black pepper",
        "1/3 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 230 kcal",
        "Carbs > 49.5 g",
        "Cholesterol > 6 mg",
        "Fat > 3.4 g",
        "Protein > 5 g",
        "Sodium > 148 mg"
    ],
    "n": "Roasted Vegetables with Spaghetti Squash",
    "a": "Gila",
    "r": "0",
    "s": 8,
    "des": "\"This is a great fall dish. Roasted veggies sit on a bed of spaghetti squash and are topped with a little melted cheese. Note: vegetables can easily be substituted. I have made this many times with whatever is on hand. However, when I can, I try to use mostly root vegetables in yellow and orange colors.\"",
    "ins": "Preheat oven to 400 degrees F (205 degrees C). Coat a large baking sheet with cooking spray.\nPlace spaghetti squash and acorn squash, cut sides down, on baking sheet. Place sweet potato on baking sheet.\nBake until squash and sweet potato are tender when pierced by a fork, about 45 minutes.\nTurn oven down to 350 degrees (170 degrees C). Coat a 9x13 baking dish with cooking spray.\nScrape strands from the spaghetti squash and place into prepared pan in an even layer.\nCut sweet potato into bite-size chunks; place into a large bowl. Scoop bite-size chunks of flesh from the acorn squash; add to bowl. Stir baby carrots, diced onion, honey, cinnamon, salt, and black pepper into squash mixture and mix well. Transfer squash mixture to the baking pan and spread evenly over spaghetti squash. Sprinkle Cheddar cheese over the top.\nBake at 350 degrees until cheese is bubbly and brown, about 45 minutes.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1060097.jpg",
    "o": "",
    "st": "allrecipes"
}