{
    "id": 228543,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1/2 spaghetti squash, halved and seeded",
        "1/4 cup broccoli florets, chopped",
        "1 1/2 cups spinach leaves",
        "4 (10 inch) flour tortillas",
        "1 teaspoon miso paste",
        "1/4 cup olive oil, or as needed"
    ],
    "nut": [
        "Calories > 373 kcal",
        "Carbs > 43.2 g",
        "Cholesterol > 0 mg",
        "Fat > 19.6 g",
        "Protein > 7 g",
        "Sodium > 525 mg"
    ],
    "n": "Asian Vegetable Roll",
    "a": "KN Granger",
    "r": "0",
    "s": 4,
    "des": "\"A quick and easy way to make your own 'egg-roll'-style vegetable roll! Serve with soy sauce, teriyaki, or plum sauce for dipping.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Coat a baking sheet with cooking spray.\nPlace spaghetti squash half cut-side down on the prepared baking sheet.\nBake until the squash is tender and the flesh shreds easily, about 40 minutes. Shred strands of flesh from rind and place in bowl.\nPlace broccoli in a steamer basket over a pan of boiling water. Steam until tender, about 8 minutes. Add spinach to steamer basket for last 2 minutes. Place broccoli and spinach in separate bowls.\nSpread 1/4 teaspoon miso paste down the center of each tortilla. Place 2 tablespoons of spaghetti squash, 1 tablespoon of spinach, and 1 tablespoon of broccoli florets over the miso paste down the center of the tortillas. Fold up the sides of the tortillas around the filling, then fold up the ends to enclose the filling.\nHeat 1/4 cup of olive oil in a skillet over high heat.\nPlace one rolled tortilla, seam side down, in the frying pan. Gently press the tortilla with a spatula. Cook until the tortilla is golden brown, about 2 or 3 minutes per side, turning once. Fry the remaining tortillas in the same manner, adding olive oil as needed.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}