{
    "id": 228517,
    "old_rating": "4.18182",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 egg",
        "3 tablespoons butter, melted",
        "1 tablespoon vanilla extract",
        "1 tablespoon white sugar",
        "1 1/4 cups milk",
        "1/4 cup heavy cream",
        "1 1/2 cups all-purpose flour",
        "3 1/2 teaspoons baking powder",
        "1 teaspoon salt",
        "1/4 cup white sugar",
        "2 tablespoons brown sugar",
        "1/4 teaspoon ground cinnamon",
        "1 teaspoon butter, or as needed"
    ],
    "nut": [
        "Calories > 231 kcal",
        "Carbs > 31.9 g",
        "Cholesterol > 49 mg",
        "Fat > 9.2 g",
        "Protein > 4.7 g",
        "Sodium > 567 mg"
    ],
    "n": "Creme Brulee Pancakes",
    "a": "CoveredinBeeees",
    "r": "0",
    "s": 8,
    "des": "\"My girlfriend's love of pancakes and creme brulee ice cream made me decide to try and combine the two. The crunchy sugar crust is a nice addition to the traditional pancake. These pancakes are light, fluffy, and so rich and sweet they don't need syrup.\"",
    "ins": "Whisk egg with 3 tablespoons melted butter, vanilla extract, and 1 tablespoon white sugar in a bowl until thoroughly combined; whisk in milk and cream. Sift flour with baking powder and salt in a separate bowl; stir flour mixture into liquid ingredients to make a smooth batter.\nStir 1/4 cup white sugar with brown sugar and cinnamon in a small bowl.\nMelt 1 teaspoon butter in a skillet over medium-low heat. Scoop up about 3 tablespoons of batter and pour into skillet. Sprinkle top of pancake with about 2 teaspoons of cinnamon sugar in an even layer; cook pancake until bottom is golden brown, 2 to 3 minutes. Flip pancake over onto sugared side and cook until the cinnamon sugar melts into a crust, about 3 minutes. Repeat with remaining batter and cinnamon sugar. Let pancakes cool without stacking to avoid softening the sugar crust.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "1089110.jpg",
    "o": "",
    "st": "allrecipes"
}