{
    "id": 228649,
    "old_rating": "4.15385",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "1/4 white onion, chopped",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon dried oregano",
        "1 (26 ounce) jar chunky tomato sauce (such as RaguÂ®)",
        "3 tablespoons white sugar",
        "18 lasagna noodles",
        "1 (15 ounce) container ricotta cheese",
        "1 egg, beaten",
        "2 tablespoons chopped fresh parsley",
        "3/4 cup grated Parmesan cheese",
        "1 (12 ounce) package shredded mozzarella cheese, or as needed",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 524 kcal",
        "Carbs > 47.9 g",
        "Cholesterol > 98 mg",
        "Fat > 22 g",
        "Protein > 34.6 g",
        "Sodium > 898 mg"
    ],
    "n": "Lasagna Roll Ups II",
    "a": "GNelson",
    "r": "0",
    "s": 9,
    "des": "\"Thick and hearty rolls filled with ricotta, Parmesan, and a beefy tomato sauce. A fun spin on a family favorite!\"",
    "ins": "Cook and stir ground beef, onion, garlic powder, and oregano in a large skillet over medium heat until onion is tender and beef is browned, about 10 minutes. Add tomato sauce and sugar; simmer until sauce is heated through, about 10 minutes.\nBring a large pot of lightly salted water to a boil. Cook lasagna in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 to 10 minutes. Drain.\nPreheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch casserole dish.\nMix ricotta cheese, egg, parsley, and 3/4 cup Parmesan cheese together in a bowl.\nPlace a lasagna noodle on a work surface. Spoon one layer of ricotta cheese mixture, one layer meat sauce, and one layer mozzarella cheese atop the lasagna noodle; top with another lasagna noodle. Roll up the stuffed lasagna noodles in the jelly-roll style; place in the prepared casserole dish. Repeat with remaining lasagna noodles, ricotta cheese mixture, meat sauce, and mozzarella cheese. Spread a spoonful of meat sauce atop each lasagna roll; top with remaining mozzarella cheese and 1/4 cup Parmesan cheese.\nBake in the preheated oven until cheese is melted and bubbling, 30 to 35 minutes.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1338721.jpg",
    "o": "",
    "st": "allrecipes"
}