{
    "id": 228652,
    "old_rating": "4.42424",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon salt",
        "1 teaspoon caraway seeds (optional)",
        "1 teaspoon dried oregano",
        "1 teaspoon garlic salt",
        "1 teaspoon ground black pepper",
        "1 teaspoon red pepper flakes, or to taste (optional)",
        "2 pounds extra lean ground beef",
        "2 eggs",
        "1/2 cup grated Parmesan cheese",
        "1 (12 ounce) package shredded mozzarella cheese",
        "1 cup tomato sauce",
        "1 (3.5 ounce) package sliced pepperoni, or to taste"
    ],
    "nut": [
        "Calories > 506 kcal",
        "Carbs > 5.1 g",
        "Cholesterol > 220 mg",
        "Fat > 27.8 g",
        "Protein > 56.5 g",
        "Sodium > 2521 mg"
    ],
    "n": "Pepperoni Meatza",
    "a": "Adpa",
    "r": "0",
    "s": 6,
    "des": "\"For people that are gluten-intolerant, low-carb, paleo, or whatever, it can be hard to go without pizza. This dish makes it a lot easier. It is made pretty much exactly the same as pizza, but with ground beef as the crust. Sounds weird at first, but it is absolutely delicious and very filling. This is something great to make ahead of time and then eat as leftovers later on. It's great hot or cold, just like pizza! I find that if you make 6 square slices, each slice is usually more than enough to fill you up.\n Feel free to add whatever toppings you normally eat on pizza. It will taste just as good!\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nMix together salt, caraway seeds, oregano, garlic salt, ground black pepper, and crushed red pepper flakes in a small bowl.\nMix ground beef and eggs in a mixing bowl until thoroughly incorporated. Add Parmesan cheese and seasoning mixture to beef; combine. Press ground beef mixture into a 12x17-inch pan, spread out evenly.\nBake in the preheated oven until meat is no longer pink, about 10 minutes. Drain grease.\nSet oven rack about 6 inches from the heat source and turn on the oven's broiler.\nSprinkle 1/3 of the mozzarella cheese over baked meat, followed by tomato sauce in an even layer. Sprinkle another 1/3 of the mozzarella cheese over the sauce and top with slices of pepperoni. Sprinkle remaining mozzarella cheese over pizza.\nBroil until cheese is melted, bubbling, and lightly browned, 3 to 5 minutes.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "4465669.jpg",
    "o": "4465669.jpg,4165609.jpg,3228646.jpg,3097557.jpg,2812714.jpg,2131727.jpg",
    "st": "allrecipes"
}