{
    "id": 228673,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "2 large onions, chopped",
        "1 (4 ounce) package sliced pepperoni sausage, cut into 1/4-inch dice",
        "4 cloves garlic",
        "3 tablespoons olive oil",
        "3 large carrots, cut into 2-inch pieces",
        "1/2 head cabbage - cored, cut into 1-inch wedges, and wedges halved crosswise",
        "kosher salt",
        "1/2 teaspoon ground black pepper",
        "1 1/2 pounds tomatoes, coarsely chopped",
        "2 zucchini, cut into 1-inch rounds",
        "1/2 pound fresh green beans, trimmed",
        "3 potatoes",
        "1 tablespoon olive oil, or to taste"
    ],
    "nut": [
        "Calories > 376 kcal",
        "Carbs > 41.7 g",
        "Cholesterol > 20 mg",
        "Fat > 20.2 g",
        "Protein > 10.9 g",
        "Sodium > 615 mg"
    ],
    "n": "Italian Vegetable Stew",
    "a": "RALEPRICE",
    "r": "0",
    "s": 6,
    "des": "\"Giambotta - an Italian stew made with end-of-summer vegetables. Serve with crusty bread.\"",
    "ins": "Heat 1 tablespoon olive oil in a large, heavy pot over medium heat; cook and stir onions, pepperoni sausage, and garlic until garlic is golden brown, 8 to 10 minutes. Transfer pepperoni mixture to a bowl and set aside.\nHeat 3 tablespoons olive oil in same pot; cook and stir carrots, cabbage, kosher salt, and black pepper until coated in hot oil. Place tomatoes, zucchini, and green beans into pot and scatter onion-pepperoni mixture over the top. Partially cover the pot and simmer until vegetables are tender, about 50 minutes.\nPlace potatoes into a large pot and cover with lightly-salted water. Bring to a boil, reduce heat to medium-low, and simmer until tender, about 20 minutes. Drain and let potatoes cool. When cool enough to handle, cut potatoes into 1 1/2-inch pieces.\nGently fold potatoes into the vegetable stew and cook until heated through, about 3 more minutes; drizzle stew with 1 tablespoon olive oil and serve.",
    "pt": "40 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "2579861.jpg",
    "o": "",
    "st": "allrecipes"
}