{
    "id": 228746,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "6 chicken breast tenders",
        "1 (.18 ounce) packet sazon seasoning",
        "1 teaspoon garlic salt",
        "1 cup instant rice",
        "1 cup water",
        "1 (14 ounce) can black beans, drained and rinsed",
        "1 (.18 ounce) packet sazon seasoning",
        "1 teaspoon garlic salt",
        "8 extra-large flour tortillas",
        "1 (16 ounce) package shredded Mexican cheese blend",
        "1 tablespoon softened butter, or as needed"
    ],
    "nut": [
        "Calories > 618 kcal",
        "Carbs > 57.3 g",
        "Cholesterol > 90 mg",
        "Fat > 28.6 g",
        "Protein > 31.6 g",
        "Sodium > 1714 mg"
    ],
    "n": "Easy Chicken Quesadillas",
    "a": "Jenn79",
    "r": "0",
    "s": 8,
    "des": "\"I came up with this recipe on a whim. I love quesadillas, but am picky about what goes in them. This was super easy to make and tasted really good. Serve as is or with salsa and sour cream.\"",
    "ins": "Heat 2 tablespoons butter in a saucepan over medium heat; cook and stir chicken, 1 packet sazon seasoning, and 1 teaspoon garlic salt, shredding chicken as it cooks until no longer pink in the center and juices run clear, 8 to 10 minutes.\nBring rice and water to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender, and the liquid has been absorbed, 5 to 10 minutes.\nStir black beans, 1 packet sazon seasoning, and teaspoon garlic salt together in a microwave-safe bowl. Cook in microwave until heated through, about 2 minutes. Add black bean mixture to rice.\nPlace each tortilla on a work surface; layer half of each tortilla with bean-rice mixture, Mexican cheese, shredded chicken, and more Mexican cheese. Fold each tortilla in half. Spread a thin layer of softened butter atop each quesadilla.\nHeat a large skillet over medium heat; cook each quesadilla, butter-side down, until cheese is melted and outside is crisp and brown, about 5 minutes per side. Cut into wedges.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "940740.jpg",
    "o": "",
    "st": "allrecipes"
}