{
    "id": 228725,
    "old_rating": "3.9",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups cubed potatoes",
        "6 slices bacon",
        "1 cup diced celery",
        "3 green onions, diced",
        "1/2 cup mayonnaise",
        "1/4 cup vinegar",
        "2 teaspoons white sugar",
        "1 teaspoon Dijon mustard",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 274 kcal",
        "Carbs > 16.4 g",
        "Cholesterol > 31 mg",
        "Fat > 19.6 g",
        "Protein > 8.7 g",
        "Sodium > 668 mg"
    ],
    "n": "Hot German Potato Salad Casserole",
    "a": "LizgraEva",
    "r": "0",
    "s": 8,
    "des": "\"Passed down from my German/Dutch Grandmother. A hot potato salad with bacon, cheese and a creamy/vinegar sauce makes this a wonderful dish to serve with bratwurst on a cold fall day in Deutschland or wherever you might be. I usually double the bacon and sauce to make this extra flavorful.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring potatoes to a boil in a large pot of salted water. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain; transfer potatoes to a large baking dish.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels; crumble and sprinkle over potatoes.\nHeat a skillet over medium heat; cook and stir celery and green onion until celery is tender, about 5 minutes. Transfer vegetables to baking dish.\nWhisk mayonnaise, vinegar, sugar, mustard, salt, and black pepper in a bowl until smooth. Pour mixture over potatoes and stir until well mixed. Sprinkle with Cheddar cheese.\nBake in preheated oven until cheese is melted, 20 to 35 minutes.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "907116.jpg",
    "o": "",
    "st": "allrecipes"
}