{
    "id": 228716,
    "old_rating": "4.86207",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon Italian seasoning",
        "1 teaspoon onion powder",
        "1 teaspoon garlic powder",
        "1 teaspoon celery seed",
        "1 teaspoon dried parsley",
        "1 teaspoon dried thyme",
        "1 teaspoon dried basil",
        "1 teaspoon dried oregano",
        "salt and ground black pepper to taste",
        "1 bay leaf",
        "1/2 cup elbow macaroni",
        "3 tablespoons olive oil",
        "1/2 cup butter",
        "1 large carrot, diced",
        "2 stalks celery, diced",
        "1 large onion, diced",
        "1 tablespoon finely chopped garlic",
        "1 green bell pepper, diced",
        "1 red bell pepper, diced",
        "1 small zucchini, diced",
        "1 (28 ounce) can diced San Marzano tomatoes with juice",
        "1 (15 ounce) can tomato sauce",
        "1 (15.5 ounce) can three bean salad, drained and rinsed",
        "1 1/2 (10 ounce) packages frozen French-cut green beans",
        "6 cups chicken stock"
    ],
    "nut": [
        "Calories > 398 kcal",
        "Carbs > 41.9 g",
        "Cholesterol > 41 mg",
        "Fat > 23.7 g",
        "Protein > 8.8 g",
        "Sodium > 1525 mg"
    ],
    "n": "Fat Granny's Minestrone Soup",
    "a": "styx1017",
    "r": "0",
    "s": 6,
    "des": "\"Fresh vegetables, beans, and pasta are simmered in a seasoned tomato broth. Serve with garlic cheese bread and a fresh tossed green salad.\"",
    "ins": "Combine Italian seasoning, onion powder, garlic powder, celery seed, parsley, thyme, basil, oregano, salt, black pepper, and bay leaf in a small bowl.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain.\nHeat olive oil and butter together in a large saucepan over medium-high heat; cook and stir carrot, celery, and onion until heated through, 2 to 3 minutes. Add garlic, green bell pepper, red bell pepper, zucchini, and Italian seasoning mixture; stir to combine.\nStir tomatoes and their juice, tomato sauce, three bean salad, green beans, and chicken stock into seasoned vegetable mixture. Bring to a boil, reduce heat, and simmer, stirring occasionally, until flavors are blended, about 30 minutes. Stir in elbow macaroni before serving.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "4283763.jpg",
    "o": "",
    "st": "allrecipes"
}