{
    "id": 228751,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package rotini pasta",
        "3 tablespoons olive oil, divided",
        "1 pound ground beef",
        "6 tomatoes, grated",
        "1 sweet yellow onion, grated",
        "1/2 cup water",
        "3 tablespoons tomato paste",
        "1 tablespoon ground cinnamon",
        "1/2 teaspoon white sugar",
        "1/2 teaspoon cayenne pepper",
        "salt and ground black pepper to taste",
        "4 cups shredded Mizithra cheese",
        "1 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 516 kcal",
        "Carbs > 95.3 g",
        "Cholesterol > 69 mg",
        "Fat > 21.9 g",
        "Protein > 23.9 g",
        "Sodium > 1278 mg"
    ],
    "n": "Greek Meat Pasta (Makaronia me kima)",
    "a": "GreekMuse",
    "r": "0",
    "s": 10,
    "des": "\"A staple pasta dish in the Greek house. The cinnamon is what gives it the flavorful richness. The combination of Greek Mizithra cheese makes it even better.\"",
    "ins": "Bring a large pot of lightly salted water to a boil; cook the rotini at a boil until tender yet firm to the bite, about 8 minutes; drain. Transfer to a large bowl and toss with 2 tablespoons olive oil.\nHeat 1 tablespoon olive oil in a large skillet over medium heat; cook and stir ground beef until browned, about 10 minutes. Add tomatoes, onion, water, tomato paste, cinnamon, sugar, cayenne, salt, and pepper; stir to combine. Simmer meat sauce over medium-low heat until flavors combine, 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nPour meat sauce over rotini; mix well. Pour half the pasta mixture into a casserole dish; sprinkle with half the Mizithra cheese and half the mozzarella cheese. Top with remaining pasta mixture; sprinkle remaining Mizithra cheese and mozzarella cheese.\nBake in the preheated oven until cheese is melted and bubbling, about 40 minutes.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}