{
    "id": 228878,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 sweet potatoes, quartered lengthwise",
        "1 butternut squash, quartered and seeded",
        "2 tablespoons olive oil, or as needed",
        "3 tablespoons butter",
        "1/2 yellow onion, chopped",
        "2 tablespoons all-purpose flour",
        "2 cups milk",
        "1 1/2 teaspoons minced fresh sage, or more to taste",
        "1 pinch garlic salt, or to taste",
        "ground black pepper to taste",
        "1/4 cup grated Asiago cheese"
    ],
    "nut": [
        "Calories > 275 kcal",
        "Carbs > 35.4 g",
        "Cholesterol > 26 mg",
        "Fat > 13.4 g",
        "Protein > 6.7 g",
        "Sodium > 215 mg"
    ],
    "n": "Scalloped Sweet Potatoes and Butternut Squash",
    "a": "Shandalulu",
    "r": "0",
    "s": 6,
    "des": "\"I made this up to go with some grilled salmon and boy, it sure turned out a lot better than I expected! A nice twist on the old scalloped potatoes.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking dish.\nBrush sweet potatoes and squash with olive oil. Arrange sweet potatoes on a baking sheet; set squash aside.\nBake sweet potatoes in the preheated oven for 5 minutes. Add squash to sweet potatoes; cook until almost tender, 10 to 15 minutes. Remove and cool.\nHeat butter in a saucepan over medium heat; cook and stir onion until tender, about 10 minutes. Add flour, milk, and sage; season with garlic salt and black pepper. Cook and stir until flour is dissolved and sauce is thickened, 5 to 10 minutes.\nRemove and discard skins from sweet potatoes and squash. Thinly slice sweet potatoes and squash. Arrange sweet potato slices in the bottom of the prepared baking dish. Layer half the squash atop sweet potatoes. Pour a little less than half the cream sauce over squash. Sprinkle with half the Asiago cheese. Repeat layering with remaining squash, cream sauce, and Asiago cheese, respectively. Cover with aluminum foil.\nBake in the preheated oven for 25 minutes. Remove foil and bake until cheese is melted and bubbling, about 10 more minutes.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "890125.jpg",
    "o": "",
    "st": "allrecipes"
}