{
    "id": 228889,
    "old_rating": "4.61017",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Dough:",
        "1 cup milk",
        "2 tablespoons butter or margarine",
        "2 tablespoons brown sugar",
        "1 envelope Fleischmann'sÂ® RapidRise Yeast",
        "2 teaspoons salt",
        "3 cups all-purpose flour, or more as needed",
        "Boiling Solution:",
        "3 quarts water",
        "3/4 cup baking soda",
        "Egg Wash:",
        "1 egg",
        "1 teaspoon water"
    ],
    "nut": [
        "Calories > 155 kcal",
        "Carbs > 27.1 g",
        "Cholesterol > 22 mg",
        "Fat > 3 g",
        "Protein > 4.4 g",
        "Sodium > 4156 mg"
    ],
    "n": "Pretzel Bread",
    "a": "ARGOÂ®,  KAROÂ®  and FLEISCHMANN'SÂ®",
    "r": "0",
    "s": 12,
    "des": "\"Like a pretzel, this bread has a salty brown crust and a tender texture--perfect for sandwiches.\"",
    "ins": "Heat milk and butter until warm (100 degrees  to 110 degrees F); the butter will not completely melt.  Combine with undissolved yeast and brown sugar in a large mixer bowl.  Stir in salt and 2 cups flour, beat for 3 minutes.  Gradually add enough remaining flour to make a soft dough.  Knead on a floured surface until smooth and elastic, about 8 to 10 minutes.  Place in a greased bowl, cover and let rise for 1 hour, or until doubled in size.\nPreheat oven to 400 degrees F.\nCombine boiling solution and bring to a boil.  Punch dough down and divide into 2 equal pieces.  Form each piece into a tight, smooth ball.  Boil each loaf in the solution for 2 minutes, turning after 1 minute.  Remove loaves from pot using a slotted spoon and place on a greased baking sheet.\nBrush with egg wash and cut a cross in the top. Bake for 15 minutes then reduce the temperature to 350 degrees F and bake an additional 10 to 12 minutes until the loaves are evenly browned. Remove from pan and cool on a wire rack.",
    "pt": "20 m",
    "ct": "27 m",
    "tt": "1 h ",
    "i": "987066.jpg",
    "o": "4487097.jpg,4476011.jpg,4473561.jpg,4463308.jpg,4436305.jpg,4071760.jpg",
    "st": "allrecipes"
}