{
    "id": 228871,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package linguine",
        "1/4 cup olive oil",
        "1 pound skinless, boneless chicken breast halves, diced",
        "1 small onion, chopped",
        "2 cloves garlic, minced",
        "2 cups diced tomatoes with juice",
        "1 1/2 teaspoons dried oregano",
        "1 1/2 teaspoons dried basil",
        "1 teaspoon dried thyme",
        "1 cup shredded Cheddar cheese, divided"
    ],
    "nut": [
        "Calories > 525 kcal",
        "Carbs > 58.3 g",
        "Cholesterol > 63 mg",
        "Fat > 18.5 g",
        "Protein > 30.2 g",
        "Sodium > 272 mg"
    ],
    "n": "Oven-Baked Chicken Linguine",
    "a": "Josee RC",
    "r": "0",
    "s": 6,
    "des": "\"This recipe was thrown together when I was craving baked pasta but didn't have spaghetti or ground beef. I then decided to try my hand at an oven-baked linguine dish with chicken instead. A combination of chicken, pasta, onion, tomatoes, garlic, herbs, and cheese make this a comforting and quick oven-baked pasta.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil; cook linguine at a boil until tender yet firm to the bite, about 11 minutes; drain.\nHeat olive oil in a large frying pan over medium heat; cook and stir chicken, onion, and garlic until onion is tender, chicken is no longer pink in the center and chicken juices run clear, 10 to 15 minutes. Add tomatoes with their juice, oregano, basil, and thyme; cook until liquid has almost evaporated, about 10 minutes.\nCombine cooked linguine and 1/2 cup Cheddar cheese with chicken mixture in a large bowl; toss until Cheddar cheese begins to melt. Transfer mixture to a deep casserole dish; top with remaining Cheddar cheese.\nBake in the preheated oven until cheese is melted and bubbling, 20 minutes.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "1087128.jpg",
    "o": "",
    "st": "allrecipes"
}