{
    "id": 228847,
    "old_rating": "4.77778",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (4 pound) whole chicken",
        "1 tablespoon butter",
        "salt and ground black pepper to taste",
        "1/2 onion, coarsely chopped",
        "1 stalk celery, cut into 4 pieces",
        "1/2 lemon, cut into 4 pieces",
        "3 cloves garlic, sliced",
        "2 tablespoons butter",
        "1 teaspoon dried parsley",
        "1 teaspoon dried Italian herb seasoning"
    ],
    "nut": [
        "Calories > 444 kcal",
        "Carbs > 3.7 g",
        "Cholesterol > 145 mg",
        "Fat > 28.6 g",
        "Protein > 41.4 g",
        "Sodium > 172 mg"
    ],
    "n": "Best of Both Worlds Roast Chicken",
    "a": "Susan",
    "r": "0",
    "s": 6,
    "des": "\"Want a crispy skin on a chicken that's tender and moist inside? Try this...it takes a little tending in the beginning, then you're home free!\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nRemove giblet packet from cavity of chicken and pat bird thoroughly dry with paper towels. Place 1 tablespoon butter into chicken cavity, sprinkle salt and black pepper into cavity, and stuff cavity with onion, celery, and lemon pieces. Loosen skin over breast and thigh of chicken with your fingers and insert garlic slices under the skin. Place the chicken breast side up on a rack set into a roasting pan.\nMelt 2 tablespoons butter in a small saucepan over medium-low heat; add dried parsley and Italian seasoning. Pour half the butter-herb mixture over the chicken and rub the seasoned butter onto all parts of chicken. Reserve remaining butter mixture.\nRoast chicken in the preheated oven for 20 minutes, then remove and turn chicken so breast side is down. Pour remaining half of seasoned butter over the chicken, brushing it over all parts of the bird. Return to oven and roast an additional 10 minutes.\nReduce oven heat to 325 degrees F (165 degrees C). Roast chicken until skin is crisp and brown and the juices run clear, 1 hour and 20 more minutes. An instant-read meat thermometer inserted into the thickest part of a thigh, not touching bone, should read 160 degrees F (70 degrees C). Let chicken rest, uncovered, for 10 minutes before serving.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "3279161.jpg",
    "o": "",
    "st": "allrecipes"
}