{
    "id": 228865,
    "old_rating": "4.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 strips bacon",
        "1 (16 ounce) package bulk pork sausage",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "1 green bell pepper, chopped",
        "1/2 teaspoon dried oregano",
        "1/4 teaspoon dried rubbed sage",
        "1 (15 ounce) can tomato sauce",
        "1 cup rice",
        "2 tablespoons water",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 296 kcal",
        "Carbs > 25.2 g",
        "Cholesterol > 38 mg",
        "Fat > 16.1 g",
        "Protein > 12.2 g",
        "Sodium > 891 mg"
    ],
    "n": "Sausage and Red Rice",
    "a": "Cliff G",
    "r": "0",
    "s": 8,
    "des": "\"This simple dish is easy to prepare and tastes good. A great side dish or main dish if you prefer. You can use mild or hot sausage depending on your taste.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Move an oven rack to the center of the oven.\nPlace the bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove the bacon slices to a plate lined paper towels to drain, reserving the bacon fat in the skillet. Crumble the bacon once cooled.\nCrumble sausage into the reserved bacon fat; cook and stir until the sausage is completely browned and no longer pink, 7 to 10 minutes. Drain sausage and set aside in a bowl. Return skillet to medium-high heat.\nHeat olive oil in the skillet. Cook and stir onion, bell pepper, oregano, and sage in the hot oil until the onion is soft, about 5 minutes.\nCombine tomato sauce, rice, water, bacon, sausage, and the onion mixture in a baking dish with a lid; season with salt and black pepper. Stir until evenly mixed. Cover dish with aluminum foil and the lid.\nBake in preheated oven until the rice is tender, about 1 hour. Let rest 10 minutes before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "2565496.jpg",
    "o": "",
    "st": "allrecipes"
}