{
    "id": 228806,
    "old_rating": "4.45238",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 green bell peppers, tops and seeds removed (reserve tops)",
        "1 pound ground beef",
        "1/2 cup chopped onion",
        "1 (14.5 ounce) can diced tomatoes with juice",
        "1/2 cup long grain white rice",
        "1/2 cup water",
        "1 teaspoon Worcestershire sauce",
        "1 pinch salt",
        "1 pinch ground black pepper",
        "1 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 454 kcal",
        "Carbs > 30 g",
        "Cholesterol > 99 mg",
        "Fat > 23 g",
        "Protein > 29.8 g",
        "Sodium > 459 mg"
    ],
    "n": "Baked Stuffed Peppers",
    "a": "ptownruth",
    "r": "0",
    "s": 4,
    "des": "\"Stuffed peppers recipe that I've come up with.\"",
    "ins": "Chop enough reserved green pepper tops to equal 1/4 cup; discard remaining tops or use for another purpose. Set chopped pepper aside.\nPlace hollowed-out green peppers in a microwave-safe dish; cover and cook in microwave until bright green and steaming, about 3 minutes. Set peppers aside.\nCook and stir ground beef in a skillet with reserved chopped pepper tops and onion over medium heat until beef is browned, the juices run clear, and the onion is translucent, about 10 minutes; drain excess grease. Pour in diced tomatoes with their juice, rice, water, Worcestershire sauce, salt, and black pepper; bring to a boil. Reduce heat to low, cover skillet, and simmer until rice is tender, about 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nStir cheese into ground beef-rice mixture and spoon mixture into precooked peppers. Set peppers upright in an 8x8-inch baking dish.\nBake in the preheated oven until cheese is melted and the peppers are tender, about 30 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4513803.jpg",
    "o": "4513803.jpg,4470834.jpg,4084933.jpg,4050580.jpg,3871314.jpg,3675797.jpg",
    "st": "allrecipes"
}