{
    "id": 228856,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup all-purpose flour",
        "2 tablespoons salt",
        "1 tablespoon ground black pepper",
        "1 tablespoon paprika",
        "1 tablespoon garlic powder",
        "1 tablespoon onion powder",
        "8 meaty beef short ribs",
        "3 tablespoons olive oil",
        "1/2 cup butter",
        "8 sweet onions (such as VidaliaÂ®), sliced and separated into rings",
        "2 quarts beef broth",
        "1/2 cup sherry",
        "12 sprigs fresh thyme",
        "1 (1 pound) loaf French bread, thinly sliced",
        "2 cups shredded Gruyere cheese"
    ],
    "nut": [
        "Calories > 1162 kcal",
        "Carbs > 62.6 g",
        "Cholesterol > 177 mg",
        "Fat > 79.3 g",
        "Protein > 47.9 g",
        "Sodium > 3222 mg"
    ],
    "n": "Beef Short Rib French Onion Soup",
    "a": "dbs.geek",
    "r": "0",
    "s": 8,
    "des": "\"Though I love French onion soup, this twist with beef short ribs adds great beef flavor and is a bit more hearty!\n\n The crocks are something else to purchase, but at $30 for a set of four which are microwave-, oven-, and dishwasher-safe, and handy for all sorts of things, they are worth it.\"",
    "ins": "Mix flour, 2 tablespoons salt, 1 tablespoon black pepper, paprika, garlic powder, and onion powder in a bowl. Dredge beef short ribs in the seasoned flour mixture. Reserve 3 tablespoons of leftover seasoned flour.\nHeat olive oil in a large pot over medium-high heat and pan-fry the beef ribs until browned on all sides, 3 to 5 minutes per side. Remove ribs and set aside. Turn heat down to medium and melt butter in the pot; cook and stir sweet onions in the butter until soft and slightly browned, about 15 minutes. Stir constantly and reduce heat if onions begin to burn.\nStir 3 tablespoons of reserved seasoned flour mixture into the onions and cook and stir for 10 minutes; pour in beef broth and sherry. Bring to a boil, stirring constantly, until soup is slightly thickened; season with more salt and black pepper, if desired.\nStrip leaves from thyme sprigs and add leaves to the soup. Gently return short ribs to the pot, reduce heat to low, and simmer soup until ribs are tender, about 2 1/2 hours. Stir soup every hour or so.\nPreheat the oven's broiler.\nLadle soup into oven-safe soup crocks, placing a short rib into each bowl. Top soup with 2 slices of French bread per bowl and sprinkle about 1/4 cup of Gruyere cheese over each crock.\nPlace crocks under broiler until cheese is browned and bubbling, 2 to 3 minutes.",
    "pt": "30 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "4497530.jpg",
    "o": "",
    "st": "allrecipes"
}