{
    "id": 228850,
    "old_rating": "4.36364",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 eggplant, trimmed and halved lengthwise",
        "1 tablespoon olive oil",
        "3 potatoes, peeled and cubed",
        "2 cloves garlic, peeled and halved",
        "2 slices bacon",
        "1 tablespoon bacon drippings",
        "1/2 onion, cut into strips",
        "1 tablespoon olive oil",
        "salt to taste",
        "freshly cracked black pepper to taste"
    ],
    "nut": [
        "Calories > 191 kcal",
        "Carbs > 26.1 g",
        "Cholesterol > 6 mg",
        "Fat > 8.4 g",
        "Protein > 4.5 g",
        "Sodium > 82 mg"
    ],
    "n": "Garlic Mashed Potatoes with Eggplant",
    "a": "peawormsworth",
    "r": "0",
    "s": 6,
    "des": "\"I don't care much for eggplant. But I found this an ideal way to consume it and it actually improves on the classic. Try this for a moist option of mashed potatoes with no butter, milk or gravy required. You can add more garlic if you like. I usually do. Also, the bacon is delicious, but the recipe works without it.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPlace eggplant halves, cut sides up, onto a baking sheet and brush with 1 tablespoon olive oil.\nBake eggplant in the preheated oven until soft, 30 to 35 minutes. Peel eggplant when cool enough to handle; set aside.\nWhile eggplant is baking, place potatoes and garlic cloves into a large pot and cover with lightly-salted water. Bring to a boil, reduce heat to medium-low, and simmer until tender, about 20 minutes. Drain.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels and retain 1 tablespoon drippings in the skillet. When bacon is cool, crumble, and set aside. Cook and stir onion in bacon drippings until soft and translucent, about 5 minutes. Set onion aside.\nPlace eggplant, potatoes, cooked garlic cloves, and 1 tablespoon olive oil in a large bowl and mash with a potato masher until smooth and thoroughly combined. Season to taste with salt and cracked black pepper. Serve in a bowl topped with cooked onion and crumbled bacon.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "1032490.jpg",
    "o": "",
    "st": "allrecipes"
}