{
    "id": 228870,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup dried cranberries",
        "1/2 cup apple cider",
        "1 tablespoon olive oil",
        "4 skinless, boneless chicken breast halves",
        "salt and ground black pepper to taste",
        "1/2 cup stone-ground mustard",
        "1/2 cup applesauce",
        "4 slices bacon, halved crosswise",
        "2 Granny Smith apples, quartered",
        "2 sweet onions (such as VidaliaÂ®), quartered"
    ],
    "nut": [
        "Calories > 371 kcal",
        "Carbs > 37.2 g",
        "Cholesterol > 77 mg",
        "Fat > 11.9 g",
        "Protein > 30.7 g",
        "Sodium > 663 mg"
    ],
    "n": "Apple Bacon Baked Chicken",
    "a": "S Nunes",
    "r": "0",
    "s": 4,
    "des": "\"This is a nice spin on traditional baked chicken and apples - bacon makes it that much better! This recipe can be easily adapted for the fall fruits or veggies you have on hand, and is delicious served with mashed sweet potatoes.\"",
    "ins": "Soak cranberries in apple cider in a bowl until cranberries are rehydrated, 2 to 6 hours.\nPreheat oven to 425 degrees F (220 degrees C). Coat bottom of a baking dish with olive oil.\nArrange chicken breasts in the prepared baking dish; sprinkle with salt and black pepper.\nWhisk mustard and applesauce together in a small bowl; spoon over chicken breasts. Lay two half-slices of bacon atop each chicken breast. Arrange apples and onions around chicken. Add cranberries, pouring any remaining apple cider over chicken. Cover dish with aluminum foil.\nBake in the preheated oven for 40 minutes. Remove aluminum foil and continue baking until bacon is crisp and chicken breasts are no longer pink in the center and the juices run clear, about 20 more minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "3 h ",
    "i": "1676622.jpg",
    "o": "",
    "st": "allrecipes"
}