{
    "id": 228859,
    "old_rating": "4.63251",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 tablespoons butter",
        "4 large yellow onions, sliced and separated into rings",
        "1 tablespoon white sugar",
        "2 cloves garlic, minced",
        "1/2 cup cooking sherry",
        "7 cups reduced-sodium beef broth",
        "1 teaspoon sea salt, or to taste",
        "1/4 teaspoon dried thyme",
        "1 bay leaf",
        "8 slices of French bread",
        "1/2 cup shredded Gruyere cheese",
        "1/3 cup shredded Emmental cheese",
        "1/4 cup freshly shredded Parmesan cheese",
        "2 tablespoons shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 250 kcal",
        "Carbs > 17.5 g",
        "Cholesterol > 38 mg",
        "Fat > 14.7 g",
        "Protein > 11 g",
        "Sodium > 596 mg"
    ],
    "n": "Slow Cooker French Onion Soup",
    "a": "Chandrav",
    "r": "0",
    "s": 8,
    "des": "\"This is a ridiculously easy soup, especially since it cooks in a slow cooker! When it's been simmering all day, you come home to an amazing aroma and a fabulous meal for a cold winter day.\"",
    "ins": "Heat butter in a large, heavy pot over medium-high heat; cook and stir onions until they become translucent, about 10 minutes. Sprinkle onions with sugar; reduce heat to medium. Cook, stirring constantly, until onions are soft and browned, at least 30 minutes. Stir in garlic and cook until fragrant, about 1 minute.\nStir sherry into onion mixture and scrape bottom of pot to dissolve small bits of browned food from the pot. Transfer onions into a slow cooker and pour in beef broth. Season to taste with sea salt; stir in thyme and bay leaf. Cover cooker, set on High, and cook 4 to 6 hours. If desired, set on Low and cook 8 to 10 hours.\nAbout 10 minutes before serving, set oven rack about 8 inches from the heat source and preheat the oven's broiler. Arrange bread slices on a baking sheet.\nBroil bread slices until toasted, 1 to 2 minutes per side.\nCombine Gruyere, Emmental, Parmesan, and mozzarella cheeses in a bowl, tossing lightly. Fill oven-safe soup crocks 3/4 full of onion soup and float a bread slice in each bowl. Top with about 2 tablespoons of cheese mixture per serving.\nPlace filled bowls onto a baking sheet and broil until cheese topping is lightly browned and bubbling, about 2 minutes.",
    "pt": "30 m",
    "ct": "4 h ",
    "tt": "5 h ",
    "i": "4498191.jpg",
    "o": "4498191.jpg,4487386.jpg,4458333.jpg,4438119.jpg,4392043.jpg,4354124.jpg",
    "st": "allrecipes"
}