{
    "id": 228899,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cheesecloth",
        "1 gallon whole milk",
        "1/2 cup lemon juice",
        "1 bunch fresh spinach leaves",
        "1 pound tomatoes",
        "1/4 cup ghee (clarified butter)",
        "1 teaspoon turmeric powder",
        "1 teaspoon ground red chile pepper",
        "1/4 teaspoon asafoetida powder (hing)",
        "1 1/2 teaspoons salt, or to taste",
        "2 tablespoons heavy whipping cream, or more as needed",
        "1/4 teaspoon ground fenugreek seeds (methi powder)"
    ],
    "nut": [
        "Calories > 517 kcal",
        "Carbs > 36.8 g",
        "Cholesterol > 94 mg",
        "Fat > 31.9 g",
        "Protein > 23.5 g",
        "Sodium > 893 mg"
    ],
    "n": "Palak Paneer",
    "a": "International Recipes",
    "r": "0",
    "s": 6,
    "des": "\"Traditional pure vegetarian recipe, without onions or garlic! 100% made from scratch and absolutely delicious.\"",
    "ins": "Line a colander with a cheesecloth and place in the sink.\nBring milk to a boil in a large pot; add lemon juice. Stir until milk separates into curds and whey. Transfer curds with a large slotted spoon to the prepared colander and allow curds to drain. Whey can be saved for another use.\nGather cheesecloth around curds to squeeze out excess liquid and to form a ball. Return wrapped curd ball to the colander and place the whey-filled pot (or another weight) over the curd ball to press and drain completely, about 20 minutes.\nBring a large pot of water to a boil; add spinach. Simmer until spinach is wilted, 1 to 2 minutes. Transfer spinach to a bowl with a slotted spoon. Drop tomatoes into the same pot of boiling water; simmer until tomato skins begin to split, 3 to 5 minutes. Drain. Peel tomato skins when cool enough to handle.\nPlace spinach in a blender or food processor; puree until smooth and remove spinach to a bowl.\nPlace peeled tomatoes in a blender or food processor; puree until smooth and remove tomatoes to another bowl.\nUnwrap curd ball from cheesecloth; paneer should now be a solid block. Cut paneer into small cubes.\nHeat ghee in a large skillet over medium-low heat; cook and stir turmeric, ground red chile powder, and asafoetida powder in hot ghee until fragrant, about 20 seconds. Stir in tomato puree into ghee and spices and increase heat to medium. Cover and simmer until ghee rises to the top, about 10 minutes.\nStir spinach puree and salt into tomato mixture. Continue to simmer until fragrant, 5 to 10 minutes more. Add cubed paneer to skillet; cook until paneer is softened, 2 to 3 minutes. Stir cream into spinach-tomato mixture, cover, and simmer until hot, 2 to 3 minutes more.\nRemove skillet from heat and sprinkle with ground fenugreek. Cool for a few minutes before serving.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "1005321.jpg",
    "o": "",
    "st": "allrecipes"
}