{
    "id": 228883,
    "old_rating": "4.76",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup warm water (100 to 110 degrees F)",
        "1 envelope Fleischmann'sÂ® Active Dry Yeast",
        "1 tablespoon sugar",
        "1 teaspoon salt",
        "2 tablespoons extra virgin olive oil",
        "2 1/4 cups all-purpose flour, or more as needed",
        "12 ounces bacon slices",
        "1 large onion, thinly sliced",
        "1/4 cup port wine",
        "1 cup shredded smoked Cheddar cheese",
        "3 tablespoons butter or margarine, melted"
    ],
    "nut": [
        "Calories > 234 kcal",
        "Carbs > 20.7 g",
        "Cholesterol > 28 mg",
        "Fat > 12.4 g",
        "Protein > 8.6 g",
        "Sodium > 490 mg"
    ],
    "n": "Bacon and Caramelized Onion Rolls",
    "a": "ARGOÂ®,  KAROÂ®  and FLEISCHMANN'SÂ®",
    "r": "0",
    "s": 12,
    "des": "\"These homemade yeast rolls with bacon, caramelized onions, and smoked Cheddar cheese will take center stage on the dinner table.\"",
    "ins": "Combine water, yeast and sugar in a large mixer bowl. Let stand 5 minutes, until foamy. Add salt, oil and 1 cup flour; beat for 2 minutes at medium speed. Add enough remaining flour to make a soft dough.\nKnead dough on lightly floured surface for 6 to 8 minutes, until smooth and elastic. Place dough in a well greased bowl, turning once to coat. Cover and let rise in a warm, draft-free place until doubled, about 1 hour.\nWhile dough is rising, cook bacon in large skillet until just browned but not crispy. Drain well and crumble or chop into small pieces. Reserve 2 tablespoons bacon drippings in skillet. Add onion and cook over medium heat for 15 to 20 minutes or until onions are lightly caramelized. Add Port wine and cook until very little liquid remains. Set aside to cool.\nPunch dough down. Roll into a 15 x 10-inch rectangle. Spread onions over dough and then sprinkle with bacon and cheese. Roll dough up from long side, jelly roll style. Pinch seams to seal. Cut into 12 equal slices.\nPlace each slice in a greased muffin pan, cut side up. Brush with butter. Cover and let rise in a warm, draft free place until nearly doubled, about 30 minutes.\nBake in preheated 375 degrees F oven for 20 to 25 minutes, until golden. Remove to wire rack to cool.",
    "pt": "55 m",
    "ct": "25 m",
    "tt": "2 h ",
    "i": "982148.jpg",
    "o": "1084616.jpg,925671.jpg,913089.jpg,912865.jpg,912028.jpg,911950.jpg",
    "st": "allrecipes"
}