{
    "id": 228861,
    "old_rating": "4.3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons all-purpose flour",
        "1 teaspoon chipotle chili powder",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground coriander",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 (4 pound) skinless, boneless turkey breast half",
        "1 tablespoon olive oil",
        "1 acorn squash, seeded and cut into quarters",
        "3 large carrots, peeled and cut into 3 pieces",
        "2 red onions, quartered",
        "6 unpeeled garlic cloves"
    ],
    "nut": [
        "Calories > 455 kcal",
        "Carbs > 19.2 g",
        "Cholesterol > 218 mg",
        "Fat > 4.6 g",
        "Protein > 81.1 g",
        "Sodium > 365 mg"
    ],
    "n": "Tunisian Slow-Cooked Turkey Breast",
    "a": "Christine",
    "r": "0",
    "s": 6,
    "des": "\"This is a recipe that is now a favorite in our house. I've made this with 4 to 6 potatoes instead of squash and both are excellent!\"",
    "ins": "Mix flour, chipotle chili powder, garlic powder, cinnamon, coriander, salt, and black pepper in a large resealable plastic bag and shake to combine. Place the turkey breast into the bag, seal, and shake to coat turkey with the spice mix.\nHeat olive oil in a large skillet over medium heat and sear the seasoned turkey breast in the hot oil until browned on both sides, about 5 minutes per side (meat will still be pink inside).\nPlace acorn squash quarters, carrots, red onions, and garlic cloves into the bottom of a large slow cooker. Place the browned turkey breast on top of the vegetables. Cover cooker.\nCook turkey breast until meat and vegetables are very tender, 3 1/2 to 4 hours on High or 7 to 8 hours on Low. Transfer turkey breast to a platter and allow to rest for about 10 minutes before slicing.\nPeel squash and garlic cloves. Arrange the cooked vegetables around the turkey meat and spoon the juices from the slow cooker over the turkey and vegetables to serve.",
    "pt": "25 m",
    "ct": "3 h ",
    "tt": "4 h ",
    "i": "946747.jpg",
    "o": "",
    "st": "allrecipes"
}