{
    "id": 228991,
    "old_rating": "4.77083",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 large onions, diced",
        "3 carrots, sliced",
        "7 potatoes, cubed",
        "1 pound salmon, cut into chunks",
        "1 pound cod, cut into chunks",
        "1 pound scallops",
        "1 pound shrimp, peeled and deveined",
        "6 ounces cooked lobster meat, shredded",
        "1 (6 ounce) can crabmeat, drained and flaked",
        "2 (6.5 ounce) cans chopped clams, drained",
        "4 1/4 cups heavy whipping cream",
        "2 cups half-and-half",
        "1 1/2 cups butter, cut into chunks",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 525 kcal",
        "Carbs > 18.8 g",
        "Cholesterol > 202 mg",
        "Fat > 37.8 g",
        "Protein > 28.2 g",
        "Sodium > 325 mg"
    ],
    "n": "Mom's Nova Scotia Seafood Chowder",
    "a": "Ashley_86",
    "r": "0",
    "s": 20,
    "des": "\"Being from the Easy Coast, I've tried a lot of different chowders; however, my Mom's takes the cake. She makes a huge pot of this chowder every Christmas Eve and all of it is gone by Christmas night. Although it is not very healthy, it is an awesome treat once in awhile for any of us that love seafood! I normally throw in a dash of garlic and onion powder. Enjoy!\"",
    "ins": "Fill a large pot halfway with lightly salted water; bring to a boil. Add onions and carrots; cook until slightly tender, 10 minutes. Add potatoes; cook until tender, 15 to 20 minutes.\nStir in salmon, cod, scallops, shrimp, lobster, and crab; cook over medium heat until salmon and cod are firm but chunks are still slightly translucent in the center, about 10 minutes. Drain half the water from the pot and add clams, heavy cream, and half-and-half. Place butter chunks atop the soup; season with salt and black pepper. Cover and simmer, stirring occasionally, until salmon and cod are fully cooked and flake easily with a fork, about 30 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1648544.jpg",
    "o": "4314626.jpg,2895886.jpg,2230967.jpg,1976130.jpg,1865442.jpg,1239102.jpg",
    "st": "allrecipes"
}