{
    "id": 228939,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup red wine",
        "1/4 cup olive oil",
        "3 beef neck bones",
        "1/2 yellow onion, chopped",
        "1/2 cup chopped celery",
        "1/2 carrot, chopped",
        "1 whole head garlic, minced",
        "2 tablespoons cracked black pepper",
        "2 tablespoons red wine, or as needed",
        "2 (6 ounce) cans tomato paste",
        "4 (28 ounce) cans San Marzano-style peeled plum tomatoes with basil",
        "2 (16 ounce) cans tomato sauce",
        "1 quart water",
        "1/2 cup dried basil",
        "1/4 cup dried oregano",
        "1 pinch dried Italian parsley"
    ],
    "nut": [
        "Calories > 63 kcal",
        "Carbs > 9.5 g",
        "Cholesterol > 0 mg",
        "Fat > 2 g",
        "Protein > 2 g",
        "Sodium > 377 mg"
    ],
    "n": "Italian Tomato Gravy",
    "a": "Brandon Squige Johnson",
    "r": "0",
    "s": 32,
    "des": "\"This is my versatile Italian tomato gravy recipe. It goes great with spaghetti and meatballs as well on pizza.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPlace 1 cup red wine, olive oil, beef neck bones, onion, celery, carrot, garlic, and black pepper in a roasting pan; stir to coat.\nRoast neck bones and vegetable mixture in the preheated oven until vegetables are tender, 1 hour. Stir in about 2 tablespoons red wine while scraping any browned bits of food off of the bottom of the pan. Roast until vegetables are browned, about 30 more minutes.\nPour vegetable mixture into a 16-quart soup pot over medium-low heat; simmer for 30 minutes. Add tomato paste, plum tomatoes, tomato sauce, water, basil, oregano, and parsley; stir well. Simmer, stirring occasionally, until sauce reduces, 8 hours.\nRemove neck bones from sauce; scrape marrow out of bones. Add marrow to sauce and simmer until dissolved, 1 to 2 more hours.\nTransfer sauce to a blender in batches, filling blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree until smooth.",
    "pt": "30 m",
    "ct": "11 h",
    "tt": "11 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}