{
    "id": 228930,
    "old_rating": "3.86667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound ground chicken (preferably white meat)",
        "1 (8 ounce) can crushed pineapple, drained",
        "1 teaspoon kosher salt",
        "2 grinds cracked black pepper",
        "1 jalapeno pepper, diced (optional)",
        "3 cloves garlic, pressed",
        "5 tablespoons teriyaki sauce (such as Mr. Yoshida'sÂ®), divided"
    ],
    "nut": [
        "Calories > 134 kcal",
        "Carbs > 9.3 g",
        "Cholesterol > 46 mg",
        "Fat > 2.4 g",
        "Protein > 18.2 g",
        "Sodium > 936 mg"
    ],
    "n": "Teriyaki Chicken Burgers",
    "a": "islandgirlejfan",
    "r": "0",
    "s": 6,
    "des": "\"My family wasn't that thrilled with the taste of turkey burgers and I was watching my intake of beef. I started experimenting with ground chicken in my burgers and was mildly surprised with the outcome. The family likes these better than beef burgers! I usually make this when I bring the chicken home from the market.  It makes for a quick meal on a weeknight. It just doesn't get any easier! These are served on Belle'sÂ® Hamburger Rolls which are totally off the hook!\"",
    "ins": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nCombine ground chicken and pineapple in a large bowl; season with salt and black pepper. Mix jalapeno pepper, pressed garlic, and 2 tablespoons teriyaki sauce into the chicken mixture. Continue mixing with your hands until evenly combined.\nCook burgers on preheated grill until no longer pink in the center and the juices run clear, 7 to 10 minutes per side, basting the burgers with remaining 3 tablespoons teriyaki sauce. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "888632.jpg",
    "o": "",
    "st": "allrecipes"
}