{
    "id": 22899,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 eggs",
        "1 tablespoon minced onion",
        "1/2 teaspoon dry mustard",
        "1/2 teaspoon Worcestershire sauce",
        "3 tablespoons mayonnaise",
        "3 cups chopped broccoli",
        "3 cups cubed cooked ham",
        "1 teaspoon chopped fresh rosemary",
        "1 cup sliced fresh mushrooms",
        "3 tablespoons butter",
        "3 tablespoons all-purpose flour",
        "1 cup milk",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1 cup shredded sharp Cheddar cheese",
        "1/2 teaspoon salt",
        "1 pinch ground white pepper",
        "1 pinch paprika"
    ],
    "nut": [
        "Calories > 513 kcal",
        "Carbs > 13.1 g",
        "Cholesterol > 265 mg",
        "Fat > 39.1 g",
        "Protein > 27.8 g",
        "Sodium > 1692 mg"
    ],
    "n": "Echos of Easter",
    "a": "Marilyn Clay",
    "r": "0",
    "s": 6,
    "des": "\"This recipe uses all Easter leftovers from colored eggs to chopped broccoli.  Garnish with minced chives and parsley.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).  Butter a shallow 2 quart baking dish.\nPlace eggs in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool and peel.  Cut eggs in half lengthwise and remove yolks.  Mash yolks together with onion, mustard, Worcestershire and mayonnaise.  Spoon yolk mixture back onto egg white halves.  Set aside.\nCook broccoli by steaming or boiling.  In a large bowl, stir together cooked broccoli, ham, rosemary and mushrooms.  Spread evenly in prepared baking dish.  Arrange the filled eggs over the broccoli layer.\nIn a medium skillet, melt butter.  Stir in flour.  Stir in soup and milk and cook until thickened.  Remove from heat and stir in cheese, salt, pepper and paprika.  Pour sauce over eggs in dish.\nBake in preheated oven 25 to 30 minutes, until hot and bubbly.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}