{
    "id": 228951,
    "old_rating": "4.61905",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup water, room temperature, divided",
        "1/8 teaspoon salt",
        "3 (1 ounce) packages unflavored gelatin",
        "2 1/4 cups sugar",
        "1 cup KaroÂ® Light Corn Syrup",
        "2 teaspoons Spice IslandsÂ® Pure Vanilla Extract",
        "1 cup powdered sugar",
        "1 1/2 teaspoons ArgoÂ® Corn Starch"
    ],
    "nut": [
        "Calories > 177 kcal",
        "Carbs > 41 g",
        "Cholesterol > < 1 mg",
        "Fat > 0 g",
        "Protein > 4 g",
        "Sodium > 61 mg"
    ],
    "n": "Spooky Homemade Marshmallows",
    "a": "ARGOÂ®,  KAROÂ®  and FLEISCHMANN'SÂ®",
    "r": "0",
    "s": 18,
    "des": "\"Homemade marshmallows that you can customize with different flavors and spices make any occasion special.\"",
    "ins": "Combine 1/2 cup water, salt and gelatin in large bowl of a stand mixer. Stir and set aside.\nCombine remaining 1/2 cup water, sugar and corn syrup in a large saucepan over medium heat. Bring to a boil, stirring frequently. Using a candy thermometer, cook until mixture reaches 240 degrees F or soft ball stage.\nGradually pour the hot syrup over the gelatin mixture with the mixer on low. Turn the mixer on its highest speed and beat for 8 minutes. Add vanilla and beat an additional 2 minutes. The mixing bowl will get very full. The marshmallows will become very thick, white and shiny. Spread mixture onto greased baking sheet with sides. For thicker marshmallows, use a 13 x 9-inch pan.\nLet marshmallows cool at least 4 hours or overnight. Combine powdered sugar and corn starch in a shallow pan. Cut the marshmallows into bite-size pieces with a sharp knife or scissors, dropping one at a time into the powdered sugar. Toss to coat well. Store marshmallows in an airtight container in a cool place. Best used within 1 month.",
    "pt": "45 m",
    "ct": "",
    "tt": "",
    "i": "982150.jpg",
    "o": "2095676.jpg,2009665.jpg,1819811.jpg,916320.jpg,914020.jpg,912467.jpg",
    "st": "allrecipes"
}