{
    "id": 228996,
    "old_rating": "4.1",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (14 ounce) can chickpeas (garbanzo beans), drained and rinsed",
        "1/2 cup rolled oats",
        "1/2 cup brown sugar",
        "1/4 cup olive oil",
        "2 teaspoons vanilla extract",
        "1 teaspoon baking powder",
        "1/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "3 cups blueberries",
        "2 tablespoons white sugar",
        "1 tablespoon lemon juice",
        "2 tablespoons cornstarch",
        "1/4 cup cold water",
        "1 1/2 cups rolled oats",
        "1 cup all-purpose flour",
        "1/2 cup brown sugar",
        "1/4 cup olive oil",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon baking soda"
    ],
    "nut": [
        "Calories > 146 kcal",
        "Carbs > 22.7 g",
        "Cholesterol > 0 mg",
        "Fat > 5.2 g",
        "Protein > 2.4 g",
        "Sodium > 136 mg"
    ],
    "n": "Blueberry Squares",
    "a": "Janet",
    "r": "0",
    "s": 24,
    "des": "\"A healthier take on the traditional fruit square. Zero trans fats, so you can add your own by serving with ice cream!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chickpeas, 1/2 cup rolled oats, 1/2 cup brown sugar, 1/4 cup olive oil, 2 teaspoons vanilla extract, baking powder, 1/4 teaspoon baking soda, and salt in a food processor. Blend to a dough-like consistency; press into an 8x11-inch baking pan.\nBake crust in the preheated oven until crisp and lightly browned, 20 minutes.\nCombine blueberries, white sugar, and lemon juice in a saucepan; cook over medium-low heat until blueberries have reduced, 10 to 15 minutes. Whisk cornstarch and water together in a small bowl; stir into blueberry mixture. Cook until mixture thickens, 2 to 3 minutes. Pour blueberry mixture onto the cooked crust.\nMix 1 1/2 cup rolled oats, flour, 1/2 cup brown sugar, 1/4 cup olive oil, 1 teaspoon vanilla extract, and 1/2 teaspoon baking soda together in a large bowl until bread crumb consistency. Sprinkle over blueberry mixture.\nBake in the preheated oven until blueberry filling is bubbling and crumble topping is lightly browned, about 20 minutes. Cool and cut into squares. Store leftovers in refrigerator.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "2 h ",
    "i": "1119164.jpg",
    "o": "",
    "st": "allrecipes"
}