{
    "id": 228975,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "7 large white peaches, peeled and pitted",
        "5 large tomatoes, stems removed",
        "1 large sweet onion, peeled",
        "3 bell peppers - halved, seeded, and stems removed",
        "10 cherry peppers - halved, seeded, and stems removed",
        "5 jalapeno peppers - halved, seeded, and stems removed",
        "4 cloves garlic, peeled",
        "2 cups white sugar",
        "1 cup apple cider vinegar",
        "2 tablespoons liquid smoke flavoring",
        "2 tablespoons herb seasoning (such as BraggÂ® Sprinkle Seasoning) (optional)",
        "1 tablespoon mustard seeds",
        "1 tablespoon canning salt",
        "1 tablespoon cracked black pepper",
        "2 teaspoons celery seeds",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon ground cinnamon",
        "1 (6 ounce) can tomato paste",
        "6 1-pint canning jars with lids and rings"
    ],
    "nut": [
        "Calories > 62 kcal",
        "Carbs > 13.5 g",
        "Cholesterol > 0 mg",
        "Fat > 0.8 g",
        "Protein > 0.8 g",
        "Sodium > 206 mg"
    ],
    "n": "Peach Barbecue Sauce",
    "a": "Karen Barris Calabro",
    "r": "0",
    "s": 48,
    "des": "\"Sweet and spicy, this is a whole bunch tastier than your normal bottled barbecue sauce. I make this from late summer harvested fruits and vegetables and can it for use throughout the year and for holiday gifts. It is very mild, but that can be tweaked if you're so inclined.\"",
    "ins": "Place peaches, tomatoes, onion, bell peppers, cherry peppers, jalapeno peppers, garlic, sugar, vinegar, liquid smoke, herb seasoning, mustard seeds, salt, black pepper, celery seeds, ginger, and cinnamon in a large stockpot. Bring to a boil; cook and stir until peaches and vegetables begin to brown, scraping the bottom of pot frequently to keep from scorching, about 1 hour.\nReduce heat and simmer mixture until softened and slightly reduced, 30 more minutes. Remove from heat.\nPuree mixture using a hand blender until well blended. Pour mixture, about 1 cup at a time, through a fine mesh strainer; press remaining sauce in strainer with a ladle to remove fibrous portions of tomato skins. The strained sauce should be glossy and thick. Stir in tomato paste and blend until smooth.\nSterilize jars and lids in boiling water for at least 5 minutes. Pack the barbeque sauce into the hot sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for at least 30 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "10 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}