{
    "id": 228922,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup olive oil",
        "2 pork neck bones",
        "1 country-style pork rib",
        "1 (8 ounce) beef chuck in 1 piece",
        "1 beef rib, or more to taste",
        "1 lamb shank (optional)",
        "1/4 cup olive oil",
        "1 pinch dried basil, or to taste",
        "1 pinch dried mint, or to taste",
        "1 pinch red pepper flakes, or to taste",
        "1 onion, chopped",
        "1 clove garlic, minced",
        "1 (12 ounce) can tomato paste",
        "2 (28 ounce) cans crushed tomatoes",
        "7 cups water, or as needed",
        "2 pinches dried basil",
        "2 pinches dried mint",
        "2 pinches crushed red pepper flakes",
        "salt and ground black pepper to taste",
        "2 tablespoons olive oil",
        "1 pound bulk Italian sausage",
        "1/2 tablespoon white sugar, or to taste",
        "1 pound ground beef",
        "1/4 pound ground pork",
        "2 eggs",
        "1/2 cup milk",
        "1 cup Italian bread crumbs",
        "1/2 cup chopped Italian flat leaf parsley",
        "1/4 cup grated Parmesan cheese",
        "1 clove garlic, minced",
        "1 1/2 teaspoons olive oil"
    ],
    "nut": [
        "Calories > 527 kcal",
        "Carbs > 25 g",
        "Cholesterol > 110 mg",
        "Fat > 35.8 g",
        "Protein > 28.4 g",
        "Sodium > 869 mg"
    ],
    "n": "North End Sunday Gravy",
    "a": "owensjo",
    "r": "0",
    "s": 12,
    "des": "\"This recipe takes some time but makes a delicious gravy that would make your Italian grandmother proud. The dried mint is not 'minty' at all but rather lends a sweetly herbal flavor to the sauce. You can leave out the lamb shank, but it is the secret ingredient that makes the sauce extra delicious. Many people prefer San MarzanoÂ® tomatoes, but they are expensive and I think our own domestic tomatoes actually make a better sauce.\"",
    "ins": "Heat 1/4 cup olive oil in a stockpot over medium heat. Cook neck bones, country-style pork rib, beef chuck, beef rib, and lamb shank in hot oil, turning regularly, until browned on all sides, 7 to 10 minutes. Remove all the meat to a large bowl.\nPour another 1/4 cup olive oil into the stockpot and heat over medium heat; stir a pinch of basil, a pinch of mint, and a pinch of red pepper flakes into the oil. Cook and stir onions in hot oil until translucent, about 5 minutes. Add garlic; cook and stir 1 minute more. Stir the tomato paste into the onion mixture until incorporated. Pour crushed tomatoes and water into the mixture and bring to a low boil. Add an additional 2 pinches each of basil, mint, and red pepper flakes. Season with salt and black pepper.\nReturn the browned meats to the tomato mixture; bring to a simmer and cook, stirring every 15 minutes, for 2 1/2 hours. Remove the neck bones and discard.\nHeat 2 tablespoons olive oil in a skillet over medium heat. Crumble Italian sausage into the skillet; cook and stir until crumbly, evenly browned, and no longer pink, 5 to 7 minutes. Drain and discard any excess grease. Stir sausage into the tomato sauce with sugar. Return the sauce to a simmer and cook another 1 1/2 hours.\nMix ground beef, ground pork, eggs, milk, Italian bread crumbs, parsley, Parmesan cheese, and garlic with your hands in a large bowl until evenly mixed; shape into 2-inch balls.\nHeat 1 1/2 teaspoons in a skillet over medium heat. Cook the meat balls in hot oil until evenly browned, 5 to 7 minutes.\nAdd meatballs to the tomato sauce. Cook at a simmer for 1 hour, adding water as needed to keep sauce from becoming too thick. Remove stockpot from heat; let sit 2 to 3 minutes. Skim and discard any fat from the top of the sauce.",
    "pt": "30 m",
    "ct": "5 h ",
    "tt": "6 h",
    "i": "2041716.jpg",
    "o": "",
    "st": "allrecipes"
}