{
    "id": 228988,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 pound ground beef",
        "1 clove garlic, minced",
        "1 (14.5 ounce) can diced tomatoes",
        "1 teaspoon Italian seasoning",
        "1 teaspoon salt",
        "1 pound ravioli",
        "2 cups fresh spinach leaves",
        "1/2 cup shredded mozzarella cheese",
        "1/2 cup shredded Cheddar cheese",
        "2 tablespoons shredded Parmesan cheese"
    ],
    "nut": [
        "Calories > 452 kcal",
        "Carbs > 41.7 g",
        "Cholesterol > 88 mg",
        "Fat > 19.4 g",
        "Protein > 27.2 g",
        "Sodium > 1185 mg"
    ],
    "n": "Easy Mouthwatering Baked Ravioli",
    "a": "alicia716",
    "r": "0",
    "s": 4,
    "des": "\"Ridiculously easy but will impress your taste buds! This dish turns ordinary frozen ravioli into a culinary delight!\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C). Grease a 2-quart casserole dish.\nCook and stir ground beef in a skillet over medium heat until the meat is browned and crumbly, 8 to 10 minutes; stir in garlic and cook just until fragrant, about 1 minute. Pour in diced tomatoes and mix in Italian seasoning and salt. Reduce heat to low and cook at a simmer, stirring occasionally, while you complete remaining steps.\nBring a large pot of water to a boil, stir in frozen ravioli, and reduce heat to medium. Cook ravioli until tender, 6 to 7 minutes. Drain.\nPlace half the ravioli into the bottom of the prepared baking dish and cover with layers of half the spinach, half the ground beef sauce, half the mozzarella cheese, half the Cheddar cheese, and 1 tablespoon shredded Parmesan cheese. Repeat layers once more and sprinkle top with remaining 1 tablespoon Parmesan cheese. Cover dish with foil.\nBake in preheated oven until casserole is bubbling and cheese has melted, about 20 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "2558696.jpg",
    "o": "",
    "st": "allrecipes"
}