{
    "id": 229062,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "27 pounds tomatoes, cored",
        "9 carrots",
        "2 cups green peas",
        "3 large onions",
        "1/2 head cabbage",
        "3 cups fresh spinach",
        "1 green bell pepper",
        "1 red bell pepper",
        "2 1/2 cups broccoli florets",
        "1 acorn squash - halved, seeded, and cut into chunks",
        "1 bunch celery, ribs separated",
        "5 cloves garlic, peeled",
        "1/2 cup lemon juice",
        "1/4 cup sea salt",
        "1 tablespoon ground black pepper",
        "14 1-quart canning jars with lids and rings"
    ],
    "nut": [
        "Calories > 63 kcal",
        "Carbs > 13.7 g",
        "Cholesterol > 0 mg",
        "Fat > 0.6 g",
        "Protein > 2.9 g",
        "Sodium > 414 mg"
    ],
    "n": "V9 Juice",
    "a": "cdbolen",
    "r": "0",
    "s": 56,
    "des": "\"A tasty veggie beverage. You can also use it for a great soup base.\"",
    "ins": "Cook tomatoes in a large stock pot over medium heat until tender, about 20 minutes.\nJuice carrots, peas, onions, cabbage, spinach, red and green bell peppers, broccoli, acorn squash, celery, and garlic in a vegetable juicer according to the manufacturer's instructions. Stir the juice and vegetable pulp into the tomatoes and bring mixture to a boil. Mix in lemon juice, sea salt, and black pepper, stirring to dissolve salt. Process the mixture through a food mill to strain out all seeds, skins, and pulp.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the vegetable juice into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 15 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
    "pt": "1 h ",
    "ct": "15 m",
    "tt": "9 h ",
    "i": "2616893.jpg",
    "o": "",
    "st": "allrecipes"
}