{
    "id": 229067,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (12 fluid ounce) can or bottle beer",
        "1/2 cup teriyaki sauce",
        "1 tablespoon chili powder",
        "1 teaspoon garlic powder",
        "8 skinless, boneless chicken breast halves",
        "8 slices Muenster cheese",
        "3 1/2 pounds fresh tomatillos, husks removed",
        "1/2 cup water",
        "1 onion, chopped",
        "6 cloves garlic, chopped, or more to taste",
        "1 pinch salt and ground black pepper to taste",
        "1/4 cup chopped fresh cilantro",
        "1 cup sour cream"
    ],
    "nut": [
        "Calories > 399 kcal",
        "Carbs > 21.8 g",
        "Cholesterol > 98 mg",
        "Fat > 19.1 g",
        "Protein > 33.4 g",
        "Sodium > 948 mg"
    ],
    "n": "Tomatillo Chicken Breasts",
    "a": "Pete Zaria",
    "r": "0",
    "s": 8,
    "des": "\"Tangy tomatillos are a great way to liven up plain old chicken breasts. Serve with Spanish rice, beans, and flour tortillas.\"",
    "ins": "Whisk beer, teriyaki sauce, chili powder, and garlic powder together in a bowl; pour into a resealable plastic bag. Add the chicken, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator 6 to 24 hours.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nRemove chicken from the marinade and shake off excess. Discard the remaining marinade.\nCook the chicken breasts on preheated grill until no longer pink in the center and the juices run clear, 7 to 10 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Arrange chicken breasts in a baking dish and top each with a slice of Muenster cheese.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine tomatillos and water in a large saucepan; bring water to a boil, place cover on saucepan, reduce heat to medium-low, and cook until tomatillos begin to burst, 7 to 10 minutes. Stir onion and garlic into tomatillo sauce; season with salt and pepper; continue cooking at a low boil until onion is tender, about 15 minutes.\nPour tomatillo sauce into a blender. Cover and hold lid down; pulse a few times before leaving on to blend until smooth. Stir sour cream and cilantro into the tomatillo sauce; pour over the chicken and Muenster cheese.\nBake in preheated oven until cheese melts, about 15 minutes.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "6 h ",
    "i": "898206.jpg",
    "o": "",
    "st": "allrecipes"
}