{
    "id": 229027,
    "old_rating": "4.35484",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "6 sweet Italian pork sausage links, casings removed",
        "3 cloves garlic, chopped",
        "1/2 cup butter",
        "3/4 cup all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "3 cups chicken broth",
        "1/2 cup red wine",
        "1 (28 ounce) can crushed tomatoes",
        "1 (1 ounce) package dry onion soup mix",
        "1 (.75 ounce) packet fresh basil leaves, torn",
        "2 (9 ounce) packages frozen tri-color cheese tortellini",
        "2 cups half-and-half",
        "1 tablespoon grated Parmesan cheese, or to taste"
    ],
    "nut": [
        "Calories > 689 kcal",
        "Carbs > 51.2 g",
        "Cholesterol > 117 mg",
        "Fat > 42.4 g",
        "Protein > 24.9 g",
        "Sodium > 2017 mg"
    ],
    "n": "Mom's Creamy Tortellini Tomato Soup",
    "a": "Kathy's Kitchen",
    "r": "0",
    "s": 8,
    "des": "\"This is a creamy, rich, delicious soup. Most of the people I cook for are very picky and this one turned out to be a crowd pleaser. Serve with fresh Italian bread on a cold winter's night! This soup would be great with either chicken or even meatballs instead of sausage; that just happened to be what I had on hand that particular day.\"",
    "ins": "Heat olive oil in a skillet over medium-high heat; cook and stir sausage and garlic until sausage is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease.\nMelt butter in a large stock pot over medium heat; whisk in flour, salt, and black pepper until smooth. Gradually whisk in chicken broth and red wine. Stir in tomatoes and onion soup mix. Simmer until thickened and flavors have blended, 10 to 15 minutes. Stir in cooked sausage and basil. Continue to simmer for 45 minutes, stirring occasionally.\nStir tortellini into soup; simmer until tortellini are tender, about 15 minutes. Add half-and-half, stirring until soup is hot, about 5 minutes more. Serve in large bowls and sprinkle with Parmesan cheese.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1117725.jpg",
    "o": "",
    "st": "allrecipes"
}