{
    "id": 229093,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 egg whites",
        "2 eggs",
        "1 cup low-fat cottage cheese",
        "1 tablespoon olive oil",
        "1 bunch asparagus, trimmed and cut into 1-inch pieces",
        "1/2 white onion, chopped",
        "2 teaspoons olive oil",
        "1 pound peeled and deveined shrimp",
        "salt and ground black pepper to taste",
        "1 (9 inch) unbaked deep-dish pie crust (such as Marie Callender'sÂ®)",
        "1 (8 ounce) package shredded Monterey Jack cheese",
        "3 green onions, chopped"
    ],
    "nut": [
        "Calories > 354 kcal",
        "Carbs > 16.4 g",
        "Cholesterol > 159 mg",
        "Fat > 20.6 g",
        "Protein > 25.5 g",
        "Sodium > 554 mg"
    ],
    "n": "Easy Shrimp and Asparagus Quiche",
    "a": "Melanie",
    "r": "0",
    "s": 8,
    "des": "\"This recipe uses a store-bought pie crust to save time. Prep time is about 15 minutes.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nPour egg whites, eggs, and cottage cheese into a blender; pulse several times to mix and blend until smooth, about 1 minute.\nHeat 1 tablespoon olive oil in a large skillet over medium heat; cook and stir asparagus and onion until asparagus is tender, about 8 minutes.\nHeat 2 teaspoons olive oil in the same skillet over medium heat. Season shrimp with salt and black pepper; cook in hot oil until they turn pink and are no longer translucent in the center, 5 to 8 minutes.\nFit pie crust into a 9-inch deep-dish pie plate and spread shrimp into the crust; top with asparagus mixture. Pour cottage cheese mixture over vegetables and shrimp. Spread Monterey Jack cheese over the top of the quiche. Sprinkle green onions over cheese.\nBake quiche in the preheated oven until cheese topping is lightly browned and the quiche is set in the center, about 1 hour.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4484152.jpg",
    "o": "",
    "st": "allrecipes"
}