{
    "id": 229034,
    "old_rating": "4.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound spicy bulk breakfast sausage",
        "8 fresh sage leaves",
        "1 pound butternut squash, peeled and chopped",
        "2 stalks celery, chopped",
        "2 small carrots, chopped",
        "1 small onion, chopped",
        "1/4 cup sherry",
        "3 cups chicken broth",
        "1 cup beef broth",
        "2 tablespoons brown sugar",
        "1/4 teaspoon pumpkin pie spice",
        "1/4 cup half-and-half",
        "freshly ground black pepper, or to taste",
        "4 teaspoons sour cream"
    ],
    "nut": [
        "Calories > 303 kcal",
        "Carbs > 29.2 g",
        "Cholesterol > 44 mg",
        "Fat > 15.7 g",
        "Protein > 11.5 g",
        "Sodium > 1561 mg"
    ],
    "n": "Butternut Squash Soup With Sage and Sausage",
    "a": "Sarah Waltrip",
    "r": "0",
    "s": 4,
    "des": "\"The is a creamy, slightly sweet, and savory soup that is PERFECT for fall and the holidays! You can buy pre-cut butternut squash at some grocery stores.\"",
    "ins": "Cook and stir pork sausage in a large heavy pot or Dutch oven over medium heat until sausage is browned and crisp, 5 to 8 minutes. Remove sausage with a slotted spoon, leaving drippings in the pot. Brown the sage leaves in the hot drippings until crisp, about 30 seconds; remove sage leaves and set aside.\nCook butternut squash, celery, carrots, and onion in the remaining sausage drippings until the vegetables are softened, stirring only one time after about 5 minutes. Pour sherry into the pot and stir to dissolve any browned bits of food on the bottom of the pot. Pour in chicken and beef broth and stir in brown sugar and pumpkin pie spice. Bring the soup to a boil, reduce heat to low, and simmer until squash is tender, about 20 minutes.\nPuree soup with an immersion blender, leaving a few chunks of vegetables. Pour in half-and-half and season with black pepper. Divide soup into 4 large bowls and top each serving with 1 teaspoon sour cream, cooked sausage, and 2 fried sage leaves.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "1901508.jpg",
    "o": "",
    "st": "allrecipes"
}