{
    "id": 229025,
    "old_rating": "4.65714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound boneless beef round steak",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/2 teaspoon seasoned salt (such as LAWRY'SÂ®)",
        "1 tablespoon all-purpose flour, or as needed",
        "1/4 cup vegetable oil",
        "1 (14.5 ounce) can stewed tomatoes",
        "1 medium onion, chopped",
        "1 green bell pepper, chopped",
        "1/4 cup beef broth",
        "1/2 cup chopped carrots",
        "1/4 cup chopped celery",
        "2 cloves garlic, minced",
        "1 tablespoon all-purpose flour",
        "1/4 teaspoon Worcestershire sauce",
        "1/4 cup shredded sharp Cheddar cheese"
    ],
    "nut": [
        "Calories > 313 kcal",
        "Carbs > 15.8 g",
        "Cholesterol > 46 mg",
        "Fat > 20 g",
        "Protein > 18.6 g",
        "Sodium > 777 mg"
    ],
    "n": "Al's Baked Swiss Steak",
    "a": "Al K",
    "r": "0",
    "s": 4,
    "des": "\"This is a variation on another recipe, which is great as is, but I couldn't make Swiss steak without green peppers or garlic. I also season the meat instead of the flour; it gets a more intense taste that way.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a shallow baking dish.\nCut steak into four portions and pound to 1/4-inch thickness; season with salt, pepper, and seasoned salt. Coat meat evenly with about 1 tablespoon flour.\nHeat oil in a skillet over medium heat. Cook beef in hot oil until browned completely, 3 to 5 minutes per side; transfer to prepared baking dish reserving drippings in the skillet.\nTo the drippings, add tomatoes, onion, green bell pepper, beef broth, carrots, celery, garlic, 1 tablespoon flour, and Worcestershire sauce. Bring the tomato mixture to a boil; cook and stir for 2 minutes. Pour the mixture over the meat in the baking dish. Cover dish with aluminum foil.\nBake until beef is completely tender, about 90 minutes. Sprinkle cheese over beef and return to oven uncovered until cheese is melted, 3 to 5 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "3964911.jpg",
    "o": "",
    "st": "allrecipes"
}