{
    "id": 229007,
    "old_rating": "4.44444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups all-purpose flour",
        "1 cup unprocessed wheat bran",
        "3/4 cup lightly packed brown sugar",
        "1 tablespoon baking powder",
        "1/2 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1 teaspoon salt",
        "1 cup milk",
        "1/2 cup vegetable oil",
        "2 eggs",
        "2 large apples - peeled, cored, and chopped",
        "1/4 cup all-purpose flour",
        "1/4 cup packed brown sugar",
        "1/2 teaspoon ground cinnamon",
        "2 tablespoons cold butter"
    ],
    "nut": [
        "Calories > 287 kcal",
        "Carbs > 40.8 g",
        "Cholesterol > 38 mg",
        "Fat > 12.7 g",
        "Protein > 5 g",
        "Sodium > 407 mg"
    ],
    "n": "Apple Streusel Bran Muffins",
    "a": "gailw",
    "r": "0",
    "s": 12,
    "des": "\"This recipe has 1 cup natural bran which makes this recipe good with fiber. Also can use applesauce or sour cream instead of vegetable oil. I found that a little applesauce with the chopped apples and a little streusel topping in the middle makes a nice middle of muffin if you would like to make a gourmet muffin. I have found\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease 12 muffin cups or line with paper liners.\nWhisk flour, bran, 3/4 cup brown sugar, baking powder, baking soda, 1 teaspoon cinnamon, and salt in a large bowl until thoroughly combined. Beat milk, vegetable oil, and eggs in a separate bowl. Pour liquid ingredients into the flour mixture and stir just until mixed. Gently stir apples into the batter and fill prepared muffin cups about 3/4 full.\nMix 1/4 cup flour and 1/4 cup brown sugar with 1/2 teaspoon cinnamon in a bowl; cut the butter into the brown sugar mixture until the streusel topping is crumbly. Sprinkle about 1 heaping teaspoon of topping onto each muffin.\nBake muffins in the preheated oven until browned and a toothpick inserted into the center of a muffin comes out clean, 25 to 30 minutes.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "1985583.jpg",
    "o": "",
    "st": "allrecipes"
}