{
    "id": 229023,
    "old_rating": "4.64286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 slices bacon",
        "10 links pork sausage links",
        "12 egg, beaten",
        "salt and ground black pepper to taste",
        "2 (8 ounce) packages refrigerated crescent roll dough (such as PillsburyÂ®",
        "1/2 cup salsa",
        "2 cups shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 381 kcal",
        "Carbs > 16.1 g",
        "Cholesterol > 230 mg",
        "Fat > 25.7 g",
        "Protein > 19.8 g",
        "Sodium > 809 mg"
    ],
    "n": "Breakfast Bacon and Sausage Pizza",
    "a": "Erryn Austin",
    "r": "0",
    "s": 12,
    "des": "\"My kids love this and ask for seconds.\"",
    "ins": "Cook bacon in a large skillet over medium-high heat until evenly browned, about 5 minutes per side. Transfer to a plate lined with paper towel to drain and cool.\nCook sausage links in the same skillet until no longer pink in the center, 7 to 10 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Transfer to plate with the bacon to cool and drain.\nDrain most of the grease from the skillet and return to medium heat. Cook and stir eggs until scrambled and no longer wet, about 5 minutes; season with salt and pepper.\nPreheat oven to 350 degrees F (175 degrees C).\nRoll crescent roll dough out to cover bottom of a 9x13-inch baking dish.\nBake dough until golden brown, about 10 minutes.\nSpread salsa in a layer onto the baked dough; top with the scrambled eggs. Crumble the bacon and sprinkle over the eggs. Slice sausage links and scatter evenly among the bacon crumbles. Top the entire pizza with Cheddar cheese.\nBake in oven until cheese is melted and beginning to brown, about 10 minutes. Allow to cool 10 minutes before cutting to serve.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2165523.jpg",
    "o": "",
    "st": "allrecipes"
}