{
    "id": 229087,
    "old_rating": "4.44762",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 acorn squash, halved and seeded",
        "water, as needed",
        "3 tablespoons unsalted butter",
        "1 large sweet onion, chopped",
        "1 large carrot, peeled and chopped",
        "1 clove garlic, minced",
        "3 1/2 cups low-sodium chicken stock",
        "1/4 cup half-and-half",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground cinnamon",
        "1 pinch salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 155 kcal",
        "Carbs > 21 g",
        "Cholesterol > 21 mg",
        "Fat > 7.5 g",
        "Protein > 3.9 g",
        "Sodium > 125 mg"
    ],
    "n": "Roasted Acorn Squash Soup",
    "a": "FutureChefShay",
    "r": "0",
    "s": 6,
    "des": "\"Mellow acorn squash is roasted and blended with other ingredients to create a smooth and delicious soup.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPut squash into a baking dish with the cut side down. Pour enough water into the baking dish to cover the bottom.\nBake in preheated oven until the flesh of the squash is easily pricked with a fork, about 45 minutes. Remove from oven and allow to cool until squash can be handled. Scoop flesh into a bowl and set aside.\nMelt butter in a pot over medium-high heat. Cook onion, carrot, and garlic in melted butter until soft, 5 to 7 minutes. Pour chicken stock into the pot; add the squash.\nBring the mixture to a simmer and cook for 20 minutes.\nPour mixture into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth and return to pot.\nStir half-and-half, nutmeg, and cinnamon through the blended soup; season with salt and pepper. Thin the soup with water if desired.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1073254.jpg",
    "o": "4507008.jpg,4333626.jpg,4071247.jpg,4001911.jpg,3591026.jpg,3367525.jpg",
    "st": "allrecipes"
}