{
    "id": 229147,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 cup chopped green onions",
        "2 cloves garlic, minced",
        "1 (5 ounce) creamy goat cheese log",
        "1/2 cup grated Parmesan cheese",
        "1 pinch cayenne pepper, or more to taste",
        "2 sheets frozen puff pastry, thawed",
        "1/2 pound zucchini, thinly sliced",
        "1/2 pound roma tomatoes, thinly sliced",
        "salt and ground black pepper to taste",
        "1 teaspoon olive oil, or as needed",
        "2 tablespoons thinly sliced basil leaves"
    ],
    "nut": [
        "Calories > 468 kcal",
        "Carbs > 31.1 g",
        "Cholesterol > 18 mg",
        "Fat > 33.8 g",
        "Protein > 11 g",
        "Sodium > 324 mg"
    ],
    "n": "Summer Vegetable and Goat Cheese Galettes",
    "a": "Holly",
    "r": "0",
    "s": 8,
    "des": "\"Easy and pretty vegetable tarts that can be prepared a few hours ahead of time and reheated prior to serving.\"",
    "ins": "Heat 2 tablespoons olive oil in a skillet over medium heat; cook and stir green onions in the hot oil until softened, about 3 minutes. Add garlic; cook until fragrant, about 1 minute. Remove from heat.\nCombine goat cheese, Parmesan cheese, and cayenne pepper in a small bowl; stir with a fork until blended.\nGently flatten each puff pastry sheet with a rolling pin on a lightly floured surface. Cut each sheet into four squares. Lightly cut a border about 1/4-inch from the edges of each square using a sharp knife, not going all the way through the dough.\nPreheat oven to 400 degrees F (200 degrees C).\nArrange puff pastry squares on a baking sheet; spread goat cheese mixture on each square. Top each square with onion mixture. Chill in refrigerator for 5 to 10 minutes.\nArrange zucchini and tomato slices in a pattern on each puff pastry square, allowing vegetables to overlap. Season with salt and black pepper. Drizzle with about 1 teaspoon olive oil.\nBake in the preheated oven until puff pastry is golden brown and puffed, about 20 minutes. Garnish with basil strips.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "3780871.jpg",
    "o": "",
    "st": "allrecipes"
}