{
    "id": 229198,
    "old_rating": "4.23529",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 tablespoon olive oil",
        "1/2 cup finely diced onion",
        "1 (10 ounce) package fresh spinach, chopped",
        "6 large eggs",
        "1/4 cup milk, or as needed",
        "1/4 cup shredded sharp Cheddar cheese",
        "1/4 cup shredded Asiago cheese",
        "1/4 cup grated Parmesan cheese",
        "salt and ground black pepper to taste",
        "3/4 cup imitation crab meat, finely chopped"
    ],
    "nut": [
        "Calories > 90 kcal",
        "Carbs > 2.6 g",
        "Cholesterol > 102 mg",
        "Fat > 5.8 g",
        "Protein > 7.1 g",
        "Sodium > 135 mg"
    ],
    "n": "Mini Spinach and Crab Quiche",
    "a": "Everettrj",
    "r": "0",
    "s": 12,
    "des": "\"Bite-size mini quiches packed with flavor and nutrition. They can be filled with a variety of your favorite meats, cheeses, and veggies, but spinach and crab are a favorite in our family! Serve warm topped with a dollop of sour cream and salsa or just alone as a great portable and easy breakfast.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Spray 24 miniature muffin cups with cooking spray.\nHeat olive oil in a large skillet over medium heat and cook onion until softened, about 2 minutes. Stir spinach into onion and cook, stirring often, until spinach is wilted and onions are translucent, about 3 more minutes. Drain juice.\nBeat eggs with milk in a large bowl until thoroughly combined; stir in Cheddar, Asiago, and Parmesan cheeses and season with salt and black pepper.\nDivide spinach mixture into the prepared muffin cups (about 1 teaspoon per cup) and top spinach with imitation crab meat. Slowly and carefully pour egg-cheese mixture over the imitation crab, filling the mini muffin cups just to the top.\nBake in the preheated oven until the egg is set, 12 to 15 minutes.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "929764.jpg",
    "o": "",
    "st": "allrecipes"
}