{
    "id": 229117,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 large fennel bulbs",
        "2 onions",
        "1/2 cup extra-virgin olive oil",
        "1 cup white wine",
        "1 (16 ounce) package linguine pasta",
        "4 roma (plum) tomatoes, seeded and cut into 1/4-inch dice",
        "2 lemons, juiced",
        "1/4 cup pine nuts",
        "1 cup freshly shaved Parmesan cheese"
    ],
    "nut": [
        "Calories > 481 kcal",
        "Carbs > 57.2 g",
        "Cholesterol > 7 mg",
        "Fat > 20.2 g",
        "Protein > 13.9 g",
        "Sodium > 236 mg"
    ],
    "n": "Pasta with Fennel and Onions",
    "a": "cookinwithmom",
    "r": "0",
    "s": 8,
    "des": "\"We took a cooking class and this is the recipe that we learned. We LOVE it! The fennel gives the flavor palette a unique twist. We combine it with Allrecipes' Grilled Sausage with Pepperonatta for a family-style feast!\"",
    "ins": "Trim fennel bulbs, cut in half lengthwise, and remove tough cores. Thinly slice fennel bulb halves lengthwise. Peel onions, slice in half lengthwise, and thinly slice onions lengthwise.\nHeat olive oil in a large skillet over medium heat; cook and stir fennel and onions until onions are translucent, about 8 minutes. Pour in white wine, turn heat up to medium-high, and cook, stirring often, until the wine has nearly evaporated and fennel and onions begin to brown, 8 to 10 minutes.\nBring a large pot of lightly salted water to a boil; cook the linguine at a boil until tender yet firm to the bite, about 11 minutes; drain and keep warm. Reserve 1/4 cup of pasta water.\nStir tomatoes into the fennel mixture and cook until the tomatoes soften, about 3 minutes. Mix lemon juice and pine nuts into the vegetables.\nStir linguine into the fennel mixture and mix in reserved pasta water. Cook pasta and vegetables over high heat, stirring until hot and thoroughly combined, about 2 minutes. Serve in a large serving bowl topped with Parmesan cheese.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "1331830.jpg",
    "o": "",
    "st": "allrecipes"
}