{
    "id": 229124,
    "old_rating": "4.48387",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 red bell peppers - tops and seeds removed",
        "3 eggs, beaten",
        "3 cups meatless spaghetti sauce",
        "1 1/4 cups instant rice",
        "1/4 cup finely chopped onion",
        "1 teaspoon salt",
        "1 1/2 teaspoons Worcestershire sauce",
        "1 pinch ground black pepper",
        "1 1/2 pounds lean ground beef",
        "2 cups meatless spaghetti sauce",
        "6 tablespoons shredded Cheddar cheese, divided"
    ],
    "nut": [
        "Calories > 595 kcal",
        "Carbs > 53.4 g",
        "Cholesterol > 183 mg",
        "Fat > 25.7 g",
        "Protein > 34.9 g",
        "Sodium > 1405 mg"
    ],
    "n": "Classic Beef Stuffed Peppers",
    "a": "Barry LaRoche",
    "r": "0",
    "s": 6,
    "des": "\"Stuffed red bell peppers are filled with savory beef and rice and baked with prepared spaghetti sauce for a hearty dish that doesn't need a lot of preparation.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large saucepan of water to a boil, reduce heat to medium, and cook red bell peppers in the boiling water until slightly softened, about 5 minutes. Drain and rinse peppers with cold water.\nStir eggs, 3 cups of spaghetti sauce, instant rice, onion, salt, Worcestershire sauce, and black pepper together in a bowl. Crumble ground beef into the mixture and stir until ground beef is thoroughly combined with sauce and rice mixture.\nStand peppers in a large baking dish and fill each pepper with beef mixture. Pour 2 cups spaghetti sauce over the peppers. Cover dish with aluminum foil.\nBake in the preheated oven until peppers are tender, the filling is set, and an instant-read meat thermometer inserted into the middle of a pepper reads at least 160 degrees F (70 degrees C), 55 to 60 minutes. Uncover and top each pepper with 1 tablespoon Cheddar cheese.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4313211.jpg",
    "o": "3976923.jpg,3907084.jpg,3889032.jpg,3108976.jpg,2095598.jpg,1763578.jpg",
    "st": "allrecipes"
}