{
    "id": 229113,
    "old_rating": "4.78125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups half-and-half",
        "1 1/2 cups coconut milk",
        "2 eggs, beaten",
        "3/4 cup white sugar",
        "1/2 cup cornstarch",
        "1/4 teaspoon salt",
        "3/4 cup flaked coconut",
        "1 teaspoon vanilla extract",
        "1 (9 inch) baked pie crust",
        "3 egg whites",
        "1/4 teaspoon cream of tartar",
        "6 tablespoons white sugar",
        "1/2 cup flaked coconut"
    ],
    "nut": [
        "Calories > 632 kcal",
        "Carbs > 73.5 g",
        "Cholesterol > 84 mg",
        "Fat > 34.9 g",
        "Protein > 9.2 g",
        "Sodium > 381 mg"
    ],
    "n": "Coconut Cream Meringue Pie",
    "a": "Mad Butcher",
    "r": "0",
    "s": 6,
    "des": "\"This is a pie that was created for our daughter's birthday. She loved her grandmother's coconut cream pie. We did not have the exact recipe so we came up with this. It could take up to 30 minutes for the custard to get thick and come to a boil.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nStir half-and-half, coconut milk, eggs, 3/4 cup sugar, cornstarch, and salt together in a saucepan; stirring constantly, slowly bring to a boil over low heat and cook until thick, about 30 minutes. Remove saucepan from heat; fold 3/4 cup coconut into the mixture with the vanilla extract. Pour the coconut mixture into the baked pie crust.\nBeat egg whites in a glass or metal bowl until foamy. Gradually add cream of tartar and 6 tablespoons white sugar, continuing to beat until soft peaks form. Lift your beater or whisk straight up: the egg whites will form soft mounds rather than a sharp peak. Spread egg white mixture over the pie. Sprinkle 1/2 cup coconut over the pie.\nBake in preheated oven until the top is golden brown, 12 to 15 minutes. Move to a wire rack to cool until completely cooled to the touch, about 1 hour. Refrigerate at least 3 hours before serving.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "5 h ",
    "i": "1116623.jpg",
    "o": "4282772.jpg,4208617.jpg,4190069.jpg,3933157.jpg,3636568.jpg,3449355.jpg",
    "st": "allrecipes"
}