{
    "id": 229210,
    "old_rating": "4.46429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 pound lean ground beef",
        "1/2 cup chopped green onion",
        "1 (1 ounce) package taco seasoning mix, divided",
        "1 (10.75 ounce) can  tomato soup",
        "1 (10.75 ounce) can  condensed nacho cheese soup (such as Campbell'sÂ® Fiesta Nacho Cheese Soup)",
        "1 (10.75 ounce) can  milk",
        "1 (32 ounce) package frozen bite-size potato nuggets (such as Tater TotsÂ®)",
        "1 1/2 cups shredded Mexican cheese blend"
    ],
    "nut": [
        "Calories > 500 kcal",
        "Carbs > 41.7 g",
        "Cholesterol > 66 mg",
        "Fat > 29.9 g",
        "Protein > 21.7 g",
        "Sodium > 1402 mg"
    ],
    "n": "Fiesta Tater TotÂ® Casserole",
    "a": "2macs114",
    "r": "0",
    "s": 8,
    "des": "\"We invented this recipe one night after one of us wanted Tater TotÂ® casserole for supper, while the other wanted Mexican...It's SUPER easy and SUPER yummy! Baking the Tater TotsÂ® before layering may be unnecessary but we wanted to make sure they had a chance to crisp up. The whole family LOVED this dish! Hope you do too!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch casserole dish with cooking spray.\nHeat a large skillet over medium-high heat and stir in ground beef, green onion, and 1/2 package taco seasoning. Cook and stir mixture until the beef is crumbly, evenly browned, and no longer pink, about 10 minutes. Drain and discard any excess grease.\nCombine remaining taco seasoning mix with tomato soup, nacho cheese soup, and milk in a saucepan; heat soup mixture until just boiling.\nLayer potato nuggets in the prepared casserole dish.\nBake in the preheated oven until potato nuggets begin to crisp, about 10 minutes.\nSpoon ground beef mixture over potato nuggets; pour in soup mixture.\nBake until soup mixture is bubbling, 15 to 20 minutes. Sprinkle casserole with Mexican cheese blend; bake until cheese is melted, 5 to 10 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "1260504.jpg",
    "o": "",
    "st": "allrecipes"
}