{
    "id": 229261,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon melted butter, or as needed",
        "1 tablespoon all-purpose flour, or as needed",
        "2 3/4 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1 1/2 teaspoons baking soda",
        "1 teaspoon salt",
        "3/4 cup unsalted butter",
        "1 cup white sugar",
        "3 room-temperature eggs",
        "2 teaspoons vanilla extract",
        "1 pint sour cream",
        "2 cups blueberries",
        "3/4 cup brown sugar",
        "3/4 cup chopped walnuts",
        "1 teaspoon ground cinnamon"
    ],
    "nut": [
        "Calories > 373 kcal",
        "Carbs > 44.4 g",
        "Cholesterol > 72 mg",
        "Fat > 20.2 g",
        "Protein > 5.4 g",
        "Sodium > 347 mg"
    ],
    "n": "Blueberry Streusel Coffee Cake",
    "a": "Joan Dalessandro",
    "r": "0",
    "s": 16,
    "des": "\"Tube-pan sized cake for winter warmings! Heartwarming on a cold, snowy day.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Coat the inside of a tube pan with 1 tablespoon melted butter and 1 tablespoon flour.\nCombine 2 3/4 cup flour, baking powder, baking soda, and salt in a bowl.\nBeat butter and sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add eggs one at a time, allowing each egg to blend into butter mixture before adding the next. Beat vanilla into the mixture with the last egg. Pour flour mixture alternately with the sour cream into the butter mixture, mixing until just incorporated into a batter.\nMix blueberries, brown sugar, walnuts, and cinnamon.\nSpread about 1/3 the batter into the bottom of the prepared pan. Sprinkle about 1/3 the blueberry mixture over the batter layer. Spread about 1/2 the remaining batter over the blueberry mixture; top with about 1/3 the remaining blueberry mixture. Spread remaining batter over the blueberry mixture. Top with remaining blueberry mixture.\nBake in the preheated oven until golden and the tops spring back when lightly pressed, 60 to 65 minutes.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1001812.jpg",
    "o": "",
    "st": "allrecipes"
}