{
    "id": 229253,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 whole chicken",
        "1 large onion, peeled and root trimmed",
        "water to cover",
        "1 tablespoon whole black peppercorns",
        "4 carrots, peeled and sliced",
        "4 parsnips, peeled and sliced",
        "1 cup diced celery",
        "1 (16 ounce) package egg noodles",
        "2 tablespoons chopped fresh parsley, or to taste",
        "salt to taste"
    ],
    "nut": [
        "Calories > 823 kcal",
        "Carbs > 71.2 g",
        "Cholesterol > 135 mg",
        "Fat > 46.5 g",
        "Protein > 29.9 g",
        "Sodium > 444 mg"
    ],
    "n": "Home Made Chicken Noodle Soup!",
    "a": "Balazs",
    "r": "0",
    "s": 6,
    "des": "\"This is an easy-to-make recipe from my Hungarian mother. No stock, no bouillon, and some peppercorn and parsnip are used for a bit of bite. If you don't have a metal tea-ball or herb bag, you can seal the peppercorn in a piece of cheesecloth tied with some kitchen twine. This way we get all of the pepper and none of the hassle. Keep noodles and soup separate until serving. If you mix the noodles in with the broth, they will get soggy and overcooked.  If you have leftovers, store the noodles and soup separate or make a new batch of noodles the next day.\"",
    "ins": "Place chicken and whole onion into the bottom of a large pot. Pour enough water over the chicken to cover completely. Put peppercorns in a metal tea ball; add to the pot.\nBring water to a boil, reduce heat to medium-low, and cook at a simmer until the chicken until no longer pink and is falling off the bone, 40 to 60 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C).\nRemove chicken from the broth with a slotted spoon to a bowl; set aside to cool.\nRemove the onion and give it a squeeze to get as much of the flavor as possible. Discard the onion.\nStir carrots, parsnips, and celery into the broth; bring to a boil and cook vegetables until tender, 10 to 15 minutes. Remove and discard peppercorns.\nWhile the vegetables boil, bring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain. Divide between 6 soup bowls.\nRemove meat from chicken and discard bones. Cut meat into bite-size chunks and stir into vegetable mixture with parsley. Season with salt. Ladle soup over noodles to serve.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "907368.jpg",
    "o": "",
    "st": "allrecipes"
}