{
    "id": 229266,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (2 1/2 pound) boneless pork loin roast",
        "salt and ground black pepper to taste",
        "1/2 cup orange marmalade, divided",
        "1 tablespoon chopped fresh rosemary",
        "1/2 cup orange juice",
        "1 tablespoon olive oil",
        "1 pound parsnips, peeled and cut into 1-inch wedges",
        "2 red onions, cut into 1-inch wedges"
    ],
    "nut": [
        "Calories > 667 kcal",
        "Carbs > 55.4 g",
        "Cholesterol > 138 mg",
        "Fat > 28.5 g",
        "Protein > 47.9 g",
        "Sodium > 136 mg"
    ],
    "n": "Marmalade Glazed Pork Roast",
    "a": "DARTANYUN",
    "r": "0",
    "s": 4,
    "des": "\"A simple two-ingredient glaze creates a browned crust on the pork and flavors the vegetables, too.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nPlace pork roast in a large roasting pan and season liberally with salt and black pepper. Spread half the orange marmalade over the roast; mix the remaining marmalade with rosemary in a large bowl. Stir orange juice and olive oil into rosemary mixture.\nCombine parsnips and onions in another bowl. Add about 2 tablespoons orange marmalade mixture; toss to coat. Arrange vegetables around pork roast.\nBake pork in preheated oven for 30 to 45 minutes. Pour remaining orange juice mixture over pork. Increase oven heat to 450 degrees F (230 degrees C) and continue to cook until pork is slightly pink in the center, 15 to 20 more minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\nTransfer roast to a cutting board and cover lightly with aluminum foil. Toss vegetables in pan juices and return roasting pan to oven. Continue cooking until juices have thickened and vegetables are browned, about 10 minutes more. Slice pork and serve with vegetables and pan juices.",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "993996.jpg",
    "o": "",
    "st": "allrecipes"
}