{
    "id": 229231,
    "old_rating": "4.59375",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package vegetarian sausage links (such as Morningstar FarmsÂ®)",
        "1/2 cup water, or more as needed",
        "4 cups shredded sweet potatoes",
        "1/4 cup butter, melted",
        "1 1/2 (8 ounce) packages shredded, reduced-fat mild Cheddar-mozzarella cheese blend",
        "1/2 cup finely chopped onion",
        "1 cup finely sliced fresh spinach leaves",
        "1 (16 ounce) container low-fat small curd cottage cheese",
        "8 jumbo eggs"
    ],
    "nut": [
        "Calories > 268 kcal",
        "Carbs > 13.8 g",
        "Cholesterol > 180 mg",
        "Fat > 14.3 g",
        "Protein > 21.9 g",
        "Sodium > 607 mg"
    ],
    "n": "Sweet Potato Breakfast Casserole",
    "a": "Zafah7",
    "r": "0",
    "s": 12,
    "des": "\"This is a lighter twist on a delicious breakfast casserole for the carb-conscious and the vegetarians! Serve immediately or refrigerate overnight and serve the next day!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x13-inch baking dish.\nPlace sausage in a large skillet and pour in about 1/4 inch of water; cook sausage over medium heat until water evaporates and sausages are evenly browned, 10 to 15 minutes. Crumble cooked sausages into a bowl.\nMix sweet potatoes and butter together in a bowl; evenly spread into the bottom of the prepared 9x13-inch dish.\nStir Cheddar-mozzarella cheese blend, onion, spinach, cottage cheese, eggs, and crumbled sausage together in a large bowl; spoon over sweet potato layer.\nBake casserole in the preheated oven until a toothpick inserted in the center comes out clean and eggs are set, about 1 hour. Cool 5 minutes before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4458058.jpg",
    "o": "3419498.jpg,2536106.jpg,1867926.jpg,1748582.jpg,1659357.jpg,1618316.jpg",
    "st": "allrecipes"
}