{
    "id": 229250,
    "old_rating": "4.125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon butter",
        "1 sweet onion (such as Vidalia), minced",
        "1 clove garlic, minced",
        "1 (12 fluid ounce) can or bottle light beer",
        "4 cups chicken broth",
        "2 cups milk",
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "1 cup shredded Gouda cheese",
        "1/2 cup shredded sharp white Cheddar cheese",
        "1/2 teaspoon ground black pepper",
        "4 slices cooked bacon, crumbled",
        "1/4 cup chopped fresh chives"
    ],
    "nut": [
        "Calories > 322 kcal",
        "Carbs > 13.9 g",
        "Cholesterol > 71 mg",
        "Fat > 21.5 g",
        "Protein > 14.2 g",
        "Sodium > 1097 mg"
    ],
    "n": "Beer and Gouda and Soup",
    "a": "winofoodie",
    "r": "0",
    "s": 6,
    "des": "\"A delicious rich, creamy soup with beer, Gouda, Cheddar, bacon and chives. Perfect for those chilly days. This is my copycat recipe of a dish I had at a popular chain restaurant, where it is served with warm pretzel sticks. I also like to serve it with a warm pretzel roll.\"",
    "ins": "Melt 1 teaspoon butter in a large saucepan over medium heat; add sweet onion and cook until softened, about 4 minutes. Stir garlic into the onion; cook and stir together until garlic is fragrant, about 1 minute. Pour light beer into the saucepan, bring to a simmer, and cook until onion is completely tender, about 10 minutes.\nStir chicken broth into the beer mixture; bring to a boil. Stream milk into the saucepan while stirring to form the base of the soup.\nHeat 1/4 cup butter in a microwave-safe bowl in microwave oven until melted and hot, 30 to 60 seconds. Stir flour into the melted butter until the mixture binds into a roux; pour into the soup. Cook and stir soup until it begins to simmer and thicken, 7 to 10 minutes.\nRemove soup from heat. Melt Gouda cheese and Cheddar cheese into the soup a handful at a time, stirring each addition into the liquid until smooth; season with black pepper. Ladle soup into bowls; garnish with bacon and chives to serve.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "946858.jpg",
    "o": "",
    "st": "allrecipes"
}