{
    "id": 229333,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 sweet onion, cut into strips",
        "salt and ground black pepper to taste",
        "1/2 pound lean ground beef",
        "1 egg",
        "1/2 cup shredded Mexican cheese blend",
        "1/3 cup bread crumbs",
        "1/3 cup honey",
        "1 teaspoon dried oregano",
        "1 teaspoon cayenne pepper"
    ],
    "nut": [
        "Calories > 479 kcal",
        "Carbs > 45.9 g",
        "Cholesterol > 133 mg",
        "Fat > 23.4 g",
        "Protein > 23.8 g",
        "Sodium > 333 mg"
    ],
    "n": "Skillet Honey Beef",
    "a": "Willowmyer",
    "r": "0",
    "s": 3,
    "des": "\"This is an unusual dish due to the range of flavors, but it is very flavorful and unique. The listed quantities are a guideline; adjust according to how spicy or sweet you like, and it's fantastic. One night we had leftover hamburger but no one wanted burgers/meatloaf, and I was pining for honey mustard chicken strips. After a little pantry digging, I scraped the recipe together and it was a hit. Been making it ever since. This can be a stand-alone meal or served over rice. During the cooking phase, taste the mixture to determine if it is too spicy or sweet. If too spicy, add honey by the teaspoon until it's to your liking. If too sweet, add extra ground beef to dilute the honey. Of you want to make it heartier, add 2 cups chopped mushrooms to the onions and 1/2 cup peas.\"",
    "ins": "Heat olive oil in a large skillet over high heat. Add onion to skillet; season with salt and black pepper. Cook and stir onion until tender, 5 to 7 minutes.\nMix ground beef, egg, cheese, bread crumbs, honey, oregano, and cayenne pepper in a bowl to evenly combine; crumble beef mixture into skillet. Cook and stir beef mixture with the onion until beef is completely browned, 8 to 10 minutes. Drain liquid from skillet. Return skillet to medium heat.\nLet beef mixture cook unstirred until bread crumbs on bottom begin to get crisp, about 2 minutes. Turn and cook until remaining bread crumbs are crisp, about 2 minutes more. Repeat as needed to crisp the bread crumbs and give the dish a crunchy texture.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "1043560.jpg",
    "o": "",
    "st": "allrecipes"
}