{
    "id": 229336,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 (.25 ounce) packages unflavored gelatin (such as Knox Â®)",
        "3 tablespoons blue fruit-flavored gelatin mix (such as JELL-OÂ®)",
        "4 cups white grape juice",
        "4 cups ice",
        "1 cup rock candy, or as needed",
        "1 8-cup fish bowl",
        "1 sprig fresh mint",
        "8 gummy fish candies",
        "hot water"
    ],
    "nut": [
        "Calories > 223 kcal",
        "Carbs > 53.1 g",
        "Cholesterol > 0 mg",
        "Fat > 0.1 g",
        "Protein > 3.9 g",
        "Sodium > 25 mg"
    ],
    "n": "JELL-OÂ® Aquarium",
    "a": "PLee",
    "r": "0",
    "s": 8,
    "des": "\"Very fun for a party! I used KnoxÂ® Gelatin and a bit of blue JELL-OÂ® because I wanted the 'water' to appear very clear. But blue or green JELL-OÂ® would work just as well. Note that the amount of KnoxÂ® or JELL-OÂ® will relate to the size of the fish bowl you use. My 'fish bowl' is a square flower vase that holds 8 cups of water. Follow the directions on the box.\"",
    "ins": "Mix unflavored gelatin and fruit-flavored gelatin in a bowl.\nBring grape juice to a boil in a saucepan; pour over gelatin mixture and stir until gelatin is dissolved. Immediately add ice cubes and stir until ice is melted. The mixture should be cold, slightly set, but still pourable. If needed, refrigerate mixture to chill, as any heat could melt the rock candy.\nSpread rock candy into the bottom of the fish bowl to cover. Pour enough of the chilled gelatin mixture over the rock candy to cover by about 4 inches.\n'Plant' the mint sprig into the rock candy bottom. If the mixture is set enough, the  mint won't float. It the mint floats, remove it and put the partially filled bowl into the fridge until it's nearly set and can support the mint. Once the mint is planted, carefully pour remaining gelatin mixture into the bowl; refrigerate until more set, 8 to 10 minutes.\nDip a long sharp knife into hot water and use it make vertical slices in the gelatin. Use skewer or chopstick to position gummy fish into the 'water.' If you're gentle, the gelatin will 'heal' around the insertion after the fish are positioned. If the top of the gelatin is bumpy, dip a spoon into hot water and use the back of it to smooth the surface.\nRefrigerate until fully set, about 30 minutes.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "1 h ",
    "i": "906181.jpg",
    "o": "",
    "st": "allrecipes"
}