{
    "id": 229340,
    "old_rating": "4.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 ounces cream cheese, softened",
        "1 cup shredded Cheddar cheese",
        "1/4 cup creamy salad dressing (such as Miracle WhipÂ®)",
        "3 green onions, thinly sliced",
        "4 slices cooked bacon, crumbled",
        "1 teaspoon dried dill weed",
        "1/2 teaspoon dried thyme",
        "1/4 teaspoon black pepper",
        "1/2 teaspoon kosher salt",
        "2 dashes Worcestershire sauce",
        "1 pinch cayenne pepper, or to taste",
        "1 tablespoon dried dill weed, or to taste",
        "1 tablespoon parsley flakes, or to taste"
    ],
    "nut": [
        "Calories > 134 kcal",
        "Carbs > 1.7 g",
        "Cholesterol > 36 mg",
        "Fat > 12.2 g",
        "Protein > 4.7 g",
        "Sodium > 262 mg"
    ],
    "n": "Boule de Fromage aux Herbes et au Bacon",
    "a": "Doc Simonson",
    "r": "0",
    "s": 16,
    "des": "\"Okay. The title might seem a bit pretentious, but would anyone really look at Cheese Ball XXXVIII? This is a delicious variation on the holiday cheese ball that has been in my family for close to 40 years. It is perfect served on crusty bread or crackers. One of the nice things about most cheese ball recipes is the versatility. If you want a spicier ball, try substituting a 1/2 cup of pepper jack for the Cheddar. Don't like bacon? Use Nova lox instead. Don't like dill? Fugedabowdit! Dill makes this recipe sing! But you can play with the herbs used in the cheese ball. Who doesn't like playing with their food? Serve with crackers or a good bread. Also goes well as a spread for crudites.\"",
    "ins": "Mix cream cheese, Cheddar cheese, salad dressing, green onions, bacon, 1 teaspoon dill, thyme, black pepper, kosher salt, Worcestershire, and cayenne pepper in a bowl until ingredients are evenly distributed. Cover bowl with plastic wrap.\nRefrigerate cheese mixture for 2 hours.\nMix 1 tablespoon dill and parsley in a small bowl; spread onto a clean work surface.\nShape cheese mixture into a ball; roll in dill and parsley to coat.",
    "pt": "20 m",
    "ct": "",
    "tt": "",
    "i": "916780.jpg",
    "o": "",
    "st": "allrecipes"
}