{
    "id": 229380,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (29 ounce) can cut sweet potatoes, drained",
        "1 (14 ounce) can sweetened condensed milk",
        "3 eggs",
        "1/4 cup butter, melted",
        "2 teaspoons vanilla extract",
        "1/2 cup flour",
        "1/2 cup white sugar",
        "1/2 cup brown sugar",
        "1 teaspoon cornstarch",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground nutmeg",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon salt",
        "2 (9 inch) unbaked pastry pie shells",
        "1 1/2 cups miniature marshmallows, divided"
    ],
    "nut": [
        "Calories > 362 kcal",
        "Carbs > 54.7 g",
        "Cholesterol > 51 mg",
        "Fat > 13.6 g",
        "Protein > 5.8 g",
        "Sodium > 268 mg"
    ],
    "n": "Creamy Sweet Potato Pie",
    "a": "MarieLizette",
    "r": "0",
    "s": 16,
    "des": "\"A rich creamy pie that fills the home with the smell of autumn. Also a nice substitute for those people who like the taste of pumpkin spice but not the custardy texture.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Set rack to center of the oven and place a cookie sheet on baking rack.\nWhip sweet potatoes in a mixing bowl with an electric hand mixer until soft. Add sweetened condensed milk, eggs, butter, and vanilla extract; continue blending until incorporated. Blend flour, white sugar, brown sugar, cornstarch, cinnamon, nutmeg, baking powder, and salt into the sweet potato mixture.\nDivide sweet potato mixture between the pie shells. Cover pies with aluminum foil.\nBake in preheated oven for 10 minutes.\nReduce heat to 300 degrees F (150 degrees C).  Continue baking pies uncovered until a toothpick inserted into the center comes out clean, about 40 more minutes.\nRemove aluminum foil and pile marshmallows into the center of each pie. Return to oven and continue baking until marshmallows are golden brown, about 10 minutes. Allow pies to cool before serving.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}