{
    "id": 229361,
    "old_rating": "4.21053",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds ground beef",
        "1 teaspoon seasoned salt",
        "1 onion, finely chopped",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground cloves",
        "2 cups hot water",
        "1/4 cup all-purpose flour",
        "2 (10.75 ounce) cans golden mushroom soup (such as Campbell'sÂ®)",
        "1 (16 ounce) container sour cream",
        "1/4 cup dried parsley",
        "2 teaspoons dry mustard",
        "2 teaspoons salt, or to taste",
        "2 teaspoons ground black pepper, or to taste",
        "1 (16 ounce) package egg noodles"
    ],
    "nut": [
        "Calories > 571 kcal",
        "Carbs > 55.1 g",
        "Cholesterol > 127 mg",
        "Fat > 26.9 g",
        "Protein > 26.4 g",
        "Sodium > 1334 mg"
    ],
    "n": "Creamy Beef Stroganoff",
    "a": "Tracy Charles Sunley",
    "r": "0",
    "s": 8,
    "des": "\"I have been making this recipe for almost 20 years. It was the recipe my mom always made for us. Now my kids love it, too! It's always a hit, even with friends and family who do not normally care for Stroganoff. Goes great with rolls. Also, I have tried using reduced-fat and fat-free sour cream. Turns out okay with reduced fat but I did not like it with the fat-free sour cream.\"",
    "ins": "Crumble ground beef into a large skillet over medium heat; sprinkle with seasoned salt. Cook and stir until completely browned, 7 to 10 minutes. Drain excess grease from skillet and return to heat. Stir onion, nutmeg, and cloves into the beef.\nWhisk hot water and flour together in a bowl until smooth; pour over beef mixture and mix. Stir mushroom soup into the beef mixture. Place a cover on the skillet. Reduce heat to medium-low. Stirring occasionally, cook at a simmer until thickened, about 30 minutes.\nWhisk sour cream, parsley, and dry mustard together in a bowl. Stir sour cream mixture into the beef mixture; season with salt and black pepper. Continue cooking at a simmer uncovered until hot, 15 to 20 minutes.\nBring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water until cooked through but firm to the bite, about 5 minutes; drain. Transfer noodles to a large bowl. Ladle beef mixture over the noodles and mix.",
    "pt": "10 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4440114.jpg",
    "o": "",
    "st": "allrecipes"
}