{
    "id": 229359,
    "old_rating": "4.42105",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound ground beef",
        "1/2 cup rolled oats",
        "1 egg, beaten",
        "2 tablespoons Worcestershire sauce",
        "2 tablespoons ketchup",
        "2 tablespoons water",
        "1 1/2 teaspoons dried minced onion",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 large onion, sliced into rings",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1 (10.75 ounce) can milk"
    ],
    "nut": [
        "Calories > 260 kcal",
        "Carbs > 15.4 g",
        "Cholesterol > 81 mg",
        "Fat > 14.2 g",
        "Protein > 17.5 g",
        "Sodium > 710 mg"
    ],
    "n": "Easy Salisbury Steak",
    "a": "Kendrick",
    "r": "0",
    "s": 6,
    "des": "\"My mom would make this for us growing up. It was one of those easy dinners that we all loved to eat at the family table. Now we are still passing it down. My 17-month-old daughter LOVES this recipe. You can add other vegetables if you want (i.e. green onions, fennel, mushrooms, etc.). It can also be made with ground pork.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nMix ground beef, oats, egg, Worcestershire sauce, ketchup, water, dried minced onion, salt, and pepper in a bowl until evenly combined; shape into 6 oval-shaped patties.\nHeat a large skillet over medium heat. Cook patties in hot skillet until browned completely, 2 minutes per side. Transfer browned patties to a baking dish.\nTop patties with onion rings. Stir mushroom soup and milk together in a bowl; pour over patties. Cover baking dish with aluminum foil.\nBake in preheated oven until firm, hot, and grey in the center, about 45 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "995431.jpg",
    "o": "",
    "st": "allrecipes"
}