{
    "id": 229312,
    "old_rating": "4.56757",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound sausage, casings removed",
        "2 cups sliced fresh mushrooms",
        "8 eggs, beaten",
        "10 cups cubed, day-old bread",
        "3 cups whole milk",
        "2 cups shredded Cheddar cheese",
        "1 1/2 cups cubed Black Forest ham",
        "1 (10 ounce) package frozen chopped spinach, thawed and drained",
        "2 tablespoons all-purpose flour",
        "2 tablespoons mustard powder",
        "1 teaspoon salt",
        "2 teaspoons butter, melted",
        "2 teaspoons dried basil"
    ],
    "nut": [
        "Calories > 600 kcal",
        "Carbs > 32 g",
        "Cholesterol > 256 mg",
        "Fat > 37.2 g",
        "Protein > 34.2 g",
        "Sodium > 1738 mg"
    ],
    "n": "Breakfast Strata",
    "a": "Robynnsmom",
    "r": "0",
    "s": 8,
    "des": "\"My grandmother makes this every Christmas morning, and it's amazing. My husband hates eggs and he always has seconds, even my 1- and 2-year-old gobble this up. Perfect for breakfast, lunch, or dinner! Ingredients are forgiving; add your favorites or spice it up. Just make sure your veggies are not going to water it down.\"",
    "ins": "Generously grease a 9x13-inch casserole dish.\nHeat a skillet over medium heat; cook and stir sausage until crumbly and completely browned, about 10 minutes. Transfer cooked sausage to the prepared casserole dish.\nCook and stir mushrooms in the same skillet over medium heat until liquid has been released and mushrooms are lightly browned, 5 to 10 minutes; drain.\nMix mushrooms, eggs, bread, milk, Cheddar cheese, ham, spinach, flour, mustard powder, salt, butter, and basil together in a large bowl; pour over sausage. Cover casserole dish and refrigerate, 2 hours to overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in the preheated oven until a knife inserted into the center of the strata comes out clean, 60 to 70 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "3 h ",
    "i": "2918348.jpg",
    "o": "4524930.jpg,4519229.jpg,4503616.jpg,4503615.jpg,1709295.jpg,1084334.jpg",
    "st": "allrecipes"
}