{
    "id": 229429,
    "old_rating": "3.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil",
        "1/4 cup lemon juice",
        "2 teaspoons Italian seasoning",
        "1 teaspoon kosher salt",
        "1/2 teaspoon ground black pepper",
        "1 pound pork tenderloin, thinly sliced crosswise",
        "1/4 cup dry bread crumbs",
        "1/4 cup grated Parmesan cheese",
        "2 cloves garlic, chopped, or more to taste",
        "1 tablespoon olive oil",
        "1 tablespoon canola oil",
        "1 sprig fresh parsley, or as desired"
    ],
    "nut": [
        "Calories > 306 kcal",
        "Carbs > 8 g",
        "Cholesterol > 53 mg",
        "Fat > 21.3 g",
        "Protein > 20.8 g",
        "Sodium > 649 mg"
    ],
    "n": "Pan-Seared Marinated Pork Cutlets with a Parmesan-Garlic Crust",
    "a": "toastyfrenchy",
    "r": "0",
    "s": 4,
    "des": "\"Quick-cooking pork cutlets in a lemony marinade are topped off with a flavorful crust. Easy and quick enough for a weeknight, fancy and flavorful enough for company! Its Italian flavors go well over a bed of your favorite pasta or alongside a classic panzanella (bread salad) with fresh, seasonal tomatoes.\"",
    "ins": "Whisk 3 tablespoons olive oil, lemon juice, Italian seasoning, kosher salt, and black pepper together in a bowl; transfer to a large resealable bag. Place pork pieces in marinade and turn to coat. Marinate in refrigerator for 4 to 8 hours.\nMix bread crumbs, Parmesan cheese, garlic, and 1 tablespoon olive oil in a small bowl.\nSet oven rack about 5 inches from the heat source and preheat the oven's broiler.\nHeat canola oil in a large, heavy, oven-safe skillet, such as a cast-iron skillet, over medium-high heat. Remove pork from marinade and reserve the marinade. Sear marinated pork pieces in the hot oil just until lightly browned but still pink in the center, about 2 minutes. Turn pork over and pour in reserved marinade. Turn heat to high and cook pork for 1 more minute.\nSpoon crust mixture over cutlets in skillet and broil in the preheated oven until the crust is crisp and golden brown, 1 to 3 minutes. Garnish with parsley.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "4 h ",
    "i": "900249.jpg",
    "o": "",
    "st": "allrecipes"
}