{
    "id": 229402,
    "old_rating": "4.7037",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups white sugar",
        "3 tablespoons ground cinnamon",
        "2 cups pecan halves (optional)",
        "4 1/2 teaspoons active dry yeast",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "1 teaspoon white sugar",
        "1 cup warm milk",
        "2/3 cup white sugar",
        "2/3 cup butter, melted",
        "2 teaspoons salt",
        "2 eggs",
        "8 cups all-purpose flour, divided",
        "1 cup butter, melted, divided",
        "1/3 cup white sugar",
        "4 cups confectioners' sugar",
        "2/3 cup butter, melted",
        "2 teaspoons vanilla extract",
        "1 teaspoon maple-flavored extract (optional)"
    ],
    "nut": [
        "Calories > 736 kcal",
        "Carbs > 101.9 g",
        "Cholesterol > 85 mg",
        "Fat > 34 g",
        "Protein > 8.7 g",
        "Sodium > 444 mg"
    ],
    "n": "Betty's Famous Cinnamon Rolls",
    "a": "modifiedgirl",
    "r": "0",
    "s": 18,
    "des": "\"Absolutely the best cinnamon rolls, ever. So good, you can't NOT make them, let alone, stop eating them. A little hard work but totally worth it in the end. Substitute walnuts or raisins for pecans if you desire. Very good right out of the oven, or right out of the fridge, place a pat of butter on top and microwave for 20 seconds!\"",
    "ins": "Mix 1 1/2 cup white sugar, cinnamon, and pecans together in a bowl; set aside to be used as filling later.\nWhisk yeast and warm water together in a separate bowl; sprinkle with 1 teaspoon white sugar. Continue whisking until well incorporated. Set aside until yeast softens and begins to form a creamy foam, 10 to 20 minutes.\nPlace warm milk, 2/3 cup white sugar, 2/3 cup melted butter, salt, eggs, and yeast mixture in a stand mixer; mix until all ingredients are incorporated. Add 4 cups flour; mix on medium until completely smooth, about 5 minutes. Transfer dough to a large bowl; knead the remaining 4 cups flour into dough with hands until dough is slightly stiff and sticky, 10 minutes.\nTransfer dough to a large greased bowl; cover bowl with plastic wrap. Let dough rise in a warm place until doubled in size, about 1 1/2 hours.\nRemove plastic wrap from bowl and punch down dough. Set dough aside to rest for 5 minutes.\nRoll dough out onto a well-floured surface, forming a 15x20-inch rectangle. Brush entire rectangle of dough with 1/2 cup melted butter; sprinkle with cinnamon-sugar filling. Tightly roll up dough, starting from a long end and pinch edges together to seal. Cut dough, using dental floss, into 15 to 20 slices.\nGrease a 9x13-inch casserole dish with 1/2 cup melted butter; sprinkle with 1/3 cup white sugar.\nArrange cinnamon rolls close together in the prepared casserole dish. Allow to rise in a warm place for 45 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBake rolls in the preheated oven until golden brown, 25 to 30 minutes.\nBeat confectioners' sugar, 2/3 cup melted butter, vanilla extract, and maple extract together in a bowl until smooth. Drizzle over warm cinnamon rolls.",
    "pt": "45 m",
    "ct": "25 m",
    "tt": "3 h ",
    "i": "2185431.jpg",
    "o": "4528711.jpg,4517770.jpg,4507332.jpg,4489093.jpg,4472391.jpg,4459342.jpg",
    "st": "allrecipes"
}