{
    "id": 229425,
    "old_rating": "4.1",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "1 (8 ounce) package elbow macaroni",
        "1/4 cup butter",
        "1/4 onion, chopped",
        "2 1/2 tablespoons all-purpose flour, or as needed",
        "3 cups milk",
        "2 cups shredded sharp Cheddar cheese",
        "1/2 cup grated Parmesan cheese",
        "ground black pepper to taste",
        "1 (12 ounce) package fully-cooked sausage, sliced",
        "1 pear - peeled, cored, and sliced",
        "2 tablespoons butter, melted",
        "1/2 cup bread crumbs"
    ],
    "nut": [
        "Calories > 443 kcal",
        "Carbs > 36.9 g",
        "Cholesterol > 71 mg",
        "Fat > 24.4 g",
        "Protein > 19 g",
        "Sodium > 441 mg"
    ],
    "n": "Macaroni and Cheese with Sausage and Pears",
    "a": "ShirleyB",
    "r": "0",
    "s": 8,
    "des": "\"I developed this recipe from a basic mac-n-cheese recipe, adding pears which go well with the sharp Cheddar. For the sausage, we like Aidell'sÂ® Chicken and Apple or Roasted Garlic Gruyere sausages. They are fully cooked and very flavorful! To use as a side dish, leave out the sausage.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a 3-quart casserole dish with cooking spray.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain macaroni and transfer to the prepared casserole dish.\nHeat butter in a saucepan over medium heat; cook and stir onions in the melted butter until partially translucent, about 5 minutes. Whisk in flour until paste-like consistency, 3 to 5 minutes. Slowly stream in milk, stirring constantly, until flour mixture is incorporated, about 5 minutes. Stir in Cheddar cheese and Parmesan cheese until completely melted and and sauce has thickened, 5 to 10 minutes.\nPour cheese sauce into macaroni; stir to coat. Season with black pepper. Stir in sausage.\nReserve 4 slices of pears; dice remaining pear slices and stir into macaroni mixture. Arrange the reserved slices atop macaroni mixture.\nStir 2 tablespoons melted butter and bread crumbs together in a small bowl; sprinkle over macaroni mixture.\nBake in the preheated oven until cheese is bubbling and topping is lightly browned, about 30 minutes.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "921004.jpg",
    "o": "",
    "st": "allrecipes"
}