{
    "id": 229587,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 sugar pumpkin",
        "2 prepared pie crusts",
        "1 egg white, beaten",
        "1/4 cup white sugar",
        "2 (12 fluid ounce) cans evaporated milk",
        "4 eggs, beaten",
        "1 cup packed brown sugar",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground ginger",
        "1 teaspoon ground nutmeg",
        "1 teaspoon salt"
    ],
    "nut": [
        "Calories > 282 kcal",
        "Carbs > 36.9 g",
        "Cholesterol > 60 mg",
        "Fat > 12.4 g",
        "Protein > 7.2 g",
        "Sodium > 338 mg"
    ],
    "n": "Dixie's Fresh Pumpkin Pie",
    "a": "B52JUNEBUG",
    "r": "0",
    "s": 16,
    "des": "\"Family favorite made with real pumpkin. Ingredients can be mixed and stored ahead of time for convenience. To only make one pie, mix all ingredients and pour half the mixture into a container or plastic bag and freeze. Now you can whip up a pie at any time!\"",
    "ins": "Cut pumpkin into halves and remove seeds. Cut seeded pumpkin into 3-inch chunks.\nBring a large pot of water to a boil. Cook pumpkin in boiling water until tender, about 20 minutes; drain. Set pumpkin aside to cool until the skin hardens and the flesh is cool enough to handle.\nScrape pumpkin flesh from skin into a large bowl; transfer to a food processor and blend until smooth. Put pureed pumpkin into a fine mesh strainer set over a bowl and set aside to drain.\nPreheat oven to 425 degrees F (220 degrees C).\nPress pie crusts into pie pans. Trim dough to overlap edges of pans by about 1/4 inch.\nDip a fork into the egg white first and then into the sugar. Put the tines onto the rim of your pie crust and press down, leaving little ridges that will brown when they are cooked.\nBake pie crust in preheated oven until slightly set, about 5 minutes. Place pie pans onto a cookie sheet.\nBeat drained pumpkin, evaporated milk, eggs, brown sugar, cinnamon, ginger, nutmeg, and salt together in a bowl; pour into the prepared crusts. Fold strips of aluminum foil around the edges of the crusts.\nBake in preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C).\nContinue baking pie until a toothpick inserted into the center comes out clean, about 40 minutes. Allow to cool 30 minutes before serving.",
    "pt": "1 h",
    "ct": "55 m",
    "tt": "2 h ",
    "i": "1054727.jpg",
    "o": "",
    "st": "allrecipes"
}