{
    "id": 229560,
    "old_rating": "4.93333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "24 (3 inch) frozen tart shells, thawed",
        "6 slices bacon, or more to taste",
        "1 cup shredded Swiss cheese",
        "2 green onions, diced",
        "4 eggs",
        "1 1/4 cups milk",
        "1 teaspoon Dijon mustard",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/4 cup shredded Swiss cheese, or as needed (optional)"
    ],
    "nut": [
        "Calories > 380 kcal",
        "Carbs > 39.8 g",
        "Cholesterol > 80 mg",
        "Fat > 20.1 g",
        "Protein > 10.5 g",
        "Sodium > 401 mg"
    ],
    "n": "Mini Quiche Lorraine",
    "a": "Catherine Parnell-Proulx",
    "r": "0",
    "s": 12,
    "des": "\"These are delicious little quiche tarts perfect for a party, shower, or just to have on hand for fast breakfasts during the week. Try substituting different fillings to suit your own taste. Any variety of cheese can be used.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Arrange tart shells in 2 muffin tins; line shell each with a layer of pie weights or dried beans.\nBake shells in the preheated oven until edges of crusts are lightly browned and about 75% cooked, 5 to 10 minutes.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels; crumble when cooled.\nDivide 1 cup Swiss cheese, bacon, and green onions evenly into the tart shells.\nWhisk eggs, milk, mustard, salt, and black pepper together in a bowl. Ladle egg mixture into each tart shell about 2/3 full. Top each tart with the remaining 1/4 cup Swiss cheese.\nBake in the preheated oven until egg is set in the middle of each tart and shells are browned, 25 to 30 minutes.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "909370.jpg",
    "o": "",
    "st": "allrecipes"
}