{
    "id": 229522,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (3 ounce) package cream cheese, softened",
        "1/2 cup white sugar",
        "1 cup miniature marshmallows",
        "1 (8 ounce) container frozen whipped topping, thawed",
        "1 teaspoon vanilla extract",
        "4 egg whites",
        "1 teaspoon cream of tartar",
        "1 cup white sugar",
        "1 (12 ounce) can cherry pie filling",
        "8 ounces frozen strawberries, thawed and drained (optional)",
        "1 teaspoon lemon juice"
    ],
    "nut": [
        "Calories > 242 kcal",
        "Carbs > 42.8 g",
        "Cholesterol > 8 mg",
        "Fat > 7.2 g",
        "Protein > 2.2 g",
        "Sodium > 55 mg"
    ],
    "n": "Cherry Berries on a Cloud",
    "a": "MrsA",
    "r": "0",
    "s": 12,
    "des": "\"Beautiful and light meringue based dessert. Excellent for Valentine's day and Christmas. I often make individual servings using a coffee mug for a pattern. Your guests will think you have slaved for hours.\"",
    "ins": "Beat cream cheese and 1/2 cup sugar together in a bowl. Stir marshmallows, whipped topping, and vanilla through the cream cheese mixture. Cover bowl with plastic wrap and refrigerate 8 to 12 hours.\nPreheat oven to 250 degrees F (120 degrees C).\nBeat egg whites with cream of tartar in a large bowl; add 1 cup sugar in small amounts into the egg white mixture and keep beating until very stiff. Draw a large circle onto a piece of brown paper or parchment.  Fill in the circle with the meringue mixture building up the sides.\nDraw a large circle onto a sheet parchment paper. Fill the circle with the egg white mixture building up the sides to form a large cylinder.\nBake in preheated oven for 1 hour. Turn heat off and let meringue cool undisturbed in the oven without ever opening the oven door for 1 hour more.\nStir cherry pie filling, strawberries, and lemon juice together in a bowl.\nGently spread cream cheese mixture over the top of the meringue; top with cherry pie filling mixture.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "10 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}