{
    "id": 229502,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 chicken tenders",
        "1 teaspoon vegetable oil, or as needed",
        "1/3 yellow onion, diced",
        "2 cups chicken stock",
        "1 large carrot, cut into 1/4-inch rounds",
        "1 red bell pepper, diced",
        "1 (8 ounce) can sliced bamboo shoots, drained",
        "4 green onions, white and green parts separated",
        "1 (14 ounce) can coconut milk",
        "1/3 cup lemon juice",
        "1 tablespoon curry powder",
        "1 1/2 teaspoons red pepper flakes",
        "1 teaspoon ground turmeric",
        "1 teaspoon ground ginger",
        "1 teaspoon paprika",
        "1 teaspoon garlic powder"
    ],
    "nut": [
        "Calories > 363 kcal",
        "Carbs > 16.2 g",
        "Cholesterol > 49 mg",
        "Fat > 25.2 g",
        "Protein > 22.2 g",
        "Sodium > 556 mg"
    ],
    "n": "Thai Coconut Soup Using Ingredients You Actually Have!",
    "a": "Liberated woman in an apron",
    "r": "0",
    "s": 4,
    "des": "\"I love Thai coconut chicken soup, but never had the authentic and exotic ingredients the recipes called for. I invented this recipe through trial and error to make the flavors I love, without going to specialty stores. Substitute 3 chicken breasts for the chicken tenders if you desire.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9-inch square baking dish.\nArrange chicken tenders in the prepared baking dish.\nBake in the preheated oven until chicken is no longer pink in the center and the juices run clear, 20 to 25 minutes. Dice chicken.\nHeat oil in a pot over medium heat; cook and stir yellow onion in the hot oil until onion is slightly browned, about 10 to 15 minutes. Pour in chicken stock and bring to a boil. Reduce heat to low and simmer; add carrot, red bell pepper, and bamboo shoots. Slice the white part of green onions in half lengthwise and add to soup. Stir in diced chicken, coconut milk, lemon juice, curry powder, red pepper flakes, turmeric, ginger, paprika, and garlic powder. Bring to a boil, reduce heat, and simmer until vegetables are tender and flavors have combined, about 10 minutes.\nSlice the green part of green onion; add to soup. Remove from heat and serve.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "924214.jpg",
    "o": "",
    "st": "allrecipes"
}