{
    "id": 229644,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Mojito Marinade",
        "1 cup orange juice",
        "1/2 cup lemon juice",
        "1 tablespoon salt",
        "1 tablespoon onion powder",
        "1 tablespoon garlic powder",
        "1 teaspoon black pepper",
        "1 teaspoon white sugar",
        "8 large large scallops",
        "2 yellow squash, cut into 4 large chunks",
        "2 zucchinis, cut into 4 large chunks",
        "1 (8 ounce) package portobello mushroom caps, cut into large chunks",
        "4 bamboo skewers, soaked in water for 60 minutes",
        "1/2 cup fresh basil",
        "Stuffed Tomatoes",
        "2 large tomatoes, cored",
        "1 (12 ounce) package microwaveable broccoli in cheese sauce",
        "1 1/2 cups cooked brown rice",
        "1 slice American cheese, cut into 4 strips"
    ],
    "nut": [
        "Calories > 770 kcal",
        "Carbs > 98.6 g",
        "Cholesterol > 103 mg",
        "Fat > 20.7 g",
        "Protein > 56.4 g",
        "Sodium > 4379 mg"
    ],
    "n": "Mamita's Mojito Scallop Kabobs with Stuffed Tomatoes",
    "a": "Jules Fernan",
    "r": "0",
    "s": 2,
    "des": "\"Fresh and large scallops stew in a marinade of tangy Cuban 'mojito.' Two large scallops meet chunks of yellow squash, zucchini, and portabello mushrooms on a stick to form a kabob. It's sure to take you away to the tropics in the middle of your work week. Serve with a baked and stuffed broccoli-cheese tomato.\"",
    "ins": "Whisk orange juice, lemon juice, salt, onion powder, garlic powder, black pepper, and sugar together in a large bowl to dissolve seasoning into the liquid. Add scallops, yellow squash, zucchinis, and portobello mushroom to the mojito marinade; toss to coat.\nCover bowl with plastic wrap and refrigerate 8 hours to overnight.\nPreheat oven to 400 degrees F (200 degrees C).\nThread onto a skewer a piece of mushroom, yellow squash, zucchini, and a scallop, respectively. Repeat so there are two of each item on the skewer; repeat with remaining skewers. Sprinkle fresh basil evenly over the skewers.\nCarefully remove tomato insides with a spoon; discard tomato insides.\nPour broccoli with cheese sauce into a microwave-safe bowl; cook in microwave until broccoli is tender and the sauce is melted, 3 to 5 minutes.\nStir broccoli with cheese sauce and rice together in a bowl; spoon into the hollowed-out tomatoes. Place 2 strips American cheese atop the mixture in a crossing pattern.\nCook the skewers in preheated oven until the scallops are cooked through, 25 to 30 minutes. Remove from oven to a plate; cover with aluminum foil to keep warm.\nReduce oven heat to 350 degrees F (175 degrees C).\nBake tomatoes in the oven until the cheese is bubbling, 5 to 10 minutes. Serve with the skewers.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "8 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}