{
    "id": 229624,
    "old_rating": "4.53476",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 (6 ounce) boneless center-cut pork chops",
        "salt and ground black pepper to taste",
        "1 tablespoon vegetable oil",
        "1 tablespoon butter",
        "3 cloves garlic, minced",
        "1/4 cup apple cider vinegar",
        "2 cups apple cider",
        "1 teaspoon Dijon mustard",
        "1 teaspoon minced rosemary",
        "1 pinch red pepper flakes"
    ],
    "nut": [
        "Calories > 237 kcal",
        "Carbs > 11.8 g",
        "Cholesterol > 59 mg",
        "Fat > 10.6 g",
        "Protein > 21.7 g",
        "Sodium > 76 mg"
    ],
    "n": "Pork Chops with Apple Cider Glaze",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"Pork chops with a glossy apple cider glaze is really easy, and while there's no starch or extra butter involved, it reduces quickly to a thick, rich, sweet-tart apple syrup.\"",
    "ins": "Season pork chops with salt and black pepper.\nHeat oil and butter in a heavy skillet over medium-high heat. Cook pork chops in the hot oil mixture until browned on both sides and pork is slightly pink in the center, 5 to 7 minutes per side. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Remove pan from the heat; transfer pork chops to a plate.\nStir garlic into the pan and place over medium-high heat; cook and stir for 30 seconds. Pour in vinegar and scrape up any browned bits from the bottom of the pan. Add apple cider and Dijon mustard, bring mixture to a boil, and cook until sauce is reduced and thick, 3 to 4 minutes. Stir in rosemary and red pepper flakes; season with salt and black pepper to taste.\nReturn pork chops to the pan to warm slightly, 1 to 2 minutes per side.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "4461760.jpg",
    "o": "4461760.jpg,4170561.jpg,4074482.jpg,3973411.jpg,3933478.jpg,3897897.jpg",
    "st": "allrecipes"
}