{
    "id": 229675,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) can crushed pineapple, drained and juice reserved",
        "1 (16 ounce) can whole berry cranberry sauce, drained and juice reserved",
        "1 1/2 cups water, or as needed",
        "2 (3 ounce) packages raspberry-flavored gelatin mix (such as Jell-OÂ®)",
        "1 (8 ounce) package cream cheese at room temperature",
        "2 tablespoons mayonnaise",
        "1 cup frozen whipped topping (such as Cool WhipÂ®), thawed",
        "1 tart apple, peeled and finely chopped",
        "1/2 cup chopped walnuts",
        "1/2 cup frozen whipped topping (such as Cool WhipÂ®), thawed - or to taste"
    ],
    "nut": [
        "Calories > 265 kcal",
        "Carbs > 33.9 g",
        "Cholesterol > 21 mg",
        "Fat > 13.9 g",
        "Protein > 3.7 g",
        "Sodium > 131 mg"
    ],
    "n": "Creamy Cranberry Jell-OÂ® Salad",
    "a": "khjones",
    "r": "0",
    "s": 12,
    "des": "\"This is my favorite Thanksgiving dish! The sweetness is a nice contrast to the saltiness of the turkey. The walnuts and apples give a nice texture, but make sure they are chopped small enough. The mayo seems like a strange addition, but you don't taste it, and it improves the texture of the cream cheese. Enjoy!\"",
    "ins": "Pour juice from crushed pineapple and cranberry sauce in a measuring cup and add enough water to equal 2 cups of liquid; bring to a boil in a saucepan. Remove from heat and dissolve raspberry gelatin in the liquid. Pour gelatin into a bowl and refrigerate until partly set, about 45 minutes.\nBeat cream cheese with mayonnaise in a bowl with an electric mixer until fluffy; gradually beat partially set gelatin into cream cheese mixture. Gently fold 1 cup whipped topping into the mixture. Stir crushed pineapple, cranberry sauce, apple, and walnuts into gelatin mixture. Transfer to a serving bowl and refrigerate until set, about 4 hours. Serve frosted with 1/2 cup whipped topping, or as desired.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "5 h ",
    "i": "1748149.jpg",
    "o": "",
    "st": "allrecipes"
}