{
    "id": 22965,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "50 vanilla wafer cookies",
        "1/2 cup walnuts",
        "1/4 cup butter, melted",
        "2 tablespoons maple syrup",
        "1 quart vanilla ice cream, softened",
        "1 cup canned pumpkin puree",
        "2 teaspoons pumpkin pie spice",
        "3/4 cup heavy cream",
        "2 tablespoons granulated sugar",
        "4 tablespoons shortening",
        "2/3 cup semisweet chocolate chips"
    ],
    "nut": [
        "Calories > 647 kcal",
        "Carbs > 61.8 g",
        "Cholesterol > 75 mg",
        "Fat > 44.2 g",
        "Protein > 6.7 g",
        "Sodium > 221 mg"
    ],
    "n": "Luscious Pumpkin Ice Cream Pie",
    "a": "ANDROMEDA050456",
    "r": "0",
    "s": 8,
    "des": "\"This pumpkin pie has a cookie crust, vanilla ice cream and pumpkin. It's served with whipped cream and chocolate curls. Yum!\"",
    "ins": "In a blender or food processor, blend the vanilla wafer cookies and walnuts into fine crumbs. Transfer to a 9 inch pie pan. Mix in the butter and maple syrup. Using a fork, press firmly and evenly onto the bottom and sides of the pie pan to create a crust. Chill 10 minutes in the freezer.\nIn a large bowl, blend the vanilla ice cream, pumpkin and pumpkin pie spice. Spoon into the pie crust. Smooth top with a spatula. Chill 1 hour in the freezer, or until firm.\nBefore serving pie, place the heavy cream and granulated sugar in a small bowl. Mix with an electric mixer on high speed until peaks form. Spoon into a pastry bag with a star tip and pipe around the edge of the pie.\nIn a small saucepan over low heat, melt shortening and chocolate chips, stirring occasionally, until smooth. Transfer to a small plastic container and chill in the freezer 30 minutes, or until firm.\nRemove chocolate from container. Using a vegetable peeler or cheese slicer, scrape the chocolate to form small curls. Use the curls to decorate the pie",
    "pt": "1 h ",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}