{
    "id": 229730,
    "old_rating": "4.75075",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds orange-fleshed sweet potatoes, peeled and cut into cubes",
        "1/2 teaspoon ground dried chipotle pepper",
        "1/2 teaspoon salt",
        "2 tablespoons olive oil, divided",
        "1 onion, diced",
        "4 cloves garlic, minced",
        "1 red bell pepper, diced",
        "1 jalapeno pepper, sliced",
        "2 tablespoons ancho chile powder, or to taste",
        "1 tablespoon ground cumin",
        "1/4 teaspoon dried oregano",
        "1 (28 ounce) can diced tomatoes",
        "1 cup water, or more as needed",
        "1 tablespoon cornmeal",
        "1 teaspoon salt, or to taste",
        "1 teaspoon white sugar",
        "1 teaspoon unsweetened cocoa powder",
        "2 (15 ounce) cans black beans, rinsed and drained",
        "1 pinch cayenne pepper, or to taste",
        "1/2 cup sour cream, for garnish (optional)",
        "1/4 cup chopped fresh cilantro, for garnish (optional)"
    ],
    "nut": [
        "Calories > 600 kcal",
        "Carbs > 101.4 g",
        "Cholesterol > 13 mg",
        "Fat > 14.7 g",
        "Protein > 20.7 g",
        "Sodium > 2119 mg"
    ],
    "n": "Sweet Potato and Black Bean Chili",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"The extra step of roasting the sweet potatoes really concentrates the sweet, earthy flavors and gives the starchy chunks a marvelously meaty texture.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper or a silicone baking mat.\nCombine sweet potatoes, chipotle pepper, 1/2 teaspoon salt, and 1 tablespoon olive oil in a large bowl and toss to coat. Spread sweet potatoes on the prepared baking sheet in a single layer.\nRoast sweet potatoes in the preheated oven until the outside is crunchy and inside is tender, 20 to 25 minutes. Allow to cool to room temperature.\nCook and stir remaining 1 tablespoon olive oil, onion, garlic, red bell pepper, jalapeno pepper, ancho chile powder, cumin, and dried oregano together in a large pot or Dutch oven over medium heat. Cook and stir until onion is softened, about 5 minutes.\nPour tomatoes and water into the onion mixture and bring to a simmer. Add cornmeal, 1 teaspoon salt, sugar, and cocoa powder. Bring to a simmer, stirring constantly, reduce heat to low and simmer for 30 minutes.\nStir black beans and cooled sweet potatoes into the onion-tomato mixture. Add more water if mixture is too thick. Simmer until heated through, about 15 minutes. Season with salt and cayenne pepper to taste. Serve topped with sour cream and cilantro.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4435614.jpg",
    "o": "4435614.jpg,4294453.jpg,4294087.jpg,4123808.jpg,4106516.jpg,4096075.jpg",
    "st": "allrecipes"
}