{
    "id": 229779,
    "old_rating": "4.60526",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 eggs, slightly beaten",
        "2 cups white sugar",
        "1 cup solid pack pumpkin",
        "1/2 cup corn oil",
        "2 tablespoons orange zest",
        "2 1/2 cups all-purpose flour",
        "1 tablespoon pumpkin pie spice",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 1/2 cups cranberries, halved"
    ],
    "nut": [
        "Calories > 166 kcal",
        "Carbs > 28.6 g",
        "Cholesterol > 14 mg",
        "Fat > 5.1 g",
        "Protein > 2 g",
        "Sodium > 131 mg"
    ],
    "n": "Cranberry Pumpkin Muffins",
    "a": "iamblessedx7",
    "r": "0",
    "s": 24,
    "des": "\"I have been making these for years. I used to make them in bread form, but having 7 children it was just easier to dole out a muffin than cut up the messy loaf. I also began giving these out as Christmas food gifts. This was requested by my 17-year-old son for our dessert we have to bring to his football banquet. My 21-year-old daughter who moved to Ogden, Utah with her husband and 2 kids wants to make these muffins for her in-laws who will be spending the Thanksgiving holidays with them.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line 24 muffin cups with paper liners.\nBeat eggs, sugar, pumpkin, corn oil, and orange zest in a small mixing bowl until smooth.\nMix flour, pumpkin pie spice, baking soda, and salt in a large mixing bowl with a fork. Make a well in the center of the flour mixture. Pour pumpkin mixture into the well; stir until the dry mixture is just moistened into a batter. Fold cranberries into the batter.\nScoop batter into prepared muffin cups.\nBake in the preheated oven until golden and the tops spring back when lightly pressed, 20 to 25 minutes.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "4042996.jpg",
    "o": "",
    "st": "allrecipes"
}