{
    "id": 229764,
    "old_rating": "4.44118",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "9 lasagna noodles",
        "1 bunch fresh spinach",
        "1 (8 ounce) container ricotta cheese",
        "1/2 cup shredded mozzarella cheese",
        "1 egg, lightly beaten",
        "1 pinch ground nutmeg",
        "1 pinch dried basil",
        "salt and ground black pepper to taste",
        "1 cup pasta sauce",
        "1/2 cup shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 305 kcal",
        "Carbs > 36.8 g",
        "Cholesterol > 55 mg",
        "Fat > 10 g",
        "Protein > 18.3 g",
        "Sodium > 443 mg"
    ],
    "n": "Easy Vegetarian Spinach Lasagna",
    "a": "MOTTSBELA",
    "r": "0",
    "s": 6,
    "des": "\"It's easy, it's cheesy, and it's vegetarian!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Spray a 1 1/2-quart casserole dish with cooking spray.\nBring a large pot of lightly salted water to a boil. Cook lasagna in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 8 minutes. Drain.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add spinach, cover, and steam until tender, 2 to 6 minutes. Drain spinach.\nMix spinach, ricotta cheese, 1/2 cup mozzarella cheese, egg, nutmeg, basil, salt, and black pepper in a bowl until thoroughly combined.\nSpread 1/4 cup pasta sauce on the bottom of the prepared casserole dish; top with 3 lasagna noodles, 1/2 of the ricotta mixture, and 1/4 cup pasta sauce. Repeat layers of 3 more noodles, 1/2 cup ricotta mixture, and 1/4 cup pasta sauce. End with remaining 3 lasagna noodles and 1/4 cup pasta sauce. Sprinkle 1/2 cup mozzarella cheese and Parmesan cheese on top. Cover casserole with aluminum foil.\nBake in the preheated oven for 25 minutes. Uncover casserole and continue baking until lasagna is bubbling and lightly browned, about 25 more minutes. Let lasagna stand 5 minutes before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "932831.jpg",
    "o": "4531452.jpg,4481698.jpg,4224538.jpg,4055228.jpg,3283253.jpg,2681293.jpg",
    "st": "allrecipes"
}