{
    "id": 229857,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 Italian sausage links",
        "1 (16 ounce) jar marinara sauce for dipping",
        "2 tablespoons olive oil",
        "1 onion, sliced",
        "1 red bell pepper, sliced",
        "1 jalapeno pepper, sliced",
        "1 goat horn pepper or other hot green chile, sliced",
        "4 Italian-style hoagie buns, split lengthwise",
        "1 (8 ounce) container mascarpone cheese, divided",
        "1/4 cup garlic basil spread, divided (see footnote for recipe link)",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 715 kcal",
        "Carbs > 48.4 g",
        "Cholesterol > 85 mg",
        "Fat > 46.7 g",
        "Protein > 26 g",
        "Sodium > 1675 mg"
    ],
    "n": "Sausage Grinder",
    "a": "Allrecipes",
    "r": "0",
    "s": 8,
    "des": "\"Cook up a pan of Italian sausages and layer them in hoagie rolls with hot peppers, onions, and cheese for a hearty and satisfying meal.\"",
    "ins": "Bring a large pot of water to a boil; add sausages and cook until no longer pink inside, 10 to 12 minutes. Drain and set aside.\nPlace marinara sauce in a small saucepan over medium-low heat; cook until warmed through, about 5 minutes. Reduce heat to low and keep warm until sandwiches are ready.\nHeat olive oil in a large skillet over medium-high heat; cook and stir onion, red bell pepper, jalapeno pepper, and goat horn pepper in the hot oil until onion softens and begins to turn golden, 7 to 8 minutes. Remove onion mixture to a plate and set aside.\nPlace sausages in the hot skillet and cook, turning frequently, until warmed through and browned all over, about 10 minutes.\nSpread each hoagie bun with 1/4 cup mascarpone cheese and 1 tablespoon garlic basil spread. Place two sausages on top and spoon over the onion mixture. Sprinkle with 2 tablespoons Parmesan cheese. Transfer the marinara sauce to small bowls for dipping.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}