{
    "id": 229807,
    "old_rating": "4.14286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds fresh green beans, trimmed and snapped",
        "2 tablespoons butter, melted",
        "2 tablespoons all-purpose flour",
        "2 tablespoons grated onion",
        "1 teaspoon white sugar",
        "1 teaspoon salt",
        "2 cups sour cream",
        "8 ounces coarsely shredded Swiss cheese",
        "2 cups corn flakes, crushed",
        "2 tablespoons butter, melted"
    ],
    "nut": [
        "Calories > 343 kcal",
        "Carbs > 18.4 g",
        "Cholesterol > 67 mg",
        "Fat > 25.9 g",
        "Protein > 11.8 g",
        "Sodium > 472 mg"
    ],
    "n": "Swiss Cheese Green Bean Casserole",
    "a": "beanstalker",
    "r": "0",
    "s": 8,
    "des": "\"When I make this special-occasion veggie dish, I am ALWAYS asked for the recipe. Fresh steamed green beans provide a contrast to decadent melted Swiss cheese and crunchy topping. A family holiday favorite throughout my extended family. You can prepare ahead of time, leaving 4 to 5 minutes to steam the green beans and add other ingredients. Put into oven right before serving dinner (we usually put it in while carving the turkey).\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add green beans, cover, and steam until slightly tender, about 5 minutes.\nStir 2 tablespoons butter, flour, onion, sugar, and salt together in a saucepan over medium heat; gradually stir in sour cream. Cook and stir mixture until hot, thickened, and smooth, about 10 minutes. Add steamed green beans to the cream mixture. Pour green bean-cream mixture into a 2-quart casserole dish; sprinkle with Swiss cheese.\nMix corn flakes and 2 tablespoons butter in a bowl until well coated; sprinkle over Swiss cheese layer.\nBake in the preheated oven until cheese is bubbling and topping is browned, about 20 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "1096234.jpg",
    "o": "",
    "st": "allrecipes"
}