{
    "id": 229870,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 pound ground beef, or to taste",
        "1 teaspoon taco seasoning mix, or to taste",
        "3 quarts water",
        "3 (3 ounce) packages chicken-flavored ramen noodle soup",
        "1 (14.5 ounce) can Mexican-style stewed tomatoes",
        "1 cup water",
        "1/2 cup sour cream",
        "1/2 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 495 kcal",
        "Carbs > 50.2 g",
        "Cholesterol > 45 mg",
        "Fat > 25.5 g",
        "Protein > 16.3 g",
        "Sodium > 1573 mg"
    ],
    "n": "That's Good Moosh!",
    "a": "Keri",
    "r": "0",
    "s": 4,
    "des": "\"My daughter wanted to make dinner and insisted on including noodles and Mexican-style stewed tomatoes. Together, we came up with this dish, and the whole family loved it! My husband inadvertently named the recipe when he said to my daughter, 'That's good moosh!'\"",
    "ins": "Cook and stir ground beef in a skillet until completely browned, 5 to 7 minutes. Season with taco seasoning; stir. Set aside.\nBring 3 quarts water to a boil in a 5-quart stockpot. Break ramen noodles into bite-sized pieces and add to boiling water. Cook, stirring frequently, until noodles are tender, 3 to 5 minutes; drain.\nPour tomatoes into a bowl; break into small pieces using your hand or a spoon. Dissolve 2 of the packets of seasoning from the ramen noodles in 1 cup water; stir into the tomatoes.\nPour the tomato mixture into the stockpot and place over medium heat. Stir ground beef into the tomato mixture; cook and stir until hot, 3 to 5 minutes. Add drained noodles to the beef mixture; stir to coat. Season the mixture with the remaining packet of ramen noodle seasoning to taste.\nRemove stockpot from heat; stir sour cream through the tomato mixture. Top with Cheddar cheese to serve.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "25 m",
    "i": "1073237.jpg",
    "o": "",
    "st": "allrecipes"
}