{
    "id": 229813,
    "old_rating": "4.35",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds Brussels sprouts",
        "3 tablespoons extra-virgin olive oil",
        "1 teaspoon red pepper flakes",
        "salt and ground black pepper to taste",
        "1 small red onion, chopped",
        "3 cloves garlic, coarsely chopped",
        "2 tablespoons butter"
    ],
    "nut": [
        "Calories > 152 kcal",
        "Carbs > 12 g",
        "Cholesterol > 10 mg",
        "Fat > 11 g",
        "Protein > 4.2 g",
        "Sodium > 57 mg"
    ],
    "n": "Brussels Sprouts With Browned Butter",
    "a": "OCGIRLSTAR",
    "r": "0",
    "s": 6,
    "des": "\"Brussels sprouts with browned butter, garlic, and cooked red onions make a great side dish or a meal in itself. Enjoy!\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil. Add Brussels sprouts; cook until slightly tender, 1 to 2 minutes. Remove and run sprouts under cold water to stop the cooking process. Trim ends off each Brussels sprout and slice sprouts in half.\nHeat olive oil in a large skillet over medium heat; arrange Brussels sprouts, cut sides down, in the hot oil. Season with red pepper flakes, salt, and black pepper. Cook Brussels sprouts, keeping them in the same place, until cut sides are browned, 7 to 9 minutes.\nMix red onion and garlic into Brussels sprouts; cook and stir mixture until Brussels sprouts are cooked through but still firm, 10 to 13 more minutes.\nPlace butter in a cold saucepan; place saucepan over medium heat. Cook butter until it begins to bubble and foam, about 5 minutes. Reduce heat to low; cook, constantly stirring, until butter begins to brown, 5 to 10 minutes. Remove from heat and pour browned butter over Brussels sprouts; toss to coat.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "3128345.jpg",
    "o": "2606948.jpg,2555527.jpg,1771737.jpg,1100232.jpg,1100229.jpg,967441.jpg",
    "st": "allrecipes"
}