{
    "id": 229940,
    "old_rating": "3.7931",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 skinless, boneless chicken breast halves - trimmed and pounded thin",
        "salt and ground black pepper to taste",
        "1/3 cup butter",
        "3/4 cup ranch dressing",
        "1/2 cup Dijon mustard",
        "1/3 cup dry white wine",
        "10 ounces angel hair pasta",
        "1 tablespoon chopped fresh parsley, or to taste"
    ],
    "nut": [
        "Calories > 723 kcal",
        "Carbs > 47.1 g",
        "Cholesterol > 114 mg",
        "Fat > 43 g",
        "Protein > 31.1 g",
        "Sodium > 1483 mg"
    ],
    "n": "Chicken Ranch Dijon",
    "a": "Abbey Atkinson",
    "r": "0",
    "s": 4,
    "des": "\"Easy and delicious chicken dish. The tangy sauce flavors the whole dish if desired. Serve over angel-hair pasta and a green vegetable (green beans are a good choice).\"",
    "ins": "Bring a pot of lightly salted water to a boil and set heat to medium-low; keep the water at a low boil while you complete remaining steps.\nSprinkle chicken breasts with salt and black pepper. Melt butter in a skillet over medium heat and cook chicken breasts in the hot butter until browned and no longer pink inside, about 8 minutes per side. Transfer chicken to a platter, cover loosely with aluminum foil, and keep warm.\nWhisk ranch dressing and Dijon mustard together in a bowl. Pour white wine into skillet; scrape and dissolve any browned bits of food in the bottom of the skillet into wine. Whisk ranch dressing mixture the skillet, reduce heat to low, and bring sauce to a simmer.\nCook angel hair in the boiling water, stirring occasionally, until cooked through but firm to the bite, 4 to 5 minutes. Drain pasta and toss lightly with ranch sauce.\nDivide pasta between 4 serving plates and top each serving with a chicken breast. Spoon remaining sauce over chicken breasts and sprinkle with parsley.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "939099.jpg",
    "o": "",
    "st": "allrecipes"
}