{
    "id": 229939,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups raw whole pumpkin seeds",
        "2 tablespoons butter, melted",
        "1 tablespoon Cajun seasoning",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon paprika",
        "1/2 teaspoon chili powder",
        "1/2 teaspoon seasoned salt",
        "3/4 teaspoon teriyaki sauce, or to taste",
        "1 pinch salt (optional)"
    ],
    "nut": [
        "Calories > 102 kcal",
        "Carbs > 9.5 g",
        "Cholesterol > 8 mg",
        "Fat > 6.1 g",
        "Protein > 3.2 g",
        "Sodium > 330 mg"
    ],
    "n": "Toasted Pumpkin Seeds Teriyaki Cajun Style",
    "a": "littleone302000",
    "r": "0",
    "s": 8,
    "des": "\"My family and I have always loved these during the pumpkin season. Over the years I've come to tweak it to our tastes. More flavor and a little more spice, but NOT overdoing it. I hope you love this as much as we do. Trust me on the seasonings. Seems to be a lot, but SO very worth it. I usually get quite a bit out of these with everyone just passing them around. You can make a bigger batch of these (which I have done many times). Just adjust the ingredients to the amount of pumpkin seeds you have. This a great snack for parties or family night.\"",
    "ins": "Spread pumpkin seeds in a single layer on a baking sheet lined with waxed paper; set aside in a cool, dry place and allow to dry overnight, turning seeds a time or two during several hours of drying.\nPreheat oven to 300 degrees F (150 degrees C).\nMix melted butter, Cajun seasoning, garlic powder, paprika, chili powder, seasoned salt, and teriyaki sauce in a bowl; toss the pumpkin seeds in the seasoned butter to coat. Set seasoned pumpkin seeds aside for 5 minutes to absorb flavors. Spread seeds onto a baking sheet.\nBake in the preheated oven until seeds are browned and fragrant, 45 minutes to 1 hour; stir after 30 minutes. Remove and let cool until seeds stop making a popping noise; sprinkle with salt if desired.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "9 h ",
    "i": "1060078.jpg",
    "o": "",
    "st": "allrecipes"
}