{
    "id": 229994,
    "old_rating": "4.58065",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil",
        "8 pork chops",
        "1 teaspoon seasoned salt",
        "1 (10.75 ounce) can  condensed cream of celery soup",
        "2/3 cup milk",
        "1/2 cup sour cream",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 (16 ounce) package frozen hash brown potatoes, thawed",
        "3/4 cup shredded Cheddar cheese",
        "1/2 (6 ounce) can French-fried onions",
        "1/4 cup shredded Cheddar cheese",
        "1/2 (6 ounce) can French-fried onions"
    ],
    "nut": [
        "Calories > 422 kcal",
        "Carbs > 23.5 g",
        "Cholesterol > 61 mg",
        "Fat > 31.7 g",
        "Protein > 16.7 g",
        "Sodium > 871 mg"
    ],
    "n": "Pork Chop Potato Casserole",
    "a": "Kim Maass",
    "r": "0",
    "s": 8,
    "des": "\"I got this recipe from a long time good friend of mine. This is a favorite in both our homes! Definitely filling. Of course, you can add more seasoning to suit your taste. Great served with a green salad and applesauce.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat vegetable oil in a large skillet over medium heat. Season pork chops with seasoned salt. Cook pork chops in hot oil until browned completely, 2 to 3 minutes per side. Remove pork chops to a plate lined with paper towels to drain.\nMix celery soup, milk, sour cream, salt, and pepper in a bowl. Fold hash brown potatoes, 3/4 cup Cheddar cheese, and about half the French-fried onions into the soup mixture; pour into a 13x9-inch baking dish. Arrange pork chops atop the mixture. Cover the dish with aluminum foil.\nBake in preheated oven for 40 minutes. Remove foil and top pork chops with 1/4 cup Cheddar cheese and remaining half-can French-fried onions; continue baking until the cheese melts, about 5 minutes. An instant-read thermometer inserted into the center of the pork chops should read 145 degrees F (63 degrees C).",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1524419.jpg",
    "o": "4528908.jpg,4503019.jpg,4501554.jpg,4115574.jpg,3174705.jpg,2185215.jpg",
    "st": "allrecipes"
}