{
    "id": 229957,
    "old_rating": "4.65625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (4 pound) boneless beef chuck roast",
        "1 tablespoon Worcestershire sauce, or to taste",
        "1 tablespoon Montreal-style steak seasoning",
        "2 tablespoons olive oil",
        "1 cube beef bouillon",
        "1 cup hot strong black coffee",
        "1 (8 ounce) can tomato sauce",
        "1 teaspoon dried oregano, or to taste",
        "2 teaspoons Worcestershire sauce, or to taste"
    ],
    "nut": [
        "Calories > 386 kcal",
        "Carbs > 2.8 g",
        "Cholesterol > 103 mg",
        "Fat > 29 g",
        "Protein > 26.9 g",
        "Sodium > 698 mg"
    ],
    "n": "Slow Cooker Au Jus Pot Roast",
    "a": "crancherry",
    "r": "0",
    "s": 8,
    "des": "\"I've never found a recipe I really liked for a savory, au jus-style pot roast without mushy veggies and a weird sweetness. So after some experimenting, this is the way I make it every time now. The tomato sauce disappears and will not make a tomato-flavored gravy. Quick and easy. The roast size and cut can vary, and it will still turn out great. Good for those who don't like onions, although they can be added if you like. I love to make homemade mashed potatoes and dill carrot slices for sides. Cook roast on top of sliced onion rings if desired.\"",
    "ins": "Rub chuck roast with 1 tablespoon Worcestershire sauce and sprinkle on all sides with steak seasoning.\nHeat olive oil in a large skillet over medium-high heat. Sear the roast in the hot oil until browned, about 5 minutes per side. Transfer roast to a slow cooker.\nDissolve beef bouillon cube in the coffee and pour the mixture over the roast. Pour tomato sauce over meat and season with oregano; drizzle meat with 2 teaspoons Worcestershire sauce.\nSet cooker to Low and cook until meat is tender, 8 to 10 hours.",
    "pt": "15 m",
    "ct": "8 h ",
    "tt": "8 h ",
    "i": "924256.jpg",
    "o": "4511007.jpg,4499194.jpg,3472077.jpg,3381016.jpg,3170761.jpg,1505871.jpg",
    "st": "allrecipes"
}