{
    "id": 229960,
    "old_rating": "4.49724",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package linguine pasta",
        "2 tablespoons butter",
        "2 tablespoons extra-virgin olive oil",
        "2 shallots, finely diced",
        "2 cloves garlic, minced",
        "1 pinch red pepper flakes (optional)",
        "1 pound shrimp, peeled and deveined",
        "1 pinch kosher salt and freshly ground pepper",
        "1/2 cup dry white wine",
        "1 lemon, juiced",
        "2 tablespoons butter",
        "2 tablespoons extra-virgin olive oil",
        "1/4 cup finely chopped fresh parsley leaves",
        "1 teaspoon extra-virgin olive oil, or to taste"
    ],
    "nut": [
        "Calories > 511 kcal",
        "Carbs > 57.5 g",
        "Cholesterol > 135 mg",
        "Fat > 19.4 g",
        "Protein > 21.9 g",
        "Sodium > 260 mg"
    ],
    "n": "Shrimp Scampi with Pasta",
    "a": "JustJen",
    "r": "0",
    "s": 6,
    "des": "\"Well-rounded seafood and pasta dish. Good with any pasta; angel hair is less filling.\"",
    "ins": "Bring a large pot of salted water to a boil; cook linguine in boiling water until nearly tender, 6 to 8 minutes. Drain.\nMelt 2 tablespoons butter with 2 tablespoons olive oil in a large skillet over medium heat. Cook and stir shallots, garlic, and red pepper flakes in the hot butter and oil until shallots are translucent, 3 to 4 minutes. Season shrimp with kosher salt and black pepper; add to the skillet and cook until pink, stirring occasionally, 2 to 3 minutes. Remove shrimp from skillet and keep warm.\nPour white wine and lemon juice into skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Melt 2 tablespoons butter in skillet, stir 2 tablespoons olive oil into butter mixture, and bring to a simmer. Toss linguine, shrimp, and parsley in the butter mixture until coated; season with salt and black pepper. Drizzle with 1 teaspoon olive oil to serve.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "4538696.jpg",
    "o": "4538696.jpg,4535338.jpg,4534425.jpg,4532896.jpg,4531068.jpg,4529635.jpg",
    "st": "allrecipes"
}