{
    "id": 230055,
    "old_rating": "4.87879",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound Brussels sprouts, trimmed and quartered",
        "2 tablespoons olive oil",
        "salt and ground black pepper to taste",
        "1 cup chopped hazelnuts",
        "3 slices thick-cut bacon, chopped",
        "2 tablespoons maple syrup",
        "2 tablespoons chopped fresh rosemary",
        "1 cup dried cranberries",
        "1/4 cup grated Pecorino-Romano cheese"
    ],
    "nut": [
        "Calories > 304 kcal",
        "Carbs > 31.1 g",
        "Cholesterol > 7 mg",
        "Fat > 18.8 g",
        "Protein > 7.8 g",
        "Sodium > 154 mg"
    ],
    "n": "Warm Brussels Sprout Salad with Hazelnuts and Cranberries",
    "a": "aayers1",
    "r": "0",
    "s": 6,
    "des": "\"Brussels sprouts, hazelnuts, and cranberries combine to make a salad that even kids will want to eat. The colors and flavors make a great fall or holiday side dish, but we have been enjoying it all summer as well.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nToss Brussels sprouts with olive oil, salt, and pepper together in a bowl until coated. Transfer coated sprouts to a baking sheet.\nBake in the preheated oven until sprouts are tender, about 15 minutes.\nCook and stir hazelnuts in a skillet over medium-low heat until lightly toasted and fragrant, about 5 minutes. Transfer hazelnuts to a bowl.\nCook and stir bacon in the same skillet over medium heat until crisp, about 10 minutes. Add maple syrup and rosemary; cook, stirring often, until the bacon drippings and maple syrup begin to thicken and stick to the back of a spoon, about 10 minutes.\nCombine cooked Brussels sprouts and bacon mixture together in a large bowl; toss until sprouts are coated with maple syrup sauce. Sprinkle in hazelnuts, cranberries, and Pecorino-Romano cheese; toss well. This dish is best served warm.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "1000796.jpg",
    "o": "",
    "st": "allrecipes"
}