{
    "id": 230111,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds sweet potatoes",
        "3 tablespoons butter, melted",
        "6 tablespoons packed brown sugar",
        "3 tablespoons dark rum",
        "3/4 teaspoon salt",
        "4 tangelos",
        "3 tablespoons butter, melted",
        "3 tablespoons packed brown sugar",
        "3 tablespoons chopped pecans"
    ],
    "nut": [
        "Calories > 334 kcal",
        "Carbs > 55.2 g",
        "Cholesterol > 23 mg",
        "Fat > 10.8 g",
        "Protein > 3.4 g",
        "Sodium > 378 mg"
    ],
    "n": "Tangerine Sweet Potato Casserole",
    "a": "Pat Hymes",
    "r": "0",
    "s": 8,
    "des": "\"Not the usual 'sweet marshmallow' sweet potato dish. Can be prepared 1 to 2 days ahead and baked when ready to serve. \nA favorite at our Thanksgiving dinners!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a large baking sheet with aluminum foil. Grease a 2-quart casserole.\nPlace sweet potatoes on the prepared baking sheet.\nBake sweet potatoes in the preheated oven until tender, about 45 minutes. Reduce oven heat to 375 degrees F (190 degrees C). Let sweet potatoes rest until cool enough to handle. Peel the sweet potatoes and transfer into a large bowl.\nWhip sweet potatoes with 3 tablespoons melted butter, 6 tablespoons brown sugar, rum, and salt with an electric mixer, until potatoes are smooth and fluffy, 3 to 5 minutes.\nPeel tangelos, section the fruit, and remove membranes, pith, and seeds. Cut sections from 2 tangelos in half crosswise; Set aside sections of remaining 2 tangelos. Gently fold halved tangelo sections into the sweet potato mixture. Transfer sweet potato mixture to the prepared casserole dish.\nArrange reserved tangelo sections atop sweet potato mixture. Combine 3 tablespoons melted butter, 3 tablespoons brown sugar, and pecans in a bowl until crumbly; sprinkle evenly over the dish.\nBake in the preheated oven until heated through and the topping is lightly browned, about 30 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}