{
    "id": 230127,
    "old_rating": "4.81818",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter, softened",
        "2/3 cup white sugar",
        "2/3 cup packed brown sugar",
        "2 cups mashed sweet potatoes",
        "1 (14 ounce) can sweetened condensed milk",
        "4 eggs, beaten",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground nutmeg",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon ground cloves",
        "2 cups baking mix (such as Bisquick Â®)",
        "2 tablespoons baking mix (such as Bisquick Â®)",
        "1 cup chopped pecans"
    ],
    "nut": [
        "Calories > 411 kcal",
        "Carbs > 49.2 g",
        "Cholesterol > 85 mg",
        "Fat > 22.4 g",
        "Protein > 6.1 g",
        "Sodium > 358 mg"
    ],
    "n": "Pecan Sweet Potato Bread",
    "a": "JENSGEMS",
    "r": "0",
    "s": 16,
    "des": "\"Moist delicious way to use up excess sweet potatoes or yams after the holidays. This is so delicious that it disappeared within minutes. Wrap in aluminum foil to keep the moisture in. Ideally, refrigerate the loaves for 2 hours or more before serving; or can be frozen and served later. Just remove from freezer and allow to thaw while still covered at room temperature for about 4 hours before serving.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9x5-inch loaf pans.\nBeat butter, white sugar, and brown sugar together in a bowl until smooth. Stir in sweet potatoes, sweetened condensed milk, eggs, cinnamon, nutmeg, ginger, and cloves until well blended.\nPlace all the baking mix in a large bowl; stir sweet potato mixture into baking mix until batter is just blended. Fold in pecans. Divide the batter evenly between the two loaf pans.\nBake in the preheated oven until a knife inserted in the center of the loaves comes out clean, 60 to 70 minutes. Cool loaves in the pans for at least 5 minutes before removing to cool completely on a wire rack, at least 2 hours.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "3 h ",
    "i": "1635938.jpg",
    "o": "",
    "st": "allrecipes"
}