{
    "id": 230113,
    "old_rating": "4.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (15 pound) whole turkey, neck and giblets removed",
        "5 teaspoons butter, cut into 1-teaspoon pats",
        "2 teaspoons minced garlic, divided",
        "1 (1 ounce) package assorted fresh herbs (poultry seasoning blend)",
        "1 teaspoon garlic salt, or to taste",
        "1 teaspoon seasoned salt, or to taste",
        "1 teaspoon ground black pepper, or to taste",
        "1 teaspoon onion salt, or to taste",
        "1 (16 ounce) package bacon",
        "3 cups butter, melted - divided"
    ],
    "nut": [
        "Calories > 1078 kcal",
        "Carbs > 1.7 g",
        "Cholesterol > 380 mg",
        "Fat > 74.2 g",
        "Protein > 96.1 g",
        "Sodium > 1026 mg"
    ],
    "n": "Dave's Famous Thanksgiving Turkey",
    "a": "AlisaLansdale",
    "r": "0",
    "s": 15,
    "des": "\"This is my brother's way of making a turkey, and it turns out perfect every single time! Takes a whole day, but the rave reviews are worth it! This turkey recipe assumes you will be stuffing the turkey.\"",
    "ins": "Preheat oven to 320 degrees F (160 degrees C).\nLoosen skin over turkey breast and thighs with your fingers; insert 3 pats of butter under the skin over the breast and 1 pat under the skin of each thigh. Poke 10 holes into the turkey meat over the breast and thighs; press minced garlic into the holes. Loosely pack poultry seasoning herbs into the turkey cavity. Sprinkle the skin of the bird with garlic salt, seasoned salt, black pepper, and onion salt.\nWrap turkey with slices of bacon, covering as much of the bird as possible. Place turkey into a roasting pan. Melt 1/2 cup butter in a small saucepan and brush butter over the whole turkey including bacon slices. Cover turkey with a tent of aluminum foil.\nRoast the turkey in the preheated oven for 3 1/2 hours, basting with 1/2 cup melted butter every 30 minutes. Remove aluminum tent, baste turkey with pan drippings, and continue roasting until skin is browned and an instant-read meat thermometer inserted into the thickest part of a thigh, not touching bone, reads at least 165 degrees F (75 degrees C), 30 to 45 more minutes.",
    "pt": "20 m",
    "ct": "4 h",
    "tt": "4 h ",
    "i": "4207775.jpg",
    "o": "",
    "st": "allrecipes"
}