{
    "id": 230116,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 slices gluten-free bread (such as Rudi'sÂ® Original)",
        "3 tablespoons coconut oil",
        "2 yellow onions, chopped",
        "2 stalks celery, chopped",
        "1/2 leek, chopped",
        "1/4 cup finely chopped fresh parsley",
        "1 sprig fresh sage, leaves finely chopped",
        "1 sprig fresh marjoram, finely chopped",
        "1 sprig fresh thyme, finely chopped",
        "1 sprig fresh rosemary, leaves finely chopped",
        "2 tablespoons coconut oil, melted",
        "1 cup vegetable broth, or as needed"
    ],
    "nut": [
        "Calories > 449 kcal",
        "Carbs > 50.4 g",
        "Cholesterol > 0 mg",
        "Fat > 25.9 g",
        "Protein > 6.3 g",
        "Sodium > 255 mg"
    ],
    "n": "Gluten-Free Bomb-Diggity Stuffing",
    "a": "melaniecarr23",
    "r": "0",
    "s": 4,
    "des": "\"This stuffing is so tasty, and I can't wait to make it for everyone at Thanksgiving. I did this as a test experiment to see if I could make stuffing that would not make my love miss the bagged wheat-based stuffing. I also wanted it to be so good even our wheat-eating friends wouldn't be able to tell. I think it succeeded! Bake outside the bird or use to stuff a turkey.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nCut bread slices into cubes and spread onto a baking sheet.\nBake in the preheated oven until cubes are dry and crisp, 15 to 20 minutes.\nHeat 3 tablespoons coconut oil in a skillet over medium heat. Cook and stir onions, celery, and leek in the hot oil until soft, 8 to 10 minutes. Transfer vegetables into a bowl and stir gluten-free bread cubes, parsley, sage, marjoram, thyme, rosemary, and 2 tablespoons coconut oil into the vegetables. Moisten dressing with vegetable broth, about 1/2 cup at a time, mixing thoroughly. Transfer into a 9-inch square baking dish and cover with aluminum foil.\nBake in the preheated oven for 20 minutes. Uncover and bake until stuffing is heated through and top is lightly golden brown, about 15 more minutes.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "2912697.jpg",
    "o": "",
    "st": "allrecipes"
}