{
    "id": 230145,
    "old_rating": "4.26667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (12 ounce) box vanilla wafer cookies (such as NillaÂ®)",
        "1 cup semisweet chocolate chips",
        "1/4 cup light corn syrup",
        "3/4 cup dark rum (such as Meyer'sÂ®)",
        "1 cup confectioners' sugar, plus more for dusting"
    ],
    "nut": [
        "Calories > 148 kcal",
        "Carbs > 22.3 g",
        "Cholesterol > 0 mg",
        "Fat > 4.9 g",
        "Protein > 0.9 g",
        "Sodium > 46 mg"
    ],
    "n": "Rum Balls",
    "a": "Matt Story",
    "r": "0",
    "s": 24,
    "des": "\"I wanted a good rum ball with a lot of kick, so I sat down and came up with this recipe. I didn't realize how good these were until one year I didn't make them for work. I just about got lynched! Needless to say, I've made them every year since (about 20 years). These are best if you use Meyers Original Dark RumÂ® chilled, and NabiscoÂ® 'Nilla wafer cookies. They are at their peak if you make them 2 days in advance. Remove from fridge 30 minutes before serving.\"",
    "ins": "Place vanilla cookies in a food processor and process into fine crumbs.\nHeat chocolate chips and corn syrup together in a saucepan over low heat. Cook, stirring often, until chocolate is melted and smooth, about 5 minutes. Remove from heat and stir in rum and confectioners' sugar until smooth. Fold in cookie crumbs; dough will be sticky.\nPlace saucepan in the refrigerator until dough is firm and easy to roll, about 15 minutes. Cover 2 plates with waxed paper; dust with confectioners' sugar.\nRoll dough into 1-inch balls and place on the prepared plates. Dust rum balls with confectioners' sugar. Refrigerate until firm, about 30 minutes.\nRemove rum balls from refrigerator and transfer to a resealable bag, including the extra confectioners' sugar. Seal the bag and shake to coat the rum balls completely with confectioners' sugar.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "1 h ",
    "i": "4331610.jpg",
    "o": "",
    "st": "allrecipes"
}