{
    "id": 230156,
    "old_rating": "4.53333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 fresh tomatillos, husks removed",
        "1 white onion, coarsely chopped",
        "1 poblano pepper, peeled and seeded",
        "1 jalapeno pepper, seeded",
        "3/4 cup chopped cilantro",
        "4 cloves garlic",
        "2 leaves fresh mint",
        "salt to taste",
        "3 cups shredded cooked chicken",
        "1/4 cup vegetable oil",
        "12 (6 inch) white corn tortillas, cut into 3 strips",
        "3/4 cup shredded pepperjack cheese",
        "3/4 cup shredded Monterey Jack cheese"
    ],
    "nut": [
        "Calories > 297 kcal",
        "Carbs > 22.3 g",
        "Cholesterol > 62 mg",
        "Fat > 13.2 g",
        "Protein > 22.6 g",
        "Sodium > 205 mg"
    ],
    "n": "Traditional Chilaquiles",
    "a": "Gameface",
    "r": "0",
    "s": 8,
    "des": "\"This is a traditional recipe that is good to eat as breakfast with fried eggs or as a dinner main course with a salad.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nBlend tomatillos, onion, poblano pepper, jalapeno pepper, cilantro, garlic, mint, and salt in a blender until smooth. Transfer mixture to a saucepan and bring to a gentle boil. Reduce heat to medium-low and simmer until thickened, stirring often, about 10 minutes. Add chicken to tomatillo sauce and continue to simmer until chicken is heated through, about 5 minutes more.\nHeat vegetable oil in a large skillet over medium heat. Fry tortilla strips in batches until crisp and lightly browned, 5 to 7 minutes. Drain on a paper towel-lined plate.\nLayer about half the fried tortillas in a 2-quart baking dish; spread half the tomatillo sauce over tortillas. Mix pepperjack cheese and Monterey Jack cheese in a bowl; sprinkle half over tomatillo sauce. Repeat layers.\nBake in preheated oven until cheese is golden and bubbly, 30 to 35 minutes. Allow to cool 5 minutes before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "932122.jpg",
    "o": "",
    "st": "allrecipes"
}