{
    "id": 230144,
    "old_rating": "4.6381",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup quinoa",
        "2 cups water",
        "1 teaspoon olive oil",
        "1 teaspoon salt",
        "2 cups chopped broccoli",
        "1 (10 ounce) can low-sodium cream of mushroom soup",
        "1 cup shredded Cheddar cheese",
        "1/2 cup French-fried onions",
        "1/2 cup light sour cream",
        "1 teaspoon lemon pepper",
        "salt and ground black pepper to taste",
        "1/2 cup French-fried onions"
    ],
    "nut": [
        "Calories > 494 kcal",
        "Carbs > 39.8 g",
        "Cholesterol > 31 mg",
        "Fat > 32.1 g",
        "Protein > 10.3 g",
        "Sodium > 938 mg"
    ],
    "n": "Quinoa Broccoli Casserole",
    "a": "SketchyRecipe",
    "r": "0",
    "s": 6,
    "des": "\"This is vegetarian comfort super-food. Warm, gooey, and delicious. Serve with a green salad and sliced fruit.\"",
    "ins": "Place quinoa in a bowl; pour in enough water to cover. Soak for 30 minutes. Drain and rinse several times.\nBring quinoa, water, olive oil, and 1 teaspoon salt to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and the water has been absorbed, about 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking dish.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add broccoli, cover, and steam until tender, 2 to 4 minutes.\nStir broccoli, cream of mushroom soup, Cheddar cheese, 1/2 cup French-fried onions, sour cream, and lemon pepper into cooked quinoa; season with salt and black pepper to taste. Spoon quinoa mixture into the prepared baking dish.\nBake in the preheated oven until heated through, 10 minutes. Sprinkle with 1/2 cup French-fried onions and bake until topping is lightly browned, about 5 more minutes.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "1013876.jpg",
    "o": "4479499.jpg,4471931.jpg,4006396.jpg,2951963.jpg,2461292.jpg,2362978.jpg",
    "st": "allrecipes"
}