{
    "id": 230170,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup butter, softened",
        "1/2 cup vegetable shortening",
        "1/2 cup white sugar",
        "1/2 cup confectioners' sugar",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon cream of tartar",
        "1/8 teaspoon salt",
        "1 egg",
        "1/2 teaspoon vanilla extract",
        "2 cups all-purpose flour",
        "1/3 cup seedless raspberry jam",
        "1 cup white chocolate chips",
        "2 tablespoons red sugar sprinkles, or as desired"
    ],
    "nut": [
        "Calories > 197 kcal",
        "Carbs > 23.1 g",
        "Cholesterol > 20 mg",
        "Fat > 11.1 g",
        "Protein > 1.9 g",
        "Sodium > 77 mg"
    ],
    "n": "White Chocolate Raspberry Thumbprint Cookies",
    "a": "SDSMarvin",
    "r": "0",
    "s": 24,
    "des": "\"These are my favorite. You can use any flavor jam you want. The servings will depend on the size of your cookies. If you use the WiltonÂ® bags, you can skip a step and just melt the chocolate in the bag.\"",
    "ins": "Beat butter and shortening together in a bowl with an electric mixer until smooth; add white sugar, confectioners' sugar, baking soda, cream of tartar, and salt. Beat until just combined. Stir in egg and vanilla extract. Gradually mix in flour until just combined. Cover and refrigerate dough for 3 hours.\nPreheat oven to 375 degrees F (190 degrees C).\nRoll the dough into 3/4-inch balls and arrange on an ungreased baking sheet. Press your thumb or end of wooden spoon into the center of each dough ball making an indentation. Spoon 1/4 teaspoon jam into each thumbprint.\nBake in the preheated oven until edges of cookies become lightly browned, 8 to 10 minutes. Cool on a wire rack for 5 minutes.\nPlace white chocolate chips in a microwave-safe bowl; cook in microwave in 10-second intervals, stirring after each interval, until chips are melted. Spoon melted white chocolate into a disposable decorating or plastic bag. Snip off one small corner of bag; drizzle white chocolate over cookies. Sprinkle with red sugar.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "3 h ",
    "i": "2237391.jpg",
    "o": "",
    "st": "allrecipes"
}