{
    "id": 230221,
    "old_rating": "4.55556",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 cups water",
        "2 cups green beans, chopped",
        "1 teaspoon extra-virgin olive oil",
        "1 small onion, chopped fine",
        "1 1/2 pounds ground turkey",
        "salt and ground black pepper to taste",
        "5 cloves garlic, minced",
        "2 tablespoons chopped fresh basil",
        "2 teaspoons chopped fresh thyme",
        "1 cup frozen peas",
        "1 cup mushrooms, chopped",
        "2 zucchini, chopped",
        "2 cups crushed tomatoes",
        "1 cup shredded mozzarella cheese",
        "2 tablespoons freshly grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 217 kcal",
        "Carbs > 9.6 g",
        "Cholesterol > 73 mg",
        "Fat > 9.9 g",
        "Protein > 23.6 g",
        "Sodium > 191 mg"
    ],
    "n": "Gluten-Free Casserole",
    "a": "halfnotes",
    "r": "0",
    "s": 8,
    "des": "\"I had some things I needed to use in the fridge, so I decided to be brave and create my own casserole. It turned out pretty good and my kids loved it! This is a dish where you could substitute with different veggies and it would work great.\"",
    "ins": "Bring water to a boil in a large pot. Cook green beans at a boil until just softened, about 3 minutes; drain.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a large skillet over medium-low heat. Cook and stir onion in hot oil until translucent, 3 to 5 minutes.\nCrumble ground turkey into the skillet and increase heat to medium-high. Season turkey generously with salt and pepper; cook and stir until the turkey is completely browned, 7 to 10 minutes. Reduce heat to medium. Stir garlic, basil, and thyme through the turkey mixture; cook, stirring occasionally, another 3 minutes.\nRemove turkey mixture from skillet with a slotted spoon and transfer to a 9x13-inch casserole dish. Reserve 2 tablespoons of the pan drippings for later use and discard remainder.\nHeat the reserved pan drippings in the skillet over medium heat. Stir green beans, peas, mushrooms, and zucchini into the hot pan drippings; season with salt and black pepper. Cook and stir vegetable mixture until hot, about 5 minutes; add to casserole dish and stir to combine. Pour crushed tomatoes over the turkey and vegetable mixture. Top with a layer of mozzarella cheese. Sprinkle Parmesan cheese over the mozzarella cheese.\nBake in preheated oven until the cheese is melted and vegetables are tender, about 20 minutes. Rest dish 10 minutes before serving.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "3685514.jpg",
    "o": "",
    "st": "allrecipes"
}