{
    "id": 230200,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 pears, peeled",
        "10 fluid ounces red wine, or more to taste",
        "1/2 cup dark brown sugar, packed",
        "1 vanilla bean, split and seeds scraped out and reserved",
        "1 orange, peeled and juiced (peel reserved)",
        "7 ounces shelled walnuts, divided",
        "1/2 cup heavy whipping cream",
        "1/2 cup sour cream",
        "1 orange, zested and juiced",
        "2 teaspoons dark brown sugar, or as needed"
    ],
    "nut": [
        "Calories > 397 kcal",
        "Carbs > 37 g",
        "Cholesterol > 27 mg",
        "Fat > 24.8 g",
        "Protein > 5.1 g",
        "Sodium > 20 mg"
    ],
    "n": "Baked Pears with Wine and Walnut Cream",
    "a": "paparick",
    "r": "0",
    "s": 8,
    "des": "\"Sweet, fruity dessert. Garnish with orange peel and walnuts if desired.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nArrange pears in an oven-proof pan with a tight-fitting lid; add red wine, 1/2 cup brown sugar, vanilla bean and seeds, and the peel and juice of 1 orange. Bring pear mixture to a boil; sprinkle with half the walnuts.\nBake the pear mixture in the preheated oven until pears are tender, 20 to 30 minutes, basting pears with red wine syrup every 10 minutes. Remove from oven and cool; remove the vanilla bean and orange peel from the red wine syrup.\nArrange the remaining walnuts on a baking sheet and bake in the preheated oven until toasted and fragrant, 5 minutes.\nPlace the toasted walnuts in a food processor and pour in the red wine syrup; pulse until paste-like consistency. Transfer to a bowl. Whisk cream, sour cream, zest and juice of 1 orange, and 2 teaspoons brown sugar into walnut-red wine paste until smooth.\nServe walnut-cream sauce over baked pears.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "3888963.jpg",
    "o": "",
    "st": "allrecipes"
}