{
    "id": 230213,
    "old_rating": "4.48333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon extra-virgin olive oil, or as needed",
        "10 white mushrooms, minced",
        "1 shallot, minced",
        "1/2 teaspoon dried thyme",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon dried sage",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon salt",
        "1/4 cup chopped fresh parsley",
        "2 cups fresh spinach",
        "1 teaspoon Dijon mustard",
        "1 (2 pound) pork tenderloin, butterflied and pounded flat",
        "4 slices prosciutto",
        "2 tablespoons extra-virgin olive oil"
    ],
    "nut": [
        "Calories > 296 kcal",
        "Carbs > 4.2 g",
        "Cholesterol > 89 mg",
        "Fat > 16.2 g",
        "Protein > 32.1 g",
        "Sodium > 440 mg"
    ],
    "n": "Stuffed Pork Tenderloin",
    "a": "ciaofraz",
    "r": "0",
    "s": 5,
    "des": "\"I came up with this spinach and mushroom stuffed pork tenderloin one day when looking for something new to do with pork tenderloin. This dish is very easy to make and assemble and is so pretty to serve to family and guests. I like to serve this with a nice salad and roasted potatoes.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat 1 teaspoon olive oil in a skillet over medium heat; cook and stir mushrooms, shallot, thyme, garlic powder, sage, black pepper, and salt in the hot oil until liquid has evaporated and mushrooms and shallots are softened, 5 to 10 minutes. Add parsley; cook and stir for 1 minute. Mix in spinach; cook and stir until spinach is wilted, about 5 minutes. Stir in mustard. Remove from heat.\nPlace pork tenderloin on a work surface; lay prosciutto atop tenderloin. Spread mushroom-spinach mixture over prosciutto, leaving 1/2-inch border on all sides. Tightly roll tenderloin around the filling and tie together with kitchen string to keep closed.\nHeat 2 tablespoons olive oil in a large skillet over medium heat; place rolled tenderloin in the hot oil. Sear until all sides are golden brown, about 10 minutes. Transfer seared tenderloin to a 9x13-inch casserole dish.\nBake in the preheated oven until pork is no longer pink in the center, 25 to 30 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (71 degrees C).",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "929542.jpg",
    "o": "4531089.jpg,4531088.jpg,4285747.jpg,4073940.jpg,4045416.jpg,3943506.jpg",
    "st": "allrecipes"
}