{
    "id": 230291,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 egg whites at room temperature",
        "1/4 cup white sugar",
        "1/4 teaspoon cream of tartar",
        "1 dash peppermint extract, or to taste",
        "2 cups confectioners' sugar, or as needed",
        "1 (6 ounce) package semisweet chocolate chips",
        "3/4 cup heavy whipping cream, or as needed",
        "1 teaspoon white sugar, or to taste",
        "1 peppermint candy cane, finely crushed"
    ],
    "nut": [
        "Calories > 115 kcal",
        "Carbs > 18.5 g",
        "Cholesterol > 10 mg",
        "Fat > 4.9 g",
        "Protein > 0.9 g",
        "Sodium > 11 mg"
    ],
    "n": "French Peppermint Cookies with Chocolate Ganache",
    "a": "Lillie",
    "r": "0",
    "s": 24,
    "des": "\"Crisp on the outside, softer in the middle, and coated with creamy chocolate ganache. These French-influenced cookies have a meringue-and-confectioners'-sugar base with peppermint flavoring and peppermint candy. You may add any flavoring, including cinnamon, creme de menthe, raspberry, orange, etc. in lieu of peppermint. Garnish with peppermint or as desired.\"",
    "ins": "Move rack to the bottom of oven and preheat oven to 175 degrees F (80 degrees C). Line baking sheets with aluminum foil.\nWhisk egg whites and 1/4 cup white sugar in the top of a double boiler set over simmering water until smooth. Whisk cream of tartar and peppermint extract into egg mixture and beat until foamy. Gradually whisk confectioners' sugar into mixture, beating until egg white meringue holds stiff peaks.\nScoop about 1 tablespoon of meringue per cookie and gently transfer to the prepared baking sheets; use spoon to shape the meringue cookies into football shape with 2 gently pointed ends.\nBake cookies on bottom rack of the preheated oven until dry on the outside but still slightly soft in the centers, about 1 1/2 hours. Let cool completely before removing from baking sheets.\nMelt chocolate chips in the top of a double boiler over simmering water until melted, stirring until smooth. Gradually mix cream into chocolate until mixture is thick but not pasty; stir 1 teaspoon white sugar into chocolate ganache until sugar has dissolved. Dip cookies in ganache. Place dipped cookies atop a piece of parchment paper and sprinkle with crushed peppermint candy. Let cookies set; refrigerate leftovers.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "958409.jpg",
    "o": "",
    "st": "allrecipes"
}