{
    "id": 230274,
    "old_rating": "4.38462",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 cups water",
        "1/2 cup salt",
        "1/2 cup dark brown sugar",
        "2 bay leaves",
        "2 sprigs fresh rosemary",
        "1 teaspoon ground black pepper",
        "1 teaspoon dried thyme",
        "1 (4 pound) boneless pork loin roast",
        "1 tablespoon olive oil",
        "1 cup chopped Granny Smith apple",
        "2 tablespoons minced shallots",
        "5 ounces spinach, chopped",
        "3/4 cup chopped walnuts",
        "1 egg",
        "1 tablespoon crumbled goat cheese, or to taste",
        "salt and freshly ground black pepper to taste"
    ],
    "nut": [
        "Calories > 399 kcal",
        "Carbs > 14.7 g",
        "Cholesterol > 107 mg",
        "Fat > 23.6 g",
        "Protein > 31.8 g",
        "Sodium > 5674 mg"
    ],
    "n": "Brined and Stuffed Pork Loin Roast",
    "a": "WVmountaineer",
    "r": "0",
    "s": 10,
    "des": "\"An easy and tasty pork roast. Goes great with applesauce.\"",
    "ins": "Mix water, salt, and brown sugar in a saucepan, stirring to dissolve salt and sugar. Add bay leaves, rosemary, 1 teaspoon black pepper, and thyme; bring to a boil. Reduce heat to low and simmer brine for 5 minutes. Let brine cool to room temperature.\nPlace pork roast into a large nonreactive bowl, pour brine over pork, and cover; marinate in refrigerator for 12 to 24 hours.\nHeat olive oil in a skillet over medium heat; cook and stir apple and shallots into hot oil until shallots are soft, about 5 minutes. Remove from heat, let cool to room temperature, and mix spinach, walnuts, egg, and goat cheese into apple mixture. Season stuffing with salt and black pepper.\nPreheat oven to 400 degrees F (200 degrees C).\nRemove pork from brine and discard used brine. Cut roast lengthwise down the center to within about 1 1/2 inches of the bottom and open the roast like a book. Spoon apple stuffing onto one side of meat and fold the other half over the stuffing. Tie the roast closed in 4 or 5 places with kitchen twine. Set roast on a rack placed into a roasting pan.\nRoast in the preheated oven until an instant-read thermometer inserted into the center of the stuffing reads 145 to 150 degrees F (63 degrees C to 65 degrees C), about 1 hour and 15 minutes.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "14 h ",
    "i": "1292576.jpg",
    "o": "",
    "st": "allrecipes"
}