{
    "id": 230267,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Crust:",
        "10 graham crackers",
        "1/2 cup walnut pieces",
        "1/4 cup confectioners' sugar",
        "1 1/2 teaspoons ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1 pinch salt",
        "2 tablespoons unsalted butter, melted",
        "Cheesecake:",
        "2 pounds cream cheese at room temperature",
        "4 eggs at room temperature",
        "1 1/2 cups white sugar",
        "3/4 cup sour cream",
        "1/2 cup half-and-half",
        "1/4 cup sweetened condensed milk",
        "1/4 cup all-purpose flour",
        "2 teaspoons vanilla extract",
        "1 quart boiling water, or as needed"
    ],
    "nut": [
        "Calories > 655 kcal",
        "Carbs > 50.1 g",
        "Cholesterol > 195 mg",
        "Fat > 46.3 g",
        "Protein > 12.6 g",
        "Sodium > 366 mg"
    ],
    "n": "Shavuot Cheesecake",
    "a": "ISABEL",
    "r": "0",
    "s": 10,
    "des": "\"This is a tasty cheesecake to make during the Jewish holiday of Shavuot, when you eat a lot of dairy foods. Top with your favorite blueberry, strawberry, or other topping. Or enjoy it without a topping. It is a delicious cheesecake!\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Place parchment paper over bottom of a 9-inch springform pan and seal pan around the base (the parchment paper should be sticking out the edges). Grease sides of pan, but not parchment paper.\nPulse graham crackers, confectioners' sugar, walnuts, cinnamon, nutmeg, and salt in a food processor until mixture is crumbly, about 30 seconds. Pour melted butter over the crumbs and continue to process for 10 seconds. Push crumbs down the sides of the processor with a spatula and continue processing for about 10 more seconds until crumbs are evenly darkened. Press mixture firmly in an even layer across bottom of pan.\nClean and dry food processor. Cut cream cheese into chunks and place in food processor. Add eggs, sugar, sour cream, half-and-half, sweetened condensed milk, flour, and vanilla extract. Using short 1-second pulses, blend until smooth. This should take about 15 seconds; scrape down the sides if necessary, but do not overmix.\nBring water to a boil. While water is heating, carefully pour cheesecake filling into prepared springform pan. Smooth surface with a spatula. Pop large bubbles with the tip of a paring knife.\nPlace a large roasting pan in bottom of oven; pour in boiling water. Set cheesecake on middle oven rack, above pan of water.\nBake in preheated oven for 1 hour. Remove roasting pan, close oven, turn off heat, and let cheesecake rest inside oven for 1 to 2 hours.\nRemove cheesecake from oven; allow it to cool to room temperature. Store cheesecake in refrigerator and chill overnight before serving.",
    "pt": "40 m",
    "ct": "1 h",
    "tt": "11 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}