{
    "id": 230283,
    "old_rating": "4.5122",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package elbow macaroni",
        "1/2 teaspoon salt",
        "3/4 cup butter, softened - divided",
        "1 cup sour cream",
        "1 tablespoon cream cheese, softened",
        "1 (8 ounce) package shredded sharp Cheddar cheese",
        "1 egg yolk",
        "2 tablespoons all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground cayenne pepper",
        "1 cup milk",
        "1 (8 ounce) package shredded mild Cheddar cheese"
    ],
    "nut": [
        "Calories > 455 kcal",
        "Carbs > 31.3 g",
        "Cholesterol > 98 mg",
        "Fat > 29.7 g",
        "Protein > 16 g",
        "Sodium > 532 mg"
    ],
    "n": "Tasty Baked Mac n Cheese",
    "a": "Eva Maria",
    "r": "0",
    "s": 12,
    "des": "\"I love this recipe because it's taken me so long to actually get a good tasting noodle and not just a good tasting piece of cheese on top. This recipe was just trial and error and it's really really good in my opinion. I'm really looking for feedback on this recipe. Thanks so much! This is really good even days after for leftovers. The cheese remelts and the flavor really sets in. Enjoy!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line a 9x13-inch baking dish with parchment paper.\nBring a large pot of water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until almost cooked through and firm to the bite, about 7 minutes. Drain and transfer to a large bowl. Sprinkle macaroni with 1/2 teaspoon salt and stir 1/2 cup butter into the pasta.\nMix 1/4 cup butter, sour cream, cream cheese, sharp Cheddar cheese, and egg yolk together in a bowl. Stir flour, 1/2 teaspoon salt, cayenne pepper, and milk into the sour cream mixture.\nSpread 1/4 cup sour cream sauce over bottom of prepared baking dish. Stir remaining sour cream sauce into macaroni. Pour macaroni into baking dish atop sauce layer; sprinkle mild Cheddar cheese over the casserole.\nBake in the preheated oven until heated through and cheese topping has melted, about 15 minutes.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "4025325.jpg",
    "o": "4519501.jpg,4478377.jpg,4471496.jpg,4462390.jpg,4109357.jpg,3892657.jpg",
    "st": "allrecipes"
}