{
    "id": 230239,
    "old_rating": "4.46154",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Brownie:",
        "1 (21 ounce) package fudge brownie mix",
        "Peppermint Filling:",
        "5 cups confectioners' sugar",
        "14 tablespoons butter, melted",
        "2 tablespoons heavy cream",
        "1 teaspoon McCormickÂ® Pure Peppermint Extract",
        "1/8 teaspoon Berry color from McCormickÂ® Color from Natureâ„¢ - Food Colors",
        "Chocolate Glaze:",
        "12 ounces semi-sweet baking chocolate, coarsely chopped",
        "1/2 cup butter",
        "Crushed peppermint candies or candy canes (optional)"
    ],
    "nut": [
        "Calories > 250 kcal",
        "Carbs > 36 g",
        "Cholesterol > 20 mg",
        "Fat > 12.2 g",
        "Protein > 1.7 g",
        "Sodium > 115 mg"
    ],
    "n": "Peppermint Bars from McCormickÂ®",
    "a": "McCormick Spice",
    "r": "0",
    "s": 36,
    "des": "\"An extravagant dessert of a fudgy brownie layered with peppermint frosting and a rich chocolate glaze. You'll want to include this in a holiday dessert tray or package for a cookie exchange or gift basket.\"",
    "ins": "Preheat oven to 350 degrees F. Prepare brownie mix as directed on package. Spread in greased foil-lined 15x10x1-inch baking pan.\nBake 15 minutes or until toothpick inserted into center comes out almost clean. Cool in pan on wire rack.\nMeanwhile, for the Filling, beat confectioners' sugar, melted butter, cream, peppermint extract and Berry color in large bowl with electric mixer on medium speed until well blended and smooth. Spread evenly over cooled brownie. Refrigerate 30 minutes.\nFor the Glaze, microwave chocolate and remaining 1/2 cup (1 stick) butter in large microwaveable bowl on HIGH 2 minutes or until butter is melted. Stir until chocolate is completely melted. Spread over top of chilled brownie. Sprinkle with crushed peppermint candies, if desired. Cut into bars.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "1 h",
    "i": "4228175.jpg",
    "o": "",
    "st": "allrecipes"
}