{
    "id": 230388,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds bone-in beef short ribs",
        "2 onions, finely chopped",
        "1 cup tomato sauce",
        "1 cup water",
        "1/4 cup cider vinegar",
        "3 tablespoons white sugar, or more to taste",
        "2 tablespoons chopped fresh parsley",
        "1 tablespoon prepared horseradish",
        "1 tablespoon prepared mustard",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 782 kcal",
        "Carbs > 18.8 g",
        "Cholesterol > 140 mg",
        "Fat > 62.8 g",
        "Protein > 33.8 g",
        "Sodium > 1038 mg"
    ],
    "n": "Jane's Barbecued Short Ribs",
    "a": "Cookn Gma",
    "r": "0",
    "s": 4,
    "des": "\"A recipe I got from an dear friend many, many years ago, who got it from her mother. Very easy, and wonderful flavor. Good in the summer and even better in the winter on a cold night. Can also cook it in the slow cooker. Then when you come home from work, all you have to do is either grill or broil them to brown them before serving. Serve with mashed potatoes or potato salad or egg noodles.\"",
    "ins": "Place beef ribs in a large resealable plastic bag. Add onions, tomato sauce, water, vinegar, sugar, parsley, horseradish, mustard, salt, and black pepper. Squeeze excess air out of bag and seal. Marinate in refrigerator overnight or up to 24 hours, turning bag several times.\nTransfer beef and marinade to a large pot and bring to a boil. Reduce heat to medium-low, cover, and simmer until beef is tender and falling off the bones, about 2 hours. Remove beef from liquid with a slotted spoon.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nArrange beef on preheated grill and cook until browned on all sides, about 10 minutes.",
    "pt": "10 m",
    "ct": "2 h ",
    "tt": "10 h ",
    "i": "2555895.jpg",
    "o": "",
    "st": "allrecipes"
}