{
    "id": 230331,
    "old_rating": "4.55814",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 slice bacon",
        "1 tablespoon olive oil",
        "1/4 cup all-purpose flour",
        "1 1/2 pounds London broil-cut beef, cut into chunks",
        "2 cups low-sodium beef stock",
        "1 cup Burgundy wine",
        "4 carrots, cut into chunks",
        "1 pound potatoes, cut into chunks",
        "1/2 pound mushrooms, sliced",
        "2 garlic cloves, minced",
        "1 onion, cut into chunks",
        "1 teaspoon dried marjoram",
        "3/4 teaspoon ground thyme",
        "1/2 teaspoon seasoned salt",
        "1/8 teaspoon salt",
        "1 pinch ground black pepper, or to taste"
    ],
    "nut": [
        "Calories > 472 kcal",
        "Carbs > 43.3 g",
        "Cholesterol > 55 mg",
        "Fat > 15.1 g",
        "Protein > 29.9 g",
        "Sodium > 395 mg"
    ],
    "n": "Jennifer's Burgundy Beef Stew",
    "a": "Jennifer",
    "r": "0",
    "s": 4,
    "des": "\"This is a great comfort food for those cold winter days, and it's great tasting. This is my own recipe. I like to serve it in big pre-warmed soup bowls with salad and French bread.\"",
    "ins": "Cook bacon in a large skillet over medium-high heat until evenly browned, about 10 minutes. Remove bacon to a paper towel, retaining drippings in the skillet. Pour olive oil into reserved bacon drippings.\nPour flour into a large sealable plastic bag; add the beef, seal, and shake to coat meat with flour. Cook and stir beef in the bacon drippings mixture until browned on all sides, 7 to 10 minutes.\nCrumble the bacon and add to the skillet. Pour beef stock and Burgundy wine over the beef mixture; bring to a boil, reduce heat to medium-low, and simmer until the beef is tender, about 1 hour.\nStir carrots, potatoes, mushrooms, garlic, onion, marjoram, thyme, seasoned salt, salt, and black pepper into the beef mixture; continue cooking at a simmer until the vegetables are tender, 20 to 30 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "1060987.jpg",
    "o": "",
    "st": "allrecipes"
}