{
    "id": 230320,
    "old_rating": "4.24194",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 3/4 cups all-purpose flour",
        "1/4 cup white sugar",
        "1 tablespoon baking powder",
        "1/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "6 tablespoons cold, unsalted butter, cut into pieces",
        "1/2 cup pumpkin puree",
        "1/3 cup buttermilk",
        "1/3 cup toasted pine nuts",
        "2 tablespoons all-purpose flour, or more as needed",
        "1 egg",
        "1 teaspoon milk",
        "1 teaspoon white sugar"
    ],
    "nut": [
        "Calories > 174 kcal",
        "Carbs > 21.5 g",
        "Cholesterol > 31 mg",
        "Fat > 8.4 g",
        "Protein > 3.9 g",
        "Sodium > 236 mg"
    ],
    "n": "Chef John's Pumpkin Scones",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"Here's an example of how I would convince the public that pumpkin is great for any time of the year. Ironically, I did this because I had leftover pumpkin from Thanksgiving.\"",
    "ins": "Preheat the oven to 400 degrees. Line a baking sheet with parchment paper or a silicone baking mat.\nWhisk together 1 3/4 cup flour, 1/4 cup sugar, baking powder, baking soda, and salt in a large bowl until combined. Mix butter into flour mixture using a pastry cutter until the mixture resembles coarse crumbs.\nMake a well in the center of the flour-butter mixture. Stir in pumpkin puree, buttermilk, and pine nuts until just combined.\nSprinkle a work surface with 2 tablespoons flour. Turn out dough onto the floured work surface. Shape into a rectangle about 1 inch thick. Fold the rectangle in thirds, sprinkle with more flour as needed, and flatten to about 1 inch thick. Repeat 2 more times. Cut final rectangle into 6 equally-sized squares. Cut each square into triangles and transfer the scones to the prepared baking sheet.\nWhisk egg and milk together in a small bowl. Lightly brush the top of each scone with egg wash. Sprinkle 1 teaspoon sugar over scones.\nBake in the preheated oven until golden brown, 15 to 20 minutes. Transfer to a wire rack to cool completely.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "4259418.jpg",
    "o": "4259418.jpg,4166074.jpg,4038324.jpg,3546854.jpg,2707396.jpg,2594333.jpg",
    "st": "allrecipes"
}