{
    "id": 230396,
    "old_rating": "4.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups unbleached bread flour (such as King ArthurÂ®)",
        "1 cup dark rye flour",
        "3 tablespoons dry potato flakes",
        "2 tablespoons caraway seeds",
        "1 1/2 tablespoons demerara sugar",
        "2 1/2 teaspoons instant yeast",
        "1 1/2 teaspoons sea salt",
        "1 cup warm water",
        "1/4 cup canola oil",
        "1/4 cup sour pickle juice"
    ],
    "nut": [
        "Calories > 148 kcal",
        "Carbs > 23.1 g",
        "Cholesterol > 0 mg",
        "Fat > 4.7 g",
        "Protein > 4.1 g",
        "Sodium > 191 mg"
    ],
    "n": "Real NY Jewish Rye Bread",
    "a": "Dad's world famous",
    "r": "0",
    "s": 14,
    "des": "\"For thousands of years man has been enjoying bread. This rye bread recipe will add to this ancient enjoyment. Having lived in northwest Connecticut for over 35 years, in close proximity to NYC with its great Jewish delis, baking some of the finest rye bread going, I snagged this recipe from a friend. \n\nHope you like it. Enjoy and share with your family, friends, and neighbors.\"",
    "ins": "Place bread flour, rye flour, potato flakes, caraway seeds, demarara sugar, yeast, and sea salt in the bowl of a large stand mixer. Turn mixer to low and thoroughly mix dry ingredients. Beat warm water, canola oil, and pickle juice into dry ingredients. Fit dough hook onto mixer and beat until dough is rough and shaggy-looking.\nCover bowl with plastic wrap and let rest for exactly 30 minutes. Remove plastic wrap and knead dough in stand mixer with dough hook until smooth, firm, and only slightly sticky, 6 to 8 minutes. Turn dough onto a floured work surface and knead until smooth, 1 to 2 more minutes.\nForm dough into a ball, place dough into an oiled bowl, and turn dough around several times in bowl to coat with oil. Cover the bowl with plastic wrap, set into a warm place, and let rise until nearly double, about 1 hour.\nGrease a 5x9-inch loaf pan. Turn dough onto a lightly oiled surface, shape into a log, and place into prepared loaf pan. Cover with a cloth kitchen towel and let rise until top of dough has risen slightly over top of pan, 60 to 90 minutes.\nPlace rack in middle of oven and preheat oven to 350 degrees F (175 degrees C).\nBake loaf until golden brown and cooked through, about 35 minutes. The internal temperature of the bread should be 190 degrees F (90 degrees C). If loaf browns too quickly, cover loosely with a tent of aluminum foil with shiny side out. Remove from pan and cool on wire rack.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "3 h ",
    "i": "1108705.jpg",
    "o": "4508554.jpg,4480528.jpg,4460588.jpg,3839867.jpg,3703127.jpg,3645997.jpg",
    "st": "allrecipes"
}