{
    "id": 230441,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (1 pound) loaf frozen bread dough, thawed",
        "1/4 cup butter, softened",
        "1/2 cup brown sugar",
        "2 tablespoons ground cinnamon",
        "2 tablespoons all-purpose flour",
        "1 cup confectioners' sugar",
        "1 tablespoon milk",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 337 kcal",
        "Carbs > 59.4 g",
        "Cholesterol > 15 mg",
        "Fat > 8.1 g",
        "Protein > 6.1 g",
        "Sodium > 364 mg"
    ],
    "n": "Christmas Tea Ring",
    "a": "Baritone Bob",
    "r": "0",
    "s": 8,
    "des": "\"Our family makes a lot of these every Christmas, some to give away, some for Christmas breakfast.\"",
    "ins": "Roll bread dough into a rectangle 8 inches wide and 15 inches long. Spread butter over the bread, leaving about 1/2 inch of a long edge unbuttered. Mix brown sugar, cinnamon, and flour in a bowl and sprinkle the mixture over the buttered part of the dough.\nStarting with the long edge opposite the unbuttered edge, tightly roll the dough over the filling; seal the roll along the unbuttered edge to make a log.\nLightly grease a 12-inch round cake pan or baking dish; place dough into the pan and form a ring, pinching the two ends together to seal. Use kitchen scissors or sharp knife to make cuts 3/4 inch deep into the outside of the ring. Twist the cut sections of dough slightly to reveal filling.\nCover the tea ring with a cloth, place into a warm area, and let rise until doubled, 45 minutes to 1 hour.\nPreheat oven to 375 degrees F (190 degrees C).\nBake tea ring in the preheated oven until lightly browned, 25 to 30 minutes. Cover with a sheet of aluminum foil after 15 minutes if tea ring starts to brown too quickly. Let tea ring cool in pan for about 10 minutes before removing to finish cooling on a wire rack.\nCombine confectioners' sugar, milk, and vanilla extract in a bowl to make a smooth frosting. Spread top of the tea ring with frosting.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "954698.jpg",
    "o": "",
    "st": "allrecipes"
}