{
    "id": 230429,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (12 ounce) package thick-cut bacon",
        "1/2 cup real maple syrup",
        "3 quarts popped popcorn",
        "2 cups crispy rice cereal squares (such as Rice ChexÂ®)",
        "2 cups crispy wheat cereal squares (such as Wheat ChexÂ®)",
        "2 cups peanuts",
        "2 cups pretzel sticks",
        "1 cup butter",
        "2 cups brown sugar",
        "1/2 cup corn syrup",
        "1 teaspoon salt",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon baking soda"
    ],
    "nut": [
        "Calories > 1247 kcal",
        "Carbs > 135 g",
        "Cholesterol > 102 mg",
        "Fat > 72.7 g",
        "Protein > 23.5 g",
        "Sodium > 2039 mg"
    ],
    "n": "DB's Caramel Popcorn Bacon Mix",
    "a": "AirForceFun",
    "r": "0",
    "s": 6,
    "des": "\"If you love bacon, this is the caramel popcorn recipe you have been looking for! Be warned, once you start snacking, it's difficult to stop. Butter can be halved for a leaner dessert.\"",
    "ins": "Line a baking sheet with aluminum foil.\nArrange bacon slices close together and slightly overlapping onto the prepared baking sheet. Drizzle bacon slices evenly with maple syrup.\nPlace the baking sheet in the cold oven; set temperature to 400 degrees F (200 degrees C). Bake until bacon is crisp, about 20 minutes.\nTransfer bacon slices to a paper towel-lined plate to cool. Crumble cooled bacon.\nReduce oven temperature to 250 degrees F (120 degrees C). Line 2 baking sheets with aluminum foil.\nLightly mix popcorn, rice cereal, wheat cereal, peanuts, pretzels, and crumbled bacon together in a large bowl. Transfer to the prepared baking sheets.\nMelt butter in a saucepan over medium heat; mix brown sugar, corn syrup, and salt into the melted butter. Cook, stirring constantly, until mixture begins to boil. Boil mixture, without stirring, for 4 minutes.\nPlace popcorn mixture in the preheated oven to warm.\nRemove the butter mixture from heat and mix in vanilla extract and baking soda until caramel begins to foam. Drizzle caramel in a thin stream over popcorn mixture, tossing to evenly coat.\nBake caramel corn in the oven, stirring every 15 minutes, until caramel coating is set, 1 hour. Let caramel corn cool completely before breaking into pieces.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "2206231.jpg",
    "o": "",
    "st": "allrecipes"
}