{
    "id": 230408,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 egg whites at room temperature",
        "1/2 teaspoon cream of tartar",
        "1/4 teaspoon vanilla extract",
        "1/2 cup white sugar",
        "1 drop red food coloring, or desired amount",
        "3 tablespoons red colored sugar, or as desired"
    ],
    "nut": [
        "Calories > 29 kcal",
        "Carbs > 7 g",
        "Cholesterol > 0 mg",
        "Fat > 0 g",
        "Protein > 0.4 g",
        "Sodium > 6 mg"
    ],
    "n": "Santa Hats",
    "a": "Mom_Of_Two",
    "r": "0",
    "s": 20,
    "des": "\"Super festive, super easy, and super tasty! Does it get any better?? :) My kids love how the meringue melts in their mouths! If you leave the oven door open just a little it can help keep the meringue from browning.\"",
    "ins": "Preheat oven to 200 degrees F (95 degrees C). Line a baking sheet with parchment paper.\nBeat egg whites in a bowl until they form soft peaks; beat cream of tartar and vanilla extract into egg whites. Gradually beat white sugar into mixture until meringue forms stiff peaks. Transfer 1/4 of the meringue mixture into a separate bowl. Beat red food coloring into remaining 3/4 of meringue.\nTransfer colored meringue into a piping bag fitted with a round tip. Pipe 20 Santa hat shaped triangles, about 1 1/2 inch tall and bending over at the tips, onto the parchment paper-lined baking sheet. Sprinkle the hats with red sugar.\nTransfer remaining 1/4 uncolored meringue into a clean piping bag fitted with a round tip. Pipe little white pom-poms onto each hat tip and a small edging of fluffy white trim onto the bottom of each hat.\nBake meringue cookies in the preheated oven until hard but not browned, about 1 hour and 20 minutes. Turn off oven and let cookies cool inside oven until crisp, 1 hour.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "4249765.jpg",
    "o": "",
    "st": "allrecipes"
}