{
    "id": 230474,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (4 pound) whole chicken",
        "1 cup butter at room temperature",
        "1 whole head garlic, minced",
        "3 lemons, zested",
        "1 orange, zested",
        "2 tablespoons chopped chives",
        "1 tablespoon toasted sesame oil",
        "1 tablespoon chopped fresh thyme",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons ground black pepper",
        "1 teaspoon ground coriander"
    ],
    "nut": [
        "Calories > 691 kcal",
        "Carbs > 4.5 g",
        "Cholesterol > 211 mg",
        "Fat > 55.9 g",
        "Protein > 41.9 g",
        "Sodium > 926 mg"
    ],
    "n": "Roast Chicken by Kevin Sbraga",
    "a": "Margie Plouffe Traylor",
    "r": "0",
    "s": 6,
    "des": "\"The most amazing, moist, and flavorful chicken you've ever had. It is worth the work!\"",
    "ins": "Rinse chicken and allow to air-dry for 30 minutes.\nPreheat oven to 300 degrees F (150 degrees C).\nBeat butter, garlic, lemon zest, orange zest, chives, sesame oil, thyme, salt, black pepper, and coriander in a bowl until thoroughly combined. Loosen skin of chicken over breast and thighs with your fingers; generously coat entire chicken with butter mixture, including inside cavity. Insert butter mixture beneath loosened skin.\nPlace chicken on a rack set into a roasting pan with breast side down. Cover chicken with aluminum foil, sealing foil to roasting pan.\nRoast in the preheated oven for 1 hour. Uncover pan, turn chicken over so breast side faces up, and roast until an instant-read meat thermometer inserted into the thickest part of a thigh reads 165 degrees F (75 degrees C), about 20 more minutes.\nRaise oven temperature to 400 degrees F (205 degrees C). Continue to roast chicken until skin is golden brown, about 10 more minutes. Let chicken rest 10 minutes before carving.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "946770.jpg",
    "o": "",
    "st": "allrecipes"
}