{
    "id": 230521,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter, softened",
        "1/2 cup almond butter",
        "1/2 cup white sugar",
        "1/2 cup packed brown sugar",
        "3/4 teaspoon baking soda",
        "1/2 teaspoon cream of tartar",
        "1/4 teaspoon salt",
        "1 egg",
        "2 tablespoons milk",
        "1/2 teaspoon vanilla extract",
        "1 cup whole wheat flour",
        "1 cup all-purpose flour",
        "3 tablespoons white sugar",
        "2 tablespoons ground almonds",
        "48 milk chocolate candy kisses with almond, or as needed"
    ],
    "nut": [
        "Calories > 101 kcal",
        "Carbs > 12 g",
        "Cholesterol > 10 mg",
        "Fat > 5.3 g",
        "Protein > 1.8 g",
        "Sodium > 63 mg"
    ],
    "n": "Almond Butter Blossoms",
    "a": "AliBaby",
    "r": "0",
    "s": 48,
    "des": "\"This is a New Year's Eve tradition for my husband and I. It's an absolutely delicious new twist to the traditional peanut butter cookies, though they look almost exactly the same.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBeat butter and almond butter in a large mixing bowl with an electric mixer on medium-high speed until creamy, about 30 seconds. Beat in 1/2 cup sugar, brown sugar, baking soda, cream of tartar, and salt until thoroughly combined. Beat egg, milk, and vanilla extract into moist ingredients.\nBeat whole wheat flour and as much of the all-purpose flour as the mixer can handle; stir remaining flour into dough.\nCombine 3 tablespoons sugar with ground almonds in a shallow bowl. Pinch off dough and roll into 1-inch balls; roll balls in almond-sugar mixture. Place cookies 2 inches apart on ungreased baking sheets.\nBake in the preheated oven until edges are firm and tops are cracked, 8 to 10 minutes. Immediately press a chocolate almond kiss into middle of each cookie; let cool.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "4193678.jpg",
    "o": "",
    "st": "allrecipes"
}