{
    "id": 230589,
    "old_rating": "4.22222",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 slices bacon",
        "1 onion, chopped",
        "2 cloves garlic, finely chopped, or more to taste",
        "1 pound lean ground beef",
        "1/2 cup barbeque sauce",
        "1/2 cup soft bread crumbs",
        "2 eggs, beaten",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon Dijon mustard",
        "1 teaspoon dried oregano",
        "1/2 teaspoon chili powder (optional)",
        "3 tablespoons barbeque sauce"
    ],
    "nut": [
        "Calories > 434 kcal",
        "Carbs > 26.1 g",
        "Cholesterol > 174 mg",
        "Fat > 24.1 g",
        "Protein > 26.6 g",
        "Sodium > 946 mg"
    ],
    "n": "BBQ Bacon-Wrapped Meatloaf",
    "a": "comfortablefood.com",
    "r": "0",
    "s": 4,
    "des": "\"This meatloaf is very moist and flavorful, and super easy and quick to make.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x11-inch baking dish.\nPlace bacon in a large skillet and cook over medium-high heat until edges just start to curl, 1 to 2 minutes per side. Drain the bacon slices on paper towels. Reserve about 1 tablespoon bacon drippings in the skillet.\nCook and stir onion and garlic in the bacon drippings until onion is softened, 6 to 7 minutes. Remove from heat and cool.\nMix cooled onion and garlic, ground beef, 1/2 cup barbeque sauce, bread crumbs, eggs, Worcestershire sauce, Dijon mustard, oregano, and chili powder together with your hands in a large bowl. Form beef mixture into a log-shaped meatloaf; place in the prepared baking dish.\nWrap partially-cooked bacon slices around the meatloaf, tucking the ends of bacon underneath the loaf.\nBake in the preheated oven for 35 minutes. Brush bacon-wrapped meatloaf with 3 tablespoons barbeque sauce. Continue baking until no longer pink in the center, about 10 more minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Let stand for 10 minutes before serving.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "975215.jpg",
    "o": "4461731.jpg,4113231.jpg,4017263.jpg,3986495.jpg,3710220.jpg,3682944.jpg",
    "st": "allrecipes"
}