{
    "id": 230536,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 (32 ounce) packages sauerkraut, drained",
        "2 (15 ounce) cans turnip greens, drained",
        "2 onions, quartered",
        "salt and ground black pepper to taste",
        "1 (12 fluid ounce) can frozen apple juice concentrate, thawed",
        "1 (12 fluid ounce) can water",
        "1 1/2 cups brown sugar, or more to taste",
        "3 pounds kielbasa sausage, cut into 3-inch pieces"
    ],
    "nut": [
        "Calories > 866 kcal",
        "Carbs > 72.5 g",
        "Cholesterol > 122 mg",
        "Fat > 52.7 g",
        "Protein > 26.7 g",
        "Sodium > 4018 mg"
    ],
    "n": "Michelle's Sweetkraut",
    "a": "waryr1",
    "r": "0",
    "s": 8,
    "des": "\"A New Year's family tradition. We eat it on New Year's to help us remember to temper the bitter with the sweet in the coming year! It is also kid-friendly; haven't met a kid yet that don't like it! If your kid hates sauerkraut, try this. Quick and easy to make but does have a longer cooking time to reduce the liquids and bring out the sweetness. You can use it as a meal or a side dish and some family members, believe it or not, get a bowlful for a late night snack!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nEmpty sauerkraut and turnip greens into a colander and rinse lightly; drain. Spread sauerkraut, turnip greens, and onions in an even layer in a large baking dish and season with salt and black pepper.\nWhisk apple juice concentrate, water, and brown sugar in a bowl, dissolving the sugar. Pour juice mixture over vegetables. Arrange pieces of kielbasa sausage into dish atop vegetables.\nBake in the preheated oven until most of the liquid has evaporated and the kielbasa is browned, about 2 hours, stirring every 20 minutes.",
    "pt": "15 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "4478343.jpg",
    "o": "",
    "st": "allrecipes"
}