{
    "id": 230526,
    "old_rating": "3.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 (16 ounce) package elbow macaroni",
        "1 cup evaporated milk",
        "4 extra large eggs",
        "1 (16 ounce) container sour cream",
        "2 teaspoons seasoned salt",
        "2 teaspoons ground black pepper",
        "2 cups shredded Cheddar cheese",
        "2 cups shredded Cheddar-Monterey Jack cheese blend",
        "6 slices processed cheese food (such as VelveetaÂ®), torn into 4 pieces",
        "1/2 cup butter, melted"
    ],
    "nut": [
        "Calories > 427 kcal",
        "Carbs > 27.3 g",
        "Cholesterol > 130 mg",
        "Fat > 27.9 g",
        "Protein > 17.1 g",
        "Sodium > 551 mg"
    ],
    "n": "Best Mac 'N Cheese Ever!",
    "a": "CASS CLARK",
    "r": "0",
    "s": 15,
    "des": "\"This is the best mac 'n cheese ever! I started out by going through the recipes on this site and when I found one I wanted to try, I was putting together the first few ingredients and said, 'Ya know what would be great to add to this...' and that's where the 'Best Mac 'N Cheese Ever' was created. By the time I was done and it was served at our New Year's Day lunch everyone was raving about how delish it was. Try this easy recipe for a down-home Southern taste of the Best Baked Mac 'N Cheese Ever!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain; pour macaroni into the prepared dish.\nBeat eggs, sour cream, seasoned salt, and black pepper into a smooth mixture; stir Cheddar cheese and Cheddar-Monterey Jack cheese into mixture until thoroughly combined. Pour over macaroni and mix well. Top casserole with torn pieces of processed cheese. Drizzle melted butter over casserole, especially along the sides.\nBake in the preheated oven until casserole is bubbling and cheese has melted, about 30 minutes.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "4468865.jpg",
    "o": "3765698.jpg,2879521.jpg,2877819.jpg,2705430.jpg,2124698.jpg,1076881.jpg",
    "st": "allrecipes"
}