{
    "id": 230525,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "5 pounds dry black-eyed peas",
        "2 pounds smoked turkey wings",
        "14 cups turkey stock, or as needed to cover",
        "5 stalks celery, diced",
        "1 teaspoon red pepper flakes",
        "2 cups turkey stock",
        "6 onions, diced",
        "8 carrots, chopped",
        "2 teaspoons ground black pepper",
        "3 tablespoons salt",
        "1 1/2 tablespoons garlic powder (optional)",
        "1 pound smoked garlic kielbasa, diced"
    ],
    "nut": [
        "Calories > 354 kcal",
        "Carbs > 46.9 g",
        "Cholesterol > 29 mg",
        "Fat > 8.9 g",
        "Protein > 23.1 g",
        "Sodium > 1536 mg"
    ],
    "n": "Toddly Man's Big House Black-Eyed Peas",
    "a": "Todd Kimmell",
    "r": "0",
    "s": 30,
    "des": "\"Hearty. Earthy. Gnarly. Yummy. This is a big recipe and meant to be stirred with joy and shared with many. It is an excuse for you to finally find and patronize an awesome kielbasy maker, and something fun and wonderful to do with the mountains of turkey stock you froze after Thanksgiving. \n\nMake this in a really big pot you inherited from your really big family or borrowed from the Quaker Meeting House. Forget someone important to you at Christmas? No problem! Show up with a container of these black-eyed peas for New Year's, and bring a six-pack of dry hard cider!\"",
    "ins": "Fill a large pot with water and soak black-eyed peas overnight. Pour out soaking liquid, cover black-eyed peas with fresh water, and drain. Add turkey wings to black-eyed peas.\nSet pot over medium heat and pour 14 cups turkey stock into peas; bring to a boil. Stir celery and red pepper flakes into peas; reduce heat to low. Simmer for 30 minutes. Remove turkey wings and set aside; chop turkey meat when cool. Pour 2 cups more turkey stock into peas as needed and stir chopped turkey wing meat, onions, and carrots into mixture. Bring back to a simmer and stir black pepper, salt, and garlic powder (if using) into black-eyed peas. Simmer for 1 1/2 more hours.\nToss diced kielbasa into black-eyed peas, simmer until black-eyed peas and vegetables are tender, about 10 more minutes, and serve.",
    "pt": "30 m",
    "ct": "2 h ",
    "tt": "10 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}