{
    "id": 230601,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 tablespoon butter",
        "3/4 tablespoon olive oil",
        "3 cups crusty bread cubes",
        "2 teaspoons minced fresh garlic",
        "2 zucchini",
        "3/4 tablespoon butter",
        "3/4 tablespoon olive oil",
        "1 1/2 cups chopped plum (Roma) tomatoes",
        "1 teaspoon finely chopped fresh rosemary",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "2 cups shredded Cheddar cheese",
        "1 egg, beaten"
    ],
    "nut": [
        "Calories > 216 kcal",
        "Carbs > 10.4 g",
        "Cholesterol > 53 mg",
        "Fat > 15.4 g",
        "Protein > 9.7 g",
        "Sodium > 441 mg"
    ],
    "n": "Cheddar-Rosemary Zucchini Boats",
    "a": "Cathy",
    "r": "0",
    "s": 8,
    "des": "\"Zucchini boats filled with bread stuffing that are made savory with rosemary, Cheddar cheese, and tomato.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nMelt 3/4 tablespoon butter with 3/4 tablespoon olive oil in a skillet over medium heat. Cook bread cubes in the butter mixture, tossing gently to coat, until fragrant and toasted, 3 to 4 minutes. Add garlic to the bread; cook and stir together for 1 minute. Remove to a plate and set aside to cool.\nSlice zucchini lengthwise with stem and flower ends intact. Use a small spoon to hollow out squash, leaving a 1/4-inch shell. Place squash boats in a large baking dish. Coarsely chop zucchini innards.\nMelt 3/4 tablespoon butter with 3/4 tablespoon olive oil in a skillet over medium-high heat. Cook and stir zucchini innards, tomatoes, rosemary, salt, and pepper in the butter mixture until the vegetables soften, 3 to 4 minutes; transfer to a large bowl and mix with the bread cubes, Cheddar cheese, and beaten egg. Fill the hollowed zucchini halves with the vegetable mixture. Arrange stuffed zucchini boats into a baking dish.\nBake in preheated oven for 25 minutes. Remove and switch oven to broil. Cook under the broiler until golden brown and bubbling on top, 2 to 3 minutes.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "1037948.jpg",
    "o": "",
    "st": "allrecipes"
}