{
    "id": 230694,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups chicken broth",
        "2 cups orzo pasta",
        "1 1/2 pounds lean ground turkey",
        "4 cloves garlic, minced, or more to taste",
        "1/2 teaspoon red pepper flakes, or more to taste",
        "4 cups fresh spinach leaves",
        "4 cups frozen broccoli florets",
        "1 pint cherry tomatoes",
        "2/3 cup frozen peas",
        "2/3 cup frozen carrots",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 484 kcal",
        "Carbs > 62.9 g",
        "Cholesterol > 87 mg",
        "Fat > 10.5 g",
        "Protein > 37.3 g",
        "Sodium > 782 mg"
    ],
    "n": "Colorful Garlic Orzo",
    "a": "ThrenJen",
    "r": "0",
    "s": 6,
    "des": "\"This dish is fast, easy, colorful, healthy, and delicious! Don't skip the chicken broth; it adds essential flavor to the dish. I like mine extra garlicky and go for the full 6 cloves, but it's plenty flavorful with less. You can use just about any veggies or meat in this recipe and it will still be great. I use all frozen veggies so I only need to shop for tomatoes, and even those I could use canned if I feel lazy, making this a true from-the-pantry meal with no shopping required.\"",
    "ins": "Bring chicken broth to a boil. Cook orzo in the boiling broth, stirring occasionally, until cooked through but firm to the bite, about 8 to 10 minutes. Remove from heat; do not drain.\nHeat a large skillet over medium-high heat; cook and stir turkey in the hot skillet until crumbly and evenly browned, about 10 minutes. Stir garlic and red pepper flakes into turkey; cook for 1 minute. Reduce heat to medium. Add spinach, broccoli, tomatoes, peas, carrots, orzo, and broth to the turkey mixture and cook, stirring often, until spinach is wilted and tomatoes begin to split, 5 to 10 minutes. Season with salt and black pepper.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "952851.jpg",
    "o": "",
    "st": "allrecipes"
}