{
    "id": 230611,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup chopped walnuts (optional)",
        "18 frozen dinner rolls (such as RhodesÂ®)",
        "1 cup brown sugar",
        "1 (3.5 ounce) package cook and serve butterscotch pudding mix (such as Jell-OÂ®)",
        "1/2 cup raisins (optional)",
        "1/2 cup chopped walnuts (optional)",
        "1/2 cup white sugar",
        "1 teaspoon ground cinnamon",
        "1/2 cup butter, melted"
    ],
    "nut": [
        "Calories > 456 kcal",
        "Carbs > 71.7 g",
        "Cholesterol > 23 mg",
        "Fat > 16.4 g",
        "Protein > 8.3 g",
        "Sodium > 423 mg"
    ],
    "n": "Bubbling Bread Sticky Buns",
    "a": "Rita Spangler",
    "r": "0",
    "s": 12,
    "des": "\"This is a tasty morning treat I learned from my friends at Christmas brunch!\"",
    "ins": "Grease a 9-inch fluted tube pan (such as Bundt(R)).\nSprinkle 1/4 cup walnuts into the prepared pan. Arrange dinner rolls in the pan.\nMix brown sugar and pudding mix in a small bowl; sprinkle evenly over the rolls. Add raisins and 1/2 cup walnuts.\nMix white sugar and cinnamon in a small bowl; sprinkle evenly over raisin and walnut layer. Pour melted butter over the entire roll mixture. Cover pan loosely with plastic wrap and a towel; place on a baking sheet. Allow to rise at room temperature for 8 hours to overnight.\nPreheat oven to 350 degrees F (175 degrees C). Remove towel and plastic wrap from pan, keeping the fluted tube pan on the baking sheet in case ingredients overflow.\nBake in the preheated oven until rolls are cooked and browned, about 30 minutes. Place a sheet of aluminum foil over rolls midway through baking if they brown too quickly. Cool in the pan for 5 to 10 minutes before turning onto a plate.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "8 h ",
    "i": "4498171.jpg",
    "o": "",
    "st": "allrecipes"
}