{
    "id": 230655,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 teaspoon corn meal",
        "1 pre-baked pizza crust",
        "3 tablespoons butter",
        "1/2 onion, minced",
        "1 tablespoon minced garlic",
        "1 tablespoon dried basil",
        "1 tablespoon dried oregano",
        "1 tablespoon grated Parmesan cheese",
        "1/2 cup shredded mozzarella cheese",
        "1 (8 ounce) package imitation crabmeat, chopped",
        "1 tomato, chopped",
        "1 cup whole kernel corn",
        "1 1/2 cups shredded mozzarella cheese",
        "dried Italian seasoning, or to taste"
    ],
    "nut": [
        "Calories > 558 kcal",
        "Carbs > 54.8 g",
        "Cholesterol > 84 mg",
        "Fat > 23.5 g",
        "Protein > 35.2 g",
        "Sodium > 935 mg"
    ],
    "n": "Hearty Crab Pizza",
    "a": "Erin",
    "r": "0",
    "s": 4,
    "des": "\"A delicious pizza for crab lovers with a special sauce and healthy ingredients! Light butter and fat-free cheese substitute nicely.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease a pizza pan and sprinkle corn meal into pan.\nPoke several holes into pizza crust and place into the prepared pizza pan.\nBake in the preheated oven until crust is heated through, about 5 minutes. Remove crust and turn oven heat down to 400 degrees F (205 degrees C).\nMelt butter in a saucepan over medium-high heat; cook and stir onion and garlic in hot butter until onion is tender, about 5 minutes. Stir basil, oregano, and Parmesan cheese into onion and garlic. Spread onion mixture evenly over pizza crust; top with 1/2 cup shredded mozzarella cheese.\nHeat imitation crab in the saucepan over medium-high heat until warmed through, about 2 minutes. Sprinkle imitation crab over pizza, followed by tomato and corn kernels. Top pizza with remaining 1 1/2 cup mozzarella cheese. Season with Italian seasoning.\nBake in the hot oven until cheese is melted and crust is golden brown, 10 to 20 minutes.",
    "pt": "35 m",
    "ct": "25 m",
    "tt": "1 h",
    "i": "1004415.jpg",
    "o": "",
    "st": "allrecipes"
}