{
    "id": 230682,
    "old_rating": "4.11765",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1/4 cup diced onion",
        "1/4 cup diced carrot",
        "1/4 cup diced celery",
        "1/4 cup diced green bell pepper",
        "1 teaspoon minced garlic",
        "1 cup chopped cooked chicken",
        "1 tablespoon parsley flakes",
        "1/2 cup quinoa",
        "1 cup chicken broth",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 377 kcal",
        "Carbs > 33.3 g",
        "Cholesterol > 55 mg",
        "Fat > 14.9 g",
        "Protein > 26.5 g",
        "Sodium > 553 mg"
    ],
    "n": "Chicken Quinoa",
    "a": "KristinLilly",
    "r": "0",
    "s": 2,
    "des": "\"If chicken soup and pilaf had a kid, I think it would be chicken quinoa. Quinoa is a very healthy ancient grain from South America; it's very filling! I think it's delicious. I used leftover roasted chicken to make this come together faster, but any kind of lean cooked meat can be used in this recipe. To make a vegetarian version, omit the meat and use vegetable stock instead of chicken.\"",
    "ins": "Heat olive oil in a saucepan over medium heat. Cook and stir onion, carrot, celery, bell pepper, and garlic in hot oil until vegetables are tender, 5 to 7 minutes.\nStir chicken and parsley into the vegetable mixture; cook and stir for about 1 minute. Add quinoa to the chicken mixture. Reduce heat to medium-low. Cook and stir until quinoa is toasted, about 2 minutes.\nPour chicken broth over the quinoa mixture; bring to a boil. Reduce heat to medium low. Place a cover on the saucepan and cook mixture at a simmer until the quinoa is tender, about 15 minutes. Turn heat completely off and allow mixture to sit covered another 5 minutes; season with salt and pepper. Fluff with a fork to serve.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "4498192.jpg",
    "o": "",
    "st": "allrecipes"
}