{
    "id": 230747,
    "old_rating": "4.80612",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 large russet potatoes",
        "2 teaspoons vegetable oil",
        "3 tablespoons butter",
        "1 tablespoon minced green onion",
        "salt and freshly ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "1/2 cup shredded white Cheddar cheese",
        "1/2 cup heavy cream",
        "1 egg yolk",
        "1 tablespoon butter, melted",
        "1 teaspoon paprika"
    ],
    "nut": [
        "Calories > 581 kcal",
        "Carbs > 66.1 g",
        "Cholesterol > 137 mg",
        "Fat > 31 g",
        "Protein > 12.5 g",
        "Sodium > 205 mg"
    ],
    "n": "Chef John's Twice-Baked Potatoes",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"When entertaining guests on special occasions, don't forget that you're putting on a show with the food. And, when it comes to starchy side dishes, these potatoes are a great way to express flair for the dramatic.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nRub potatoes with vegetable oil and place on the prepared baking sheet.\nBake in the preheated oven until a paring knife easily inserts into the center of a potato, about 1 hour. Set aside to cool until easy to handle, about 10 minutes.\nCut 1/3 off each potato lengthwise. Scoop flesh from each potato to within about 1/8-inch of the skins. Transfer flesh to a bowl.\nCombine potato flesh with butter and green onion; stir until butter is melted evenly into potato. Add salt, black pepper, cayenne pepper, and cheese; stir until cheese is melted. Pour cream and egg yolk into potato mixture; mix to combine. Season with salt to taste.\nPlace small piece of potato skin inside the bottom of each larger potato shell. Fill each potato with an equal amount of cheese mixture. Gently press the surface of the filling with a fork to create texture. Brush tops with melted butter and sprinkle with paprika.\nBake stuffed potatoes until golden brown on top, 20 to 30 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "4499034.jpg",
    "o": "4499034.jpg,4459044.jpg,4458502.jpg,4378773.jpg,4267777.jpg,4081809.jpg",
    "st": "allrecipes"
}