{
    "id": 230738,
    "old_rating": "4.79104",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 onion, chopped",
        "3 cloves garlic, chopped",
        "1/4 cup olive oil",
        "1/4 cup balsamic vinegar",
        "1/4 cup soy sauce",
        "1 tablespoon Dijon mustard",
        "1 tablespoon rosemary",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 1/2 pounds flank steak"
    ],
    "nut": [
        "Calories > 307 kcal",
        "Carbs > 8 g",
        "Cholesterol > 38 mg",
        "Fat > 20.5 g",
        "Protein > 22 g",
        "Sodium > 1622 mg"
    ],
    "n": "Grilled Balsamic and Soy Marinated Flank Steak",
    "a": "DENMOZZ",
    "r": "0",
    "s": 4,
    "des": "\"Flank steak is a perfect grilling meat. It's marbleized with fat that melts while grilling and fills the meat with the flavor of natural juices. If you have a lot of marinade leftover from this recipe, save it in your refrigerator and use it to marinate other grilled meats or chicken; it will last up to one week.\"",
    "ins": "Whisk onion, garlic, olive oil, balsamic vinegar, soy sauce, Dijon mustard, rosemary, salt, and pepper together in a mixing bowl.\nPut the flank steak in a large resealable plastic bag. Pour marinade into the bag and coat steak with the marinade. Squeeze excess air from the bag and seal. Marinate in the refrigerator at least 30 minutes, up to 2 days.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nRemove the flank steak from the marinade and shake to remove excess liquid. Reserve marinade.\nCook steak until firm, hot in the center, and just turning from pink to grey, 6 to 8 minutes per side, brushing occasionally with reserved marinade. An instant-read thermometer inserted into the center should read 150 degrees F (65 degrees C). Remove steak to a cutting board and rest meat 5 minutes before slicing thinly across the grain.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "55 m",
    "i": "971078.jpg",
    "o": "",
    "st": "allrecipes"
}