{
    "id": 230789,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup all-purpose flour",
        "1/3 cup unsweetened cocoa powder",
        "1/4 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1 cup white sugar",
        "1/2 cup butter, melted",
        "1 teaspoon vanilla extract",
        "2 large eggs",
        "1 cup peanut butter",
        "1 cup semisweet chocolate chips",
        "2 cups crispy rice cereal (such as Rice KrispiesÂ®)",
        "2 cups miniature marshmallows"
    ],
    "nut": [
        "Calories > 276 kcal",
        "Carbs > 30.8 g",
        "Cholesterol > 34 mg",
        "Fat > 15.9 g",
        "Protein > 5.9 g",
        "Sodium > 180 mg"
    ],
    "n": "Rocky Road Peanut Butter Brownies",
    "a": "Schmidty",
    "r": "0",
    "s": 18,
    "des": "\"These brownies will be a favorite with anyone who loves chocolate and marshmallows. Sure to be a hit at any social gathering.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.\nSift flour, cocoa powder, baking powder, and salt together in a large bowl. Beat sugar, butter, and vanilla extract together in a separate bowl; beat in eggs, one at a time, until sugar mixture is smooth. Stir flour mixture into sugar mixture until incorporated. Spread batter into the prepared baking pan.\nBake in the preheated oven until a toothpick inserted in the center of the brownies comes out clean, about 20 minutes.\nMix peanut butter and chocolate chips together in a microwave-safe bowl; heat in microwave until chocolate chips are melted, stirring every 30 seconds, 1 to 2 minutes. Fold crispy rice cereal into peanut butter mixture; heat in microwave until mixture smooth and spreadable, about 30 seconds.\nSprinkle brownies with marshmallows and bake until marshmallows are slightly cooked, 2 minutes. Pour chocolate mixture evenly over marshmallows. Allow to cool completely before cutting into squares.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "1084490.jpg",
    "o": "",
    "st": "allrecipes"
}