{
    "id": 230735,
    "old_rating": "4.60294",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 pound skinless, boneless chicken breast halves, cubed",
        "1 pinch monosodium glutamate (such as Ac'centÂ®), or to taste",
        "6 tablespoons soy sauce",
        "6 tablespoons brown sugar",
        "1/2 teaspoon red pepper flakes, or more to taste",
        "1 lime, juiced and zested",
        "2 cups vegetable broth",
        "1 cup couscous",
        "1/3 cup chopped cilantro",
        "4 wedges lime for garnish"
    ],
    "nut": [
        "Calories > 380 kcal",
        "Carbs > 52 g",
        "Cholesterol > 59 mg",
        "Fat > 6.2 g",
        "Protein > 28.4 g",
        "Sodium > 1675 mg"
    ],
    "n": "Sweet Chili Lime Chicken with Cilantro Couscous",
    "a": "Grumpy's Honeybunch",
    "r": "0",
    "s": 4,
    "des": "\"A very flavorful Asian-type meal with a sweet heat that incorporates my favorite flavors (chili, lime, and cilantro) with a little bit of sugar. The sauce glazes the chicken and is wonderful over the cilantro couscous. You can substitute salt and pepper to taste for MSG.\"",
    "ins": "Heat olive oil in a large skillet over medium heat; cook and stir chicken breast cubes in the hot oil until the juices run clear and chicken is no longer pink inside, 5 to 6 minutes. Sprinkle chicken with monosodium glutamate as it cooks. Remove chicken from skillet.\nMix soy sauce, brown sugar, red pepper flakes, lime juice, and lime zest in a bowl, stirring to dissolve sugar. Pour sauce into hot skillet, bring to a boil, and reduce heat to low. Simmer, stirring occasionally, until sauce begins to reduce slightly, 3 to 4 minutes. Mix cooked chicken into sauce and cook until sauce forms a glaze on chicken pieces, about 2 to 3 more minutes, stirring often.\nBring vegetable broth to a boil in a saucepan. Stir couscous into vegetable broth, turn off the heat, and let couscous stand until broth is absorbed, about 5 minutes. Stir cilantro into couscous.\nArrange couscous onto a serving platter, top with chicken and sauce, and serve with lime wedges. Squeeze lime wedges over couscous and chicken before serving.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "4504738.jpg",
    "o": "4504738.jpg,3170908.jpg,3168761.jpg,3160326.jpg,1996519.jpg,1096329.jpg",
    "st": "allrecipes"
}