{
    "id": 230740,
    "old_rating": "4.58333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Lemon Aioli Sauce:",
        "1/2 cup mayonnaise",
        "1 lemon, juiced",
        "1 tablespoon lemon zest",
        "2 cloves garlic, minced",
        "Roasted Asparagus:",
        "1 bunch asparagus, bottom 1 inch trimmed",
        "cooking spray",
        "sea salt to taste",
        "Pancetta-Wrapped Haddock:",
        "4 6-ounce haddock fillets",
        "1 tablespoon extra-virgin olive oil",
        "1/2 teaspoon cracked black pepper",
        "1/2 teaspoon crushed dried rosemary",
        "12 thin slices pancetta bacon, or as needed - divided",
        "2/3 cup white wine",
        "1 tablespoon warm water, or as needed"
    ],
    "nut": [
        "Calories > 484 kcal",
        "Carbs > 7.6 g",
        "Cholesterol > 94 mg",
        "Fat > 33.7 g",
        "Protein > 30.9 g",
        "Sodium > 720 mg"
    ],
    "n": "Pancetta-Wrapped Haddock with Lemon Aioli and Roasted Asparagus",
    "a": "Karen Barris Calabro",
    "r": "0",
    "s": 4,
    "des": "\"An easy and simple dish that is dressy enough for company or the holidays. It never fails to please guests but keeps your deli person busy with the waxed paper! The hardest part of this dish really is just wrapping the fish, which does not require any culinary skill whatsoever. Cod, sole, or similar white fish work equally well. Use dry sherry in place of white wine if desired.\"",
    "ins": "Combine mayonnaise, lemon juice, lemon zest, and garlic in a bowl; refrigerate for 15 to 30 minutes to blend flavors.\nMove an oven rack into the middle of oven and place another rack into top third; preheat oven to 400 degrees F (200 degrees C).\nLay asparagus spears in a row onto a baking sheet and spray with cooking spray; sprinkle with sea salt.\nDrizzle haddock fillets with olive oil and sprinkle with black pepper and rosemary. Wrap each fillet loosely with 3 slices pancetta bacon, wrapping bacon so that ends meet over skinned side of fillets. Place fillets into a 9x13-inch baking dish with bacon ends on the bottom. Pour white wine around the fillets.\nPlace fish onto lower rack of preheated oven and bake for 7 minutes. Place asparagus onto upper rack of oven. Continue baking until pancetta is browned, fish is opaque and flakes easily, and asparagus are lightly browned on the tips, 7 to 8 more minutes.\nStir warm water into lemon aioli sauce until sauce is pourable; pour about 2 tablespoons sauce onto each of 4 serving dishes. Arrange haddock fillets onto sauce and spread 1/4 of the roasted asparagus in a fan shape next to each fillet.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "1 h",
    "i": "1024440.jpg",
    "o": "",
    "st": "allrecipes"
}