{
    "id": 230821,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups water",
        "1/4 cup kosher salt",
        "1/4 cup white sugar",
        "6 skinless, boneless chicken breast halves",
        "1 cup grated Parmesan cheese",
        "1/2 cup dry Italian-seasoned bread crumbs",
        "1 tablespoon dried parsley flakes",
        "1 teaspoon salt",
        "3/4 teaspoon ground black pepper",
        "1/4 cup extra-virgin olive oil",
        "14 cloves garlic, finely chopped",
        "1/2 cup margarine, melted",
        "3 tablespoons lemon juice",
        "1/2 cup shredded Italian cheese blend, or to taste"
    ],
    "nut": [
        "Calories > 520 kcal",
        "Carbs > 19.1 g",
        "Cholesterol > 86 mg",
        "Fat > 34 g",
        "Protein > 33.8 g",
        "Sodium > 4775 mg"
    ],
    "n": "Garlic Lover's Chicken",
    "a": "Candy Kay",
    "r": "0",
    "s": 6,
    "des": "\"A very flavorful and moist chicken. Great if you like garlic.\"",
    "ins": "Stir water, kosher salt, and sugar together until the salt and sugar dissolve completely into a brine.\nPut chicken breasts in a large resealable plastic bag; pour brine into the bag with the chicken. Squeeze air from the bag and seal. Refrigerate for 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 13x9x2-inch baking dish.\nMix Parmesan cheese, bread crumbs, parsley, salt, and black pepper together in a bowl; spread about 1/3 of the mixture into the bottom of the prepared baking dish.\nRemove chicken from the brine, shake off excess liquid, and pat dry. Discard remaining brine.\nCoat chicken with olive oil. Arrange chicken atop the Parmesan cheese layer in the baking dish. Sprinkle remaining Parmesan cheese mixture over the chicken.\nMix garlic, margarine, and lemon juice together in a small bowl; drizzle over chicken.\nCook chicken breasts until no longer pink in the center and the juices run clear, 25-30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nSwitch oven to broil. Sprinkle cheese over the chicken breasts.\nHeat oven's broiler. Cook chicken under the broiler until the cheese is melted and golden brown, about 5 minutes more.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "969741.jpg",
    "o": "",
    "st": "allrecipes"
}