{
    "id": 230871,
    "old_rating": "4.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 large beets",
        "extra-virgin olive oil",
        "balsamic vinegar",
        "salt and ground black pepper to taste",
        "1 avocado - peeled, pitted, and cut into bite-size pieces",
        "2 tablespoons extra-virgin olive oil",
        "1 (10 ounce) package mixed salad greens",
        "1/4 cup shelled pistachio nuts",
        "1/4 cup dried cherries",
        "1/4 cup shredded Parmesan cheese",
        "1 tablespoon extra-virgin olive oil",
        "1 tablespoon balsamic vinegar"
    ],
    "nut": [
        "Calories > 393 kcal",
        "Carbs > 34.1 g",
        "Cholesterol > 4 mg",
        "Fat > 26.3 g",
        "Protein > 9.2 g",
        "Sodium > 287 mg"
    ],
    "n": "Roasted Beet, Avocado and Pistachio Salad",
    "a": "LisaMB",
    "r": "0",
    "s": 4,
    "des": "\"This salad is the perfect and healthy combination of tangy beets and creamy avocado. Add in the sweet cherries and crunchy pistachios and you will have the perfect salad for an elegant dinner party or a family supper.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nCut stems off beets and place whole on a baking sheet. Roast until fork tender, about 45 minutes. Allow to cool; peel and dice beets into large bite-sized pieces. Toss with 1 tablespoon olive oil and 1 tablespoon balsamic vinegar in a bowl; season with salt and black pepper.\nToss diced avocado with 2 tablespoons olive oil in a separate bowl; season with salt.\nTo serve, divide salad greens between serving plates. Top each serving with 1/4 of the beets and avocado. Sprinkle each serving with shelled pistachios, dried cherries, and shredded Parmesan cheese. Drizzle with remaining 1 tablespoon olive oil and 1 tablespoon balsamic vinegar. Season with salt and ground black pepper to taste.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "968164.jpg",
    "o": "",
    "st": "allrecipes"
}