{
    "id": 230886,
    "old_rating": "4.55556",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "8 eggs, beaten",
        "7 cups water",
        "1 cup canola oil",
        "1 cup unsweetened applesauce",
        "4 teaspoons vanilla extract",
        "4 cups whole wheat pastry flour",
        "2 cups dry milk powder",
        "2 cups flax seed meal",
        "1 cup wheat germ",
        "1 cup all-purpose flour",
        "1/4 cup baking powder",
        "4 teaspoons baking powder",
        "1/4 cup white sugar",
        "1 tablespoon ground cinnamon",
        "1 teaspoon salt"
    ],
    "nut": [
        "Calories > 313 kcal",
        "Carbs > 33.4 g",
        "Cholesterol > 64 mg",
        "Fat > 15.9 g",
        "Protein > 11.8 g",
        "Sodium > 506 mg"
    ],
    "n": "Wednesday Waffles",
    "a": "Lori Rucker",
    "r": "0",
    "s": 24,
    "des": "\"We love to serve these on Waffle Wednesdays for dinner or for large group gatherings. These are high in fiber and flavor with whole wheat flour, flax seed meal, and wheat germ, and are quite delicious and filling. Serve with homemade blueberry syrup, butter syrup, yogurt, peanut butter and honey, or fresh strawberries and whipped cream. Make a huge batch with a mixer and freeze the uneaten waffles for easy weeknight meals or quick and hearty breakfast warmed and crisped in the toaster.\"",
    "ins": "Spray a waffle iron with cooking spray and preheat according to manufacturer's instructions.\nBeat eggs, water, canola oil, applesauce, and vanilla extract in a large bowl thoroughly combined. Whisk whole wheat pastry flour, dry milk powder, flax seed meal, wheat germ, all-purpose flour, 1/4 cup plus 4 teaspoons baking powder, sugar, cinnamon, and salt in a separate large bowl until thoroughly combined. Mix dry ingredients into wet ingredients 1 cup at a time to make a smooth batter.\nLadle 1/2 cup batter, or amount recommended by manufacturer, into preheated waffle iron; close lid and cook waffle until crisp and browned, 3 to 5 minutes. Repeat with remaining batter.",
    "pt": "10 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "1008429.jpg",
    "o": "",
    "st": "allrecipes"
}