{
    "id": 230891,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound beef sirloin, cut into 1 1/2- inch cubes",
        "1 tablespoon canola oil",
        "3 tablespoons garlic and herb seasoning blend (such as Mrs. DashÂ®)",
        "2 tablespoons all-purpose flour",
        "1 (8 ounce) package frozen mixed vegetables",
        "1 (14.5 ounce) can no-salt-added diced tomatoes",
        "4 small potatoes, diced",
        "1 (16 ounce) package pearl onions"
    ],
    "nut": [
        "Calories > 438 kcal",
        "Carbs > 60.2 g",
        "Cholesterol > 49 mg",
        "Fat > 10.6 g",
        "Protein > 27.5 g",
        "Sodium > 108 mg"
    ],
    "n": "Country Beef Stew",
    "a": "beloiter",
    "r": "0",
    "s": 4,
    "des": "\"The most comforting of comfort foods, beef sirloin cubes are baked to perfection in a Dutch oven with vegetables and diced tomatoes. I thought this recipe was tasty, relatively healthy, and a definite comfort food during a blizzard. Keep an eye on your fluid levels; I thought they were too low. My next attempt will likely have more water or a broth if I can find one without sodium.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Place a Dutch oven or heavy oven-safe pan into oven as it preheats.\nToss beef cubes with canola oil in a bowl to coat. Stir garlic and herb seasoning with flour in a shallow bowl; dredge beef in seasoned flour to coat. Place beef into the hot Dutch oven and bake for 30 minutes, turning beef cubes over twice. Stir mixed vegetables, diced tomatoes, potatoes, and pearl onions into beef; cover with lid and return to oven.\nPlace beef into the hot Dutch oven and bake for 30 minutes, turning beef cubes over twice. Stir mixed vegetables, diced tomatoes, potatoes, and pearl onions into beef; cover with lid and return to oven.\nReduce oven heat to 325 degrees F (165 degrees C).\nBake stew in the oven until meat is tender, about 2 1/2 hours.",
    "pt": "15 m",
    "ct": "3 h",
    "tt": "3 h ",
    "i": "4459159.jpg",
    "o": "",
    "st": "allrecipes"
}