{
    "id": 230989,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup dried cranberries",
        "1/4 cup fresh tangerine juice",
        "2 cups unbleached all-purpose flour",
        "2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "1/2 cup unsalted butter, softened",
        "2 tablespoons tangerine zest",
        "1 cup white sugar",
        "2 large eggs",
        "1/2 cup milk",
        "1 teaspoon white sugar, divided (optional)"
    ],
    "nut": [
        "Calories > 260 kcal",
        "Carbs > 42.7 g",
        "Cholesterol > 52 mg",
        "Fat > 8.9 g",
        "Protein > 3.7 g",
        "Sodium > 147 mg"
    ],
    "n": "Cute Cranberry Tangerine Muffins",
    "a": "Stevie Bowden",
    "r": "0",
    "s": 12,
    "des": "\"When my dad brought home a bag of cute little tangerines, I needed a way to use them up quickly, so I composed this yummy, crumbly muffin recipe filled with loads of tangerine sweetness and just enough cranberry tartness!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease 12 muffin cups or line with paper liners.\nSimmer dried cranberries and tangerine juice in a small saucepan over medium heat; remove pan from heat and set aside to cool.\nWhisk flour, baking powder, and salt into a bowl. Mix butter, tangerine zest, and 1 cup sugar in a separate large bowl, using an electric mixer, until mixture is light and fluffy, about 2 minutes. Scrape down sides of bowl and beat eggs into butter mixture, one at a time, until thoroughly combined.\nGently fold flour mixture into the butter mixture, alternating with milk in two additions, until batter is just mixed. Fold cranberries and juice into batter. Pour batter into prepared muffin cups and top with 1 teaspoon sugar.\nBake in the preheated oven until muffins are golden brown, 20 to 25 minutes. Cool in pan on a rack.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "1 h",
    "i": "1821713.jpg",
    "o": "",
    "st": "allrecipes"
}