{
    "id": 230965,
    "old_rating": "4.76786",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds beef stew meat, cut into cubes",
        "1/2 cup all-purpose flour, or more as needed",
        "1/4 cup butter",
        "1/4 cup olive oil",
        "1 teaspoon seasoned salt",
        "1 onion, chopped",
        "8 cups beef broth, divided",
        "6 cups sliced carrots",
        "6 cups diced potatoes",
        "3 cups chopped celery",
        "2 tablespoons balsamic vinegar",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon dried parsley",
        "1 teaspoon dried basil",
        "1/2 teaspoon paprika",
        "1/2 teaspoon garlic powder"
    ],
    "nut": [
        "Calories > 455 kcal",
        "Carbs > 40.6 g",
        "Cholesterol > 75 mg",
        "Fat > 20.1 g",
        "Protein > 28.4 g",
        "Sodium > 1120 mg"
    ],
    "n": "Slow Simmer Beef Stew",
    "a": "KESSIANNE",
    "r": "0",
    "s": 8,
    "des": "\"This is the best beef stew I've ever tasted. My husband ate 4 bowls the first time I made it and my 9-month-old ate two bowls mashed up! I like to brown my beef for stew, and I hate to dirty both a pot and the slow cooker, so I prefer to cook the stew exclusively on the stove.\"",
    "ins": "Combine beef stew meat and flour in a resealable plastic bag; seal bag and shake to coat beef.\nMelt butter with olive oil in a large pot over high heat; add beef and season with seasoned salt. Cook and stir beef until seared on all sides 5 to 7 minutes. Stir onion into the beef; cook and stir until the onion is browned, about 5 minutes more.\nPour enough of the beef broth into the pot to cover the bottom; bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add remainder of the beef broth; bring to a simmer before adding carrots, potatoes, celery, balsamic vinegar, Worcestershire sauce, parsley, basil, paprika, and garlic powder.\nBring liquid to a boil, reduce heat to low, and cook stew at a simmer until the meat and vegetables are very tender, 3 to 4 hours.",
    "pt": "30 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "4521766.jpg",
    "o": "",
    "st": "allrecipes"
}