{
    "id": 231058,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup almond meal",
        "1/2 cup all-purpose flour",
        "1/2 cup whole wheat flour",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon salt",
        "3/4 cup white sugar",
        "1/2 cup butter, room temperature",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "1/2 cup milk",
        "1/2 cup plain yogurt",
        "1/2 ripe banana, mashed",
        "1 cup fresh raspberries, cut into small pieces",
        "1 cup dark chocolate chips"
    ],
    "nut": [
        "Calories > 291 kcal",
        "Carbs > 36.1 g",
        "Cholesterol > 53 mg",
        "Fat > 14.5 g",
        "Protein > 7.1 g",
        "Sodium > 274 mg"
    ],
    "n": "Nutty Raspberry Chocolate Muffins",
    "a": "naturalbornhealer",
    "r": "0",
    "s": 12,
    "des": "\"These muffins came about when I was trying to create a somewhat healthy muffin for my son to eat that used up ingredients I had. I've made them twice so far, and every time they are gone within 30 minutes and got rave reviews.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease 12 muffin cups or fill with paper liners.\nMix almond meal, all-purpose flour, whole wheat flour, baking powder, baking soda, cinnamon, and salt together in a bowl.\nBeat butter and sugar together in a separate bowl until light and fluffy. Add eggs, one by one, beating until each is incorporated. Stir vanilla into the butter mixture.\nMix milk and yogurt together in a separate bowl. Add butter mixture, alternating with milk mixture, to the flour mixture until just incorporated. Stir mashed banana into batter; fold in raspberries and chocolate chips. Fill muffin cups 3/4-full with batter.\nBake on the middle rack in the preheated oven until a toothpick inserted in the middle of the muffins comes out clean, 18 to 25 minutes.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "1121576.jpg",
    "o": "",
    "st": "allrecipes"
}