{
    "id": 231082,
    "old_rating": "4.82759",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "2 pounds ground beef",
        "2 stalks celery, chopped",
        "1 onion, chopped",
        "1 green bell pepper, chopped",
        "3 (14 ounce) cans stewed tomatoes",
        "1 (10 ounce) can diced tomatoes with green chiles (such as RO*TEL)",
        "1 (14 ounce) can tomato sauce",
        "1 cup water",
        "2 (1.25 ounce) packages chili seasoning (such as McCormickÂ® Mild Chili Seasoning Mix)",
        "1 (14 ounce) can kidney beans, undrained",
        "1 (14 ounce) can pinto beans, undrained",
        "salt and ground black pepper to taste",
        "1 tablespoon white vinegar, or more to taste"
    ],
    "nut": [
        "Calories > 326 kcal",
        "Carbs > 28.8 g",
        "Cholesterol > 55 mg",
        "Fat > 14.8 g",
        "Protein > 22.6 g",
        "Sodium > 1521 mg"
    ],
    "n": "Just Like Wendy'sÂ® Chili",
    "a": "tjy99",
    "r": "0",
    "s": 10,
    "des": "\"After trying several clone recipes and adjusting them to my tastes, I've concocted what I think is the best clone. Serve topped with finely diced white onions and/or shredded cheese. Enjoy!\"",
    "ins": "Heat olive oil in a large pot over medium-high heat. Press ground beef into the hot oil to form one large patty; let the bottom brown, 8 to 10 minutes. Stir and break the ground beef into crumbles and cook until no longer pink, about 5 more minutes.\nStir celery, onion, and green bell pepper into ground beef and cook until onion is translucent, about 5 minutes; pour in stewed tomatoes, diced tomatoes with green chiles, tomato sauce, and water. Break apart large chunks of stewed tomatoes. Stir in chili seasoning.\nMix kidney beans and pinto beans into chili, season with salt and black pepper, and bring to a boil. Reduce heat to low and simmer for 1 hour. Mix vinegar into chili.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4539491.jpg",
    "o": "4539491.jpg,4499006.jpg,4498493.jpg,4467769.jpg,4463756.jpg,4461778.jpg",
    "st": "allrecipes"
}