{
    "id": 231004,
    "old_rating": "4.07895",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 skinless, boneless chicken breast halves, cut into strips",
        "3 tablespoons cornstarch",
        "2 tablespoons soy sauce",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon garlic powder, or to taste",
        "1/2 pound spaghetti",
        "3 tablespoons vegetable oil",
        "1 small onion, chopped",
        "3 stalks celery, chopped",
        "2 carrots, thinly sliced",
        "1 cup broccoli florets",
        "1 tablespoon vegetable oil (optional)"
    ],
    "nut": [
        "Calories > 326 kcal",
        "Carbs > 37.1 g",
        "Cholesterol > 34 mg",
        "Fat > 11.2 g",
        "Protein > 18.5 g",
        "Sodium > 368 mg"
    ],
    "n": "Chicken Lo Mein with Broccoli",
    "a": "mandasannie",
    "r": "0",
    "s": 6,
    "des": "\"We started out making a chicken stir-fry and ended up with our very own delicious version of chicken lo mein! If you like Mongolian grill restaurants, then try this!\"",
    "ins": "Combine chicken strips, cornstarch, soy sauce, ginger, and garlic powder in a large resealable plastic bag. Coat chicken with marinade, squeeze out excess air, and seal bag. Refrigerate for 1 to 1 1/2 hours.\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain.\nHeat 3 tablespoons vegetable oil in a large skillet over medium heat. Remove chicken from marinade and shake off excess; cook and stir in hot oil until chicken is no longer pink in the center, about 5 minutes. Stir in onion, celery, carrots, and broccoli. Add 1 tablespoon vegetable oil, if needed. Cover and cook until vegetables are tender, stirring occasionally, about 5 minutes.\nStir spaghetti into chicken and vegetable mixture; cover and simmer for 5 minutes more.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "3588623.jpg",
    "o": "4534032.jpg,4524230.jpg,4519358.jpg,4483580.jpg,2247559.jpg,1112781.jpg",
    "st": "allrecipes"
}