{
    "id": 231028,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Dough:",
        "4 cups all-purpose flour",
        "1 teaspoon salt",
        "1 (.25 ounce) package active dry yeast",
        "2 tablespoons olive oil",
        "1 cup lukewarm water",
        "Filling:",
        "1/4 cup butter",
        "2 1/4 pounds onions, cut into thin rings",
        "1 teaspoon salt",
        "2 cups sour cream",
        "1 cup milk",
        "4 eggs",
        "ground black pepper to taste",
        "1 pinch caraway seeds, or to taste"
    ],
    "nut": [
        "Calories > 358 kcal",
        "Carbs > 42.8 g",
        "Cholesterol > 91 mg",
        "Fat > 16.7 g",
        "Protein > 9.5 g",
        "Sodium > 471 mg"
    ],
    "n": "Anton's Zwiebelkuchen (Anton's Onion Pie)",
    "a": "International Recipes",
    "r": "0",
    "s": 12,
    "des": "\"This is a traditional dish for the fall when there is new wine, but I eat onion pie all year round.\"",
    "ins": "Mix flour, 1 teaspoon salt, and yeast in a large bowl. Stir in olive oil and about 3/4 cup water until mixture comes together in a ball of dough. Turn dough out on a lightly floured surface. Gradually add remaining 1/4 cup water while kneading dough; continue kneading until smooth and elastic, about 10 minutes.\nPlace dough in a large lightly-oiled bowl and turn to coat. Cover with a towel and let rise in a warm place , about 30 minutes.\nMelt butter in a large skillet over medium heat. Cook and stir onions and 1 teaspoon salt until tender and translucent, about 30 minutes; stir often so onions do not brown. Remove from heat and allow to cool.\nPreheat oven to 375 degrees F (190 degrees C). Grease a baking sheet.\nRoll dough out on a floured surface to create a thin crust; transfer dough to prepared baking sheet. Poke several holes in the dough with a fork and roll edges up slightly to create a rim.\nSpread cooled onions over crust. Whisk sour cream, milk, eggs, and ground black pepper in a bowl; pour over onions. Sprinkle with caraway seeds.\nBake in preheated oven until golden brown and eggs are set, 30 to 45 minutes. Serve warm.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "2 h",
    "i": "970332.jpg",
    "o": "",
    "st": "allrecipes"
}