{
    "id": 23109,
    "old_rating": "4.25455",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 1/2 cups all-purpose flour",
        "5 teaspoons baking powder",
        "1 teaspoon salt",
        "3/4 cup shortening",
        "2 1/4 cups white sugar",
        "4 eggs, room temperature",
        "1 1/2 cups milk",
        "2 teaspoons vanilla extract",
        "2 teaspoons grated lemon zest",
        "2 teaspoons grated orange zest",
        "2 teaspoons grated lime zest",
        "2 drops yellow food coloring",
        "2 drops orange food coloring",
        "2 drops green food coloring",
        "1 recipe Lemon Custard Filling",
        "1 recipe Orange Cream Frosting"
    ],
    "nut": [
        "Calories > 434 kcal",
        "Carbs > 67.5 g",
        "Cholesterol > 64 mg",
        "Fat > 15.4 g",
        "Protein > 6.9 g",
        "Sodium > 380 mg"
    ],
    "n": "Rainbow Citrus Cake",
    "a": "HILARY2000",
    "r": "0",
    "s": 12,
    "des": "\"Tri-colored cake with a lemon layer, lime layer and an orange layer. The filling is a lemon curd and the frosting is orange.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9-inch pans. Sift together the flour, baking powder, and salt. Set aside.\nIn a large bowl, cream together the shortening and sugar until light and fluffy. Beat in the eggs one at a time, mixing until each egg is incorporated; stir in the vanilla. Beat in the flour mixture alternately with the milk. Divide batter into 3 bowls.\nIn the first bowl, stir in lemon zest and yellow food coloring; pour into prepared pan. In the second bowl, stir in orange zest and orange food coloring; pour into second prepared pan. In the last bowl, stir in the lime zest and green food coloring; pour into third prepared pan.\nBake in the preheated oven until a toothpick inserted into the center of each cake layer comes out clean, about 30 minutes. Let cool in pan for 5 minutes, then turn out onto a wire rack and cool completely.\nAssemble the cake: stack the layers together with the Lemon Filling in between the layers. Frost sides and top with Orange Cream Frosting. Refrigerate until serving.",
    "pt": "45 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "943702.jpg",
    "o": "4531871.jpg,4529677.jpg,4519975.jpg,4519974.jpg,4498528.jpg,4498527.jpg",
    "st": "allrecipes"
}