{
    "id": 231030,
    "old_rating": "4.82096",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (5 pound) flat-cut corned beef brisket",
        "1 tablespoon browning sauce (such as Kitchen BouquetÂ®), or as desired",
        "1 tablespoon vegetable oil",
        "1 onion, sliced",
        "6 cloves garlic, sliced",
        "2 tablespoons water"
    ],
    "nut": [
        "Calories > 455 kcal",
        "Carbs > 5.4 g",
        "Cholesterol > 162 mg",
        "Fat > 33.7 g",
        "Protein > 30.6 g",
        "Sodium > 1877 mg"
    ],
    "n": "Braised Corned Beef Brisket",
    "a": "mauigirl",
    "r": "0",
    "s": 6,
    "des": "\"You have never had corned beef like this and if you try it, I truly believe you will never go back to the traditionally 'boiled' beef. This recipe was given to my mother-in-law during WWII by her Jewish boarding house owner and it has become a treasured family recipe. Unlike the commonly boiled corned beef, this is a slow braise that is tender, flavorful, and has a caramelized surface when it's done. I serve it with colcannon, steamed cabbage wedges, braised carrots, and parsnips. It is our favorite St. Patrick's/Jewish dinner, but we love it so much that I cook it year around.\"",
    "ins": "Preheat oven to 275 degrees F (135 degrees C).\nDiscard any flavoring packet from corned beef. Brush brisket with browning sauce on both sides. Heat vegetable oil in a large skillet over medium-high heat and brown brisket on both sides in the hot oil, 5 to 8 minutes per side.\nPlace brisket on a rack set in a roasting pan. Scatter onion and garlic slices over brisket and add water to roasting pan. Cover pan tightly with aluminum foil.\nRoast in the preheated oven until meat is tender, about 6 hours.",
    "pt": "15 m",
    "ct": "6 h ",
    "tt": "6 h ",
    "i": "4487467.jpg",
    "o": "4487467.jpg,4487422.jpg,4487194.jpg,4487121.jpg,4486709.jpg,4486483.jpg",
    "st": "allrecipes"
}