{
    "id": 231023,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "2 rotisserie chicken carcasses, broken into pieces",
        "4 carrots, cut into chunks",
        "2 large onions, cut into chunks",
        "3 stalks celery, with leaves",
        "1/2 cup dry white wine",
        "1 tablespoon whole peppercorns",
        "5 whole cloves",
        "2 bay leaves",
        "1 sprig fresh thyme",
        "5 quarts water"
    ],
    "nut": [
        "Calories > 31 kcal",
        "Carbs > 4 g",
        "Cholesterol > 0 mg",
        "Fat > 0.9 g",
        "Protein > 0.5 g",
        "Sodium > 28 mg"
    ],
    "n": "Saturday Chicken Stock",
    "a": "GWENHWYVAR9",
    "r": "0",
    "s": 16,
    "des": "\"This is not a quick recipe, but the results are worth it. I usually take an entire Saturday to make this, but most of the time it's simmering on the stove, so it's not labor intensive. \n\nChicken bones browned with celery, onions and carrots make this broth dark and rich. I freeze leftover rotisserie chicken bones and make this about once a month or so. I freeze the stock in quart bags and use one whenever I would use chicken broth.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPour olive oil into the bottom of a large roasting pan; top with chicken carcass pieces, carrots, onions, and celery.\nRoast in the preheated oven, stirring occasionally, until bones and vegetables are browned, about 1 hour.\nTransfer roasted chicken bones and vegetables to an 8-quart stockpot. Pour wine into the roasting pan, scraping the bottom to release any browned bits of food; pour into stockpot. Add peppercorns, cloves, bay leaves, and thyme to stockpot. Cover the mixture with water and bring to a slow simmer. Set heat to low and simmer, straining off fat as needed, for at least 5 hours. Strain stock through a cheesecloth; refrigerate or freeze stock.",
    "pt": "20 m",
    "ct": "6 h",
    "tt": "6 h ",
    "i": "994762.jpg",
    "o": "",
    "st": "allrecipes"
}