{
    "id": 231051,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup boiling water, or as needed",
        "1 teaspoon water",
        "1/2 cup white sugar",
        "6 large egg yolks",
        "1 (14 ounce) can sweetened condensed milk",
        "1 (13 ounce) can evaporated milk",
        "1/4 cup white sugar",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 332 kcal",
        "Carbs > 50.5 g",
        "Cholesterol > 183 mg",
        "Fat > 11 g",
        "Protein > 8.9 g",
        "Sodium > 117 mg"
    ],
    "n": "Simple and Creamy Spanish Flan",
    "a": "FleurSweetLoves",
    "r": "0",
    "s": 8,
    "des": "\"Flan is a traditional Spanish/Hispanic dessert that can be dressed up any way from chocolate to traditional. This flan is simple, yet creamy and smooth. If you have never had flan or just couldn't seem to get it right, I can assure you that your family and friends will want the recipe. Be daring and try other extracts like almond or orange.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Place a 9-inch metal pie dish into a deep baking pan; pour boiling water into baking pan to reach about halfway up the side of the pie dish.\nPour 1 teaspoon water and 1/2 cup sugar into a heavy saucepan, place over medium heat, and constantly swirl the sugar-water mixture in the pan over the heat until sugar dissolves, melts, and turns into  a golden-brown caramel syrup, about 10 minutes. Watch carefully, the sugar burns easily. Pour melted caramel into the warmed pie dish and gently tilt pie dish to coat the bottom with caramel.\nWhisk egg yolks, sweetened condensed milk, evaporated milk, 1/4 cup sugar, and vanilla extract in a bowl until mixture is creamy and thoroughly combined. If mixture is foamy, skim foam off with a folded paper towel. Gently pour custard over caramel in pie dish. Cover baking pan with aluminum foil.\nBake in the preheated oven until custard is set but still jiggles slightly when moved, 45 minutes to 1 hour. Remove foil and place baking sheet with water bath and flan in refrigerator to chill, about 2 hours.\nRemove pie dish from baking pan; run a knife around the edges of flan to loosen from pie dish. Invert flan onto a rimmed serving platter to release custard and let caramel sauce flow over the flan.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "3 h ",
    "i": "3371246.jpg",
    "o": "",
    "st": "allrecipes"
}