{
    "id": 231174,
    "old_rating": "4.52518",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup vegetable oil",
        "2 tablespoons chili powder",
        "2 tablespoons lime juice",
        "2 tablespoons honey",
        "2 tablespoons garlic powder",
        "1/2 teaspoon paprika",
        "1/2 teaspoon ground black pepper",
        "3 pounds skinless, boneless chicken breasts, cut into strips"
    ],
    "nut": [
        "Calories > 260 kcal",
        "Carbs > 5.9 g",
        "Cholesterol > 70 mg",
        "Fat > 14.1 g",
        "Protein > 27 g",
        "Sodium > 74 mg"
    ],
    "n": "Easy Chicken Fajita Marinade",
    "a": "jmcdaneld",
    "r": "0",
    "s": 10,
    "des": "\"This is a simple fajita marinade that has been bounced around in my family for at least 15 years. It's simple, tasty, easily altered for a twist on the taste, and can be easily prepared in under 15 minutes. Serve with other fajita elements and enjoy! Some ideas: sauteed green bell pepper with white or yellow onions, jalapeno slaw, homemade salsa (tomato or mango), etc.\"",
    "ins": "Whisk vegetable oil, chili powder, lime juice, honey, garlic powder, paprika, and black pepper in a bowl to make a marinade. Place chicken strips into a large resealable plastic bag; pour marinade over chicken. Knead bag to coat chicken with marinade. Squeeze out air, seal bag, and refrigerate 4 hours to overnight.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nRemove chicken strips from marinade; discard used marinade.\nGrill chicken on preheated grill until browned, the juices run clear, and an instant-read meat thermometer inserted into the thickest piece reads at least 160 degrees F (70 degrees C), about 10 minutes per side.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "4 h ",
    "i": "1019437.jpg",
    "o": "4024037.jpg,3901695.jpg,3740633.jpg,3284550.jpg,2254508.jpg,1068978.jpg",
    "st": "allrecipes"
}