{
    "id": 231192,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (4 pound) corned beef brisket",
        "4 cups water, or as needed to cover",
        "8 small red potatoes",
        "1 teaspoon salt, or to taste",
        "1 head cabbage, cut into bite-size pieces",
        "1 cup butter",
        "1 cup honey",
        "1/4 cup horseradish mustard"
    ],
    "nut": [
        "Calories > 607 kcal",
        "Carbs > 57.7 g",
        "Cholesterol > 129 mg",
        "Fat > 35.3 g",
        "Protein > 19.4 g",
        "Sodium > 1387 mg"
    ],
    "n": "Honey Mustard Corned Beef Brisket and Cabbage",
    "a": "Tracy85710",
    "r": "0",
    "s": 10,
    "des": "\"My father used to make this recipe, one of his many tries (most successful)! But this one stands out as one of his best! Good Irish eating, just need the soda bread and your favorite beer. Hmmmmmmm. Serve with boiled red potatoes, cabbage, and asparagus. Enjoy!\"",
    "ins": "Place corned beef with fat side down into a large slow cooker and pour enough water over corned beef to cover.  Cook on High until beef is tender, about 3 hours.\nPlace potatoes into a large pot, cover with water, and stir in salt to taste; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cabbage, cover, and steam until tender, 8 to 10 minutes.\nMelt butter in a saucepan and stir honey and horseradish mustard into butter. Bring to a boil and remove from heat.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nPlace corned beef, fat side down, into a roasting pan. Pour half the honey-mustard sauce over brisket; broil until corned beef is golden brown, about 5 minutes. Serve corned beef with boiled potatoes and cabbage, topped with remaining honey-mustard sauce.",
    "pt": "15 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "3359602.jpg",
    "o": "",
    "st": "allrecipes"
}