{
    "id": 231184,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 small sweet potatoes, peeled",
        "1 Yukon Gold potato, peeled",
        "2 tablespoons olive oil",
        "1 cup chopped celery",
        "1/2 cup chopped sweet onion",
        "2 cloves garlic, minced",
        "2 cups corn kernels",
        "1 teaspoon chopped fresh ginger (optional)",
        "2 cups soy milk",
        "1 cup vegetable broth",
        "1 tablespoon chopped fresh parsley",
        "1 teaspoon dried rosemary (optional)",
        "1 teaspoon sea salt",
        "1 teaspoon ground black pepper",
        "1 bay leaf",
        "1 pinch cayenne pepper (optional)",
        "1/4 cup all-purpose flour"
    ],
    "nut": [
        "Calories > 177 kcal",
        "Carbs > 29.3 g",
        "Cholesterol > 0 mg",
        "Fat > 5.1 g",
        "Protein > 5.2 g",
        "Sodium > 355 mg"
    ],
    "n": "Creamy Vegan Sweet Potato and Corn Chowder",
    "a": "greatjbritton",
    "r": "0",
    "s": 8,
    "des": "\"This warm chowder will make you feel sweet and full at the same time. The ginger may feel spicy at first, but it wears off quick while you still get the antioxidants. If more liquid is needed, add vegetable broth, water, or beer.\"",
    "ins": "Place sweet potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 10 to 15 minutes. Drain potatoes and reserve 2 1/2 cups of potato water. Chop 2 sweet potatoes and Yukon Gold potato when cool enough to handle; reserve remaining sweet potato for a later step.\nHeat olive oil in a large pot over medium heat; cook and stir celery and sweet onion in the hot oil until onion begins to brown, about 10 minutes. Stir 1 chopped sweet potato, chopped Yukon Gold potato, and garlic into mixture. Cook and stir until garlic begins to turn golden, about 8 minutes. Stir corn and 1 chopped sweet potato into onion and celery mixture. Cover pot and cook for 5 minutes, stirring occasionally.\nPour reserved 2 1/2 cups drained potato cooking water into mixture. Place remaining sweet potato and ginger into a food processor and pulse several times to chop; puree and stir into vegetables. Stir soy milk, vegetable broth, parsley, rosemary, sea salt, black pepper, and bay leaf into mixture and bring soup to a boil. Reduce heat to low and simmer 5 minutes.\nWhisk flour into soup, stir until thickened, and remove soup from heat.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "970835.jpg",
    "o": "",
    "st": "allrecipes"
}