{
    "id": 231117,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup clarified butter, divided",
        "1 cup minced onion",
        "1 tablespoon thinly sliced shallots",
        "1 tablespoon minced garlic",
        "1 tablespoon thinly sliced leeks",
        "1 cup diced acorn squash",
        "1 cup minced parsnips",
        "1 cup diced carrots",
        "1 cup minced celery",
        "1/2 cup diced celery root (celeriac)",
        "1/2 cup all-purpose flour",
        "4 cups lobster stock",
        "1 cup minced crimini mushrooms",
        "6 tablespoons sherry wine",
        "1/2 cup chopped fresh tarragon",
        "1/2 cup chopped fresh parsley",
        "1/4 teaspoon hot pepper sauce (such as TabascoÂ®)",
        "salt and ground black pepper to taste",
        "2 bay leaves",
        "2 tablespoons sherry vinegar",
        "1 cup cooked and coarsely chopped lobster meat",
        "1 cup sweet baby peas",
        "1 (17.5 ounce) package frozen puff pastry, thawed"
    ],
    "nut": [
        "Calories > 583 kcal",
        "Carbs > 47.4 g",
        "Cholesterol > 47 mg",
        "Fat > 37.4 g",
        "Protein > 14.1 g",
        "Sodium > 565 mg"
    ],
    "n": "Lobster Pot Pie",
    "a": "ABoston",
    "r": "0",
    "s": 8,
    "des": "\"Rich pot pie, perfect evening comfort food on a cold night! It is labor-intensive and expensive, but the end result is worth the effort--avoid shortcuts and substitutions if possible. Lobster stock is the easiest way to cut down on cost without sacrificing taste.\"",
    "ins": "Heat 1/4 cup butter in a skillet over medium heat; stir in onion. Cook and stir until the onion has softened and turned translucent, about 5 minutes. Mix in shallots, garlic, and leeks; cook until softened, 2 to 3 minutes. Add acorn squash, parsnips, carrots, celery, and celery root. Reduce heat to low and cook vegetables until softened, about 10 minutes. Transfer vegetables to a bowl.\nPreheat oven to 450 degrees F (232 degrees C).\nHeat remaining butter in the same skillet over medium heat until a pinch of flour sprinkled into the oil will just begin to bubble. Whisk in flour to form a thick paste the consistency of cake frosting. Continue cooking the roux, whisking constantly, until flour has turned golden and begins to smell like toast, about 20 minutes.\nStir vegetable mixture, lobster stock, mushrooms, sherry wine, tarragon, parsley, pepper sauce, salt, and pepper into the roux. Cook and stir gently until thick, 12 to 15 minutes. Stir in sherry vinegar. Add lobster meat and peas. Spoon roux mixture into a casserole dish or ramekins. Cover and place near or above the hot oven until ready to use.\nUnroll puff pastry. Cut sheets into crusts slightly larger than the pie plate. Press 1 layer onto the bottom of a 9-inch pie plate.\nBake bottom crust in the preheated oven until light brown, about 8 minutes. Remove from oven and fill with roux mixture. Place top crust over filling; press its edges onto the bottom crust to seal.\nContinue baking until top crust is golden brown, 30 to 35 minutes.",
    "pt": "1 h",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}