{
    "id": 231160,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup black beluga lentils",
        "2 1/2 cups water",
        "1 pinch salt",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "4 hot Italian sausage links",
        "1 clove garlic, crushed",
        "1 (8 ounce) package crimini mushrooms, sliced",
        "1 eggplant, chopped",
        "1 small hot pepper, chopped",
        "salt and ground black pepper to taste",
        "1 (14 ounce) can diced tomatoes"
    ],
    "nut": [
        "Calories > 662 kcal",
        "Carbs > 42.4 g",
        "Cholesterol > 86 mg",
        "Fat > 39.5 g",
        "Protein > 33 g",
        "Sodium > 1014 mg"
    ],
    "n": "Spicy Italian Sausage and Lentil Casserole",
    "a": "Karen's Low Carb Cafe",
    "r": "0",
    "s": 4,
    "des": "\"Delicious winter warmer. Full of flavor and nutrition. Easy to prepare.\"",
    "ins": "Combine lentils, water, and salt in a large pot; bring to a boil, reduce heat to medium-low, and cook at a simmer until the lentils are tender and the liquid is absorbed, about 25 minutes.\nWhile the lentils cook, heat olive oil in a pot over medium heat. Cook and stir onion in hot oil until lightly browned, about 5 minutes. Add sausage links to the pot; cook until browned completely, 3 to 5 minutes per side. Stir garlic into the onion mixture; cook and stir until fragrant, 1 to 2 minutes. Add mushrooms, eggplant, and hot pepper to the pot; season with salt and black pepper. Pour diced tomatoes over the vegetable mixture. Place a cover on the pot and cook at a simmer until the sausage is no longer pink the middle, about 10 minutes.\nRemove the sausages from the vegetable mixture to a cutting board; cut into chunks and stir into the lentils. Stir vegetable mixture into the lentils. Cover pot and cook until the vegetables are tender and the flavors blend, about 5 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}