{
    "id": 231185,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 stalks celery",
        "1 large onion, quartered - divided",
        "1 lemon, quartered - divided",
        "4 sprigs fresh rosemary, divided",
        "4 Cornish game hens",
        "1 tablespoon olive oil",
        "salt to taste",
        "1 pinch lemon pepper, or to taste",
        "1 tablespoon chopped fresh tarragon",
        "1 tablespoon chopped fresh basil",
        "1 tablespoon chopped fresh thyme",
        "2 sprigs fresh rosemary, leaves removed and chopped",
        "1 head garlic, peeled",
        "1 large onion, chopped",
        "1/2 cup white wine",
        "1/2 cup chicken broth",
        "3 tablespoons olive oil"
    ],
    "nut": [
        "Calories > 814 kcal",
        "Carbs > 17.5 g",
        "Cholesterol > 303 mg",
        "Fat > 56 g",
        "Protein > 54.1 g",
        "Sodium > 374 mg"
    ],
    "n": "Herb-Roasted Cornish Hens",
    "a": "Michelle Mullis",
    "r": "0",
    "s": 4,
    "des": "\"Roasted with lemon, garlic, onion and a medley of fresh herbs, this is sure to please anytime or for special occasions.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nArrange celery stalks next to each other in the bottom of a heavy roasting pan.\nPlace 1 onion quarter, 1 lemon quarter, and 1 sprig rosemary in the cavity of each hen. Rub outside of hens with 1 tablespoon olive oil; sprinkle with salt and lemon pepper. Arrange hens atop celery; sprinkle with tarragon, basil, thyme, and chopped rosemary. Scatter garlic cloves and 1 chopped onion around hens.\nBake in the preheated oven for 25 minutes. Reduce heat to 350 degrees F (175 degrees C).\nWhisk wine, broth, and 3 tablespoons olive oil together in a bowl; pour over hens.\nCook hens until no longer pink at the bone and the juices run clear, about 50 more minutes, basting every 15 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Turn off oven and let hens rest in the oven for 10 more minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4391914.jpg",
    "o": "2187753.jpg,2187742.jpg,1866805.jpg,1866394.jpg,1589216.jpg,1589199.jpg",
    "st": "allrecipes"
}