{
    "id": 231233,
    "old_rating": "4.79688",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package spaghetti",
        "1 1/2 pounds ground beef",
        "1 (1 ounce) package taco seasoning",
        "3/4 cup water",
        "1 (15 ounce) can corn, drained",
        "1 (8 ounce) jar taco sauce",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "1 (8 ounce) container sour cream",
        "2 cups shredded Cheddar cheese, divided",
        "1 cup tortilla chips, crushed"
    ],
    "nut": [
        "Calories > 729 kcal",
        "Carbs > 55.3 g",
        "Cholesterol > 131 mg",
        "Fat > 39.3 g",
        "Protein > 38 g",
        "Sodium > 1451 mg"
    ],
    "n": "Taco Spaghetti Bake",
    "a": "mmrswebb",
    "r": "0",
    "s": 6,
    "des": "\"This is a recipe that I came up with on the spur of the moment. My family, especially my 2 year old, loved it! Very kid-friendly. Garnish with a dollop of sour cream and shredded lettuce, if desired.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a large baking dish.\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 12 minutes. Drain and transfer pasta to prepared baking dish.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir in taco seasoning and water; simmer until thickened, about 5 minutes. Add corn and taco sauce; cook and stir until heated through, about 5 minutes more.\nCombine cream of chicken soup, sour cream, and 1 cup Cheddar cheese in a bowl until evenly mixed. Spread mixture over spaghetti. Spread beef mixture over sour cream mixture and top with remaining 1 cup Cheddar cheese and tortilla chips.\nBake in preheated oven until cheese is melted and bubbly, about 30 minutes. Allow to cool for 5 to 10 minutes before serving.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1006334.jpg",
    "o": "4520089.jpg,4520088.jpg,4227969.jpg,3959745.jpg,3561313.jpg,3233586.jpg",
    "st": "allrecipes"
}