{
    "id": 231237,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Dough:",
        "1 1/2 cups white whole wheat flour",
        "1 1/2 cups whole wheat pastry flour",
        "2 teaspoons baking powder",
        "1 teaspoon salt",
        "1 1/4 cups warm water",
        "1/4 cup extra-virgin olive oil",
        "2 tablespoons honey",
        "4 teaspoons active dry yeast",
        "cooking spray",
        "Filling:",
        "1 cup chopped broccoli",
        "1 cup shredded cooked chicken breast",
        "1 cup light cream cheese, softened"
    ],
    "nut": [
        "Calories > 264 kcal",
        "Carbs > 31.6 g",
        "Cholesterol > 21 mg",
        "Fat > 11.4 g",
        "Protein > 10.4 g",
        "Sodium > 416 mg"
    ],
    "n": "Heart Shaped Whole Wheat Mini Calzones",
    "a": "SugarFreeMom",
    "r": "0",
    "s": 10,
    "des": "\"This is a fun Valentine's recipe to make with your child. My daughter loved helping and cutting out the dough into hearts.\"",
    "ins": "Combine white whole wheat flour, whole wheat pastry flour, baking powder, and salt together in the bowl of a stand mixer; make a well in the center of flour mixture.\nMix water, olive oil, and honey together in a separate bowl; sprinkle yeast over water mixture. Let stand without stirring until yeast softens and begins to form a creamy foam, about 10 minutes.\nPour yeast mixture into well of the flour mixture; mix on low setting using paddle beater until combined, 2 to 3 minutes. Replace paddle beater with dough hook and beat dough on low setting for 10 minutes.\nSpray the inside of a large bowl with cooking spray.\nTransfer dough to the prepared bowl; cover bowl with a towel and let rise in a warm area at least 30 minutes (1 hour for better texture).\nDivide dough into two balls; knead each by hand for about 1 minute.\nSpray 2 baking sheets with cooking spray.\nRoll each dough ball out with a rolling pin onto the prepared baking sheets about 1/4 inch thick. Cut dough into an even number of hearts using heart-shaped cookie cutters.\nPreheat oven to 400 degrees F (200 degrees C).\nPlace broccoli in a microwave-safe bowl; cook on high in microwave until slightly tender, 1 to 2 minutes.\nMix cooked broccoli, chicken, and cream cheese together in a bowl. Spoon 1 to 2 tablespoons filling into the center of a heart; top with another heart. Seal edges together by pressing around the heart with a fork. Repeat with remaining filling and hearts.\nBake in the preheated oven until hearts are golden brown, about 20 minutes.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "965585.jpg",
    "o": "",
    "st": "allrecipes"
}