{
    "id": 231285,
    "old_rating": "4.30769",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups white rice",
        "4 cups water",
        "12 ounces country-style smoked link sausage",
        "1/2 cup water",
        "1 large onion, sliced",
        "1 large green bell pepper, cut into 1-inch pieces",
        "1 cup diagonally sliced celery, 1 inch thick",
        "1 (14 ounce) can whole peeled tomatoes, quartered",
        "1 cup beef broth",
        "1 (8 ounce) can pineapple rings in juice, cubed and juice reserved",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon ground black pepper",
        "1 tablespoon brown sugar",
        "2 tablespoons cornstarch"
    ],
    "nut": [
        "Calories > 527 kcal",
        "Carbs > 69.5 g",
        "Cholesterol > 39 mg",
        "Fat > 18.7 g",
        "Protein > 18.7 g",
        "Sodium > 1108 mg"
    ],
    "n": "Hawaiian-Style Sausage and Rice",
    "a": "Ralph",
    "r": "0",
    "s": 6,
    "des": "\"I used to work where we had a lot of potluck lunches. I just brought the ingredients, already prepared, a rice cooker, and an electric frying pan. I would start the rice about 20 minutes before lunch and cook the rest in the frying pan while everyone else was uncovering and setting out their dishes. My copy of the recipe is getting so tattered I felt I better archive it. I would sorely miss it if lost.\"",
    "ins": "Bring rice and 2 cups water to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and the liquid has been absorbed, 20 to 25 minutes.\nPlace sausages into a skillet with 1/2 cup water over medium heat, cover, and cook until heated through, about 5 minutes. Thinly slice sausages. Combine sausages with onion, green pepper, and celery in a large skillet over medium heat; cook and stir until vegetables start to soften, about 5 minutes.\nStir tomatoes, beef broth, pineapple, garlic powder, black pepper, and brown sugar into sausage mixture. Cook and stir until brown sugar has dissolved and mixture comes to a simmer. Whisk reserved pineapple juice with cornstarch in a small bowl until smooth. Stir cornstarch mixture into sausage mixture and cook until sauce thickens and turns clear, about 2 minutes. Serve sausage mixture over cooked rice.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "4512138.jpg",
    "o": "",
    "st": "allrecipes"
}