{
    "id": 231371,
    "old_rating": "4.7",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 extra large zucchini, halved lengthwise",
        "1 tablespoon olive oil",
        "1 sweet onion, chopped",
        "1 tablespoon chopped garlic",
        "1 pound ground lamb",
        "coarse salt to taste",
        "ground black pepper to taste",
        "1 (16 ounce) can tomato sauce",
        "2 tomatoes, chopped",
        "3/4 cup crumbled feta cheese",
        "1/2 cup pine nuts",
        "1/4 cup mint leaves",
        "1/4 cup water",
        "1/4 cup mint leaves",
        "3/4 cup seasoned bread crumbs",
        "3/4 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 649 kcal",
        "Carbs > 38.8 g",
        "Cholesterol > 115 mg",
        "Fat > 38.7 g",
        "Protein > 40.6 g",
        "Sodium > 1523 mg"
    ],
    "n": "Mediterranean Stuffed Zucchini",
    "a": "Larry Short",
    "r": "0",
    "s": 4,
    "des": "\"Here's a delicious way to solve the problem of those too-big zucchinis ballooning in your garden at the end of the summer: zucchini boats baked and stuffed with lamb, feta, pine nuts, tomatoes, and more. It's just like your mother used to make, but with an exotic Mediterranean twist!\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nUse a melon baller to separate and remove seeds and pulp separately from the zucchini, carving out each half and leaving about a half-inch shell. Chop zucchini pulp into pieces about 1/4 inch in diameter. Discard seeds.\nHeat olive oil in a large skillet over medium heat. Cook and stir onion and garlic in hot oil until tender, about 5 minutes. Add ground lamb; continue to cook and stir until lamb is lightly browned, 5 to 7 minutes. Stir chopped zucchini into the lamb mixture. Reduce heat to medium-low. Simmer mixture until the zucchini is hot, about 3 minutes. Drain excess grease. Season lamb mixture with coarse salt and black pepper.\nRemove skillet from heat. Stir tomato sauce, tomatoes, feta cheese, pine nuts, and 1/4 cup mint leaves through the lamb mixture; spoon into the zucchini halves. Put stuffed zucchini halves into a large baking dish. Pour water into the baking dish.\nBake in preheated oven for 30 minutes. Mix bread crumbs and mozzarella cheese in a bowl. Sprinkle 1/4 cup mint leaves over the zucchini and top with the bread crumb mixture. Continue baking until the top is crusty and browned, about 10 minutes more.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1032482.jpg",
    "o": "",
    "st": "allrecipes"
}