{
    "id": 231315,
    "old_rating": "4.26316",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (13.5 ounce) package JohnsonvilleÂ® Andouille Dinner Sausage, cut into 1/4-inch slices",
        "8 ounces raw shrimp, peeled and deveined or 8 ounces boneless, skinless chicken breast, cut into 1-inch pieces",
        "2 teaspoons Cajun Creole seasoning",
        "1 teaspoon olive oil",
        "1 (8 ounce) package Jambalaya Rice Mix",
        "1 (14 ounce) can diced tomatoes, drained and divided",
        "1 teaspoon Worcestershire sauce",
        "1 teaspoon hot pepper sauce",
        "2 tablespoons chopped fresh parsley"
    ],
    "nut": [
        "Calories > 376 kcal",
        "Carbs > 32.9 g",
        "Cholesterol > 96 mg",
        "Fat > 18.2 g",
        "Protein > 17.7 g",
        "Sodium > 1459 mg"
    ],
    "n": "1-2-3 Jambalaya",
    "a": "Johnsonville",
    "r": "0",
    "s": 6,
    "des": "\"Enjoy some Creole comfort the quick and easy way with this Johnsonville creation. Using your favorite Jambalaya rice and Creole seasoning, add in some succulent shrimp, olive oil, tomatoes and hot pepper sauce to get the celebration started. Add Johnsonville's Andouille Dinner Sausage to bring everything together for a truly authentic taste experience. Taking a trip to the Big Easy has never been so simple!\"",
    "ins": "In a bowl, combine sausage, shrimp or chicken with Creole seasoning; toss to coat. In a skillet, heat oil over medium heat. Add sausage, shrimp or chicken, cooking and stirring until shrimp turn pink or chicken is no longer pink, about 3-5 minutes.\nIn a saucepan, prepare rice mix according to package directions. In addition, add one-half of the tomatoes into the rice preparation. After 12 minutes of cooking, add remaining tomatoes, Worcestershire sauce, hot pepper sauce and parsley. Continue to cook on low, covered, until liquid is absorbed and rice is tender.\nAdd sausage, shrimp or chicken to rice, stir until heated through. Serve.",
    "pt": "5 m",
    "ct": "25 m",
    "tt": "30 m",
    "i": "4467234.jpg",
    "o": "",
    "st": "allrecipes"
}