{
    "id": 231357,
    "old_rating": "4.44444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 bulbs garlic",
        "1 teaspoon olive oil, divided",
        "1 pound dry brown lentils",
        "4 cups water, or as needed to cover",
        "1 pint grape tomatoes, halved",
        "1 bunch fresh parsley, finely chopped",
        "1 bunch green onions, thinly sliced",
        "1/4 cup balsamic vinegar",
        "1/4 cup olive oil",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 183 kcal",
        "Carbs > 25.7 g",
        "Cholesterol > 0 mg",
        "Fat > 5.5 g",
        "Protein > 9.8 g",
        "Sodium > 28 mg"
    ],
    "n": "Cold Lentil Salad",
    "a": "Lindsay L.",
    "r": "0",
    "s": 12,
    "des": "\"This lentil salad is very simple and yet very tasty. It is perfect for picnics and summer gatherings. If you grow fresh herbs and tomatoes, it will come out even better. It is appropriate for vegan, gluten-free, and generally healthy eating.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPeel outer skins from garlic bulbs and cut about 1/4 inch from the top of each bulb to expose cloves; place each bulb onto a piece of aluminum foil, drizzle each with about 1/2 teaspoon olive oil, and wrap garlic bulbs in the foil. Place wrapped bulbs into a baking dish.\nBake garlic in the preheated oven until soft, about 30 minutes. Let bulbs cool.\nPlace lentils into a 5-quart pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until lentils are tender but not mushy, about 15 minutes; stir occasionally. Drain lentils in a fine-mesh strainer and rinse with cold water to cool; drain again.\nBreak garlic bulbs apart and squeeze cloves to release cooked garlic. Place garlic into a large salad bowl and add grape tomatoes, parsley, and green onions. Whisk balsamic vinegar with 1/4 cup olive oil, salt, and black pepper in a small bowl. Fold lentils into tomato mixture and pour dressing over salad; gently toss to coat. Keep refrigerated until serving time.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "1552169.jpg",
    "o": "",
    "st": "allrecipes"
}