{
    "id": 23139,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/4 cups all-purpose flour",
        "1 pinch salt",
        "1/3 cup superfine sugar",
        "1/3 cup ground almonds",
        "2/3 cup butter",
        "1 egg, beaten",
        "1 tablespoon white wine",
        "1 tablespoon rum",
        "2 teaspoons lemon zest",
        "3 tablespoons butter, melted",
        "1/2 cup fruit preserves, any flavor",
        "1 egg yolk, beaten"
    ],
    "nut": [
        "Calories > 75 kcal",
        "Carbs > 8.4 g",
        "Cholesterol > 17 mg",
        "Fat > 4.1 g",
        "Protein > 1.1 g",
        "Sodium > 26 mg"
    ],
    "n": "German Filled  Hoernchen",
    "a": "Elfi",
    "r": "0",
    "s": 48,
    "des": "\"Rich tart pastry of little horns. The filling can also be marmalade, a mixture of raisins or currants with cinnamon and sugar, or chopped hazelnuts with sugar and enough sour or sweet cream to bind the mixture.\"",
    "ins": "In a medium bowl, stir together the flour, salt, sugar and almonds. Cut in the 2/3 cup butter until the mixture is crumbly. Add egg, wine, rum and lemon zest. Mix gently until well blended. Adjust the flour if necessary to make a stiff dough. On a lightly floured surface, knead the dough briefly, shape into a ball, wrap and chill for at least one hour or until firm.\nPreheat oven to 350 degrees F (175 degrees C).\nOn a floured surface, roll the dough out to less than 1/4 inch in thickness. Brush with melted butter and cut into triangles about three inches across. Place a dab of jam along one side of each triangle and roll up from the jam end to the point. Seal with a dab of water if necessary. Place pastry horn onto an ungreased cookie sheet and brush with beaten egg yolk.\nBake for 20 to 25 minutes in the preheated oven, until crisp and golden. Dust with confectioners' sugar if desired.",
    "pt": "3 m",
    "ct": "25 m",
    "tt": "4 h ",
    "i": "1349846.jpg",
    "o": "",
    "st": "allrecipes"
}