{
    "id": 231380,
    "old_rating": "4.60563",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Meatloaf:",
        "1 1/2 pounds ground turkey",
        "3/4 cup crushed buttery round crackers",
        "1/2 cup milk",
        "1 small onion, chopped",
        "1 egg",
        "1 1/2 teaspoons salt",
        "2 cloves garlic, minced",
        "1/4 teaspoon ground black pepper",
        "Topping:",
        "1/2 cup ketchup",
        "1/4 cup brown sugar",
        "1 tablespoon Worcestershire sauce"
    ],
    "nut": [
        "Calories > 296 kcal",
        "Carbs > 25.2 g",
        "Cholesterol > 85 mg",
        "Fat > 13.2 g",
        "Protein > 19.7 g",
        "Sodium > 881 mg"
    ],
    "n": "Best Turkey Meatloaf",
    "a": "isabella104",
    "r": "0",
    "s": 8,
    "des": "\"After much trial and error trying to make a more healthy meatloaf, I came up with this recipe. It is important to make this on a baking sheet so the liquids can be drained off the meatloaf. Also, do not put the topping on before the meatloaf has cooked for 30 minutes. Turkey creates a lot of juices, so if you put the topping on first it will become watery and runny.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a jelly roll pan.\nMix ground turkey, buttery round cracker crumbs, milk, onion, egg, salt, garlic, and black pepper in a bowl; shape into a loaf and place on the prepared jelly roll pan.\nMix ketchup, brown sugar, and Worcestershire sauce in a separate bowl; set aside.\nBake meatloaf in preheated oven for 30 minutes; remove from oven and drain liquids. Top meatloaf with ketchup topping. Return loaf to oven and continue baking until no longer pink in the center, about 30 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4479135.jpg",
    "o": "4540081.jpg,4507307.jpg,4500785.jpg,4483887.jpg,4482796.jpg,4478860.jpg",
    "st": "allrecipes"
}