{
    "id": 231381,
    "old_rating": "4.52326",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (8 ounce) package spaghetti",
        "1 teaspoon dark sesame oil",
        "1 tablespoon peanut oil",
        "4 cloves garlic, minced",
        "1 tablespoon minced fresh ginger root",
        "4 cups mixed vegetables",
        "1 pound flank steak, thinly sliced",
        "3 tablespoons reduced-sodium soy sauce",
        "2 tablespoons brown sugar",
        "1 tablespoon oyster sauce",
        "1 tablespoon Asian chile paste with garlic"
    ],
    "nut": [
        "Calories > 519 kcal",
        "Carbs > 72.8 g",
        "Cholesterol > 36 mg",
        "Fat > 15 g",
        "Protein > 26.3 g",
        "Sodium > 573 mg"
    ],
    "n": "Beef Lo Mein",
    "a": "Rachel",
    "r": "0",
    "s": 4,
    "des": "\"I couldn't find a good lo mein recipe on here, so I'm posting mine. I made it this week and my roommate and I agreed that it was possibly the best that we've ever had.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water until cooked through but firm to the bite, about 12 minutes; drain and transfer to a large bowl. Drizzle sesame oil over the spaghetti; toss to coat. Place a plate atop the bowl to keep the noodles warm.\nHeat peanut oil in a wok or large skillet over medium-high heat. Cook and stir garlic and ginger in hot oil until fragrant, about 30 seconds. Add mixed vegetables to the skillet; cook and stir until slightly tender, about 3 minutes. Stir flank steak into the vegetable mixture; cook and stir until the beef is cooked through, about 5 minutes.\nMix soy sauce, brown sugar, oyster sauce, and chile paste together in a small bowl; pour over the spaghetti. Dump spaghetti and sauce mixture into the wok with the vegetables and steak; cook and stir until the spaghetti is hot, 2 to 3 minutes.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "999688.jpg",
    "o": "4497468.jpg,4474221.jpg,4473658.jpg,4464157.jpg,4050436.jpg,3920896.jpg",
    "st": "allrecipes"
}