{
    "id": 231333,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Pasta:",
        "14 ounces all-purpose flour",
        "3 1/2 ounces chestnut flour",
        "1 pinch salt",
        "3 tablespoons extra-virgin olive oil",
        "4 eggs",
        "4 egg yolks",
        "Sauce:",
        "2 tablespoons butter",
        "2 large leeks - washed, trimmed, and thinly sliced",
        "2 tablespoons minced shallot",
        "2 cloves garlic, chopped",
        "1 tablespoon olive oil",
        "2 pounds mixed varieties of fresh mushrooms",
        "1 cup dry white wine",
        "1 bunch fresh parsley, minced",
        "2 tablespoons shredded Parmigiano-Reggiano cheese, or to taste"
    ],
    "nut": [
        "Calories > 607 kcal",
        "Carbs > 77.8 g",
        "Cholesterol > 272 mg",
        "Fat > 21.5 g",
        "Protein > 20.3 g",
        "Sodium > 136 mg"
    ],
    "n": "Chestnut Pappardelle With Cremini Mushrooms, White Wine, and Parmigiano-Reggiano",
    "a": "FeastorFamine3",
    "r": "0",
    "s": 6,
    "des": "\"Great recipe, but it takes some practice to get the pasta right.\"",
    "ins": "Whisk flour, chestnut flour, and salt in a bowl; stir in 3 tablespoons olive oil, eggs, and egg yolks to make a smooth dough. Form dough into a ball, wrap in a cloth towel, and let rest for 1 hour.\nRoll pasta into thin 5x12-inch sheets on a floured work surface; cut sheets into 1x12-inch ribbons. Let pappardelle pasta dry on a kitchen towel sprinkled with flour while you complete remaining steps.\nMelt butter in a large skillet over medium heat; cook and stir leeks, shallot, and garlic until white part of leeks becomes translucent, about 5 minutes. Heat 1 tablespoon olive oil in a separate skillet over medium heat; cook and stir mushrooms in hot olive oil until the liquid evaporates and mushrooms turn golden brown, 10 to 15 minutes. Mix mushrooms into leek mixture.\nStir white wine into mushroom-leek mixture and scrape up and dissolve any browned bits of food on the bottom of the skillet. Bring to a boil, reduce heat to low, and simmer mushroom-leek mixture until mushrooms are tender, about 5 minutes.\nBring a large pot of lightly salted water to a boil; cook the pappardelle pasta at a boil until tender and pasta floats to the top of the water, about 5 minutes; drain. Transfer pasta to a serving bowl, toss lightly with mushroom-leek mixture and parsley, and top with Parmigiano-Reggiano cheese.",
    "pt": "1 h",
    "ct": "25 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}