{
    "id": 231353,
    "old_rating": "4.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon butter, melted",
        "1 tablespoon white sugar",
        "5 teaspoons butter, melted",
        "5 teaspoons all-purpose flour",
        "1/4 cup cold milk",
        "2 egg yolks",
        "1 teaspoon freshly grated orange zest",
        "1 tablespoon brandy-based orange liqueur (such as Grand MarnierÂ®)",
        "1/8 teaspoon vanilla extract",
        "2 egg whites",
        "1/4 cup white sugar, divided"
    ],
    "nut": [
        "Calories > 396 kcal",
        "Carbs > 41.9 g",
        "Cholesterol > 249 mg",
        "Fat > 21 g",
        "Protein > 8.1 g",
        "Sodium > 189 mg"
    ],
    "n": "Grand MarnierÂ® Souffle",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"Presenting this gorgeous Grand Marnier souffle to your sweetheart at the end of a romantic dinner would certainly impress. This is a show-stopping dessert for special occasions.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Brush the insides of 2 (8-ounce) ramekins with 1 tablespoon melted butter and sprinkle with 1 tablespoon sugar. Place on a baking sheet lined with aluminum foil.\nMelt 1 tablespoon butter and 2 teaspoons butter in a saucepan over medium-low heat; cook and stir flour in the melted butter until golden brown and fragrant, about 2 minutes. Pour in milk and cook, stirring continuously, until smooth and thick, 3 to 4 minutes. Remove from heat and transfer to a mixing bowl.\nStir orange zest and 1 tablespoon brandy-based orange liqueur into butter mixture until combined. Add egg yolks and 1/8 teaspoon vanilla; mix until smooth.\nWhisk egg whites in a large bowl until frothy. Slowly add half the 1/4 cup sugar and whisk until combined; add remaining sugar and continue to whisk until meringue is thick and holds it shape, but is not stiff.\nFold half the meringue into egg yolk mixture until combined. Gently fold in second half until well mixed. Transfer to the prepared ramekins, allowing  1/4-inch of space at the top.\nBake in the preheated oven until risen and browned, 16 minutes.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "4476609.jpg",
    "o": "4476609.jpg,4469621.jpg,4448386.jpg,3910113.jpg,3559264.jpg,3463503.jpg",
    "st": "allrecipes"
}