{
    "id": 231444,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 pound beef chuck steak",
        "1 pinch salt",
        "1/4 cup all-purpose flour, or as needed",
        "3/4 cup beef stock",
        "1 (14 ounce) can artichoke hearts, chopped and juice reserved",
        "1/2 cup roasted red peppers, drained and chopped",
        "1/2 (4 ounce) can chopped green chiles",
        "3 tablespoons prepared horseradish",
        "2 teaspoons capers"
    ],
    "nut": [
        "Calories > 316 kcal",
        "Carbs > 16.5 g",
        "Cholesterol > 51 mg",
        "Fat > 20 g",
        "Protein > 17.5 g",
        "Sodium > 752 mg"
    ],
    "n": "A Tangy Braised Chuck Steak",
    "a": "Elizabeth Baxter Hardin Duckwo",
    "r": "0",
    "s": 4,
    "des": "\"Artichokes and canned vegetables combine for an easy steak dish to make for any occasion. Most of the ingredients will be found in your pantry. If you don't have artichokes, use mushrooms. This dish is very forgiving! Serve with rice, noodles, or even spaghetti.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPlace beef chuck steak on a work surface and pound with a meat mallet to tenderize steak; flip steak and repeat on other side. Cut steak into 6 to 8 pieces.\nHeat olive oil in an oven-safe Dutch oven over medium heat.\nSeason both sides of steak pieces with salt; coat with a thin layer of flour.\nCook steak in the hot oil until browned, about 2 minutes per side. Remove steak from Dutch oven. Pour beef stock and 1/4 cup reserved artichoke juice into the Dutch oven, scraping any brown bits of food from the bottom. Mix artichokes, red peppers, green chiles, horseradish, and capers into broth mixture; bring to a boil. Return beef to broth mixture in Dutch oven and cover.\nPlace Dutch oven in the preheated oven; bake until meat is tender, 45 to 60 minutes. Allow steak to cool in Dutch oven for 15 minutes before serving.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}