{
    "id": 231414,
    "old_rating": "4.3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/4 cups chicken broth",
        "1 cup brown rice",
        "1 tablespoon butter",
        "1/4 teaspoon salt",
        "1 tablespoon butter",
        "1 tablespoon olive oil, or as needed",
        "1 onion, sliced",
        "2 jalapeno peppers, seeded and thinly sliced",
        "2 cloves garlic, minced",
        "1/4 cup dry red wine",
        "1 1/2 tablespoons Worcestershire sauce",
        "1 (7 ounce) can chipotle peppers in adobo sauce, minced",
        "1 1/2 pounds large shrimp (16 to 20 per lb.), peeled and deveined"
    ],
    "nut": [
        "Calories > 410 kcal",
        "Carbs > 36.8 g",
        "Cholesterol > 277 mg",
        "Fat > 12.7 g",
        "Protein > 31.6 g",
        "Sodium > 1311 mg"
    ],
    "n": "Camarones Diablos (Devil Shrimp)",
    "a": "Dick McCabe",
    "r": "0",
    "s": 4,
    "des": "\"This dish is very spicy, somewhere between sweating brow and teary eyes! Sometimes you just have to wake up your taste buds. Serve over brown rice cooked in chicken broth and butter that is reminiscent of risotto. I have made the rice with water and bouillon instead of broth, with very little change in the flavor or texture. Like so many dishes, this one is better the next day. I adapted this recipe from the chipotle shrimp recipe on this site.\"",
    "ins": "Combine chicken broth, brown rice, 1 tablespoon butter, and salt in a saucepan; bring to a boil. Reduce heat to low, cover, and simmer until rice is tender and broth is absorbed, about 45 minutes.\nHeat 1 tablespoon butter and olive oil in a skillet over medium heat; cook and stir onion and jalapeno peppers in the hot butter and oil until onion is slightly softened, 3 minutes. Add garlic and cook until fragrant, about 30 seconds.\nPour red wine and Worcestershire sauce into onion mixture; mix in chipotle peppers. Cook and stir mixture until liquid is slightly evaporated, about 5 minutes. Add shrimp and cook until opaque, about 5 minutes. Reduce heat and simmer until liquid is reduced, about 15 minutes. Serve shrimp mixture over cooked rice.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "3721775.jpg",
    "o": "4484801.jpg,3721910.jpg,3721766.jpg,3235611.jpg,2617225.jpg,2572255.jpg",
    "st": "allrecipes"
}