{
    "id": 231453,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1/2 red onion, chopped",
        "5 cloves garlic, minced",
        "1 bunch kale, stems removed and chopped",
        "1 teaspoon tamari sauce",
        "1 cup grated Romano cheese",
        "1/4 cup whole wheat bread crumbs (optional)",
        "6 eggs, beaten well",
        "1 bunch fresh oregano, chopped",
        "1 pinch sea salt and ground black pepper to taste",
        "2 teaspoons olive oil",
        "5 pickled picante peppers (such as Trader Joe's Peri Peri PeppadropsÂ®), chopped"
    ],
    "nut": [
        "Calories > 360 kcal",
        "Carbs > 21.5 g",
        "Cholesterol > 276 mg",
        "Fat > 21.7 g",
        "Protein > 23.1 g",
        "Sodium > 703 mg"
    ],
    "n": "Kale Cakes with Sweet Hot Peppers",
    "a": "melissa-henry",
    "r": "0",
    "s": 4,
    "des": "\"Kale can be tough to work with as it's generally bitter, but this recipe makes it tasty! Versatile, this dish can be served as a savory breakfast dish or main dish at dinner.\n\nThis recipe was adapted from Regina Schrambling's Collard Squares.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat 1 tablespoon olive oil over medium-high heat in large heavy skillet. Add red onion; cook and stir 3 minutes. Add garlic; cook and stir 2 minutes. Add kale and continue to stir until kale is wilted, about 5 minutes. Place kale mixture in a large bowl.\nGently toss kale with tamari sauce, Romano cheese, whole wheat bread crumbs, eggs, oregano, sea salt, and black pepper until well combined.\nLightly coat an 8x8-inch baking pan with 2 teaspoons olive oil; pour in egg and kale mixture. Distribute chopped pickled picante peppers on top.\nBake in the preheated oven until eggs are well set and the top is lightly browned,  20 to 25 minutes. Cut into squares to serve.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "2975715.jpg",
    "o": "",
    "st": "allrecipes"
}