{
    "id": 231439,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 onions, cut into large chunks",
        "1 carrot, cut into large chunks",
        "2 pounds whitefish fillets",
        "1/2 cup cold water",
        "1/4 cup matzo meal",
        "1 egg",
        "2 egg whites",
        "2 teaspoons white sugar",
        "1 teaspoon vegetable oil",
        "1/2 teaspoon ground nutmeg",
        "1/4 teaspoon salt",
        "freshly ground black pepper to taste"
    ],
    "nut": [
        "Calories > 108 kcal",
        "Carbs > 5.4 g",
        "Cholesterol > 46 mg",
        "Fat > 4 g",
        "Protein > 12.2 g",
        "Sodium > 81 mg"
    ],
    "n": "Individual Servings of Gefilte Fish",
    "a": "slpscientist",
    "r": "0",
    "s": 16,
    "des": "\"This recipe is adapted from a recipe from 1988. One of the adaptations is changing it from a large loaf, which can fall apart and can be too large for most dinner parties, to individual muffin tin-sized servings. I've been making this for years and I have requests for it every Shabbat, which is saying a lot for gefilte fish! It's quite critical to have a food processor for this recipe.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace onions into a food processor and pulse a few times to coarsely chop. Transfer onions to a large bowl. Place carrot into food processor and pulse once or twice to chop; process until very finely chopped, about 30 seconds. Add carrot to onions. Place whitefish fillets into food processor and grind until the fish is a fine paste, about 2 minutes. Add fish to bowl.\nCombine onions, carrot, and whitefish with cold water, matzo meal, egg, egg whites, sugar, vegetable oil, nutmeg, salt, and black pepper, stirring to combine well. Spoon whitefish mixture into 16 muffin cups, filling them level with the top edge.\nBake in the preheated oven until gefilte fish cakes are set and a toothpick inserted into the center of a cake comes out clean, about 1 hour. Let cool in muffin cups, remove, cover, and refrigerate until chilled, at least 1 hour.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}