{
    "id": 231450,
    "old_rating": "3.375",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup uncooked brown rice",
        "water",
        "1/2 pound collard greens, chopped",
        "2 cloves garlic, peeled",
        "1 (10 ounce) package frozen okra",
        "1 (28 ounce) can whole peeled tomatoes, chopped, with liquid",
        "1 chayote squash, diced",
        "2 cloves garlic, crushed",
        "1/4 teaspoon ground ginger, or more to taste",
        "1/4 teaspoon dried dill weed, or more to taste",
        "1/4 teaspoon ground cumin, or to taste",
        "1 tablespoon chopped fresh cilantro, or to taste",
        "1 (16 ounce) can kidney beans, rinsed and drained",
        "1 (6 ounce) can tomato paste",
        "all-purpose flour, or as needed"
    ],
    "nut": [
        "Calories > 235 kcal",
        "Carbs > 48.8 g",
        "Cholesterol > 0 mg",
        "Fat > 1.5 g",
        "Protein > 10.5 g",
        "Sodium > 218 mg"
    ],
    "n": "Vegan Caribbean Stew",
    "a": "stronglive1",
    "r": "0",
    "s": 6,
    "des": "\"A warming, savory stew that makes use of the rich flavors and vegetables of the Caribbean.\"",
    "ins": "Bring brown rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low; cover and simmer until rice is tender and the liquid has been absorbed, 45 to 50 minutes.\nPlace collard greens and 2 peeled whole garlic cloves in a pot; add enough water to cover. Boil until collards are tender, about 15 minutes. Drain.\nCombine okra, tomatoes, chayote squash, and 2 crushed garlic cloves in a separate large pot; bring to a boil and cook until okra has thawed, about 5 minutes. Reduce to a simmer; season with ground ginger, dill weed, ground cumin, and cilantro to taste. Add collard greens; simmer until flavors have blended, at least 40 minutes (1 hour for best flavor).\nMash kidney beans together with tomato paste in a bowl; add to the stew. Stir in cooked rice and mix well. Add a spoonful of flour to thicken, if desired. Adjust seasonings to taste.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "1008813.jpg",
    "o": "",
    "st": "allrecipes"
}