{
    "id": 231434,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 tablespoon coconut oil",
        "2 large onions, sliced",
        "1 1/2 teaspoons Chinese five-spice powder",
        "1 pound lean ground turkey",
        "1 1/2 cups light coconut milk",
        "1 cup water",
        "1 cup jasmine rice",
        "1 cup pineapple tidbits",
        "6 large red bell peppers - halved, seeded, and stemmed",
        "6 slices Monterey Jack cheese, halved",
        "6 slices pepper jack cheese"
    ],
    "nut": [
        "Calories > 580 kcal",
        "Carbs > 48.7 g",
        "Cholesterol > 96 mg",
        "Fat > 29.4 g",
        "Protein > 30 g",
        "Sodium > 297 mg"
    ],
    "n": "Hawaiian Stuffed Peppers",
    "a": "Cindy",
    "r": "0",
    "s": 6,
    "des": "\"Peppers stuffed with lean ground turkey, caramelized onions, jasmine rice, and pineapple. I used fresh pineapple. You can use ground chicken as well.\"",
    "ins": "Heat olive oil and coconut oil in a skillet over low heat; cook and stir onions in the hot oil until tender and golden brown, about 1 hour. Remove caramelized onions from pan.\nIncrease heat under skillet to medium-high heat. Sprinkle Chinese five-spice powder over turkey. Cook and stir turkey in the hot skillet until browned and crumbly, about 10 minutes.\nMix coconut milk, water, rice, caramelized onions, and pineapple into the ground turkey. Bring to a boil, reduce heat to low, and simmer until rice is tender, about 25 minutes.\nPreheat oven to 400 degrees F (200 degrees C). Grease a 9x13-inch casserole dish.\nBring a pot of water to a boil; cook red bell pepper halves in the boiling water until slightly softened, about 10 minutes. Drain.\nArrange red bell pepper halves in the prepared casserole dish; spoon turkey mixture into each half. Top each stuffed pepper with a slice of pepper jack cheese.\nBake in the preheated oven until cheese is melted and bubbling, about 20 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "3612686.jpg",
    "o": "",
    "st": "allrecipes"
}