{
    "id": 231521,
    "old_rating": "4.72727",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (1 pound) flat iron steak",
        "1 1/2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon onion powder",
        "1 tablespoon vegetable oil, divided",
        "1/2 pound cremini mushrooms",
        "1/2 cup Burgundy wine",
        "1 cup beef stock",
        "1 tablespoon butter, softened",
        "1 tablespoon all-purpose flour",
        "1/2 cup heavy whipping cream",
        "2 tablespoons chopped fresh chives"
    ],
    "nut": [
        "Calories > 437 kcal",
        "Carbs > 6.8 g",
        "Cholesterol > 126 mg",
        "Fat > 30.7 g",
        "Protein > 27.9 g",
        "Sodium > 870 mg"
    ],
    "n": "Flat Iron Steak with Mushroom Sauce",
    "a": "ALRAYNA",
    "r": "0",
    "s": 4,
    "des": "\"A wonderful beefy flavored and inexpensive company-worthy flat iron steak with a creamy mushroom sauce. Wonderful served over roasted potatoes or a rice pilaf.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C).\nSprinkle both sides of flat iron steak with salt, black pepper, garlic powder, and onion powder. Heat a heavy, oven-proof skillet over medium-high heat, pour 2 teaspoons vegetable oil into the hot skillet, and heat until oil shimmers. Sear steak in the hot oil until well browned, about 3 minutes per side. Remove steak from pan and reduce heat to medium.\nPour 1 more teaspoon vegetable oil into skillet; cook and stir cremini mushrooms in hot oil until wilted and browned, about 10 minutes. Lower heat to medium-low; pour wine into mushrooms and bring to a boil. Cook until wine is slightly reduced, 3 to 5 minutes; add beef stock to vegetable mixture. Bring mixture to a simmer.\nStir butter and flour into a paste in a small bowl, using a fork. Stir flour paste into mushroom mixture and simmer until sauce is thickened, about 5 minutes. Place flat iron steak into skillet with mushroom sauce.\nPlace skillet in preheated oven and cook until steak is barely pink inside, about 10 minutes. Cut steak into thin slices on the diagonal and place meat on a platter.\nStir cream into mushroom sauce until heated through, 1 to 2 minutes; pour over steak and garnish with chives.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "1018429.jpg",
    "o": "",
    "st": "allrecipes"
}