{
    "id": 231566,
    "old_rating": "4.73913",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup warm water (100 to 110 degrees F/40 to 45 degrees C)",
        "1 (.25 ounce) package active dry yeast",
        "1 teaspoon honey",
        "1/2 cup milk",
        "1/4 cup chile-garlic sauce (such as Sriracha)",
        "1/4 cup warm water (100 to 110 degrees F/40 to 45 degrees C)",
        "1 egg, lightly beaten",
        "1 cup white whole wheat flour",
        "1/2 teaspoon salt",
        "1/2 cup shredded sharp Cheddar cheese",
        "2 1/2 cups bread flour",
        "1 tablespoon butter"
    ],
    "nut": [
        "Calories > 184 kcal",
        "Carbs > 30.5 g",
        "Cholesterol > 22 mg",
        "Fat > 3.8 g",
        "Protein > 7 g",
        "Sodium > 355 mg"
    ],
    "n": "Sriracha Cheese Bread",
    "a": "BigShotsMom",
    "r": "0",
    "s": 12,
    "des": "\"Don't be scared! This bakes up to a flavorful bread that will make a great ham sandwich, croque monsieur, or Monte Cristo. It is also good buttered to accompany soup.\"",
    "ins": "Combine 1/4 cup warm water, yeast, and honey in work bowl of a stand mixer, stirring to dissolve honey. Let stand until yeast forms a creamy layer, about 10 minutes. Beat milk, chile-garlic sauce, and 1/4 cup warm water into yeast mixture; mix in egg.\nBeat white whole wheat flour into liquid ingredients on low speed until flour is moistened; let stand 10 minutes for flour to absorb moisture. Add salt, Cheddar cheese, and 2 cups bread flour to bowl and mix until thoroughly incorporated. Continue to beat remaining bread flour into dough, 1 tablespoon at a time, until the dough forms a ball and separates from the side of the mixing bowl. Add Set the mixer to medium-low speed and knead for 10 minutes. Dough should be slightly sticky.\nShape dough into a ball and place into an oiled bowl; turn dough ball around in the bowl to coat dough lightly with oil. Cover with a cloth and set into a warm place to rise until doubled, 1 hour to 1 hour and 15 minutes.\nGently punch down dough to break bubbles and pat out on a floured work surface to a 9x12-inch rectangle. Roll dough tightly in a spiral, starting at a 9-inch edge; pinch seams together to form a log. Place dough into a 5x9-inch loaf pan with seam side down and tuck ends of dough underneath neatly. Cover with a cloth and let rise until dough top clears the sides of the pan, 30 to 45 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nBake the bread in the preheated oven until the loaf sounds hollow when tapped and the crust is golden brown, about 30 minutes. Spread top of hot loaf with butter to make a soft crust; let cool in the pan.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "1001590.jpg",
    "o": "4467727.jpg,4467725.jpg,2769163.jpg,2373073.jpg,2301695.jpg,1116616.jpg",
    "st": "allrecipes"
}