{
    "id": 231556,
    "old_rating": "4.88235",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 fresh peaches, cut into 1/2-inch pieces",
        "4 teaspoons finely minced fresh basil",
        "1 tablespoon brown sugar",
        "1 1/2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 cup shredded extra-sharp Cheddar cheese (such as SargentoÂ® Off the Block)",
        "1/2 cup butter, room temperature",
        "7 tablespoons brown sugar",
        "2 eggs, room temperature",
        "1/4 cup shredded extra-sharp Cheddar cheese (such as SargentoÂ® Off the Block)"
    ],
    "nut": [
        "Calories > 225 kcal",
        "Carbs > 23.4 g",
        "Cholesterol > 64 mg",
        "Fat > 12.4 g",
        "Protein > 5.7 g",
        "Sodium > 355 mg"
    ],
    "n": "Summer Peach, Basil & Cheddar Muffins",
    "a": "LilSnoo",
    "r": "0",
    "s": 12,
    "des": "\"Nothing says summer like a ripe, juicy peach and fresh fragrant basil. I love pairing fruits with cheese, and these were inspired by apple cheddar muffins my mom used to make. These savory sidekicks have just a hint of sweetness and make the perfect addition to your summer brunch table!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease 12 muffin cups or line with paper liners.\nMix peaches, basil, and 1 tablespoon brown sugar in a bowl; let sit until sugar dissolves, about 15 minutes.\nSift flour, baking powder, baking soda, and salt together in a large bowl. Mix 1 cup Cheddar cheese into flour mixture.\nBeat butter and 7 tablespoons brown sugar in a bowl with an electric mixer until smooth and creamy. Add eggs, one at a time, until just combined; gently fold in peaches. Mix flour mixture, a little at time, into peach mixture until batter is just combined.\nSpoon batter into the prepared muffin cups. Sprinkle 1/4 cup Cheddar cheese over batter.\nBake in the preheated oven until a toothpick inserted in the middle of a muffin comes out clean, about 25 minutes.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "974261.jpg",
    "o": "",
    "st": "allrecipes"
}