{
    "id": 231568,
    "old_rating": "4.22222",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 ounces whole wheat orzo pasta",
        "12 large orange bell peppers",
        "2 tablespoons butter",
        "1 tablespoon olive oil",
        "10 cloves garlic, thinly sliced",
        "1 (8 ounce) package sliced fresh white mushrooms",
        "1 (8 ounce) package sliced cremini mushrooms",
        "2 tablespoons balsamic vinegar",
        "1 (28 ounce) can diced Italian paste tomatoes (such as San Marzano)",
        "1 (14 ounce) can whole Italian paste tomatoes (such as San Marzano), drained and torn into large chunks",
        "1 cup shredded mozzarella cheese",
        "1 zucchini, shredded",
        "1/2 cup grated Parmesan cheese",
        "8 cloves garlic, minced",
        "2 tablespoons dried oregano",
        "2 tablespoons torn fresh basil leaves",
        "2 teaspoons red pepper flakes",
        "salt and ground black pepper to taste",
        "4 cups vegetable broth",
        "3/4 cup grated Parmesan cheese, divided"
    ],
    "nut": [
        "Calories > 232 kcal",
        "Carbs > 30.4 g",
        "Cholesterol > 18 mg",
        "Fat > 8 g",
        "Protein > 12.5 g",
        "Sodium > 508 mg"
    ],
    "n": "Irresistible Healthy Vegetarian Stuffed Peppers",
    "a": "laurieish",
    "r": "0",
    "s": 12,
    "des": "\"This is an absolutely delicious vegetarian pepper recipe that is packed with nutrients! I love to make a big batch on Sunday, freeze some for easy and decadent (but healthy!) dinners, and keep a couple in the refrigerator for weekday work lunches. I haven't met anyone that doesn't go nuts for these; in fact, I now have to make extra for friends' lunches (hence the giant batch!)\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook orzo in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain orzo and transfer to a large bowl.\nPreheat oven to 400 degrees F (200 degrees C).\nCut a 1-inch slice from tops of orange bell peppers, discard tops, and remove seeds from peppers. Set peppers upright into a roasting pan, fitting them tightly so they stay in place.\nMelt butter and olive oil over medium-low heat; cook and stir 10 cloves of garlic in the hot butter mixture until garlic is golden brown, about 8 minutes. Stir white and cremini mushrooms and balsamic vinegar into garlic. Cook and stir until mushrooms soften, about 10 minutes. Drain liquid and mix mushrooms and garlic into orzo.\nMix diced tomatoes and their juice, torn whole tomatoes, mozzarella cheese, zucchini, 1/2 cup Parmesan cheese, 8 cloves garlic, oregano, basil, red pepper flakes, salt, and black pepper into orzo mixture. Scoop into bell peppers. Pour vegetable broth into bottom of roasting pan and cover pan tightly with aluminum foil.\nBake in the preheated oven until peppers are tender and filling is cooked through, about 50 minutes. Remove foil and sprinkle each pepper with 1 tablespoon Parmesan cheese. Return to oven and bake uncovered until Parmesan cheese topping is golden and bubbly, about 15 more minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1677095.jpg",
    "o": "",
    "st": "allrecipes"
}