{
    "id": 231555,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butternut squash - peeled, seeded, and cut into 1-inch pieces",
        "2 tablespoons olive oil",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 (16 ounce) package linguine",
        "1/2 cup unsalted butter",
        "2 cloves garlic, minced",
        "1/4 cup pine nuts",
        "4 cups arugula",
        "1 cup freshly grated Parmesan cheese",
        "1/4 teaspoon ground black pepper",
        "1 tablespoon freshly grated Parmesan cheese, or to taste"
    ],
    "nut": [
        "Calories > 414 kcal",
        "Carbs > 44.5 g",
        "Cholesterol > 40 mg",
        "Fat > 21.5 g",
        "Protein > 13.2 g",
        "Sodium > 316 mg"
    ],
    "n": "Winter Pasta with Brown Butter, Squash, and Arugula",
    "a": "stefychefy",
    "r": "0",
    "s": 8,
    "des": "\"This pasta is hearty and perfect for a winter meal, however it's so good you'll likely make this all year round!\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nSpread squash into a baking sheet. Drizzle olive oil and sprinkle salt and 1/4 teaspoon black pepper over squash; toss to coat.\nRoast in the preheated oven until squash is browned and softened, about 30 minutes. Remove from oven and keep warm.\nBring a large pot of lightly salted water to a boil; cook the linguine at a boil until tender yet firm to the bite, 10 to 11 minutes. Drain linguine, reserving 1 cup pasta water.\nMelt butter in a pot over medium heat until bubbling and slightly browned, about 5 minutes. Cook and stir garlic and pine nuts in the brown butter until fragrant, 2 minutes. Add linguine, arugula, 1 cup Parmesan cheese, 1/4 teaspoon black pepper, and enough pasta water to moisten to the mixture. Toss until Parmesan cheese melts.\nTransfer linguine mixture to serving plates and top with roasted squash and 1 tablespoon Parmesan cheese.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "1910410.jpg",
    "o": "",
    "st": "allrecipes"
}