{
    "id": 231533,
    "old_rating": "4.31148",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (7.25 ounce) package macaroni and cheese",
        "1/4 cup butter",
        "1/4 cup milk",
        "1 (10.75 ounce) can cream of mushroom soup",
        "1 (5 ounce) can tuna, drained and flaked",
        "1/2 cup milk",
        "1 cup shredded Cheddar cheese",
        "1 tablespoon minced fresh parsley, or to taste (optional)",
        "1/4 cup bread crumbs",
        "1/4 cup butter, melted",
        "1/2 teaspoon dried dill weed, or to taste (optional)"
    ],
    "nut": [
        "Calories > 438 kcal",
        "Carbs > 31.4 g",
        "Cholesterol > 74 mg",
        "Fat > 26.9 g",
        "Protein > 18.1 g",
        "Sodium > 882 mg"
    ],
    "n": "Easy Macaroni Tuna Casserole",
    "a": "Lorene Rohrbaugh",
    "r": "0",
    "s": 6,
    "des": "\"This dish is super easy. It is also a very hearty delicious bowl of comfort food. The guys in my house loved it. I loved this recipe but I used cream of mushroom soup and added the cheese into the casserole. I also melted butter and added bread crumbs to the top before baking, then sprinkle top lightly with dill seasoning. The resulting casserole was very creamy and flavorful.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2-quart baking dish.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain and return macaroni to pot.\nStir 1/4 cup butter, 1/4 cup milk, and powdered cheese from envelope into the cooked macaroni. Stir cream of mushroom soup, tuna, and 1/2 cup milk into the macaroni and cheese. Pour macaroni mixture into the prepared baking dish; top with Cheddar cheese and parsley.\nMix bread crumbs, melted butter, and dill in a small bowl; sprinkle over Cheddar cheese layer.\nBake in the preheated oven until cheese is melted and bread crumb topping is lightly browned, about 20 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "2100878.jpg",
    "o": "4521262.jpg,4503847.jpg,4503414.jpg,4470042.jpg,4446085.jpg,4446045.jpg",
    "st": "allrecipes"
}