{
    "id": 23159,
    "old_rating": "4.28834",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound dry ziti pasta",
        "2 tablespoons olive oil",
        "4 tablespoons butter",
        "1/4 cup grated Parmesan cheese",
        "1 dash ground nutmeg",
        "salt and pepper to taste",
        "3 eggs, lightly beaten",
        "2 tablespoons butter",
        "1 large onion, chopped",
        "1 clove garlic, crushed",
        "1 1/2 pounds lean ground beef",
        "1/4 cup tomato paste",
        "1/2 cup dry red wine",
        "1/2 cup vegetable broth",
        "2 tablespoons chopped fresh parsley",
        "salt and pepper to taste",
        "1/2 cup butter",
        "1/2 cup all-purpose flour",
        "3 cups milk",
        "1/4 teaspoon ground nutmeg",
        "1 egg, lightly beaten",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 739 kcal",
        "Carbs > 57.3 g",
        "Cholesterol > 207 mg",
        "Fat > 41.3 g",
        "Protein > 31.1 g",
        "Sodium > 444 mg"
    ],
    "n": "Pastitsio II",
    "a": "ALKHATIB",
    "r": "0",
    "s": 8,
    "des": "\"Makes a lot and is just incredible.  Everyone loves this dish and it is worth the effort.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add ziti and cook for 8 to 10 minutes or until al dente; drain and return to pan.\nMelt butter until golden brown and pour over ziti, add 1/4 cup of the Parmesan cheese, nutmeg, salt, pepper and toss well; allow to cool.  Add eggs and toss again; set aside.\nTo make meat sauce: Gently fry onion and garlic in butter in a skillet until onion is soft. Increase heat and add ground beef; stir well.  Cook until meat begins to brown.  Add tomato paste, wine, broth, parsley, salt and pepper.  Cover and simmer over low heat for 20 minutes.\nTo make cream sauce:  Melt butter in saucepan, stir in flour and cook gently for 2 minutes. Pour in milk all at once and bring to a boil, stirring constantly.  Boil gently for 1 minute.  Add nutmeg, salt, pepper and cool slightly before stirring in beaten egg.  Transfer 1/2 cup of this sauce to the meat sauce.\nTo assemble  pastitsio: Grease a 9x13 inch baking dish.  Spoon half of the prepared ziti evenly in the bottom and top with meat sauce.  Top that with remaining ziti.  Pour on cream sauce and spread to completely cover ziti.  Sprinkle remaining cheese on top.\nBake in a preheated oven for 50 minutes or until golden brown.  Let stand 10 minutes before cutting into squares to serve.",
    "pt": "45 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "4349556.jpg",
    "o": "4349556.jpg,4349302.jpg,3866835.jpg,3658528.jpg,3607935.jpg,3258896.jpg",
    "st": "allrecipes"
}