{
    "id": 231514,
    "old_rating": "4.73485",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon salt",
        "4 large green bell peppers - tops, seeds, and membranes removed",
        "1 tablespoon olive oil",
        "1/2 cup chopped onion",
        "2 cups cooked rice",
        "1 (15 ounce) can black beans, drained and rinsed",
        "1 (14.5 ounce) can chili-style diced tomatoes",
        "1 teaspoon chili powder",
        "1 teaspoon garlic salt",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon salt",
        "1 (8 ounce) package shredded Mexican cheese blend (such as SargentoÂ® Authentic Mexican)"
    ],
    "nut": [
        "Calories > 509 kcal",
        "Carbs > 55.5 g",
        "Cholesterol > 55 mg",
        "Fat > 22.8 g",
        "Protein > 23.8 g",
        "Sodium > 3756 mg"
    ],
    "n": "Vegetarian Mexican Inspired Stuffed Peppers",
    "a": "donnam",
    "r": "0",
    "s": 4,
    "des": "\"I created this so it's not too spicy, but is packed with flavor. My kids loved it! For variety, add corn or other vegetables or switch to other chopped tomato varieties (chiles, jalapenos, etc.). Follow the boiling method prior to baking if you don't want a crispy bell pepper. If you have small peppers, use more of them for this recipe. They taste great with a dollop of sour cream on top.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of water and 1 tablespoon salt to a boil; cook green bell peppers in the boiling water until slightly softened, 3 to 4 minutes. Drain.\nHeat olive oil in a skillet over medium heat; cook and stir onion in the hot oil until softened and transparent, 5 to 10 minutes.\nMix rice, black beans, tomatoes, and cooked onion in a large bowl. Add chili powder, garlic salt, cumin, 1/2 teaspoon salt; stir until evenly mixed. Fold 1 1/2 cups Mexican cheese blend into rice mixture. Spoon rice mixture into each bell pepper; arrange peppers in 9x9-inch baking dish. Sprinkle peppers with remaining Mexican cheese blend.\nBake in the preheated oven until cheese is melted and bubbling, about 30 minutes.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "4541618.jpg",
    "o": "4541618.jpg,4539300.jpg,4537745.jpg,4508611.jpg,4508551.jpg,4501561.jpg",
    "st": "allrecipes"
}