{
    "id": 231617,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray (such as PamÂ®)",
        "6 whole wheat tortillas",
        "1 (10.75 ounce) can  cream of mushroom soup",
        "1/2 (16 ounce) jar green taco sauce",
        "1 (4 ounce) can chopped green chilies",
        "2 green onions, chopped",
        "3 roasted skinless chicken breasts, shredded",
        "1 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 610 kcal",
        "Carbs > 67.6 g",
        "Cholesterol > 113 mg",
        "Fat > 22.9 g",
        "Protein > 45.9 g",
        "Sodium > 2303 mg"
    ],
    "n": "Easy Chicken Enchiladas",
    "a": "A.Meyer",
    "r": "0",
    "s": 3,
    "des": "\"Great to assemble the night before and have ready to pop in the oven after work. Garnish as desired. Serve with Spanish-style rice.\"",
    "ins": "Prepare a 13x9-inch baking dish with cooking spray.\nWrap tortillas in paper towels moistened with water; cook in microwave until soft, about 20 seconds.\nStir mushroom soup, taco sauce, green chiles, and green onions together in a bowl. Fold chicken into the soup mixture.\nSpread chicken mixture into each tortilla, sprinkle small amount of cheese over portion of the chicken mixture, and roll the tortilla around the filling; place with the seam side down in the prepared baking dish. Spread remaining chicken mixture over the rolled tortillas. Sprinkle remaining Cheddar cheese over the chicken mixture.\nCover baking dish with aluminum foil; refrigerate at least 12 hours to overnight.\nRemove baking dish from refrigerator. Keep dish at room temperature for 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven for 30 minutes. Remove aluminum foil and continue baking until the cheese begins to brown along the edges, about 15 minutes more.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "13 h ",
    "i": "1952397.jpg",
    "o": "",
    "st": "allrecipes"
}