{
    "id": 231613,
    "old_rating": "4.64103",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray with flour",
        "1 cup all-purpose flour",
        "3/4 cup dark cocoa powder (such as Hershey'sÂ® Special Dark)",
        "1/4 teaspoon salt",
        "8 ounces bittersweet chocolate (such as GhirardelliÂ®), chopped",
        "3/4 cup white chocolate chips (such as GhirardelliÂ®)",
        "6 tablespoons butter at room temperature, cut into cubes",
        "1 cup white sugar",
        "4 eggs, room temperature",
        "1 1/4 cups Irish stout beer (such as GuinnessÂ® Extra Stout), room temperature and foam skimmed off",
        "1/2 cup chopped pecans (optional)",
        "1 cup semisweet chocolate chips (such as NestleÂ® Toll HouseÂ®)",
        "1 tablespoon sifted confectioners' sugar, or as needed"
    ],
    "nut": [
        "Calories > 236 kcal",
        "Carbs > 27.9 g",
        "Cholesterol > 40 mg",
        "Fat > 13.1 g",
        "Protein > 3.8 g",
        "Sodium > 64 mg"
    ],
    "n": "Dark GuinnessÂ® Brownies",
    "a": "J. Evans",
    "r": "0",
    "s": 24,
    "des": "\"Delicate, dark, rich, and tempting brownies that no one can resist are made with what you would not expect: GuinnessÂ® beer. Oh so good.\"",
    "ins": "Place oven rack in the center position. Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nWhisk flour, cocoa powder, and salt together in a bowl.\nMelt bittersweet chocolate, white chocolate chips, and butter in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Remove from heat.\nBeat white sugar and eggs together in a large bowl with an electric mixer until light and fluffy, about 3 minutes. Slowly add melted chocolate mixture and beat until just combined. Add flour mixture, 2 to 3 tablespoons at a time, until just combined. Whisk in beer until batter is thin; fold in pecans.\nPour batter into the prepared baking dish; sprinkle semisweet chocolate chips over batter.\nBake in the preheated oven until a toothpick inserted in the center of the brownies comes out with moist crumbs, 25 to 30 minutes. Cool to room temperature; dust top with confectioners' sugar.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "1349798.jpg",
    "o": "4521183.jpg,4521179.jpg,4488314.jpg,4486602.jpg,4197920.jpg,3892021.jpg",
    "st": "allrecipes"
}