{
    "id": 231643,
    "old_rating": "4.65143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 carrots, shredded",
        "2 bananas, mashed",
        "1 zucchini, shredded",
        "1/4 cup vegetable oil",
        "1/4 cup yogurt",
        "2 eggs",
        "1 cup whole wheat flour",
        "1 1/2 teaspoons baking soda",
        "1/2 cup packed brown sugar",
        "1/2 cup rolled oats",
        "1/2 cup shredded coconut",
        "1/2 cup chopped pecans",
        "1/2 cup dried cherries",
        "1 teaspoon ground cinnamon",
        "1 teaspoon salt",
        "1/2 teaspoon ground ginger"
    ],
    "nut": [
        "Calories > 227 kcal",
        "Carbs > 31.7 g",
        "Cholesterol > 31 mg",
        "Fat > 10.1 g",
        "Protein > 4.5 g",
        "Sodium > 388 mg"
    ],
    "n": "Hearty Breakfast Muffins",
    "a": "KatieTries2Cook",
    "r": "0",
    "s": 12,
    "des": "\"Healthy, hearty breakfast muffins. These have a lightly sweet flavor and lots of wholesome ingredients to get your day started. Moist, chewy, and not overly dense. Easily customizable! You can use any flavor of yogurt, but I prefer plain Greek yogurt. Customize with your favorite nuts or seeds, zucchini or squash, cooked sweet potato, raisins or cranberries, etc. Enjoy!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease 12 muffin cups or line with paper liners.\nMix carrots, banana, zucchini, vegetable oil, yogurt, and eggs together until fully incorporated.\nWhisk flour and baking soda in a separate bowl. Mix brown sugar, oats, coconut, pecans, cherries, cinnamon, salt, and ginger into flour mixture until all ingredients are coated in flour. Stir wet ingredients into flour mixture until just combined. Scoop batter into the prepared muffin cups.\nBake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean and edges are slightly brown, 17 to 22 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "1041197.jpg",
    "o": "4522156.jpg,4468439.jpg,4381651.jpg,3837060.jpg,3804530.jpg,3556579.jpg",
    "st": "allrecipes"
}