{
    "id": 231667,
    "old_rating": "4.2381",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Topping:",
        "1 small yellow onion, thinly sliced",
        "1 cup peeled and thinly sliced baking apples (preferably Cortland)",
        "2 tablespoons olive oil, or as needed",
        "1 tablespoon apple cider vinegar",
        "2 teaspoons dried thyme",
        "2 teaspoons dried rosemary",
        "1 pinch brown sugar, or to taste",
        "Pork Chops:",
        "3 pork chops",
        "salt and ground black pepper to taste",
        "1 pinch paprika, or more to taste",
        "1 tablespoon apple cider vinegar",
        "1 tablespoon olive oil"
    ],
    "nut": [
        "Calories > 315 kcal",
        "Carbs > 9.6 g",
        "Cholesterol > 45 mg",
        "Fat > 25.6 g",
        "Protein > 11.9 g",
        "Sodium > 18 mg"
    ],
    "n": "Autumn Apple Onion Pork Chops",
    "a": "tygrlilly",
    "r": "0",
    "s": 3,
    "des": "\"This is a fairly common autumn dish in Indiana. It always reminds me of local harvest festivals. Crimson and gold leaves under foot, hay rides, the crisp sweet smell of the air...comfort food, pure and simple. There are many variations, but this is the favorite in our home. To be honest, I've never measured the spices before I sat down to write this, so please feel free to adjust to your own tastes.\"",
    "ins": "Combine onion, apple, 2 tablespoons olive oil, 1 tablespoon vinegar, thyme, and rosemary in a skillet; cook and stir mixture over medium heat until onion is lightly browned and apples are softened, about 15 minutes. Sweeten with brown sugar to taste. Set aside and keep warm.\nArrange pork chops in a separate skillet; season with salt, pepper, and paprika. Drizzle 1 tablespoon vinegar and 1 tablespoon olive oil over pork chops. Cook pork chops over medium heat until no longer pink in the center, about 5 minutes per side. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\nTransfer pork chops to a serving dish and top with apple-onion topping. Serve immediately.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "1038920.jpg",
    "o": "",
    "st": "allrecipes"
}