{
    "id": 231641,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon salt, or as needed",
        "2 eggplants,cut into 1-inch thick slices",
        "1/4 cup olive oil",
        "2 cloves garlic, crushed",
        "1 teaspoon finely chopped fresh oregano",
        "1 teaspoon finely chopped fresh mint",
        "ground black pepper to taste",
        "4 tomatoes, cut into 1/2-inch slices",
        "1 cup grated Kasseri cheese"
    ],
    "nut": [
        "Calories > 320 kcal",
        "Carbs > 21.2 g",
        "Cholesterol > 30 mg",
        "Fat > 23.3 g",
        "Protein > 11 g",
        "Sodium > 859 mg"
    ],
    "n": "Grilled Eggplant Stack with Greek Kasseri Cheese",
    "a": "VeronikaEats",
    "r": "0",
    "s": 4,
    "des": "\"Serve these eggplant stacks as an elegant appetizer, for lunch, or even as a light dinner. There are many variations out there, most of them Italian-inspired. They usually include tomato sauce, basil, and provolone or mozzarella cheese. The Greek flavors in this version got great reviews from my family. The simple and healthy dish is a combination of classic Mediterranean ingredients such as eggplant, ripe tomatoes, oregano, mint, and Greek Kasseri cheese. Serve it with olives, hot pita bread, and maybe some Greek yogurt on the side.\"",
    "ins": "Lightly sprinkle salt over eggplant slices and place in a colander until salt has drawn out excess moisture, about 30 minutes. Rinse eggplant slices and pat dry with a paper towel.\nPreheat an outdoor grill for medium heat and lightly oil the grate.\nWhisk olive oil, garlic, oregano, mint, and black pepper together in a bowl. Brush eggplant and tomato slices with oil mixture.\nCook eggplant slices on the preheated grill until softened and show grill marks, 2 to 4 minutes. Cook tomatoes just until warmed, 1 to 2 minutes.\nPreheat oven to 370 degrees F (188 degrees C). Line a baking sheet with parchment paper.\nAssemble stacks on the prepared baking sheet starting with 1 eggplant slice on the bottom, 1 tomato slice atop the eggplant slice, and a layer of Kasseri cheese on top. Repeat 3 times ending with a generous sprinkling of Kasseri cheese. Repeat with remaining ingredients.\nBake in the preheated oven until cheese is melted and bubbling, 5 to 10 minutes.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}