{
    "id": 231653,
    "old_rating": "4.60526",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup all-purpose flour",
        "1 cup whole wheat flour",
        "1 tablespoon chia seeds",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground ginger",
        "1/2 cup unsalted butter, room temperature",
        "1/2 cup brown sugar, or to taste",
        "1/4 cup white sugar, or to taste",
        "1 egg",
        "1 banana",
        "2 cups grated carrots",
        "1 tablespoon grated orange zest",
        "3/4 cup cranberries, or more to taste"
    ],
    "nut": [
        "Calories > 216 kcal",
        "Carbs > 33.6 g",
        "Cholesterol > 34 mg",
        "Fat > 8.4 g",
        "Protein > 3.3 g",
        "Sodium > 254 mg"
    ],
    "n": "Carrot and Cranberry Muffins",
    "a": "briatherese",
    "r": "0",
    "s": 12,
    "des": "\"I wanted a healthy breakfast muffin option that wasn't dry! The carrots give this such a delicious and moist texture. A lot can be added or left out of this recipe depending on taste and personal preference; popular options to include are raisins, ground nuts, or chocolate chips.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line 12 muffin cups with paper liners.\nMix all-purpose flour, whole wheat flour, chia seeds, baking powder, salt, cinnamon, nutmeg, and ginger together in a large bowl.\nBeat butter, brown sugar, and white sugar together with an electric mixer in a large bowl until light and fluffy. Beat egg into the butter mixture. Mash banana into the butter mixture until smoothly incorporated. Fold carrot and orange zest into the mixture.\nMix flour mixture into the butter mixture about 1/2 cup at a time to make a batter. Fold cranberries into the batter. Divide evenly between prepared muffin cups to fill nearly to the top.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 30 minutes. Cool in the pans for 5 minutes before removing to cool completely on a wire rack.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "3791662.jpg",
    "o": "",
    "st": "allrecipes"
}