{
    "id": 231621,
    "old_rating": "4.82143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon ground cayenne pepper",
        "6 chicken breast tenderloins",
        "1 egg",
        "1 tablespoon half-and-half",
        "1 cup seasoned bread crumbs",
        "1/2 cup panko bread crumbs",
        "1/2 cup grated Parmesan cheese",
        "1 tablespoon minced fresh flat-leaf parsley",
        "2 tablespoons olive oil",
        "3 quarts water",
        "1 tablespoon salt",
        "6 ounces angel hair pasta",
        "1 1/2 cups prepared marinara sauce, divided",
        "3 ounces shredded Italian cheese blend"
    ],
    "nut": [
        "Calories > 695 kcal",
        "Carbs > 79.6 g",
        "Cholesterol > 121 mg",
        "Fat > 24.6 g",
        "Protein > 40.8 g",
        "Sodium > 3504 mg"
    ],
    "n": "My Chicken Parmesan",
    "a": "janice tofuri",
    "r": "0",
    "s": 4,
    "des": "\"My Italian husband says this is his absolute favorite dinner. Parmesan-coated chicken swimming in a pool of pasta and sauce with a blanket of melted shredded Italian-blend cheese over all.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a baking dish.\nCombine flour, 1/2 teaspoon salt, garlic powder, black pepper, and cayenne pepper in a resealable plastic bag. Place chicken tenderloins into flour mixture, seal the bag, and shake to coat.\nBeat egg and half-and-half thoroughly in a shallow bowl. Mix seasoned break crumbs, panko crumbs, Parmesan cheese, and parsley in another bowl. Dip floured chicken tenderloins into beaten egg, let excess egg drip off, then press chicken into crumb mixture to coat. Let chicken stand for 10 minutes to set coating.\nHeat olive oil in a large skillet over medium heat; cook chicken tenderloins until the juices run clear, chicken is no longer pink inside, and coating is golden brown, about 5 minutes per side.\nBring water and 1 tablespoon salt to a boil in a large pot; stir angel hair pasta into boiling water. Cook pasta, stirring occasionally, until cooked through, about 5 minutes. Drain.\nPour 3/4 cup marinara sauce into prepared baking dish; top sauce with cooked angel hair pasta. Pour remaining 3/4 cup sauce over pasta and arrange chicken tenderloins over sauce. Sprinkle Italian cheese blend over chicken.\nBake in the preheated oven until cheese topping is melted and bubbling, about 10 minutes.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "1 h",
    "i": "4534698.jpg",
    "o": "4527063.jpg,4467470.jpg,4098774.jpg,2995778.jpg,2794343.jpg,2678032.jpg",
    "st": "allrecipes"
}