{
    "id": 231713,
    "old_rating": "4.89583",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons butter",
        "3 cups diced mushrooms",
        "salt to taste",
        "1/2 yellow onion, diced",
        "ground black pepper to taste",
        "1 pinch cayenne pepper",
        "1 cup carnaroli rice",
        "2 cups chicken broth, divided",
        "1/2 cup heavy whipping cream",
        "1/2 cup chicken broth",
        "2 tablespoons heavy whipping cream",
        "1/2 cup finely grated Parmigiano-Reggiano cheese",
        "2 tablespoons chopped fresh chives"
    ],
    "nut": [
        "Calories > 478 kcal",
        "Carbs > 50.9 g",
        "Cholesterol > 86 mg",
        "Fat > 25.8 g",
        "Protein > 11 g",
        "Sodium > 832 mg"
    ],
    "n": "Chef John's Baked Mushroom Risotto",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"The beginning and the end of this risotto recipe are pretty standard, but we've moved the middle 15 minutes into the oven in an attempt to eliminate those dreaded 'variables.'  Besides being easier and more repeatable, this method produced a risotto that was identical in looks, taste, and texture to anything I can do on the stove.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nMelt butter in large, oven-proof skillet over medium-high heat. Add mushrooms; season with salt, and cook and stir mushrooms until brown. They will begin browning after the moisture evaporates.\nReduce heat to medium and stir in onion. Sprinkle with black pepper and cayenne pepper. Cook and stir until onions are translucent and soft.\nPour rice into skillet and stir until each rice grain is coated with butter. Season with salt.\nPour 1 cup chicken broth into the rice mixture. Raise heat to medium-high and cook, stirring rice until liquid is completely absorbed by the rice.\nPour another cup chicken stock into the rice and stir until mixture comes to a simmer.\nBake in preheated oven until grains are almost tender but still slightly firm, about 15 minutes. Transfer skillet to stovetop. Season with more salt, if necessary.\nCombine the remaining 1/2 cup chicken broth and cream; pour into the skillet. Cook on medium heat, stirring constantly until rice is tender, 1 or 2 minutes. Remove skillet from heat.\nDrizzle 2 tablespoons cream over rice. Add the grated Parmigiano-Reggiano and chives; stir. Serve immediately.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "45 m",
    "i": "4536085.jpg",
    "o": "4536085.jpg,4536081.jpg,4477326.jpg,4090661.jpg,4087531.jpg,3683719.jpg",
    "st": "allrecipes"
}