{
    "id": 231750,
    "old_rating": "4.48276",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 cups small red and yellow potatoes",
        "3 tablespoons butter",
        "1/4 cup chopped green onion",
        "1/4 cup all-purpose flour",
        "2 cups milk",
        "1 teaspoon salt",
        "1 cup shredded Cheddar cheese, or more to taste",
        "1 pinch salt and ground black pepper to taste",
        "1 cup chopped fresh spinach",
        "1 tablespoon diced pimento pepper",
        "4 slices cooked bacon, crumbled"
    ],
    "nut": [
        "Calories > 276 kcal",
        "Carbs > 23.6 g",
        "Cholesterol > 43 mg",
        "Fat > 14.9 g",
        "Protein > 12.2 g",
        "Sodium > 698 mg"
    ],
    "n": "Spinach, Potatoes, and Bacon Au Gratin",
    "a": "Patricia Feeney Monson",
    "r": "0",
    "s": 8,
    "des": "\"I wanted something different, other than scalloped or au gratin potatoes, and liked the different colors of the potatoes and spinach. A nice side dish for holiday baked ham. Nice because I did it all ahead of time and then just reheated it.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace potatoes into a large pot, cover with water, and bring to a boil. Cook potatoes until tender and still firm, about 15 minutes; drain and set aside to cool.\nMelt butter in a saucepan over medium heat; cook and stir green onion in the hot butter until softened, 1 to 2 minutes. Whisk flour into green onion and butter; gradually stir in milk, whisking constantly, until mixture is thickened and bubbly. Stir salt and Cheddar cheese into sauce, mixing until cheese has melted.\nSlice potatoes and place about half the potatoes into the bottom of a casserole dish; sprinkle with salt and black pepper. Layer half the spinach and half the pimentos over potatoes and pour half the cheese sauce over the spinach. Repeat layers, ending with remaining cheese sauce. Cover casserole dish tightly with aluminum foil.\nBake in the preheated oven until bubbling, about 50 minutes; uncover dish and continue baking until browned on top, 5 to 10 more minutes. Sprinkle with crumbled bacon.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1101823.jpg",
    "o": "",
    "st": "allrecipes"
}