{
    "id": 231751,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 pounds boneless beef chuck roast, cut into 11/2-inch cubes",
        "2 tablespoons vegetable oil",
        "1/4 cup all-purpose flour",
        "2 pinches salt and ground black pepper, or to taste",
        "2 pinches cayenne pepper",
        "1/4 cup vegetable oil",
        "2 yellow onions, chopped",
        "4 cloves garlic, crushed",
        "1/4 cup tomato paste",
        "1 teaspoon water, or as needed",
        "3 cups Irish stout beer (such as GuinnessÂ®), divided",
        "2 sprigs fresh thyme",
        "4 large potatoes, chopped",
        "2 cups chopped carrot",
        "2 tablespoons chopped fresh parsley"
    ],
    "nut": [
        "Calories > 527 kcal",
        "Carbs > 37.2 g",
        "Cholesterol > 82 mg",
        "Fat > 28.4 g",
        "Protein > 25.8 g",
        "Sodium > 133 mg"
    ],
    "n": "GuinnessÂ® Irish Stew",
    "a": "mycocinamykitchen",
    "r": "0",
    "s": 10,
    "des": "\"With this wonderful cool weather arriving this recipe is a perfect hearty Irish comfort food. After cooking and enjoying the great flavors, it reminded me and brought back warm thoughts of the mutton stew I had in Dublin, Ireland last year! Irish stew, is traditionally made of lamb or mutton, potatoes, onions, and parsley. But I am using beef. Original Irish stew was a thick and hearty meal, meant to keep a body warm and on your feet for many hours of hard work.\"",
    "ins": "Toss beef cubes with 2 tablespoons vegetable oil in a bowl.\nWhisk flour, salt, black pepper, and cayenne pepper in a separate bowl. Dredge beef cubes through flour mixture until evenly coated.\nHeat 1/4 cup vegetable oil in a large skillet over medium-high heat; cook and stir coated beef cubes, working in batches, until beef is browned on all sides, 5 to 10 minutes. Transfer browned beef to a Dutch oven or heavy-bottomed pot.\nCook and stir onions and garlic in the same skillet used for browning beef until lightly browned, 5 to 10 minutes.\nStir tomato paste with enough water to partially dilute; pour into onion mixture. Stir to blend. Reduce heat to medium, cover Dutch oven, and simmer for 5 minutes.\nPour half the Irish stout into the onion mixture, and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Transfer entire mixture to the browned beef. Pour remaining half of Irish stout into beef mixture; add thyme.\nCover Dutch oven, reduce heat to low, and simmer for 2 hours. Add potatoes and carrots and simmer, stirring every 20 minutes, until potatoes are soft, about 1 hour. Adjust salt as needed; garnish with parsley.",
    "pt": "20 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "1427367.jpg",
    "o": "",
    "st": "allrecipes"
}