{
    "id": 231721,
    "old_rating": "4.61538",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "7 tomatoes",
        "1 cup water",
        "1 cup instant rice",
        "1 pound lean ground beef",
        "1 yellow onion, chopped",
        "1 clove garlic, diced",
        "1 pinch garlic salt, or to taste",
        "ground black pepper to taste",
        "2 (15 ounce) cans tomato sauce",
        "1 (6 fluid ounce) can tomato juice (optional)"
    ],
    "nut": [
        "Calories > 249 kcal",
        "Carbs > 27.8 g",
        "Cholesterol > 42 mg",
        "Fat > 8.6 g",
        "Protein > 16.9 g",
        "Sodium > 796 mg"
    ],
    "n": "Rice and Beef Stuffed Tomatoes",
    "a": "Whimsicalsoup",
    "r": "0",
    "s": 7,
    "des": "\"Ground beef, rice, garlic, and lots of other stuff is spooned into tomatoes and baked in 20 minutes.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nCut tops from tomatoes and scoop out the pulp; transfer pulp to a bowl and chop. Reserve tops of tomatoes.\nBring water to a boil in a saucepan, pour in the rice, and cover pan; let stand until rice absorbs water, about 5 minutes.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Mix cooked rice, onion, garlic, garlic salt, and black pepper into ground beef; add reserved tomato pulp and tomato sauce. Bring the mixture to a boil, reduce heat to low, and simmer until thickened, 10 minutes.\nSet hollowed-out tomatoes into the prepared baking dish and fill each tomato with ground beef mixture. If desired, place tomato tops back on filled tomatoes. Pour tomato juice over filled tomatoes for extra juiciness.\nBake in the preheated oven until tomatoes are tender and filling is hot, about 20 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "3607513.jpg",
    "o": "",
    "st": "allrecipes"
}