{
    "id": 231819,
    "old_rating": "4.51613",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 small butternut squash",
        "3 eggs",
        "1/2 cup water",
        "1/2 cup vegetable oil",
        "1/2 cup white sugar",
        "1/2 cup brown sugar",
        "2 cups whole wheat flour",
        "1 cup all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1 1/2 teaspoons baking soda",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon salt",
        "1/2 teaspoon nutmeg",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon pumpkin pie spice",
        "1/4 cup raisins (optional)",
        "1/4 cup chopped walnuts (optional)"
    ],
    "nut": [
        "Calories > 402 kcal",
        "Carbs > 63.9 g",
        "Cholesterol > 49 mg",
        "Fat > 14.9 g",
        "Protein > 7.9 g",
        "Sodium > 406 mg"
    ],
    "n": "Perfect Butternut Squash Muffins",
    "a": "cezeigler",
    "r": "0",
    "s": 10,
    "des": "\"Similar to pumpkin muffins, these are a great way to use up butternut squash and are not too high in sugar. Even my picky husband enjoys these! Feel free to play around with the spice amounts to your liking.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease 20 muffin cups.\nCut a 1/2-inch hole into the larger part of the squash and cover with a damp paper towel.\nCook squash in a microwave oven in 3-minute increments, turning slightly after each increment, until squash can be easily pierced with a fork, 9 to 12 minutes. Set aside until cool to the touch, about 20 minutes.\nHalve squash lengthwise and scoop out seeds. Measure 1 1/2 cups squash into a large bowl. Mash eggs, water, vegetable oil, white sugar, and brown sugar into the squash. Whisk whole wheat flour, all-purpose flour, baking powder, baking soda, cinnamon, salt, nutmeg, cloves, and pumpkin pie spice into the squash mixture until you have a smooth batter. Fold raisins and walnuts into the batter.\nSpoon batter into prepared muffin cups to about 1/2 to 2/3 full.\nBake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, about 15 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "1066048.jpg",
    "o": "4516636.jpg,4069756.jpg,4066370.jpg,3309069.jpg,1240842.jpg,1043254.jpg",
    "st": "allrecipes"
}