{
    "id": 231834,
    "old_rating": "4.7",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound mezze (short) penne pasta",
        "1 bunch fresh asparagus, trimmed and cut into thirds",
        "1/4 cup olive oil",
        "3 tablespoons butter",
        "2 teaspoons lemon juice, or more to taste",
        "1/2 large shallot, minced",
        "2 large cloves garlic, minced",
        "1 large grilled chicken breast, sliced thinly and halved (optional)",
        "1 roma (plum) tomato, diced",
        "8 leaves fresh basil, torn"
    ],
    "nut": [
        "Calories > 446 kcal",
        "Carbs > 60 g",
        "Cholesterol > 23 mg",
        "Fat > 17.6 g",
        "Protein > 15 g",
        "Sodium > 54 mg"
    ],
    "n": "Lemon, Garlic, and Asparagus Warm Caprese Pasta Salad",
    "a": "Ebwallace",
    "r": "0",
    "s": 6,
    "des": "\"There are so many reasons I love this recipe. Caprese salad has to be one of my favorite summertime treats. There is nothing like a summer tomatoes' sweetness mixed with the peppery sweetness fresh basil offers, the zing of lemon and richness of garlic. It is SO good.\"",
    "ins": "Fill a large pot with lightly salted water and bring to a boil. Stir in penne and return to a boil. Cook pasta uncovered, stirring occasionally, until cooked through but still firm to the bite, about 11 minutes; drain.\nPlace asparagus into a saucepan, add a little water, and place over medium heat; cover pan and let asparagus steam until bright green and tender, 3 to 4 minutes. Drain.\nHeat olive oil with butter and lemon juice in a large saucepan over medium-low heat until butter melts; cook and stir shallot in hot oil and butter mixture until it just begins to soften, 1 to 2 minutes. Stir garlic into shallot mixture and cook until shallot and garlic are opaque, 3 more minutes. Stir asparagus and chicken into mixture; cook until heated through, about 5 minutes.\nToss pasta with chicken and vegetables to combine; mix tomato and basil into salad and serve warm.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "996768.jpg",
    "o": "",
    "st": "allrecipes"
}