{
    "id": 231870,
    "old_rating": "4.55556",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups milk",
        "4 (5 ounce) flounder fillets",
        "8 ounces spinach fettuccine",
        "1/4 cup butter, divided",
        "1/4 cup all-purpose flour",
        "1 1/2 cups chicken stock",
        "1 teaspoon Dijon mustard",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon ground nutmeg",
        "1/3 cup grated Parmesan cheese, divided",
        "1/3 cup shredded Gruyere cheese, divided",
        "1 (10 ounce) package frozen chopped spinach, thawed and drained"
    ],
    "nut": [
        "Calories > 544 kcal",
        "Carbs > 44.4 g",
        "Cholesterol > 120 mg",
        "Fat > 21.7 g",
        "Protein > 44.3 g",
        "Sodium > 819 mg"
    ],
    "n": "Cheesy Flounder Florentine",
    "a": "rockie",
    "r": "0",
    "s": 4,
    "des": "\"Healthy and delicious take on a favorite. We call this 'Milk Fish' in honor of a totally different recipe of a friend from the Philippines.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPour milk into a large skillet, place over medium heat, and place fish fillets into milk. Bring to a simmer and cook fish in milk for 1 minute. Transfer fillets to a plate and pour milk into a large measuring cup.\nFill a large pot with lightly salted water and bring to a rolling boil. Stir in the spinach fettuccine, bring back to a boil, and cook pasta over medium heat until cooked through but still firm to the bite, about 8 minutes. Drain and transfer into a 2-quart casserole. Toss fettuccine with 1 tablespoon butter.\nMelt remaining 3 tablespoons butter in skillet over medium heat and whisk flour into butter, stirring constantly until mixture forms a paste. Cook and stir for 1 minute, then whisk reserved milk and chicken stock into flour mixture until thoroughly combined. Bring to a simmer, reduce heat to low, and simmer until sauce has thickened, about 5 minutes, stirring often. Remove sauce from heat; whisk in Dijon mustard, black pepper, nutmeg, 1/4 cup of Parmesan cheese, and 1/4 cup of Gruyere cheese.\nSpread spinach over fettuccine noodles; arrange fillets on top of spinach. Pour sauce over the fish and sprinkle remaining Parmesan and Gruyere cheeses over the top.\nBake in the preheated oven until sauce is bubbling, about 15 minutes. Heat the oven's broiler and broil until cheese topping is browned, 1 to 2 more minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "2971677.jpg",
    "o": "",
    "st": "allrecipes"
}