{
    "id": 231823,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (16 ounce) packages shredded mozzarella cheese",
        "28 manicotti shells",
        "2 (16 ounce) packages frozen chopped spinach, thawed and drained",
        "1 (16 ounce) jar Alfredo sauce",
        "1 (8 ounce) package grated Parmesan cheese",
        "salt and ground black pepper to taste",
        "2 (16 ounce) jars spaghetti sauce"
    ],
    "nut": [
        "Calories > 457 kcal",
        "Carbs > 34.8 g",
        "Cholesterol > 61 mg",
        "Fat > 23.8 g",
        "Protein > 27.5 g",
        "Sodium > 1115 mg"
    ],
    "n": "Spinach and Cheese Stuffed Manicotti",
    "a": "Doodlebugsmom",
    "r": "0",
    "s": 16,
    "des": "\"This stuffing can be used in anything you want to stuff. I have even simply mixed in a 2 to 3-pound meatloaf to add some veggies to it, and it worked great! Made a very moist meatloaf, and the kids loved it! They also like eating the stuffing plain; I had to chase them away so I would have enough left for the noodles!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Divide mozzarella cheese into 3 portions.\nBring a large pot of lightly salted water to a boil. Cook manicotti in boiling water, stirring occasionally until softened slightly but still firm, about 7 minutes. Drain and rest in a bowl of cold water.\nCombine spinach, Alfredo sauce, Parmesan cheese, and 1 portion mozzarella cheese in a large bowl; mix well and season with salt and pepper. Spoon fill mixture into each manicotti shell. Divide stuffed shells evenly between two 9x13-inch baking dishes. Pour 1 jar spaghetti sauce over each baking dish and sprinkle with equal portions mozzarella cheese. Cover both baking dishes with aluminum foil.\nBake in preheated oven until cheese is melted and sauce is bubbly, about 45 minutes.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "3289700.jpg",
    "o": "",
    "st": "allrecipes"
}