{
    "id": 231810,
    "old_rating": "4.61111",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "1 onion, finely diced",
        "salt to taste",
        "4 cups chicken broth",
        "2 cups water",
        "2 pounds fresh asparagus, trimmed and cut into 1-inch pieces",
        "1 pinch cayenne pepper, or to taste",
        "freshly ground black pepper to taste",
        "1 pinch ground nutmeg",
        "1/2 cup heavy whipping cream",
        "Cream Topping:",
        "1/4 cup heavy whipping cream (optional)",
        "1 tablespoon freshly grated Parmigiano-Reggiano cheese",
        "1 teaspoon lemon zest (optional)",
        "1 pinch cayenne pepper (optional)"
    ],
    "nut": [
        "Calories > 197 kcal",
        "Carbs > 11.2 g",
        "Cholesterol > 55 mg",
        "Fat > 15.7 g",
        "Protein > 5.4 g",
        "Sodium > 700 mg"
    ],
    "n": "Chef John's Cream of Asparagus Soup",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"For me, asparagus is one of those rare vegetables that shines brightest when enjoyed in soup form. Here's an ultra-easy and gorgeously colored cream of asparagus soup recipe.\"",
    "ins": "Melt butter in a soup pot over medium heat. Add minced onion and salt; cook and stir until onion is soft and golden, about 10 minutes.\nPour chicken broth and water into pot. Bring to a boil, reduce heat to medium, and simmer 15 minutes.\nPlace asparagus pieces in simmering broth. Cook, stirring occasionally until asparagus is just tender and still bright green, 5 to 10 minutes. Remove from heat.\nUse an immersion blender to blend soup until smooth, about 3 minutes.\nFor a finer texture, strain soup through mesh strainer. Return strained soup to pot and place on stove.\nTurn heat to low. Season with cayenne pepper, black pepper, and nutmeg. Adjust salt to taste. Whisk 1/2 cup cream into soup.\nPlace 1/4 cup cream, Parmigiano-Reggiano cheese, and lemon zest in a small bowl. Whisk until frothy and slightly thickened, about 1 minute.\nLadle soup into bowls. Drizzle a spoonful of Parmigiano-Reggiano-lemon cream on top of each serving and swirl to form a random design.\nSprinkle with a pinch of lemon zest and cayenne pepper, if desired.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}