{
    "id": 231991,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups 1/2-inch pieces fresh pineapple",
        "2 cups 1/2-inch pieces fresh mango",
        "2 ripe bananas, mashed",
        "1 tablespoon lime juice",
        "3/4 cup white sugar",
        "3 tablespoons quick-cooking tapioca",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground ginger",
        "1 pinch salt",
        "1 tablespoon butter, cut into small pieces",
        "1 double crust ready-to-use pie crust"
    ],
    "nut": [
        "Calories > 253 kcal",
        "Carbs > 45.5 g",
        "Cholesterol > 3 mg",
        "Fat > 8.2 g",
        "Protein > 2 g",
        "Sodium > 158 mg"
    ],
    "n": "Pineapple Mango Banana Pie",
    "a": "Home Chef Hayes",
    "r": "0",
    "s": 9,
    "des": "\"If you like a taste of the tropics you will like this pie. This pie is a great spring and summer dessert. Use fresh, ripe pineapple and mango and bananas that are brown all over. They will act as a binding agent but leaves lots of moisture in the pie.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nDrain pineapple and mango in a fine mesh strainer fitted over a bowl. Transfer pineapple and mango to a large bowl; mix in bananas and lime juice.\nMix sugar, tapioca, cinnamon, ginger, and salt in a separate bowl. Add sugar mixture to fruit mixture; toss to coat. Fold in butter pieces. Set aside until flavors have blended, 15 to 30 minutes. The longer it sits, the better it will set up during baking.\nPress 1 pie crust into a 9-inch plate plate; spoon fruit mixture into pie crust. Top with the second pie crust, crimping the edges together to seal. Cut a few slits in the top crust for ventilation during baking. Line the crust edges with aluminum foil to prevent burning.\nBake in the preheated oven for 25 minutes. Remove aluminum foil and bake until crust is golden brown, 20 to 25 minutes. Cool completely on a wire rack.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}