{
    "id": 231925,
    "old_rating": "4.47273",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 1/2 cups quick-cooking oats",
        "1/4 cup wheat germ",
        "1/4 cup ground flax seed",
        "2 tablespoons vanilla-flavored hemp protein powder",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon salt",
        "3 bananas",
        "1/4 cup peanut butter (such as JifÂ®)",
        "2 tablespoons honey",
        "1 teaspoon vanilla extract",
        "1/4 cup natural peanut butter, or to taste"
    ],
    "nut": [
        "Calories > 169 kcal",
        "Carbs > 21.3 g",
        "Cholesterol > 0 mg",
        "Fat > 7.6 g",
        "Protein > 6.2 g",
        "Sodium > 148 mg"
    ],
    "n": "High-Fiber, High-Protein Breakfast Bars",
    "a": "SavedByGrace",
    "r": "0",
    "s": 12,
    "des": "\"I came up with this recipe when my doctor told me I needed to eat more fiber, and I was sick of eating store-bought protein bars for breakfast in the car between the gym and work. Ingredients such as wheat germ, flaxseed, protein powder, peanut butter, and oats make this a healthy way to start the day!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line an 8x8-inch baking dish with aluminum foil, letting foil hang down over the sides of the pan; spray pan with cooking spray.\nStir oats, wheat germ, flax seed, protein powder, cinnamon, and salt together in a bowl. Mash bananas in a separate large bowl and stir 1/4 cup Jif(R) peanut butter, honey, and vanilla extract into bananas, mixing well. Stir dry ingredients into banana mixture and spread into the prepared baking dish.\nBake in the preheated oven for 20 minutes. Spread 1/4 cup natural peanut butter over top.\nContinue baking until lightly browned on the edges and set, 10 more minutes. Let cool in the pan and lift bars onto a work surface using aluminum foil as handles. Cut into bars, wrap in plastic wrap, and store in refrigerator.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "1003518.jpg",
    "o": "4540606.jpg,4507962.jpg,3654558.jpg,3510703.jpg,1109851.jpg,1068253.jpg",
    "st": "allrecipes"
}