{
    "id": 231976,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (2 ounce) can anchovy fillets, undrained, or to taste",
        "1 onion, chopped",
        "1 teaspoon tomato paste",
        "1 (7.5 ounce) can salmon, undrained, or more to taste",
        "1/2 (7.5 ounce) can water",
        "1/4 cup pine nuts, or to taste",
        "1/4 cup raisins, or to taste",
        "salt and ground black pepper to taste",
        "1 pinch saffron",
        "1 (16 ounce) package spaghettini"
    ],
    "nut": [
        "Calories > 540 kcal",
        "Carbs > 77.9 g",
        "Cholesterol > 33 mg",
        "Fat > 11.4 g",
        "Protein > 32.9 g",
        "Sodium > 1103 mg"
    ],
    "n": "Sicilian Pasta Salmon Sauce",
    "a": "Deena",
    "r": "0",
    "s": 4,
    "des": "\"This recipe was handed down from my husband's Sicilian grandmother to his mother and now to me. This is a wonderful recipe that is a favorite of the entire family. And it's easy, too. Not a 'traditional American' pasta sauce, but a real, honest to goodness Sicilian sauce. Don't leave out the saffron or pignoli!\"",
    "ins": "Pour about 2 teaspoons oil from anchovy can into a skillet over medium heat; cook and stir onion in the hot anchovy oil until softened, about 5 minutes. Add anchovy fillets; cook and stir until fish dissolves, about 5 minutes.\nStir tomato paste into onion-anchovy mixture; add juice from canned salmon, water, pine nuts, raisins, salt, and black pepper. Cook and stir mixture until flavors have blended, about 15 minutes.\nBring a large pot of lightly salted water to a boil. Cook spaghettini in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain.\nMix salmon and saffron into onion-anchovy mixture; cook until salmon is heated through, about 15 more minutes. Serve salmon sauce over spaghettini.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}