{
    "id": 23195,
    "old_rating": "4.47619",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups milk",
        "1/3 cup all-purpose flour",
        "1 cup brown sugar",
        "1/4 teaspoon salt",
        "3 egg yolks",
        "3 tablespoons butter, melted",
        "1/2 teaspoon vanilla extract",
        "6 egg whites",
        "1/4 teaspoon cream of tartar",
        "2 tablespoons confectioners' sugar",
        "1 (9 inch) unbaked pie crust"
    ],
    "nut": [
        "Calories > 346 kcal",
        "Carbs > 46.6 g",
        "Cholesterol > 93 mg",
        "Fat > 14.7 g",
        "Protein > 7.7 g",
        "Sodium > 298 mg"
    ],
    "n": "Butterscotch Cream Pie",
    "a": "Colleen",
    "r": "0",
    "s": 8,
    "des": "\"This recipe has been a favorite of mine and my family for over 50 years. The meringue topping with the butterscotch filling makes for a very rich dessert; eat it warm. YUM!\"",
    "ins": "Preheat oven to 375  degrees F (190 degrees C). Brush pie crust lightly with egg white to seal. Bake in preheated oven for 10 minutes, or until light brown and crisp. Remove from oven and reduce temperature to 350 degrees F (175 degrees C).\nIn a small bowl, mix together the flour, brown sugar and salt; set aside. In the top of a double boiler over medium heat, scald the milk while stirring with a whisk. Slowly whisk in the flour mixture. Cook, stirring constantly until thickened; remove from heat.\nPlace the egg yolks in a medium bowl. Stir in 1/3 of the milk mixture, whisking constantly, to temper the yolks. Pour the yolk mixture back into the pan. Return to the stove and cook, stirring constantly, until thick. Remove from heat and stir in the butter and vanilla. Pour into baked pie crust.\nIn a large glass or metal mixing bowl, beat egg whites, cream of tartar, and confectioners' sugar until stiff peaks form. Spread meringue over pie, covering completely.\nBake at 350 degrees F (175 degrees C) for 10 to 15 minutes, or until meringue is golden brown in spots.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "2987450.jpg",
    "o": "2968177.jpg,2613754.jpg,2523558.jpg,2150486.jpg,2127143.jpg,792791.jpg",
    "st": "allrecipes"
}