{
    "id": 232045,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 2/3 cups NESTLEÂ® TOLL HOUSEÂ® Peanut Butter & Milk Chocolate Morsels, divided",
        "1/2 cup NESTLEÂ® TOLL HOUSEÂ® Semi-Sweet Chocolate Morsels",
        "2 1/4 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 1/2 cups granulated sugar",
        "3/4 cup butter or margarine, softened",
        "1 teaspoon vanilla extract",
        "3 large eggs",
        "1 cup water",
        "24 pieces ButterfingerÂ® Bites, coarsely chopped"
    ],
    "nut": [
        "Calories > 328 kcal",
        "Carbs > 46.4 g",
        "Cholesterol > 62 mg",
        "Fat > 14.6 g",
        "Protein > 4.4 g",
        "Sodium > 267 mg"
    ],
    "n": "Crumble-Topped Chocolate Peanut Butter Cake",
    "a": "Butterfinger",
    "r": "0",
    "s": 15,
    "des": "\"Looking for a new dessert for your family? This Crumble-Topped Chocolate Peanut Butter Cake has the perfect combination of flavors and is topped with tasty candy crunchiness. Great for all occasions.\"",
    "ins": "Preheat oven to 325 degrees F.  Grease 13 x 9-inch baking pan.\nMicrowave 1 cup peanut butter and milk chocolate morsels and semi-sweet morsels in medium, uncovered, microwave-safe bowl on medium high (70%) power for 1 minute; Stir.  The morsels may retain some of their original shape.  If necessary, microwave at additional 10- to 15-second intervals, stirring just until melted.\nCombine flour, baking soda and salt in small bowl.  Beat sugar, butter and vanilla extract in large mixer bowl until creamy.  Add eggs, one at a time, beating well after each addition.  Beat in melted morsels.  Gradually beat in flour mixture alternately with water until smooth.  Spread into prepared pan.\nBake for 40 to 45 minutes or until wooden pick inserted in center comes out clean.  Immediately sprinkle remaining peanut butter and milk chocolate morsels.  Let stand 5 minutes or until morsels are shiny; spread evenly.  Sprinkle with BUTTERFINGER(R) pieces.  Cool completely in pan on wire rack.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "1000686.jpg",
    "o": "",
    "st": "allrecipes"
}