{
    "id": 232083,
    "old_rating": "4.70588",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup water",
        "2 large onions, diced",
        "2 pounds ground beef",
        "salt and ground black pepper to taste",
        "1 tablespoon olive oil",
        "4 red bell peppers, seeded and diced",
        "4 cups tomato-vegetable juice cocktail (such as V8Â®)",
        "3 (14.5 ounce) cans diced tomatoes",
        "1 (26 ounce) can tomato soup (such as Campbell'sÂ®)",
        "1 pound chorizo sausage, ground",
        "2 (4 ounce) cans diced green chiles",
        "3 tablespoons chili powder (such as McCormickÂ®)",
        "1 tablespoon adobo seasoning (rojo adobo) (optional)"
    ],
    "nut": [
        "Calories > 368 kcal",
        "Carbs > 19.3 g",
        "Cholesterol > 68 mg",
        "Fat > 22.3 g",
        "Protein > 21.8 g",
        "Sodium > 1247 mg"
    ],
    "n": "Tori's Beanless Chili",
    "a": "Tori",
    "r": "0",
    "s": 14,
    "des": "\"This is a big pot of chili, great for when you have company; or you can freeze half and serve it again on a cold night when you don't feel like cooking. This is not too spicy for my young kids but flavorful enough to please the adults.\"",
    "ins": "Bring water to a boil in a large soup pot, reduce heat to low, and cook onions in the simmering water until translucent, 5 to 8 minutes. Add ground beef to onions; cook and stir until ground beef is browned and crumbly, about 10 more minutes. Sprinkle beef with salt and black pepper as it cooks. Drain excess grease.\nHeat olive oil in a large skillet over medium heat; cook and stir bell peppers in the hot oil until softened, about 5 minutes. Add peppers to meat mixture. Stir vegetable juice cocktail, diced tomatoes, tomato soup, chorizo sausage, green chiles, chili powder, and adobo seasoning into mixture until combined.\nBring chili to a boil, reduce heat, and simmer until thickened, about 30 minutes. Cover and continue simmering to blend flavors, about 20 minutes more.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1042047.jpg",
    "o": "",
    "st": "allrecipes"
}