{
    "id": 232095,
    "old_rating": "2.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 pounds zucchini, sliced",
        "1 tablespoon butter",
        "1 large onion, finely chopped",
        "1 (1 inch) piece fresh ginger, grated",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander",
        "1 teaspoon mustard seeds",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground turmeric",
        "1/4 teaspoon ground cardamom",
        "1/4 teaspoon cayenne pepper",
        "sea salt to taste",
        "freshly ground black pepper to taste",
        "1 cup vegetable stock",
        "1/4 cup chopped fresh cilantro",
        "4 cinnamon sticks (optional)"
    ],
    "nut": [
        "Calories > 94 kcal",
        "Carbs > 14 g",
        "Cholesterol > 8 mg",
        "Fat > 3.9 g",
        "Protein > 3.4 g",
        "Sodium > 237 mg"
    ],
    "n": "Zucchini Soup with Curry Spices",
    "a": "LORIKAE",
    "r": "0",
    "s": 4,
    "des": "\"An incredibly simple summertime soup for all that extra zucchini from the garden. This soup is delicately spicy, full of flavor, yet low in fat and calories. Butter or oil can be omitted if using a non-stick pan. This is also a great soup to use for canning or freezing so you can enjoy the tastes of summer during the winter months!\"",
    "ins": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add zucchini, cover, and steam until slightly tender, 5 to 6 minutes.\nHeat butter in a saucepan over medium heat; cook and stir onion in the melted butter until tender and translucent, 5 to 10 minutes.\nMix grated ginger, cumin, coriander, mustard seeds, ground cinnamon, turmeric, cardamom, cayenne pepper, sea salt, and black pepper in a small bowl. Mix spice mixture into onions until coated.\nMix zucchini into onion mixture; cook and stir until heated through, 2 to 3 minutes. Pour vegetable stock over zucchini mixture; stir well. Simmer until vegetables are tender, 8 to 10 minutes.\nPour zucchini mixture into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth.\nPour soup into 4 serving bowls; garnish each bowl with 1 tablespoon cilantro and 1 cinnamon stick.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "1387336.jpg",
    "o": "",
    "st": "allrecipes"
}