{
    "id": 232061,
    "old_rating": "4.52174",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 tomatoes, diced",
        "1 small onion, diced",
        "1/2 cup chopped fresh cilantro",
        "2 tablespoons canned diced jalapeno peppers, or more to taste (juice reserved)",
        "1/2 teaspoon garlic salt",
        "1/2 lime, juiced",
        "3 cups coleslaw mix",
        "3 tablespoons ranch dressing",
        "2 cups vegetable oil for frying",
        "1 (9 ounce) box batter mix (such as Shore LunchÂ®)",
        "1 (12 fluid ounce) can or bottle Mexican beer",
        "24 corn tortillas",
        "1 pound cod fillets, cut into 2-inch chunks",
        "2 cups shredded Mexican cheese blend",
        "2 limes, sliced into wedges",
        "1 dash chile-garlic sauce (such as SrirachaÂ®) (optional)"
    ],
    "nut": [
        "Calories > 423 kcal",
        "Carbs > 50.8 g",
        "Cholesterol > 39 mg",
        "Fat > 17.6 g",
        "Protein > 16 g",
        "Sodium > 443 mg"
    ],
    "n": "Baja Style Fish Tacos",
    "a": "the petite chef",
    "r": "0",
    "s": 12,
    "des": "\"I came up with this recipe after having fish tacos from a street vendor in Ensenada, Mexico. It is the closest to authentic I have found. Salsa can be made a day in advance for flavors to blend.\"",
    "ins": "Mix tomatoes, onion, cilantro, jalapeno peppers, 1 tablespoon juice from jalapeno peppers, and garlic salt in a bowl; squeeze 1/2 lime over salsa fresca. Cover bowl with plastic wrap and refrigerate while preparing fish.\nToss coleslaw mix with ranch dressing in a bowl; set aside for flavors to blend.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nStir batter mix and beer together in a bowl. Wrap corn tortillas in wet paper towels and set aside.\nDip cod in the batter mix; fry coated cod in batches in the hot oil until cod is cooked through and coating is brown, 4 to 5 minutes. Remove cod with a slotted spoon and drain on a paper towel-lined plate.\nMicrowave corn tortillas on high until warmed, about 1 minute.\nStack two tortillas on a plate; top with fish, a sprinkle of Mexican cheese, coleslaw mixture, salsa fresca, and a squeeze from lime wedge. Drizzle with chile-garlic sauce. Repeat with remaining ingredients.",
    "pt": "40 m",
    "ct": "20 m",
    "tt": "1 h",
    "i": "1002311.jpg",
    "o": "",
    "st": "allrecipes"
}