{
    "id": 232097,
    "old_rating": "4.59649",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons butter",
        "1/4 cup butter, divided",
        "1 cup chopped celery",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1/2 cup all-purpose flour",
        "2 2/3 cups chicken broth",
        "1 cup heavy whipping cream",
        "1/4 cup sherry wine",
        "1 teaspoon salt",
        "1/4 teaspoon white pepper",
        "1/2 (12 ounce) package angel hair pasta",
        "2 cups diced cooked turkey",
        "1/2 cup panko bread crumbs"
    ],
    "nut": [
        "Calories > 464 kcal",
        "Carbs > 34.5 g",
        "Cholesterol > 116 mg",
        "Fat > 27.5 g",
        "Protein > 21.3 g",
        "Sodium > 1105 mg"
    ],
    "n": "Turkey Tetrazzini a la StouffersÂ®",
    "a": "margieatk",
    "r": "0",
    "s": 6,
    "des": "\"This recipe tastes just like Stouffer'sÂ® turkey tetrazzini. Best recipe I have found.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Grease a casserole dish with 2 teaspoons butter.\nBring a large pot of lightly salted water to a boil. Cook angel hair in the boiling water, stirring occasionally until cooked through but firm to the bite, 4 to 5 minutes. Drain.\nMelt 2 tablespoons butter in a large pot over medium heat; cook and stir celery until it begins to soften, 1 minute. Stir mushrooms into celery; cook and stir until mushrooms are softened, 3 minutes more.\nRemove vegetables from skillet; melt remaining 2 tablespoons butter and whisk flour into hot butter to make a paste. Slowly whisk chicken broth and bring to a simmer; reduce heat to low and cook, whisking constantly, until sauce is thickened. Mix in cream, sherry, salt, and white pepper.\nFold turkey, celery, and mushrooms into sauce; mix in angel hair pasta. Transfer mixture to prepared casserole dish and sprinkle panko crumbs on top.\nBake in the preheated oven until sauce is bubbling and crumb topping has browned, about 30 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "1056677.jpg",
    "o": "4254361.jpg,2958646.jpg,1758430.jpg,1757559.jpg,1757021.jpg",
    "st": "allrecipes"
}