{
    "id": 232062,
    "old_rating": "4.81482",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1/2 cup (scant) white sugar",
        "1 large egg",
        "3 large egg yolks",
        "1/4 teaspoon salt",
        "1/4 cup white sugar",
        "1/2 cup creme fraiche",
        "1/2 cup whole milk",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon orange cognac (such as Grand MarnierÂ®)"
    ],
    "nut": [
        "Calories > 328 kcal",
        "Carbs > 40.8 g",
        "Cholesterol > 244 mg",
        "Fat > 16.8 g",
        "Protein > 5.5 g",
        "Sodium > 191 mg"
    ],
    "n": "Chef John's Creme Caramel",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Creme caramel belongs on the short list for 'World's Greatest Dessert.' The way the almost-burnt caramel layer gets fused on, and becomes one with, the creamy custard is nothing short of magic.\"",
    "ins": "Preheat oven to 325 degrees F. Lightly spray 4 heatproof 6.5-oz. ramekins with vegetable spray. Place ramekins in a casserole dish.\nPlace 1/2 cup sugar in a small, heavy, dry skillet over medium heat. When sugar begins to melt around the edges, gently shake the pan continually, swirling sugar around, until all the sugar melts; don't use utensils to stir. When sugar is completely melted and dark brown, remove the pan from heat.\nQuickly pour equal amounts of caramel syrup into the 4 prepared ramekins.\nPlace 1 egg and 3 egg yolks in a bowl with a pinch of salt and 1/4 cup sugar. Whisk until sugar is dissolved and mixture becomes frothy, about 1 minute.\nSpoon the creme fraiche into the egg mixture; add the milk, vanilla, and Grand Marnier. Whisk together until ingredients are completely mixed.\nLadle mixture into the prepared ramekins, filling them about 2/3 to 3/4 full.\nFill casserole with hot tap water to reach halfway up the sides of the ramekins. Place casserole on middle rack of preheated oven.\nBake until just barely set, 45 to 50 minutes. You can start checking for doneness at about 40 minutes.\nUsing tongs, remove the ramekins from the casserole to a cooling rack. When just slightly warm, run a sharp paring knife around the edge of each custard.\nTo unmold, cover ramekin with a small plate, then invert. Chill before serving.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "4541262.jpg",
    "o": "4541262.jpg,4482354.jpg,4372606.jpg,4113532.jpg,4021711.jpg,3831073.jpg",
    "st": "allrecipes"
}