{
    "id": 232127,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 large sweet potato, peeled and cut into large chunks",
        "1 large potato, peeled and cut into large chunks",
        "2 (4 ounce) salmon fillets",
        "2 cups milk",
        "1/4 cup olive oil",
        "1 stalk celery, diced",
        "1 large carrot, diced",
        "1 pinch ground nutmeg",
        "1 pinch red pepper flakes",
        "salt and ground black pepper to taste",
        "3 shallots, diced",
        "1/4 cup chopped fresh parsley",
        "2 tablespoons chopped fresh cilantro",
        "2 tablespoons minced garlic",
        "1/4 cup wheat germ",
        "1 large egg",
        "1 cup dry seasoned bread crumbs",
        "1/2 cup vegetable oil for frying"
    ],
    "nut": [
        "Calories > 659 kcal",
        "Carbs > 79.3 g",
        "Cholesterol > 82 mg",
        "Fat > 26 g",
        "Protein > 28.9 g",
        "Sodium > 716 mg"
    ],
    "n": "Sweet Potato Salmon Fish Cakes",
    "a": "Shawn Harquail",
    "r": "0",
    "s": 4,
    "des": "\"I tried this because I had some sweet potatoes that needed to be used and it turned out great! Very yummy! Serve with some freshly squeezed lemon juice on top, and voila!\"",
    "ins": "Place sweet potato and potato into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 15 minutes. Drain and transfer to a large bowl to cool.\nPlace salmon into a skillet and pour in milk. Bring to a simmer, cover skillet, and cook until salmon flakes easily with a fork, about 5 minutes. Remove salmon from the skillet; reserve milk in a bowl.\nHeat olive oil in the skillet over medium heat; cook and stir celery, carrot, nutmeg, red pepper flakes, salt, and pepper in the hot oil until celery and carrot are softened, about 5 minutes. Add shallots, parsley, cilantro, and garlic; cook and stir until fragrant, 3 to 5 minutes.\nPour wheat germ, egg, and reserved milk over sweet potato and potato; mash until evenly combined.\nFlake salmon with a fork; mix flaked salmon and vegetable mixture into the mashed potato mixture using your hands.\nHeat vegetable oil large saucepan or skillet over medium-high heat.\nPour bread crumbs into a large bowl.\nForm salmon mixture into patties using your hands; press each patty into bread crumbs, coating both sides.\nFry patties, working in batches, in the hot oil until crisp and golden, about 3 minutes per side.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "1001431.jpg",
    "o": "",
    "st": "allrecipes"
}