{
    "id": 232191,
    "old_rating": "4.72289",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons flax seed meal",
        "1/4 cup water",
        "1 cup butter, softened",
        "1 cup white sugar",
        "1/2 cup brown sugar",
        "3 egg yolks",
        "1 1/2 teaspoons pure vanilla extract",
        "2 cups all-purpose flour",
        "1/4 cup brewers' yeast",
        "1 tablespoon wheat germ",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 teaspoon cream of tartar",
        "2 1/2 cups old-fashioned oats",
        "1 cup chocolate chips"
    ],
    "nut": [
        "Calories > 158 kcal",
        "Carbs > 21.3 g",
        "Cholesterol > 31 mg",
        "Fat > 7.5 g",
        "Protein > 2.4 g",
        "Sodium > 107 mg"
    ],
    "n": "Lactation Cookies",
    "a": "kfwarden",
    "r": "0",
    "s": 36,
    "des": "\"These cookies are great for breastfeeding mothers! They are moist and super yummy and they help boost and/or maintain milk supply. And yes, husbands can eat them too! I have to hide these from my hubby when I make them! The brewers' yeast, wheat germ, flax seed, and whole oats are why these cookies help with milk supply for lactating mothers. Don't skip those ingredients!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nMix flaxseed with water in small bowl and let soak for 5 minutes.\nBeat butter, white sugar, and brown sugar together in a large mixing bowl until creamy. Add egg yolks and vanilla extract; beat to incorporate. Stir flax seed mixture into the butter mixture.\nMix flour, brewer's yeast, wheat germ, baking soda, salt, and cream of tartar in a separate bowl; add to butter mixture and stir until just combined. Fold oats and chocolate chips into the dough.\nRoll dough into walnut-sized balls and place 2 inches apart onto a baking sheet.\nBake in the preheated oven until the edges are golden, 10 to 12 minutes. Allow the cookies to cool on the baking sheet for 1 minute before removing to a wire rack to cool completely.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "25 m",
    "i": "4504184.jpg",
    "o": "4504184.jpg,4504183.jpg,4503925.jpg,4471393.jpg,4290667.jpg,4268609.jpg",
    "st": "allrecipes"
}