{
    "id": 232117,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 manicotti shells",
        "1 (15 ounce) container fat-free ricotta cheese",
        "1 (10 ounce) package frozen chopped spinach, thawed and drained",
        "2 egg whites, slightly beaten",
        "1 tablespoon grated Parmesan cheese",
        "1/4 teaspoon Italian seasoning",
        "1/8 teaspoon garlic powder, or more to taste",
        "1 (26 ounce) jar pasta sauce (such as ClassicoÂ® Florentine Spinach and Cheese)",
        "1 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 531 kcal",
        "Carbs > 58.9 g",
        "Cholesterol > 56 mg",
        "Fat > 19.4 g",
        "Protein > 31.6 g",
        "Sodium > 1155 mg"
    ],
    "n": "Delicious Spinach Manicotti",
    "a": "adoptabeach",
    "r": "0",
    "s": 4,
    "des": "\"I got a recipe like this from a healthy cookbook and adjusted it a bunch until it tasted just right. Now I make this healthy and delicious meal quite often. Even my 6- and 8-year-old kids request it!\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook manicotti in boiling water until nearly cooked through yet firm, about 6 minutes; drain.\nPreheat oven to 400 degrees F (200 degrees C).\nMix ricotta cheese, spinach, egg whites, Parmesan cheese, Italian seasoning, and garlic powder together in a bowl; stuff into ricotta shells.\nSpread enough of the pasta sauce into the bottom of a 9x13-inch baking dish to cover completely. Arrange stuffed manicotti shells into the pan. Pour remaining pasta sauce over the stuffed shells. Cover dish tightly with aluminum foil.\nBake in preheated oven until the filling is set and hot in the center, about 45 minutes.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nRemove aluminum foil from baking dish. Sprinkle mozzarella over the manicotti.\nCook under broiler until cheese is melted and slightly browned, 2 to 3 minutes.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "1083895.jpg",
    "o": "",
    "st": "allrecipes"
}