{
    "id": 232119,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (9 inch) prepared deep-dish pie crust",
        "4 slices bacon",
        "2 zucchini, thinly sliced",
        "1 cup chopped cremini mushrooms",
        "1 onion, chopped",
        "2 teaspoons minced garlic",
        "2 teaspoons Italian seasoning",
        "2 teaspoons chopped dill weed",
        "1 teaspoon minced fresh parsley",
        "1/2 teaspoon garlic salt",
        "1/2 teaspoon ground black pepper",
        "1 cup shredded mozzarella cheese, divided",
        "2 eggs, lightly beaten",
        "grated Parmesan cheese, or to taste"
    ],
    "nut": [
        "Calories > 223 kcal",
        "Carbs > 15.6 g",
        "Cholesterol > 57 mg",
        "Fat > 13.5 g",
        "Protein > 10.1 g",
        "Sodium > 484 mg"
    ],
    "n": "Summertime Zucchini Pie",
    "a": "mcd85",
    "r": "0",
    "s": 8,
    "des": "\"A quiche-like dish for a light lunch or brunch, also makes a great side dish. I developed this recipe after having an abundance of zucchini in my garden every summer and trying to find a delicious way to enjoy all of it! You can substitute 2 tablespoons butter for the bacon and drippings if you prefer to leave the bacon out of the recipe.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C).\nPress pie crust into a 9-inch deep dish pie plate. Cover the edges of the crust with aluminum foil.\nBake pie crust until lightly browned, about 12 minutes. Set pie crust aside to cool. Increase oven heat to 350 degrees F (175 degrees C).\nCook bacon in a large skillet over medium-high heat until crisp, about 10 minutes. Drain the bacon slices on paper towels, while retaining drippings in the skillet.\nStir zucchini, mushrooms, onion, and garlic into the reserved bacon drippings; season with Italian seasoning, dill, parsley, garlic salt, and black pepper. Cook and stir the zucchini mixture until the zucchini is tender yet crisp, 5 to 7 minutes; remove from heat.\nChop the bacon and stir through the zucchini mixture.\nSprinkle about half the mozzarella cheese into the bottom of the pie crust. Spoon zucchini mixture over the mozzarella cheese layer. Pour eggs over the zucchini mixture; top with remaining mozzarella cheese. Sprinkle Parmesan cheese over the mozzarella cheese. Put pie plate onto a baking sheet.\nBake in preheated oven until the top begins to brown, about 30 minutes.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1001987.jpg",
    "o": "",
    "st": "allrecipes"
}