{
    "id": 232208,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (3/4 inch thick) bone-in pork chops",
        "1 (4 ounce) package sliced fresh mushrooms",
        "4 ounces diced Swiss cheese",
        "1 tablespoon chopped fresh parsley",
        "1 teaspoon garlic powder",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon salt",
        "2 eggs",
        "3/4 cup bread crumbs",
        "2 tablespoons vegetable oil",
        "1/2 cup white Zinfandel wine, or as needed"
    ],
    "nut": [
        "Calories > 878 kcal",
        "Carbs > 36.2 g",
        "Cholesterol > 310 mg",
        "Fat > 51.9 g",
        "Protein > 55.3 g",
        "Sodium > 813 mg"
    ],
    "n": "Gourmet Stuffed Pork Chops",
    "a": "RENEERUTH",
    "r": "0",
    "s": 2,
    "des": "\"This recipe was given to me by my friend Will who learned it from his mom and grandma. It's a very simple recipe for stuffed pork chops that end up moist, fork tender, and delicious! I made a few adjustments to his recipe, feel free to experiment and make this your own.\"",
    "ins": "Lay pork chops flat onto your work surface. Use the tip of a sharp boning or paring knife to cut a pocket in each pork chop making a 2 inch slit in the side.\nMix mushrooms, Swiss cheese, parsley, garlic powder, black pepper, and salt in a bowl; stuff pork chops with mushroom mixture. Secure the open side with a toothpick.\nWhisk eggs in a bowl; pour bread crumbs into a separate bowl. Dip the stuffed pork chops into the beaten egg; press pork chops into bread crumbs until completely coated.\nHeat oil in a skillet over medium heat; place pork chops, pocket side-down, into the hot oil. Cook until outside of pork chops is browned, 2 to 3 minutes per side.\nPour in enough wine to come halfway up pork chops. Reduce heat to low, cover skillet, and simmer until pork chops are tender, about 2 hours. Check wine level occasionally and add more as needed. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
    "pt": "30 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "4071142.jpg",
    "o": "3980633.jpg,3550132.jpg,3158604.jpg,2237156.jpg,2237152.jpg,1089528.jpg",
    "st": "allrecipes"
}