{
    "id": 232227,
    "old_rating": "4.28125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (8 ounce) package spaghetti",
        "1 pound lean ground beef",
        "1 (16 ounce) jar spaghetti sauce",
        "1/2 cup butter, sliced - divided",
        "1 (8 ounce) container cottage cheese",
        "1 (8 ounce) package cream cheese, softened",
        "1/4 cup sour cream",
        "1 (8 ounce) package shredded sharp Cheddar cheese"
    ],
    "nut": [
        "Calories > 617 kcal",
        "Carbs > 30.8 g",
        "Cholesterol > 136 mg",
        "Fat > 42.2 g",
        "Protein > 28.4 g",
        "Sodium > 721 mg"
    ],
    "n": "Million-Dollar Spaghetti",
    "a": "Coqui30",
    "r": "0",
    "s": 8,
    "des": "\"The perfect combination of pasta, ground beef, and cream cheese mixture. Unbelievably good! Serve with garlic bread and salad. Enjoy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Transfer to a bowl and mix spaghetti sauce into ground beef.\nPlace half the slices of butter into the bottom of a 9x13-inch casserole dish. Spread half the spaghetti into the dish. Mix cottage cheese, cream cheese, and sour cream together in a bowl; spread mixture over spaghetti. Layer remaining spaghetti over creamy mixture. Top with remaining pats of butter.\nPour ground beef mixture over spaghetti and spread to cover casserole.\nBake in the preheated oven for 30 minutes. Spread Cheddar cheese over casserole and continue baking until cheese has melted and is lightly browned, about 15 more minutes.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4515867.jpg",
    "o": "4476895.jpg,4460717.jpg,4458999.jpg,4131737.jpg,3759856.jpg,3523804.jpg",
    "st": "allrecipes"
}