{
    "id": 232281,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 delicata squash - halved lengthwise, seeded, and cut into 2-inch slices",
        "1 1/4 cups jasmine rice",
        "6 chicken leg quarters with skin, cut into thighs and drumsticks",
        "1 cup chicken broth",
        "1 (8 ounce) can cream of broccoli soup",
        "1 (8 ounce) can drained canned peas",
        "2 tablespoons ground dried sage",
        "1 teaspoon black pepper",
        "2 teaspoons cayenne pepper",
        "salt to taste"
    ],
    "nut": [
        "Calories > 429 kcal",
        "Carbs > 44 g",
        "Cholesterol > 109 mg",
        "Fat > 11.8 g",
        "Protein > 35.5 g",
        "Sodium > 375 mg"
    ],
    "n": "Winter Chicken n' Squash",
    "a": "Ryan",
    "r": "0",
    "s": 6,
    "des": "\"An excellent winter dish with seasonal squash. The savory sage and the sweetness of the squash, mixed with a bite of pepper, is perfect on a chilly night. Using fresh ingredients that are in season is the best way to cook and eat. The skin of the chicken is important for cooking the rice. The sage is only natural to go with the squash.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nLay squash slices in a 11x13-inch baking dish. Spread rice in an even layer over the squash slices. Arrange chicken pieces onto the layer of rice.\nMix chicken broth, broccoli soup, peas, sage, and black pepper together in a bowl; pour into baking dish around the chicken piece. Sprinkle cayenne pepper over the chicken pieces. Season chicken and rice mixture with salt. Cover baking dish with aluminum foil.\nCook in the preheated oven for 1 hour and 45 minutes. Remove the aluminum foil and continue cooking until the chicken is no longer pink at the bone and the juices run clear, about 15 minutes more.  An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Cool dish 5 minutes before serving.",
    "pt": "10 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}