{
    "id": 232226,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 1/2 pounds ground venison",
        "1/2 pound pork sausage (such as Jimmy DeanÂ®)",
        "1 onion, chopped",
        "2 onion sandwich buns (such as S. Rosen'sÂ®)",
        "2 large eggs",
        "1 1/2 fluid ounces brandy (such as Christian BrothersÂ®)",
        "1 tablespoon bacon grease",
        "1 teaspoon Worcestershire sauce",
        "1 teaspoon dried thyme",
        "1 teaspoon red pepper flakes",
        "1/2 teaspoon seasoned salt (such as LAWRY'SÂ®)",
        "1/2 teaspoon garlic and herb seasoning (such as McCormickÂ®)",
        "1/2 teaspoon finely ground black pepper",
        "1/4 teaspoon ground sage"
    ],
    "nut": [
        "Calories > 343 kcal",
        "Carbs > 13.1 g",
        "Cholesterol > 165 mg",
        "Fat > 15.4 g",
        "Protein > 31.1 g",
        "Sodium > 573 mg"
    ],
    "n": "Amazing Venison Meatloaf",
    "a": "Anastasia Daleiden",
    "r": "0",
    "s": 6,
    "des": "\"This is my own original recipe (I'm a hunter's wife) and an all-time family favorite! \nA super moist and flavorful meatloaf with a 'kick' using venison and pork sausage. \nIt would also probably be good as a leftover, but none of it has ever made it to the fridge so I don't know. This is exceptional when the meatloaf is formed into patties and grilled outside instead of baked in the oven.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a loaf pan with cooking spray.\nMix venison, pork sausage, and onion in a bowl until thoroughly combined. Run water from faucet briefly over onion buns, squeeze water out of buns, and break into small pieces. Add pieces of onion buns to meat mixture.\nStir eggs, brandy, bacon grease, Worcestershire sauce, thyme, red pepper flakes, seasoned salt, garlic and herb seasoning, black pepper, and sage into meat mixture. Transfer to prepared loaf pan.\nBake in the preheated oven until browned and the juices run clear, 60 to 70 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).",
    "pt": "25 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}