{
    "id": 232263,
    "old_rating": "2.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Shortbread:",
        "3/4 cup unsalted butter, at room temperature",
        "1/4 cup confectioners' sugar",
        "1 1/2 tablespoons white sugar",
        "3/4 teaspoon lemon zest",
        "1/4 teaspoon salt",
        "1 1/2 cups all-purpose flour",
        "3/4 teaspoon lemon juice",
        "Glaze:",
        "1/2 cup milk",
        "1 1/2 tablespoons dried lavender flowers",
        "1 cup confectioners' sugar",
        "1 tablespoon Meyer lemon juice, or as needed"
    ],
    "nut": [
        "Calories > 219 kcal",
        "Carbs > 26.6 g",
        "Cholesterol > 31 mg",
        "Fat > 11.9 g",
        "Protein > 2.1 g",
        "Sodium > 55 mg"
    ],
    "n": "Lemon and Lavender Glazed Lemon Shortbread",
    "a": "RebeccaLee",
    "r": "0",
    "s": 12,
    "des": "\"A deliciously simple shortbread made with Meyer lemons, and topped with a homemade lavender flower and Meyer lemon glaze. This is an adapted recipe from several I've found over the years, which I combined and perfected from my Grandma's lemon shortbread.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nBeat butter, 1/4 cup confectioners' sugar, white sugar, lemon zest, and salt together in a bowl with an electric mixer until fluffy. Gradually sift flour into batter, stirring in each addition; add 3/4 teaspoon lemon juice. Gently knead until dough holds together. Press dough into an 8x8-inch pan.\nBake in the preheated oven until shortbread is lightly browned around the edges, 30 to 40 minutes. Cool in pan to lukewarm temperature and transfer to a wire rack to cool completely.\nWarm milk in a saucepan over medium heat; cook, stirring constantly, until milk begin to boil. Remove from heat and add lavender flowers. Cover pan and steep until fragrant, 6 to 10 minutes. Strain and discard flowers. Gradually whisk 1 cup confectioners' sugar, 1 tablespoon at a time, alternating with 1 tablespoon Meyer lemon juice, until glaze is smooth and opaque. Spread over cooled shortbread. Refrigerate to allow glaze to harden, about 30 minutes.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}