{
    "id": 232210,
    "old_rating": "4.51724",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 cups vegetable broth",
        "1 1/4 cups water",
        "2 cups pearl (Israeli) couscous",
        "1 pinch salt",
        "1 pinch ground black pepper",
        "5 tablespoons olive oil, divided",
        "1/2 cup pine nuts",
        "4 cloves garlic, minced",
        "1 shallot, minced",
        "1/2 cup sliced black olives",
        "1/3 cup sun-dried tomatoes packed in oil, drained and chopped",
        "1 cup vegetable broth",
        "1/4 cup chopped fresh flat-leaf parsley"
    ],
    "nut": [
        "Calories > 528 kcal",
        "Carbs > 55.5 g",
        "Cholesterol > 0 mg",
        "Fat > 29.3 g",
        "Protein > 13 g",
        "Sodium > 455 mg"
    ],
    "n": "Couscous with Olives and Sun-Dried Tomato",
    "a": "Erin C. David",
    "r": "0",
    "s": 4,
    "des": "\"A delicate, flavorful dish that will satisfy vegans and carnivores alike! Inspired by my family's deep Coptic Orthodox Christian tradition, this is a great meal alternative during strict fasting times. It contains no animal products or fats, but has enough flavor and visual impact to make you feel like you're not sacrificing a thing! I hope you will enjoy this recipe. Add chicken or prawns to make this vegan dish a carnivorous delight!\"",
    "ins": "Bring 1 1/4 cup vegetable broth and water to a boil in a saucepan, stir in couscous, and mix in salt and black pepper. Reduce heat to low and simmer until liquid is absorbed, about 8 minutes.\nHeat 3 tablespoons olive oil in a skillet over medium-high heat; stir in pine nuts and cook, stirring frequently, until pine nuts smell toasted and are golden brown, about 1 minute. Remove from heat.\nHeat remaining 2 tablespoons olive oil in a saucepan; cook and stir garlic and shallot in the hot oil until softened, about 2 minutes. Stir black olives and sun-dried tomatoes into garlic mixture and cook until heated through, 2 to 3 minutes, stirring often. Slowly pour in 1 cup vegetable broth and bring mixture to a boil. Reduce heat to low and simmer until sauce has reduced, 8 to 10 minutes.\nTransfer couscous to a large serving bowl, mix with sauce, and serve topped with parsley and pine nuts.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "1011586.jpg",
    "o": "",
    "st": "allrecipes"
}