{
    "id": 232216,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 delicata squash, halved lengthwise and seeded",
        "1 tablespoon olive oil (optional)",
        "salt and ground black pepper to taste",
        "2 tablespoons butter",
        "1 shallot, minced",
        "1 clove garlic, minced",
        "6 sun-dried tomatoes, chopped",
        "1 cup bread crumbs, or more if needed",
        "1 egg, beaten",
        "1/4 cup grated Parmesan cheese",
        "1/4 cup vegetable oil, or as needed"
    ],
    "nut": [
        "Calories > 299 kcal",
        "Carbs > 35 g",
        "Cholesterol > 66 mg",
        "Fat > 14.7 g",
        "Protein > 8.8 g",
        "Sodium > 400 mg"
    ],
    "n": "Delicata Squash Burger Patties",
    "a": "kphanie",
    "r": "0",
    "s": 4,
    "des": "\"Hey vegetarians! I came up with a scrumptious way to eat burgers. And this weird striped little squash. I'm not a vegetarian anymore, but I still make it often because it's so good! Serve in burgers, or by itself with a side of green salad, rice or potatoes. This also makes for a wonderful ravioli stuffing.\"",
    "ins": "Preheat an oven to 475 degrees F (245 degrees C).\nPlace squash on a baking sheet; drizzle with olive oil. Season with salt and pepper.\nBake in the preheated oven until tender, about 45 minutes. Remove and cool. Cut into cubes.\nHeat butter in a skillet over medium heat; cook and stir shallot and garlic in the melted butter until shallot is transparent, 5 to 10 minutes. Add sun-dried tomatoes; cook until softened, 2 to 3 minutes. Mash squash cubes into shallot mixture until relatively smooth. Remove from heat, transfer mixture to a bowl, and cool for 2 to 3 minutes.\nStir bread crumbs, egg, and Parmesan cheese into squash mixture. Add more bread crumbs if mixture is too sticky. Season with salt and pepper. Shape mixture into 4 patties.\nHeat vegetable oil in a large frying pan over medium-high heat; cook patties in the hot oil until browned, 4 to 5 minutes per side.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "2436193.jpg",
    "o": "",
    "st": "allrecipes"
}