{
    "id": 232276,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "2 pounds skinless, boneless chicken thighs",
        "salt and ground black pepper to taste",
        "1 bulb fennel, cut into 1/4-inch thick slivers",
        "1 yellow onion, cut into 1/4-inch thick slivers",
        "1/2 teaspoon fennel seeds",
        "4 cloves garlic, sliced",
        "1 tablespoon chopped fresh thyme",
        "1 dried chile de arbol pepper",
        "1/2 cup white wine",
        "1 (28 ounce) can whole peeled tomatoes in puree",
        "1/2 cup pitted and halved Castelvetrano olives",
        "2 tablespoons chopped fennel greens (optional)",
        "2 tablespoons chopped fresh flat-leaf parsley (optional)",
        "1 teaspoon lemon zest (optional)"
    ],
    "nut": [
        "Calories > 313 kcal",
        "Carbs > 13.4 g",
        "Cholesterol > 93 mg",
        "Fat > 15.1 g",
        "Protein > 27.9 g",
        "Sodium > 638 mg"
    ],
    "n": "Oven-Braised Chicken Thighs with Fennel and Castelvetrano Olives",
    "a": "sarahkai",
    "r": "0",
    "s": 6,
    "des": "\"This recipe is infinitely variable. It can serve as a stand-alone stew with a side of crusty bread or a sauce over noodles, rice, or potatoes. I follow a paleo diet and serve it on zucchini noodles with a side of broccoli raab cooked with anchovy, garlic, and lemon. The sweetness of the onions and fennel counters the bitterness of the broccoli raab beautifully.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a large, heavy cast-iron skillet or Dutch oven over medium-high heat. Season chicken thighs with salt and black pepper. Brown chicken in the hot oil, about 5 minutes per side. Meat will still be pink inside. Transfer chicken into a bowl, leaving drippings in skillet.\nTurn heat down to medium; cook fennel, onion, and fennel seeds in the hot oil, stirring occasionally, until onion and fennel begin to caramelize, about 10 minutes. Stir garlic, thyme, and chile de arbol pepper into fennel mixture.  Cook until garlic is fragrant, about 1 more minute. Stir white wine into fennel mixture, scraping up and dissolving any browned bits of food on the bottom of the skillet.\nPour tomatoes with puree into skillet and bring to a boil. Break tomatoes into large chunks with a wooden spoon; adjust salt and pepper. Add chicken thighs, any accumulated drippings from chicken, and olives to the skillet and stir to combine.\nBake uncovered in the preheated oven until the chicken thighs are no longer pink inside, about 45 minutes. Let cool 5 to 10 minutes before serving. Sprinkle with fennel greens, flat-leaf parsley, and lemon zest.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "3828008.jpg",
    "o": "",
    "st": "allrecipes"
}