{
    "id": 232250,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (16 ounce) packages extra-wide egg noodles",
        "1/4 cup extra-virgin olive oil, or as needed",
        "1 onion, diced",
        "1 green bell pepper, diced",
        "2 stalks celery, diced",
        "5 cloves garlic, diced",
        "1/2 cup fresh parsley",
        "1 1/2 tablespoons chopped fresh sage",
        "2 tablespoons chopped fresh basil",
        "1 lemon, zested and juiced",
        "2 (32 ounce) cartons seafood stock (such as Kitchen BasicsÂ®), divided",
        "1 teaspoon dried thyme",
        "1 tablespoon dried cilantro",
        "1/2 teaspoon dried dill weed",
        "sea salt and ground black pepper to taste",
        "1 (12 ounce) package frozen peeled crawfish tails, thawed and undrained",
        "2 pounds peeled and deveined small shrimp",
        "3 tablespoons cornstarch",
        "1 cup half-and-half",
        "2 tablespoons Creole seasoning (such as Zatarain'sÂ®)"
    ],
    "nut": [
        "Calories > 483 kcal",
        "Carbs > 59.8 g",
        "Cholesterol > 217 mg",
        "Fat > 12.7 g",
        "Protein > 31.6 g",
        "Sodium > 695 mg"
    ],
    "n": "Zesty Seafood Pasta",
    "a": "charlotte",
    "r": "0",
    "s": 12,
    "des": "\"I made this for Easter and got a family request to make it again for Mother's Day. These amounts are for the family, so it makes quite a bit. The time took longer for me because of the amount of shrimp I had to peel, but if you cut this recipe down, it won't take you so long. This time I also included crawfish. Oh ya'll gotta try it! Enjoy!\"",
    "ins": "Bring a large pot of generously salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, 5 to 10 minutes. Drain and transfer to a bowl.\nHeat olive oil in a large pot over low heat; cook and stir onion, bell pepper, celery, and garlic in the hot oil until onion is lightly browned, 15 to 20 minutes.\nMix parsley, sage, basil, and lemon zest in a bowl; stir into onion mixture. Cook until fragrant, 2 to 3 minutes.\nPour 1 cup seafood stock in a measuring cup and set aside; pour remaining stock and lemon juice into onion mixture. Stir in thyme, cilantro, dill, sea salt, and black pepper; cook until flavors have blended, about 5 minutes. Add crawfish to seasoned stock mixture; cook until crawfish are heated through, 3 to 4 minutes.\nStir shrimp into crawfish mixture; cook until shrimp are pink and cooked through, about 5 more minutes. Remove crawfish and shrimp from sauce using a slotting spoon; transfer to a bowl and cover.\nWhisk cornstarch into reserved 1 cup seafood stock until completely dissolved; stir into sauce. Cook, stirring constantly, at a simmer until sauce has thickened, about 5 minutes.\nMix half-and-half and Creole seasoning into sauce until fully incorporated and warmed; add crawfish and shrimp back into sauce. Toss sauce with egg noodles.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "1006909.jpg",
    "o": "",
    "st": "allrecipes"
}