{
    "id": 232319,
    "old_rating": "4.54545",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup dry white wine",
        "1/4 cup water",
        "2 tablespoons dried oregano",
        "2 teaspoons ground black pepper",
        "1 teaspoon salt",
        "2 large skinless, boneless chicken breast halves",
        "1 pinch red pepper flakes, or to taste",
        "2 roma tomatoes, chopped",
        "2 large mushrooms, sliced",
        "1 clove garlic, chopped",
        "1/4 cup grated Parmesan cheese, divided",
        "2 slices prosciutto",
        "4 ounces Brie cheese, cut into 1/4-inch slices"
    ],
    "nut": [
        "Calories > 652 kcal",
        "Carbs > 11.3 g",
        "Cholesterol > 207 mg",
        "Fat > 29.4 g",
        "Protein > 67.7 g",
        "Sodium > 2075 mg"
    ],
    "n": "Baked Italian Chicken Breast with Brie",
    "a": "RaquelitaRod",
    "r": "0",
    "s": 2,
    "des": "\"Relatively simple baked boneless chicken breast with Italian flavorings topped with melted Brie...aka suuuuper yummy. Good for a romantic dinner (you can skip the garlic) or to impress family and friends. This dish is really fun because you can customize it easily. For example, instead of prosciutto try sliced artichoke hearts, or try a different soft cheese on top. Make it more southwestern with pepperjack cheese, light beer, and bell peppers. Guys love it.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPour white wine and water into a 9x13-inch baking dish.\nMix oregano, black pepper, and salt together in a bowl; massage oregano mixture onto both sides of chicken breasts. Arrange coated chicken breasts in the baking dish; sprinkle with red pepper flakes.\nBake chicken in the preheated oven for 25 minutes. Place tomatoes, mushrooms, and garlic around the chicken breasts; sprinkle 2 tablespoons Parmesan cheese over chicken and vegetables. Continue baking until chicken is no longer pink in the center and the juices run clear, about 15 more minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nSprinkle remaining 2 tablespoons Parmesan cheese over chicken; top each chicken breast with 1 slice prosciutto and 2 to 3 slices Brie cheese diagonally atop prosciutto.\nBake until Brie cheese is melted, 5 to 10 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "1031914.jpg",
    "o": "",
    "st": "allrecipes"
}