{
    "id": 232325,
    "old_rating": "2.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 whole chicken",
        "1 (10 ounce) can diced tomatoes with habanero peppers (such as RO*TELÂ® Hot)",
        "1 green bell pepper, diced",
        "1 large onion, diced",
        "3 jalapeno chile peppers, seeded and diced",
        "2 (1 ounce) packets taco seasoning mix, divided",
        "2 tablespoons canola oil, or as needed",
        "1 (15 ounce) package flour tortillas"
    ],
    "nut": [
        "Calories > 219 kcal",
        "Carbs > 20.5 g",
        "Cholesterol > 25 mg",
        "Fat > 9.8 g",
        "Protein > 11.2 g",
        "Sodium > 509 mg"
    ],
    "n": "Yummy Chicken Burritos",
    "a": "smellow",
    "r": "0",
    "s": 15,
    "des": "\"I used to beg my mom for these; now I make them for my son. Serve with beans, tomatoes, lettuce, sour cream, salsa, and cheese.\"",
    "ins": "Place chicken, tomatoes with habanero peppers, green bell pepper, onion, jalapeno chile peppers, and 1 packet taco seasoning in a large pot; pour in enough water to just cover chicken.\nBring chicken and vegetables to a boil, reduce heat to low, and simmer until chicken is no longer pink inside, about 1 1/2 hours. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 165 degrees F (74 degrees C).\nRemove chicken from the pot and let cool. Pull chicken meat off the bones and cut into bite-sized pieces; discard carcass. Pour off about half the liquid from the pot, making sure all the vegetables stay. Return chicken meat to pot; add the remaining 1 packet taco seasoning. Simmer until flavors have blended, about 10 minutes.\nHeat canola oil in a large skillet over medium heat; fry tortillas, working in batches, in the hot oil until desired crispness is reached, 1 to 2 minutes per side. Spoon chicken mixture into each tortilla to serve.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "2253182.jpg",
    "o": "",
    "st": "allrecipes"
}