{
    "id": 232309,
    "old_rating": "4.68571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 spaghetti squash, halved and seeded",
        "1 tablespoon olive oil",
        "2 small green bell peppers, diced",
        "1 onion, diced",
        "2 cloves garlic, minced",
        "1 pound lean ground turkey",
        "1 (15 ounce) can black beans",
        "1/4 cup sun-dried tomatoes",
        "1 (6 ounce) can tomato sauce",
        "1 cube chicken bouillon",
        "1 tablespoon chili powder",
        "1 tablespoon garlic powder",
        "1 teaspoon seasoned salt",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon red pepper flakes (optional)"
    ],
    "nut": [
        "Calories > 334 kcal",
        "Carbs > 35.8 g",
        "Cholesterol > 67 mg",
        "Fat > 11.3 g",
        "Protein > 26.4 g",
        "Sodium > 1068 mg"
    ],
    "n": "Mexican Spaghetti Squash Stir Fry",
    "a": "Emily",
    "r": "0",
    "s": 5,
    "des": "\"This recipe is great because it is so versatile. You can use up those veggies that are on their last leg or really make it fancy for a special occasion too! Kid-friendly, fast, and easy. Garnish with a sprinkle of shredded cheese or sour cream if desired.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace spaghetti squash halves, cut sides down, on a baking sheet.\nBake in the preheated oven until flesh is tender and easily shreds when punctured with a fork, 20 to 30 minutes. Carefully shred flesh with a fork until it resembles spaghetti.\nHeat olive oil in a skillet over medium heat; cook and stir bell peppers, onion, and garlic in the hot oil until slightly tender, 3 to 5 minutes. Add ground turkey to vegetable mixture; cook and stir until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nMix black beans, sun-dried tomatoes, tomato sauce, chicken bouillon, chili powder, garlic powder, seasoned salt, cumin, and red pepper flakes into ground turkey mixture; cook until heated through and flavors have blended, about 10 minutes.\nSpoon spaghetti squash onto each plate; top with ground turkey mixture.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "4459918.jpg",
    "o": "",
    "st": "allrecipes"
}