{
    "id": 232307,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cake:",
        "4 eggs, separated",
        "2 cups confectioners' sugar",
        "1 cup butter, softened",
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1 cup brewed strong coffee, cooled",
        "1 cup chocolate sprinkles (jimmies)",
        "Frosting:",
        "2 cups confectioners' sugar",
        "1/2 cup butter, softened",
        "2 tablespoons cocoa powder",
        "2 tablespoons hot brewed coffee",
        "2 teaspoons vanilla extract"
    ],
    "nut": [
        "Calories > 549 kcal",
        "Carbs > 70.4 g",
        "Cholesterol > 123 mg",
        "Fat > 28.3 g",
        "Protein > 5 g",
        "Sodium > 272 mg"
    ],
    "n": "Mocha Chocolate Jimmy Cake",
    "a": "jgelder",
    "r": "0",
    "s": 12,
    "des": "\"This is a cake my mom used to make for my birthday and whenever I would ask her to make it.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 10-inch tube pan.\nBeat egg whites in a glass or metal bowl until soft peaks form. Lift your beater or whisk straight up: the egg whites will form soft mounds rather than a sharp peak.\nBeat 2 cups confectioners' sugar and 1 cup butter together in a bowl until creamy; add egg yolks, 1 at a time, until fully incorporated.\nMix flour and baking powder together in a bowl. Stir flour mixture into creamed butter mixture, alternating with cooled coffee until just mixed; mix in sprinkles. Fold egg whites into batter. Pour batter into the prepared pan.\nBake in the preheated oven until edges of cake pull away from sides and a toothpick inserted in the center comes out clean, about 1 hour. Cool cake in pan for 1/2 hour before turning onto a serving plate.\nBeat 2 cups confectioners' sugar, 1/2 cup butter, and cocoa powder together in a bowl until smooth; beat in hot coffee and vanilla extract until frosting is creamy. Spread frosting onto cooled cake.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "2 h",
    "i": "2299177.jpg",
    "o": "",
    "st": "allrecipes"
}