{
    "id": 232378,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (1-inch thick) pork chops",
        "salt and ground black pepper to taste",
        "1 2/3 tablespoons olive oil, divided",
        "1/2 onion, minced",
        "2 cloves garlic, minced",
        "1 pint cherry tomatoes",
        "1 tablespoon brown sugar",
        "1/4 cup bourbon whiskey",
        "3/4 cup beef broth",
        "1 tablespoon minced fresh flat-leaf parsley"
    ],
    "nut": [
        "Calories > 349 kcal",
        "Carbs > 10 g",
        "Cholesterol > 79 mg",
        "Fat > 15.3 g",
        "Protein > 33 g",
        "Sodium > 203 mg"
    ],
    "n": "Pork Chops with Bourbon Tomatoes",
    "a": "Nattygirl",
    "r": "0",
    "s": 4,
    "des": "\"A great dish I created when I had an abundance of cherry tomatoes. My family loves this dish. This recipe can easily stretch for six. Just cook two extra chops. Make sure to reduce liquids before adding pork, so as not to boil them. Pork will finish cooking very quickly, so be careful not to overcook.\"",
    "ins": "Season pork chops with salt and black pepper.\nHeat 1 tablespoon olive oil in a large skillet over medium-high heat. Cook pork chops in hot oil until nearly cooked through, 3 to 5 minutes per side. Remove pork chops to a plate, retaining oil and drippings in the skillet.\nPour 1 teaspoon olive oil to the reserved drippings and reduce heat to medium. Cook and stir onion in oil mixture until translucent, about 5 minutes. Stir garlic into onion; cook and stir until fragrant, 1 to 2 minutes. Remove onion mixture to a bowl.\nPour remaining 1 teaspoon oil into the skillet and increase heat to medium-high. Add tomatoes to oil and cook until seared on all sides and the skins begin to crack, about 10 minutes. Sprinkle brown sugar over the tomatoes; stir.\nPour bourbon over the tomatoes; bring to a simmer and cook until some of the alcohol evaporates, about 2 minutes. Add onion mixture and beef broth to the tomatoes; bring to a simmer and cook until the liquid reduces by half and the tomatoes are soft, about 5 minutes.\nReturn pork chops and juices to the skillet, cook until no longer pink in the center, about 3 minutes per side. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Serve dish sprinkled with parsley.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "1489293.jpg",
    "o": "",
    "st": "allrecipes"
}