{
    "id": 232373,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 pound Italian sausage links, casings removed",
        "1 small onion, sliced",
        "1 green bell pepper, diced",
        "1/2 cup sliced fresh mushrooms, or more to taste",
        "2 (8 ounce) cans pizza sauce",
        "1 cup shredded mozzarella cheese, divided",
        "1 (8 ounce) package refrigerated crescent roll dough (such as PillsburyÂ®)"
    ],
    "nut": [
        "Calories > 630 kcal",
        "Carbs > 40.2 g",
        "Cholesterol > 63 mg",
        "Fat > 38 g",
        "Protein > 28.3 g",
        "Sodium > 2174 mg"
    ],
    "n": "Upside-Down Pizza Pot Pie",
    "a": "Mrs. Mistry",
    "r": "0",
    "s": 4,
    "des": "\"Individual pot pies that taste like pizza! The recipe is great to follow as is, or get creative and add your own favorite toppings! A great dish for kids and adults! This can be accompanied with a salad.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Spray the insides of 4 ramekins.\nHeat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 10 minutes; drain and discard grease. Add onion, green bell pepper, and mushrooms; cook and stir until vegetables are softened, 2 to 3 minutes. Pour in pizza sauce and simmer until flavors have blended, 5 to 10 minutes. Stir 1/4 cup mozzarella cheese into sausage mixture.\nSpoon 1/4 the sausage mixture into each prepared ramekin; top each with 1/4 the remaining mozzarella cheese.\nRoll out the crescent roll dough; cut the dough into 4 equal pieces. Cover each ramekin with 1/4 the crescent roll dough, wrapping the dough around the edges to seal in the fillings. Arrange the pot pies on a baking sheet.\nBake in the preheated oven until dough is light golden brown, 10 to 12 minutes. Allow to cool for 10 minutes before serving.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}