{
    "id": 232370,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "olive oil cooking spray",
        "2 egg whites",
        "1/2 cup cranberries",
        "2 tablespoons water",
        "1 1/2 cups almonds",
        "1 1/2 cups coconut flour",
        "1/2 cup unsweetened coconut milk",
        "1 ripe banana, mashed",
        "1/2 cup unsweetened applesauce",
        "1 teaspoon vanilla extract",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground nutmeg"
    ],
    "nut": [
        "Calories > 197 kcal",
        "Carbs > 21.2 g",
        "Cholesterol > 0 mg",
        "Fat > 10.6 g",
        "Protein > 6.6 g",
        "Sodium > 8 mg"
    ],
    "n": "Healthy (No Sugar/Butter Added) Almond and Coconut Squares",
    "a": "RockingJuliaCooks",
    "r": "0",
    "s": 16,
    "des": "\"This is my new way of making sweets that can be served as healthy end of the meal or even with breakfast, or for a tea break, without adding butter or sugar. Sweetness comes from banana and cranberries. For added sweetness it can be topped with fruit and covered in light syrup. It can serve as a nice base for a fruit tart.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking pan with cooking spray.\nBeat egg whites with an electric mixer in a bowl until fluffy, about 5 minutes.\nSoak cranberries in water in a separate bowl for 10 to 15 minutes.\nPulse almonds in a food processor until coarsely chopped; add coconut flour. Pulse until blended. Transfer almond mixture to a bowl.\nBlend cranberry mixture and coconut milk in the food processor until evenly combined.\nStir mashed banana into almond mixture using a rubber spatula. Mix cranberry mixture and applesauce into almond-banana mixture until mixture is dense and pliable. Stir in vanilla extract, cinnamon, and nutmeg. Fold egg whites into mixture until just combined. Spread mixture into the prepared baking pan; tap pan gently on the counter to evenly spread mixture.\nBake in the preheated oven until edges are lightly browned, about 45 minutes. Cool for 20 minutes before cutting into squares.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "1115742.jpg",
    "o": "",
    "st": "allrecipes"
}