{
    "id": 232476,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons olive oil, or as needed",
        "1 large sweet onion, chopped",
        "4 cloves garlic, minced",
        "8 chicken breast tenders",
        "1/2 pound baby spinach, or more to taste",
        "1 (20 ounce) jar marinara sauce",
        "1 (16 ounce) package fettuccine",
        "8 ounces grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 474 kcal",
        "Carbs > 55.4 g",
        "Cholesterol > 58 mg",
        "Fat > 13.9 g",
        "Protein > 32.2 g",
        "Sodium > 774 mg"
    ],
    "n": "Easy and Healthy Chicken Florentine",
    "a": "mollykins",
    "r": "0",
    "s": 8,
    "des": "\"This is the optimal flavor marriage of tomatoes and spinach. This recipe always comes out right! It's delicious, warm and doesn't have the unnecessary and unhealthy breading.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nHeat olive oil in a large skillet over medium heat; cook and stir onion in the hot oil until just fragrant, 3 to 5 minutes. Add garlic and cook for about 45 seconds. Mix chicken tenders into onion mixture; cook until chicken is browned, 3 to 4 minutes per side. Transfer chicken mixture to a 9x13-inch baking dish.\nCover chicken mixture with spinach; pour marinara sauce over spinach layer. Cover the baking dish with aluminum foil.\nBake in the preheated oven until chicken is no longer pink in the center and spinach is wilted, about 30 minutes.\nFill a large pot with lightly salted water and bring to a rolling boil. Stir in the fettuccine, bring back to a boil, and cook pasta over medium heat until cooked through but still firm to the bite, about 8 minutes. Drain and transfer fettuccine to serving plates.\nTop each plate with chicken-marinara mixture; garnish each serving with Parmesan cheese.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "1123919.jpg",
    "o": "4506524.jpg,4505312.jpg,4496725.jpg,4469909.jpg,3844943.jpg,2832187.jpg",
    "st": "allrecipes"
}