{
    "id": 232422,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 poblano peppers",
        "1 teaspoon salt",
        "2 cups cotija cheese, divided",
        "1 cup all-purpose flour",
        "1/2 cup vegetable oil for frying",
        "2 eggs, separated"
    ],
    "nut": [
        "Calories > 443 kcal",
        "Carbs > 31.6 g",
        "Cholesterol > 162 mg",
        "Fat > 25.7 g",
        "Protein > 21.9 g",
        "Sodium > 1375 mg"
    ],
    "n": "Chiles Rellenos Autenticos",
    "a": "rmkrogman",
    "r": "0",
    "s": 4,
    "des": "\"This authentic recipe for chiles rellenos (stuffed chile peppers) was adapted from the advice of several Hispanic friends. Serve with salsa and a sprinkling of cheese. Give it a try!\"",
    "ins": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\nBring a pot of lightly salted water to a boil. Prepare a large bowl of ice water.\nPlace poblano peppers on a baking sheet. Broil until skin bubbles and areas of burned skin appear. Dip peppers into boiling water for about 30 seconds, then place immediately into ice water. When peppers are chilled, remove skin. Slit peppers lengthwise and remove veins and seeds.\nStuff each pepper with 1/4 the cotija cheese and secure pepper openings closed with toothpicks. Place flour into a shallow bowl and dip each pepper in the flour; set aside for coating to set.\nHeat vegetable oil in a large skillet over medium heat.\nBeat egg whites in a glass or metal bowl until stiff peaks form. Lift your beater or whisk straight up: the tip of the peak formed by the egg whites should stand up. Gently whisk egg yolks into whites. Dip floured peppers into egg mixture to coat.\nFry peppers in the hot oil until browned and the cheese has melted, flipping once, about 5 minutes per side.",
    "pt": "35 m",
    "ct": "15 m",
    "tt": "55 m",
    "i": "1120099.jpg",
    "o": "",
    "st": "allrecipes"
}