{
    "id": 232403,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 slices thin-sliced bacon, cut into 1-inch pieces",
        "2 slices rustic country bread",
        "4 teaspoons butter, softened",
        "2 green onions (white and light green parts only), minced",
        "3 ounces thinly sliced Havarti cheese",
        "3 ounces sliced deli ham",
        "2 eggs",
        "4 thin slices ripe tomato",
        "4 inner leaves of romaine lettuce, ribs removed"
    ],
    "nut": [
        "Calories > 962 kcal",
        "Carbs > 31.6 g",
        "Cholesterol > 564 mg",
        "Fat > 72.1 g",
        "Protein > 49.3 g",
        "Sodium > 2287 mg"
    ],
    "n": "BLOTCHE aka Widow maker",
    "a": "HappyGrandma",
    "r": "0",
    "s": 1,
    "des": "\"A BLT on steroids. The guys love this sandwich! A man's sandwich. B=bacon, L=lettuce, O=onion, T=tomato, C=cheese, H=ham, E=egg.\"",
    "ins": "Place the bacon in a skillet and cook over medium-high heat, turning occasionally, until crisp, about 10 minutes. Drain the bacon pieces on paper towels; retain bacon drippings in skillet.\nBrush 1 side of each bread slice with bacon drippings and the other side of bread slices with 1 teaspoon butter. Use a paper towel to wipe remaining drippings from skillet.\nLay a piece of bread, buttered side down, on a plate. Sprinkle with half the green onions and spread half the Havarti cheese, all the ham, remaining Havarti cheese, remaining half of the green onions, and remaining bread slice with buttered side up.\nPan-fry the sandwich until bread is toasted golden brown and Havarti cheese has melted, 2 to 3 minutes per side. Transfer to a plate.\nMelt remaining 2 teaspoons butter in skillet over medium heat. Gently crack eggs into hot butter and cook until whites are set and yolks are runny. Gently turn eggs over and cook just until tops of egg whites are set (for over easy eggs).\nPull the sandwich apart between ham slices and lay tomato slices, romaine lettuce leaves, and eggs onto half the sandwich; replace top. Cut sandwich in half between the 2 eggs and serve.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "1009024.jpg",
    "o": "",
    "st": "allrecipes"
}