{
    "id": 232431,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 acorn squash, halved and seeded",
        "1 1/2 teaspoons dark brown sugar",
        "1/4 teaspoon ground cinnamon",
        "salt and ground black pepper to taste",
        "1 tablespoon butter, cut in small pieces",
        "1 (16 ounce) package maple-flavored breakfast sausage",
        "1 cup cooked wild rice",
        "1/2 cup dried cranberries",
        "1/4 cup chicken stock"
    ],
    "nut": [
        "Calories > 506 kcal",
        "Carbs > 49.3 g",
        "Cholesterol > 73 mg",
        "Fat > 27.7 g",
        "Protein > 19.1 g",
        "Sodium > 1085 mg"
    ],
    "n": "Autumn Stuffed Acorn Squash",
    "a": "CleopatrasCat",
    "r": "0",
    "s": 4,
    "des": "\"I only make this recipe in autumn since the flavors are so fall-like. The hint of maple syrup and warm cranberries really sets it off. This is nice enough for company and pairs wonderfully with crusty bread and a full bodied white wine. My hubby starts asking for it as early as late August!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nArrange squash halves, cut-side up, in a roasting pan. Run a fork through the meat of each half, creating grooves. Sprinkle with brown sugar, cinnamon, salt, and pepper; dot with butter pieces.\nBake in the preheated oven until meat is tender enough to puncture with a fork, 30 to 40 minutes.\nHeat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add wild rice, cranberries, and chicken stock; cook and stir until rice and cranberries have absorbed the chicken stock, about 5 minutes.\nSpoon the sausage filling into each squash half. Return stuffed squash to oven and bake until flavors have blended, 5 to 10 minutes.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "4014941.jpg",
    "o": "",
    "st": "allrecipes"
}