{
    "id": 232590,
    "old_rating": "4.65385",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 large beets",
        "1 tablespoon olive oil",
        "salt and ground black pepper to taste",
        "1 bunch fresh kale, cut into bite-size pieces",
        "1/2 cup chopped cashews",
        "1/4 cup dried cherries",
        "2 tablespoons golden raisins",
        "1/2 cup apple cider",
        "1/2 lemon, juiced",
        "1 tablespoon Dijon mustard",
        "2 cloves garlic, minced",
        "2 teaspoons apple cider vinegar",
        "2 tablespoons olive oil, or more to taste"
    ],
    "nut": [
        "Calories > 263 kcal",
        "Carbs > 34.1 g",
        "Cholesterol > 0 mg",
        "Fat > 12.8 g",
        "Protein > 6.7 g",
        "Sodium > 294 mg"
    ],
    "n": "Roasted Beet and Kale Salad",
    "a": "sabrinabean7",
    "r": "0",
    "s": 6,
    "des": "\"This is an incredibly tasty salad that is packed full of nutrients and vitamins! It is also one that will keep you feeling satisfied longer than most.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil.\nTrim roots and stems from beets. Coat beets with 1 tablespoon olive oil and sprinkle with salt and black pepper. Place beets onto prepared baking sheet.\nRoast beets for 30 minutes; turn beets over and continue roasting until tender, 30 minutes to 1 hour more. Let beets cool. Peel skins from beets and cut into 1-inch cubes. Toss cooked beets with kale, cashews, dried cherries, and golden raisins in a large salad bowl.\nWhisk apple cider, lemon juice, Dijon mustard, garlic, and cider vinegar in a bowl. Slowly drizzle 2 tablespoons olive oil into apple cider mixture, whisking constantly, until dressing is combined. Pour dressing over salad and toss to coat. Refrigerate at least 1 hour for flavors to blend before serving.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "2 h ",
    "i": "1054505.jpg",
    "o": "4466967.jpg,4306140.jpg,3976613.jpg,2871503.jpg,2721582.jpg,2207638.jpg",
    "st": "allrecipes"
}