{
    "id": 232537,
    "old_rating": "4.63158",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 cups milk",
        "1 tablespoon vinegar",
        "3/4 cup white sugar",
        "1/2 cup butter, softened",
        "2 eggs",
        "1 egg yolk",
        "1 tablespoon freshly grated lemon zest (optional)",
        "1 1/2 cups rice flour",
        "1 cup cornmeal",
        "4 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 cup blueberries",
        "1 tablespoon raw sugar, or to taste (optional)"
    ],
    "nut": [
        "Calories > 272 kcal",
        "Carbs > 42 g",
        "Cholesterol > 70 mg",
        "Fat > 9.9 g",
        "Protein > 4.3 g",
        "Sodium > 338 mg"
    ],
    "n": "Delicious Gluten-Free Blueberry Corn Muffins",
    "a": "jstorment",
    "r": "0",
    "s": 12,
    "des": "\"After I was diagnosed with a gluten sensitivity, I played around with various recipes so that I could not only eat food that worked with my system, but also enjoy it. I love this blueberry muffin almost as much as the original, all-purpose flour version, and the rest of my family can enjoy it too without feeling like it's a sacrifice. I generally use brown rice flour, but white rice flour may yield a fluffier muffin. I personally like the texture the cornmeal adds, but for a more traditional muffin, feel free to do all rice flour (maybe half brown, half white).\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line 12 muffin cups with paper liners.\nStir milk and vinegar together in a small bowl; set aside to sour for 3 to 5 minutes.\nBeat white sugar and butter together in a bowl using an electric mixer until creamy and smooth. Add eggs, egg yolk, soured milk, and lemon zest; beat until smooth, scraping down sides of bowl as needed.\nMix rice flour, cornmeal, baking powder, and salt in a bowl; slowly stir flour mixture into creamed butter mixture until just mixed. Gently fold in blueberries. Pour batter into the prepared muffin cups, filling each about 3/4 full. Sprinkle each muffin with raw sugar.\nBake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, 18 to 20 minutes.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "1394568.jpg",
    "o": "",
    "st": "allrecipes"
}