{
    "id": 232592,
    "old_rating": "4.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon dark brown sugar",
        "1 tablespoon honey",
        "1 (.25 ounce) package active dry yeast",
        "1 cup warm water - 100 to 110 degrees F (40 to 45 degrees C)",
        "3 tablespoons unsalted butter, melted",
        "2 tablespoons half-and-half",
        "1 1/2 teaspoons salt",
        "2 cups bread flour, or more if needed",
        "1 teaspoon unsalted butter",
        "cooking spray",
        "5 tablespoons baking soda",
        "3 tablespoons honey, or to taste (optional)",
        "1/2 teaspoon salt",
        "1 teaspoon unsalted butter, melted (optional)"
    ],
    "nut": [
        "Calories > 288 kcal",
        "Carbs > 47.5 g",
        "Cholesterol > 20 mg",
        "Fat > 8.5 g",
        "Protein > 6.2 g",
        "Sodium > 3719 mg"
    ],
    "n": "DSF's Pretzel Bread",
    "a": "DrSeussFreak",
    "r": "0",
    "s": 6,
    "des": "\"So, I have been on a search for the perfect pretzel recipe for a long time, as I LOVE pretzels. I found a recipe online, and did a complete overhaul to have the pretzel taste I love so much.\n\n The great thing about this recipe is that if you want pretzels in the traditional form or loaves, they both taste amazing.\"",
    "ins": "Stir dark brown sugar, 1 tablespoon honey, and yeast into warm water in a large bowl, dissolving sugar and yeast. Let stand until a foamy layer forms on the water, about 10 minutes. Stir 3 tablespoons melted butter, half-and-half, and salt into yeast mixture.\nBeat 1 cup flour to wet ingredients, forming a wet, sloppy dough. Turn dough out onto a floured work surface and gradually knead remaining 1 cup flour into dough until dough is only slightly sticky, about 10 more minutes. Add more flour if dough is too wet. Form dough into a ball.\nGrease a large bowl with 1 teaspoon butter; place dough ball into bowl and turn to lightly coat with butter. Cover bowl with plastic wrap and let rise in a warm area until doubled, 1 hour to 1 hour and 30 minutes.\nPreheat oven to 450 degrees F (230 degrees C). Spray a baking sheet with cooking spray.\nStir baking soda and 3 tablespoons honey (if you like a sweeter crust) into a large pot of water and bring to a full rolling boil. Punch down dough and divide in half. Form each half into a small loaf. Carefully drop a loaf into the boiling water and cook for 30 seconds on each side. Dough should float. Remove loaf gently and let excess water drip off; place loaf on prepared baking sheet. Boil the second loaf, following same steps, and place onto baking sheet.\nSprinkle each loaf lightly with salt. Use a sharp knife to cut an X shape into the top of each loaf.\nBake on a center rack in preheated oven for 10 minutes. Reduce oven temperature to 400 degrees F (205 degrees C) and continue baking until crust is shiny and browned and loaves are done in the middle, 10 more minutes. For a softer crust, brush tops of loaves with melted butter.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "2 h",
    "i": "3487288.jpg",
    "o": "",
    "st": "allrecipes"
}