{
    "id": 232587,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (8 ounce) package spaghetti",
        "1/4 cup olive oil, divided",
        "1 (10 ounce) package fresh spinach",
        "1 zucchini, chopped",
        "1 yellow squash, chopped",
        "2 tablespoons pine nuts, or to taste",
        "2 teaspoons minced garlic",
        "1 pound uncooked medium shrimp, peeled and deveined",
        "4 teaspoons lemon juice, divided",
        "2 teaspoons chopped fresh parsley",
        "1 teaspoon red pepper flakes",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 479 kcal",
        "Carbs > 50 g",
        "Cholesterol > 173 mg",
        "Fat > 18.1 g",
        "Protein > 30.1 g",
        "Sodium > 265 mg"
    ],
    "n": "Shrimp Spaghetti in Olive Oil Dressing",
    "a": "Shelly Domke",
    "r": "0",
    "s": 4,
    "des": "\"A light, flavorful, quick, and easy gourmet dinner. My husband was impressed, and I eye-balled most of it, but here's what I came up with. Has a little kick, but not enough to overwhelm the clean flavors of the fresh ingredients.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 12 minutes. Drain and return spaghetti to the pot.\nHeat 1 tablespoon olive oil in a skillet over medium heat; cook and stir spinach, zucchini, squash, pine nuts, and garlic in hot oil until vegetables are tender, 5 to 7 minutes. Transfer mixture to a bowl.\nHeat another 1 tablespoon olive oil in the same skillet over medium heat; cook and stir shrimp and 2 teaspoons lemon juice until shrimp are bright pink and centers are opaque, about 5 minutes. Remove from heat.\nCombine remaining 2 tablespoons olive oil, 2 teaspoons lemon juice, parsley, and red pepper flakes in a bowl. Season with salt and pepper.\nStir vegetable mixture, shrimp, and olive oil mixture into spaghetti until combined.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "3727114.jpg",
    "o": "",
    "st": "allrecipes"
}