{
    "id": 232699,
    "old_rating": "4.23529",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 zucchinis, sliced",
        "2 onions, sliced",
        "3 tablespoons olive oil",
        "salt and ground black pepper to taste",
        "1 (16 ounce) package penne pasta",
        "1 (28 ounce) jar marinara sauce",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 375 kcal",
        "Carbs > 59.5 g",
        "Cholesterol > 6 mg",
        "Fat > 10.6 g",
        "Protein > 12.3 g",
        "Sodium > 490 mg"
    ],
    "n": "Roasted Zucchini Casserole",
    "a": "Carol Semenuk",
    "r": "0",
    "s": 8,
    "des": "\"Roasted zucchini with onion and layered with marinara sauce and pasta. A meal-in-one with a salad and rolls. Can't get better than that! A great way to use up your zucchini crop in the summer..\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nToss zucchinis and onions in a large bowl with olive oil until evenly coated. Spread vegetables into a large baking dish.\nRoast vegetables in the preheated oven until golden, about 30 minutes. Season with salt and pepper. Reduce oven heat to 350 degrees F (175 degrees C).\nFill a large pot with lightly salted water and bring to a boil. Stir in penne and return to a boil. Cook pasta uncovered, stirring occasionally, until cooked through but still firm to the bite, about 11 minutes; drain.\nLightly grease a 9x13-inch baking dish.\nHeat marinara sauce in a saucepan over medium heat until sauce is hot. Spread hot marinara sauce into the prepared baking dish, followed by penne pasta and zucchini mixture. Sprinkle Parmesan cheese atop vegetables.\nBake in the preheated oven until sauce is bubbly, 35 to 40 minutes. Allow casserole to rest for 5 minutes before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1632211.jpg",
    "o": "1632209.jpg,1338606.jpg,1112118.jpg,1072124.jpg,1058225.jpg,1045564.jpg",
    "st": "allrecipes"
}