{
    "id": 232700,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup blanched slivered almonds",
        "3 large eggs",
        "1 1/2 teaspoons vanilla extract",
        "1 teaspoon almond extract",
        "2 1/4 cups all-purpose flour",
        "3/4 cup white sugar",
        "1 teaspoon baking powder",
        "1/8 teaspoon salt"
    ],
    "nut": [
        "Calories > 90 kcal",
        "Carbs > 13.9 g",
        "Cholesterol > 20 mg",
        "Fat > 2.6 g",
        "Protein > 2.5 g",
        "Sodium > 36 mg"
    ],
    "n": "Crunchy Almond Biscotti",
    "a": "kel7298",
    "r": "0",
    "s": 28,
    "des": "\"No oil or butter added. These cookies are very crispy and crunchy.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spread almonds on a baking sheet.\nToast almonds in the preheated oven until lightly browned and fragrant, 8 to 10 minutes. Allow almonds to cool.\nReduce oven heat to 300 degrees F (150 degrees C). Lightly grease a baking sheet.\nLightly beat eggs, vanilla extract, and almond extract in a bowl. Combine flour, sugar, baking powder, and salt in another bowl. Gradually beat egg mixture into flour mixture with an electric mixer until dough comes together. Add toasted almonds and mix until just incorporated.\nTurn dough out on a lightly floured surface and shape dough into a 3x14-inch log. Transfer log to prepared baking sheet.\nBake in the preheated oven until firm to the touch, 30 to 40 minutes. Allow log to cool on a wire rack for 10 minutes. Transfer log to a cutting board and cut into 1/2-inch thick slices, using a serrated knife. Return biscotti slices to baking sheet, cut-side up.\nReturn biscotti to the oven and bake until biscotti are firm to the touch, about 20 minutes. Flip each cookie and continue baking until toasted, about 20 minutes more. Cool biscotti completely before storing in an airtight container.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "3 h ",
    "i": "4480895.jpg",
    "o": "4472624.jpg,4308877.jpg,3108481.jpg,1068175.jpg,1026952.jpg,1011328.jpg",
    "st": "allrecipes"
}