{
    "id": 232792,
    "old_rating": "4.31746",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 large eggs",
        "1/4 cup heavy whipping cream",
        "1 tablespoon white sugar",
        "1 pinch salt",
        "1 pinch cayenne pepper",
        "1/4 teaspoon ground cinnamon",
        "1/8 teaspoon ground allspice",
        "4 thick slices day-old French bread",
        "1 tablespoon butter",
        "8 thin slices cooked ham",
        "4 slices Cheddar cheese",
        "4 slices Havarti cheese",
        "8 poached eggs",
        "2 teaspoons chopped fresh chives, or to taste",
        "1 pinch kosher salt, or to taste",
        "1 pinch cayenne pepper, or to taste"
    ],
    "nut": [
        "Calories > 651 kcal",
        "Carbs > 25.9 g",
        "Cholesterol > 572 mg",
        "Fat > 44.4 g",
        "Protein > 38 g",
        "Sodium > 1475 mg"
    ],
    "n": "Chef John's Monte Cristo Benedict",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Imagine the best French toast you've ever had, combined with the best ham and cheese sandwich you've ever had, topped with perfectly poached eggs. You don't need any Hollandaise because the poached egg yolks are the sauce.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nWhisk 2 eggs, cream, white sugar, salt, 1 pinch cayenne pepper, cinnamon, and allspice together in a bowl until batter is thoroughly combined.\nLay bread slices into batter, one at a time, and let bread absorb the mixture. Turn bread slices in batter until almost all batter has been absorbed, about 10 minutes.\nHeat a large skillet over medium heat, and melt butter in the hot skillet. Cook bread slices in the hot butter until browned, 2 to 3 minutes per side. Transfer French toast slices to a baking sheet.\nLay ham slices into the hot skillet and cook until meat begins to brown, about 1 minute per side.\nTo assemble, place a Cheddar cheese slice on a slice of French toast, top with 2 slices of ham, and lay a Havarti cheese slice over ham.\nBake in the preheated oven until French toast pieces are no longer wet, the batter is set, and cheese has melted and begun to brown, about 20 minutes.\nPlace sandwiches on serving plates and top each with 2 poached eggs. Season with kosher salt and a pinch of cayenne pepper.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "4525697.jpg",
    "o": "4525697.jpg,4517732.jpg,4510832.jpg,4354750.jpg,3867675.jpg,3867674.jpg",
    "st": "allrecipes"
}