{
    "id": 232790,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "3/4 cup water",
        "1 (1 ounce) packet taco seasoning",
        "2 tablespoons vegetable oil",
        "1 cup white rice",
        "1 cup water",
        "1 1/2 cups chunky salsa",
        "1 small onion, chopped",
        "1 clove garlic, minced",
        "3 large green bell peppers, tops and seeds removed",
        "1 (8 ounce) package shredded Mexican cheese blend",
        "1 (14.5 ounce) package nacho cheese-flavored tortilla chips (such as DoritosÂ®)"
    ],
    "nut": [
        "Calories > 862 kcal",
        "Carbs > 80 g",
        "Cholesterol > 85 mg",
        "Fat > 46.7 g",
        "Protein > 30.6 g",
        "Sodium > 1492 mg"
    ],
    "n": "Mexican Stuffed Peppers",
    "a": "booyachic",
    "r": "0",
    "s": 6,
    "des": "\"A new twist to stuffed peppers!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir 3/4 cup water and taco seasoning into ground beef; simmer until water has evaporated, about 5 minutes.\nHeat vegetable oil in a separate skillet over medium heat; cook and stir rice in the hot oil until fragrant and golden brown, about 5 minutes. Add 1 cup water, salsa, onion, and garlic; bring to a boil. Lower heat, cover skillet, and simmer until rice is tender and liquid is absorbed, about 15 minutes. Stir ground beef mixture into rice mixture.\nSpoon a layer of ground beef-rice mixture into each bell pepper; top with a layer of Mexican cheese and a layer of nacho cheese-flavored tortilla chips. Repeat layering ingredients into bell peppers, ending with a Mexican cheese layer. Arrange stuffed peppers in a 9x9-inch baking dish.\nBake in the preheated oven until bell peppers are tender and cheese is lightly browned, about 30 minutes.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "3836285.jpg",
    "o": "",
    "st": "allrecipes"
}