{
    "id": 232809,
    "old_rating": "4.63889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds colossal shrimp, EZ-peel type (deveined and shells split down the back)",
        "1 1/2 tablespoons vegetable oil",
        "1 tablespoon freshly ground black pepper, or to taste",
        "1/4 teaspoon smoked paprika",
        "1/8 teaspoon cayenne pepper",
        "1/8 teaspoon seafood seasoning (such as Old BayÂ®) (optional)",
        "1 tablespoon butter",
        "2 cups chicken stock",
        "lemon, juiced",
        "2 tablespoons Worcestershire sauce, or more to taste",
        "2 dashes hot sauce, or to taste",
        "3 tablespoons cold butter, cut into chunks",
        "6 cloves garlic, minced",
        "1 tablespoon minced fresh rosemary",
        "1 sprig fresh rosemary for garnish"
    ],
    "nut": [
        "Calories > 308 kcal",
        "Carbs > 7.8 g",
        "Cholesterol > 290 mg",
        "Fat > 18.6 g",
        "Protein > 29 g",
        "Sodium > 837 mg"
    ],
    "n": "Chef John's New Orleans-Style Barbequed Shrimp",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"This indigenous American shellfish dish, cooked on the stovetop, has plenty of big flavors from garlic, rosemary, and freshly cracked black pepper. Serve over hot cooked rice. Use the largest shrimp you can get.\"",
    "ins": "Peel shrimp and place into a mixing bowl; set shrimp shells aside in a saucepan.\nDrizzle vegetable oil over shrimp and season with black pepper, smoked paprika, cayenne pepper, and seafood seasoning. Mix shrimp to coat with spices and cover bowl with plastic wrap; refrigerate shrimp to absorb flavors, at least 1 hour.\nPlace reserved shrimp shells in saucepan over medium-high heat with 1 tablespoon butter; cook and stir until shells are pink and fragrant, 1 to 2 minutes. Pour in chicken stock, bring to a boil, and reduce heat to low; simmer until shrimp shells have given off their flavor, 20 to 30 minutes.\nStrain shrimp stock through a fine mesh strainer into a bowl and add lemon juice, Worcestershire sauce, and hot sauce. Stir to combine.\nPlace a large skillet over high heat until pan is very hot; sear shrimp in the very hot, dry pan until shrimp are browned, about 1 minute per side.\nStir 3 tablespoons cold butter, garlic, and minced rosemary into shrimp; cook and stir until shrimp are opaque in the middle and garlic is fragrant, 1 minute. Pour in shrimp stock.\nTransfer shrimp from skillet to a bowl, using a slotted spoon; reserve sauce in skillet. Bring sauce to a boil and cook until reduced slightly, about 5 minutes. Adjust seasoning to taste. Return shrimp to pan, reduce heat to low, and warm through, about 1 minute. Serve shrimp drizzled with pan sauce; garnish with a rosemary sprig.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "4023589.jpg",
    "o": "4023589.jpg,3787954.jpg,3550201.jpg,3327741.jpg,2622087.jpg,2562751.jpg",
    "st": "allrecipes"
}