{
    "id": 232836,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup all-purpose flour",
        "2 tablespoons chopped fresh parsley",
        "salt and ground black pepper to taste",
        "4 veal shanks",
        "2 tablespoons olive oil",
        "1 large onion, chopped",
        "4 carrots, diced",
        "4 stalks celery, diced",
        "1/2 cup dry white wine",
        "1 (14.5 ounce) can diced tomatoes",
        "1 tablespoon chopped fresh thyme",
        "2 bay leaves"
    ],
    "nut": [
        "Calories > 562 kcal",
        "Carbs > 21 g",
        "Cholesterol > 246 mg",
        "Fat > 19.4 g",
        "Protein > 65.6 g",
        "Sodium > 423 mg"
    ],
    "n": "Alia's Osso Buco",
    "a": "Alia- Montreal Personal chef",
    "r": "0",
    "s": 4,
    "des": "\"I love osso buco. To me, not only is it comfort food at its best, but it is also a great choice when entertaining. Plus it's so easy to prepare!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nMix flour and parsley in a bowl; season with salt and pepper. Dip veal shanks into flour mixture, shaking off excess flour.\nHeat olive oil in a large skillet over medium heat. Fry veal in hot oil until browned, about 10 minutes; transfer to a large baking dish. Return skillet to stove.\nCook and stir onion, carrots, and celery in the skillet used to fry veal until vegetables begin to brown, about 5 minutes. Transfer vegetables to the baking dish and pour wine into the skillet. Bring to a boil, scraping up any browned bits from the skillet. Reduce heat to medium-low and continue to simmer until wine is reduced by half, about 5 minutes.\nStir tomatoes, thyme, and bay leaves into wine. Simmer until tomatoes are hot, about 10 minutes. Pour tomato mixture over veal and vegetables. Stir to combine. Cover baking dish with aluminum foil.\nBake in the preheated oven until veal is very tender, about 90 minutes.",
    "pt": "20 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "1111365.jpg",
    "o": "",
    "st": "allrecipes"
}