{
    "id": 232873,
    "old_rating": "2.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (6 ounce) package chicken-flavored stuffing mix",
        "1/2 cup water",
        "1 pound skinless, boneless chicken breast halves, cut into cubes",
        "1 onion, chopped",
        "2 zucchini, sliced",
        "1 green bell pepper, chopped (optional)",
        "8 mushrooms, sliced",
        "1 (10.75 ounce) can reduced-fat, reduced-sodium cream of chicken soup (such as Campbell'sÂ® Healthy Request)"
    ],
    "nut": [
        "Calories > 246 kcal",
        "Carbs > 31.6 g",
        "Cholesterol > 41 mg",
        "Fat > 3.9 g",
        "Protein > 21.2 g",
        "Sodium > 748 mg"
    ],
    "n": "Slow Cooker Chicken and Stuffing Casserole",
    "a": "Molls",
    "r": "0",
    "s": 6,
    "des": "\"Chicken, stuffing, mushrooms, zucchini, and more. Comfort food shouldn't be fussy and with this slow cooker version of chicken and stuffing you can come home to a house filled with the aromas and memories of childhood. The whole family is sure to enjoy this healthy, well-balanced meal. Great on a cold night! Begs to be paired with warm rolls or french bread. When we have company and extra mouths, a side salad goes well or even green bean casserole if we feel like indulging big time. Can't beat a glass of cold milk with this dish! Recipe can easily be doubled if your slow cooker allows. Garnish with sage leaves if desired.\"",
    "ins": "Pour stuffing mix into a large bowl; stir in seasoning packet and water until moistened.\nMix chicken, onion, zucchini, bell pepper, and mushrooms in a separate large bowl; stir in cream of chicken soup. Spoon half the chicken mixture into a 4-quart or larger slow cooker; top with half the stuffing. Repeat layering with remaining chicken mixture and stuffing.\nCook on Low until chicken is no longer pink in the center and the vegetables are tender, 5 to 6 hours (or 2 1/2 to 3 hours on High).",
    "pt": "20 m",
    "ct": "5 h",
    "tt": "5 h ",
    "i": "1038681.jpg",
    "o": "",
    "st": "allrecipes"
}