{
    "id": 232916,
    "old_rating": "4.65217",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (3.5 ounce) links Italian sausage",
        "1 1/2 cups water",
        "1 pinch salt",
        "2 metal skewers",
        "1 tablespoon barbeque sauce, or to taste"
    ],
    "nut": [
        "Calories > 227 kcal",
        "Carbs > 5.5 g",
        "Cholesterol > 36 mg",
        "Fat > 17.1 g",
        "Protein > 12 g",
        "Sodium > 1041 mg"
    ],
    "n": "Curly-Q Grilled Sausages",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"Giving a sausage a cool, coiled shape isn't just fun or frivolous; it's also fully functional. The extra surface area picks up additional delicious smoky, caramelized flavors from the grill. You could brush barbecue sauce on an un-helixed Italian sausage, but here you're literally flavoring the sausage inside and out. I served them on buns with homemade basil-garlic mayonnaise.\"",
    "ins": "Place sausages into a skillet over medium heat and pour in water. Add a large pinch of salt to the water and bring to a simmer. Cover and cook for about 3 minutes per side.\nRemove sausages from pan and let cool to room temperature. Refrigerate until cold, at least 1 hour. Insert a metal skewer the long way through each cooled sausage.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate. Pour barbeque sauce into a small bowl.\nPlace a sausage on a work surface and start making a knife cut about 3/4 inch from the end, holding the knife blade at a slight angle and cutting down to the skewer. Slowly rotate the sausage and continue cutting in a spiral until sausage is cut to about 1 inch from the other end. Gently spread the sausage apart on the skewer to create about 1/2 inch of space between the curls.\nPlace sausages onto the preheated grill and cook until browned and meat is no longer pink inside, about 6 minutes; turn occasionally.\nBrush sausages with barbeque sauce using a pastry brush when sausages are nearly done. Cook, continuing to turn sausages, until sauce has caramelized onto the meat, about 1 minute per side. Transfer to a plate and let sausages cool for about 30 seconds before removing skewers for serving.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "1704486.jpg",
    "o": "1704486.jpg,1118126.jpg,1051595.jpg,1023425.jpg,1017393.jpg,1016528.jpg",
    "st": "allrecipes"
}