{
    "id": 232929,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "olive oil, divided",
        "6 small frozen chicken tenders, thawed and sliced",
        "1 pinch garlic salt, or to taste",
        "1/4 cup garlic hummus",
        "4 pita bread rounds",
        "4 teaspoons basil pesto",
        "1/2 cup prepared Alfredo sauce",
        "1 cup fresh spinach leaves, chopped",
        "1 (6.5 ounce) jar marinated artichoke hearts, drained and chopped",
        "3/4 cup crumbled feta cheese",
        "3/4 cup shredded mozzarella cheese",
        "1/2 cup shredded Parmesan cheese",
        "1/2 cup sliced fresh mushrooms"
    ],
    "nut": [
        "Calories > 707 kcal",
        "Carbs > 39.8 g",
        "Cholesterol > 137 mg",
        "Fat > 38.7 g",
        "Protein > 50.9 g",
        "Sodium > 1583 mg"
    ],
    "n": "Chicken Alfredo Pita Pizza",
    "a": "Jeri Panek",
    "r": "0",
    "s": 4,
    "des": "\"Something I put together after the inspiration of my daughter's 'Pita Pizza.' She liked this one a lot and wanted me to submit it! It's tasty so you might want to make more than one for yourself! This recipe makes about 4 pitas.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat 1 tablespoon olive oil in a skillet over medium heat. Season chicken with garlic salt; cook and stir in hot oil until no longer pink in the middle, about 5 minutes. Set aside to cool.\nSpread 1 tablespoon hummus over one side of each of the pita rounds nearly to the edges. Top with layers of pesto and alfredo sauce. Sprinkle a layer of chopped spinach over the alfredo sauce; top with even portions of chicken, artichoke hearts, feta cheese, mozzarella cheese, Parmesan cheese, and mushrooms. Drizzle remaining olive oil over the pizzas.\nBake in preheated oven until cheese is melted and crust on pitas is slightly brown, about 15 minutes.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "1040766.jpg",
    "o": "",
    "st": "allrecipes"
}