{
    "id": 232978,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "parchment paper",
        "cooking spray",
        "3/4 cup chopped dark chocolate",
        "2 cups rolled oats",
        "1/4 cup wheat germ",
        "1/4 cup flax seeds",
        "1 cup crispy rice cereal",
        "1 cup cornflake crumbs",
        "3/4 cup chopped smoke-flavored almonds",
        "1/2 teaspoon kosher salt",
        "1/2 cup honey",
        "1/2 cup creamy peanut butter",
        "1/4 cup brown sugar",
        "2 tablespoons agave nectar",
        "1 tablespoon canola oil",
        "1/4 teaspoon ground cinnamon",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 172 kcal",
        "Carbs > 24.8 g",
        "Cholesterol > 0 mg",
        "Fat > 7.5 g",
        "Protein > 4 g",
        "Sodium > 105 mg"
    ],
    "n": "Peanut Butter Snack Bars",
    "a": "LARANEFF",
    "r": "0",
    "s": 24,
    "des": "\"These are Mike's favorite bars--a combination of energy bars, granola bars, and cereal bars. These can be adapted to your taste with fruits, nuts, seeds, chocolate, etc. Also, depending on your selection of ingredients, you can go 100% natural/organic.\"",
    "ins": "Line a 9x13-inch baking dish with parchment paper and spray with cooking spray. Spread chocolate evenly over prepared baking dish.\nToast oats, wheat germ, and flax seed in a non-stick skillet over medium heat, stirring frequently until oats are lightly golden and fragrant, about 5 minutes. Transfer oat mixture to a large bowl and stir in crispy rice cereal, cornflake crumbs, almonds, and salt.\nHeat honey, peanut butter, brown sugar, agave nectar, canola oil, and cinnamon in a saucepan over medium heat. Cook and stir until mixture begins to bubble, 3 to 5 minutes. Remove from heat and stir in vanilla extract. Pour peanut butter mixture over cereal mixture; gently stir until well mixed.\nSpread peanut butter-cereal mixture into the baking dish. Place another sheet of parchment over the mixture and firmly press into the dish until even. Allow to completely cool before removing from baking dish and slicing.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "1 h",
    "i": "4464582.jpg",
    "o": "",
    "st": "allrecipes"
}