{
    "id": 232988,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Seasoning Mix:",
        "2 tablespoons ground paprika",
        "1 tablespoon ground black pepper",
        "1 tablespoon chili powder",
        "1 tablespoon seasoned salt",
        "2 teaspoons cayenne pepper",
        "1 1/2 teaspoons onion powder",
        "1 1/2 teaspoons garlic powder",
        "1 teaspoon ground white pepper",
        "1 teaspoon mustard powder",
        "2 pounds chicken wings",
        "2 cups vegetable oil, or as needed",
        "2 cups peanut oil, or as needed"
    ],
    "nut": [
        "Calories > 235 kcal",
        "Carbs > 4.8 g",
        "Cholesterol > 32 mg",
        "Fat > 19 g",
        "Protein > 12.5 g",
        "Sodium > 509 mg"
    ],
    "n": "Crispy Restaurant Style Buffalo Chicken Wings",
    "a": "vince's princess",
    "r": "0",
    "s": 6,
    "des": "\"Regardless of how you dress your wings, the key to making amazing wings is to fry them twice. I love them tossed in the dry seasoning rub listed below, since they maintain their crunchy flavor! I never understood those who chose to oven-bake their wings; it's called a guilty pleasure for a reason!  You can also season the wings with an Asian soy, BBQ, herb or traditional buffalo-style hot sauce. Serve immediately along side celery and ranch or blue cheese dressing, if desired!\"",
    "ins": "Mix paprika, black pepper, chili powder, seasoned salt, cayenne pepper, onion powder, garlic powder, white pepper, and mustard powder together in a bowl until seasoning mix is evenly combined. Dry chicken wings thoroughly with a paper towel.\nHeat enough vegetable oil and peanut oil in a deep cast iron pot or heavy pot to reach a depth of about 2 inches; bring to 300 degrees F (150 degrees C).\nSplit wings into 2 batches and fry each batch in the hot oil, 4 to 5 minutes. Transfer each batch to a paper towel-lined plate to drain.\nIncrease oil temperature to 350 degrees F (175 degrees C). Fry each batch of wings in the hot oil until skin is crispy, golden brown and meat is no longer pink in the center, 5 to 6 minutes. Drain wings on a paper towel-lined plate; transfer to a bowl.\nSprinkle seasoning mix over cooked wings and toss to evenly coat.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "3984002.jpg",
    "o": "",
    "st": "allrecipes"
}