{
    "id": 232908,
    "old_rating": "4.72101",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 pound fresh white mushrooms, finely chopped",
        "1 pinch salt",
        "1 tablespoon butter",
        "1/2 cup finely chopped onion",
        "4 cloves garlic, minced",
        "1/2 cup quick-cooking oats",
        "1 ounce very finely shredded Parmigiano-Reggiano cheese",
        "1/2 cup bread crumbs",
        "1/4 cup chopped flat-leaf (Italian) parsley, packed",
        "2 eggs, divided",
        "1 teaspoon salt",
        "freshly ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "1 pinch dried oregano",
        "3 cups pasta sauce",
        "1 tablespoon very finely shredded Parmigiano-Reggiano cheese, or to taste",
        "1 tablespoon chopped flat-leaf (Italian) parsley, or to taste"
    ],
    "nut": [
        "Calories > 421 kcal",
        "Carbs > 50.1 g",
        "Cholesterol > 110 mg",
        "Fat > 17.9 g",
        "Protein > 16.9 g",
        "Sodium > 1695 mg"
    ],
    "n": "Chef John's Meatless Meatballs",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"I made this recipe to celebrate Earth Day. Thanks to a thorough browning, mushrooms provide more than enough savoriness. The garlic, cheese, and parsley do the rest. What really blew me away was how close the texture was to actual meatballs. They are officially approved for use on spaghetti!\"",
    "ins": "Heat olive oil in a skillet over medium-high heat. Add mushrooms to the hot oil, sprinkle with salt, and cook and stir until liquid from mushrooms has evaporated. Stir butter into mushrooms, reduce heat to medium, and cook and stir mushrooms until golden brown, about 5 minutes.\nStir onion into mushrooms and cook, stirring often, until onion is translucent, 5 minutes. Remove skillet from heat and stir garlic into mushroom mixture until fragrant, about 1 minute. Transfer mixture to a mixing bowl.\nMix oats into mushroom mixture until thoroughly combined. Gently stir 1 ounce Parmigiano-Reggiano cheese into mixture. Add bread crumbs, 1/4 cup parsley, and 1 egg; season with salt, black pepper, cayenne pepper, and oregano. Mix together with a fork until crumbly. Stir in remaining 1 egg. Mixture should hold together when pressed.\nCover bowl with plastic wrap and refrigerate at least 4 hours. For best flavor and texture, refrigerate overnight.\nPreheat oven to 450 degrees F (230 degrees C). Line a baking sheet with a silicone baking mat or parchment paper.\nForm mixture into small meatballs using a 2-tablespoon scoop. Roll meatballs lightly between your hands until smooth, if desired; arrange meatballs on prepared baking sheet.\nBake in the preheated oven until meatballs are lightly golden brown, 12 to 15 minutes.\nBring pasta sauce to a boil in a large saucepan; reduce heat to low. Gently stir meatballs into sauce until coated. Simmer meatballs in sauce until cooked through, 45 minutes to 1 hour. Transfer to a serving bowl and garnish with 1 tablespoon Parmigiano-Reggiano cheese and 1 tablespoon parsley.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "5 h ",
    "i": "4531160.jpg",
    "o": "4531160.jpg,4504826.jpg,4501147.jpg,4501146.jpg,4497604.jpg,4480633.jpg",
    "st": "allrecipes"
}