{
    "id": 233080,
    "old_rating": "4.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "16 chocolate sandwich cookies (such as OreoÂ®)",
        "16 chocolate-covered peanut butter cups (such as Reese'sÂ®)",
        "1 (12 ounce) bag semi-sweet chocolate chips",
        "2 tablespoons shortening"
    ],
    "nut": [
        "Calories > 249 kcal",
        "Carbs > 29.8 g",
        "Cholesterol > 1 mg",
        "Fat > 15 g",
        "Protein > 3.2 g",
        "Sodium > 104 mg"
    ],
    "n": "Chocolate Hockey Pucks",
    "a": "Arizona Desert Flower",
    "r": "0",
    "s": 16,
    "des": "\"Hockey pucks are a new twist on two classic American treats: peanut butter cups and OreosÂ®! These take just a few minutes to make and are true crowd pleasers. Make them for your next gathering and watch them fly off the plate!\"",
    "ins": "Line a baking sheet with waxed paper.\nSplit each sandwich cookie open using a paring knife, putting as much filling as possible on one side of the cookie. Arrange cookies on a microwave-safe plate. Place 1 peanut butter cup on the filling-side of each cookie; cover with the remaining cookie top.\nHeat cookie sandwiches in the microwave until chocolate is slightly softened, about 5 seconds. Press cookie sandwich firmly together to adhere both sides of the cookie to the peanut butter cup.\nPlace chocolate chips and shortening in a microwave-safe bowl. Microwave on high for 1 minute, remove, stir, and repeat in 30 second increments until chocolate is smooth and melted.\nDip each cookie sandwich in the melted chocolate mixture, completely covering in chocolate. Allow excess to drip off before placing on waxed paper-lined baking sheet. Hide any finger prints on the cookies with extra melted chocolate. Freeze the 'hockey pucks' until chocolate is hardened, at least 30 minutes.",
    "pt": "15 m",
    "ct": "3 m",
    "tt": "48 m",
    "i": "1044532.jpg",
    "o": "",
    "st": "allrecipes"
}