{
    "id": 233141,
    "old_rating": "4.70423",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon olive oil, or as needed",
        "1 tablespoon olive oil",
        "1 yellow onion, minced",
        "3 cloves garlic, minced",
        "5 cups chopped kale",
        "1/4 teaspoon kosher salt",
        "2 grinds fresh black pepper, or to taste",
        "1 cup diced tomato",
        "1/2 cup shredded carrots",
        "5 eggs",
        "3/4 cup whole milk",
        "7 1/2 ounces shredded Cheddar cheese (such as SargentoÂ® 4 State Cheddar Cheese)",
        "1/4 cup chopped flat-leaf parsley"
    ],
    "nut": [
        "Calories > 297 kcal",
        "Carbs > 12.6 g",
        "Cholesterol > 195 mg",
        "Fat > 20.5 g",
        "Protein > 17.7 g",
        "Sodium > 406 mg"
    ],
    "n": "Summer Garden Crustless Quiche",
    "a": "Singer6",
    "r": "0",
    "s": 6,
    "des": "\"This is one of my favorite recipes to make in the summer when the vegetable garden is offering plenty of fresh vegetables. You might want to use less kale if you prefer a more fluffy quiche.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch pie dish with 1 teaspoon olive oil.\nHeat 1 tablespoon olive oil in a skillet over medium heat; cook and stir onion and garlic in the hot oil until garlic is fragrant, 2 to 3 minutes. Add kale, salt, and pepper; cook, stirring occasionally, until kale is wilted, about 5 minutes. Stir tomato and carrots into kale mixture; cook for 5 more minutes. Remove skillet from heat.\nWhisk eggs and milk together in a bowl. Stir Cheddar cheese, kale mixture, and parsley into egg mixture; pour into the prepared pie dish.\nBake in the preheated oven until quiche is set in the middle and a knife inserted in the center comes out clean, about 50 minutes. Cool in pie dish for 2 to 3 minutes before slicing.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1034411.jpg",
    "o": "4539991.jpg,4488678.jpg,2170621.jpg,1868046.jpg,1393996.jpg,1389996.jpg",
    "st": "allrecipes"
}