{
    "id": 233236,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 large ripe tomatoes",
        "4 large green bell peppers",
        "1/4 cup butter",
        "1 onion, diced",
        "1 clove garlic, minced, or to taste",
        "2 pounds ground beef chuck",
        "2 tablespoons soy sauce",
        "1 tablespoon seasoned salt",
        "1 tablespoon ground black pepper",
        "1/2 cup water",
        "1 1/2 cups converted (parboiled) rice (such as Uncle Ben'sÂ®)",
        "1/2 cup olive oil"
    ],
    "nut": [
        "Calories > 348 kcal",
        "Carbs > 28.5 g",
        "Cholesterol > 44 mg",
        "Fat > 20.6 g",
        "Protein > 13 g",
        "Sodium > 412 mg"
    ],
    "n": "Greek Stuffed Tomatoes and Peppers (Yemista)",
    "a": "Denise Phillips Sarigianopoulo",
    "r": "0",
    "s": 12,
    "des": "\"This is my favorite! The best time to make it is in August when the garden tomatoes are ready for harvest. Hothouse tomatoes are just not the same. My mom made this every year, and when she did, I thought I died and went to heaven. Enjoy!\"",
    "ins": "Cut off tops of tomatoes, leaving 1 corner still attached to create a lid. Scoop insides of tomatoes and transfer 'meat' to a large bowl; squeeze juices out of tomatoes. Cut off tops of green peppers and reserve for later use; scoop out seeds and membranes. Arrange tomatoes and bell peppers in a 11x17-inch baking dish.\nPreheat oven to 375 degrees F (190 degrees C).\nHeat butter in a large skillet over medium heat; cook and stir onion and garlic in the melted butter until softened, 5 to 10 minutes. Add ground chuck, soy sauce, seasoned salt, and black pepper to onion mixture; cook until ground chuck is browned and crumbly, 5 to 10 minutes.\nMix squeezed tomato meat and water into browned chuck; bring to a simmer, about 15 minutes. Add rice and bring to a boil; remove skillet from heat. Spoon beef-rice mixture into tomatoes; place tops onto filled tomatoes and arrange them into the baking dish with lid sides down.\nStuff bell peppers with beef-rice mixture and top with reserved lids; lay bell peppers sideways in the baking dish. Pour olive oil over stuffed tomatoes and bell peppers; season with salt and pepper.\nBake in the preheated oven for 30 minutes. Turn bell peppers and continue baking until bell peppers and tomatoes are softened, about 30 more minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1025105.jpg",
    "o": "",
    "st": "allrecipes"
}