{
    "id": 233299,
    "old_rating": "4.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 red potatoes, diced",
        "salt and ground black pepper to taste",
        "16 eggs",
        "1 cup sour cream",
        "2 pounds breakfast sausage",
        "1 (16 ounce) package bacon",
        "3 red bell peppers, chopped",
        "1 small onion, chopped",
        "4 cups shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 572 kcal",
        "Carbs > 16.6 g",
        "Cholesterol > 297 mg",
        "Fat > 40.6 g",
        "Protein > 34 g",
        "Sodium > 915 mg"
    ],
    "n": "Ultimate Breakfast Strata",
    "a": "MERRIPAN",
    "r": "0",
    "s": 12,
    "des": "\"I decided I wanted to kick up a baked omelet a few notches. And after making this, I knew I had a winner. You can add or subtract as you'd like, and this is a great idea for potlucks or brunches.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9x13-inch baking dish.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add potatoes and season with salt and pepper. Cover and steam until tender, 10 to 15 minutes. Transfer potatoes the prepared baking dish. Beat eggs with sour cream in a large bowl and pour over potatoes.\nHeat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Crumble bacon and spread over potatoes and eggs.\nHeat a clean nonstick skillet over medium-high heat; cook and stir bell peppers and onion in hot skillet until vegetables are tender, about 5 minutes. Season with salt and pepper. Spread vegetables over egg mixture.\nBake in the preheated oven until eggs are softly set, about 10 minutes. Spread sausage over eggs and top with Cheddar cheese. Continue to bake until eggs are fully set and cheese is melted, about 30 minutes more.",
    "pt": "40 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1917372.jpg",
    "o": "",
    "st": "allrecipes"
}