{
    "id": 23328,
    "old_rating": "4.44681",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds whole chicken",
        "2 onions, quartered",
        "3 stalks celery, cut into 1 inch pieces",
        "2 bay leaves",
        "salt and pepper to taste",
        "1 egg",
        "4 cups all-purpose flour"
    ],
    "nut": [
        "Calories > 613 kcal",
        "Carbs > 67.8 g",
        "Cholesterol > 131 mg",
        "Fat > 17.8 g",
        "Protein > 41.8 g",
        "Sodium > 239 mg"
    ],
    "n": "Chicken and Sliders",
    "a": "Sharon Howard",
    "r": "0",
    "s": 6,
    "des": "\"This recipe is an old French Canadian recipe which originated during the depression. It consists of tender pieces of chicken and homemade noodles swimming in a delicious gravy.  A real rib sticker and a favourite with my family during the winter.  Sounds harder than it is and it is absolutely delicious!\"",
    "ins": "Wash chicken and place in large pot. Cover with water and add chopped vegetables, bay leaves, salt and pepper. Bring to a boil, then reduce heat and simmer for about 2 hours or until meat comes away easily from the bone. Remove chicken from broth and strain liquid.  Reserve the broth and discard all vegetables.\nWhen chicken is cool remove meat from the bones and all skin, keeping the chicken meat in reasonably large pieces.\nTo make the noodles(sliders): Beat the egg with some of the cooled broth, measure out the flour, work the egg mixture into the flour adding broth as required until the dough forms a ball.  Knead the ball for a few minutes. Roll out the dough on a floured surface.  Cut the dough into strips about 1 1/2 inches wide and 3 inches long.  Don't worry if they are irregular in shape. Leave any excess flour on the noodles.\nBring the reserved broth to a rapid boil, add the noodles and let them boil for about 5 minutes. Reduce heat, add cut up chicken and simmer until the broth is very thick like gravy (add a little flour to thicken if required). Add salt and pepper to taste.",
    "pt": "30 m",
    "ct": "2 h ",
    "tt": "3 h",
    "i": "182322.jpg",
    "o": "",
    "st": "allrecipes"
}