{
    "id": 233252,
    "old_rating": "4.72727",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Meat Mixture:",
        "2 tablespoons extra-virgin olive oil",
        "2 cloves garlic, chopped",
        "1 onion, chopped",
        "salt and ground black pepper to taste",
        "1 pound lean ground beef",
        "2 (7 ounce) cans Mexican-style corn (such as Green GiantÂ®)",
        "1 (8 ounce) jar chunky salsa",
        "1 (7.75 ounce) can Mexican-style hot tomato sauce (such as El PatoÂ®)",
        "1 (4 ounce) can chopped green chiles",
        "1 (1 ounce) packet taco seasoning mix",
        "Corn Bread Topping:",
        "1 (15 ounce) package corn bread mix (such as KrusteazÂ® Honey Corn Bread Mix)",
        "2/3 cup milk",
        "1/3 cup vegetable oil",
        "1 egg",
        "2 (7 ounce) cans Mexican-style corn (such as Green GiantÂ®), drained",
        "1 (4 ounce) can chopped green chiles, drained",
        "1 cup shredded Mexican cheese blend",
        "1 tablespoon extra-virgin olive oil"
    ],
    "nut": [
        "Calories > 430 kcal",
        "Carbs > 43.1 g",
        "Cholesterol > 51 mg",
        "Fat > 22.8 g",
        "Protein > 15.1 g",
        "Sodium > 1511 mg"
    ],
    "n": "Sweet Tamale Pie",
    "a": "bcummings221",
    "r": "0",
    "s": 12,
    "des": "\"This is a recipe I've been playing with and modifying for 20 years, It's a favorite at work for pot luck dinners. Quick and easy to make.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPour 2 tablespoons olive oil into a cold skillet; sprinkle in garlic. Cook garlic over medium heat until sizzling and fragrant, 2 to 3 minutes. Stir onion, salt, and pepper into the garlic and olive oil; cook until onion is translucent, 5 to 10 minutes. Cook and stir ground beef into onion mixture until beef is browned and crumbly, 5 to 10 minutes.\nMix 2 cans Mexican-style corn, salsa, hot tomato sauce, 1 can chopped green chiles, and taco seasoning into ground beef mixture; bring to a boil. Reduce heat, cover skillet, and simmer until liquid has reduced, about 15 minutes. Transfer meat mixture to a 10x14-inch casserole dish.\nStir corn bread mix, milk, vegetable oil, and egg together in a bowl; fold in 2 cans drained Mexican-style corn, 1 can drained green chiles, Mexican cheese blend, and 1 tablespoon olive oil. Spoon cornbread mixture over meat mixture.\nBake in the preheated oven until a toothpick inserted into the corn bread comes out clean, about 30 minutes.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1033885.jpg",
    "o": "4489377.jpg,4377609.jpg,4372906.jpg,4372780.jpg,4299677.jpg,4256154.jpg",
    "st": "allrecipes"
}