{
    "id": 233288,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 turkey carcass",
        "1 cup butter, cubed",
        "1 large onion, chopped",
        "2 large carrots, diced",
        "2 stalks celery, diced",
        "1 cup all-purpose flour",
        "2 cups half-and-half",
        "4 ounces fettuccine, broken into 2-inch pieces",
        "1/4 cup prepared stuffing, or more to taste",
        "2 teaspoons salt",
        "1 teaspoon chicken bouillon granules",
        "3/4 teaspoon ground black pepper",
        "1 pinch poultry seasoning, or to taste"
    ],
    "nut": [
        "Calories > 273 kcal",
        "Carbs > 15.1 g",
        "Cholesterol > 57 mg",
        "Fat > 21.7 g",
        "Protein > 5.2 g",
        "Sodium > 442 mg"
    ],
    "n": "Creamy After-Thanksgiving Turkey Soup",
    "a": "Paul",
    "r": "0",
    "s": 16,
    "des": "\"This is a version of Valorie Walker's recipe with a few of my changes. Enjoy.\"",
    "ins": "Place turkey carcass in a large pot or Dutch oven and cover with water. Bring to a boil. Reduce heat to medium, cover, and simmer for 1 hour. Remove carcass and allow to cool. Separate turkey meat from the bones. Cut meat into bite-size pieces; discard bones. Reserve about 12 cups turkey broth in a large bowl. Save remaining broth for another use.\nMelt butter in another large pot or Dutch oven over medium heat; cook and stir onion, carrots, and celery in melted butter until tender, about 5 minutes. Stir flour into vegetable mixture; cook and stir until smooth, about 5 minutes. Gradually stir in about 1/3 the reserved turkey broth. Bring to a boil; cook and stir until thickened, about 2 minutes.\nStir remaining turkey broth, turkey meat, half-and-half, fettuccine, stuffing, salt, chicken bouillon, pepper, and poultry seasoning into half-and-half mixture. Reduce heat to medium-low, cover, and simmer until noodles are tender, about 10 minutes more.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4469559.jpg",
    "o": "",
    "st": "allrecipes"
}