{
    "id": 233398,
    "old_rating": "4.78571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons olive oil",
        "1 pound andouille sausage, sliced",
        "1 large onion, diced",
        "3 cloves garlic, minced",
        "3 cups chicken broth, or as needed",
        "1 cup crushed tomatoes, such as San Marzano",
        "1/2 cup diced jalapeno chile pepper",
        "2 pounds assorted summer squash, such as zucchini or yellow crookneck - trimmed and cut into chunks",
        "1 1/2 pounds Yukon Gold potatoes, peeled and quartered (optional)",
        "salt and freshly ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "1/4 cup chopped Italian parsley",
        "2 teaspoons freshly shredded Parmesan cheese, or to taste"
    ],
    "nut": [
        "Calories > 612 kcal",
        "Carbs > 51.4 g",
        "Cholesterol > 70 mg",
        "Fat > 36.5 g",
        "Protein > 22.8 g",
        "Sodium > 1866 mg"
    ],
    "n": "Summer Squash and Sausage Stew",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"This simple squash and sausage stew represents my idea of the perfect summer supper. It's very comforting, relatively fast, wonderfully flavorful, and helps solve a problem that's existed since neighbors started planting gardens: what to do with all that squash! Serve it with a big slice of crusty bread for dipping into the broth.\"",
    "ins": "Heat olive oil in a large pot over medium-high heat; cook sausage slices until they begin to brown, 3 to 4 minutes. Add onion, reduce heat to medium, and cook until onion becomes translucent, about 5 minutes. Stir in garlic and cook until fragrant, 30 seconds to 1 minute. Add chicken broth, crushed tomatoes, and jalapeno pepper; stir to combine.\nBring mixture to a simmer; gently stir squash and potatoes into mixture. Reduce heat to medium-low. Season with salt, black pepper, and cayenne pepper.\nSimmer stew, uncovered, until potatoes and squash are tender, 30 to 35 minutes. Stir in Italian parsley. Adjust levels of salt, black pepper, and cayenne pepper if needed. Serve in bowls; sprinkle with Parmesan cheese.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}