{
    "id": 233315,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 quarts water",
        "1/4 teaspoon sea salt",
        "1 (8 ounce) package cavatappi pasta",
        "1 teaspoon olive oil",
        "1/4 cup finely chopped onion",
        "1 clove garlic, minced",
        "1 pound ground beef",
        "1 (15 ounce) can tomato sauce",
        "1 tablespoon chili powder",
        "1/2 teaspoon ground cumin",
        "1 (15 ounce) can seasoned black beans, undrained",
        "1/4 teaspoon freshly ground black pepper"
    ],
    "nut": [
        "Calories > 395 kcal",
        "Carbs > 45 g",
        "Cholesterol > 46 mg",
        "Fat > 13.7 g",
        "Protein > 22.9 g",
        "Sodium > 782 mg"
    ],
    "n": "Easy Chili Cavatappi",
    "a": "Mat Myers",
    "r": "0",
    "s": 6,
    "des": "\"This very easy recipe uses two pans and has 'pantry' written all over it. It tastes like what you would expect if HormelÂ® and Chef BoyardeeÂ® shared a kitchen. Perfect for kids. Substitute the cavatappi with any full-bodied pasta, such as bow-tie, wagon-wheel, or mostaccioli.  You can even sneak in some frozen corn for a little tex-mex feel. Top it with cheese when serving.\"",
    "ins": "Bring water to a boil in a large pot; add salt. Pour cavatappi into the boiling water and cook until tender but firm to the bite, 10 to 12 minutes; drain and rinse cavatappi.\nHeat olive oil in a large skillet over medium heat; cook and stir onion and garlic in the hot oil until onion is softened and transparent, 5 to 10 minutes. Increase heat to medium-high and stir ground beef into onion mixture. Cook and stir until ground beef is browned and crumbly, 5 to 10 minutes. Drain excess grease and return skillet to heat.\nMix tomato sauce, chili powder, and cumin into ground beef mixture; cook, stirring occasionally, until tomato sauce is heated through, about 3 minutes. Stir cavatappi into meat sauce until evenly coated; add black beans and pepper. Cook and stir over medium-low heat until flavors have blended, about 5 minutes.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "3456939.jpg",
    "o": "",
    "st": "allrecipes"
}