{
    "id": 233318,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 eggs, beaten slightly",
        "2 (7 ounce) cans tuna, drained",
        "1/2 cup chopped onion",
        "1/2 cup shredded Cheddar cheese",
        "1/2 cup snipped fresh parsley",
        "1 teaspoon celery salt",
        "1/4 teaspoon ground black pepper",
        "2 cups baking mix (such as Bisquick Â®)",
        "1/2 cup cold water",
        "Cheese Sauce:",
        "1/4 cup butter",
        "1/4 cup baking mix (such as Bisquick Â®)",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "2 cups milk",
        "1 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 502 kcal",
        "Carbs > 33.7 g",
        "Cholesterol > 107 mg",
        "Fat > 26.9 g",
        "Protein > 31 g",
        "Sodium > 1223 mg"
    ],
    "n": "Tuna Ring Casserole",
    "a": "Angela Thorassie",
    "r": "0",
    "s": 6,
    "des": "\"My mom made this while I was growing up, and it has always been my favorite recipe of hers. It makes a great meal for guests since it looks so pretty after baking, and kids love it!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease a baking sheet.\nMeasure 2 tablespoons of the beaten egg into a small bowl and set aside. Mix remaining egg, tuna, onion, 1/2 cup Cheddar cheese, parsley, celery salt, 1/4 teaspoon black pepper together in a large bowl.\nStir 2 cups baking mix and cold water together to form a soft dough. Cover a cutting board with cheesecloth and lightly dust with flour. Turn dough out onto the prepared cutting board and knead 5 times. Roll into a 15x10-inch rectangle. Spread tuna mixture over the dough. Roll, beginning at one of the long side, into a cylinder; transfer to the prepared baking sheet with the sealed edge down. Shape the cylinder into a ring and pinch the ends together. With scissors, make cuts 2/3 of the way through ring at 1-inch intervals. Brush top with reserved egg.\nBake in preheated oven until the outside is golden brown, 25 to 30 minutes.\nMelt butter in a saucepan over low heat. Beat 1/4 cup baking mix, salt, and 1/4 teaspoon pepper into the butter; cook until smooth and bubbly, about 5 minutes. Remove saucepan from heat and stir milk into the butter mixture until smoothly incorporated. Bring the mixture to a boil, stirring continually; cook at a boil for 1 minute; remove from heat and stir 1 cup Cheddar cheese into the mixture until melted. Pour over the tuna ring casserole to serve.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "2613293.jpg",
    "o": "",
    "st": "allrecipes"
}