{
    "id": 233309,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup hazelnuts",
        "1/2 pound spaghetti",
        "1/3 cup extra-virgin olive oil, or as needed",
        "2 jarred pepperoncini peppers, sliced",
        "3 cloves garlic, chopped",
        "1/4 cup sun-dried tomatoes packed in oil, sliced",
        "1 teaspoon anchovy paste",
        "1/4 cup Marsala wine",
        "8 large Kalamata olives (optional)"
    ],
    "nut": [
        "Calories > 1108 kcal",
        "Carbs > 102.4 g",
        "Cholesterol > 1 mg",
        "Fat > 65.7 g",
        "Protein > 21.8 g",
        "Sodium > 1194 mg"
    ],
    "n": "Aglio e Olio alla Fremont",
    "a": "Patrick Lipo",
    "r": "0",
    "s": 2,
    "des": "\"When my family moved away from Seattle, one of the things we missed the most was a pasta dish from one of our favorite restaurants. I worked to recreate it from a number of similar recipes, but it required some improvisation because there's nothing like it. The garlic is an integral part, and if you love the stuff, you can dial it up to a full bunch. The true Roman-style is without grated Parmesan on top, but if you love the stuff, it's fine with as well.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spread hazelnuts onto a baking sheet.\nBake in the preheated oven until hazelnuts become fragrant, about 10 minutes. Allow hazelnuts to cool completely on baking sheet. Rub cooled hazelnuts between your palms to remove the bitter paper-like skins. Transfer hazelnuts to a resealable bag and close. Crush nuts using a rolling pin.\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, 10 to 12 minutes. Drain.\nPour enough olive oil into a skillet over medium heat to coat the bottom; cook and stir pepperoncini peppers and garlic in the hot oil until garlic is golden, about 3 minutes. Add sun-dried tomatoes, hazelnuts, and anchovy paste; cook and stir until warmed, about 2 minutes.\nTransfer spaghetti to the hazelnut mixture; add Marsala wine. Toss mixture in skillet over medium heat until evenly combined and wine is slightly evaporated, 2 to 3 minutes. Split spaghetti mixture onto 2 plates; top with olives.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "1130331.jpg",
    "o": "",
    "st": "allrecipes"
}