{
    "id": 233480,
    "old_rating": "4.58065",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "kosher salt to taste",
        "ground black pepper to taste",
        "2 (1 pound) pork tenderloins",
        "3/4 cup butter",
        "6 cloves garlic, minced",
        "1 (16 ounce) can sliced mushrooms, drained",
        "1 tablespoon balsamic vinegar",
        "1 (14 ounce) can chicken broth, or as needed",
        "1/4 cup all-purpose flour"
    ],
    "nut": [
        "Calories > 384 kcal",
        "Carbs > 9.6 g",
        "Cholesterol > 128 mg",
        "Fat > 27 g",
        "Protein > 26.1 g",
        "Sodium > 913 mg"
    ],
    "n": "Garlic Pork Tenderloin with Mushroom Gravy",
    "a": "Karma Hunt",
    "r": "0",
    "s": 6,
    "des": "\"One of my family's favorites. If you aren't a garlic fan, pass on this one. A diet breaker, but worth it. Pork tenderloin are often sold 2 to a bag, so they are perfect for this dish. Serve extra gravy with mashed potatoes.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nRub salt and pepper over all sides of pork tenderloins; nestle tenderloins next to each other in a 9x13-inch baking dish.\nMelt butter in a saucepan over medium heat; add garlic and mushrooms. Bring to a boil, reduce heat to medium-low, and simmer, stirring frequently, until sauce is fragrant, about 5 minutes. Stir vinegar into mushroom sauce. Pour mushroom sauce over tenderloins, letting sauce seep between the two tenderloins.\nBake in the preheated oven until tenderloins are lightly pink in the center, about 45 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Transfer tenderloins to a serving dish.\nDrain the drippings, including mushrooms, from the baking dish into a measuring cup, scraping the bottom to get all the brown bits. Remove 1/4 cup of the fat from the mixture and pour into a saucepan. Add enough chicken broth to the drippings to make 2 cups; whisk flour into drippings until incorporated. Stir broth-drippings mixture into the saucepan with fat over medium heat until thickened, about 5 minutes; season with salt and pepper.\nSlice tenderloins into medallions and top with half the gravy. Pour the remaining gravy into a gravy boat for serving.",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "1595135.jpg",
    "o": "",
    "st": "allrecipes"
}