{
    "id": 233419,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 slices bacon, diced",
        "3 shallots, sliced",
        "4 ounces chicken breast, cut into small cubes",
        "4 teaspoons curry powder, divided",
        "3 egg yolks, beaten",
        "1 teaspoon vegetable oil, or as needed (optional)",
        "3 cups cooked jasmine rice",
        "1 red Thai bird chile pepper, finely chopped",
        "2 tablespoons whole cilantro leaves",
        "1 tablespoon soy sauce",
        "2 teaspoons fish sauce",
        "1/2 teaspoon white sugar",
        "4 ounces tiger prawns, peeled and deveined",
        "1/4 cup chopped fresh pineapple",
        "3 green onions, finely chopped"
    ],
    "nut": [
        "Calories > 267 kcal",
        "Carbs > 29.7 g",
        "Cholesterol > 151 mg",
        "Fat > 10.3 g",
        "Protein > 13.3 g",
        "Sodium > 441 mg"
    ],
    "n": "Thai Fried Rice with Pineapple and Chicken",
    "a": "eatvancity",
    "r": "0",
    "s": 6,
    "des": "\"This is a Bangkok street food style recipe which I snagged on a recent trip there. Serve and enjoy. Try a hollowed pineapple shell as a serving bowl.\"",
    "ins": "Place bacon in a wok or large skillet; cook and stir over medium-high heat until crisp, about 10 minutes. Remove bacon with a slotted spoon and reserve bacon drippings in the wok. Cook and stir shallots in bacon drippings over medium-high heat until fragrant and light brown, 1 to 2 minutes.\nStir chicken into shallots and cook without stirring until browned on one side, 45 seconds to 1 minute; stir. Continue cooking until chicken is browned, about 1 minute. Add 2 teaspoons curry powder; stir until chicken is coated.\nMake a well in the center of chicken and pour oil into center of the well; add egg yolks. Cook and stir egg yolks until set, 1 to 2 minutes. Add rice and stir, breaking up rice.\nMix chile pepper, cilantro, soy sauce, remaining 2 teaspoons curry powder, fish sauce, and sugar into rice mixture; add shrimp and cook until shrimp is cooked through and pink, about 2 minutes. Fold pineapple, green onions, and bacon into rice mixture.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "1029505.jpg",
    "o": "3933633.jpg,3742308.jpg,3338353.jpg,3334620.jpg,3244090.jpg,2266389.jpg",
    "st": "allrecipes"
}