{
    "id": 233436,
    "old_rating": "4.58824",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 poblano pepper - stemmed, pepper slit down 1 side, and seeds removed",
        "1 teaspoon olive oil",
        "2 eggs",
        "1 1/2 teaspoons milk",
        "1 small tomato, diced",
        "1 baby bella mushroom, chopped",
        "1 green onion, finely chopped",
        "1 1/2 teaspoons chopped fresh cilantro",
        "salt and ground black pepper to taste",
        "1 teaspoon butter, or as needed",
        "1/4 cup shredded Cheddar-Monterey Jack cheese blend"
    ],
    "nut": [
        "Calories > 363 kcal",
        "Carbs > 9.9 g",
        "Cholesterol > 408 mg",
        "Fat > 27.4 g",
        "Protein > 21.3 g",
        "Sodium > 357 mg"
    ],
    "n": "Breakfast Stuffed Poblano Peppers",
    "a": "dooolay7",
    "r": "0",
    "s": 1,
    "des": "\"This is a healthy and tasty way to liven up your morning scrambled eggs. The measurements and ingredients can be altered to fit your own tastes. I always just use what I have on hand. Serve with your favorite salsa!\"",
    "ins": "Preheat the oven or toaster oven to 450 degrees F (230 degrees C). Lightly grease a baking sheet.\nLightly coat both sides of poblano pepper with olive oil; place pepper, opened like a butterfly with cut side up, onto the prepared baking sheet.\nBake in the preheated oven until pepper is tender and skin starts to brown, 20 to 30 minutes.\nWhisk eggs and milk together in a bowl; fold in tomato, mushroom, green onion, cilantro, salt, and black pepper.\nMelt butter in a skillet over medium heat; cook and stir egg mixture in the melted butter until eggs are set, about 5 minutes. Spoon egg mixture into poblano pepper and top with Cheddar-Monterey Jack cheese.\nBake in the oven until cheese is melted, 3 to 5 minutes.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "3903658.jpg",
    "o": "",
    "st": "allrecipes"
}