{
    "id": 233544,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crepes:",
        "2 cups flour",
        "1 cup cold water",
        "4 eggs",
        "2 tablespoons melted butter",
        "1/2 teaspoon salt",
        "Filling:",
        "4 tablespoons butter",
        "1/2 cup chopped green onion",
        "3/4 cup dry sherry",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "3 cups fresh crabmeat, cooked and diced",
        "Sauce:",
        "4 tablespoons butter",
        "6 tablespoons all-purpose flour",
        "2 cups hot milk",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/2 cup heavy cream",
        "2 egg yolks",
        "1 cup grated Swiss cheese"
    ],
    "nut": [
        "Calories > 542 kcal",
        "Carbs > 37.7 g",
        "Cholesterol > 234 mg",
        "Fat > 33.4 g",
        "Protein > 20.9 g",
        "Sodium > 699 mg"
    ],
    "n": "Crab Crepes",
    "a": "KerriJ",
    "r": "0",
    "s": 8,
    "des": "\"This is delicious on spring or summer evening with a green salad on the side.\"",
    "ins": "Place flour, water, eggs, 2 tablespoons melted butter, and 1/2 teaspoon salt into a blender. Cover and blend for 2 minutes. Chill batter in refrigerator for two hours.\nHeat an oiled, non-stick skillet over medium heat. Pour in enough of the chilled batter to cover half of the skillet. Tip and rotate the skillet until the batter covers the entire area. Cook until the batter turns from wet to moist, and the edges begin to curl away from the sides of the skillet. Turn the crepe over, and continue cooking until lightly golden on the other side. Place the crepe onto a plate, and cover with a kitchen towel to keep moist. Repeat with the remaining batter, lightly oiling the skillet as needed to keep the crepes from sticking.\nCook and stir green onions with 4 tablespoons butter in a skillet over medium-high heat until tender, 3 to 5 minutes. Add sherry, 1/4 teaspoon salt, and 1/4 teaspoon ground black pepper; stir to combine. Mix in crab.\nMelt 4 tablespoons butter in a saucepan over medium-high heat. Whisk in flour. Add milk, 1/4 salt, and 1/4 teaspoon ground black pepper; bring to a boil for 1 minute. Remove from heat.\nBeat heavy cream and egg yolks together in a small bowl. Gradually add egg mixture to butter-flour mixture, stirring constantly. Fold in grated cheese to form a thick sauce.\nPour sauce into crab meat mixture, reserving 1 cup of the sauce; stir to combine.\nLay out one crepe on a flat surface. Spoon 2 heaping spoonfuls of crab mixture at one end of the crepe, then roll crepe up around the filling. Repeat with remaining crepes. Top each with reserved cheese sauce and serve.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}