{
    "id": 233582,
    "old_rating": "4.62903",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1/2 pound bacon, cut crosswise into 1-inch pieces",
        "2 cloves garlic, minced",
        "2 teaspoons lemon zest",
        "2/3 cup creme fraiche",
        "2 cups ditalini pasta",
        "2 cups halved cherry tomatoes",
        "4 cups baby arugula, coarsely chopped",
        "salt and ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "1 tablespoon freshly shredded Parmesan cheese, or to taste (optional)"
    ],
    "nut": [
        "Calories > 502 kcal",
        "Carbs > 48.4 g",
        "Cholesterol > 76 mg",
        "Fat > 27.6 g",
        "Protein > 17.3 g",
        "Sodium > 517 mg"
    ],
    "n": "Chef John's BLT Pasta",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"If you can't decide whether to make a BLT sandwich or a pasta, now you can do both. The combination of bacon, lettuce, and tomato has a proven track record of deliciousness!\"",
    "ins": "Pour olive oil into a heavy skillet over medium heat, add bacon, and cook until almost crisp, 5 to 8 minutes. Turn off heat. Hold a paper towel with tongs and mop up excess bacon grease with the paper towel, leave about 2 teaspoons bacon grease in the skillet.\nStir minced garlic and lemon zest into bacon in the skillet and let cook in residual heat until fragrant, 2 to 3 minutes. Stir creme fraiche into bacon mixture.\nBring a large pot of salted water to a boil and stir in 2 cups of ditalini. Cook till tender, about 8 minutes. Drain and add pasta to the skillet. Stir pasta thoroughly into bacon and creme fraiche mixture.\nReturn skillet to medium heat. Add tomatoes; cook and stir until slightly softened, about 1 minute. Mix in arugula, stirring until wilted, about 30 seconds, and turn off heat.\nSeason with salt, black pepper, and cayenne pepper. Stir again and garnish with Parmesan cheese.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "4538750.jpg",
    "o": "4538750.jpg,4535398.jpg,4529131.jpg,4514748.jpg,3647843.jpg,2269411.jpg",
    "st": "allrecipes"
}