{
    "id": 233535,
    "old_rating": "3.89474",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "2 sweet red peppers, chopped",
        "1 large onion, chopped",
        "4 cloves cloves garlic, minced or pressed through a garlic press",
        "5 links precooked chicken and apple sausage, sliced into 1/4-thick rounds",
        "3 (16 ounce) packages penne pasta",
        "garlic and herb seasoning blend (such as Mrs. DashÂ®) to taste",
        "sea salt to taste",
        "ground black pepper to taste"
    ],
    "nut": [
        "Calories > 269 kcal",
        "Carbs > 44.7 g",
        "Cholesterol > 22 mg",
        "Fat > 4.8 g",
        "Protein > 10.9 g",
        "Sodium > 79 mg"
    ],
    "n": "Penne, Peppers, and Chicken-Apple Sausage Saute",
    "a": "MJdeCA",
    "r": "0",
    "s": 24,
    "des": "\"This recipe originated with my son, who makes it with very spicy chicken sausages. I loved it so much that I adapted it to suit our taste. Because my husband prefers less spicy food, I use milder chicken-apple sausage. This is one of our favorite dinners.\"",
    "ins": "Fill a large pot with lightly salted water and bring to a boil. Stir in penne and return to a boil. Cook pasta uncovered, stirring occasionally, until cooked through but still firm to the bite, about 11 minutes; drain.\nHeat oil in a large skillet over medium heat. Cook and stir peppers until slightly tender, about 7 minutes. Stir in onions and cook until onions soften and turn golden, 7 minutes. Add garlic and cook 5 minutes, stirring occasionally.\nStir sausage slices into onions and peppers, reduce heat to medium-low, cover, and simmer for 10 minutes.\nStir drained penne into sausage and onions and reduce heat to low. Season with garlic and herb seasoning, sea salt, and pepper to taste.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "1081388.jpg",
    "o": "",
    "st": "allrecipes"
}