{
    "id": 233538,
    "old_rating": "4.35",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/4 ounces freeze-dried strawberries",
        "3/4 cup all-purpose flour",
        "3/4 cup cake flour",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 cup unsalted butter, room temperature",
        "1 1/3 cups white sugar",
        "3 eggs, room temperature",
        "1 teaspoon vanilla extract",
        "2/3 cup whole milk, room temperature"
    ],
    "nut": [
        "Calories > 151 kcal",
        "Carbs > 23.1 g",
        "Cholesterol > 41 mg",
        "Fat > 5.8 g",
        "Protein > 2.3 g",
        "Sodium > 125 mg"
    ],
    "n": "REALLY Real Strawberry Cupcakes",
    "a": "Candice",
    "r": "0",
    "s": 20,
    "des": "\"I've been messing around trying to make a perfect strawberry cupcake to go with the Real Strawberry Frosting I developed a couple of years ago. It's been a long road and lots of cupcakes tested and tasted along the way. The trick was NOT using puree as I do when making the frosting. Rather, grinding freeze-dried strawberries into a powder brought this cupcake recipe out of my test kitchen and into my recipe box! I am so pleased with the results!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line muffin tins with 20 cupcake liners (for mini cupcakes, line 72 mini muffin tins).\nGrind strawberries into a fine powder using a coffee grinder or food processor. Whisk strawberry powder, all-purpose flour, cake flour, baking powder, baking soda, and salt together in a bowl.\nBeat butter and sugar in a bowl with an electric mixer until light and fluffy. Mixture should be noticeably lighter in color. Add room-temperature eggs one at a time, allowing each egg to blend into butter mixture before adding the next. Beat in vanilla extract.\nStir flour mixture, alternately with the milk, into butter mixture until just incorporated. Fill lined tins with cupcake batter.\nBake in preheated oven until cupcakes spring back when gently touched with a fingertip or a toothpick inserted in the center comes out clean, 16 to 18 minutes for regular cupcakes, 8 to 10 minutes for mini cupcakes.",
    "pt": "30 m",
    "ct": "17 m",
    "tt": "47 m",
    "i": "1032730.jpg",
    "o": "4509525.jpg,4486631.jpg,4082101.jpg,3893437.jpg,3445415.jpg,2072430.jpg",
    "st": "allrecipes"
}