{
    "id": 233570,
    "old_rating": "4.34483",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "1/2 cup diced onion",
        "2 cloves garlic, minced",
        "1 (15 ounce) can Tex Mex-style diced tomatoes",
        "1 (4 ounce) can chopped green chilies",
        "2 tablespoons chopped fresh cilantro",
        "1 (1 ounce) packet taco seasoning mix",
        "1 (20 ounce) can refried black beans",
        "2 (10 ounce) cans red enchilada sauce (such as Old El PasoÂ®)",
        "2 cups shredded pepperjack cheese",
        "2 cups shredded Monterey Jack cheese",
        "6 (8 inch) flour tortillas",
        "1/2 cup sour cream, or to taste (optional)"
    ],
    "nut": [
        "Calories > 642 kcal",
        "Carbs > 45.5 g",
        "Cholesterol > 102 mg",
        "Fat > 36.2 g",
        "Protein > 32.7 g",
        "Sodium > 1684 mg"
    ],
    "n": "Spicy Beef and Bean Enchilada Pie",
    "a": "imn2science",
    "r": "0",
    "s": 8,
    "des": "\"This is a scrumptious, filling Mexican dish that is easy and loved by everyone I've served it to. Lots of flavor and a spicy kick of chiles and pepperjack cheese will make this a family staple any night of the week.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nCook and stir ground beef and onions in a large skillet over medium-high heat until meat is browned and crumbly, 7 to 10 minutes. Add garlic and cook until fragrant, about 30 seconds. Stir in diced tomatoes, green chiles, cilantro, and taco seasoning mix. Remove from heat.\nMix black beans and 1 can red enchilada sauce in a bowl until creamy.\nMix pepperjack cheese and Monterey Jack cheese together in a separate bowl.\nHeat a cast-iron skillet over medium heat. Cook tortillas, one at a time, until slightly crisp, about 15 seconds per side.\nPlace one tortilla on the bottom of an 8-inch springform pan. Spread a generous layer of black bean mixture on top of tortilla, then spread a layer of ground beef mixture on top. Sprinkle 1 cup of cheese mixture on top of meat mixture and pour 1/4 cup red enchilada sauce over the top. Repeat the tortilla, bean, meat, cheese, and sauce layering process, finishing with cheese and enchilada sauce on top.\nCover pan with aluminum foil and bake in the preheated oven until cheese is bubbling and enchiladas are cooked through, about 40 minutes. Cool for 15 minutes and serve with sour cream.",
    "pt": "25 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1060347.jpg",
    "o": "",
    "st": "allrecipes"
}