{
    "id": 233583,
    "old_rating": "4.35714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup sour cream",
        "1/2 avocado, peeled and pitted",
        "1/2 lemon, juiced",
        "1 pound small Gulf shrimp (50 to 60 per pound), thawed and drained",
        "1 tablespoon vegetable oil",
        "1/4 teaspoon ground dried chipotle pepper",
        "salt and ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "50 large (restaurant-style) tortilla chips, or as needed",
        "2 jalapeno peppers, seeded and very thinly sliced",
        "3 1/2 cups shredded pepperjack cheese, or as needed",
        "15 cherry tomatoes, sliced - or as needed",
        "1/4 cup chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 209 kcal",
        "Carbs > 6.3 g",
        "Cholesterol > 82 mg",
        "Fat > 14.9 g",
        "Protein > 12.5 g",
        "Sodium > 278 mg"
    ],
    "n": "Shrimp and Jalapeno Nachos",
    "a": "Chef John",
    "r": "0",
    "s": 15,
    "des": "\"What better way to 'fiesta' than with this beautiful plate of alternative nachos? This will make a very delicious change of pace to the traditional version. Each nacho is separate from the next so you don't end up with a plate containing one giant nacho that you have to pull apart.\"",
    "ins": "Combine sour cream, avocado, and lemon juice in a blender or food processor; blend until smooth and creamy. Transfer into a plastic decorating bottle with a long tip. Refrigerate avocado-cream sauce until needed.\nPlace shrimp into a bowl; combine with vegetable oil, ground chipotle pepper, salt, black pepper, and cayenne pepper.\nPlace a large nonstick pan over high heat. Cook shrimp in the hot pan in a single layer until barely cooked through and pink, about 1 minute per side. Transfer to a plate and let shrimp cool.\nPreheat the oven's broiler. Line a baking sheet with aluminum foil and lightly grease the foil.\nLay tortilla chips onto the prepared baking sheet in a single layer. Place 1 shrimp onto each chip. Add 1 slice jalapeno and 1 large pinch pepperjack cheese on top of each shrimp.\nBroil under preheated broiler until cheese is melted and chips are lightly toasted, about 1 minute. Watch carefully; chips will burn quickly.\nRemove nachos from baking sheet and arrange onto a serving platter; drizzle with avocado-cream sauce and sprinkle with cherry tomatoes and cilantro before serving.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "25 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}