{
    "id": 233655,
    "old_rating": "4.52778",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "16 paper muffin liners",
        "salt and ground black pepper to taste",
        "Secret sauce ingredients:",
        "2 tablespoons mayonnaise",
        "1 tablespoon ketchup",
        "1 tablespoon Dijon mustard",
        "1 tablespoon sweet pickle relish",
        "8 slider-size burger buns, cut almost through horizontally",
        "8 slices roma (plum) tomato"
    ],
    "nut": [
        "Calories > 214 kcal",
        "Carbs > 160.2 g",
        "Cholesterol > 36 mg",
        "Fat > 10.9 g",
        "Protein > 11.7 g",
        "Sodium > 155 mg"
    ],
    "n": "Chef John's Beef Sliders",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"Sliders are a small version of a hamburger. A little trick helps you to get them all the same size so they cook evenly and look very professional. Do a couple of tests to determine your perfect degree of doneness and cook all the burgers the same amount of time.\"",
    "ins": "Place ground beef onto a work surface; divide into 8 equal-size pieces using a knife or pastry cutter. Line 8 muffin cups with paper liners.\nSprinkle bottoms of paper liners with salt and black pepper. Form each piece of burger into a rough ball and place into a muffin cup. Season tops with salt and pepper.\nPlace a second paper liner on top of each piece of meat and gently press it down to shape the mini burger into a round, flat shape. Pull off the paper tops and remove burgers from the muffin cups; remove bottom paper liners from burgers.\nHeat a large nonstick skillet over medium-high heat. Cook burgers in the hot skillet until they have a browned crust and are slightly pink in the middle, about 3 minutes per side. Flip burgers and cook 3 minutes on other side. Remove burgers to a plate to rest for 2 minutes.\nMix mayonnaise, ketchup, mustard, and pickle relish in a bowl; spoon a dollop onto each bun. Place burgers onto buns, season with more black pepper, and top with a tomato slice. Close buns and serve.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "3520504.jpg",
    "o": "3520504.jpg,3519841.jpg,3154833.jpg,2613800.jpg,1130629.jpg,1098472.jpg",
    "st": "allrecipes"
}