{
    "id": 233661,
    "old_rating": "4.91818",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound bulk Italian sausage",
        "1 1/2 pounds lean ground beef",
        "1 (8 ounce) package fresh mushrooms, coarsely chopped",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 teaspoon dried Italian herb seasoning (optional)",
        "1/4 teaspoon red pepper flakes",
        "6 cups prepared marinara sauce",
        "2 tablespoons water, plus more as needed",
        "2 eggs",
        "2 pounds whole-milk ricotta cheese",
        "1 (8 ounce) container fresh mozzarella cheese, diced",
        "2/3 cup freshly shredded Parmigiano-Reggiano cheese",
        "1 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 pinch cayenne pepper, or to taste",
        "1/4 cup chopped fresh parsley",
        "1 (16 ounce) package lasagna noodles",
        "1 (8 ounce) container fresh mozzarella cheese, diced",
        "1/2 cup freshly shredded Parmigiano-Reggiano cheese"
    ],
    "nut": [
        "Calories > 730 kcal",
        "Carbs > 49.8 g",
        "Cholesterol > 159 mg",
        "Fat > 39.2 g",
        "Protein > 42.9 g",
        "Sodium > 1514 mg"
    ],
    "n": "Chef John's Lasagna",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"There are only two things you need for great lasagna: a thick, rich, super-meaty meat sauce and lots of it, and a ricotta filling where only the finest cheeses are welcomed. For the sauce, I love a combination of half Italian sausage and half lean ground beef. I also like lots of sauce.\"",
    "ins": "Place sausage and ground beef into a large saucepan over medium heat; cook and stir until meat is browned and crumbly, about 10 minutes. Break the meat apart as it cooks. Stir in mushrooms, 1 teaspoon salt, 1/2 teaspoon black pepper, Italian herb seasoning, and red pepper flakes. Turn heat to medium-high and cook until mushrooms have given off their juices and bottom of pan is almost dry.\nPour prepared marinara sauce into meat mixture. Pour water into marinara sauce jar and shake to get all the sauce out of the jar; add to mixture. Reduce heat to low and simmer until meat is extremely tender, about 2 hours. Add a little more water if sauce becomes too thick. Skim excess fat from surface of the sauce and season with more salt and black pepper, if needed. Turn off heat.\nPreheat oven to 375 degrees F (190 degrees C).\nBeat eggs in a large bowl and stir in ricotta cheese, 8 ounces diced mozzarella cheese, and 2/3 cup Parmigiano-Reggiano cheese. Season cheese mixture with 1 teaspoon salt, 1/4 teaspoon  black pepper, and cayenne pepper; mix in parsley.\nBring a large pot of salted water to a boil. Cook lasagna in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 8 minutes. Drain and rinse noodles and set aside in a bowl of cold water.\nSpread 1/4 the sauce into the bottom of a 10x15-inch baking pan. Top with 1/3 the noodles and spread 1/2 the ricotta cheese mixture over noodles. Spread 1/4 the meat sauce over the cheese, top with 1/3 the noodles, and spread remaining 1/2 the ricotta mixture over the noodles. Spread 1/4 the meat sauce over the cheese filling. Tap the casserole dish lightly on a sturdy work surface to settle the layers. Arrange last 1/3 the noodles over sauce and spread remaining 1/4 the sauce over the noodles. Dot top of the casserole with 4 ounces diced fresh mozzarella cheese and sprinkle with 1/2 cup Parmigiano-Reggiano cheese.\nCover casserole with aluminum foil, being sure not to touch the top of the casserole with the foil. Place casserole onto a baking sheet to catch spills.\nBake in the preheated oven for 30 minutes. Remove foil and cook until lasagna is golden brown and bubbling, 30 to 35 more minutes. Let set for 20 minutes before cutting into squares.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "3 h ",
    "i": "4537027.jpg",
    "o": "4537027.jpg,4521281.jpg,4515254.jpg,4481180.jpg,4464748.jpg,4458958.jpg",
    "st": "allrecipes"
}