{
    "id": 233651,
    "old_rating": "4.23077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 yellow onion - ends trimmed off, peeled, and cut crosswise into 1/2-inch slices",
        "2 egg whites",
        "2 tablespoons milk",
        "1 pinch cayenne pepper, or to taste",
        "3 cups panko bread crumbs, or more if needed",
        "1/2 cup all-purpose flour",
        "salt and ground black pepper to taste",
        "cooking spray"
    ],
    "nut": [
        "Calories > 298 kcal",
        "Carbs > 74 g",
        "Cholesterol > < 1 mg",
        "Fat > 3.1 g",
        "Protein > 12.8 g",
        "Sodium > 526 mg"
    ],
    "n": "Oven-Baked Onion Rings",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"It's hard to bake an onion ring as good as a deep-fried version. These are pretty good, so check it out! This makes a very crunchy, easy, no-muss, no-fuss onion ring.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nSeparate onion slices into individual rings.\nWhisk egg whites with milk in a bowl until thoroughly combined; season egg mixture with a pinch of cayenne pepper. Place panko crumbs into a separate bowl.\nPlace onion rings into a large resealable plastic bag. Add flour, salt, and black pepper; seal bag and shake until rings are well coated with flour.\nDrop flour-coated onion rings into egg white-milk mixture, a few at a time, and toss lightly with tongs until coated. Place rings into panko crumbs and gently shake the bowl to toss the crumbs with the onion rings until rings are coated with crumbs.\nTransfer coated onion rings to a large baking sheet; spray rings lightly with cooking spray.\nBake in the preheated oven until onion rings are tender and crumbs are lightly golden brown, 12 to 15 minutes.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "4534396.jpg",
    "o": "4534396.jpg,3638111.jpg,3537414.jpg,3038469.jpg,2049813.jpg,1876980.jpg",
    "st": "allrecipes"
}