{
    "id": 233633,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound Italian sausage links",
        "1 pound ground turkey",
        "1 onion, chopped",
        "5 cloves garlic, minced",
        "6 (8 ounce) cans tomato sauce",
        "1 (15 ounce) can chopped tomatoes",
        "2 (6 ounce) cans tomato paste",
        "1 tablespoon white sugar",
        "1 tablespoon dried oregano",
        "1 tablespoon dried basil",
        "1 tablespoon dried parsley",
        "1 (16 ounce) package spaghetti"
    ],
    "nut": [
        "Calories > 595 kcal",
        "Carbs > 66.8 g",
        "Cholesterol > 85 mg",
        "Fat > 23.6 g",
        "Protein > 31.7 g",
        "Sodium > 1744 mg"
    ],
    "n": "Jan's Yummy Spaghetti",
    "a": "Jan",
    "r": "0",
    "s": 8,
    "des": "\"I developed this recipe several years ago when my three children were young. They are all on their own now, and make my spaghetti recipe regularly. Everyone who's ever tried it loves it! Very yummy! Serve with grated Parmesan cheese if desired.\"",
    "ins": "Bring a pot of water to a boil; cook sausage in the boiling water until partially cooked, about 5 minutes. Remove sausage from water and slice.\nHeat a large skillet over medium-high heat. Cook and stir ground turkey, onion, and garlic in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir sausage, tomato sauce, chopped tomatoes, tomato paste, sugar, oregano, basil, and parsley into ground turkey; bring to a boil, stirring frequently. Reduce heat and simmer, stirring occasionally, until flavors have blended and sausage is fully cooked, about 1 hour.\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain and transfer spaghetti to a serving bowl; top with sauce. Toss to coat.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4011501.jpg",
    "o": "",
    "st": "allrecipes"
}