{
    "id": 233682,
    "old_rating": "4.5122",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup white sugar",
        "1/2 cup butter, softened",
        "2 eggs",
        "1 lemon, juiced and zested",
        "1 1/2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/2 cup milk",
        "1/2 cup flaked coconut",
        "Lemon Drizzle:",
        "3/4 cup confectioners' sugar",
        "2 teaspoons lemon juice, or more as needed"
    ],
    "nut": [
        "Calories > 301 kcal",
        "Carbs > 46.5 g",
        "Cholesterol > 63 mg",
        "Fat > 11.7 g",
        "Protein > 3.8 g",
        "Sodium > 202 mg"
    ],
    "n": "Yummy Lemon Coconut Loaf",
    "a": "Christina",
    "r": "0",
    "s": 10,
    "des": "\"This loaf is buttery, moist, and full of flavor. The sweet/tart lemon drizzle really puts it over the top. Enjoy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 4x8-inch loaf pan.\nBeat white sugar and butter in a large bowl until light and fluffy. Add eggs, one at a time, beating well after each addition. Stir juice and zest of one lemon into butter mixture.\nMix flour, baking powder, and salt in a separate bowl; add to butter mixture alternately with milk, mixing until batter is just incorporated. Fold in coconut, mixing just enough to evenly combine. Pour the batter into prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 60 to 65 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.\nGradually stir 2 teaspoons lemon juice into confectioners' sugar in a bowl until mixture is thin enough to drizzle. Transfer mixture to a resealable plastic bag. Cut a small hole in the corner of the bag. Gently squeeze bag and drizzle mixture evenly over the loaf.",
    "pt": "25 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1049318.jpg",
    "o": "4516950.jpg,4515986.jpg,4459262.jpg,4314450.jpg,3502729.jpg,3380150.jpg",
    "st": "allrecipes"
}