{
    "id": 233615,
    "old_rating": "3.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 sweet potato, washed and pricked several times with a fork",
        "1 (15 ounce) can black beans, rinsed and drained",
        "1 egg",
        "3 green onions (green parts only), minced",
        "2 teaspoons minced garlic",
        "3/4 cup dry bread crumbs",
        "1 jalapeno pepper, seeded and minced (optional)",
        "salt and ground black pepper to taste",
        "2 tablespoons olive oil",
        "24 slider-size burger buns"
    ],
    "nut": [
        "Calories > 134 kcal",
        "Carbs > 166 g",
        "Cholesterol > 8 mg",
        "Fat > 3.1 g",
        "Protein > 4 g",
        "Sodium > 102 mg"
    ],
    "n": "Black Bean Burgers with Sweet Potato",
    "a": "BugsterBrown",
    "r": "0",
    "s": 24,
    "des": "\"Kids love help making this by mashing the mixture and forming patties. Serve the burgers on buns with guacamole or condiments of your choosing. Can be frozen for up to 6 months.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Prepare a baking sheet with cooking spray.\nBake sweet potato in the preheated oven until cooked through and soft in the center, 40 to 45 minutes. Let potato cool completely.\nPeel the potato and mash flesh in a large bowl with black beans. Mix egg, green onions, and garlic into the potato mixture. Add bread crumbs and mix until the mixture sticks together; season with jalapeno pepper, salt, and black pepper. Roll the mixture into 24 small balls and flatten into 2 1/2-inch patties.\nArrange patties onto prepared baking sheet. Brush each patty with olive oil.\nBake patties in preheated oven until browned on top, 10 to 12 minutes. Turn patties with a thin spatula, brush again with olive oil, and continue baking until slightly crisp along the edges, 2 to 3 minutes more. Serve on buns.",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "4160597.jpg",
    "o": "",
    "st": "allrecipes"
}