{
    "id": 233644,
    "old_rating": "4.53061",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 large potatoes, peeled and cubed",
        "2 tablespoons butter, divided",
        "salt and ground black pepper to taste",
        "1 pound ground beef",
        "1 packet dry French onion soup mix",
        "1 cube chicken bouillon",
        "1 cube beef bouillon",
        "2 tablespoons water (optional)",
        "1 (11 ounce) can whole kernel corn, drained",
        "1 (10 ounce) can diced carrots, drained",
        "1 (10 ounce) can peas, drained",
        "2 tablespoons paprika",
        "1 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 564 kcal",
        "Carbs > 65.6 g",
        "Cholesterol > 77 mg",
        "Fat > 23.1 g",
        "Protein > 26.4 g",
        "Sodium > 1415 mg"
    ],
    "n": "Marie's Shepherd's Pie",
    "a": "Marie Catalano",
    "r": "0",
    "s": 6,
    "des": "\"A twist on the traditional shepherd's pie. I gathered ideas from family and friends and other recipes and came up with my own different and very tasty version of an old time favorite. Everyone eats this up likes it's a dessert!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nPlace potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 15 minutes. Drain and transfer potatoes to a large bowl. Mash potatoes with 1 tablespoon butter using a potato masher or fork; season with salt and pepper.\nMelt 1 tablespoon butter in a large skillet over medium heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir onion soup mix, chicken bouillon, and beef bouillon into ground beef; simmer until flavors blend, about 2 minutes. Add water if mixture is too dry.\nSpread ground beef mixture into the bottom of a 2-quart casserole dish; top with corn, carrots, and peas. Spoon mashed potato mixture over vegetable layer; sprinkle with paprika.\nBake in the preheated oven for 20 minutes. Sprinkle Cheddar cheese over mashed potato layer; continue baking until cheese is melted and bubbling, about 10 more minutes.",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "1070666.jpg",
    "o": "",
    "st": "allrecipes"
}