{
    "id": 233602,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds thick-cut bacon, divided",
        "1 tablespoon barbeque spice rub, divided",
        "2 pounds bulk pork sausage",
        "1 cup finely shredded Cheddar cheese",
        "2 green onions, thinly sliced",
        "4 cloves garlic, minced",
        "1 (18 ounce) bottle barbeque sauce"
    ],
    "nut": [
        "Calories > 507 kcal",
        "Carbs > 20 g",
        "Cholesterol > 96 mg",
        "Fat > 36.4 g",
        "Protein > 23.9 g",
        "Sodium > 2239 mg"
    ],
    "n": "Bacon Explosion",
    "a": "gumby101",
    "r": "0",
    "s": 10,
    "des": "\"This is my version of the Bacon Explosion. There are many versions on the web whether it's called a pork fatty, bacon bomb, etc...No matter how you slice it, it's an insane barbecue flavor in an artery-clogging roll. If you have a smoker, you have to try this one. Remember, moderation is the key when eating a bacon explosion. Enjoy.\"",
    "ins": "Preheat smoker to 225 to 250 degrees F (110 to 120 degrees C).\nReserve about 1/2 pound bacon for cooking. Lay 2 strips of the remaining bacon on a clean surface in an X. Alternate horizontal and vertical bacon strips, weaving them tightly in an over-and-under pattern to create a lattice pattern. Sprinkle woven bacon with 1 teaspoon barbeque rub.\nArrange reserved 1/2 pound of bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels; crumble.\nPlace sausage in a large resealable plastic bag; do not close bag. Roll sausage out, still in the bag, to a square the same size as the woven bacon. Cut bag off the sausage and arrange sausage over bacon; discard bag. Sprinkle crumbled bacon, Cheddar cheese, green onions, and garlic over sausage. Pour about 3/4 bottle barbeque sauce over sausage and season with remaining barbeque rub.\nRoll woven bacon tightly around sausage into a loaf.\nCook bacon-sausage loaf seam-side down in the preheated smoker for about 1 1/2 hours. Brush woven bacon with remaining barbeque sauce and continue to smoke until loaf is no longer pink in the center, about 30 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Allow loaf to rest for 30 minutes before slicing.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "3 h",
    "i": "4066714.jpg",
    "o": "4066714.jpg,2417796.jpg,1333420.jpg,1096992.jpg,1082801.jpg,1052114.jpg",
    "st": "allrecipes"
}