{
    "id": 233674,
    "old_rating": "4.64211",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large egg",
        "1/4 cup white sugar",
        "1 pinch salt",
        "2 tablespoons unsweetened cocoa powder",
        "2 tablespoons butter, melted",
        "1 tablespoon vegetable oil",
        "1/8 teaspoon vanilla extract",
        "1 tablespoon unsweetened shredded coconut",
        "2 tablespoons toasted sliced almonds",
        "1 1/2 tablespoons miniature semisweet chocolate chips",
        "3 tablespoons milk",
        "1/4 cup all-purpose flour",
        "1/4 teaspoon baking powder",
        "1/4 teaspoon confectioners' sugar",
        "1/4 teaspoon unsweetened cocoa powder, or as needed"
    ],
    "nut": [
        "Calories > 472 kcal",
        "Carbs > 48.7 g",
        "Cholesterol > 125 mg",
        "Fat > 29.5 g",
        "Protein > 8.5 g",
        "Sodium > 191 mg"
    ],
    "n": "Minute Chocolate Mug Cake",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"What's not to love about warm chocolate cake spiked with chocolate, coconut, and chocolate chips and topped with melting vanilla bean ice cream? This literally takes less than a minute to cook up and a couple minutes to prepare.\"",
    "ins": "Whisk egg, sugar, salt, 2 tablespoons cocoa powder, butter, vegetable oil, and vanilla extract together in a bowl until smooth. Stir coconut, almonds, and chocolate chips into the mixture; whisk in milk.\nPlace flour into a small bowl or measuring cup and stir baking powder into flour with a mini whisk or fork. Pour flour mixture over batter and whisk just until you can't see visible flour.\nDivide batter evenly between 2 coffee cups. Gently tap the cups on a work surface to eliminate air bubbles.\nPlace cups into microwave oven, one at a time. Microwave each cup on High for 45 seconds. Nothing will happen in the first 30 seconds; in the last 10 to 15 seconds, batter will begin to rise in the cup. Cooked cake will collapse after microwaving. Remove from oven and let cool 2 to 3 minutes.\nLightly dust each serving with confectioners' sugar and 1/8 teaspoon cocoa. Place each coffee cup onto a saucer and serve.",
    "pt": "10 m",
    "ct": "2 m",
    "tt": "17 m",
    "i": "4110381.jpg",
    "o": "4110381.jpg,3901254.jpg,3399851.jpg,3318318.jpg,3190672.jpg,3174478.jpg",
    "st": "allrecipes"
}