{
    "id": 233737,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup white sugar",
        "5 tablespoons hot water",
        "1 egg",
        "2 cups cake flour",
        "2 tablespoons cake flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "2 tablespoons vegetable oil",
        "1/2 cup raw sesame seeds, or as needed",
        "vegetable oil for deep frying"
    ],
    "nut": [
        "Calories > 209 kcal",
        "Carbs > 29.6 g",
        "Cholesterol > 16 mg",
        "Fat > 8.7 g",
        "Protein > 3.7 g",
        "Sodium > 100 mg"
    ],
    "n": "Chinese Sesame Doughnuts",
    "a": "siulinskitchen",
    "r": "0",
    "s": 12,
    "des": "\"These crunchy, deep-fried sesame balls are one of my favorite treats during the Chinese New Year. In Cantonese, it means 'laughing dates' because these sesame balls crack open like a laughing mouth. They carry the meaning of bringing lots of laughter and happiness to your family. They are very easy to make, crunchy, and aromatic. Cool before storing them in dry, air-tight containers.\"",
    "ins": "Mix sugar and water together in a small bowl until melted. Let cool, at least 15 minutes. Add egg; mix until combined.\nCombine 2 cups plus 2 tablespoons flour, baking powder, and baking soda in a large bowl. Mix in sugar-egg mixture and 2 tablespoons oil with a wooden spoon. Knead by hand until dough sticks together, adding 1 teaspoon water at a time if too dry. Wrap dough in plastic wrap; let rest for 30 minutes.\nUnwrap dough and place on a lightly floured work surface. Roll out into long tubes. Cut tubes into small pieces and roll pieces into balls about 1/2-inch wide.\nSpray balls lightly with water. Place sesame seeds in a shallow dish. Dip dough balls into the sesame seeds and roll to press in the seeds.\nHeat deep-frying oil in a large saucepan over high heat. Add dough balls; reduce heat to low. Cook, turning occasionally, until lightly golden brown, 4 to 6 minutes. Drain on paper towels.",
    "pt": "40 m",
    "ct": "4 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}