{
    "id": 233789,
    "old_rating": "4.125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1/2 cup chopped green onions",
        "1 anchovy fillet",
        "3 cloves garlic, minced",
        "2 zucchini - alternating strips of peel removed lengthwise and zucchini sliced",
        "salt and ground black pepper to taste",
        "2 cups tomato sauce",
        "3/4 cup chicken stock",
        "1 pinch white sugar (optional)",
        "1 cup seeded and sliced jalapeno peppers",
        "1 cup seeded and sliced red Fresno chile peppers",
        "1/2 cup seeded and sliced yellow mini bell pepper",
        "1/2 cup seeded and sliced orange mini bell pepper",
        "2 1/2 cups rotelle pasta",
        "2 tablespoons chopped fresh flat-leaf parsley, divided",
        "2 teaspoons freshly grated Parmigiano-Reggiano cheese"
    ],
    "nut": [
        "Calories > 269 kcal",
        "Carbs > 42.4 g",
        "Cholesterol > 2 mg",
        "Fat > 8.7 g",
        "Protein > 9.6 g",
        "Sodium > 876 mg"
    ],
    "n": "Hot Wheels Pasta",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Rotelle pasta, an assortment of colorful sweet and hot pepper rings, and slices of zucchini make the wheels in this easy summer pasta. There are all types of summer vegetables you can use, and if you have some leftover chicken you're trying to sneak into something, this would be perfect.\"",
    "ins": "Bring a large pot of salted water to a boil.\nPlace heavy skillet over medium heat and pour olive oil into hot skillet; add green onions and anchovy fillet. Cook and stir until anchovy breaks down and green onions are tender, 2 to 3 minutes. Add garlic to skillet and cook until translucent, about 1 minute.\nStir zucchini into green onion mixture; cook, stirring occasionally, until zucchini slices just start  to become tender, about 2 minutes. Sprinkle with salt and black pepper; cook until zucchini centers start to change color to slightly green, 1 to 2 more minutes.\nPour tomato sauce and chicken stock into skillet. Reduce heat to low; add sugar. Mix jalapeno, Fresno, yellow mini pepper, and orange mini pepper rings into mixture. Bring sauce to a simmer and reduce heat to low.\nPour rotelle pasta into boiling water and cook, stirring often, until pasta is still slightly firm, about 7 minutes. Drain and let pasta stand for 2 minutes.\nBring sauce to a boil; stir in rotelle pasta. Reduce heat to medium. Cook, stirring often, until pasta, zucchini, and peppers are tender, 2 to 3 more minutes. Taste and adjust levels of salt and black pepper. Mix in about 1 1/2 teaspoon parsley. Serve in bowls and top with Parmigiano-Reggiano cheese and remaining 1/2 teaspoon parsley.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}