{
    "id": 233734,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 cup cake flour",
        "1/4 cup matcha green tea powder, divided",
        "3/4 teaspoon baking powder",
        "2 eggs, separated",
        "1/2 cup white sugar",
        "1/4 cup sour cream",
        "3 tablespoons 2% milk",
        "1 cup heavy whipping cream",
        "1 tablespoon white sugar"
    ],
    "nut": [
        "Calories > 246 kcal",
        "Carbs > 26.8 g",
        "Cholesterol > 91 mg",
        "Fat > 14.1 g",
        "Protein > 4.1 g",
        "Sodium > 82 mg"
    ],
    "n": "Green Tea Matcha Cake Roll",
    "a": "Vanessa",
    "r": "0",
    "s": 8,
    "des": "\"I love matcha green tea. I used to be able to get tons of delicious matcha desserts while I was in China. After coming to the States, I've been searching and trying, and finally came up with this one for matcha cake.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a rimmed baking sheet with parchment paper.\nSift flour, 3 tablespoons matcha powder, and baking powder together 3 times in a bowl.\nBeat egg whites in a clean bowl using an electric mixture until stiff peaks form.\nBeat egg yolks in a separate bowl using a clean beaters until very light. Add 1/2 cup sugar and sour cream; beat until light. Beat in flour mixture and milk until smooth. Fold in the egg whites. Smooth batter evenly over the prepared sheet.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 8 minutes.\nTrim any uneven edges off the cake. Roll cake up in the parchment starting from the short side. Place on a rack and cool completely, at least 30 minutes.\nBeat cream in a chilled glass or metal bowl with an electric mixer until soft peaks form. Add remaining 1 tablespoon matcha powder and 1 tablespoon sugar gradually, continuing to beat until stiff.\nUnroll the cake and spread whipped cream over the top. Roll the cake up, peeling the parchment away and discarding it. Refrigerate cake roll for 1 hour before slicing.",
    "pt": "25 m",
    "ct": "8 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}