{
    "id": 233732,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound ground beef",
        "1 (8 ounce) package spaghetti",
        "1 (28 ounce) jar spaghetti sauce",
        "1/2 cup grated Parmesan cheese",
        "1 (13.8 ounce) can refrigerated pizza dough (such as PillsburyÂ®)",
        "2 cups shredded mozzarella cheese",
        "1 clove garlic, minced",
        "3 tablespoons olive oil"
    ],
    "nut": [
        "Calories > 675 kcal",
        "Carbs > 78.1 g",
        "Cholesterol > 55 mg",
        "Fat > 25.4 g",
        "Protein > 30.9 g",
        "Sodium > 1328 mg"
    ],
    "n": "Delicious Spaghetti Bread",
    "a": "Ledbetters",
    "r": "0",
    "s": 6,
    "des": "\"I had a co-worker share this recipe with me and I put my own twist on it and thought it turned out to be quite tasty! My hubby does not like regular spaghetti but really enjoyed it this way!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Transfer ground beef to a mixing bowl.\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain. Transfer spaghetti to bowl with ground beef and mix in spaghetti sauce and Parmesan cheese.\nUnroll pizza dough onto a baking sheet. Starting with a long edge, cut the 2 outer thirds of the crust into 1-inch horizontal strips, leaving the center third uncut. Spoon spaghetti mixture onto the center third from top to bottom. Spread mozzarella cheese over the spaghetti mixture.\nBraid the dough strips over the filling by pulling a dough strip across the filling and pulling another strip from the opposite side over the first strip. Pinch strips together and continue to braid until the filling is covered with braided dough. Mix garlic into olive oil in a small bowl. Brush olive oil mixture over the top of the bread.\nBake in the preheated oven until the filling is hot and the crust is golden brown, 25 to 30 minutes. Serve cut in slices.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "2143720.jpg",
    "o": "",
    "st": "allrecipes"
}