{
    "id": 233735,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 (8 ounce) packages thick rice noodles (he fun)",
        "1/2 pound raw shrimp, peeled and deveined",
        "1 tablespoon sesame oil",
        "1 teaspoon salt",
        "1 teaspoon ground white pepper",
        "1 (16 ounce) package wonton wrappers",
        "1 egg white, beaten",
        "2 (14 ounce) cans chicken broth",
        "2 cups water",
        "2 tablespoons chopped scallions"
    ],
    "nut": [
        "Calories > 829 kcal",
        "Carbs > 159.8 g",
        "Cholesterol > 101 mg",
        "Fat > 6.7 g",
        "Protein > 26.1 g",
        "Sodium > 2481 mg"
    ],
    "n": "Shrimp Wonton with Noodles",
    "a": "Catty",
    "r": "0",
    "s": 4,
    "des": "\"I've loved shrimp wontons with noodles since I was a child. It's a typical Cantonese (Southern Chinese) recipe and is found in most tea cafes in Hong Kong. Most of the time wontons contain pork but I prefer those with shrimp only.\"",
    "ins": "Soak rice noodles in a bowl of cold water until softened, about 10 minutes. Drain.\nBring a pot of water to a boil. Add noodles; cook, stirring occasionally, until tender, about 5 minutes. Drain.\nPlace shrimp on a flat work surface; pound with a meat tenderizer until a thick paste forms. Mix in sesame oil, salt, and pepper.\nPlace a wonton wrapper diagonally on a flat work surface. Add a spoonful of shrimp paste above the center of the wrapper. Dip a finger in egg white and dab it on the top corner. Fold top corner over to just cover the shrimp paste. Dab egg white on the fold; overlap left and right corners in the center. Repeat with remaining wrappers and shrimp.\nBring chicken broth and water to a boil in a large pot. Add wontons. Cook over medium-high heat until wontons float to the surface, about 5 minutes.\nDivide noodles among serving bowls; sprinkle scallions on top. Divide wontons among bowls. Cover with hot broth.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}