{
    "id": 233726,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 pounds ripe strawberries, hulled and halved",
        "1/3 cup white sugar, or to taste",
        "1 cup water",
        "1/2 teaspoon lemon juice (optional)",
        "1/4 teaspoon balsamic vinegar (optional)",
        "1 tiny pinch salt"
    ],
    "nut": [
        "Calories > 69 kcal",
        "Carbs > 17.1 g",
        "Cholesterol > 0 mg",
        "Fat > 0.3 g",
        "Protein > 0.8 g",
        "Sodium > 26 mg"
    ],
    "n": "Fresh Strawberry Granita",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"You can make and serve this gorgeous Italian frozen iced dessert anytime, but it's really best enjoyed during the summer months. Not only is it cold and delicious, but it forces you to stick your hot, sweaty face in the freezer four or five times to stir. The technique of using a fork several times to mix the freezing granita results in perfect icy crystals.\"",
    "ins": "Rinse strawberries with cold water; let drain. Transfer berries to a blender and add sugar, water, lemon juice, balsamic vinegar, and salt.\nPulse several times to get the mixture moving, then blend until smooth, about 1 minute. Pour into a large baking dish. Puree should only be about 3/8 inch deep in the dish.\nPlace dish uncovered in the freezer until mixture barely begins to freeze around the edges, about 45 minutes. Mixture will still be slushy in the center.\nLightly stir the crystals from the edge of the granita mixture into the center, using a fork, and mix thoroughly. Close freezer and chill until granita is nearly frozen, 30 to 40 more minutes. Mix lightly with a fork as before, scraping the crystals loose. Repeat freezing and stirring with the fork 3 to 4 times until the granita is light, crystals are separate, and granita looks dry and fluffy.\nPortion granita into small serving bowls to serve.",
    "pt": "10 m",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}