{
    "id": 233794,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 slices bacon, sliced crosswise into 1/2-inch pieces",
        "1 onion, sliced lengthwise",
        "3 cloves garlic, minced",
        "1/4 cup tomato sauce",
        "2 pounds fresh green beans, trimmed",
        "3 cups chicken broth",
        "salt and ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste"
    ],
    "nut": [
        "Calories > 124 kcal",
        "Carbs > 16 g",
        "Cholesterol > 13 mg",
        "Fat > 4.3 g",
        "Protein > 7.3 g",
        "Sodium > 782 mg"
    ],
    "n": "Slow-Cooked Green Beans",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"Why take something that normally takes 5 minutes to cook and cook it for 2 hours? Because it produces one of the most delicious things you'll ever taste. There's going to be a lot of juice, and that's what you dip your corn bread into.\"",
    "ins": "Place saucepan over medium heat; cook and stir bacon in the hot pan until almost crisp, about 6 minutes. Add onion; cook until browned bits of food on the bottom of the pan have dissolved in the onion's juices and onion is soft and golden brown, about 5 minutes. Stir in garlic and tomato sauce. Cook until garlic has softened, about 1 more minute.\nPlace green beans into a skillet and pour in chicken broth. Raise heat to high, add salt, black pepper, and cayenne pepper to beans, and bring to a simmer. Beans will begin to soften. Turn heat to medium-low and simmer for 1 1/2 hours. Stir occasionally. Add more broth or water if mixture seems dry.\nAdjust levels of salt, black pepper, and cayenne pepper to taste. Cook until beans are soft and tender, about 30 more minutes. Transfer beans and some of the pan juices to a deep serving platter.",
    "pt": "15 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "4482741.jpg",
    "o": "4482741.jpg,4373518.jpg,3910286.jpg,3522825.jpg,3430779.jpg,3338433.jpg",
    "st": "allrecipes"
}