{
    "id": 233710,
    "old_rating": "3.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups crispy corn cereal squares (such as Corn ChexÂ®)",
        "2 cups crispy wheat cereal squares (such as Wheat ChexÂ®)",
        "2 cups crispy rice cereal squares (such as Rice ChexÂ®)",
        "1 cup cheese-flavored crackers (such as Cheez-ItÂ®)",
        "1 cup mini pretzels",
        "1/4 cup melted butter",
        "2 tablespoons barbeque sauce",
        "2 tablespoons Worcestershire sauce",
        "1 teaspoon onion powder",
        "1 teaspoon garlic powder",
        "1/2 teaspoon hickory bacon-flavored salt"
    ],
    "nut": [
        "Calories > 102 kcal",
        "Carbs > 14.3 g",
        "Cholesterol > 8 mg",
        "Fat > 4.7 g",
        "Protein > 1.9 g",
        "Sodium > 244 mg"
    ],
    "n": "Slow Cooker Bar-B-Q Party Mix",
    "a": "Cheryl King",
    "r": "0",
    "s": 16,
    "des": "\"When you're planning a party, and your oven is going to be full, try this party mix in the slow cooker. Tastes as good but doesn't take up oven space!\n\n You may make a larger batch, but cooking time will need to be increased.\n\n If you like your bar-b-que party mix more bar-b-q-y, try increasing the liquid by 1/2 or double. Keep in mind that doing this may increase cooking time. Serve immediately or store in air tight containers.\"",
    "ins": "Mix corn cereal, wheat cereal, rice cereal, cheese-flavored crackers, and pretzels in a gallon-sized resealable bag; seal and toss to mix.\nStir butter, barbeque sauce, Worcestershire sauce, onion powder, garlic powder, and salt together in a bowl. Pour half the butter mixture into the cereal mixture; seal bag and shake until well combined. Pour remaining liquid mixture into cereal mixture; seal bag and shake until cereal mixture is well coated. Pour coated cereal mixture into the slow cooker.\nCook on Low, stirring every 15 minutes, for 30 minutes. Turn temperature to High and cook for 15 minutes. Stir and cook uncovered until coating has cooked into cereal mixture, 20 to 25 more minutes. Spread party mixture onto a baking sheet until cooled and dried.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "2413410.jpg",
    "o": "",
    "st": "allrecipes"
}