{
    "id": 233785,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Non-stick cooking spray",
        "1 (3 pound) ButterballÂ® Boneless Breast of Turkey Roast, thawed",
        "2 cloves garlic, peeled, sliced",
        "1 tablespoon canola oil",
        "1 tablespoon ground cumin",
        "2 teaspoons salt",
        "1 teaspoon coarsely ground black pepper",
        "2 loaves Cuban, French or Italian bread (15 inches long)",
        "1/4 cup honey mustard",
        "1/2 pound smoked ham",
        "1/2 pound sliced Swiss cheese",
        "12 sandwich-style dill pickle slices"
    ],
    "nut": [
        "Calories > 1066 kcal",
        "Carbs > 95.1 g",
        "Cholesterol > 202 mg",
        "Fat > 34.4 g",
        "Protein > 91.6 g",
        "Sodium > 2712 mg"
    ],
    "n": "Grilled Turkey Cuban Sandwiches",
    "a": "Butterball",
    "r": "0",
    "s": 6,
    "des": "\"Grilled turkey breast, ham, cheese and pickles in a panini-style sandwich.\"",
    "ins": "Spray cold grate of outdoor gas grill with cooking spray. Prepare grill for medium indirect heat.\nRemove turkey from package. Dry with paper towels. Discard gravy packet or refrigerate for another use (within 2 - 3 days). Lift string netting and shift position on roast for easier removal after cooking. Cut small slits, at least 1 inch apart, over entire surface of turkey. Insert 1 garlic slice into each slit. Brush turkey with oil.\nCombine cumin, salt and pepper. Sprinkle over turkey.\nPlace turkey on grill grate over drip pan. Cover grill with lid. Grill 1 1/4 to 1-3/4 hours, or until meat thermometer reaches 170 degrees F when inserted into center of roast. Remove from grill. Let stand 10 minutes.\nRemove string netting. Cut half of the turkey into six 1/8-inch-thick slices. Set aside. Refrigerate unsliced turkey for another use.\nCut each bread loaf lengthwise in half. Then, cut each into 3 pieces (for 6 sandwiches). Spread the bottom half of each section with 2 teaspoons mustard. Top with the sliced turkey, ham, cheese and pickles. Cover with tops of bread loaves. Press sandwiches with hands to flatten. Tightly wrap individually in aluminum foil.\nPlace wrapped sandwiches on grill grate. Top each with heavy iron skillet or brick. Grill 3 to 5 minutes on each side, or until heated through.\nServe sandwiches warm, wrapped in aluminum foil.",
    "pt": "15 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "1034809.jpg",
    "o": "1054720.jpg,1054676.jpg,1049259.jpg,1046857.jpg,1046840.jpg,1045166.jpg",
    "st": "allrecipes"
}