{
    "id": 233864,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (4.5 pound) bison brisket",
        "1 1/2 cups beef broth",
        "1/4 cup Worcestershire sauce",
        "3 tablespoons cider vinegar",
        "4 teaspoons chili powder",
        "1/4 teaspoon cayenne pepper",
        "3 cloves garlic, minced",
        "1/2 cup bottled barbecue sauce",
        "2 (1.9 ounce) packages baked miniature phyllo dough shells",
        "1/2 cup shredded Cheddar cheese",
        "Sour cream",
        "Chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 119 kcal",
        "Carbs > 6.4 g",
        "Cholesterol > 20 mg",
        "Fat > 3.5 g",
        "Protein > 13.9 g",
        "Sodium > 807 mg"
    ],
    "n": "BBQ Bison Phyllo Bites",
    "a": "The Bison Council",
    "r": "0",
    "s": 30,
    "des": "\"Tender, BBQ-spiced shredded bison brisket is baked in mini phyllo shells for these crowd-pleasing appetizers.\"",
    "ins": "Cut bison brisket into 2-inch pieces. Place bison brisket pieces in a 4- to 5-quart slow cooker. Combine broth, Worcestershire sauce, vinegar, chili powder, cayenne pepper, and garlic in a medium bowl. Pour over bison pieces in slow cooker. Cover and cook on low for 12 hours. Remove bison brisket pieces from cooker and place in large bowl; discard cooking juices. Use two forks to shred bison pieces. Reserve 2 cups of the shredded bison brisket in the bowl. Package the remaining shredded bison brisket in 2-cup portions in airtight containers. Chill for up to 3 days or freeze for up to 3 months.*\nPreheat oven to 375 degrees F. Arrange phyllo dough shells in a 15x10x1-inch baking pan. Stir barbecue sauce into the reserved 2 cups shredded bison in the bowl. Divide shredded bison evenly among phyllo shells. Top evenly with shredded cheese.\nBake, uncovered, for 10 minutes or until heated through. Top with sour cream and cilantro.",
    "pt": "40 m",
    "ct": "12 h ",
    "tt": "12 h ",
    "i": "1037645.jpg",
    "o": "",
    "st": "allrecipes"
}