{
    "id": 233884,
    "old_rating": "4.85714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound bison flank steak",
        "1 1/2 teaspoons fajita seasoning",
        "2 tablespoons vegetable oil",
        "2 cloves garlic, minced",
        "1 fresh jalapeno pepper, seeded and chopped",
        "1 large onion, thinly sliced",
        "1 large green bell pepper, thinly sliced",
        "1 large red or yellow bell pepper, thinly sliced",
        "6 (8 inch) flour tortillas, warmed",
        "Salsa",
        "Sour cream",
        "Lime wedges",
        "Guacamole Salad:",
        "2 Roma tomatoes, seeded and chopped",
        "3 tablespoons sliced green onions",
        "1 fresh jalapeno pepper, seeded and chopped",
        "2 cloves garlic, minced",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "2 large ripe avocados, halved, seeded, peeled, and coarsely mashed",
        "Shredded romaine lettuce"
    ],
    "nut": [
        "Calories > 456 kcal",
        "Carbs > 43.9 g",
        "Cholesterol > 39 mg",
        "Fat > 23.5 g",
        "Protein > 20.9 g",
        "Sodium > 518 mg"
    ],
    "n": "Bison Fajitas with Guacamole Salad",
    "a": "The Bison Council",
    "r": "0",
    "s": 6,
    "des": "\"Strips of bison flank steak are quickly stir-fried with bell peppers, onion, and jalapeno and served hot on tortillas with salsa, sour cream, and guacamole.\"",
    "ins": "If desired, partially freeze bison flank steak for easier slicing (about 30 minutes). Thinly slice across the grain into bite-size strips. Sprinkle sliced bison flank steak with 1 teaspoon of the fajita seasoning. Cover and chill for 30 minutes.\nHeat 1 tablespoon of the oil over medium-high heat in a large skillet. Cook garlic and the 1 jalapeno pepper in the hot oil for 2 minutes. Add onion. Cook and stir for 6 to 8 minutes or until onions are tender and begin to caramelize. Remove onion mixture to a medium bowl; cover and keep warm. Add bell peppers and remaining 1/2 teaspoon of fajita seasoning to skillet. Cook and stir for 6 to 8 minutes or until peppers are tender. Add peppers to onion mixture; cover and keep warm.\nAdd the remaining 1 tablespoon oil to the skillet. Add 1/2 of the bison flank steak strips to skillet. Cook and stir for 1 to 2 minutes or until bison flank steak is browned. Remove from skillet and cook remaining bison flank steak.\nServe bison flank steak and vegetables in tortillas topped with salsa and sour cream. Serve with lime wedges and Guacamole Salad\nGuacamole Salad: Combine tomatoes, green onions, the 1 jalapeno pepper, the 2 cloves garlic, the salt, and pepper in a medium bowl. Gently stir in avocado. Serve on shredded romaine.",
    "pt": "30 m",
    "ct": "12 m",
    "tt": "2 h ",
    "i": "1037656.jpg",
    "o": "1050577.jpg,1046845.jpg,1045843.jpg,1045028.jpg,1044963.jpg,1042173.jpg",
    "st": "allrecipes"
}