{
    "id": 233824,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package macaroni",
        "1 (8 ounce) package feta cheese, cut into small cubes",
        "8 ounces halloumi cheese, cut into cubes",
        "2 tablespoons sunflower seed oil",
        "1 onion, chopped",
        "1 clove garlic, chopped",
        "4 tomatoes, peeled and shredded",
        "1 teaspoon dried mint",
        "ground black pepper to taste",
        "1 (8 ounce) package cream cheese, softened",
        "1 cup grated Edam cheese"
    ],
    "nut": [
        "Calories > 786 kcal",
        "Carbs > 69.1 g",
        "Cholesterol > 120 mg",
        "Fat > 42.4 g",
        "Protein > 33.1 g",
        "Sodium > 1140 mg"
    ],
    "n": "Macaroni with Four Cheeses",
    "a": "Anthi Cyprus",
    "r": "0",
    "s": 6,
    "des": "\"This is a great recipe for cheese and/or macaroni lovers! It's really easy to make and it's really yummy. My children love it! You can add salami, but then leave out the garlic.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a large baking dish.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally, until cooked through but firm to the bite, 8 minutes; drain. Pour macaroni into prepared baking dish. Stir feta cheese and halloumi cheese into the macaroni.\nHeat oil in a large skillet over medium heat. Cook and stir onion and garlic in hot oil until tender, about 5 minutes. Add tomatoes, mint, and ground black pepper; continue to cook and stir until the tomato softens, about 3 minutes. Melt the cream cheese into the tomato mixture; pour over macaroni mixture and stir to coat. Sprinkle Edam cheese evenly over the macaroni mixture.\nBake in the preheated oven until the top is bubbling, about 20 minutes.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "1051631.jpg",
    "o": "",
    "st": "allrecipes"
}