{
    "id": 233855,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups cooked brown rice, divided",
        "2 (10.75 ounce) cans condensed tomato soup, divided",
        "1 zucchini, sliced",
        "1 yellow squash, sliced",
        "7 baby portobello mushrooms, sliced - or more to taste",
        "3/4 cup mozzarella cheese, shredded",
        "3/4 cup Cheddar cheese, shredded",
        "1 cup chopped broccoli",
        "1/2 cup sliced white onion",
        "1/2 red bell pepper, sliced",
        "1/2 green bell pepper, sliced",
        "1 carrot, shredded",
        "3 cloves garlic, minced",
        "1/2 teaspoon dried parsley",
        "1/2 teaspoon dried oregano",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 284 kcal",
        "Carbs > 39.6 g",
        "Cholesterol > 24 mg",
        "Fat > 9.5 g",
        "Protein > 13.4 g",
        "Sodium > 760 mg"
    ],
    "n": "Brown Rice Vegetable Loaf",
    "a": "Jamie Justice Yost",
    "r": "0",
    "s": 6,
    "des": "\"I came up with this recipe in an effort to make some food stretch until payday. Using random vegetables I had in the fridge, plus some leftover rice, I came up with this casserole and was pleasantly surprised with the results. You could easily add chicken or leave as-is for a great vegetarian dinner!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nSpread 1/2 of the rice into the bottom of a large baking dish. Pour about 1/2 can tomato soup over rice and top with zucchini, yellow squash, and mushrooms. Sprinkle 1/2 cup mozzarella cheese and 1/2 cup Cheddar cheese over vegetables. Pour remaining 1/2 can soup over cheese.\nSpread remaining rice into baking dish. Add broccoli, onion, red bell pepper, green bell pepper, carrot, garlic, parsley, and oregano. Season with salt and pepper. Pour remaining 1 can soup over vegetables and top with remaining cheese.\nBake in the preheated oven until tomato soup is bubbly and cheese is melted, 25 to 30 minutes. Let stand about 5 minutes before serving.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}