{
    "id": 233840,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 Pink Lady apple, cored and finely chopped",
        "1 cup low-sodium chicken broth",
        "1 cup dried tart cherries",
        "2/3 cup chopped English walnuts",
        "1 (6 ounce) package herb-seasoned dry bread stuffing mix",
        "1/2 cup finely diced celery",
        "1/2 cup finely diced onion",
        "3 tablespoons melted butter",
        "6 3/4-inch thick boneless pork loin chops",
        "1 tablespoon olive oil",
        "1/2 teaspoon salt, or to taste",
        "1/4 teaspoon ground black pepper (optional)"
    ],
    "nut": [
        "Calories > 590 kcal",
        "Carbs > 51 g",
        "Cholesterol > 86 mg",
        "Fat > 28.2 g",
        "Protein > 35.5 g",
        "Sodium > 759 mg"
    ],
    "n": "Pork Loin Chops with Cherry-Apple Stuffing",
    "a": "Bibi",
    "r": "0",
    "s": 6,
    "des": "\"Pork and tart dried cherries make a great meal for a cool fall evening. Prepare your salad or other side while this casserole finishes in the oven.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Butter a 2 1/2-quart casserole dish.\nMix apple, chicken broth, cherries, walnuts, stuffing mix, celery, onion, and melted butter together in a large bowl; transfer to the prepared casserole dish.\nSeason pork chops with salt and black pepper.\nHeat olive oil in a large, non-stick skillet over medium-high heat. Cook pork chops in hot oil until browned on one side, 2 to 3 minutes. Arrange the chops atop the stuffing mixture with the browned side facing up; press into the stuffing. Cover dish with aluminum foil.\nBake in preheated oven for 25 minutes. Remove aluminum foil and continue baking until pork chops are cooked through, about 10 to 15 minutes more. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "1035303.jpg",
    "o": "",
    "st": "allrecipes"
}