{
    "id": 23393,
    "old_rating": "3.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "2 large onion, chopped",
        "3 cloves garlic, minced",
        "2 pounds lean ground beef",
        "1 teaspoon dried chervil",
        "2 teaspoons dried basil",
        "2 teaspoons dried oregano",
        "2 teaspoons Italian seasoning",
        "1 teaspoon crushed red pepper flakes",
        "1 tablespoon seasoning salt",
        "salt",
        "1 tablespoon soy sauce",
        "1 tablespoon red chile sauce",
        "1 tablespoon Worcestershire sauce",
        "1 (28 ounce) can whole peeled tomatoes",
        "3 (29 ounce) cans tomato sauce",
        "22 ounces tomato paste",
        "2 (6 ounce) cans mushrooms, drained",
        "1 (4 ounce) can sliced black olives, drained",
        "3 bay leaves",
        "1 teaspoon instant coffee granules (optional)"
    ],
    "nut": [
        "Calories > 154 kcal",
        "Carbs > 14.6 g",
        "Cholesterol > 23 mg",
        "Fat > 7.3 g",
        "Protein > 9.9 g",
        "Sodium > 1092 mg"
    ],
    "n": "Vibration Spaghetti Sauce",
    "a": "Marilyn",
    "r": "0",
    "s": 24,
    "des": "\"An old friend christened this sauce in the sixties because back then I just added what felt right.  I still do, but after all these years, it's pretty much the same ingredients every time!  Be sure to remove bay leaves before serving. This sauce keeps for at least 2 weeks in the fridge. It's a great sauce for pasta, lasagna and pizza. If sauce tastes too acid from the tomatoes, a little instant coffee will tone down the acid, however, BE VERY CAREFUL. Too much of either will kill the taste of the sauce completely!\"",
    "ins": "In a large saucepan, saute onion and garlic in oil until soft. Add ground beef and saute until pink colour is gone, stirring to break up large pieces. While beef is browning, add chervil, basil, oregano, Italian seasoning, red pepper, seasoning salt, salt, soy sauce, red chile sauce and Worcestershire sauce.\nAfter beef has browned, add canned tomatoes; simmer for 10 minutes. Spoon off any excess fat. Add tomato sauce and stir until well mixed. Spoon in tomato paste and stir gently until paste is incorporated. Add mushrooms and olives. Poke bay leaves into sauce.\nSimmer for at least two hours, stirring occasionally to be sure it's not sticking to the bottom. Three or four hours of simmering is even better.",
    "pt": "30 m",
    "ct": "3 h",
    "tt": "3 h ",
    "i": "540891.jpg",
    "o": "",
    "st": "allrecipes"
}