{
    "id": 233969,
    "old_rating": "4.15789",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (5 ounce) skinless, boneless chicken breast halves, pounded 1/4-inch thick",
        "salt and ground black pepper to taste",
        "3 tablespoons olive oil",
        "2 tablespoons butter",
        "6 fluid ounces white wine",
        "1 cup chicken broth",
        "8 teaspoons apple juice",
        "8 teaspoons lemon juice",
        "1/4 cup grated Parmesan cheese",
        "1 tablespoon chopped fresh parsley",
        "1/4 cup heavy whipping cream",
        "1 (14 ounce) can artichoke hearts, drained and chopped"
    ],
    "nut": [
        "Calories > 473 kcal",
        "Carbs > 11.2 g",
        "Cholesterol > 128 mg",
        "Fat > 27.4 g",
        "Protein > 36.5 g",
        "Sodium > 806 mg"
    ],
    "n": "Chicken with Lemon Artichoke Sauce",
    "a": "shannonferger",
    "r": "0",
    "s": 4,
    "des": "\"This was a quick and easy dish with a yummy sauce that is easily adapted based on what you may have in the kitchen. The apple juice helps to cut some of the acidity of the lemon so there is still a nice tart bite to the sauce, but it's not overpowering. The addition of artichokes made for a nice, light sauce that complemented the chicken nicely!\"",
    "ins": "Season chicken breast halves with salt and pepper.\nHeat oil and butter in a large skillet over medium-high heat. Fry chicken breasts in the hot skillet in batches until chicken is no longer pink in the center and juices run clear, about 5 minutes per side. Remove chicken from the skillet and keep warm.\nStir white wine into the skillet, scraping any browned bits off the bottom. Whisk chicken broth, apple juice, lemon juice, Parmesan cheese, and parsley in wine; simmer until liquid is reduced by half, about 10 minutes. Add heavy cream and whisk until sauce is smooth. Stir artichoke hearts into cream sauce; continue to cook until heated through, about 5 minutes. Serve sauce over chicken.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "1038881.jpg",
    "o": "",
    "st": "allrecipes"
}