{
    "id": 233906,
    "old_rating": "3.9",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "2 cloves garlic cloves, minced",
        "1/4 cup all-purpose flour",
        "salt and ground black pepper to taste",
        "3 pounds skinless, boneless chicken breast, cut into 2-inch cubes",
        "12 ounces sliced white mushrooms",
        "1 cup Marsala wine",
        "2 tablespoons water (optional)",
        "1 tablespoon cornstarch (optional)",
        "1 tablespoon chopped fresh parsley for garnish"
    ],
    "nut": [
        "Calories > 374 kcal",
        "Carbs > 13 g",
        "Cholesterol > 132 mg",
        "Fat > 5.3 g",
        "Protein > 54.9 g",
        "Sodium > 155 mg"
    ],
    "n": "Slow Cooker Chicken Marsala",
    "a": "TinaJWag",
    "r": "0",
    "s": 6,
    "des": "\"I use boneless chicken breast for this healthy, flavorful dish. Serve over rice or potatoes to soak up all the delicious sauce! I like to serve this with rice and sauteed spinach. If you're cooking for two, you might be tempted to halve the recipe, but don't; you'll be happy to have leftovers!\"",
    "ins": "Stir olive oil and garlic into the bowl of a slow cooker.\nMix flour, salt, and pepper in a bowl. Pour flour mixture into a large resealable plastic bag; add chicken to bag, seal, and shake to coat chicken with flour mixture. Pour coated chicken and sliced mushrooms into slow cooker.\nHeat Marsala wine in a small frying pan over medium-high heat until reduced, 2 to 3 minutes; pour into slow cooker and cover.\nCook in slow cooker set to Low until sauce thickens and chicken is cooked through, 4 to 5 hours. If sauce is too thin, mix water and cornstarch together in a small bowl and pour slowly into chicken mixture. Cook in slow cooker set to High until thickened, 15 minutes. Adjust seasonings to taste, garnish with parsley, and serve.",
    "pt": "15 m",
    "ct": "4 h",
    "tt": "4 h ",
    "i": "4423579.jpg",
    "o": "",
    "st": "allrecipes"
}