{
    "id": 233951,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup all-purpose flour",
        "1 cup white sugar",
        "1/2 cup unsweetened cocoa powder",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 cup milk",
        "1/4 cup vegetable oil",
        "1 egg",
        "1/2 teaspoon vanilla extract",
        "1/2 cup boiling water",
        "14 miniature peanut butter cup candies",
        "4 egg whites",
        "1 cup white sugar",
        "1 tablespoon peanut butter"
    ],
    "nut": [
        "Calories > 293 kcal",
        "Carbs > 47.3 g",
        "Cholesterol > 13 mg",
        "Fat > 10.7 g",
        "Protein > 5.3 g",
        "Sodium > 246 mg"
    ],
    "n": "Peanut Butter Cup Chocolate Cupcakes with Toasted Peanut Butter Meringue Frosting",
    "a": "Life Tastes Good",
    "r": "0",
    "s": 14,
    "des": "\"Moist and delicious chocolate cupcakes with a peanut butter cup surprise inside.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C).  Line 14 muffin cups with paper muffin liners.\nWhisk flour, 1 cup sugar, cocoa powder, baking powder, baking soda, and salt together in a large bowl. Add milk, vegetable oil, 1 egg, and vanilla extract; mix using an electric mixer on low speed until just combined. Increase speed to medium and mix well.\nReduce mixer speed to low and slowly pour boiling water into flour mixture. Increase speed to medium and beat for 1 minute.\nFill each muffin cup halfway and place a peanut butter cup in the center of each.\nBake in preheated oven until golden and tops spring back when lightly pressed, about 20 minutes. Remove from oven and cool in pan for 5 to 10 minutes. Cool completely on a cooling rack before frosting.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nWhisk egg whites and sugar together in a bowl until just combined. Pour egg mixture into a small saucepan and heat over medium heat until sugar is dissolved. Return egg mixture to bowl. Whisk egg mixture on high speed until still peaks form.\nPlace peanut butter in a microwave-safe bowl. Heat on high at 15-second intervals, stirring in between, until peanut butter is thin and creamy. Gently fold melted peanut butter into egg whites. Transfer peanut butter frosting to a piping bag.\nPipe frosting onto cooled cupcakes.\nToast cupcakes under preheated broiler until lightly browned, about 1 minute.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "1036913.jpg",
    "o": "",
    "st": "allrecipes"
}