{
    "id": 233931,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups warm water (110 to 115 degrees F/43 to 46 degrees C)",
        "6 tablespoons honey",
        "1 1/2 tablespoons active dry yeast",
        "6 cups bread flour, divided, or more as needed",
        "1/4 cup olive oil",
        "4 eggs",
        "3 tablespoons vital wheat gluten",
        "2 tablespoons butter, softened",
        "1 tablespoon salt"
    ],
    "nut": [
        "Calories > 186 kcal",
        "Carbs > 29.9 g",
        "Cholesterol > 34 mg",
        "Fat > 4.6 g",
        "Protein > 6.1 g",
        "Sodium > 311 mg"
    ],
    "n": "Golden Egg Loaves (or Braids)",
    "a": "Cookin Up A Storm",
    "r": "0",
    "s": 24,
    "des": "\"This is a rich and soft loaf suitable for sandwiches or slicing for use in a bread pudding, overnight egg bake, or French toast. It is equally good fresh out of the oven with butter and jam.\"",
    "ins": "Combine water, honey, and yeast in a stand mixer fitted with the dough hook. Let sit until mixture becomes foamy, about 10 minutes.\nPour 3 cups flour, olive oil, eggs, wheat gluten, and butter into the yeast mixture; mix on speed 2 (or low speed) in the stand mixer until flour mixture is incorporated, 2 to 3 minutes. Add salt and 3 cups flour and mix on speed 2 until flour is incorporated into the dough. If dough is pulling away from the sides of the bowl, continue mixing, 5 to 7 minutes.  If dough is still sticky, add 1/4 cup flour at a time and knead for 2 minutes after each addition until dough pulls away from the sides of the bowl; mix for 5 to 7 minutes.\nGrease a large bowl.\nTransfer dough to greased bowl and cover with a damp towel. Set aside in a warm area of the kitchen until dough has doubled in size, 60 to 90 minutes.\nPunch down dough and divide into 2 loaves. Place each dough half into a 9x5-inch loaf pan or on a baking sheet. Let rise until doubled in size, about 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven until golden brown and an instant-read thermometer registers an internal temperature of 200 degrees F (93 degrees C), 25 to 30 minutes.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "2 h ",
    "i": "1124603.jpg",
    "o": "",
    "st": "allrecipes"
}