{
    "id": 233975,
    "old_rating": "4.84524",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 slices bacon, cut crosswise into 1/2-inch pieces",
        "2 ears white corn",
        "1/4 cup chopped green onions - white and light green parts separated from green tops",
        "1/4 cup diced red bell pepper",
        "salt and ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "2 teaspoons olive oil",
        "1 tablespoon rice vinegar, or more to taste",
        "1/2 teaspoon vegetable oil",
        "2 (8 ounce) center-cut boneless salmon fillets",
        "1 pinch cayenne pepper, or to taste",
        "1 cup fresh spinach leaves (optional)"
    ],
    "nut": [
        "Calories > 605 kcal",
        "Carbs > 20.2 g",
        "Cholesterol > 141 mg",
        "Fat > 33.1 g",
        "Protein > 56.6 g",
        "Sodium > 755 mg"
    ],
    "n": "Grilled Salmon with Bacon and Corn Relish",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"You are really going to love this exciting and vibrant new way to use salmon. It's dressed up with an easy and summery relish. Did I mention there will be bacon? Oh, yeah.\"",
    "ins": "Preheat an outdoor grill (preferably charcoal) for high heat and lightly oil the grate.\nPlace bacon in a skillet over medium heat and cook until browned and crisp, 8 to 10 minutes.\nCut kernels from corn ears into a large bowl using a sharp knife held at a 45-degree angle. Scrape cobs with the back of the knife into the bowl to get the juices.\nStir white and light green parts of green onions into bacon and add red bell pepper; cook and stir until vegetables just start to become tender, about 2 minutes. Stir corn into bacon mixture and let corn just warm through. Season with salt, black pepper, cayenne pepper, a few chopped dark green onion tops, olive oil, and rice vinegar. Turn off heat under relish.\nSpread vegetable oil onto both sides of salmon fillets and season fish with salt, black pepper, and cayenne pepper.\nCook on preheated grill until fish shows good grill marks, the flesh flakes easily, and fish is still slightly pink in the center, about 5 minutes per side. A crack that opens up in the salmon flesh as you cook will let you see how done the salmon is in the middle.\nDivide spinach leaves onto 2 plates and top each with a salmon fillet and half the bacon relish. Sprinkle on a few green onion tops for garnish.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "4511441.jpg",
    "o": "4511441.jpg,4503210.jpg,2309186.jpg,2299437.jpg,2290123.jpg,2288055.jpg",
    "st": "allrecipes"
}