{
    "id": 233927,
    "old_rating": "4.76",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 1/4 cups all-purpose flour, divided",
        "1 (.25 ounce) package active dry yeast",
        "1 1/2 teaspoons white sugar",
        "1 1/2 teaspoons salt",
        "1 1/2 cups warm water, or as needed",
        "2 tablespoons melted butter",
        "2 cups oil for frying, or as needed"
    ],
    "nut": [
        "Calories > 212 kcal",
        "Carbs > 31.9 g",
        "Cholesterol > 6 mg",
        "Fat > 7.1 g",
        "Protein > 4.5 g",
        "Sodium > 367 mg"
    ],
    "n": "Family Fry Bread",
    "a": "thedailygourmet",
    "r": "0",
    "s": 10,
    "des": "\"Each tribe has their own recipe for fry bread. This is a recipe that I came across as a teenage girl while staying at my great-grandma's house. Grandma was Native American, and I found that this recipe creates a delicious fry bread for Indian tacos. Fry bread is commonly used for making Indian tacos, but is also good with honey butter or cinnamon-sugar and butter for a dessert. Warm milk can be substituted for the water.\"",
    "ins": "Whisk 3 cups flour, yeast, sugar, and salt together in a bowl.\nWhisk water and butter together in a separate bowl; pour into flour mixture and stir until mixture comes together to form a ball and is slightly sticky and elastic. Cover bowl with plastic wrap. Cover bowl with a towel and let rise in a warm place until doubled in volume, about 1 hour.\nPunch down dough and turn onto a lightly floured surface. Knead in 1/4 cup flour, if necessary. Shape into 10 balls.\nHeat oil in a deep-fryer or large cast iron skillet to 350 degrees F (175 degrees C).\nRoll each dough ball out on a lightly floured surface into an 8-inch round.\nPlace each round into the hot oil and fry until golden brown, 1 to 2 minutes per side. Remove fry bread to a baking sheet lined with paper towels. Repeat with remaining dough rounds.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "2 h ",
    "i": "2467596.jpg",
    "o": "4191447.jpg,3683722.jpg,3187343.jpg,3187312.jpg,3187311.jpg,2896105.jpg",
    "st": "allrecipes"
}