{
    "id": 234085,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "3/4 cup blue cheese salad dressing, divided",
        "1/2 cup cayenne pepper sauce (such as Frank'sÂ® RedHotÂ®)",
        "2 tablespoons butter, melted",
        "2 cups shredded cooked chicken",
        "1 (13 ounce) package restaurant-style white corn tortilla chips (such as TostitosÂ®)",
        "1 large tomato, seeded and chopped",
        "1/2 cup sliced black olives",
        "1/3 cup diced red onion",
        "1/4 cup pickled jalapeno pepper slices",
        "4 ounces precooked bacon, crumbled",
        "1 1/2 cups shredded Mexican cheese blend",
        "1 cup shredded Monterey Jack cheese",
        "1 tablespoon chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 672 kcal",
        "Carbs > 35.6 g",
        "Cholesterol > 90 mg",
        "Fat > 47.8 g",
        "Protein > 28 g",
        "Sodium > 1531 mg"
    ],
    "n": "Kickin' Buffalo Chicken Nachos",
    "a": "bakingmecrazy",
    "r": "0",
    "s": 8,
    "des": "\"These hearty, dude-pleasing nachos are bursting with flavor. The combination of the crunchy tortilla chips with the spicy buffalo chicken and the cool blue cheese dressing make the perfect accompaniment to a frosty cold beverage (or two!) and are great any time of day. The recipe serves 4, but sharing is optional!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a large, rimmed baking sheet with aluminum foil and spray with cooking spray.\nMix about 1/4 cup blue cheese dressing, cayenne pepper sauce, and butter in a bowl until well blended. Add chicken; toss to coat.\nSpread tortilla chips evenly over prepared baking sheet. Sprinkle tomato, olives, onion, and jalapeno peppers over chips. Spread chicken mixture over vegetables and top with crumbled bacon.\nCombine Mexican cheese blend and Monterey Jack cheese in a bowl; sprinkle evenly over chicken and tortilla chip mixture.\nBake in the preheated oven until cheese is melted and lightly browned, 10 to 15 minutes. Drizzle with remaining 1/2 cup blue cheese dressing and top with cilantro.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}