{
    "id": 234021,
    "old_rating": "4.61538",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup ditalini pasta",
        "3 tablespoons olive oil",
        "1 onion, diced",
        "4 slices bacon, diced",
        "2 cloves garlic, minced",
        "1 quart chicken broth",
        "1 (15 ounce) can Romano beans, drained",
        "1/4 cup tomato paste",
        "1 pinch crushed dried chile pepper",
        "2 tablespoons chopped fresh parsley",
        "salt and ground black pepper to taste",
        "4 teaspoons grated Romano cheese, or to taste"
    ],
    "nut": [
        "Calories > 381 kcal",
        "Carbs > 44.3 g",
        "Cholesterol > 17 mg",
        "Fat > 15.9 g",
        "Protein > 15.8 g",
        "Sodium > 1680 mg"
    ],
    "n": "Pasta e Fagioli ala Weeble",
    "a": "weeble",
    "r": "0",
    "s": 4,
    "des": "\"As a Canadian, growing up in Toronto's Little Italy, this soup was always on someone's stovetop somewhere in the fall and winter months. Pasta, beans, and a thick broth, sprinkled with Parm or Romano, and served with fresh crusty Italian bread - what's not to love? I spent a lot of time, back in the day, in the cucina with my friends and their mothers learning the basics of good Italian food!\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat; stir in the ditalini, and return to a boil. Cook, uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 6 minutes; drain.\nHeat olive oil in a large pot over medium heat; stir in onion and bacon and saute until onions are soft, about 5 minutes. Stir garlic into onion mixture; cook over medium-low heat just until fragrant, about 1 minute.\nStir chicken broth, beans, tomato paste, and chile pepper into onion-bacon mixture; bring to a simmer and cook until fully heated through, about 10 minutes. Stir ditalini and parsley into the soup; season with salt and pepper. Sprinkle each serving with Romano cheese.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "4535456.jpg",
    "o": "",
    "st": "allrecipes"
}