{
    "id": 234012,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 small rutabaga, peeled and cubed",
        "3 cups frozen broccoli, carrots, and cauliflower combination",
        "3 cups leftover mashed potatoes",
        "8 slices bacon",
        "1/4 head cabbage, shredded",
        "1/4 cup finely chopped red bell pepper",
        "1/4 cup finely chopped green bell pepper",
        "1 small yellow onion, finely chopped",
        "1 large egg",
        "1 pinch coarsely ground black pepper"
    ],
    "nut": [
        "Calories > 341 kcal",
        "Carbs > 48.5 g",
        "Cholesterol > 70 mg",
        "Fat > 10.4 g",
        "Protein > 15.6 g",
        "Sodium > 972 mg"
    ],
    "n": "Boxing Day Bubble'n'Squeak",
    "a": "Kelley",
    "r": "0",
    "s": 4,
    "des": "\"A hearty, tasty traditional British dish for leftovers. This Canadian Boxing Day variation is just as tasty and uses up the leftovers from our Canadian/American Christmas dinner. My husband and his family from the UK love this New World twist on their comfort food dish.\"",
    "ins": "Place the rutabaga in a small saucepan with enough water to cover, bring to a boil, and cook until rutabaga is tender when pierced with a fork, about 15 minutes; drain and mash rutabaga.\nBring a pot of water to a boil over high heat; stir frozen vegetables into boiling water. Cook until tender, about 4 minutes; drain and allow to cool slightly. Chop vegetables finely.\nStir together the mashed rutabaga, chopped cooked vegetables, and mashed potatoes in a large bowl; set aside.\nFry bacon in a large skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Reserve bacon fat in the skillet.\nCook and stir cabbage, red pepper, green pepper, and onion in the same skillet with the bacon fat until tender and caramelized, about 10 minutes. Stir cabbage mixture into rutabaga mixture; stir in egg and black pepper.\nIn the same skillet over medium high heat, ladle spoonfuls of the cabbage mixture; fry until golden brown, about 5 minutes. Serve with the cooked bacon.",
    "pt": "10 m",
    "ct": "45 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}