{
    "id": 234025,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons margarine",
        "2 onions, chopped",
        "4 quarts chicken broth",
        "4 pounds boneless, skinless chicken breasts",
        "10 pounds potatoes, peeled and diced",
        "2 tablespoons salt",
        "1 tablespoon ground black pepper"
    ],
    "nut": [
        "Calories > 733 kcal",
        "Carbs > 104.2 g",
        "Cholesterol > 127 mg",
        "Fat > 8.8 g",
        "Protein > 58 g",
        "Sodium > 3826 mg"
    ],
    "n": "Rappie Pie",
    "a": "donelectra59",
    "r": "0",
    "s": 8,
    "des": "\"This is a traditional Canadian dish. The main ingredient is grated potatoes. This was handed down from my family in Nova Scotia. It was always a special treat because originally it was so much work to make but it really was worth waiting for. The traditional method for the grated potatoes was to get a cookie sheet and drive nails through it to create a giant potato grater. After grating (always scraped a knuckle or two), we'd place the mushy potato into a towel and twist it until all the juice was gone. Ouch! Sometimes the towel would rip, shooting the mix everywhere. Now we use our juicing machine.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease a 10x14x2-inch baking pan.\nHeat margarine in a skillet over medium heat; stir in onion. Cook and stir until onion has softened and turned translucent, about 5 minutes. Reduce heat to low and continue to cook and stir until onion is very tender and dark brown, about 40 minutes more.\nBring chicken broth to a boil in a large pot; stir in chicken breasts, reduce heat, and simmer until chicken is no longer pink at the center, about 20 minutes. Remove from heat. Remove chicken breasts to a plate using a slotted spoon; reserve broth.\nJuice potatoes with an electric juicer; place dry potato flesh into a bowl and discard juice. Stir salt and pepper into potatoes; stir in enough reserved broth to make the mixture the consistency of oatmeal. Set remaining broth aside.\nSpread half of potato mixture evenly into the prepared pan. Lay cooked chicken breast evenly over potatoes; scatter caramelized onion evenly over chicken. Spread remaining potato mixture over onions and chicken to cover.\nBake in the preheated oven until golden brown, about 1 hour. Reheat chicken broth; pour over individual servings as desired.",
    "pt": "1 h",
    "ct": "2 h ",
    "tt": "3 h ",
    "i": "4259225.jpg",
    "o": "",
    "st": "allrecipes"
}