{
    "id": 234002,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (14 ounce) package chocolate sandwich cookies (such as OreoÂ®)",
        "1 (8 ounce) package cream cheese, softened",
        "1/2 (7 ounce) jar marshmallow creme",
        "1 (14 ounce) package vanilla almond bark, or as needed",
        "1 tablespoon shortening",
        "lollipop sticks"
    ],
    "nut": [
        "Calories > 172 kcal",
        "Carbs > 20 g",
        "Cholesterol > 11 mg",
        "Fat > 9.8 g",
        "Protein > 2.1 g",
        "Sodium > 100 mg"
    ],
    "n": "To Die For No-Bake Cake Pops",
    "a": "Dee Dee",
    "r": "0",
    "s": 30,
    "des": "\"I made this for the first time for my cookie baskets that we give as holiday gifts. They are so good, my husband sneaked a few out of people's baskets before giving them out. The pops taste like they came out of a very fancy bakery, but better and far less expensive.\"",
    "ins": "Line a sheet pan with parchment paper. The pan must be able to fit in the freezer.\nPlace sandwich cookies into the bowl of a food processor and pulse until they resemble fine breadcrumbs.\nStir crushed cookies, cream cheese, and marshmallow creme together in a bowl. Roll cookie mixture into walnut-sized balls, place them on the prepared pan, and freeze for 5 minutes.\nMelt 1/4 cup bark in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes. Remove cake pops from the freezer.\nDip each lollipop stick into the melted bark, and push a stick halfway through each cake pop. Place on the sheet pan and return cake pops to the freezer for 5 minutes.\nMelt remaining bark in a microwave-safe bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes. Pour coating into a large coffee mug, deep enough to make it easy to immerse the cake pops.\nRemove cake pops from the freezer, and dip each prepared pop into the melted bark, coating completely. Place the pops back onto the sheet pan. Refrigerate until firm, about 10 minutes.",
    "pt": "20 m",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}