{
    "id": 234009,
    "old_rating": "4.84615",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups heavy whipping cream",
        "5 egg yolks",
        "1 1/2 cups milk",
        "2 tablespoons white sugar",
        "1 tablespoon corn syrup (optional)",
        "3/4 cup maple syrup",
        "1/8 teaspoon coarse salt",
        "1/4 teaspoon vanilla extract",
        "Wet Walnuts:",
        "1 1/2 cups walnut halves",
        "1/2 cup maple syrup",
        "1 tablespoon maple syrup",
        "1 pinch salt"
    ],
    "nut": [
        "Calories > 487 kcal",
        "Carbs > 46.1 g",
        "Cholesterol > 193 mg",
        "Fat > 32.5 g",
        "Protein > 6.9 g",
        "Sodium > 77 mg"
    ],
    "n": "Maple Walnut Ice Cream",
    "a": "Kim Tymecki",
    "r": "0",
    "s": 8,
    "des": "\"A Canadian favorite! This sweet ice cream actually stays soft even after a week.\"",
    "ins": "Pour cream into a large bowl and set a mesh strainer over the bowl. Whisk egg yolks together in a separate bowl.\nHeat milk, sugar, and corn syrup together in a saucepan over medium-low heat until milk begins to steam, about 5 minutes. Slowly pour about 1/2 cup heated milk into the egg yolks, whisking constantly. Scrape egg yolk mixture into the saucepan with a heatproof spatula.\nCook and stir milk mixture constantly with the spatula, scraping the bottom of the saucepan often, until mixture thickens and coats the spatula, about 10 minutes. Remove saucepan from heat; pour mixture through the mesh strainer into the cream.\nStir 3/4 cup maple syrup, coarse salt, and vanilla into cream mixture, then place the bowl over a larger bowl of ice water; stir to cool to room temperature. Chill mixture in the refrigerator, about 2 hours.\nPreheat oven to 275 degrees F (135 degrees C). Spread walnuts onto a baking sheet.\nToast walnuts in the preheated oven until they turn golden brown and become fragrant, about 15 minutes. Set nuts aside to cool to room temperature. Chop nuts coarsely.\nHeat the 1/2 cup plus 1 tablespoon maple syrup in a saucepan until it comes to a boil. Stir in walnuts, and return to a boil. Stir nuts for 10 seconds, remove from heat; set aside to cool completely. The nuts will be wet and sticky when cooled.\nRemove cream mixture from the refrigerator, pour into your ice cream maker, and freeze according to manufacturer's instructions. During the last few minutes of churning, stir in wet walnuts.",
    "pt": "30 m",
    "ct": "35 m",
    "tt": "4 h ",
    "i": "1055369.jpg",
    "o": "",
    "st": "allrecipes"
}