{
    "id": 234174,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 3/4-inch-thick slices baguette, cut on a bias",
        "2 cloves garlic, halved",
        "2 tablespoons extra-virgin olive oil",
        "2/3 cup quartered grape tomatoes",
        "1 tablespoon chopped fresh basil, or to taste",
        "1 clove garlic, minced",
        "4 teaspoons extra-virgin olive oil",
        "1 tablespoon balsamic vinegar",
        "salt and ground black pepper to taste",
        "1/4 cup goat cheese",
        "1/4 cup garlic and herb cheese spread (such as BoursinÂ®)",
        "1/4 cup whole-milk ricotta cheese"
    ],
    "nut": [
        "Calories > 145 kcal",
        "Carbs > 9.9 g",
        "Cholesterol > 17 mg",
        "Fat > 10.3 g",
        "Protein > 4.1 g",
        "Sodium > 184 mg"
    ],
    "n": "Tomato Tartine",
    "a": "tiggersmommy",
    "r": "0",
    "s": 12,
    "des": "\"These tartines are assembled on long slices of crisply toasted baguette topped with a mash of garlic and herb BoursinÂ®, cut with ricotta and goat cheese to make it spreadable. On top, chopped tomatoes, sweet and crunchy, with a drizzle of olive oil, basil, salt and pepper. I love these for lunch or even breakfast. Satisfying, but uncomplicated.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nRub 1 side of each baguette slice with the cut-side of halved garlic and drizzle with 2 tablespoons olive oil. Arrange baguettes slices, oil-side up, on a baking sheet.\nPlace baking sheet on the middle rack of preheated oven and bake until baguette slices are golden, about 7 minutes. Transfer to a wire rack to cool, leaving oven on.\nToss tomatoes, basil, and minced garlic together with 4 teaspoons olive oil, balsamic vinegar, salt, and pepper in a bowl until coated.\nMix goat cheese, garlic and herb cheese spread, and ricotta cheese together in a separate bowl. Spread cheese mixture onto cooled baguette slices; top with tomato mixture.\nBake in the preheated oven until cheese melts, about 5 minutes. Serve immediately.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "25 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}