{
    "id": 234172,
    "old_rating": "4.45",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup walnuts (optional)",
        "1 cup all-purpose flour",
        "1/2 cup whole wheat flour",
        "1 teaspoon kosher salt",
        "1/2 teaspoon baking soda",
        "3/4 cup unsalted butter, room temperature",
        "1/2 cup packed light brown sugar",
        "1/2 cup white sugar",
        "1 large egg",
        "1 1/2 teaspoons vanilla extract",
        "1/2 cup mashed very ripe banana",
        "1 cup old-fashioned rolled oats",
        "8 ounces semisweet chocolate chips"
    ],
    "nut": [
        "Calories > 129 kcal",
        "Carbs > 16.1 g",
        "Cholesterol > 15 mg",
        "Fat > 7.2 g",
        "Protein > 1.7 g",
        "Sodium > 75 mg"
    ],
    "n": "Chocolate Chip Banana Cookies",
    "a": "Emily Vega",
    "r": "0",
    "s": 36,
    "des": "\"A delicious blend of all your favorite flavors, these sturdy little cookies vanish almost instantly!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nSpread walnuts onto a baking sheet.\nBake in the preheated oven until walnuts are toasted and fragrant, 5 to 7 minutes. Remove from oven and cool; coarsely chop.\nWhisk all-purpose flour, whole wheat flour, salt, and baking soda together in a bowl. Beat butter, brown sugar, and white sugar together in a bowl using an electric mixer until pale and fluffy; add egg and vanilla extract. Beat until just combined. Beat banana into creamed butter mixture until just combined.\nStir flour mixture into creamed butter mixture until dough is just combined; fold in oats, chocolate chips, and walnuts. Drop heaping spoonfuls of dough onto the prepared baking sheets, spacing each mound about 1 1/2 inch apart.\nBake on the center rack of the preheated oven for 6 minutes. Rotate pans and bake until edges are browned, 6 to 7 more minutes. Cool cookies on the baking sheets for 5 minutes before transferring to wire racks to cool completely.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "4407172.jpg",
    "o": "",
    "st": "allrecipes"
}