{
    "id": 23427,
    "old_rating": "4.45283",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "3/4 cup shortening",
        "1/4 cup cold water",
        "1 tablespoon onion salt",
        "1 tablespoon shortening",
        "1 pound skinless, boneless chicken breast halves - cubed",
        "1 cup chopped onion",
        "1 (15 ounce) can green beans",
        "1 teaspoon onion salt",
        "1 tablespoon white sugar",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon black pepper",
        "1/4 teaspoon dried oregano",
        "1 (10.75 ounce) can condensed cream of chicken soup"
    ],
    "nut": [
        "Calories > 419 kcal",
        "Carbs > 32.2 g",
        "Cholesterol > 36 mg",
        "Fat > 24.1 g",
        "Protein > 18 g",
        "Sodium > 1343 mg"
    ],
    "n": "Chicken Pot Pie VII",
    "a": "ANTIE DI",
    "r": "0",
    "s": 8,
    "des": "\"You can play with this recipe by changing the meat or soup to anything that goes together and sounds good to you.  I freeze this for those last minute meals or for the times my husband has to cook.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C.)\nIn a large bowl, combine flour and onion salt. Cut in shortening until mixture resembles coarse crumbs. Add water and stir until it forms a ball. Divide dough in half and shape into balls. Roll one ball out to fit a 9 or 10 inch pie plate. Place bottom crust in pie plate and roll out top crust.\nIn a large cast iron frying pan, heat 1 tablespoon shortening. Add chicken and onion and cook until mixture is just browned. Stir in beans and season with onion salt, sugar, garlic powder, pepper, and oregano. Stir in condensed soup.  Heat mixture, stirring constantly, until it just begins to simmer. Pour into pie crust and cover with top crust. Fold top crust under edge of bottom crust, seal and cut slits in top crust.\nBake in the preheated oven for 25 minutes, or until golden brown.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "278595.jpg",
    "o": "",
    "st": "allrecipes"
}