{
    "id": 234280,
    "old_rating": "4.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup water",
        "2 large heads cauliflower, cut into florets",
        "1/2 cup shredded mozzarella cheese",
        "1/4 cup crumbled cooked bacon",
        "4 cloves garlic, crushed (or more to taste)",
        "1 teaspoon Hungarian paprika",
        "1/2 teaspoon coarsely ground black pepper",
        "1/4 teaspoon kosher salt",
        "1/4 teaspoon red pepper flakes",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1 (2.8 ounce) package French-fried onions",
        "1 cup shredded Parmesan cheese"
    ],
    "nut": [
        "Calories > 238 kcal",
        "Carbs > 19.3 g",
        "Cholesterol > 17 mg",
        "Fat > 13.9 g",
        "Protein > 11.1 g",
        "Sodium > 697 mg"
    ],
    "n": "Bacon Garlic Parmesan Cauliflower Casserole",
    "a": "2bmary",
    "r": "0",
    "s": 8,
    "des": "\"This twist on cauliflower casserole combines the traditional green bean casserole-style dish with a tastier, spicier flavor. Fresh cauliflower, bacon, and Italian ingredients make this casserole just delicious. This casserole really celebrates the cauliflower therefore should not be soupy and doesn't overdo the flavorings and cheese.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nPour water in a large bowl; add cauliflower florets. Cover bowl tightly with plastic wrap.\nCook cauliflower in microwave oven on High for 4 minutes. Pour excess water from bowl. Transfer cauliflower to a 12x9-inch baking dish; add mozzarella cheese, bacon, garlic, paprika, pepper, salt, and red pepper flakes. Gently stir cauliflower mixture to season evenly.  Pour cream of mushrooms soup over the cauliflower mixture; stir to coat. Spread French-fried onions over the mixture and top with Parmesan cheese.\nBake in preheated oven until browned, about 45 minutes. Cool 5 minutes before serving.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "2097606.jpg",
    "o": "",
    "st": "allrecipes"
}