{
    "id": 234371,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups water",
        "1 1/2 cups basmati rice",
        "3 cups coconut milk",
        "1 1/2 cups raw sugar",
        "1/2 teaspoon sea salt",
        "1 cup whole milk",
        "2 eggs, beaten",
        "1/4 cup unsalted butter",
        "1 tablespoon vanilla extract",
        "2 teaspoons ground cinnamon",
        "1 teaspoon ground nutmeg",
        "1 (15 ounce) can sliced peaches, drained and chopped (optional)",
        "1 cup raisins, or more to taste (optional)"
    ],
    "nut": [
        "Calories > 487 kcal",
        "Carbs > 72.2 g",
        "Cholesterol > 52 mg",
        "Fat > 21.4 g",
        "Protein > 6.4 g",
        "Sodium > 138 mg"
    ],
    "n": "Creamy Coconut Milk Rice Pudding",
    "a": "awakenedone",
    "r": "0",
    "s": 10,
    "des": "\"This easy and delicious simple rice pudding is made with all organic ingredients, loaded with coconut milk, vanilla, and nutmeg for such a comforting treat! For a vegan version, omit the eggs, and use almond milk in place of the dairy and replace butter with vegan buttery sticks. Both versions are quite delicious! Just make sure to let the pudding cool to room temperature to let pudding set and then place in refrigerator to chill for at least 3 hours. Enjoy!\"",
    "ins": "Bring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and liquid has been absorbed, about 20 minutes.\nCombine rice, coconut milk, sugar, and salt in a large saucepan; bring to a boil. Reduce heat and simmer until pudding is thick and creamy, 18 to 20 minutes. Stir milk and eggs into pudding, stirring constantly to keep pudding from sticking, at least 2 minutes.\nRemove pudding from heat and stir butter, vanilla, cinnamon, and nutmeg into pudding until thoroughly mixed. Fold peaches and raisins into pudding.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "2127170.jpg",
    "o": "",
    "st": "allrecipes"
}