{
    "id": 234396,
    "old_rating": "4.38983",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 large onion, sliced",
        "3 cloves garlic, chopped",
        "1 pound beef sirloin, cut into 2-inch strips, or more to taste",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon chili powder",
        "1/2 teaspoon onion powder",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon paprika",
        "1/4 teaspoon dried thyme",
        "1/4 teaspoon dried marjoram",
        "1/4 teaspoon dried basil",
        "2 tablespoons bourbon whiskey (such as Jim BeamÂ®)",
        "1 teaspoon soy sauce",
        "1 teaspoon prepared mustard",
        "1 teaspoon Worcestershire sauce",
        "1/2 teaspoon hot sauce (such as Frank's Red Hot Â®)",
        "1 (12 fluid ounce) can or bottle beer (such as BudweiserÂ®)",
        "2 cubes beef bouillon"
    ],
    "nut": [
        "Calories > 251 kcal",
        "Carbs > 7.6 g",
        "Cholesterol > 60 mg",
        "Fat > 10.6 g",
        "Protein > 20.1 g",
        "Sodium > 602 mg"
    ],
    "n": "Slow Cooker Philly Steak Sandwich Meat",
    "a": "duboo",
    "r": "0",
    "s": 4,
    "des": "\"This makes a fantastic meat for Philly steak sandwiches. You can even use lower grade roasts and have this turn out. It also makes its own au jus if you like to dip as I do. To serve, sautee a sliced onion and sliced green pepper in a skillet. Put meat on a sub bun and top with onion and green pepper and Swiss or provolone cheese on top of that.   Leave open-faced and broil until the cheese just starts to brown. The top of the bun will brown fast so don't broil that until the cheese has completely melted and just starts to show color.\"",
    "ins": "Spread onion and garlic into the bottom of a slow cooker; layer beef over onion and garlic. Sprinkle cumin, black pepper, chili powder, onion powder, garlic powder, paprika, thyme, marjoram, and basil over beef; top with bourbon, soy sauce, mustard, Worcestershire sauce, and hot sauce. Pour beer over beef mixture and add beef bouillon cubes.\nCook on Low, stirring every hour or so, for 8 hours (or High for 4 hours).",
    "pt": "15 m",
    "ct": "8 m",
    "tt": "8 h ",
    "i": "1045362.jpg",
    "o": "3072546.jpg,3072541.jpg,2595154.jpg,1904405.jpg,1079415.jpg,1060742.jpg",
    "st": "allrecipes"
}