{
    "id": 234374,
    "old_rating": "4.79747",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound prepared pie dough, cut into 4 pieces",
        "2 large green apples, peeled and cored",
        "2 tablespoons butter",
        "1/4 teaspoon salt",
        "1/4 cup white sugar",
        "2 tablespoons brown sugar",
        "1 1/2 teaspoons ground cinnamon, or to taste",
        "1 teaspoon water, or more if needed (optional)",
        "1 egg",
        "2 teaspoons milk",
        "1 teaspoon white sugar, or as needed - divided"
    ],
    "nut": [
        "Calories > 729 kcal",
        "Carbs > 82.3 g",
        "Cholesterol > 62 mg",
        "Fat > 42 g",
        "Protein > 8.5 g",
        "Sodium > 755 mg"
    ],
    "n": "Apple Hand Pies",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"These hand pies, also known as turnovers, look too perfect to be homemade. Any of your favorite pie fillings, both sweet and savory, will work. I hope you give this easy technique a try soon. Enjoy!\"",
    "ins": "Line a baking sheet with a silicone mat or parchment paper.\nCut peeled and cored apples into quarters, cut each quarter into 3 wedges, and cut wedges into chunks.\nMelt butter in a large skillet over medium heat; let butter brown to a light golden color and until butter smells toasted, about 1 minute. Stir apples into hot butter; sprinkle with salt, white sugar, and brown sugar. Cook and stir apple mixture until apples are softened, about 5 minutes. Mix in cinnamon and water; continue cooking until apples are soft and sticky, 1 to 2 more minutes. Spread apple filling onto a plate to cool.\nPreheat oven to 400 degrees F (200 degrees C).\nForm a dough piece into a ball, place on a floured work surface, and roll into a circle about 8 inches in diameter. Spoon 1/3 to 1/2 cup apple filling in the center. Fold dough over filling, leaving about 1 inch of dough on the bottom side visible below the top side. Gently press dough closed around filling, using your fingertips.\nFold the overhanging bottom part of the dough up over the top edge, working your way around the crust, and pinch the overhang tightly to the top part of the crust.\nCrimp the edge tightly closed, pinching a little bit of dough with the thumb and forefinger of one hand and using your index finger on the other hand to push a small notch into the pinched dough. Continue pinching and notching all the way around until the crust is tightly crimped together. Repeat with remaining dough and filling. Transfer pies onto prepared baking sheet.\nWhisk egg with milk in a small bowl until thoroughly combined. Brush top of each hand pie with egg mixture and sprinkle with about 1/4 teaspoon white sugar. Cut 3 small vent holes in the top of each pie.\nBake in the preheated oven until pies are golden brown and filling is bubbling, 25 to 30 minutes. Let cool for at least 15 minutes before serving.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "4500653.jpg",
    "o": "4500653.jpg,4485741.jpg,4485458.jpg,4478508.jpg,4403829.jpg,4089262.jpg",
    "st": "allrecipes"
}