{
    "id": 234372,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups all-purpose flour, sifted",
        "1/2 cup confectioners' sugar",
        "3/4 cup butter",
        "1 (8 ounce) package cream cheese, softened",
        "1/2 cup white sugar",
        "1 teaspoon vanilla extract",
        "3/4 (12 ounce) container whipped topping (such as Cool WhipÂ®)",
        "1 cup cold water",
        "2 envelopes unflavored gelatin",
        "1 cup boiling water",
        "1/2 cup white sugar, or to taste",
        "1/4 teaspoon salt",
        "1/4 cup lemon juice",
        "5 cups diced mango"
    ],
    "nut": [
        "Calories > 219 kcal",
        "Carbs > 27.1 g",
        "Cholesterol > 26 mg",
        "Fat > 11.7 g",
        "Protein > 2.5 g",
        "Sodium > 101 mg"
    ],
    "n": "Fresh Mango Pie Dessert",
    "a": "Joli",
    "r": "0",
    "s": 24,
    "des": "\"Mango gelatin on a cream cheese-CoolwhipÂ® mixture sits on a yummy crust.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nMix flour and confectioners' sugar together in a bowl. Cut butter into flour mixture using a pastry blender or 2 knives until mixture resembles coarse crumbs; press into a 9x13-inch baking dish.\nBake in the preheated oven until crust is lightly browned, 20 to 25 minutes. Remove from oven and cool completely.\nBeat cream cheese, 1/2 cup white sugar, and vanilla extract together in a bowl using an electric mixer until smooth and creamy. Fold whipped topping into cream cheese mixture and pour over crust. Refrigerate mixture until cream cheese filling is chilled, about 30 minutes.\nPour cold water into a bowl and sprinkle with gelatin; stir well. Pour hot water over gelatin mixture and stir until gelatin is dissolved. Stir 1/2 cup sugar and salt into gelatin mixture until sugar is dissolved; add lemon juice and cool to room temperature. Fold mango into gelatin mixture and refrigerate until gelatin begins to set, 15 to 20 minutes.\nPour mango gelatin over cream cheese filling and refrigerate until completely set, about 1 hour.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}