{
    "id": 234466,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Wet ingredients:",
        "2 tablespoons freshly grated orange zest",
        "1/2 cup butter, melted",
        "1/2 cup white sugar",
        "2 eggs",
        "1 tablespoon orange juice",
        "1 tablespoon milk",
        "1/4 teaspoon vanilla extract",
        "Dry ingredients:",
        "2 cups shelled dry-roasted pistachio nuts",
        "1/2 teaspoon salt to taste (see footnote)",
        "1/2 teaspoon baking powder",
        "1/2 cup all-purpose flour",
        "1/2 cup miniature chocolate chips (optional)",
        "Glaze:",
        "1 tablespoon orange juice, or as needed",
        "2 teaspoons freshly grated orange zest",
        "3 tablespoons confectioners' sugar, or as needed"
    ],
    "nut": [
        "Calories > 292 kcal",
        "Carbs > 25.1 g",
        "Cholesterol > 51 mg",
        "Fat > 20.1 g",
        "Protein > 6.4 g",
        "Sodium > 272 mg"
    ],
    "n": "Chef John's Orange-Pistachio \"Greenies\"",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"Are you tired of blondies or bored with brownies? Then it's time to try these Greenies, a brownie-like confection made with pistachios and flavored with orange zest.\"",
    "ins": "Whisk 2 tablespoons orange zest into melted butter in a mixing bowl, followed by white sugar, until sugar has dissolved, about 2 minutes. Whisk in eggs until light and fluffy, about 2 more minutes. Stir 1 tablespoon orange juice, milk, and vanilla extract into egg mixture.\nPlace pistachios into a food processor and pulse until coarsely ground. Add salt, baking powder, and flour to pistachios; pulse until combined, 3 to 4 times. Stir pistachio mixture into wet ingredients until batter is combined. Gently fold in chocolate chips.\nPreheat oven to 350 degrees F; generously butter a 9x9-inch square baking dish.\nSpread batter into prepared baking dish. Tap the dish several times on a sturdy work surface to eliminate air bubbles.\nBake in the preheated oven until top is lightly golden brown and a toothpick inserted into the center comes out clean, 20 to 25 minutes.\nStir 1 tablespoon orange juice with 2 teaspoons orange zest in a small bowl; mix in confectioners' sugar to form a thin, runny glaze. Drizzle glaze on top of pistachio bars and spread to cover top. Cut into squares once cooled.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}