{
    "id": 234495,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 slices smoked bacon, or more to taste",
        "1/2 cup chopped yellow onion",
        "2 pinches ground black pepper",
        "2 cloves garlic, diced",
        "3 1/2 tablespoons chopped fresh parsley, divided",
        "4 (15 ounce) cans green beans, drained",
        "2 (14.5 ounce) cans yellow wax beans, drained",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 104 kcal",
        "Carbs > 14.2 g",
        "Cholesterol > 7 mg",
        "Fat > 2.7 g",
        "Protein > 5.7 g",
        "Sodium > 1049 mg"
    ],
    "n": "Great Grandma's Skillet Green Beans",
    "a": "GMPalko",
    "r": "0",
    "s": 6,
    "des": "\"A long-time family favorite. I've always brought home an empty dish when this is on the table. If you're tired of the\nmushrooms, cream sauces, canned onions, and cheese, this is for you. No oven needed here; a big plus. Using an electric skillet frees up your stove top as well. Fresh is always best, but beans of quality may be hard to find this time of year. Canned or frozen instead will make a good dish. The optional use of yellow wax beans is an eye-pleaser and provides an interesting taste variation. Bump up a like amount of green beans if yellow beans are not used.\"",
    "ins": "Place bacon in a large skillet and cook over medium-high heat until evenly browned, about 10 minutes. Transfer bacon slices to paper towels to drain.\nCook and stir onion and 2 pinches black pepper in hot bacon drippings until translucent, 4 to 6 minutes.\nStir garlic into onion mixture; cook and stir until onion begins to brown along the edges, 4 to 6 minutes. Add 1 tablespoon parsley to garlic and onion; cook and stir until parsley begins to wilt, 1 minute.\nPour green beans, yellow beans, and 1 1/2 tablespoons parsley into onion mixture; gently turn beans to coat with bacon drippings. Reduce heat to low, partially cover skillet, and simmer until beans are heated through, 5 to 10 minutes.\nSeason beans with salt and black pepper to taste, partially cover the skillet and continue simmering, turning occasionally, until beans are hot, 20 minutes. Garnish with bacon and remaining 1 tablespoon parsley.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "1091232.jpg",
    "o": "",
    "st": "allrecipes"
}