{
    "id": 234429,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "waxed paper",
        "2 cups crispy corn and rice cereal (such as CrispixÂ®)",
        "2 cups honey graham cereal (such as Golden GrahamsÂ®)",
        "2 cups peanut butter corn puff cereal (such as Reese's PuffsÂ®)",
        "2 cups popped popcorn, or more to taste (optional)",
        "8 ounces candy-coated milk chocolate pieces (such as M&M'sÂ®)",
        "1 cup salted peanuts",
        "1/2 cup butter",
        "2 tablespoons all-purpose flour",
        "1 cup brown sugar",
        "1/2 cup corn syrup",
        "1/2 cup peanut butter"
    ],
    "nut": [
        "Calories > 291 kcal",
        "Carbs > 37.3 g",
        "Cholesterol > 14 mg",
        "Fat > 14.9 g",
        "Protein > 4.6 g",
        "Sodium > 228 mg"
    ],
    "n": "Sweet and Crunchy Popcorn Snack Mix",
    "a": "JVAND",
    "r": "0",
    "s": 20,
    "des": "\"This sweet and crunchy snack not only tastes great but looks so appealing that when I serve it at tailgating parties, passers-by stop and ask for the recipe.\"",
    "ins": "Line a large baking sheet with waxed paper.\nCombine crispy corn and rice cereal, honey graham cereal, peanut butter corn puff cereal, popcorn, chocolate pieces, and peanuts in a large bowl.\nMelt butter in a large saucepan over medium heat; whisk in flour until smooth, 2 to 3 minutes. Add brown sugar and corn syrup; bring to a boil, stirring occasionally, until sugar is dissolved, about 1 minute. Stir peanut butter into sugar mixture until creamy, about 3 minutes; pour over cereal mixture and gently toss until coated.\nSpread cereal mixture over prepared baking sheet and allow to cool, about 30 minutes. Once cooled, break mixture into chunks and store in an airtight container.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "50 m",
    "i": "3908513.jpg",
    "o": "",
    "st": "allrecipes"
}