{
    "id": 234472,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups all-purpose flour",
        "1 tablespoon salt, divided",
        "3/4 cup boiling water",
        "1/2 cup cold water, or as needed",
        "vegetable oil, or as needed, divided",
        "1 bunch green onions (scallions), minced"
    ],
    "nut": [
        "Calories > 366 kcal",
        "Carbs > 51.8 g",
        "Cholesterol > 0 mg",
        "Fat > 14.3 g",
        "Protein > 7.5 g",
        "Sodium > 1757 mg"
    ],
    "n": "Chinese Scallion Pancakes",
    "a": "Mei",
    "r": "0",
    "s": 4,
    "des": "\"Scallion pancakes are a popular dish in China, and available from restaurants and street vendors. There are many different regional variations. My version is Shanghai-style and is my grandmother's recipe. These can be frozen after step 3, and thawed and finished cooking when ready to eat.\"",
    "ins": "Mix flour and 1 teaspoon salt together in a large bowl; pour in boiling water and quickly mix together until water is absorbed. Work cold water, about 1 tablespoon at a time, into flour mixture just until dough forms. Knead dough for 10 minutes. Cover bowl with a damp cloth and let dough rest for 40 minutes.\nTurn dough onto a lightly floured work surface; divide into 4 equal pieces.\nRoll 1 piece of dough into a large thin round; brush the top with vegetable oil and sprinkle with about 1/2 teaspoon salt and 1/4 the green onions. Pick up 1 end of the round and roll dough around green onions into a long scroll-shape. Take 1 scroll end and roll dough into a disk. Repeat with remaining dough, letting each disk rest for 10 minutes.\nHeat about 1 tablespoon vegetable oil in a skillet over medium-low heat. Place 1 disk on a floured surface and roll into a 1/2-inch thick round; cook in the hot oil until golden brown, 2 to 3 minutes per side. Repeat with remaining disks.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "1068447.jpg",
    "o": "",
    "st": "allrecipes"
}