{
    "id": 234492,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 red onion, chopped",
        "1 orange bell pepper, chopped",
        "cooking spray",
        "1/4 cup olive oil, divided",
        "1 teaspoon minced garlic, or to taste",
        "1 teaspoon minced fresh ginger, or to taste",
        "2 pears, cut into bite-size chunks",
        "1/4 cup ponzu sauce (citrus soy-based sauce), divided",
        "1 (12 ounce) bag mixed salad greens, or to taste",
        "1 cucumber, chopped"
    ],
    "nut": [
        "Calories > 220 kcal",
        "Carbs > 23.8 g",
        "Cholesterol > 0 mg",
        "Fat > 14 g",
        "Protein > 3 g",
        "Sodium > 404 mg"
    ],
    "n": "Pear Ginger Soy Salad",
    "a": "Jen",
    "r": "0",
    "s": 4,
    "des": "\"Very tasty salad - people always gobble this one up! This recipe can be modified based on your preference and liking of ginger and garlic.\"",
    "ins": "Preheat an oven to 450 degrees F (230 degrees C). Grease a baking sheet.\nSpread onion and bell pepper in the prepared baking sheet and spray with cooking spray.\nBake in the preheated oven until golden, about 15 minutes.\nHeat 1 tablespoon olive oil in a skillet over medium heat; cook and stir garlic and ginger in the hot oil until garlic begins to brown slightly, 2 to 3 minutes. Add pears to garlic mixture and cook until pears are evenly coated in oil, about 1 minute. Reduce heat to medium-low and pour 1 tablespoon ponzu over pears; cook until pears begin to brown, 5 to 10 minutes. Add more garlic and ginger if desired.\nMix remaining 3 tablespoons olive oil and 3 tablespoons ponzu in a small saucepan; bring to a boil. Add garlic and ginger if desired. Remove saucepan from heat and cool.\nCombine greens, cucumber, onion, bell pepper, and pears in a bowl; drizzle with ponzu-olive oil mixture. Toss salad to evenly coat.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}