{
    "id": 234521,
    "old_rating": "4.52941",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup semi-sweet chocolate chunks",
        "1 tablespoon unsalted butter",
        "1 teaspoon coconut oil, or more as needed",
        "2 tablespoons ground cinnamon",
        "1 cup mashed ripe bananas",
        "1/2 cup coconut flour",
        "1 teaspoon baking soda",
        "1/8 teaspoon sea salt",
        "1/2 cup almond butter",
        "4 eggs",
        "1 teaspoon coconut oil"
    ],
    "nut": [
        "Calories > 355 kcal",
        "Carbs > 35.6 g",
        "Cholesterol > 97 mg",
        "Fat > 22.7 g",
        "Protein > 8.9 g",
        "Sodium > 293 mg"
    ],
    "n": "Paleo Chocolate and Cinnamon Banana Bread",
    "a": "Cindy Anschutz Barbieri",
    "r": "0",
    "s": 8,
    "des": "\"I have been baking with chocolate all week and this morning decided to make this banana bread. I wasn't sure how it was going to turn out but I have to say ... Amazing! You really need to try this recipe! I'd better get down stairs to hide some before it is all gone.\"",
    "ins": "Melt the chocolate, butter, and 1 teaspoon coconut oil in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Remove from heat and stir in cinnamon.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5-inch loaf pan with 1 teaspoon coconut oil.\nSift coconut flour, baking soda, and salt together in a bowl. Place mashed bananas in a large bowl; fold flour mixture into bananas with a rubber spatula.\nBeat almond butter and eggs together in a bowl until creamy; add to banana mixture and mix well.\nPour 1/2 banana mixture into prepared loaf pan; top with 2 tablespoons chocolate mixture. Use a fork to spread and swirl the chocolate mixture through the banana batter. Repeat with remaining banana batter and chocolate mixture.\nBake in the preheated oven until top is golden brown and loaf is cooked through, 50 minutes.",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "3224574.jpg",
    "o": "",
    "st": "allrecipes"
}