{
    "id": 234520,
    "old_rating": "3.95652",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup prepared yellow mustard",
        "1/2 cup honey",
        "2 tablespoons orange juice",
        "1 clove garlic, minced",
        "1 cup whole wheat flour",
        "1 teaspoon salt, divided",
        "3 cups whole wheat panko bread crumbs",
        "3 eggs, beaten",
        "2 pounds skinless, boneless chicken breast halves, cut into strips"
    ],
    "nut": [
        "Calories > 383 kcal",
        "Carbs > 58 g",
        "Cholesterol > 134 mg",
        "Fat > 6.8 g",
        "Protein > 33 g",
        "Sodium > 750 mg"
    ],
    "n": "Honey Mustard Oven-Baked Chicken Tenders",
    "a": "The Purple Baker",
    "r": "0",
    "s": 8,
    "des": "\"A childhood favorite, these flavorful chicken tenders are made healthy by baking on a wire rack for crispiness and using whole wheat flour and breadcrumbs!\"",
    "ins": "Stir mustard, honey, orange juice, garlic together in a glass or ceramic bowl. Transfer 1/4 cup mustard mixture to a bowl to use as a dipping sauce; add chicken to the remaining mustard mixture and toss to coat. Marinate chicken for at least 30 minutes, or up to 3 hours.\nPreheat an oven to 450 degrees F (230 degrees C). Place wire cooling racks onto baking sheets.\nStir whole wheat flour and 1/2 teaspoon salt together in a shallow bowl. Stir bread crumbs and 1/2 teaspoon salt together in another shallow bowl. Place beaten eggs in another shallow bowl.\nGently press a chicken strip into the flour mixture to coat and shake to remove excess flour. Dip into the beaten egg, then press into bread crumb mixture. Gently toss between your hands so any bread crumbs that haven't stuck can fall away. Place the breaded chicken strips onto baking sheets prepared with wire cooling racks.\nBake chicken in the preheated oven until no longer pink in the center and the juices run clear, 15 to 18 minutes. Serve with reserved mustard sauce.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "1045643.jpg",
    "o": "",
    "st": "allrecipes"
}