{
    "id": 234678,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 head cauliflower, cut into florets",
        "1 cup low-fat cottage cheese",
        "3/4 cup whole wheat flour",
        "2 tablespoons brown sugar",
        "1 teaspoon baking powder",
        "1 pinch ground nutmeg",
        "1 pinch ground cinnamon",
        "2 large eggs",
        "1/3 cup milk, or as needed",
        "1 teaspoon butter, or as needed"
    ],
    "nut": [
        "Calories > 228 kcal",
        "Carbs > 30.6 g",
        "Cholesterol > 102 mg",
        "Fat > 5.6 g",
        "Protein > 16.1 g",
        "Sodium > 426 mg"
    ],
    "n": "Whole Wheat (Cauliflower) Cottage Cheese Pancakes",
    "a": "LaurenPretzel",
    "r": "0",
    "s": 4,
    "des": "\"Light, fluffy cottage cheese pancakes with hidden cauliflower for some nutritional punch - my 5-year-old declared these 'the best pancakes ever!'\"",
    "ins": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower, cover, and steam until tender, about 10 minutes. Transfer cauliflower to a blender and blend until smooth. Measure 1 cup pureed cauliflower and store any remaining in a container in the refrigerator for  another use.\nStir 1 cup cauliflower puree and cottage cheese together in a large bowl until smooth. Mix flour, brown sugar, baking powder, nutmeg, and cinnamon into cauliflower mixture until batter is just mixed and thickened. Add eggs to batter until thoroughly mixed. Stir milk into batter, adding 1 tablespoon more at a time if needed, until batter is smooth.\nHeat butter in a large frying pan over medium heat; drop heaping tablespoons batter into the melted butter. Cook until batter begins to bubble, 3 to 4 minutes. Flip pancakes and cook other side until browned, 3 to 4 more minutes. The inside of these pancakes will be softer than traditional pancakes. Repeat with remaining batter.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}