{
    "id": 234689,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 slices bacon",
        "1 pound lean ground beef",
        "2 tablespoons dill pickle juice",
        "1 pinch salt and ground black pepper to taste",
        "1 (16 ounce) package processed American cheese, cut into cubes",
        "8 ounces cream cheese",
        "1 cup shredded part-skim mozzarella cheese",
        "1 (10 ounce) can diced tomatoes with green chile peppers",
        "6 green onions, thinly sliced",
        "1 tablespoon ketchup",
        "1 tablespoon Dijon mustard",
        "1/4 teaspoon cayenne pepper (optional)"
    ],
    "nut": [
        "Calories > 261 kcal",
        "Carbs > 2.6 g",
        "Cholesterol > 71 mg",
        "Fat > 20.3 g",
        "Protein > 16.7 g",
        "Sodium > 727 mg"
    ],
    "n": "Spicy Bacon Cheeseburger Dip",
    "a": "brightlightz",
    "r": "0",
    "s": 16,
    "des": "\"The flavors of a bacon cheeseburger combine to make this hearty and easy to put together dip that feeds a big crowd!  If the dip becomes too thick, thin with small amounts of milk to desired consistency. Serve warm with tortilla chips, bagel chips, or corn chip scoops.\"",
    "ins": "Place the bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove bacon to a plate lined with a paper towel, retaining drippings in the skillet.\nBreak ground beef in pieces and add to drippings in the skillet. Cook and stir beef until completely browned, 7 to 10 minutes; drain in a colander. Rinse beef with water to wash away excess fat; drain. Transfer drained beef to a bowl. Stir pickle juice into the beef; season with salt and pepper.\nCombine ground beef mixture, American cheese, cream cheese, diced tomatoes with green chile peppers, green onions, ketchup, Dijon mustard, and cayenne pepper in a slow cooker.\nCook cheese mixture on Low, stirring occasionally, until the cheese is melted completely, about 1 hour. Crumble bacon over the surface of the dip to serve.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "2182231.jpg",
    "o": "",
    "st": "allrecipes"
}