{
    "id": 234685,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup rolled oats",
        "3/4 cup molasses",
        "2 tablespoons butter",
        "1 teaspoon salt",
        "1 1/2 cups boiling water",
        "1 tablespoon white sugar, divided",
        "1/4 cup warm water (about 100 degrees F/38 degrees C)",
        "2 1/2 teaspoons active dry yeast",
        "4 1/2 cups bread flour",
        "1 1/2 cups raisins"
    ],
    "nut": [
        "Calories > 261 kcal",
        "Carbs > 54.6 g",
        "Cholesterol > 4 mg",
        "Fat > 2.5 g",
        "Protein > 6 g",
        "Sodium > 165 mg"
    ],
    "n": "Oatmeal Raisin Molasses Bread",
    "a": "Nadine",
    "r": "0",
    "s": 16,
    "des": "\"DH loved the bread his grandmother always made. This is the closest we ever got to it. Use a bread machine for the dough and bake in the oven.\"",
    "ins": "Place oats, molasses, butter, and salt into the bread maker bowl; add the boiling water.\nMeasure 1/4 teaspoon sugar into a small cup and set aside. Pour remaining sugar into the oat mixture and stir. Let mixture cool to about 100 degrees F/38 degrees C, about 20 minutes.\nPour warm water into the reserved sugar in the small cup; add yeast.\nPour bread flour atop the oat mixture. Pour yeast mixture over the flour.\nSelect Dough setting and press start. Check your owner's manual to see how long the kneading lasts, so you can add raisins to the dough 5 minutes before it finishes kneading. Let the bread maker run the full dough cycle, about 1 hour, though it will depend on your machine.\nGrease 2 bread pans.\nTurn dough out onto a lightly floured surface. Punch down dough, but do not knead. Separate into two loaves and place in prepared pans; cover each with a damp towel and allow to rise for about 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven until the top is golden brown and the bottom of loaf sounds hollow when tapped, 15 to 20 minutes.",
    "pt": "2 h",
    "ct": "15 m",
    "tt": "3 h ",
    "i": "1314360.jpg",
    "o": "",
    "st": "allrecipes"
}