{
    "id": 234667,
    "old_rating": "4.68254",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "3/4 pound fresh white mushrooms, sliced",
        "1/4 pound fresh shiitake mushrooms, stemmed and sliced",
        "salt and ground black pepper to taste",
        "2 cloves garlic, minced",
        "2 fluid ounces sherry",
        "1 cup chicken stock",
        "1 cup heavy whipping cream",
        "8 ounces fettuccine pasta",
        "1 1/2 teaspoons chopped fresh thyme",
        "1 1/2 teaspoons chopped fresh chives",
        "1 1/2 teaspoons chopped fresh tarragon",
        "9 tablespoons freshly shredded Parmigiano-Reggiano cheese, divided"
    ],
    "nut": [
        "Calories > 375 kcal",
        "Carbs > 33.6 g",
        "Cholesterol > 61 mg",
        "Fat > 22.4 g",
        "Protein > 11.1 g",
        "Sodium > 371 mg"
    ],
    "n": "Chef John's Creamy Mushroom Pasta",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"A beautiful, aromatic, creamy mushroom sauce coats hot cooked fettuccine pasta in this quick dish. You can use any kind of pasta you like.\"",
    "ins": "Heat olive oil in a large skillet over medium heat. Cook and stir white and shiitake mushrooms in the hot oil with a pinch of salt until until the juice from the mushrooms evaporates and the mushrooms are browned, about 10 minutes.\nStir garlic into mushrooms and cook for 1 minute; pour in sherry and cook until wine is nearly evaporated. Mix chicken stock into mushroom mixture; season with salt and black pepper. Bring to a simmer, reduce heat, and cook until slightly thickened, about 5 minutes.\nPour cream into mushroom mixture, stir to combine, and simmer for 5 minutes. Mixture will foam and thicken slightly.\nFill a large pot with lightly salted water and bring to a rolling boil. Stir in the fettuccine, bring back to a boil, and cook pasta over medium heat until cooked through but still firm to the bite, about 8 minutes. Drain but do not rinse pasta; transfer to a large serving bowl and keep warm.\nStir thyme, chives, and tarragon into mushroom sauce and turn off heat; mix 1/2 cup Parmigiano-Reggiano cheese into sauce until cheese has melted.\nPour all the mushroom sauce and half the mushrooms over pasta, reserving about half the mushrooms in the skillet. Toss pasta in sauce until coated; top with remaining mushrooms and remaining 1 tablespoon Parmigiano-Reggiano cheese for garnish.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "4486991.jpg",
    "o": "4486991.jpg,4486946.jpg,4477922.jpg,4477198.jpg,4466065.jpg,4433136.jpg",
    "st": "allrecipes"
}