{
    "id": 234650,
    "old_rating": "4.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package spaghetti (such as DreamfieldsÂ®)",
        "1/4 cup butter",
        "1/4 cup extra-virgin olive oil",
        "1 pound asparagus, cut into pieces",
        "1 red bell pepper, thinly sliced",
        "4 shallots, thinly sliced",
        "4 cloves garlic, minced",
        "1 tablespoon minced fresh basil",
        "1/4 teaspoon red pepper flakes",
        "1/8 teaspoon oregano",
        "1 pound medium shrimp, peeled and deveined",
        "1/2 cup grated Parmesan cheese",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 430 kcal",
        "Carbs > 48.3 g",
        "Cholesterol > 106 mg",
        "Fat > 16.3 g",
        "Protein > 22.3 g",
        "Sodium > 208 mg"
    ],
    "n": "Shrimp and Asparagus with a Louisiana Twist",
    "a": "Norma J. Macks",
    "r": "0",
    "s": 8,
    "des": "\"A twist on a recipe found on this site. Being from Louisiana where shrimp is plentiful and served often I really needed something new. Just found out how AWESOME and healthy asparagus is. Nice to have leftovers. If you want more shrimp, add more; I find the veggies fill the space, making it healthier.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 12 minutes; drain. Transfer to a large mixing bowl.\nMelt butter with olive oil in a large saucepan over medium-low heat. Cook and stir asparagus, red bell pepper, shallots, garlic, basil, red pepper flakes, and oregano in the butter mixture until the pepper is softened, about 5 minutes. Add shrimp and continue cooking until the shrimp are bright pink on the outside and the meat is no longer transparent in the center, 3 to 5 minutes more.\nPour shrimp and vegetable mixture over the spaghetti and toss to mix. Sprinkle Parmesan cheese over the pasta mixture and season with salt and pepper.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "3461252.jpg",
    "o": "",
    "st": "allrecipes"
}