{
    "id": 234646,
    "old_rating": "4.69231",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups whole wheat flour",
        "1 1/2 cups all-purpose flour",
        "5 teaspoons pumpkin pie spice",
        "2 teaspoons baking soda",
        "1 1/2 teaspoons salt",
        "1 (30 ounce) can pumpkin pie filling (such as Libby'sÂ®)",
        "3 cups white sugar, or more to taste",
        "1/2 cup vegetable oil",
        "1/2 cup water",
        "4 large eggs"
    ],
    "nut": [
        "Calories > 241 kcal",
        "Carbs > 46.1 g",
        "Cholesterol > 31 mg",
        "Fat > 5.7 g",
        "Protein > 3.3 g",
        "Sodium > 336 mg"
    ],
    "n": "Pumpkin Pie Muffins",
    "a": "PChicki",
    "r": "0",
    "s": 24,
    "des": "\"I made this recipe this fall when I was craving something seasonal. After trying other recipes that just lacked that homey pumpkin-pie taste, I decided to make my own. \n\nIt makes about 24 large muffins or 6 muffins and a loaf. Even though they last well in the refrigerator, you may want to halve the recipe for individuals or small families. Add some cream cheese frosting and they'd make great cupcakes.\"",
    "ins": "Preheat oven to 330 degrees F (166 degrees C). Grease 24 muffin cups or line with paper liners.\nMix whole wheat flour, all-purpose flour, pumpkin pie spice, baking soda, and salt together in a large bowl. Whisk pumpkin pie filling, sugar, oil, water, and eggs together in a separate bowl until just mixed. Stir flour mixture, about 1/4 cup at a time, into pumpkin mixture until batter is just combined. Fill muffin cups with batter just below the brims.\nBake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, about 30 minutes. Cool muffins on a wire rack.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "1054898.jpg",
    "o": "4162516.jpg,4152149.jpg,4028546.jpg,3972882.jpg,3218912.jpg,2625975.jpg",
    "st": "allrecipes"
}