{
    "id": 234616,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "12 fresh zucchini blossoms",
        "3/4 cup soft goat cheese at room temperature",
        "1 egg yolk",
        "1/4 cup shredded Gruyere cheese",
        "1 pinch freshly ground black pepper, or to taste",
        "1 pinch cayenne pepper",
        "Batter:",
        "1 cup self-rising flour",
        "1/2 cup cornstarch",
        "1/4 cup ice-cold water, or as needed",
        "vegetable oil for frying",
        "1 teaspoon all-purpose flour, or as needed"
    ],
    "nut": [
        "Calories > 156 kcal",
        "Carbs > 13.3 g",
        "Cholesterol > 31 mg",
        "Fat > 9.1 g",
        "Protein > 5 g",
        "Sodium > 214 mg"
    ],
    "n": "Fried Stuffed Squash Blossoms",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"If you have a garden and you planted zucchini, you will have an abundance of squash blossoms. These are just amazing, with that tangy goat cheese filling and that batter: so simple, light, and crisp.\"",
    "ins": "Bring a pot of lightly salted water to a boil. Prepare a large bowl of ice-cold water. Drop squash blossoms into the boiling water until slightly wilted, 30 to 45 seconds; transfer immediately into the cold water to chill. Remove to paper towels to drain.\nMix goat cheese, egg yolk, Gruyere cheese, black pepper, and cayenne pepper together in a bowl; stir until smooth. Spoon filling into a heavy, resealable 1-quart plastic bag, squeeze out the air, and seal the bag. Cut a small corner off the bag.\nGently insert the cut corner of the bag all the way to the bottom of the open end of a blossom and pipe about 1 tablespoon of filling inside. Pick up petals and drape them up over the filling, covering filling completely. Fold any excess petals over the top of the filled blossom to keep them out of the way. Refrigerate filled squash blossoms until cheese is set and firm, at least 30 minutes.\nCombine self-rising flour and cornstarch in a mixing bowl; whisk in ice-cold water, a little at a time, until batter is smooth and has the thickness of pancake batter.\nPour vegetable oil to a depth of 1 inch into a heavy skillet (such as a cast iron pan) and place over medium heat. Heat oil until a thermometer placed into the oil, not touching the bottom, reads 350 degrees F (175 degrees C). A drop of batter carefully dripped into the oil should sizzle immediately.\nRemove squash blossoms from refrigerator and dust lightly with all-purpose flour on all sides. Shake off excess flour and dip blossoms in batter. Let excess batter drip off.\nGently lay coated squash blossoms in the hot oil on their sides; cook about 6 at a time until pale golden brown, 1 minute on the first side and 30 seconds to 1 minute on the remaining sides. Let cool slightly before serving.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}