{
    "id": 234683,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 (17.5 ounce) package frozen puff pastry",
        "2 teaspoons olive oil (preferably drained from a tin of anchovies)",
        "1 pinch salt and freshly ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "1/4 cup shredded sharp white Cheddar cheese",
        "5 tablespoons freshly shredded Parmigiano-Reggiano cheese, divided"
    ],
    "nut": [
        "Calories > 184 kcal",
        "Carbs > 12.4 g",
        "Cholesterol > 5 mg",
        "Fat > 13.2 g",
        "Protein > 3.8 g",
        "Sodium > 134 mg"
    ],
    "n": "How to Make Cheese Sticks",
    "a": "Chef John",
    "r": "0",
    "s": 9,
    "des": "\"These super-simple breadsticks are easy, cheesy, and there's no dough to make because we're going to use frozen puff pastry for this. They're very cool for entertaining.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper or a silicone baking mat.\nPlace a sheet of frozen puff pastry dough onto a floured work surface and allow dough to thaw just until it can be unfolded. Unfold dough into a flat sheet; brush top of puff pastry dough with olive oil. Season with salt, black pepper, and cayenne pepper.\nSprinkle white Cheddar cheese and 1/4 cup Parmigiano-Reggiano cheese onto the dough, covering the surface. Top with a piece of plastic wrap; press cheese and seasonings firmly into the dough with your fingers or by laying a sheet pan onto the dough over the plastic and pressing it down.\nRemove plastic and use a pizza cutter or sharp knife to cut the dough down the seam lines into thirds; cut each third lengthwise into thirds for a total of 9 breadsticks.\nPick up a dough strip, place it seasoned side down on the work surface, and twist from both ends 8 or 9 times to make a rolled tube of dough with the seasoned side out. Place breadsticks onto prepared baking sheet.\nSprinkle remaining 1 tablespoon Parmigiano-Reggiano cheese over the sticks. Roll the sticks lightly to even up their shapes and pick up and press any dropped cheese onto the surfaces.\nBake in the preheated oven for about 10 minutes; flip and continue baking until breadsticks are browned and crisp, 10 to 20 more minutes. If you pick up a stick by one end and it droops, bake for several more minutes. Cool on a wire rack before serving.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "1 h",
    "i": "3911931.jpg",
    "o": "3911931.jpg,2465789.jpg,2235761.jpg,2203920.jpg,1767964.jpg,1089214.jpg",
    "st": "allrecipes"
}