{
    "id": 234682,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 3/4 cups milk",
        "1 cup white cornmeal",
        "2 tablespoons butter, softened",
        "1 teaspoon salt",
        "4 large eggs, separated",
        "1 tablespoon white sugar",
        "1/2 teaspoon cream of tartar",
        "1/8 teaspoon cream of tartar",
        "1 pinch salt"
    ],
    "nut": [
        "Calories > 220 kcal",
        "Carbs > 23.4 g",
        "Cholesterol > 143 mg",
        "Fat > 10.1 g",
        "Protein > 9.6 g",
        "Sodium > 515 mg"
    ],
    "n": "Traditional Appalachian Spoon Bread",
    "a": "GagesMom2",
    "r": "0",
    "s": 6,
    "des": "\"Creamy and comforting side dish that goes well with a hearty beef stew or winter-time soup. My grandfather made this and shared his recipe with me. Dish out with a spoon and serve with plenty of real butter. Enjoy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease an oven-proof cast iron Dutch oven or a deep baking dish.\nHeat milk and cornmeal in the top of a double boiler over simmering water, stirring frequently, until thick and creamy, about 5 minutes. Remove cornmeal mixture from heat and stir in butter and 1 teaspoon salt until well combined.\nBeat egg yolks, sugar, and 1/2 teaspoon cream of tartar together in a bowl until smooth; stir into cornmeal mixture.\nBeat egg whites, 1/8 teaspoon cream of tartar, and 1 pinch salt together in a separate bowl using an electric mixer until soft peaks form. Lift your beater or whisk straight up: the egg whites will form soft mounds rather than a sharp peak. Gently fold egg white mixture into cornmeal mixture until well mixed and fluffy; pour into prepared Dutch oven.\nBake in the preheated oven until golden brown with a moist center, about 30 minutes. Allow to rest for 10 to 15 minutes before serving.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}