{
    "id": 234757,
    "old_rating": "4.7619",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 fresh bratwurst sausages",
        "2 tablespoons olive oil",
        "2 onions, chopped",
        "4 carrots, sliced",
        "4 ribs celery, chopped",
        "2 teaspoons chopped garlic",
        "2 (32 ounce) cartons chicken broth",
        "1 (14.5 ounce) can diced tomatoes",
        "1 cup chopped fresh basil",
        "1/4 cup chopped fresh flat-leaf parsley",
        "2 teaspoons ground thyme",
        "1/2 teaspoon cayenne pepper",
        "6 potatoes, cut into cubes",
        "2 (15 ounce) cans cannellini beans, drained and rinsed",
        "12 ounces spinach, coarsely chopped, or more to taste"
    ],
    "nut": [
        "Calories > 334 kcal",
        "Carbs > 39.6 g",
        "Cholesterol > 27 mg",
        "Fat > 13.9 g",
        "Protein > 12.3 g",
        "Sodium > 1347 mg"
    ],
    "n": "Bratwurst Soup",
    "a": "Barry Heuser",
    "r": "0",
    "s": 12,
    "des": "\"This is a hearty, filling, cold-weather soup that makes a meal served with a crusty bread and light salad. The soup is just not the same if the brats are not grilled.\"",
    "ins": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nGrill bratwursts until cooked through, about 5 minutes per side. Cool. Slice each bratwurst into 1/4-inch pieces.\nHeat olive oil in a large pot over medium-high heat. Cook and stir onion, carrots, and celery in hot oil until onions are tender, 5 to 8 minutes. Stir garlic into onion mixture and cook until garlic is fragrant, 1 minute.\nStir chicken broth, tomatoes, sliced bratwurst, basil, parsley, thyme, and cayenne pepper into onion mixture. Bring to a boil, reduce heat to low, cover, and simmer for 20 minutes.\nMix potatoes into bratwurst mixture, bring to a boil, reduce heat to low and simmer until potatoes are almost cooked through, 15 minutes.\nStir beans and spinach into pot; simmer until heated through and potatoes are done, 5 to 10 minutes.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4258383.jpg",
    "o": "4156164.jpg,4125135.jpg,3798091.jpg,3566606.jpg,3363293.jpg,2832191.jpg",
    "st": "allrecipes"
}