{
    "id": 234797,
    "old_rating": "4.61111",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 (16 ounce) package spaghetti",
        "6 tablespoons butter",
        "3 cups sliced fresh mushrooms",
        "1 cup chopped onion",
        "1 cup chopped celery",
        "1 (14 ounce) can diced tomatoes, drained",
        "2 (10.75 ounce) cans cream of mushroom soup",
        "1 cup chicken broth",
        "1 (4 ounce) can chopped green chiles (such as Old El PasoÂ®), drained",
        "1/2 cup sour cream",
        "1 teaspoon seasoned salt",
        "1/4 teaspoon cayenne pepper",
        "salt and ground black pepper to taste",
        "3 1/2 cups chopped cooked chicken",
        "2 cups shredded sharp white Cheddar cheese",
        "3/4 cup panko bread crumbs",
        "2 tablespoons melted butter"
    ],
    "nut": [
        "Calories > 711 kcal",
        "Carbs > 60.8 g",
        "Cholesterol > 115 mg",
        "Fat > 37.5 g",
        "Protein > 34.1 g",
        "Sodium > 1341 mg"
    ],
    "n": "Baked Chicken Spaghetti",
    "a": "SUNKIST2",
    "r": "0",
    "s": 8,
    "des": "\"Creamy, cheesy spaghetti baked with chicken. Comfort food to please everyone! Substitute diced zucchini, asparagus, and red and green peppers as you see fit.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Prepare a 13x9-inch baking dish with cooking spray.\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain.\nMelt 6 tablespoons butter in a skillet over medium-high heat. Cook and stir mushrooms, onion, and celery in melted butter until just tender, 5 to 6 minutes; transfer to a large bowl.\nStir diced tomatoes, cream of mushroom soup, chicken broth, chopped green chiles, sour cream, seasoned salt, cayenne pepper, salt, and black pepper into the mushroom mixture. Add chicken and Cheddar cheese; stir. Gently toss the pasta with the mixture to coat the pasta completely; transfer to the prepared baking dish.\nMix bread crumbs and melted butter in a small bowl; sprinkle evenly over the pasta mixture.\nBake in preheated oven until hot and bubbly, 30 to 40 minutes.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1069635.jpg",
    "o": "",
    "st": "allrecipes"
}