{
    "id": 234714,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 cups finely chopped green tomatoes",
        "4 cups white sugar",
        "2 cups frozen raspberries",
        "2 jalapeno peppers, finely chopped",
        "1 (6 ounce) package raspberry-flavored gelatin mix (such as Jell-OÂ®)"
    ],
    "nut": [
        "Calories > 44 kcal",
        "Carbs > 11.2 g",
        "Cholesterol > 0 mg",
        "Fat > 0 g",
        "Protein > 0.3 g",
        "Sodium > 7 mg"
    ],
    "n": "Green Tomato Jelly",
    "a": "Lisa",
    "r": "0",
    "s": 100,
    "des": "\"A deceiving raspberry pepper jelly made from green tomatoes! We serve this with cream cheese for an appetizer, but it is also good over grilled fish or chicken.\"",
    "ins": "Combine green tomatoes, sugar, raspberries, and jalapeno peppers together in a saucepan; cook and stir until sugar is dissolved and raspberries and tomatoes are broken down, about 15 minutes. Remove saucepan from heat and stir in gelatin mix until well blended.\nPour tomato-raspberry mixture into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack tomato-raspberry mixture into hot, sterilized jars, filling to within 1/4-inch of the top. Run a knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "2615489.jpg",
    "o": "",
    "st": "allrecipes"
}