{
    "id": 234762,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 quart strawberries, hulled and sliced",
        "1 cup white sugar, divided",
        "1 tablespoon lemon juice",
        "2 cups heavy whipping cream, divided",
        "1 cup whole milk",
        "6 egg yolks",
        "1 teaspoon vanilla extract",
        "1 pinch salt",
        "8 ounces dark chocolate chips",
        "ice cubes"
    ],
    "nut": [
        "Calories > 260 kcal",
        "Carbs > 26.8 g",
        "Cholesterol > 119 mg",
        "Fat > 17 g",
        "Protein > 3.1 g",
        "Sodium > 50 mg"
    ],
    "n": "Strawberry Chocolate Chip Ice Cream",
    "a": "Rose",
    "r": "0",
    "s": 16,
    "des": "\"Strawberry ice cream and dark chocolate chips.\"",
    "ins": "Blend strawberries, 1/4 cup sugar, and lemon juice in a food processor until strawberries are coarsely chopped. Transfer mixture to a bowl and refrigerate until chilled, about 1 hour.\nHeat 1 cup heavy cream, milk, and 3/4 cup sugar in a saucepan over medium-low heat until warmed through and sugar is dissolved, about 5 minutes; remove from heat, cover, and allow cream mixture to cool for 30 minutes.\nWhisk egg yolks together in a bowl. Slowly pour the warm cream mixture into the egg yolks, whisking constantly. Transfer warmed egg mixture back to the saucepan.\nHeat egg yolk mixture over medium heat, constantly stirring and scraping the bottom of the saucepan, until custard thickens enough to coat the back of a spatula, about 5 minutes.\nPour remaining 1 cup heavy cream into a large bowl and set a strainer atop the bowl. Slowly pour custard through strainer and stir. Add vanilla extract and salt. Stir chilled strawberry mixture and chocolate chips into custard.\nPlace ice cubes into a large bowl and add water; stir. Place the bowl of strawberry-chocolate mixture into the ice bath and allow mixture to cool to room temperature, stirring occasionally, about 10 minutes; remove bowl from ice bath and cover with plastic wrap. Refrigerate until well chilled, 8 hours to overnight.\nPour chilled mixture into an ice cream maker and freeze according to manufacturer's directions until it reaches \"soft-serve\" consistency. Transfer ice cream to a lidded container. Cover surface with plastic wrap and seal. For best results, ice cream should ripen in the freezer for at least 2 hours or overnight.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "12 h ",
    "i": "1358945.jpg",
    "o": "",
    "st": "allrecipes"
}