{
    "id": 234758,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon olive oil, or as needed",
        "6 tablespoons butter, melted",
        "2 teaspoons roasted garlic, mashed into a paste",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon oregano",
        "1/2 teaspoon Italian seasoning",
        "1/2 teaspoon dried parsley flakes",
        "1/4 teaspoon salt",
        "4 tilapia fillets",
        "1 teaspoon lemon juice, or to taste"
    ],
    "nut": [
        "Calories > 280 kcal",
        "Carbs > 1.1 g",
        "Cholesterol > 87 mg",
        "Fat > 20 g",
        "Protein > 23.3 g",
        "Sodium > 318 mg"
    ],
    "n": "Herb Crusted Tilapia with Garlic Butter",
    "a": "ChefMom",
    "r": "0",
    "s": 4,
    "des": "\"Broiled tilapia crusted in herb and drizzled with garlic butter is simply divine in this gluten-free nightshade-free dish. If your diet allows, I highly recommend adding 1/2 teaspoon onion powder to the seasoning mix.\"",
    "ins": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Brush a broiler pan with olive oil.\nStir butter and garlic paste together in a bowl. Divide garlic mixture evenly between two bowls, reserving one bowl for serving.\nStir garlic powder, oregano, Italian seasoning, parsley, and salt together in a bowl.\nPlace tilapia fillets on prepared broiler pan; brush each fillet with garlic butter and sprinkle each with Italian seasoning mixture, reserving 1/2 the garlic butter in the bowl and 1/2 the Italian seasoning mixture.\nBroil fillets in the preheated oven for 2 minutes, brush again with garlic butter, and broil for 2 more minutes. Turn fillets over. Brush with garlic butter and sprinkle with remaining Italian seasoning mixture. Broil until tilapia fillets flake easily with a fork, 3 to 5 minutes. Serve with reserved garlic butter and lemon juice.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "20 m",
    "i": "4048713.jpg",
    "o": "",
    "st": "allrecipes"
}