{
    "id": 234781,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Braised Short Ribs:",
        "6 bone-in beef short ribs",
        "kosher salt",
        "extra virgin olive oil",
        "1 large Spanish onion, cut into 1/2-inch pieces",
        "2 celery ribs, cut into 1/2-inch pieces",
        "2 carrots, peeled, cut in half lengthwise, then cut into 1/2-inch pieces",
        "2 garlic cloves, smashed",
        "1 1/2 cups tomato paste",
        "2 cups hearty red wine, or more to taste",
        "2 cups water",
        "1 bunch fresh thyme, tied with kitchen string",
        "2 bay leaves",
        "Roasted Garlic Horseradish Mashed:",
        "1 (4 ounce) package IdahoanÂ® Roasted Garlic Flavored Mashed Potatoes, prepared",
        "2 teaspoons prepared horseradish sauce"
    ],
    "nut": [
        "Calories > 751 kcal",
        "Carbs > 23.4 g",
        "Cholesterol > 116 mg",
        "Fat > 53.3 g",
        "Protein > 31.1 g",
        "Sodium > 752 mg"
    ],
    "n": "Braised Short Ribs with Roasted Garlic Horseradish Mashed",
    "a": "Idahoan",
    "r": "0",
    "s": 6,
    "des": "\"Beef short ribs are braised for hours with wine and vegetables in the oven until tender and flavorful, then served with horseradish mashed potatoes for a hearty meal perfect for cooler weather.\"",
    "ins": "Braised Short Ribs: Season each short rib generously with salt. Coat a pot large enough to accommodate all the meat and vegetables with olive oil and bring to a high heat.\nAdd the short ribs to the pan and brown very well, about 2 to 3 minutes per side. Do not overcrowd pan. Cook in batches, if necessary.\nPreheat the oven to 375 degrees F.\nWhile the short ribs are browning, puree all the vegetables and garlic in the food processor until it forms a coarse paste.\nWhen the short ribs are very brown on all sides, remove them from the pan.\nDrain the fat, coat the bottom of same pan with fresh oil and add the pureed vegetables.\nSeason the vegetables generously with salt and brown until they are very dark and a crud has formed on the bottom of the pan, approximately 5 to 7 minutes.\nScrape the crud and let it reform.\nScrape the crud again and add the tomato paste.\nBrown the tomato paste for 4 to 5 minutes.\nAdd the wine and scrape the bottom of the pan.\nLower the heat if things start to burn. Reduce the mixture by half.\nReturn the short ribs to the pan and add 2 cups water or until the water has just about covered the meat.\nAdd the thyme bundle and bay leaves.\nCover the pan and place in the preheated oven for 3 hours.\nCheck periodically during the cooking process and add more water, if needed.\nTurn the ribs over halfway through the cooking time.\nRemove lid during the last 20 minutes of cooking to let things get nice and brown and to let the sauce reduce. Serve with the braising liquid.\nRoasted Garlic Horseradish Mashed: Blend the potatoes and horseradish together and serve with the short ribs.",
    "pt": "15 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "1052973.jpg",
    "o": "",
    "st": "allrecipes"
}