{
    "id": 234820,
    "old_rating": "4.55556",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup unsalted butter, softened",
        "1 cup packed brown sugar",
        "1/2 cup granulated sugar",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "2 teaspoons ground cinnamon",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "2 3/4 cups all-purpose flour",
        "2 1/2 cups Ghirardelli 60% Cacao Bittersweet Chocolate Baking Chips, divided",
        "1 teaspoon shortening"
    ],
    "nut": [
        "Calories > 90 kcal",
        "Carbs > 11.1 g",
        "Cholesterol > 12 mg",
        "Fat > 5.1 g",
        "Protein > 1.1 g",
        "Sodium > 28 mg"
    ],
    "n": "Cinnamon Chocolate Chip Cookies from GhirardelliÂ®",
    "a": "Ghirardelli",
    "r": "0",
    "s": 72,
    "des": "\"Loaded with cacao bittersweet chocolate chips, these cinnamon cookies drizzled with even more chocolate are perfect with coffee, tea, or a frosty glass of milk.\"",
    "ins": "Preheat oven to 375 degrees F. In a large bowl, beat butter with an electric mixer on medium to high speed for 30 seconds. Add brown sugar, granulated sugar, baking soda, salt, and cinnamon. Beat until combined, scraping bowl occasionally. Beat in eggs and vanilla until combined. Beat in as much of the flour as you can with the mixer. Stir in any remaining flour with a spatula or wooden spoon. Stir in the 2 cups Ghirardelli(R) 60% Cacao Bittersweet Chocolate Baking Chips.\nShape dough into 1-inch balls and place 2 inches apart onto an ungreased baking sheet. Bake for 6 to 8 minutes or just until edges are lightly browned. Cool on cookie sheet for 2 minutes. Transfer to wire racks; cool completely.\nFor chocolate drizzle, in a small microwave-safe bowl, combine the 1/2 cup Ghirardelli 60% Cacao Bittersweet Chocolate Baking Chips and the shortening. Microwave on medium power (50 percent) for 1 minute. Remove and stir. If chocolate is not melted, return to microwave and repeat heating step, stirring every 30 seconds to avoid scorching. Stir until smooth. Drizzle over cookies.\nEnjoy immediately, store in an airtight container at room temperature for up to 1 week, or freeze for up to 3 months.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}