{
    "id": 234800,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups elbow macaroni",
        "1 tablespoon butter, or to taste",
        "1 (1 pound) package smoked sausage, sliced",
        "1/2 cup diced onion",
        "1 (14.5 ounce) can diced tomatoes",
        "1/2 cup diced green bell pepper",
        "1/2 cup diced yellow bell pepper",
        "1/2 cup diced orange bell pepper",
        "1/2 cup diced red bell pepper",
        "1 teaspoon dried basil",
        "1 teaspoon dried thyme",
        "1 teaspoon dried oregano",
        "12 ounces processed cheese food (such as VelveetaÂ®), cut into 1/2-inch cubes"
    ],
    "nut": [
        "Calories > 495 kcal",
        "Carbs > 29.2 g",
        "Cholesterol > 76 mg",
        "Fat > 30.5 g",
        "Protein > 24.7 g",
        "Sodium > 1476 mg"
    ],
    "n": "Sausage and Macaroni Bake",
    "a": "curtisfamily",
    "r": "0",
    "s": 8,
    "des": "\"Tasty treat we tried out, inspired by a recipe found up here.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally, until cooked through but firm to the bite, 8 minutes; drain.\nMelt butter in a separate pot over medium heat. Cook and stir sausage and onion in melted butter until the onion is translucent, 5 to 7 minutes.\nStir tomatoes, green bell pepper, yellow bell pepper, orange bell pepper, red bell pepper, basil, thyme, and oregano into the sausage mixture; continue to cook and stir until the peppers have softened, 5 to 7 minutes. Add drained macaroni; bring to a simmer and cook another 5 minutes. Pour the mixture into a 2-quart casserole dish and top with cheese cubes.\nBake in preheated oven until the cheese has melted, about 5 minutes. Stir melted cheese through the macaroni mixture, pat the mixture down into a flat layer, and continue baking until heated through, 10 to 15 minutes more.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "3891603.jpg",
    "o": "",
    "st": "allrecipes"
}