{
    "id": 234835,
    "old_rating": "3.375",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound green chile peppers, sliced in half lengthwise and seeded",
        "3 tablespoons olive oil",
        "1/2 onion, chopped",
        "2 tablespoons minced garlic",
        "1 pound boneless pork loin, cut into 1-inch cubes",
        "1 (29 ounce) can white hominy, drained",
        "1 (29 ounce) can yellow hominy, drained",
        "3 cups chicken broth",
        "1 1/2 cups water",
        "1/4 cup ground cumin",
        "1/4 cup chili powder",
        "3 tablespoons salt",
        "1 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 323 kcal",
        "Carbs > 38.1 g",
        "Cholesterol > 29 mg",
        "Fat > 13 g",
        "Protein > 14.4 g",
        "Sodium > 3474 mg"
    ],
    "n": "Traditional Pork Posole",
    "a": "mic_babe",
    "r": "0",
    "s": 8,
    "des": "\"Traditional New Mexican spicy stew. Red chile and pork come together with hominy to warm your belly and your palate. Serve with tortillas or corn bread.\"",
    "ins": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.\nPlace the peppers with cut sides down onto the prepared baking sheet.\nCook under the preheated broiler until the skin of the peppers has blackened and blistered, 5 to 8 minutes. Place the blackened peppers into a bowl and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 20 minutes. Remove plastic wrap and carefully remove and discard pepper skins. Dice peppers.\nHeat olive oil in a large pot over medium-high heat. Cook and stir onion and garlic in hot oil until tender and fragrant, 5 to 10 minutes.\nStir pork into onion and garlic; cook and stir until pork is browned, 5 to 10 minutes. Add diced green chiles to pork; cook and stir until fragrant, 5 minutes.\nPour white hominy, yellow hominy, chicken broth, water, cumin, chili powder, salt, and black pepper into pork mixture. Bring mixture to a boil and cook for 15 minutes; reduce heat to medium-low and simmer until flavors blend and pork is tender, at least 1 hour.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "4106138.jpg",
    "o": "",
    "st": "allrecipes"
}