{
    "id": 234894,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Rolls:",
        "4 cups boiling water",
        "2 cups rolled oats",
        "1 1/3 cups brown sugar",
        "6 tablespoons vegetable oil",
        "2 (.25 ounce) packages active dry yeast",
        "2/3 cup lukewarm water",
        "4 teaspoons salt",
        "8 cups all-purpose flour, or more as needed",
        "Honey Butter:",
        "1 cup butter, softened",
        "3 tablespoons honey",
        "1/8 teaspoon ground cinnamon"
    ],
    "nut": [
        "Calories > 316 kcal",
        "Carbs > 46.7 g",
        "Cholesterol > 20 mg",
        "Fat > 12 g",
        "Protein > 5.5 g",
        "Sodium > 447 mg"
    ],
    "n": "Oatmeal Rolls with Honey Butter",
    "a": "trish1870",
    "r": "0",
    "s": 24,
    "des": "\"This is a homemade roll recipe from my sister's mother-in-law. I make these for every holiday or special meal and my family wouldn't have it any other way! They are the best served with the honey butter.\"",
    "ins": "Stir boiling water and oats together in a bowl; set aside to thicken and cool, 10 to 15 minutes. Stir brown sugar and vegetable oil into oat mixture.\nDissolve yeast in lukewarm water in a bowl. Let stand until the yeast softens and begins to form a creamy foam, about 5 minutes. Stir yeast mixture and salt into oat mixture. Beat flour, 1 cup at a time, into oat mixture until dough is soft. Turn dough onto a floured surface and knead for 10 minutes.\nPlace dough in an oiled bowl and cover with a damp towel; let rise until doubled in size, about 1 hour.\nPunch dough down and form into rolls; arrange on baking sheets. Let rise again until doubled in size, about 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBake rolls in the preheated oven until lightly browned, 20 to 25 minutes.\nBeat butter, honey, and cinnamon together in a bowl using an electric mixer until creamy and smooth. Serve honey butter with rolls.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "1060315.jpg",
    "o": "",
    "st": "allrecipes"
}