{
    "id": 234805,
    "old_rating": "4.82716",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Sweet potatoes:",
        "2 1/2 pounds sweet potatoes, peeled and cubed",
        "salt",
        "2 tablespoons butter",
        "2 large eggs",
        "1/4 cup maple syrup",
        "1/4 cup buttermilk",
        "1/3 cup milk",
        "1/2 teaspoon vanilla extract",
        "1/2 teaspoon salt",
        "1 pinch ground allspice",
        "1 pinch cayenne pepper",
        "Pistachio crust:",
        "1/2 cup chopped roasted, salted pistachios",
        "1/2 cup light brown sugar",
        "1/3 cup all-purpose flour",
        "1/4 cup butter, melted"
    ],
    "nut": [
        "Calories > 368 kcal",
        "Carbs > 55.9 g",
        "Cholesterol > 71 mg",
        "Fat > 14 g",
        "Protein > 6.7 g",
        "Sodium > 353 mg"
    ],
    "n": "Chef John's Sweet Potato Casserole",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"Unlike many sweet potato casseroles, this one is not too sweet. It smells so amazing, with subtly sweet potatoes accentuated with maple syrup and a pistachio topping. It's a wonderful combination of taste and textures.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 1/2-quart baking dish with butter.\nPlace sweet potato cubes into a large pot, cover with water, and add a large pinch of salt. Bring to a boil and cook until a knife is easily inserted into a sweet potato cube, about 10 minutes. Drain well. Return to the pot and mash 2 tablespoons butter into sweet potatoes.\nWhisk eggs, maple syrup, buttermilk, milk, vanilla extract, cayenne pepper, allspice, and 1/2 teaspoon salt together in a large bowl until smooth. Gradually mash sweet potatoes into egg mixture, starting with 2 tablespoons of sweet potato mixture, until all sweet potatoes are incorporated. Transfer sweet potatoes into prepared baking dish.\nMix pistachios, brown sugar, flour, and 1/4 cup melted butter together until completely mixed. Crumble topping evenly over top of sweet potatoes. Use the back of a fork to gently press pistachio mixture down onto sweet potatoes.\nBake in the preheated oven until topping is browned and casserole is set, 25 to 30 minutes. If desired, place under oven's broiler for 5 minutes to give topping a little more brown color. Let rest to cool slightly before serving, about 10 minutes.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}