{
    "id": 234915,
    "old_rating": "4.30667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2/3 cup olive oil",
        "1/4 cup red wine vinegar",
        "20 cloves garlic",
        "1 teaspoon dried thyme",
        "1 teaspoon dried rosemary",
        "1 teaspoon dried oregano",
        "1/2 teaspoon red pepper flakes",
        "1 large whole chicken, cut into 6 serving pieces",
        "1 teaspoon olive oil, or as needed",
        "1 pinch salt and freshly ground black pepper to taste",
        "2 tablespoons chopped fresh Italian parsley (optional)"
    ],
    "nut": [
        "Calories > 525 kcal",
        "Carbs > 4.7 g",
        "Cholesterol > 97 mg",
        "Fat > 42.1 g",
        "Protein > 31.4 g",
        "Sodium > 122 mg"
    ],
    "n": "Chicken with 20 Cloves of Garlic",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"There's a famous recipe called Chicken with 40 Cloves of Garlic; this one is twice as good! We're going to cook chicken in a garlic marinade and a glaze. This is for garlic lovers only.\"",
    "ins": "Pour olive oil into blender and add red wine vinegar, garlic, thyme, rosemary, oregano, and red pepper flakes. Blend until garlic marinade is smooth and creamy.\nCut several deep slashes into the meat of each chicken piece using a sharp knife. Place chicken into a large bowl, pour marinade over chicken, and stir to get marinade into the cuts and all over the chicken. Cover bowl with plastic wrap and refrigerate overnight.\nPreheat oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil. Lightly grease the foil with 1 teaspoon olive oil.\nArrange chicken pieces onto the prepared baking sheet and season both sides of chicken with salt and black pepper.\nBake in the preheated oven until an instant-read meat thermometer inserted into the thickest piece of chicken reads 160 degrees F (70 degrees C), 40 to 45 minutes. Top with chopped Italian parsley.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "9 h",
    "i": "4473380.jpg",
    "o": "4473380.jpg,4447282.jpg,3940315.jpg,1478845.jpg,1192665.jpg,1192627.jpg",
    "st": "allrecipes"
}