{
    "id": 234956,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "4 cups all-purpose flour",
        "2 tablespoons baking powder",
        "3/4 teaspoon salt",
        "2 1/2 cups white sugar",
        "2 cups butter, at room temperature",
        "2/3 cup milk",
        "5 eggs",
        "1 1/2 teaspoons vanilla extract",
        "6 snack-size chocolate-covered wafer candy bars (such as Kit KatÂ®), coarsely chopped, or more to taste",
        "1 tablespoon all-purpose flour",
        "Frosting:",
        "1/4 cup white sugar",
        "1/4 cup evaporated milk",
        "1/4 cup butter",
        "1/4 cup chocolate chips",
        "1/2 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 545 kcal",
        "Carbs > 64.2 g",
        "Cholesterol > 129 mg",
        "Fat > 30 g",
        "Protein > 6.5 g",
        "Sodium > 509 mg"
    ],
    "n": "Kit KatÂ® BundtÂ® Cake",
    "a": "KELSEYANDTYLERSMOMMY",
    "r": "0",
    "s": 16,
    "des": "\"I always have tons of Halloween candy from my kids and this is a great way to use up Kit KatsÂ®. I served this at Thanksgiving for those who didn't want pie. Everybody loved this cake. Frosting will be like a syrup but will thicken as it cools.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray the inside of a fluted tube pan (such as Bundt(R)) with cooking spray.\nCombine 4 cups flour, baking powder, and salt together in the bowl of a stand mixer. Add 2 cups softened butter, milk, eggs, and 1 1/2 teaspoons vanilla extract to flour mixture; lightly stir with a spatula to moisten ingredients. Mix on low speed until batter is evenly combined, about 3 minutes.\nToss candy bar pieces with remaining 1 tablespoon flour in a bowl until coated; fold into batter. Spread batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted in the cake comes out moist with crumbs clinging, about 1 hour. Cool in pan for 25 minutes; remove from pan and cool completely on a wire rack.\nCombine 1/4 cup white sugar, evaporated milk, 1/4 cup butter, chocolate chips, and 1/2 teaspoon vanilla extract together in a saucepan; bring to a boil, stirring constantly. Reduce heat and simmer until frosting is thickened, about 5 minutes. Pour frosting over cake.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1305919.jpg",
    "o": "",
    "st": "allrecipes"
}