{
    "id": 234932,
    "old_rating": "4.85965",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "2 slices bacon, coarsely chopped",
        "1 1/2 pounds pork shoulder, cut into 2-inch chunks",
        "salt and freshly ground black pepper to taste",
        "1 small yellow onion, diced",
        "4 cloves garlic, sliced",
        "1 1/4 cups chicken broth",
        "1/2 cup creme fraiche",
        "2 tablespoons chopped fresh sage leaves",
        "1 pinch red pepper flakes, or to taste",
        "1/4 cup olive oil",
        "15 whole fresh sage leaves"
    ],
    "nut": [
        "Calories > 512 kcal",
        "Carbs > 4.6 g",
        "Cholesterol > 114 mg",
        "Fat > 46.2 g",
        "Protein > 20.8 g",
        "Sodium > 466 mg"
    ],
    "n": "Chef John's Pork al Latte",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"When the weather gets a little colder, this pork stew really hits the spot. Pork shoulder meat is braised in a creme fraiche sauce until amazingly tender and delicious. Serve on polenta with crisp sage leaves for garnish.\"",
    "ins": "Pour 1 tablespoon olive oil into a skillet, place over medium heat, and cook bacon, stirring often, until crisp and bacon fat has rendered into the skillet, about 5 minutes.\nSeason pork cubes generously with salt and black pepper. Remove bacon from pan and set aside, reserving fat in pan. Turn heat to medium-high and brown pork pieces in bacon drippings until well browned on both sides, about 5 minutes per side. Transfer meat to a bowl, leaving pan drippings in skillet.\nTurn heat to medium and stir in chopped onion and a pinch of salt. Cook and stir onion until translucent and slightly browned, about 5 minutes. Stir garlic into onion and cook until fragrant, about 1 minute.\nPour chicken broth and creme fraiche into onion mixture; whisk until smooth. Scrape up and dissolve any browned bits of food on the bottom of the skillet. Bring mixture to a simmer.\nReturn bacon to sauce and stir in 2 tablespoons chopped sage. Place pork pieces into simmering sauce along with any accumulated juices from the meat. Reduce heat to low, cover, and simmer until meat is almost tender, about 1 hour.\nRaise heat to medium and cook uncovered until pan sauce reduces and thickens and meat is very tender, about 20 more minutes. Stir red pepper flakes into sauce; adjust seasonings to taste.\nHeat 1/4 cup olive oil in a small skillet over medium heat; drop whole sage leaves into the hot oil and cook, lightly tossing leaves in the oil, until crisp, 10 to 15 seconds. Drain sage leaves on paper towels and crumble over pork.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4329188.jpg",
    "o": "4329188.jpg,4329179.jpg,4261054.jpg,4099497.jpg,3612838.jpg,3263299.jpg",
    "st": "allrecipes"
}