{
    "id": 234933,
    "old_rating": "4.91765",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups water",
        "1 teaspoon fine salt",
        "1 cup polenta",
        "3 tablespoons butter, divided",
        "1/2 cup freshly grated Parmigiano-Reggiano cheese, plus more for garnish"
    ],
    "nut": [
        "Calories > 291 kcal",
        "Carbs > 31 g",
        "Cholesterol > 33 mg",
        "Fat > 14.7 g",
        "Protein > 9.2 g",
        "Sodium > 1186 mg"
    ],
    "n": "How to Make Perfect Polenta",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Polenta is nothing more than coarsely ground cornmeal. The classic ratio is 1 part polenta to 4 parts water, but I like to measure the polenta just a little scant of a full cup. I often use chicken broth instead of water. It's a perfect base for any kind of saucy meat or mushroom ragout.\"",
    "ins": "Bring water and salt to a boil in a large saucepan; pour polenta slowly into boiling water, whisking constantly until all polenta is stirred in and there are no lumps.\nReduce heat to low and simmer, whisking often, until polenta starts to thicken, about 5 minutes. Polenta mixture should still be slightly loose. Cover and cook for 30 minutes, whisking every 5 to 6 minutes. When polenta is too thick to whisk, stir with a wooden spoon. Polenta is done when texture is creamy and the individual grains are tender.\nTurn off heat and gently stir 2 tablespoons butter into polenta until butter partially melts; mix  1/2 cup Parmigiano-Reggiano cheese into polenta until cheese has melted. Cover and let stand 5 minutes to thicken; stir and taste for salt before transferring to a serving bowl. Top polenta with remaining 1 tablespoon butter and about 1 tablespoon freshly grated Parmigiano-Reggiano cheese for garnish.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "4532630.jpg",
    "o": "4532630.jpg,4532627.jpg,4513431.jpg,3973832.jpg,3761930.jpg,1926506.jpg",
    "st": "allrecipes"
}