{
    "id": 234911,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound chorizo sausage",
        "5 slices bacon, finely chopped",
        "1/2 small onion, finely chopped",
        "3 cups cooked brown rice",
        "2 roasted Anaheim chile peppers, peeled and chopped",
        "1 (14.5 ounce) can petite diced tomatoes",
        "1 cup shredded Monterey Jack cheese",
        "1/4 cup salsa",
        "6 bell peppers, tops and seeds removed",
        "Green Chile Ranchero Sauce:",
        "1 (14.5 ounce) can green chile enchilada sauce",
        "1 tablespoon ranch dressing mix",
        "1/3 (16 ounce) container sour cream"
    ],
    "nut": [
        "Calories > 953 kcal",
        "Carbs > 92.2 g",
        "Cholesterol > 103 mg",
        "Fat > 47.5 g",
        "Protein > 36.8 g",
        "Sodium > 1952 mg"
    ],
    "n": "Chorizo-Stuffed Peppers with Green Chile Ranchero Sauce",
    "a": "Kristen Foery",
    "r": "0",
    "s": 6,
    "des": "\"A zesty alternative to stuffed peppers. Do not cook the sour cream in the sauce, as it will curdle.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat a large skillet over medium-high heat. Cook and stir chorizo, bacon, and onion in the hot skillet until the sausage and bacon are completely browned, 7 to 10 minutes. Drain and discard grease. Rinse mixture with hot water to remove as much grease as possible; drain.\nMix the chorizo mixture, rice, chile peppers, diced tomatoes, Monterey Jack cheese, and salsa together in a large bowl.\nArrange bell peppers in a baking dish. Spoon filling into the peppers. Place pepper tops on the stuffed peppers. Cover dish with aluminum foil.\nBake in preheated oven for 1 hour. Remove the foil and continue baking until the tops of the pepper and any exposed rice are slightly browned, about 30 minutes more.\nWhisk enchilada sauce and ranch dressing mix together in a microwave-safe bowl.\nHeat enchilada sauce mixture in microwave oven for 2 minutes.\nWhisk sour cream into the enchilada sauce mixture; drizzle over the stuffed peppers.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "1817570.jpg",
    "o": "",
    "st": "allrecipes"
}