{
    "id": 234938,
    "old_rating": "4.81522",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons olive oil",
        "2 (16 ounce) bags fresh spinach",
        "salt and freshly ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "1 pinch freshly grated nutmeg",
        "1 tablespoon butter",
        "2 tablespoons minced shallot",
        "3/4 cup heavy whipping cream",
        "1 teaspoon freshly grated lemon zest",
        "2 tablespoons finely shredded Parmigiano-Reggiano cheese (optional)"
    ],
    "nut": [
        "Calories > 179 kcal",
        "Carbs > 7.1 g",
        "Cholesterol > 47 mg",
        "Fat > 15.6 g",
        "Protein > 5.7 g",
        "Sodium > 173 mg"
    ],
    "n": "Fast and Easy Creamed Spinach",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"This is a little easier, a little quicker, a little more contemporary, and believe it or not, a little lighter than traditional creamed spinach. Have all your ingredients ready to go ahead of time. It's a classic steak side dish.\"",
    "ins": "Pour olive oil into a large soup pot, place over high heat, add spinach, and cover. Cook for 1 minute, uncover, and lightly stir until most of the leaves are bright green and wilted, about 2 minutes. Quickly drain spinach in a strainer and transfer to a plate lined with 4 or 5 paper towels. Once cool enough to handle, squeeze as much liquid from the spinach as possible. Transfer spinach to a cutting board and coarsely chop.\nMix salt, black pepper, cayenne pepper, and nutmeg in a small bowl.\nPlace a large skillet over medium heat, melt butter in skillet, and stir shallot in the hot butter until just barely golden and translucent, 3 to 4 minutes. Stir seasoning mixture into shallot mixture and pour in cream. Raise heat to medium-high and reduce cream sauce to about half, about 5 minutes. Stir in lemon zest.\nReduce heat to low and toss spinach with cream sauce in skillet. Cook and stir until spinach is heated through and coated, about 2 minutes. Stir Parmigiano-Reggiano cheese into spinach until thoroughly combined; serve immediately.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "4209403.jpg",
    "o": "4209403.jpg,3513436.jpg,2467796.jpg,2305901.jpg,2065403.jpg,1164672.jpg",
    "st": "allrecipes"
}