{
    "id": 234950,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Filling:",
        "12 potatoes",
        "2 pounds lean ground beef",
        "1/2 cup milk",
        "1 large onion, minced",
        "2 cloves garlic, minced",
        "1 pinch salt and ground black pepper",
        "Varenyky Dough:",
        "8 cups all-purpose flour",
        "4 teaspoons salt",
        "1 cup water",
        "4 eggs",
        "1 tablespoon water, or as needed (optional)"
    ],
    "nut": [
        "Calories > 326 kcal",
        "Carbs > 51.4 g",
        "Cholesterol > 54 mg",
        "Fat > 6.6 g",
        "Protein > 14.3 g",
        "Sodium > 430 mg"
    ],
    "n": "Babcha's Meat-Filled Varenyky (Perogies)",
    "a": "Kristy",
    "r": "0",
    "s": 24,
    "des": "\"This wonderful Ukrainian dish given to me by my husband's grandmother can be made with any kind of filling from meat, cheese, and fruit. It can be eaten warm or cold. The varenyky freeze very well. Just be sure to allow the varenyky to dry before freezing.\"",
    "ins": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain in a sieve or colander and rinse off excess fat with hot water.\nMash potatoes with milk in a bowl until smooth; stir in onion, garlic, 1 pinch salt, and pepper. Mix ground beef into potato mixture until filling is evenly combined.\nWhisk flour and 4 teaspoons salt together in a deep bowl; stir in 1 cup water and eggs until dough is soft. Turn dough onto a floured surface and knead until smooth, 1 to 2 minutes. Divide dough into 4 equal parts and arrange on a baking sheet; cover with a damp towel or plastic wrap and let stand for 10 minutes.\nRoll each piece of dough on a floured work surface until thin; cut into rounds using the rim of a large-mouth cup or large cookie cutter.\nSpoon 1 to 2 tablespoons filling onto each round. Fold dough over filling creating a 1/2 circle; press edges together, sealing with a dash of water if needed. Arrange varenyky in a single layer on plates and cover with a clean towel.\nBring a pot of lightly salted water to a boil; cook 2 to 3 varenyky at a time in boiling water until cooked through and dough is puffed, about 4 minutes. Remove varenyky with a slotted spoon and repeat with remaining varenyky.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}