{
    "id": 234994,
    "old_rating": "4.63636",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "1 1/4 cups chopped pecans, divided",
        "1 cup all-purpose flour",
        "1/2 cup butter, softened",
        "2 tablespoons white sugar",
        "1 tablespoon confectioners' sugar",
        "Cream Cheese Layer:",
        "1 (8 ounce) package cream cheese, softened",
        "3/4 cup confectioners' sugar",
        "2 (8 ounce) containers whipped topping (such as Cool WhipÂ®), divided",
        "Pumpkin Layer:",
        "1 1/2 cups canned pumpkin",
        "1 1/2 cups milk",
        "1/2 cup brown sugar",
        "2 (3 ounce) packages instant vanilla pudding mix",
        "1 3/4 teaspoons pumpkin pie spice",
        "1 pinch ground cinnamon, or more to taste"
    ],
    "nut": [
        "Calories > 537 kcal",
        "Carbs > 57.3 g",
        "Cholesterol > 43 mg",
        "Fat > 33.5 g",
        "Protein > 5.5 g",
        "Sodium > 444 mg"
    ],
    "n": "Thanksgiving Pumpkin Slush Cake",
    "a": "Ellen Bancroft Ziegler",
    "r": "0",
    "s": 12,
    "des": "\"If you have had lemon lush or chocolate dream dessert, this is the pumpkin alternative. It is a great recipe to use as an alternative to pumpkin pie. It feels less filling when you are filled with Thanksgiving turkey and sides!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nStir 1 cup pecans, flour, butter, white sugar, and 1 tablespoon confectioners' sugar together until crumbly. Press pecan mixture into the bottom of a 9x13-inch baking dish.\nBake pecan crust in the preheated oven until golden, 20 minutes. Cool completely.\nBeat cream cheese and 3/4 cup confectioners' sugar in a bowl with an electric mixer until fluffy, about 2 minutes. Fold 1 1/2 cups whipped topping into cream cheese mixture. Spread cream cheese mixture over cooled pecan crust.\nBeat pumpkin, milk, brown sugar, vanilla pudding mix, and pumpkin pie spice together in a bowl with an electric mixer until mixture thickens, 2 to 3 minutes. Gently fold in 4 ounces whipped topping. Spread pumpkin mixture in a layer over the cream cheese mixture.\nSpread remaining whipped topping over the pumpkin mixture layer. Sprinkle cinnamon and remaining 1/4 cup pecans over the top. Cover with plastic wrap and refrigerate for at least 3 hours or overnight.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "4 h ",
    "i": "1678958.jpg",
    "o": "",
    "st": "allrecipes"
}