{
    "id": 235085,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons butter",
        "2 onions, chopped",
        "2 carrots, diced",
        "1 stalk celery, diced",
        "2 cloves garlic, minced",
        "1 cup cauliflower florets",
        "1 cup diced zucchini",
        "6 large potatoes, cubed",
        "3 cups vegetable broth",
        "1 cup chopped kale, or to taste",
        "1/4 cup evaporated milk",
        "1 bay leaf",
        "1/2 cup corn kernels",
        "1 teaspoon smoked paprika",
        "1 teaspoon chopped fresh dill",
        "salt and ground black pepper to taste",
        "1/2 cup shredded Cheddar cheese, or to taste (optional)",
        "1/2 cup chopped fresh parsley, or to taste (optional)"
    ],
    "nut": [
        "Calories > 227 kcal",
        "Carbs > 41.9 g",
        "Cholesterol > 12 mg",
        "Fat > 4.4 g",
        "Protein > 6.9 g",
        "Sodium > 195 mg"
    ],
    "n": "Harvest Potato Soup",
    "a": "Janet",
    "r": "0",
    "s": 12,
    "des": "\"A hearty potato vegetable soup with kale. Great harvest time warm-up.\"",
    "ins": "Melt butter in a stock pot over medium-low heat. Cook and stir onions, carrots, celery, and garlic in hot butter until the onions are translucent, 5 to 10 minutes. Add cauliflower and zucchini to onion mixture; cook until just warmed, 1 to 2 minutes.\nStir potatoes and broth into vegetable mixture; bring to a boil. Reduce heat and simmer until potatoes are just tender, 15 to 20 minutes. Add kale to soup; cook until kale is slightly wilted, 2 to 3 minutes.\nPour milk into a blender and ladle about 2/3 the soup into blender, working in batches if needed. Cover and hold lid down; pulse a few times before leaving on to blend until smooth, 1 to 2 minutes.\nPour pureed soup back into stock pot; stir in corn, paprika, dill, salt, and pepper. Cook soup until corn is warmed, 2 to 3 minutes. Serve soup garnished with Cheddar cheese and parsley.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "4461584.jpg",
    "o": "",
    "st": "allrecipes"
}