{
    "id": 235048,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 large spears white asparagus",
        "2 small spears white asparagus",
        "8 slices bacon",
        "1/4 cup dry white vermouth",
        "1/3 cup lemon juice, divided",
        "1 tablespoon chopped fresh tarragon",
        "1 tablespoon chopped fresh parsley",
        "1 tablespoon unsalted butter",
        "salt and ground black pepper, to taste",
        "8 large sea scallops, tough ligament removed if attached",
        "1 lemon - cut into wedges, for garnish"
    ],
    "nut": [
        "Calories > 262 kcal",
        "Carbs > 8.6 g",
        "Cholesterol > 76 mg",
        "Fat > 11.3 g",
        "Protein > 27.4 g",
        "Sodium > 693 mg"
    ],
    "n": "Grilled Arms (Halloween Recipe for Scallops, Bacon, and White Asparagus)",
    "a": "Yresim Demus",
    "r": "0",
    "s": 4,
    "des": "\"A Halloween variation on bacon wrapped scallops, garnished with white asparagus. If you prefer a cleaner tasting scallop, try replacing the vermouth with water.\"",
    "ins": "Bring a pot of water to boil. Cook asparagus in boiling water until tender, about 4 minutes. Drain and rinse asparagus in cold water until cool. Cut asparagus spears into 1/4-inch long pieces.\nFry bacon in a large skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove the bacon to drain on paper towels.\nReturn skillet to stove top; raise heat to high and add vermouth, 1/4 cup lemon juice, tarragon, parsley, butter, salt, and pepper to bacon drippings. When mixture begins to steam, arrange scallops in skillet, making sure they don't touch each other. Cook until bottoms are golden, about 2 minutes; flip scallops and repeat cooking on other side.\nRemove scallops and arrange on serving dish; remove any remaining bits of tarragon and parsley from the sides of scallops. Drizzle remaining 1 1/2 tablespoons lemon juice evenly over scallops.\nCut bacon to approximate size of scallops. Place 1 piece of bacon over each scallop; arrange 1 large slice and 1 small slice of asparagus on top of each bacon piece to resemble a cross-section of an arm with the bones sticking out. Serve with lemon wedges.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}