{
    "id": 235017,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon olive oil, or as needed",
        "1 pound skinless, boneless chicken breast halves, cut into bite-size pieces, or more as needed",
        "1 teaspoon poultry seasoning, or to taste",
        "1/2 teaspoon ground black pepper to taste",
        "1 1/2 cups water",
        "1 (16 ounce) package fresh angel hair pasta, cut into thirds",
        "1 (10 ounce) package frozen peas",
        "1 cup sliced fresh mushrooms (optional)",
        "2 splashes white wine",
        "2 tablespoons garlic powder, or to taste",
        "1 (6 ounce) bag fresh spinach (optional)",
        "1/4 cup grated Parmesan cheese, or to taste"
    ],
    "nut": [
        "Calories > 593 kcal",
        "Carbs > 78.3 g",
        "Cholesterol > 63 mg",
        "Fat > 10.7 g",
        "Protein > 42.2 g",
        "Sodium > 474 mg"
    ],
    "n": "Quick Weeknight Skillet Chicken",
    "a": "charlotte221",
    "r": "0",
    "s": 4,
    "des": "\"Tonight, I was desperate to use up the chicken and fresh spinach in my fridge. I didn't have much energy or time and I couldn't find anything I wanted to make. I took a chance and threw this together from what I had on hand and it turned out great! It can be as simple or as fancy as you want. My picky 5-year olds and husband enjoyed it (except the spinach), so that pretty much makes it a keeper.\"",
    "ins": "Heat oil in a large skillet over medium heat. Place chicken in hot oil and sprinkle with poultry seasoning and black pepper. Cook and stir chicken in hot oil until no longer pink, 5 to 8 minutes.\nPour water into skillet and bring to a simmer. Stir angel hair pasta, peas, and mushrooms into skillet; cook until pasta is tender, 4 to 5 minutes.\nStir wine and garlic powder into pasta mixture. Add spinach and stir until spinach wilts, about 2 minutes. Sprinkle individual servings with Parmesan cheese.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "25 m",
    "i": "1061168.jpg",
    "o": "",
    "st": "allrecipes"
}