{
    "id": 235026,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "non-stick cooking spray",
        "1 pound fresh pumpkin, peeled and cut into 1-inch chunks",
        "1 head broccoli, cut into small pieces",
        "1 red beet, peeled and cut into 1-inch chunks",
        "1 sweet onion, chopped",
        "1 sweet potato, cut into 1-inch chunks",
        "1 red potato, cut into 1-inch chunks",
        "3 tablespoons olive oil",
        "2 tablespoons balsamic vinegar",
        "2 tablespoons honey",
        "1 tablespoon minced garlic, or more to taste",
        "2 teaspoons ground black pepper",
        "1 teaspoon ground cloves",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon sea salt"
    ],
    "nut": [
        "Calories > 225 kcal",
        "Carbs > 36.2 g",
        "Cholesterol > 0 mg",
        "Fat > 8.7 g",
        "Protein > 4.5 g",
        "Sodium > 246 mg"
    ],
    "n": "Roasted Pumpkin with Root Vegetables and Broccoli",
    "a": "KSchirm13",
    "r": "0",
    "s": 5,
    "des": "\"This is a great and hearty seasonal vegetable dish which can be used as a side dish or as an entire meal. The blend of seasoning adds a little spice and sweet. I came up with this recipe on a Sunday evening when I had 1 unused sweet potato, 1 unused redskin potato, and unused leftover pumpkin from the pumpkin butter recipe I found here on Allrecipes, which is great by the way. This recipe would make a great side dish for Thanksgiving.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Prepared a baking sheet with non-stick cooking spray.\nCombine pumpkin, broccoli, beet, onion, sweet potato, and red potato in a large bowl.\nWhisk olive oil, balsamic vinegar, honey, garlic, pepper, cloves, allspice, and sea salt together in a small bowl; pour over the vegetable mixture and toss to coat. Spread onto prepared baking sheet in a single layer.\nBake in preheated oven until all vegetables are tender, about 35 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "2758434.jpg",
    "o": "",
    "st": "allrecipes"
}