{
    "id": 235093,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 skinless, boneless chicken breast halves, each cut into 4 equal long pieces",
        "salt and ground black pepper to taste",
        "4 large whole wheat tortillas, cut into 1/2-inch strips",
        "16 slices green olives"
    ],
    "nut": [
        "Calories > 312 kcal",
        "Carbs > 66.9 g",
        "Cholesterol > 32 mg",
        "Fat > 3.4 g",
        "Protein > 21.7 g",
        "Sodium > 694 mg"
    ],
    "n": "Chicken Mummies",
    "a": "Lee Crowell",
    "r": "0",
    "s": 4,
    "des": "\"These chicken mummies are perfect for a fun but healthy Halloween dinner to fuel your little ghouls and goblins for a long night of trick-or-treating. They are also a hit at adult Halloween parties. This recipe can be tailored quite easily: chicken tenders can be marinated in your choice of marinade before cooking; different flavored tortillas can also change the look and taste. Serve with your choice of condiments; salsa, guacamole, and sour cream go well, as do barbecue sauce or even ketchup.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nSeason chicken pieces with salt and pepper.\nHeat a non-stick skillet or spray a skillet with non-stick cooking spray over medium-high heat; cook chicken until lightly browned, 2 to 3 minutes per side. Transfer chicken to a plate to cool enough to handle.\nWrap each chicken piece with a tortilla strip, starting at 1 end and overlapping tortillas when starting a new strip and leaving a gap at the top for the 'face'. Place 'mummies' on a baking sheet.\nBake in the preheated oven until until tortillas are crisp and chicken is no longer pink in the center, about 10 minutes. Cool mummies for about 5 minutes; place 2 olive slices on each 'mummy' for the 'eyes.'",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "1092593.jpg",
    "o": "",
    "st": "allrecipes"
}