{
    "id": 235172,
    "old_rating": "4.58974",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 teaspoon vegetable oil",
        "2 tablespoons unsalted butter at room temperature",
        "3/4 cup lightly packed shredded sharp Cheddar cheese",
        "1/3 cup lightly packed freshly shredded Parmesan cheese",
        "1/2 teaspoon paprika",
        "1 pinch cayenne pepper, or to taste",
        "1/4 teaspoon salt",
        "1/2 cup all-purpose flour",
        "1 tablespoon cold water, or as needed"
    ],
    "nut": [
        "Calories > 25 kcal",
        "Carbs > 1.4 g",
        "Cholesterol > 5 mg",
        "Fat > 1.7 g",
        "Protein > 1.1 g",
        "Sodium > 43 mg"
    ],
    "n": "Chef John's Cheesy Crackers",
    "a": "Chef John",
    "r": "0",
    "s": 36,
    "des": "\"These crunchy, crispy crackers have a big, bold cheese flavor. They're vastly superior to anything you can get at the store. You can change up the cheeses and the spices. It's really a fun thing to play around with.\"",
    "ins": "Line a baking sheet with aluminum foil and lightly grease with vegetable oil.\nPlace butter into a mixing bowl; add Cheddar cheese, Parmesan cheese, paprika, cayenne pepper, and salt. Mix together with the back of a spatula until thoroughly combined.\nMix flour into cheese mixture with a fork until crumbly. Sprinkle in cold water, 1 or 2 drops at a time, and mix with spatula until it comes together in a dough that holds its shape when squeezed.\nTransfer dough to a work surface and press into a thick, flattened disk. Wrap in plastic wrap and refrigerate 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nRoll dough out on a floured work surface to about 1/8-inch thick. Use a pizza cutter to cut 1-inch wide strips from the dough. Cut strips crosswise into rectangles about 1 1/2-inches long. Use the back of a bamboo skewer to punch 5 small holes into each cracker. Arrange crackers onto prepared baking sheet.\nBake in the preheated oven until crackers are browned and crisp, about 15 minutes. Let stand about 3 minutes for crackers to cool and release from the foil. Let cool completely before serving.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "4535234.jpg",
    "o": "4535234.jpg,4530820.jpg,4528978.jpg,4099283.jpg,3664513.jpg,3664504.jpg",
    "st": "allrecipes"
}