{
    "id": 235144,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup sesame oil",
        "1/3 cup sesame seeds",
        "4 yellow onions, sliced",
        "1/2 cup soy sauce",
        "1/4 cup lemon juice",
        "1 tablespoon sugar",
        "2 cloves garlic, crushed",
        "1/4 teaspoon whole black peppercorns",
        "1 (2.5 pound) London broil steak"
    ],
    "nut": [
        "Calories > 639 kcal",
        "Carbs > 20.5 g",
        "Cholesterol > 63 mg",
        "Fat > 44.9 g",
        "Protein > 39.7 g",
        "Sodium > 1876 mg"
    ],
    "n": "Grilled Sesame Steak",
    "a": "gseaman1",
    "r": "0",
    "s": 4,
    "des": "\"This is a grill recipe my wife and I have been making for over 30 years. The sesame flavor is fantastic, and the London broil comes out tender as can be. Turn it twice per side to get the diamond-shaped grill marks and people will rave!\"",
    "ins": "Heat sesame oil in a skillet over medium-high heat. Cook and stir sesame seeds in hot oil until golden brown, about 1 minute. Transfer seeds and oil immediately to a large glass or ceramic baking dish.\nStir onions, soy sauce, lemon juice, sugar, garlic, and peppercorns into sesame mixture until marinade is evenly combined. Place steak into marinade, turning to coat all sides. Cover baking dish with plastic wrap and refrigerate, turning steak often, for at least 4 hours or up to overnight.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nCook the steak on the preheated grill until meat starts to firm and turns reddish-pink and juicy in the center, about 10 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C) for medium rare. Transfer steak to a plate, cover with aluminum foil, and let rest for about 10 minutes. Slice across the grain.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "4 h ",
    "i": "1647805.jpg",
    "o": "",
    "st": "allrecipes"
}