{
    "id": 235165,
    "old_rating": "4.32258",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 large chicken legs",
        "1 tablespoon salt",
        "1 cup honey",
        "1 cup orange juice with pulp",
        "1/2 cup unsalted butter, at room temperature",
        "7 sprigs fresh rosemary, finely chopped",
        "2 oranges, zested",
        "2 cloves garlic, minced (optional)",
        "ground black pepper to taste"
    ],
    "nut": [
        "Calories > 777 kcal",
        "Carbs > 39 g",
        "Cholesterol > 240 mg",
        "Fat > 42.3 g",
        "Protein > 59.7 g",
        "Sodium > 1074 mg"
    ],
    "n": "Roasted Orange Rosemary Honey Glazed Chicken",
    "a": "Jolanta",
    "r": "0",
    "s": 8,
    "des": "\"This is always a hit when I make it for dinner parties and Boxing Day dinner because the chicken is always fall-off-the-bone juicy and people love the glaze. People always go for seconds! \n\nYou may quarter 2 chickens instead if you aren't able to get just legs from your butcher, but I find the legs are juicier and save money. Serve this dish with fragrant rice and dilled carrots or roasted asparagus.\"",
    "ins": "Sprinkle chicken with salt and place in a large glass or plastic bowl.\nWhisk together honey, orange juice, butter, rosemary, orange zest, and garlic. Pour orange mixture over chicken; cover with plastic wrap and refrigerate at least 1 hour or overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nPlace chicken legs in a single layer in a roasting pan; pour orange mixture over chicken.\nRoast for 30 minutes in the preheated oven; reduce temperature to 325 degrees F (160 degrees C). Baste chicken with pan juices every 20 minutes until chicken is a deep orange brown color, no longer pink at the bone, and  juices run clear, about 90 minutes. An instant-read thermometer inserted into the thickest part of the meat near the bone should read 165 degrees F (74 degrees C).",
    "pt": "20 m",
    "ct": "2 h",
    "tt": "3 h ",
    "i": "1085205.jpg",
    "o": "4525851.jpg,4524049.jpg,4518519.jpg,4518497.jpg,4481445.jpg,4110639.jpg",
    "st": "allrecipes"
}