{
    "id": 235163,
    "old_rating": "4.70968",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 cups water",
        "2 pounds chicken thighs, or more to taste",
        "1 1/2 cups chopped carrots",
        "1 cup chopped celery (try to include celery leaves)",
        "1 onion, chopped",
        "3/4 cup pearl barley",
        "3 bay leaves",
        "1 cube chicken bouillon, or more to taste",
        "1 teaspoon poultry seasoning",
        "1 teaspoon rubbed sage",
        "1 teaspoon salt, or to taste",
        "1/4 teaspoon ground black pepper",
        "2 tablespoons lemon juice"
    ],
    "nut": [
        "Calories > 352 kcal",
        "Carbs > 25 g",
        "Cholesterol > 85 mg",
        "Fat > 15.7 g",
        "Protein > 27.5 g",
        "Sodium > 704 mg"
    ],
    "n": "Chicken with Barley Soup",
    "a": "Carolyn LaLumiere Miller",
    "r": "0",
    "s": 6,
    "des": "\"This is a high-protein, high-fiber, and low-fat recipe that is very filling. I usually double the recipe so I have plenty of leftovers. The soup freezes well. This soup comes out very thick; if you like a thinner soup, add more water or reduce the barley to 1/2 cup. This soup recipe is very flexible. Adjust amount of veggies and seasonings to your family's taste.\"",
    "ins": "Combine water, chicken thighs, and bay leaves in a large stock pot; bring to a boil, reduce heat to low, place a cover on the pot, and cook at a simmer until the chicken is tender, about 30 minutes.\nRemove chicken to a cutting board to cool. Remove and discard bones, skin, and fat from chicken. Cut remaining meat into bite-sized pieces.\nCool broth until the fat congeals on the surface. Skim and discard fat.\nReturn soup to heat; add carrots, celery, onion, pearl barley, bay leaves, chicken bouillon, poultry seasoning, sage, salt, and black pepper. Bring the soup to a boil, reduce heat to low, place cover on the pot, and simmer until the barley is cooked and the vegetables are tender, 60 to 90 minutes. Stir lemon juice into the soup just before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4514320.jpg",
    "o": "3959991.jpg,3943553.jpg,3943427.jpg,3158429.jpg,3113010.jpg,1943425.jpg",
    "st": "allrecipes"
}