{
    "id": 235120,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup garlic cloves",
        "2 tablespoons extra virgin olive oil",
        "16 ounces dry orecchiette pasta (or penne pasta)",
        "1/4 pound MargheritaÂ® Genoa Salami, sliced thin, julienned",
        "2 large red bell peppers, roasted, skinned, cored, and cut into strips",
        "8 ounces fresh baby spinach",
        "1/4 cup toasted pine nuts (optional)",
        "2 leaves fresh basil, julienned",
        "1/4 cup freshly grated Pecorino Romano",
        "Fresh ground black pepper to taste"
    ],
    "nut": [
        "Calories > 677 kcal",
        "Carbs > 99.1 g",
        "Cholesterol > 16 mg",
        "Fat > 19.8 g",
        "Protein > 25.3 g",
        "Sodium > 338 mg"
    ],
    "n": "Orecchiette Pasta with MargheritaÂ® Genoa Salami",
    "a": "Margherita Meats",
    "r": "0",
    "s": 4,
    "des": "\"Thinly-sliced strips of MargheritaÂ® Genoa salami, roasted garlic, baby spinach and fresh basil create an unforgettable orecchiette pasta dish.\"",
    "ins": "In a small pot place 1/4 cup whole peeled garlic cloves. Cover with extra virgin olive oil and cook on low heat until garlic becomes soft and cooked through. Set aside to cool, retain olive oil.\nBring a pot of lightly salted water to boil and cook orecchiette pasta until al dente. Reserve approximately 1/4 cup of the pasta water to add to the end of step 3. Drain pasta and cool in cold water, then set aside.\nIn a large saute pan, heat garlic oil from roasted garlic. Add Margherita(R) Genoa salami and brown slightly. Add peppers, spinach, roasted garlic, and half of the toasted pine nuts and continue to cook until spinach is wilted. Add cooked pasta and reserved pasta water, fresh basil and toss, continue to saute until pasta is hot and ready to serve.\nPlace pasta on plates or serving bowl, sprinkle with grated Romano cheese, black pepper and top with remaining pine nuts.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "1059528.jpg",
    "o": "",
    "st": "allrecipes"
}