{
    "id": 235227,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups vegetable oil, or as needed",
        "2 pounds shrimp, peeled and deveined",
        "1 1/2 teaspoons salt",
        "1 cup mayonnaise",
        "3 tablespoons Sriracha hot chili sauce, or more to taste",
        "1 tablespoon fish sauce (such as Thai KitchenÂ®)",
        "1/2 teaspoon hot chili sesame oil",
        "3/4 cup milk",
        "2 eggs, well beaten",
        "8 ounces seafood breader (such as House-AutryÂ® Original)",
        "1/4 cup chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 458 kcal",
        "Carbs > 22.2 g",
        "Cholesterol > 240 mg",
        "Fat > 30.3 g",
        "Protein > 23 g",
        "Sodium > 2008 mg"
    ],
    "n": "Bang Bang ShrimpÂ® Rival",
    "a": "Timothy Wright",
    "r": "0",
    "s": 8,
    "des": "\"Serve this as a starter or entree. It will rival the Bone Fish GrillÂ®! Serve over a bed of lettuce in soup type bowl.\"",
    "ins": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nPlace shrimp in a bowl and sprinkle evenly with salt.\nWhisk mayonnaise, hot chili sauce, fish sauce, and sesame oil together in a bowl until evenly mixed.\nWhisk milk and eggs together in a bowl. Pour seafood breader into a shallow bowl.\nDip shrimp in egg mixture. Transfer shrimp to seafood breader and coat well.\nFry coated shrimp, working in batches, in the hot oil until coating is browned and shrimp are pink and fully cooked, about 5 minutes. Try to keep shrimp separate from each other while in the fryer. Remove cooked shrimp with a slotted spoon and drain on paper towels.\nPour mayonnaise mixture and cilantro into a large resealable plastic bag; add cooked shrimp. Seal bag and evenly coat shrimp with mayonnaise mixture.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "4077191.jpg",
    "o": "",
    "st": "allrecipes"
}