{
    "id": 235210,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (9.6 ounce) box pre-cooked maple flavored pork sausage links",
        "2 3/4 cups all-purpose flour*",
        "1 (.25 ounce) envelope Fleischmann'sÂ® RapidRise Yeast",
        "2 tablespoons sugar",
        "1 teaspoon salt",
        "1 cup very warm milk (120 to 130 degrees F)",
        "1 tablespoon MazolaÂ® Corn Oil",
        "1 egg",
        "1 teaspoon Spice IslandsÂ® Pure Vanilla Extract",
        "Cinnamon Sugar Topping:",
        "2 tablespoons sugar",
        "1/2 teaspoon Spice IslandsÂ® Ground Saigon Cinnamon",
        "2 tablespoons butter OR margarine, melted",
        "For Dipping (optional):",
        "Pancake syrup"
    ],
    "nut": [
        "Calories > 255 kcal",
        "Carbs > 28.1 g",
        "Cholesterol > 36 mg",
        "Fat > 12.9 g",
        "Protein > 7.2 g",
        "Sodium > 439 mg"
    ],
    "n": "French Toast Sausage Fluffins",
    "a": "ARGOÂ®,  KAROÂ®  and FLEISCHMANN'SÂ®",
    "r": "0",
    "s": 12,
    "des": "\"All the great flavors of French toast in a fun to eat no-knead fluffin!\"",
    "ins": "Reheat sausage according to package directions (this will remove any excess moisture). Cool on paper towels for 5 minutes; pat dry. Slice into very thin slices and set aside.\nCombine 1-1/2 cups flour, undissolved yeast, sugar and salt in large mixer bowl. Add milk, oil, egg and vanilla; beat 2 minutes on medium speed. Gradually add remaining 1-1/4 cups flour to make a stiff yet sticky dough. Stir in sausage. Cover bowl and let rest 10 minutes.\nPortion dough into 12 (2-1/2 inch) generously greased muffin cups using a scoop or two spoons (do not use paper liners). Cover and let rise 35 to 45 minutes. Dough will rise, but not double in size. Combine sugar and cinnamon for topping in a small bowl; set aside.\nBake in preheated 375 degrees F oven for 20 to 25 minutes until well browned. Let cool on wire rack for 2 minutes. Brush with butter and sprinkle with cinnamon sugar mixture. Run a knife around each roll to remove from pan. Serve warm with pancake syrup, if desired. Refrigerate any leftovers.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "1058424.jpg",
    "o": "",
    "st": "allrecipes"
}