{
    "id": 235299,
    "old_rating": "1",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 1/2 cups all-purpose flour",
        "2 cups white sugar",
        "1 cup buttermilk",
        "3 eggs",
        "1 teaspoon vanilla",
        "1 teaspoon salt",
        "1 teaspoon baking powder",
        "1 cup candy corn, or as needed",
        "72 candy-coated milk chocolate pieces (such as M&M'sÂ®)",
        "1/4 cup prepared white frosting, or as needed",
        "4 pieces red string licorice (such as TwizzlersÂ®), cut into 1-inch pieces"
    ],
    "nut": [
        "Calories > 173 kcal",
        "Carbs > 36.9 g",
        "Cholesterol > 16 mg",
        "Fat > 1.4 g",
        "Protein > 3.2 g",
        "Sodium > 98 mg"
    ],
    "n": "Erin's Fun Turkey Cookies",
    "a": "Erin2009",
    "r": "0",
    "s": 36,
    "des": "\"These are great for doing with kids and can also be very fun for adults, too! These are so cute that, once you make them, you might not want to eat them!\"",
    "ins": "Beat flour, sugar, buttermilk, eggs, vanilla, salt, and baking powder together in a bowl until dough is thoroughly mixed. Cover bowl with plastic wrap and refrigerate for at least 1 hour.\nPreheat oven to 375 degrees F (190 degrees C). Grease baking sheets.\nDrop about 2 teaspoons of dough per cookie about 2 inches apart onto prepared baking sheets.\nBake cookies in the preheated oven until light golden brown, about 10 minutes. Cool cookies for 8 to 10 minutes before removing to a plate to decorate.\nPress candy corns, point-end first, partway into the top edge of the cookies to resemble feathers. Place 2 candy-coated milk chocolate pieces in the center of each cookie to resemble the turkey's eyes. Use a small amount of frosting to create the turkey's mouth. Press 2 pieces of licorice into the bottom edge of the cookie to make the turkey's legs.",
    "pt": "45 m",
    "ct": "10 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}