{
    "id": 235264,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons extra virgin olive oil, divided",
        "2 links apple maple chicken sausage, casings removed",
        "1 small onion, diced",
        "2 cloves garlic, minced",
        "1 cup crusty bread cubes",
        "4 teaspoons finely chopped fresh parsley",
        "1/2 tablespoon finely chopped fresh sage",
        "1 (1 1/2-pound) skinless, boneless turkey breast half, halved lengthwise and pounded to 1/2-inch thickness",
        "salt and ground black pepper to taste",
        "1 cup turkey stock"
    ],
    "nut": [
        "Calories > 374 kcal",
        "Carbs > 7.7 g",
        "Cholesterol > 175 mg",
        "Fat > 13.7 g",
        "Protein > 52.1 g",
        "Sodium > 487 mg"
    ],
    "n": "Turkey Paupiettes with Apple-Maple Stuffing",
    "a": "foodwinefashion",
    "r": "0",
    "s": 4,
    "des": "\"If you don't have the time or the guests to prepare a big, whole turkey for Thanksgiving, stuffed turkey paupiettes are easier, faster, and just as delicious! Serve with gravy and a sprinkle of fresh parsley.\"",
    "ins": "Heat 1 tablespoon olive oil in a nonstick skillet over medium-high heat. Cook and stir sausage in hot oil, breaking it up with a wooden spoon, until browned and crumbly, 5 to 10 minutes. Transfer cooked sausage to a large bowl and return skillet to heat.\nCook and stir onion and garlic in hot skillet until softened and fragrant, 3 to 4 minutes; transfer to bowl with sausage.\nBlend bread cubes in a food processor until finely ground. Add bread crumbs, parsley, and sage to sausage mixture; stir until stuffing is completely combined.\nSeason turkey breasts with salt and pepper. Place 1/2 the stuffing mixture onto each breast. Roll turkey breasts around stuffing, tucking the sides in as you roll. Tie twine around each rolled turkey breast to secure the roll. Season each roll with salt and pepper.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat remaining 1 tablespoon olive oil in a large oven-proof skillet over medium-high heat. Place turkey rolls in hot oil and cook until golden brown on all sides, 3 to 5 minutes per side.\nPour turkey stock into the skillet and bring stock to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Transfer skillet to oven.\nCook in the preheated oven until turkey rolls are no longer pink in the center and the juices run clear, 10 to 12 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove rolls from the oven to rest for 5 minutes. Cut into 1-inch slices.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "1065659.jpg",
    "o": "",
    "st": "allrecipes"
}