{
    "id": 235203,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 serving cooking spray",
        "1/2 cup barbeque sauce (such as Sweet Baby Ray'sÂ®)",
        "1/4 cup honey",
        "1/4 cup brown sugar",
        "1 tablespoon chile-garlic sauce (such as SrirachaÂ®)",
        "4 skinless, boneless chicken breast halves, pounded to an even thickness",
        "1 teaspoon ground black pepper (optional)"
    ],
    "nut": [
        "Calories > 298 kcal",
        "Carbs > 43 g",
        "Cholesterol > 67 mg",
        "Fat > 3 g",
        "Protein > 24.6 g",
        "Sodium > 572 mg"
    ],
    "n": "Sweet 'n' Spicy Baked Chicken",
    "a": "Brendon Mock",
    "r": "0",
    "s": 4,
    "des": "\"My girlfriend and I are both college students so this quick and easy chicken recipe was an affordable and tasty hit at our table last night! Requiring just a few ingredients and low prep time makes this a great dish any day of the week. The homemade BBQ sauce goes great on pork and ribs too! Feel free to adjust the sweetness or spiciness to your pleasure.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Cover a baking sheet with aluminum foil and spray the foil with cooking spray.\nMix barbeque sauce, honey, brown sugar, and chile-garlic sauce together in a bowl until you have no clumps of brown sugar. Spoon about half the sauce into a separate bowl for serving.\nArrange chicken breast halves onto the prepared sheet. Brush sauce from one of the bowls onto breasts.\nBake chicken breasts in the preheated oven, brushing with sauce every 10 minutes, until no longer pink in the center and the juices run clear, about 1 hour. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Season with pepper and serve with the reserved bowl of sauce for dipping.",
    "pt": "10 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4513390.jpg",
    "o": "",
    "st": "allrecipes"
}