{
    "id": 235272,
    "old_rating": "4.65385",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup chopped walnuts",
        "1 large beet, top and bottom trimmed and beet greens retained",
        "1 tablespoon walnut oil, or more to taste",
        "2 ounces soft goat cheese",
        "kosher salt and freshly ground black pepper to taste",
        "2 tablespoons champagne vinegar",
        "1 cup reserved beet greens, cut into very thin slivers",
        "2 teaspoons chopped fresh chives"
    ],
    "nut": [
        "Calories > 422 kcal",
        "Carbs > 19 g",
        "Cholesterol > 22 mg",
        "Fat > 35.1 g",
        "Protein > 13.1 g",
        "Sodium > 487 mg"
    ],
    "n": "Roasted Beets with Goat Cheese and Walnuts",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"Beautiful, sweet, twice-roasted beets and baked goat cheese with crunchy nuts and slightly bitter greens is my idea of an easy, healthy, beautiful fall lunch! Or dinner, or breakfast, or brunch. Serve with toasted walnut bread.\"",
    "ins": "Preheat oven to 275 degrees F (135 degrees C).\nSpread walnuts onto a baking sheet and toast in the preheated oven until the nuts turn golden brown and become fragrant, about 45 minutes. Watch the nuts carefully because they burn quickly. Set walnuts aside to cool to room temperature.\nTurn oven up to 375 degrees F (190 degrees C). Crinkle up a piece of aluminum foil and place it into an oven-safe dish (such as a pie dish) to act as a disposable rack. Place beet onto foil.\nBake in the preheated oven until the beet just starts to turn tender, about 45 minutes. Wrap beet in aluminum foil and let cool to room temperature.\nTurn oven temperature up to 400 degrees F (205 degrees C).\nPeel beet with a sharp paring knife; peel skin from beet. Cut beet in half and cut halves into thick half-moon-shaped slices.\nDrizzle walnut oil in a baking dish and brush oil over the bottom of the dish; arrange beet slices in the dish in a single layer. Crumble goat cheese into the empty spaces and over beets. Sprinkle with kosher salt and black pepper.\nBake beet and cheese in oven until beet pieces are sizzling and the edges of the cheese are slightly browned, about 15 minutes. Cool slightly, about 10 minutes.\nDrizzle warm beet and cheese with vinegar and top with roasted walnuts, beet greens, and chives. Serve warm.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}