{
    "id": 235307,
    "old_rating": "3.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Stock:",
        "1 turkey carcass",
        "1 large onion, halved and skin left on",
        "1 large carrot, roughly chopped",
        "1 stalk celery, roughly chopped",
        "1 head garlic, halved",
        "1 teaspoon dried rosemary",
        "1 teaspoon dried thyme",
        "2 bay leaves",
        "salt and ground black pepper to taste",
        "water to cover",
        "Soup:",
        "2 large onions, diced",
        "2 carrots, diced",
        "2 stalks celery, diced",
        "2 cloves garlic, minced",
        "1 teaspoon poultry seasoning",
        "1 teaspoon dried rosemary",
        "1 teaspoon onion powder",
        "2 cups cooked rice"
    ],
    "nut": [
        "Calories > 115 kcal",
        "Carbs > 22.4 g",
        "Cholesterol > 4 mg",
        "Fat > 1.7 g",
        "Protein > 3.2 g",
        "Sodium > 37 mg"
    ],
    "n": "Classic Turkey and Rice Soup",
    "a": "Sarah",
    "r": "0",
    "s": 8,
    "des": "\"Is there anything as warm as a bowl of soup made with the leftovers of a meal that you shared with your family?\"",
    "ins": "Combine turkey carcass, halved onion, roughly chopped carrot, roughly chopped celery, halved garlic head, 1 teaspoon rosemary, thyme, bay leaves, salt, and pepper in a stockpot; pour in enough water to cover. Bring mixture to a boil, cover pot, reduce heat, and simmer until flavors have blended, about 1 hour.\nRemove turkey carcass and pull remaining meat from bones; reserve meat and discard carcass. Remove vegetables and bay leaves from stock using a slotted spoon and discard.\nStir diced onions, diced carrots, diced celery, minced garlic, poultry seasoning, 1 teaspoon rosemary, and onion powder into stock; bring to a boil. Reduce heat, cover pot, and simmer until vegetables are very tender, 20 to 30 minutes. Add cooked rice and turkey meat to soup; season with salt and pepper. Cook until rice and turkey meat are warmed, about 5 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "2925812.jpg",
    "o": "",
    "st": "allrecipes"
}