{
    "id": 235334,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "16 slices soft white bread, crusts removed",
        "3 tablespoons butter, melted",
        "1 tablespoon olive oil",
        "1 tablespoon butter",
        "1 small onion, diced",
        "1 small green bell pepper, diced",
        "1 (10.75 ounce) can reduced-fat condensed cream of mushroom soup",
        "3/4 cup skim milk",
        "1 teaspoon Italian seasoning",
        "1 teaspoon rubbed sage, or more to taste",
        "salt and ground black pepper to taste",
        "2 1/2 cups cubed cooked turkey",
        "1 tablespoon chopped fresh parsley, or as desired"
    ],
    "nut": [
        "Calories > 309 kcal",
        "Carbs > 31 g",
        "Cholesterol > 50 mg",
        "Fat > 12 g",
        "Protein > 18.3 g",
        "Sodium > 567 mg"
    ],
    "n": "Creamed Turkey in Toast Cups",
    "a": "LORRISMYTH",
    "r": "0",
    "s": 8,
    "des": "\"This is delicious as an appetizer or serve three as a light meal. The perfect solution for your leftover turkey!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nRoll bread slices flat on a work surface using a rolling pin. Brush 1 side of each flattened bread slice with melted butter. Fit bread slices into muffin cups, butter-side up.\nBake in the preheated oven until cups are lightly browned, 12 to 15 minutes. Cool completely.\nHeat olive oil and 1 tablespoon butter in a large skillet over medium-high heat; cook and stir onion and green bell pepper until softened, 5 to 10 minutes.\nReduce heat to medium and gradually stir cream of mushroom soup and milk into onion mixture until smooth; add Italian seasoning, sage, salt, and pepper. Stir turkey into soup mixture; cook and stir until bubbling, about 5 minutes. Place 2 or 3 bread cups on each place. Ladle soup mixture into each cup; top with parsley.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "4212780.jpg",
    "o": "",
    "st": "allrecipes"
}