{
    "id": 235347,
    "old_rating": "3.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 stalk celery, sliced",
        "3 tablespoons olive oil",
        "1 onion, quartered",
        "1 clove garlic, chopped",
        "1 head cauliflower, cut into small florets",
        "1 (28 ounce) can whole peeled tomatoes, drained and mashed",
        "1 teaspoon dried sage",
        "salt and ground black pepper to taste",
        "2 tablespoons chicken broth, or as needed (optional)",
        "1 (8 ounce) package linguine pasta",
        "1 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 472 kcal",
        "Carbs > 63 g",
        "Cholesterol > 18 mg",
        "Fat > 17.7 g",
        "Protein > 20.3 g",
        "Sodium > 673 mg"
    ],
    "n": "The Fridge Scavenger's Tomato and Cauliflower Pasta",
    "a": "Seth Kolloen",
    "r": "0",
    "s": 4,
    "des": "\"The sauce was the star here with really deep flavor even though this was something I threw together just to use up some vegetables. You could sub practically any vegetable for the cauliflower, that's just what I happened to have in my veggie drawer! Use any type of pasta you like!\"",
    "ins": "Put a celery slice in a deep skillet with a cover; add olive oil. Heat olive oil over medium-high heat until celery slice is sizzling, 3 to 5 minutes. Add remaining celery, onion, and garlic to olive oil; turn heat to medium. Cook and stir onion mixture until slightly tender, about 5 minutes.\nMix cauliflower, tomatoes, sage, salt, and pepper into onion mixture; cook and stir over medium-high heat until bubbling, about 5 minutes. Cover skillet with lid, reduce heat to low, and cook until a knife slides easily into cauliflower, about 15 minutes. Add chicken broth if tomato and cauliflower sauce begins to burn.\nBring a large pot of lightly salted water to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes; drain and transfer to a serving bowl.\nPour tomato and cauliflower sauce over pasta; add Parmesan cheese. Toss to coat.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "3111914.jpg",
    "o": "",
    "st": "allrecipes"
}