{
    "id": 235353,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon sea salt, divided",
        "1 (16 ounce) package linguine pasta",
        "2 tablespoons extra-virgin olive oil, or more as desired",
        "2 cloves garlic, minced",
        "1 (10 ounce) bag baby spinach leaves, chopped",
        "3 large tomatoes, seeded and diced",
        "1 (15 ounce) can garbanzo beans (chickpeas), rinsed and drained",
        "1 teaspoon chopped fresh marjoram, or more to taste",
        "freshly ground black pepper to taste",
        "1/2 teaspoon red pepper flakes, or more to taste (optional)",
        "1/4 cup freshly grated Pecorino-Romano cheese, or to taste"
    ],
    "nut": [
        "Calories > 613 kcal",
        "Carbs > 104.3 g",
        "Cholesterol > 8 mg",
        "Fat > 12.1 g",
        "Protein > 22.6 g",
        "Sodium > 1685 mg"
    ],
    "n": "Pasta with Spinach and Chickpeas",
    "a": "KIMBICA",
    "r": "0",
    "s": 4,
    "des": "\"This is a home-style Italian favorite at my house. It is also very good with northern white beans instead of the chickpeas, and any sort of strand pasta works well. Serve with a leafy green salad and crusty Italian bread. If you like spicy food, stir in 1/2 to 1 teaspoon red pepper flakes towards the end.\"",
    "ins": "Bring a large pot of water with 2 teaspoons sea salt to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes; drain, reserving 1/2 cup of the water.\nHeat olive oil in a large skillet over medium heat. Cook and stir garlic in hot oil until fragrant, about 1 minute. Increase heat to medium-high and add spinach, tomatoes, and garbanzo beans; cook and stir until spinach begins to wilt, 1 to 2 minutes more.\nSeason spinach mixture with remaining teaspoon sea salt, marjoram, black pepper, and red pepper flakes. Reduce heat to low. Stir drained linguine with the spinach mixture to evenly coat. Add extra olive oil or reserved pasta water to achieve your preferred level of moisture in the dish. Top with Pecorino-Romano cheese.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "1323166.jpg",
    "o": "",
    "st": "allrecipes"
}