{
    "id": 235331,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound lean ground beef",
        "1/2 cup finely chopped onion",
        "1/4 cup chopped green bell pepper",
        "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TELÂ®)",
        "1 cup water",
        "3/4 cup long-grain white rice",
        "1/2 cup chile sauce",
        "1 (4 ounce) can sliced black olives, or to taste",
        "2 tablespoons sliced jalapeno peppers, or to taste (optional)",
        "2 cloves garlic, minced",
        "1 teaspoon salt",
        "1 teaspoon brown sugar",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon Worcestershire sauce",
        "1/4 teaspoon cayenne pepper (optional)",
        "1 pinch ground black pepper",
        "2 cups shredded Cheddar cheese, divided",
        "2 tablespoons chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 430 kcal",
        "Carbs > 26 g",
        "Cholesterol > 92 mg",
        "Fat > 24 g",
        "Protein > 26.9 g",
        "Sodium > 1074 mg"
    ],
    "n": "Hearty Spanish Rice Bake",
    "a": "Hugh",
    "r": "0",
    "s": 6,
    "des": "\"Ground beef, fresh onion, green bell pepper, garlic, tomatoes, and rice are simmered in a sweet-hot sauce then baked with Cheddar cheese and garnished with fresh cilantro. Spice it up with Ro-TelÂ® instead of regular canned tomatoes, cayenne, and jalapeno peppers. I have also added extra Cheddar cheese and you can substitute a Mexican blend or any other cheese if you like. Warning: this will spice up your life if you use the optional ingredients.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nHeat a large skillet over medium-high heat. Cook and stir beef, onion, and green bell pepper in the hot skillet until beef is browned and crumbly, 5 to 7 minutes; drain and discard grease.\nStir beef mixture, diced tomatoes with green chile peppers, water, rice, chile sauce, olives, jalapeno peppers, garlic, salt, brown sugar, ground cumin, Worcestershire sauce, cayenne pepper, and black pepper together in a large pot over medium-low heat.\nBring beef-rice mixture to a simmer, stirring occasionally, until flavors blend, about 30 minutes. Stir in 1 cup Cheddar cheese. Transfer mixture to a 2 1/2 quart casserole dish and press down firmly. Top with remaining 1 cup Cheddar cheese.\nBake in the preheated oven until cheese is melted and bubbling, 10 to 15 minutes. Top with chopped cilantro.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "4041993.jpg",
    "o": "",
    "st": "allrecipes"
}