{
    "id": 235359,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon butter, or as needed, divided",
        "2 cups corn",
        "1 1/2 cups heavy whipping cream",
        "1 1/4 teaspoons salt",
        "1 pinch cayenne pepper",
        "1/2 cup cold milk",
        "3 egg yolks",
        "2 eggs"
    ],
    "nut": [
        "Calories > 331 kcal",
        "Carbs > 14.4 g",
        "Cholesterol > 253 mg",
        "Fat > 28.6 g",
        "Protein > 7 g",
        "Sodium > 558 mg"
    ],
    "n": "Chef John's Creamy Corn Custard",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"Corn custard is a wonderful side dish for all kinds of meats. Since it is so soft and light, texturally, it makes a great foil for things like barbecue pork, grilled steaks, and fried fish.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Butter six 6-ounce glass or ceramic ramekins. Set ramekins into a 2-inch deep baking dish.\nPlace corn into a large saucepan and stir in cream, salt, and cayenne pepper. Bring to a simmer and remove from heat; stir in milk.\nTransfer corn mixture to a blender and pulse several times to get the mixture moving. Blend on high speed until smooth and creamy.\nWhisk egg yolks with eggs until smooth in a mixing bowl. Slowly whisk about 1/4 cup hot corn mixture into eggs until the corn mixture is incorporated. Repeat several times more until all the corn mixture is combined with eggs.\nDivide corn mixture equally into the 6 ramekins. Pour hot tap water into the baking dish to come about halfway up the sides of the ramekins.\nBake in the preheated oven until custards are just set, 30 to 35 minutes. Let custards cool for about 10 minutes before serving in ramekins or unmolding onto serving plates. To unmold, insert a knife between the custard and the ramekin, go around the edge with knife to loosen,  and turn over onto a plate to unmold.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}