{
    "id": 235477,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cube chicken bouillon",
        "1 tablespoon water",
        "Filling:",
        "2 tablespoons butter",
        "2 onions, diced",
        "3 large potatoes, peeled and cut into chunks",
        "1 egg",
        "1 clove garlic, minced",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "Dough:",
        "4 cups all-purpose flour",
        "1/4 cup white sugar",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "2/3 cup vegetable oil",
        "2 eggs",
        "3/4 cup warm water",
        "1 tablespoon vegetable oil for brushing, or as needed"
    ],
    "nut": [
        "Calories > 192 kcal",
        "Carbs > 26 g",
        "Cholesterol > 25 mg",
        "Fat > 8.1 g",
        "Protein > 3.9 g",
        "Sodium > 131 mg"
    ],
    "n": "Natalie Powell's Knishes",
    "a": "Kim Lehman",
    "r": "0",
    "s": 25,
    "des": "\"My grandmother is of eastern European Jewish descent so this is a very authentic recipe!\"",
    "ins": "Dissolve chicken bouillon in 1 tablespoon water.\nMelt butter in a skillet over medium-high heat. Saute onions in hot butter until soft, 7 to 10 minutes.\nPlace potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes; drain and return potatoes to pot.\nMash potatoes, onion mixture, 1 egg, garlic, chicken bouillon, 1/4 teaspoon salt, and pepper together until potatoes are smooth.\nSift flour, sugar, baking powder, and 1/4 teaspoon salt together in a bowl; make a well in the center. Stir oil and 2 eggs into flour mixture. Add 3/4 cup water and beat until dough is smooth and elastic. Divide dough into 5 balls.\nPreheat oven to 350 degrees F (175 degrees C). Lightly oil a baking sheet.\nRoll 1 dough ball out on a lightly floured surface into a very thin rectangle. Brush surface of the dough with oil. Place about 5 spoonfuls of the potato mixture in a line on the dough about 2 inches from the long edge. Roll dough around filling. Pinch one end of the roll. Use the edge of your hand to cut dough roll into 5 knishes and pinch the edges of each. Repeat for remaining dough balls and potato filling. Place knishes on prepared baking sheet and brush each knish with oil.\nBake in the preheated oven until golden brown and dough is cooked through, about 20 minutes.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1842552.jpg",
    "o": "",
    "st": "allrecipes"
}