{
    "id": 235443,
    "old_rating": "4.7",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 slices cooked bacon, crumbled, or more to taste",
        "6 cups peeled and cubed potatoes",
        "4 cups chicken broth, or more as needed",
        "2 carrots, shredded",
        "1 yellow onion, chopped",
        "1 tablespoon dried parsley",
        "1/2 teaspoon celery seed",
        "salt and ground black pepper to taste",
        "2 cups milk",
        "1/4 cup all-purpose flour",
        "4 slices American cheese, cut into small pieces",
        "6 green onions, chopped (optional)"
    ],
    "nut": [
        "Calories > 314 kcal",
        "Carbs > 40.9 g",
        "Cholesterol > 34 mg",
        "Fat > 10.7 g",
        "Protein > 14.2 g",
        "Sodium > 1186 mg"
    ],
    "n": "Becca's Potato Bacon Soup",
    "a": "Reebs",
    "r": "0",
    "s": 6,
    "des": "\"This creamy potato soup is good any time of the year, but especially in cold weather months. It reheats well and can be made without bacon or cheese. This is filling enough to be served as a main dish, but also makes a nice side soup if served in smaller portions. Feel free to add your own ingredients: other vegetables, seasonings, different cheeses, etc. When serving, some options for garnish are chopped green onions, additional crumbled bacon, shredded cheese, and parsley. Enjoy!\"",
    "ins": "Place cooked bacon in a large stockpot over medium-high heat; add potatoes, chicken broth, carrots, onion, parsley, celery seed, salt, and pepper. Bring mixture to a boil, cover stockpot with a lid, reduce heat to medium-low, and simmer, stirring frequently and slightly mashing potatoes, until potatoes are fully cooked, at least 20 minutes. Add extra chicken broth if needed.\nWhisk milk and flour together in a bowl or measuring cup until frothy; slowly pour into soup while constantly stirring. Bring soup back to a simmer and cook until soup is thickened, 3 to 5 minutes.\nRemove soup from heat and stir in American cheese until completely melted. Ladle soup into serving bowls and garnish with green onions.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "4527802.jpg",
    "o": "",
    "st": "allrecipes"
}