{
    "id": 235480,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (2 pound) boneless pork loin roast",
        "2 teaspoons kosher salt",
        "1 1/2 teaspoons ground black pepper",
        "3 cups gingersnap cookies",
        "3 tablespoons olive oil",
        "1 cup apple cider",
        "1/2 cup chicken stock",
        "1 cup apple slices",
        "1/4 cup dried currants",
        "1 tablespoon butter",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 467 kcal",
        "Carbs > 42.3 g",
        "Cholesterol > 59 mg",
        "Fat > 24 g",
        "Protein > 20.4 g",
        "Sodium > 763 mg"
    ],
    "n": "Gingersnap Pork Loin Roast with Apples, Currants, and an Apple Cider Pan Reduction Sauce",
    "a": "Lnldad",
    "r": "0",
    "s": 8,
    "des": "\"This pork loin roast is both sweet and savory and is the ultimate comfort food on a cold autumn night.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nSeason pork roast with kosher salt and 1 1/2 teaspoons pepper.\nProcess gingersnap cookies in a food processor to fine crumbs. Transfer crumbs to a plate or shallow bowl. Roll roast in crumbs to coat.\nHeat olive oil in a large oven-proof skillet over medium-high heat. Cook roast in hot oil until all sides are browned, 8 to 10 minutes. Transfer skillet with roast to the center rack of the oven.\nRoast pork in the preheated oven until it is slightly pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Remove roast to a serving platter and cover with foil.\nPour apple cider and chicken stock into the same skillet used to cook the pork roast and bring liquid to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add apple slices and currants; simmer until sauce reduces to 1/2 cup, 5 to 10 minutes. Stir butter into apple mixture until butter is completely melted and incorporated, about 1 minute more. Season sauce with salt and pepper to taste.\nSlice pork roast into 1/2-inch thick slices and pour apple currant sauce over the top.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "4511997.jpg",
    "o": "",
    "st": "allrecipes"
}