{
    "id": 235400,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package elbow macaroni",
        "1 (28 ounce) can petite diced tomatoes",
        "6 tablespoons butter",
        "1/4 cup flour",
        "1 quart half-and-half",
        "2 cups chicken broth",
        "4 cups shredded mild Cheddar cheese",
        "2 cups shredded sharp white Cheddar cheese",
        "fresh ground black pepper to taste",
        "1 sleeve buttery round crackers (such as RitzÂ®), crushed"
    ],
    "nut": [
        "Calories > 893 kcal",
        "Carbs > 62.9 g",
        "Cholesterol > 158 mg",
        "Fat > 55.5 g",
        "Protein > 34.4 g",
        "Sodium > 1162 mg"
    ],
    "n": "Baked Tomato Mac n Cheese Casserole",
    "a": "Goodfella",
    "r": "0",
    "s": 8,
    "des": "\"Kids and adults will find this mac-n-cheese recipe to be delicious and a bit different. Tomatoes give the sauce a slight pinkish color and a flavor that is hard to top.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Butter a baking dish.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes; drain, return macaroni to pot, and stir tomatoes into the macaroni. Cook over medium heat until the macaroni absorbs some of the liquid from the tomatoes, about 4 minutes. Remove from heat.\nMelt butter in a large saucepan over medium-high heat. Stir flour into melted butter and cook until bubbly, 1 to 2 minutes. Slowly stream half-and-half and chicken broth into the butter mixture while stirring. Bring the mixture to a boil and continue to cook while stirring continually until thickened and bubbly, 2 to 3 minutes.\nRemove saucepan from heat. Melt mild Cheddar cheese and sharp Cheddar cheese into the butter mixture one handful at a time, stirring to incorporate each addition before adding the next. Season the cheese mixture with pepper and pour over the macaroni; stir to coat pasta evenly. Transfer the mixture to the prepared baking dish and top with crushed crackers.\nBake in preheated oven until crust is golden brown and the liquid is bubbling, 15 to 20 minutes. Cool 10 minutes before serving.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "1264323.jpg",
    "o": "",
    "st": "allrecipes"
}