{
    "id": 235470,
    "old_rating": "4.77273",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup heavy whipping cream",
        "salt and freshly ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "6 ounces dry miniature ravioli",
        "3 ounces crumbled Gorgonzola cheese",
        "2 tablespoons chopped Italian flat leaf parsley",
        "2 tablespoons freshly grated Parmesan cheese",
        "1/2 apple, diced",
        "1/4 cup chopped toasted walnuts",
        "1 teaspoon chopped Italian flat leaf parsley"
    ],
    "nut": [
        "Calories > 300 kcal",
        "Carbs > 12.6 g",
        "Cholesterol > 82 mg",
        "Fat > 24.4 g",
        "Protein > 8.5 g",
        "Sodium > 296 mg"
    ],
    "n": "Gorgonzola Cream Sauce",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"Autumn is the season for rich, creamy sauces, and I'm pretty sure you're going to be shocked at just how easy this one is. When your cream is reduced, your sauce is practically done. I like serving this with a stuffed pasta like tortellini or ravioli, topped with diced apple and crunchy toasted walnuts.\"",
    "ins": "Place a heavy skillet over medium heat. Pour cream into skillet, bring to a simmer, and cook cream until it reduces by half, about 8 minutes, stirring occasionally. Season with salt, black pepper, and cayenne pepper.\nBring a pot of salted water to a boil. Pour dried ravioli into boiling water and cook, stirring occasionally, until pasta is tender, 16 to 18 minutes. Drain pasta, reserving a cup of pasta water.\nGently fold cooked ravioli into cream sauce and turn heat to low. Mix in Gorgonzola cheese, stirring gently until melted. If sauce is too thick, thin it with a little pasta cooking water.\nStir in 2 tablespoons parsley and Parmesan cheese. Transfer to a serving bowl and sprinkle with diced apple, walnuts, and 1 teaspoon parsley.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}