{
    "id": 235494,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crepes:",
        "1 cup all-purpose flour",
        "1/4 teaspoon salt",
        "3 eggs",
        "1 1/4 cups milk, 1% or 2%",
        "2 tablespoons butter, melted",
        "Chicken and Garlic Filling:",
        "5 tablespoons butter",
        "4 cloves garlic, minced",
        "2 teaspoons chopped fresh thyme",
        "2 1/2 cups shredded rotisserie chicken",
        "1/3 cup herb and garlic cream cheese",
        "2 tablespoons chopped fresh parsley"
    ],
    "nut": [
        "Calories > 151 kcal",
        "Carbs > 8.5 g",
        "Cholesterol > 70 mg",
        "Fat > 9.8 g",
        "Protein > 6.7 g",
        "Sodium > 136 mg"
    ],
    "n": "Easy Savoury Crepes",
    "a": "Egg Farmers of Ontario",
    "r": "0",
    "s": 14,
    "des": "\"Crepes are great to make ahead and stuff with your favourite fillings - sweet or savoury!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nCrepes: In a bowl, combine flour and salt. In a separate bowl, whisk together eggs, milk and melted butter. Whisk egg mixture into flour mixture until smooth. Cover and refrigerate for 1 hour. Strain mixture into a clean bowl.\nHeat a small non-stick skillet or crepe pan over medium heat. Brush pan with some oil.\nPour approximately 1/4 cup batter into centre of pan, swirling pan to coat. Cook for about 1 minute or until bottom is a light golden colour. Flip and cook for 30 seconds. Transfer to plate. Repeat with remaining batter. (Make-ahead: Stack crepes between waxed paper, wrap and refrigerate for up to 3 days or freeze for up to 1 month.)\nChicken and Garlic Filling: In a skillet, melt 3 tablespoons of the butter over medium high heat with garlic and thyme. Add chicken and cook, stirring for 5 minutes or until heated through. Stir in cream cheese until melted and smooth. Remove from heat and divide the chicken mixture into centre of each crepe and fold over. Place in shallow casserole dish, overlapping slightly. Melt remaining 2 tablespoons butter and drizzle over stuffed crepes.\nPlace in preheated oven for about 10 minutes or until warmed through. Sprinkle with parsley before serving.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "1068836.jpg",
    "o": "",
    "st": "allrecipes"
}