{
    "id": 235553,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (12 ounce) packages fresh cranberries",
        "2 cups turbinado sugar, or more to taste",
        "1 1/2 cups freshly squeezed orange juice",
        "1 cup water",
        "1/4 cup dark corn syrup (such as KaroÂ®), or more to taste",
        "2 tablespoons port wine, or more to taste",
        "1 tablespoon lime juice, or more to taste",
        "2 cinnamon sticks",
        "1 tablespoon orange zest, divided",
        "4 whole cloves",
        "1 large pomegranate, peeled and seeds separated, divided"
    ],
    "nut": [
        "Calories > 122 kcal",
        "Carbs > 31.2 g",
        "Cholesterol > 0 mg",
        "Fat > 0.1 g",
        "Protein > 0.4 g",
        "Sodium > 16 mg"
    ],
    "n": "Perfect Pomegranate Cranberry Sauce",
    "a": "LaurenRae",
    "r": "0",
    "s": 20,
    "des": "\"Don't settle for boring, mediocre cranberry sauce this holiday season. Instead, serve your friends and family this amazing reboot of the traditional Thanksgiving relish. It goes great with holiday fare like turkey and everyday favorites like biscuits.  Or you can even serve it with vanilla ice cream as a dessert! Jar or freeze your leftovers to enjoy this sauce year-round!\"",
    "ins": "Combine cranberries, sugar, orange juice, water, corn syrup, port wine, lime juice, cinnamon sticks, 1 1/2 teaspoons orange zest, cloves, and 1/4 the pomegranate seeds in a heavy pot; bring to a boil. Reduce heat to low and simmer, stirring occasionally, until cranberries pop and sauce is thickened, about 30 minutes.\nTaste the sauce and add more sugar, corn syrup, or port wine if desired. Remove cloves or cinnamon if the taste is overpowering at this point and add more port wine or lime juice.\nContinue to simmer sauce, stirring occasionally, until desired consistency is reached, 15 to 30 minutes. Remove pot from heat and cool, about 30 minutes. Sauce will thicken as it cools. Remove cinnamon sticks and cloves if still in sauce. Stir remaining pomegranate seeds into sauce and garnish with remaining 1 1/2 teaspoons orange zest.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "1731344.jpg",
    "o": "",
    "st": "allrecipes"
}