{
    "id": 235556,
    "old_rating": "4.73077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package linguine pasta, broken into fourths",
        "2 tablespoons olive oil",
        "12 slices cooked bacon, chopped",
        "1 sweet onion, finely chopped",
        "1 tablespoon minced garlic",
        "1 teaspoon red pepper flakes, or to taste",
        "1/2 cup dry white wine (such as Pinot Grigio)",
        "1 pound uncooked medium shrimp, peeled and deveined",
        "1 pound langostino lobster",
        "1 1/2 cups peas",
        "1 cup basil pesto sauce",
        "1 cup half-and-half",
        "1 cup grated Parmigiano-Reggiano cheese"
    ],
    "nut": [
        "Calories > 647 kcal",
        "Carbs > 50.8 g",
        "Cholesterol > 212 mg",
        "Fat > 30.1 g",
        "Protein > 41.4 g",
        "Sodium > 846 mg"
    ],
    "n": "Amazing Shrimp and Langostino Lobster Linguine",
    "a": "Michael",
    "r": "0",
    "s": 8,
    "des": "\"It was our turn to host the 'Dinner Club'. Our theme was Italian. This was a great entree that did not take hours in the kitchen and allowed me to enjoy our company. Great fun with great friends!\"",
    "ins": "Bring a large pot of lightly salted and oiled water to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes; drain.\nHeat olive oil in a large saucepan over medium-high heat; saute bacon, onion, garlic, and red pepper flakes in hot oil until onion is golden brown, 10 to 15 minutes. Stir white wine into bacon mixture; cook and stir until wine is absorbed, 2 to 4 minutes.\nStir shrimp and langostino lobster into bacon mixture; saute until shrimp and langostino are pink, about 2 minutes.\nReduce heat to medium and stir cooked linguine into shrimp mixture. Stir peas, pesto sauce, and half-and-half into shrimp-linguine mixture; cook and stir until linguine absorbs the liquid, 5 to 10 minutes. Top servings with Parmigiano-Reggiano cheese.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "1068636.jpg",
    "o": "",
    "st": "allrecipes"
}