{
    "id": 235582,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Vegetable cooking spray",
        "1 (10.75 ounce) can Campbell'sÂ® Condensed Cream of Chicken Soup (Regular or 98% Fat Free)",
        "1 cup sour cream",
        "2 cups shredded Cheddar cheese or Colby Jack cheese",
        "1/2 cup milk",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon ground black pepper",
        "1 (28 ounce) package frozen diced potatoes (hash browns) with onions and peppers, thawed",
        "Salt",
        "3 cups shredded cooked chicken",
        "4 slices bacon, cooked and crumbled",
        "2 tablespoons chopped fresh chives or thinly sliced green onion"
    ],
    "nut": [
        "Calories > 557 kcal",
        "Carbs > 31 g",
        "Cholesterol > 127 mg",
        "Fat > 39.6 g",
        "Protein > 36.6 g",
        "Sodium > 914 mg"
    ],
    "n": "Cheesy Chicken and Potato Casserole with Bacon",
    "a": "Campbell's Kitchen",
    "r": "0",
    "s": 6,
    "des": "\"Frozen hash browns with onions and peppers are topped with cooked chicken, a delicious soup mixture and Cheddar cheese. Baked until hot and bubbling and sprinkled with crumbled bacon, this savory, satisfying casserole is sure to please.\"",
    "ins": "Heat the oven to 375 degrees F. Spray a 13x9x2-inch baking dish with the cooking spray.\nStir the soup, sour cream, 1 cup cheese, milk, garlic powder and black pepper in a medium bowl.\nSpread the potatoes in the baking dish. Season the potatoes with the salt and additional black pepper.  Top with the chicken. Spread the soup mixture over the chicken. Cover the baking dish.\nBake for 40 minutes or until the potatoes are tender and the mixture is hot and bubbling. Uncover the baking dish. Sprinkle with the remaining cheese.\nBake, uncovered, for 5 minutes or until the cheese is melted.  Sprinkle with the bacon and chives before serving.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "1075286.jpg",
    "o": "4400914.jpg,3955247.jpg,3578076.jpg,2613692.jpg,2282556.jpg,2080242.jpg",
    "st": "allrecipes"
}