{
    "id": 235584,
    "old_rating": "4.71667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups shredded, cooked chicken",
        "2 (10.75 ounce) cans  Campbell'sÂ® Condensed Cream of Chicken Soup (Regular or 98% Fat Free)",
        "1 cup light sour cream",
        "1 (10 ounce) can diced tomatoes and green chiles, undrained",
        "1 (15 ounce) can black beans, rinsed and drained",
        "1 (1 ounce) envelope reduced-sodium taco seasoning mix",
        "5 cups coarsely crushed tortilla chips",
        "2 cups shredded Cheddar cheese",
        "Chopped tomato",
        "Sliced green onion",
        "Chopped fresh cilantro leaves "
    ],
    "nut": [
        "Calories > 508 kcal",
        "Carbs > 31.2 g",
        "Cholesterol > 95 mg",
        "Fat > 29.4 g",
        "Protein > 32.9 g",
        "Sodium > 1414 mg"
    ],
    "n": "Chicken Taco Casserole",
    "a": "Campbell's Kitchen",
    "r": "0",
    "s": 8,
    "des": "\"All of your favorite taco fixings can be found in this crowd-pleasing casserole. Plus, it uses convenience products like canned soup and veggies, cooked chicken and taco seasoning mix that make it a snap to prepare. It's loaded with fantastic flavor and on the table in less than an hour!\"",
    "ins": "Heat the oven to 350 degrees F. Lightly grease a 13x9x2-inch baking dish. Stir the chicken, soup, sour cream, tomatoes and green chiles, beans and seasoning mix in a large bowl.\nLayer half the chicken mixture, 3 cups tortilla chips and half the cheese in the baking dish. Layer with the remaining chicken mixture and tortilla chips. Cover the baking dish.\nBake for 30 minutes. Uncover the baking dish. Sprinkle with the remaining cheese.\nBake, uncovered, for 10 minutes or until hot and bubbling and the cheese is melted. Sprinkle with the chopped tomato, green onion and cilantro before serving, if desired.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "1075292.jpg",
    "o": "4535022.jpg,4534902.jpg,4508573.jpg,4508404.jpg,4505787.jpg,4501562.jpg",
    "st": "allrecipes"
}