{
    "id": 235501,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons chili powder",
        "2 tablespoons brown sugar",
        "1 tablespoon salt",
        "1 tablespoon garlic powder",
        "1 tablespoon onion powder",
        "1 tablespoon ground black pepper",
        "2 teaspoons dry mustard",
        "14 pounds beef brisket"
    ],
    "nut": [
        "Calories > 391 kcal",
        "Carbs > 1.9 g",
        "Cholesterol > 93 mg",
        "Fat > 31.5 g",
        "Protein > 23.5 g",
        "Sodium > 316 mg"
    ],
    "n": "Holly's Texas Brisket",
    "a": "Holly Williamson",
    "r": "0",
    "s": 28,
    "des": "\"Season your next beef brisket roast with this flavorful spice rub. Slow roasting makes a tender and juicy brisket. This is not a quick fix recipe. It takes time and planning to make this a success. Follow the directions and make sure that the brisket is sealed tightly so that juices do not evaporate. It is well worth the time and trouble. You won't be sorry, it is awesome!\"",
    "ins": "Preheat grill for medium-low heat or 270 degrees F (132 degrees C), and lightly oil the grate.\nWhisk chili powder, brown sugar, salt, garlic powder, onion powder, ground black pepper, and dry mustard together in a small bowl to create the dry rub.\nPierce fatty side of the brisket with a knife about 50 times. Sprinkle 1/2 the dry rub generously over the lean side of the brisket. Turn meat over and sprinkle remaining 1/2 the dry rub over the fatty side, rubbing into the pierced fat.\nCook brisket, uncovered and fatty-side up, on the preheated grill for 4 hours. Transfer brisket to a roasting pan and cover pan tightly with aluminum foil.\nPreheat oven to 270 degrees F (132 degrees C).\nCook in the preheated oven until meat is tender and pulls easily away from the side of the brisket, about 8 more hours. Let meat rest 30 minutes before slicing.",
    "pt": "30 m",
    "ct": "12 h",
    "tt": "12 h ",
    "i": "2467523.jpg",
    "o": "",
    "st": "allrecipes"
}