{
    "id": 235614,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup pure pumpkin puree",
        "1 cup warm water (100 degrees F/40 degrees C)",
        "1 tablespoon warm water (100 degrees F/40 degrees C)",
        "1 1/4 teaspoons salt",
        "1/4 teaspoon active dry yeast",
        "1 tiny pinch pumpkin pie spice",
        "3 cups all-purpose flour",
        "1 tablespoon cornmeal, or as needed"
    ],
    "nut": [
        "Calories > 180 kcal",
        "Carbs > 37.9 g",
        "Cholesterol > 0 mg",
        "Fat > 0.5 g",
        "Protein > 5.1 g",
        "Sodium > 402 mg"
    ],
    "n": "No Knead Holiday Pumpkin Bread",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"The dough is so soft, so supple, so sensual that it's a joy to make this bread. Pumpkin gives it a soft color and super-subtle flavor. It's a great country bread.\"",
    "ins": "Place pumpkin puree into a large mixing bowl and whisk in 1 cup plus 1 tablespoon warm water, salt, yeast, and pumpkin pie spice until thoroughly combined. Beat in flour to make a dry crumbly dough. Keep stirring until dough becomes smooth and sticky, 2 to 3 minutes.\nCover bowl with a damp towel and let dough stand 12 to 16 hours to rise.\nGenerously sprinkle cornmeal onto center area of a baking sheet. Scrape dough out of bowl, using a floured spatula, onto a heavily floured work surface. Dough will be very sticky. Dust dough with flour and gently flatten into an oblong shape. Fold 2 opposite rounded ends together to meet in the center; fold remaining 2 rounded ends to meet in the center, creating a rectangle of dough. Using well-floured hands, gently form into a round loaf with the seams on the bottom.\nTransfer dough round onto center of prepared baking sheet. Dust top and sides of loaf generously with more flour.\nDust a dry towel with flour and place towel with floured side down over loaf. Let rise until loaf has almost doubled in size, 1 1/2 hours. Use a sharp knife to cut a 1/2-inch deep slit across the top of the loaf.\nPlace a loaf pan containing about 2 inches of water onto a bottom rack of oven. Preheat oven to 425 degrees F (220 degrees C).\nBake on center rack of the preheated oven for 30 minutes; turn bread around in oven. Continue to bake until bread is golden brown and crusty, about 20 more minutes. Let bread cool completely on a rack before slicing.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "14 h ",
    "i": "4519306.jpg",
    "o": "4519306.jpg,4061778.jpg,4059064.jpg,3989879.jpg,3988525.jpg,3836542.jpg",
    "st": "allrecipes"
}