{
    "id": 235659,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound smoked bacon, chopped",
        "1 onion, chopped",
        "4 cloves garlic, chopped",
        "6 (4 ounce) cans chopped mild green chile peppers",
        "2 1/2 pounds skinless, boneless chicken breast halves, cubed",
        "1 1/2 pounds russet potatoes, cubed",
        "1/4 cup butter",
        "2 (16 ounce) cans cream-style corn",
        "1 pint heavy whipping cream",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 335 kcal",
        "Carbs > 23.7 g",
        "Cholesterol > 96 mg",
        "Fat > 18.8 g",
        "Protein > 19.8 g",
        "Sodium > 879 mg"
    ],
    "n": "Papa Dar's Green Chile and Chicken Corn Chowder",
    "a": "DC",
    "r": "0",
    "s": 15,
    "des": "\"This is a totally original chowder that I came up with on my own using things that I love to cook with. \nFamily and friends beg for this when the weather turns cold. The russet potatoes allows the liquid to thicken and no flour or corn starch is needed. New Mexico green chile is recommended. Note: if using fresh green chile, add 1/2 cup of chicken stock for added liquid. Serve with your favorite corn bread.\"",
    "ins": "Place bacon in a large stockpot; cook and stir over medium-high heat until lightly browned, about 10 minutes. Add onion and saute until onion is tender, about 10 minutes. Add garlic and cook until fragrant, about 2 minutes.\nStir green chiles into bacon-onion mixture and bring to a simmer; add chicken. Simmer mixture until chicken is almost fully cooked, about 10 minutes. Add potatoes and butter to green chilies-chicken mixture and reduce heat to medium; cook until potatoes are almost tender, 10 to 15 minutes.\nStir corn and cream into mixture and reduce heat to medium-low; cook, stirring frequently and scraping bottom of pot with a wooden spoon, until potatoes are tender, about 10 more minutes. Season with salt and pepper.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "2644475.jpg",
    "o": "",
    "st": "allrecipes"
}