{
    "id": 235618,
    "old_rating": "4.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (12 ounce) package fresh cranberries, rinsed and drained",
        "3/4 cup freshly squeezed orange juice",
        "1/2 cup dark (grade B) maple syrup",
        "1/4 cup white sugar",
        "1/4 cup port wine",
        "1 tablespoon freshly grated ginger",
        "1 tablespoon freshly grated orange zest",
        "1 (3 inch) cinnamon stick",
        "1 pinch salt",
        "1 cup chopped walnuts"
    ],
    "nut": [
        "Calories > 210 kcal",
        "Carbs > 29.9 g",
        "Cholesterol > 0 mg",
        "Fat > 9.7 g",
        "Protein > 2.6 g",
        "Sodium > 23 mg"
    ],
    "n": "Maple Walnut Cranberry Sauce",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"This is the perfect thing to make and volunteer to bring to your family Thanksgiving gathering when you want to look like you made an effort! The maple syrup sweetens it perfectly and the walnuts make the texture so much more interesting.\"",
    "ins": "Place cranberries into a large saucepan and stir in orange juice, maple syrup, sugar, port wine, ginger, orange zest, cinnamon stick, and salt.\nBring sauce to a simmer. Berries will begin to pop. Cook at a simmer until berries are cooked through and soft, about 10 minutes.\nRemove saucepan from heat and let cranberry sauce cool for about 5 minutes.\nShake walnuts in a dry skillet over medium heat, cooking until golden brown and fragrant, about 5 minutes. Wipe away any small particles of walnut skin from skillet to avoid bitterness. Stir walnuts into cranberry sauce. Let cool to room temperature and transfer to a serving bowl; sauce will thicken as it cools. Cover bowl with plastic wrap, pushing wrap to touch sauce and refrigerate until needed. Sauce can be made several days ahead.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}