{
    "id": 235625,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 skinless, boneless chicken breast halves",
        "1 pound processed cheese food (such as VelveetaÂ®), torn into 4 pieces",
        "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TELÂ®)",
        "1 (10.5 ounce) can cream of chicken soup",
        "1 (10.75 ounce) can cream of mushroom soup",
        "1 (10 ounce) package large flour tortillas",
        "2 teaspoons chili powder, or to taste"
    ],
    "nut": [
        "Calories > 414 kcal",
        "Carbs > 29.5 g",
        "Cholesterol > 70 mg",
        "Fat > 22.4 g",
        "Protein > 23.5 g",
        "Sodium > 1598 mg"
    ],
    "n": "Mexican Chicken Casserole",
    "a": "kathrynd45",
    "r": "0",
    "s": 8,
    "des": "\"Chicken casserole with a Mexican twist. This casserole can be served as a main dish or an only dish. Leftovers are great. Very similar to Ro-telÂ® chicken. Tortillas can be substituted for DoritosÂ® or corn tortillas, but flour tortillas seem to work best.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nBring a saucepan of salted water to a boil. Boil chicken breasts until no longer pink in the center and the juices run clear, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove chicken breasts to a cutting board to cool. Reserve and cool chicken broth.\nShred the cooled chicken breasts and put into a large bowl; add cheese cubes, diced tomatoes with green chile peppers, cream of chicken soup, and cream of mushroom soup and stir.\nIndividually dip about half the tortillas into the cooled liquid from poaching the chicken; arrange into the bottom of a large baking dish.\nSpread the chicken mixture over the tortillas.\nIndividually dip the remaining tortillas into the water and arrange atop the chicken mixture. Sprinkle chili powder over the tortillas.\nBake in preheated oven until the top layer of tortillas begin to turn golden brown and crunchy, 30 to 45 minutes.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "1100116.jpg",
    "o": "",
    "st": "allrecipes"
}