{
    "id": 235718,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon butter",
        "1 pound fresh spinach",
        "12 eggs",
        "salt and freshly ground black pepper to taste",
        "1 pinch cayenne pepper",
        "6 slices bacon, chopped",
        "1/2 onion, diced",
        "1 pinch salt",
        "3 ounces crumbled feta cheese"
    ],
    "nut": [
        "Calories > 268 kcal",
        "Carbs > 5.1 g",
        "Cholesterol > 400 mg",
        "Fat > 19 g",
        "Protein > 20.3 g",
        "Sodium > 584 mg"
    ],
    "n": "Chef John's Spinach and Feta Pie",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"This is great for breakfast, lunch, and dinner, either hot, warm, or cold! This reminds me of spanakopita, a Greek spinach pastry.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat butter in a large oven-safe skillet over high heat. Toss spinach in hot butter until wilted, about 30 seconds. Drain spinach well and squeeze it as dry as possible. Transfer to a cutting board and chop.\nBeat eggs in a bowl with salt, black pepper, and cayenne pepper until thoroughly combined.\nPlace bacon in the same skillet used to cook spinach and cook over medium-high heat, stirring occasionally, until bacon has rendered its fat and is almost crisp, 5 to 8 minutes. Use a paper towel held in a tongs to remove excess bacon grease. Reduce heat to medium; saute onion with bacon and a pinch of salt until onion is translucent, about 5 more minutes.\nSaute chopped spinach with bacon and onion until spinach is hot; pour in eggs. Use a wooden spoon to distribute spinach evenly throughout the eggs. Sprinkle feta cheese over mixture.\nBake in the preheated oven until eggs are set, 10 to 15 minutes. Top may still be a little wet.\nTurn on oven's broiler. Broil pie until top is lightly golden brown, 2 to 3 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "3882822.jpg",
    "o": "3882822.jpg,3264662.jpg,2929594.jpg,2566123.jpg,2566122.jpg,2109014.jpg",
    "st": "allrecipes"
}