{
    "id": 235726,
    "old_rating": "3.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Burgers:",
        "1 pound ground chicken",
        "2 cups shredded zucchini, squeezed dry",
        "1/2 cup chopped green onions",
        "1/2 cup bread crumbs",
        "2 teaspoons Asian chile paste (such as sambal oelek)",
        "1 teaspoon sesame oil",
        "1 teaspoon garlic powder",
        "1 teaspoon red pepper flakes",
        "1/2 teaspoon fish sauce",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon salt",
        "Sauce:",
        "1/4 cup mayonnaise",
        "1 tablespoon chile-garlic sauce (such as SrirachaÂ®)",
        "2 teaspoons prepared yellow mustard",
        "1 teaspoon sesame oil",
        "1 teaspoon lemon juice",
        "1 teaspoon ground black pepper",
        "Garnish:",
        "4 hamburger buns - split, toasted and buttered",
        "4 lettuce leaves, or to taste",
        "4 tomato slices, or to taste",
        "4 red onion slices, or to taste"
    ],
    "nut": [
        "Calories > 506 kcal",
        "Carbs > 47.2 g",
        "Cholesterol > 74 mg",
        "Fat > 20.7 g",
        "Protein > 33.6 g",
        "Sodium > 1038 mg"
    ],
    "n": "Asian Zucchini-and-Chicken Burgers",
    "a": "SunnyDaysNora",
    "r": "0",
    "s": 4,
    "des": "\"These tasty burgers are moist and flavorful! My family hates zucchini, but they love these burgers. Once they cook you can't even tell the zucchini is in there! The perfect way to sneak extra veggies into my family's diet while using up the bounty from the garden. Serve with a dill pickle spear on the side.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease a baking sheet.\nMix ground chicken, zucchini, green onions, bread crumbs, chile paste, 1 teaspoon sesame oil, garlic powder, red pepper flakes, fish sauce, ground ginger, 1/2 teaspoon black pepper, and salt in a large bowl. Form into 4 patties and place on prepared baking sheet.\nBake in preheated oven for 10 minutes, flip, and continue baking until no longer pink in the center and the juices run clear, about 10 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nWhisk mayonnaise, chile-garlic sauce, mustard, 1 teaspoon sesame oil, lemon juice, and 1 teaspoon pepper together in a bowl.\nSpread sauce onto cut sides of hamburger buns. Stack lettuce, tomato, and onion onto one side of each bun. Top vegetables with a burger and complete sandwiches with remaining bun halves.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "1071724.jpg",
    "o": "",
    "st": "allrecipes"
}