{
    "id": 235702,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 beets, stems removed",
        "4 large carrots, cut diagonally into 1 1/2-inch slices",
        "1 large onion, cut in half and thinly sliced",
        "Dressing:",
        "1 1/2 cups cider vinegar",
        "2/3 cup sugar",
        "2 teaspoons ground ginger",
        "2 teaspoons orange zest",
        "2 teaspoons dried dill",
        "1 1/2 teaspoons sea salt",
        "1 teaspoon garlic powder",
        "1 teaspoon dry mustard",
        "1/4 teaspoon freshly ground black pepper",
        "1/3 cup olive oil"
    ],
    "nut": [
        "Calories > 139 kcal",
        "Carbs > 19.4 g",
        "Cholesterol > 0 mg",
        "Fat > 6.3 g",
        "Protein > 1.2 g",
        "Sodium > 271 mg"
    ],
    "n": "Fresh Pickled Beet Melody",
    "a": "Ginger Hackley",
    "r": "0",
    "s": 12,
    "des": "\"A modern day spin on an old-time favorite, incorporating fresh beets, carrots. and onion in a tangy, sweet marinade. Very quick and easy to make. Beets stain! Make sure to wear an apron!\"",
    "ins": "Place whole beets in a pot and cover with water. Bring water to a boil, cover the pot, reduce heat to medium-low, and cook until beets are tender, about 30 minutes.\nPlace carrots in a microwave-safe dish and cook on high until firm but tender, about 6 minutes. Place carrots in a colander under cold water to stop the cooking process, 3 to 5 minutes. Remove peels and discard; cut beets into thin slices.\nWhisk cider vinegar, sugar, ginger, orange zest, dill, sea salt, garlic powder, mustard, and black pepper together in a microwave-safe bowl until sugar and salt dissolve. Whisk oil into cider dressing mixture. Microwave dressing on high for 2 minutes; whisk again.\nCombine beets, carrots, and onions together in a large container; pour dressing on top and mix well. Cover the container and refrigerate for at least 24 hours before serving.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 d ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}