{
    "id": 235752,
    "old_rating": "4.39474",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup water",
        "3 tablespoons dry onion soup mix",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon minced garlic",
        "1/2 teaspoon ground black pepper",
        "1 1/2 pounds ground turkey",
        "1 cup Italian-seasoned bread crumbs",
        "1 egg",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1 (10.75 ounce) can water",
        "3 tablespoons brown gravy mix"
    ],
    "nut": [
        "Calories > 238 kcal",
        "Carbs > 16 g",
        "Cholesterol > 86 mg",
        "Fat > 10.1 g",
        "Protein > 20.5 g",
        "Sodium > 856 mg"
    ],
    "n": "Turkey Salisbury Steak",
    "a": "Sharon Angel",
    "r": "0",
    "s": 8,
    "des": "\"Reminds me of the old school days lunch. YUM! Ground turkey is mixed and then formed into patties which are baked and served with a mushroom gravy.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nWhisk 1 cup water, onion soup mix, Worcestershire sauce, garlic, and black pepper together in a bowl. Strain mixture, reserving solids and broth. Pour 1/2 cup broth and the solids into a large bowl; mix turkey, bread crumbs, and egg into broth-solids mixture until thoroughly combined. Scoop 8 portions using 1/2 cup measure and form each into an oval patty; arrange on a baking sheet.\nBake in the preheated oven until no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nWhisk remaining broth, mushroom soup, 1 can water, and gravy mix together in a saucepan until smooth; bring to a boil, stirring constantly. Remove from heat.\nFlip patties and pour gravy over each. Continue to cook until gravy has slightly thickened, about 10 more minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "4512783.jpg",
    "o": "4488769.jpg,4488768.jpg,4378122.jpg,4285839.jpg,4011287.jpg,3186941.jpg",
    "st": "allrecipes"
}