{
    "id": 235799,
    "old_rating": "4.71053",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 1/2 ounces dark chocolate, chopped",
        "1 tablespoon butter",
        "2 tablespoons water",
        "1/8 teaspoon ground dried chipotle pepper",
        "1 tiny pinch salt",
        "2 large egg yolks",
        "2 tablespoons water",
        "1 tablespoon white sugar",
        "1/2 cup heavy whipping cream, chilled",
        "1 tablespoon heavy whipping cream, chilled"
    ],
    "nut": [
        "Calories > 297 kcal",
        "Carbs > 19.8 g",
        "Cholesterol > 156 mg",
        "Fat > 24.8 g",
        "Protein > 3.1 g",
        "Sodium > 89 mg"
    ],
    "n": "Chef John's Dark Chocolate Mousse",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"This has a pinch of chile pepper as the secret ingredient. It's firm yet unbelievably light and airy. The little bit of chile pepper is in there just to bring out the flavor of the chocolate and add a tiny bit of delicious heat. Garnish each serving with a dollop of whipped cream and a sprinkle of shaved chocolate.\"",
    "ins": "Bring a saucepan of water to a simmer over low heat. Place chocolate, butter, 2 tablespoons water, ground chipotle pepper, and salt in a heatproof bowl; set bowl over the simmering water. When the butter melts, whisk the chocolate mixture gently until smooth and shiny. Set aside to cool for a few minutes.\nWhisk egg yolks, 2 tablespoons water, and sugar in another heatproof bowl over the same pan of simmering water until egg yolk mixture is foamy and hot to the touch, about 3 minutes. Pour hot egg mixture into warm chocolate mixture, whisk until smooth, and set over a bowl of ice to chill. Whisk constantly until mixture has cooled to room temperature or slightly cooler.\nPour 1/2 cup and 1 tablespoon cold cream into a chilled metal bowl; whisk until cream holds soft peaks. Place about half the whipped cream into the cooled chocolate mixture; gently fold the cream into the chocolate. Repeat with remaining half of whipped cream, folding gently until nearly all the streaks have disappeared. Divide mousse into 4 6-ounce ramekins.\nCover each ramekin with plastic wrap and refrigerate at least 4 hours (up to overnight) before serving.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "4 h ",
    "i": "3935944.jpg",
    "o": "3935944.jpg,3598775.jpg,2546672.jpg,2432957.jpg,2143078.jpg,2040868.jpg",
    "st": "allrecipes"
}