{
    "id": 235888,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cookies:",
        "3 1/2 cups all-purpose flour, or as needed",
        "4 teaspoons baking powder",
        "1 cup white sugar",
        "1/2 cup butter, softened",
        "4 eggs",
        "1 cup cocoa powder",
        "2 tablespoons orange-flavored liqueur",
        "2 teaspoons vanilla extract",
        "Icing:",
        "2 cups sifted confectioners' sugar",
        "2 tablespoons orange-flavored liqueur",
        "2 tablespoons water",
        "2 teaspoons vanilla extract"
    ],
    "nut": [
        "Calories > 204 kcal",
        "Carbs > 36 g",
        "Cholesterol > 41 mg",
        "Fat > 5.4 g",
        "Protein > 3.7 g",
        "Sodium > 122 mg"
    ],
    "n": "Italian Christmas Cookies with Cocoa and Orange Liqueur",
    "a": "Ignazia Vella",
    "r": "0",
    "s": 24,
    "des": "\"Very good! Decorate cookies with your favorite sprinkles.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease 2 baking sheets.\nSift flour and baking powder together in a bowl. Beat white sugar and butter together in a separate bowl using an electric mixer until smooth and creamy; beat in eggs. Stir creamed butter mixture, cocoa powder, 2 tablespoons liqueur, and 2 teaspoons vanilla extract into flour mixture until dough is just combined.\nTurn dough onto a lightly floured work surface and knead, adding flour as needed to keep from dough sticking to your hands. Roll dough, 1 to 2 tablespoons per cookie, in your hands and form a log-shape; twirl log into desired shape. Place cookies on the prepared baking sheet.\nBake in the preheated oven until edges of cookies are lightly browned, about 10 minutes.\nStir confectioners' sugar, 2 tablespoons liqueur, water, and 2 teaspoons vanilla extract together in a bowl until icing is creamy. Dip cookies into icing. Place a piece of waxed paper under a wire rack and place cookies on wire rack to cool.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "2963100.jpg",
    "o": "",
    "st": "allrecipes"
}