{
    "id": 235832,
    "old_rating": "3.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups white sugar",
        "1 cup butter, softened",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "1 teaspoon almond extract",
        "2 cups all-purpose flour",
        "3/4 cup hot chocolate mix (such as CarnationÂ® Rich and Creamy)",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 2/3 cups chopped white chocolate",
        "12 peppermint candy canes, crushed",
        "1 (10.5 ounce) package miniature marshmallows"
    ],
    "nut": [
        "Calories > 143 kcal",
        "Carbs > 23.7 g",
        "Cholesterol > 15 mg",
        "Fat > 4.9 g",
        "Protein > 1.1 g",
        "Sodium > 85 mg"
    ],
    "n": "Candy Cane Hot Chocolate Cookies",
    "a": "Closet Gourmet",
    "r": "0",
    "s": 60,
    "des": "\"I developed these cookies over the past two Christmases, testing and retesting until they were perfect. They are super pretty, rich, and chewy from the additions of mini marshmallows and hot chocolate mix with just the right amount of peppermint flavor from the crushed candy canes. They are also the perfect accompaniment to a steaming mug of hot cocoa on a snowy day.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBeat sugar and butter together in a bowl using an electric mixer until smooth and creamy; beat in eggs, 1 at a time, until incorporated. Stir vanilla extract and almond extract into butter mixture.\nWhisk flour, hot chocolate mix, baking soda, and salt together in a separate bowl; stir into butter mixture until dough is smooth. Fold white chocolate into dough. Drop rounded teaspoonfuls of dough, about 2-inches apart, onto baking sheets. Generously sprinkle crushed candy canes over cookie dough.\nBake in the preheated oven until edges of cookies are slightly crisp, 8 to 10 minutes. Immediately arrange marshmallows onto hot cookies; cool on baking sheets until set. Transfer cookies to wire racks to cool completely.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "55 m",
    "i": "3023412.jpg",
    "o": "",
    "st": "allrecipes"
}