{
    "id": 235808,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package whole grain elbow macaroni",
        "1/2 cup water",
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "1 1/2 cups skim milk",
        "10 ounces shredded extra-sharp Cheddar cheese",
        "4 slices American cheese",
        "1/2 cup grated Parmesan cheese",
        "2 1/2 cups butternut squash soup",
        "1/2 teaspoon salt, or to taste",
        "1/4 teaspoon ground black pepper, or to taste"
    ],
    "nut": [
        "Calories > 517 kcal",
        "Carbs > 54.9 g",
        "Cholesterol > 71 mg",
        "Fat > 24.2 g",
        "Protein > 24.7 g",
        "Sodium > 893 mg"
    ],
    "n": "Wacky Whole Grain Butternut Squash Mac and Cheese",
    "a": "WendyWendy",
    "r": "0",
    "s": 8,
    "des": "\"Traditional baked mac and cheese with my children-tested healthy twists. Beware: they now will not eat mac out of a box, and neither will you! When you remove from oven it should look a bit loose still; if it isn't it cooked too long. Lessen cooking time for next time. You can use any whole grain short pasta for this recipe.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nCombine elbow macaroni and water in the bottom of a 9x11-inch baking dish.\nMelt butter in a large saucepan over medium heat. Whisk flour into melted butter until smooth. Gradually whisk milk into flour mixture; bring to a boil and cook, stirring constantly, until smooth and thick, about 2 minutes.\nStir Cheddar cheese, American cheese, and Parmesan cheese into milk mixture until cheeses are melted and mixture is smooth. Gradually stir butternut squash soup into cheese mixture. Season with salt and pepper to taste.\nPour cheese mixture over elbow macaroni and stir to combine.\nBake in the preheated oven until top begins to brown, about 50 minutes. Let cool for 10 minutes before serving.",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "1088937.jpg",
    "o": "",
    "st": "allrecipes"
}