{
    "id": 235950,
    "old_rating": "4.7027",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (5 pound) pork butt roast",
        "2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "1 teaspoon onion powder",
        "1 teaspoon garlic powder",
        "1 (12 fluid ounce) can beer (such as ShinerÂ® Bock)",
        "1 (12 ounce) bottle barbeque sauce (such as Sweet Baby Ray'sÂ®)"
    ],
    "nut": [
        "Calories > 209 kcal",
        "Carbs > 8.7 g",
        "Cholesterol > 53 mg",
        "Fat > 11.8 g",
        "Protein > 14.5 g",
        "Sodium > 568 mg"
    ],
    "n": "Slow Cooker Beer Pulled Pork",
    "a": "Paula T",
    "r": "0",
    "s": 16,
    "des": "\"My way of making pulled pork is simple: slow cooker, 1 can of beer, a 5 to 6 pound pork butt, seasonings, and a bottle of barbecue sauce. \n\nMy beer choice is Shiner BockÂ®. My seasoning choices are salt, pepper, onion powder, and garlic powder. My barbecue sauce choice is Sweet Baby Ray'sÂ®. \n\nJust put it in a slow cooker before you go to bed and when you wake up the magic has happened. See for yourself. This recipe is perfect for a party, and you can even prepare 2 and feed around 30 people. Serve on onion or hamburger buns.\"",
    "ins": "Set the slow cooker to High.\nPlace the pork in the slow cooker. Season top of pork with salt, pepper, onion powder, and garlic powder. Pour beer into the bottom of the slow cooker and place the lid on the slow cooker crock.\nCook pork on High for 1 hour. Reduce slow cooker heat to Low and cook for at least 8 hours or overnight.\nRemove pork from the slow cooker and shred with two forks. Discard juices and rinse out slow cooker crock. Return shredded pork to slow cooker and stir barbeque sauce into pork.\nCook on Medium for 1 hour.",
    "pt": "10 m",
    "ct": "10 h",
    "tt": "10 h ",
    "i": "4538170.jpg",
    "o": "4538170.jpg,4465077.jpg,4462011.jpg,4102587.jpg,1999606.jpg,1999599.jpg",
    "st": "allrecipes"
}