{
    "id": 235946,
    "old_rating": "4.50943",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups peanut butter",
        "1 cup shortening",
        "2/3 cup white sugar",
        "2/3 cup brown sugar",
        "1/4 cup milk",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "3 cups flour",
        "2 teaspoons baking soda",
        "1 teaspoon salt",
        "1/4 cup white sugar, or as needed",
        "2 (12 ounce) bags milk chocolate candy kisses (such as Hershey's KissesÂ®), unwrapped"
    ],
    "nut": [
        "Calories > 216 kcal",
        "Carbs > 22.7 g",
        "Cholesterol > 11 mg",
        "Fat > 12.9 g",
        "Protein > 4.1 g",
        "Sodium > 154 mg"
    ],
    "n": "Peanut Butter Blossoms",
    "a": "ramsey_luver",
    "r": "0",
    "s": 48,
    "des": "\"This started as my mother's recipe, but I made adjustments over time to find the right peanut butter cookie base which is solid enough not to break but soft when you bite into them. These have been a family holiday favorite for many years, hope yours enjoys them too!\"",
    "ins": "Beat peanut butter, shortening, 2/3 cup white sugar, brown sugar, milk, eggs, and vanilla extract together with an electric mixer in a large bowl until creamy and smooth.\nSift flour, baking soda, and salt together in a bowl. Gradually fold flour mixture into peanut butter mixture to form a smooth dough. Cover bowl with plastic wrap and refrigerate until chilled, about 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nPour 1/4 cup white sugar into a shallow bowl. Scoop dough into 1-inch balls, roll balls in sugar, and place 1 1/2 inches apart on baking sheets.\nBake cookies in the preheated oven for 6 minutes; rotate cookie sheets and continue baking for another 3 minutes. Press a chocolate kiss about halfway down in the center of each cookie. Bake for until chocolate begins to melt and lose form, another 2 to 3 minutes. Cool on wire racks until chocolate hardens, at least 3 hours.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "4 h ",
    "i": "2551388.jpg",
    "o": "4509368.jpg,4379473.jpg,4377314.jpg,4323791.jpg,4314579.jpg,4298401.jpg",
    "st": "allrecipes"
}