{
    "id": 235951,
    "old_rating": "4.67647",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons bacon grease",
        "1 large onion, diced",
        "2 carrots, peeled and diced",
        "3 stalks celery, diced",
        "2 cloves garlic, crushed",
        "3 potatoes, diced",
        "8 cups hot water",
        "8 cubes chicken bouillon",
        "1 ham bone",
        "1 (14 ounce) can diced tomatoes",
        "1/2 (16 ounce) package frozen corn",
        "1 (8 ounce) can tomato sauce",
        "1 teaspoon black pepper",
        "1/2 teaspoon salt"
    ],
    "nut": [
        "Calories > 108 kcal",
        "Carbs > 18.8 g",
        "Cholesterol > 3 mg",
        "Fat > 2.8 g",
        "Protein > 3 g",
        "Sodium > 1042 mg"
    ],
    "n": "Ham Bone and Vegetable Soup",
    "a": "JustGman1111",
    "r": "0",
    "s": 12,
    "des": "\"I was looking for a good use of a ham bone without the heavy cream of a potato soup. I made use of a few other recipes to come up with one that I thought my husband and I would like. I think it is important to start with the three basics: onion, celery, and carrots. In addition, you can add a variety of different vegetables to suit your taste or depending on what you have in the house at the time.\"",
    "ins": "Melt bacon grease in a large skillet over medium-high heat. Cook and stir onion, carrots, celery, and garlic in hot bacon grease until vegetables are slightly tender and fragrant, about 5 minutes. Stir potatoes into onion mixture; cook and stir until golden, about 10 minutes.\nStir hot water and chicken bouillon together in a slow cooker until bouillon is dissolved; add onion mixture, ham bone, diced tomatoes, corn, tomato sauce, black pepper, and salt.\nCook soup in the slow cooker set to Low for 4 to 6 hours. Remove ham bone from soup and let rest until cool enough to handle. Remove meat from ham bone and stir meat into soup.",
    "pt": "20 m",
    "ct": "4 h",
    "tt": "4 h ",
    "i": "3997408.jpg",
    "o": "",
    "st": "allrecipes"
}