{
    "id": 235900,
    "old_rating": "4.52381",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup good-quality unsweetened cocoa (such as Guittard Cocoa Rouge), not packed",
        "1/2 cup real maple syrup",
        "1 teaspoon vanilla extract",
        "1 pinch salt",
        "1/2 cup refined coconut oil, melted",
        "1/2 cup chopped walnuts",
        "1 teaspoon unsweetened cocoa powder for dusting, or as needed"
    ],
    "nut": [
        "Calories > 78 kcal",
        "Carbs > 5.8 g",
        "Cholesterol > 0 mg",
        "Fat > 6.5 g",
        "Protein > 0.7 g",
        "Sodium > 1 mg"
    ],
    "n": "Chef John's Christmas Miracle Fudge",
    "a": "Chef John",
    "r": "0",
    "s": 24,
    "des": "\"It's appropriate to call this Miracle Fudge because of how it's made. This is 100% vegan, is absolutely delicious, and will make a beautiful holiday gift.\"",
    "ins": "Place 1/2 cup cocoa powder into a mixing bowl and stir in maple syrup, vanilla extract, and salt. Pour in melted coconut oil and stir until thoroughly combined. Continue to stir until coconut oil hardens and the mixture looks grainy and thick.\nPlace walnuts into a dry skillet over medium heat; shake skillet until walnuts are hot and smell nutty and fragrant, 30 seconds to 1 minute. Turn off heat and let walnuts cool slightly, about 1 more minute.\nStir warm walnuts into fudge; mixture will soften from the walnuts' heat. Stir fudge until smooth and glossy.\nPour fudge into a silicone mold for making small ice cubes. Scrape any excess fudge back into the mixing bowl. Smooth the tops of the fudge pieces.\nWrap mold in plastic wrap and freeze until fudge is firm and set, at least 30 minutes. Remove plastic wrap and pop each fudge piece out of the mold. Dust pieces lightly with 1 teaspoon cocoa powder before serving or packaging as gifts. Serve cold; freeze leftovers.",
    "pt": "15 m",
    "ct": "5 m",
    "tt": "50 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}