{
    "id": 235902,
    "old_rating": "4.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package fully cooked pulled pork without the sauce*",
        "10 (1/2 ounce) slices thin sliced smoked deli ham, cut in half",
        "5 thin slices  baby Swiss cheese, cut into quarters",
        "20 Kosher dill pickle chips",
        "1/4 cup Dijon mustard",
        "40 RITZ Crackers",
        "20 frilled toothpicks (optional)"
    ],
    "nut": [
        "Calories > 106 kcal",
        "Carbs > 7 g",
        "Cholesterol > 23 mg",
        "Fat > 5 g",
        "Protein > 7.9 g",
        "Sodium > 461 mg"
    ],
    "n": "RITZ Cuban Minis",
    "a": "ReneePaj",
    "r": "0",
    "s": 20,
    "des": "\"Cuban food is very popular, and this recipe was inspired by its culture, flavorful cooking, and especially by a sandwich made at La Flor de Broadway, a little lunch counter in the neighborhood known locally as 'El Rey de Sandwich Cubano.'\"",
    "ins": "Preheat broiler on HIGH. Set an oven rack about 5 to 6 inches from the heat source. Line a large baking sheet with foil.\nWith two forks, break apart any large chunks of the packaged pulled pork.  Place the pork between several layers of paper towels and press, to get it as dry as possible. (This will help prevent the cracker from softening before serving.)\nTo assemble sandwiches: Place 20 RITZ Crackers, flat side up, on the prepared baking sheet.  Top each with approximately 1 tablespoon pulled pork. Next, fold a 1/2 slice of ham into thirds and place on top of pulled pork.  Then, top ham with the quarter-slices of baby Swiss cheese.\nPlace the baking sheet 6-inches under the broiler until cheese is melted and bubbly, 1 to 2 minutes. Remove from broiler.\nTop each mini bite with a 1/2 pickle slice and about 1/2 tsp. mustard then top with remaining crackers, flat side down.\nOptional:  Gently insert a fancy toothpick into the middle hole of the RITZ Cracker to help hold it together.\nServe immediately.",
    "pt": "10 m",
    "ct": "2 m",
    "tt": "12 m",
    "i": "1078040.jpg",
    "o": "3338434.jpg,2675146.jpg,1100097.jpg,1097292.jpg,1096114.jpg,1095900.jpg",
    "st": "allrecipes"
}