{
    "id": 235926,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup shortening",
        "1 cup butter, softened",
        "2 1/4 cups white sugar",
        "3 eggs",
        "1 tablespoon vanilla extract",
        "1 teaspoon almond extract",
        "5 1/4 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1 1/2 teaspoons salt",
        "1 cup slivered almonds, chopped",
        "1 cup white chocolate chips",
        "1 (6 ounce) package cherry-flavored sweetened dried cranberries (such as cherry-flavor CraisinsÂ®)"
    ],
    "nut": [
        "Calories > 129 kcal",
        "Carbs > 15.5 g",
        "Cholesterol > 14 mg",
        "Fat > 6.8 g",
        "Protein > 1.6 g",
        "Sodium > 80 mg"
    ],
    "n": "Soft Sugar Cookies With White Chocolate, Almonds, and Cranberries",
    "a": "Debbie Kohler",
    "r": "0",
    "s": 78,
    "des": "\"This recipe makes a great Christmas cookie. The white chocolate chips, chopped almonds, and dried cherry-flavored cranberries create the perfect combination in a simple soft sugar cookie dough. It just seems to taste like a 'mouthful of Christmas.'\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBeat sugar, shortening, and butter together in a large bowl with an electric mixture until smooth. Beat eggs, vanilla extract, and almond extract into butter mixture.\nWhisk flour, baking powder, and salt together in a bowl. Gradually add flour mixture to butter mixture until dough just comes together. Stir almonds, white chocolate chips, and dried cranberries into the dough.\nDrop rounded tablespoons of dough about 2 inches apart on baking sheets. Bake cookies until bottom edges are light golden brown, 10 to 12 minutes. Cool cookies for 5 minutes before transferring to a wire rack to cool completely.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "35 m",
    "i": "3032204.jpg",
    "o": "",
    "st": "allrecipes"
}