{
    "id": 235961,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package cream cheese, softened",
        "1 pinch onion powder, or to taste",
        "1 pinch garlic powder, or to taste",
        "1 dash Worcestershire sauce, or to taste",
        "1 dash soy sauce, or to taste",
        "1 pinch salt, or to taste",
        "1 pinch ground black pepper, or to taste",
        "1 cup chopped cooked chicken",
        "1 (16 ounce) package wonton wrappers",
        "peanut oil for frying"
    ],
    "nut": [
        "Calories > 498 kcal",
        "Carbs > 44.6 g",
        "Cholesterol > 66 mg",
        "Fat > 28.1 g",
        "Protein > 16 g",
        "Sodium > 563 mg"
    ],
    "n": "Chicken Rangoon",
    "a": "Suzanne Frideres",
    "r": "0",
    "s": 6,
    "des": "\"I had everything to make crab Rangoon one night except the crab. So I used leftover roasted chicken. Needless to say my family fell in love with them. I'm sharing my recipe, because I think your family will, too! You can substitute turkey or pork for the chicken.\"",
    "ins": "Heat oil in a deep-fryer or deep, large saucepan to 375 degrees F (190 degrees C).\nStir cream cheese, onion powder, garlic powder, Worcestershire sauce, soy sauce, salt, and pepper together in a bowl. Add chicken and stir until completely incorporated.\nSeparate and place wonton wrappers onto work surface. Spoon about 1 teaspoon of the cream cheese filling onto the center of each wrapper. Use your finger or a pastry brush to lightly moisten the edges of the wonton wrappers with water. Fold one corner of the wrapper over the filling onto the opposite corner to form a triangle. Press the edges together to seal.\nWorking in batches, cook wontons in hot oil until wonton is lightly browned, 2 to 4 minutes. Remove to paper towel-lined plate to drain.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "25 m",
    "i": "3438494.jpg",
    "o": "",
    "st": "allrecipes"
}