{
    "id": 236093,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 tablespoons unsalted butter",
        "3 ounces semisweet chocolate, chopped",
        "1 1/4 cups sugar",
        "1/2 cup unsweetened cocoa powder",
        "1/4 teaspoon salt",
        "1 tablespoon instant espresso powder",
        "1/2 teaspoon vanilla extract",
        "1 teaspoon Kahlua liqueur",
        "2 large cold eggs",
        "1/2 cup flour",
        "1/4 cup chopped walnuts",
        "10 miniature marshmallows",
        "1/4 cup white or dark chocolate chips"
    ],
    "nut": [
        "Calories > 139 kcal",
        "Carbs > 17.2 g",
        "Cholesterol > 28 mg",
        "Fat > 7.9 g",
        "Protein > 1.7 g",
        "Sodium > 32 mg"
    ],
    "n": "Rocky Road Kahlua Brownies",
    "a": "KahluaÂ®",
    "r": "0",
    "s": 24,
    "des": "\"Chewy, fudgy and gooey all at the same time! Classic Rocky Road Brownies with a twist--add some espresso and Kahlua liqueur to make a holiday dessert. They're perfect for cocktail parties!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Prepare an 8x8-inch pan by greasing and lining with parchment paper.\nPlace butter, chocolate, sugar, cocoa, and salt in a large mixing bowl. Set over a saucepan of simmering water (or use a double boiler). Stir to combine until butter is melted and the mixture feels hot to the touch. Set aside and allow to cool to just warm.\nStir in vanilla; add eggs one at a time, stirring vigorously after each addition. Mix in espresso powder and coffee liqueur. Add flour and combine. Continue to stir vigorously for about 40 strokes. Pour into a prepared baking pan.  Top with chopped walnuts.\nBake for 20 to 25 minutes, or until a toothpick inserted into the center of the brownie comes out with a few moist crumbs.\nRemove the brownie from the oven, top with marshmallows and chocolate chips. Return to the oven, turn off heat, and allow the topping to melt onto the brownie for 3-5 minutes in the still warm oven. Remove and cool completely on a wire rack before cutting.",
    "pt": "12 m",
    "ct": "40 m",
    "tt": "52 m",
    "i": "1089864.jpg",
    "o": "",
    "st": "allrecipes"
}