{
    "id": 236002,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups water",
        "2 cups peeled and cubed potatoes",
        "1/2 cup chopped onion",
        "2 cloves garlic, chopped",
        "salt and ground black pepper to taste",
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "2 cups 1% milk",
        "1 (8 ounce) package low-fat cream cheese",
        "1 cup shredded sharp Cheddar cheese",
        "1 (15 ounce) can corn",
        "1 1/2 cups cubed fully cooked ham"
    ],
    "nut": [
        "Calories > 471 kcal",
        "Carbs > 34.7 g",
        "Cholesterol > 83 mg",
        "Fat > 28.4 g",
        "Protein > 21.5 g",
        "Sodium > 975 mg"
    ],
    "n": "Cheddar Ham Chowder",
    "a": "David N Angela Ferber",
    "r": "0",
    "s": 6,
    "des": "\"Delicious, very modifiable chowder. Serve this with a salad and rolls or beer bread. Yum! Consider this a basic recipe that can be modified according to specific tastes and needs. Carrots and celery can be added when cooking the potatoes if desired. Bacon would be delicious in this as well.\"",
    "ins": "Bring water, potatoes, onion, garlic, salt, and pepper to a boil in a large saucepan. Reduce heat, cover with a lid, and simmer until vegetables are just tender, 8 to 10 minutes. Remove saucepan from heat.\nMelt butter in a separate large saucepan over medium heat. Stir flour into melted butter until smooth. Gradually stir milk into butter-flour mixture; bring to a boil. Reduce heat and simmer, stirring constantly, until thickened, about 2 minutes.\nStir cream cheese and Cheddar cheese into milk mixture until melted. Pour potato mixture, including liquid, into milk-cheese mixture; add corn and ham. Cook, stirring occasionally, until soup is heated through, 10 to 15 more minutes.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "4499288.jpg",
    "o": "",
    "st": "allrecipes"
}