{
    "id": 236017,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 red potatoes, cut into chunks",
        "2 tablespoons olive oil",
        "1 1/2 pounds skinless, boneless chicken breast halves, cut into chunks",
        "1 yellow onion, chopped",
        "2 cloves garlic, minced",
        "1/2 butternut squash, seeds removed",
        "1 (15 ounce) can cannellini beans",
        "3 cups chicken broth, or as needed",
        "1 (15 ounce) can cannellini beans, drained and rinsed",
        "1 (8.3 ounce) can butternut squash soup (such as Campbell'sÂ® V8Â®)",
        "2 stalks celery, chopped",
        "2 apples - peeled, cored, and cut into chunks",
        "1 (1.25 ounce) package white chicken chili seasoning mix (such as McCormickÂ®)"
    ],
    "nut": [
        "Calories > 508 kcal",
        "Carbs > 69.7 g",
        "Cholesterol > 72 mg",
        "Fat > 10.1 g",
        "Protein > 36.8 g",
        "Sodium > 1505 mg"
    ],
    "n": "Squash, Bean, and Apple Stew",
    "a": "elliebry",
    "r": "0",
    "s": 6,
    "des": "\"A hearty stew with many ingredients and lots of healthy goodness. Very versatile, too; add carrots or any veggies you like.\"",
    "ins": "Place potatoes into a pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\nHeat oil in a skillet over medium heat. Saute chicken in hot oil until no longer pink in the center, 5 to 7 minutes. Stir onions and garlic into chicken and cook and stir until onion is translucent, about 5 minutes.\nPlace butternut squash in a microwave-safe dish and cover dish with plastic wrap. Cook squash in the microwave on high until squash is tender, about 10 minutes. Remove flesh from squash skin with a fork.\nPuree 1 can cannellini beans with liquid in a blender until smooth.\nCombine potatoes, chicken mixture, butternut squash, pureed cannellini beans, chicken broth, drained cannellini beans, butternut squash soup, celery, apples, and chili seasoning mix together in a large pot. Bring to a boil, reduce heat to medium-low, and cook until flavors blend, about 30 minutes.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}