{
    "id": 236063,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "35 NILLA Wafers, finely crushed",
        "1/4 cup butter, melted",
        "1 (3.9 ounce) package JELL-O Chocolate Instant Pudding",
        "2 cups cold milk, divided",
        "4 ounces PHILADELPHIA Cream Cheese, softened",
        "1 (3.4 ounce) package JELL-O Vanilla Flavor Instant Pudding",
        "1/2 cup PLANTERS Creamy Peanut Butter, divided",
        "2 cups thawed COOL WHIP Whipped Topping, divided",
        "1/2 ounce BAKER'S Semi-Sweet Chocolate"
    ],
    "nut": [
        "Calories > 287 kcal",
        "Carbs > 31.3 g",
        "Cholesterol > 26 mg",
        "Fat > 16.3 g",
        "Protein > 4.8 g",
        "Sodium > 424 mg"
    ],
    "n": "Mile-High Peanut Butter Pie",
    "a": "Philadelphia",
    "r": "0",
    "s": 12,
    "des": "\"What's better than layer upon layer of chocolate and creamy peanut butter? A pie made of the same, with (even more) warm chocolate and peanut butter drizzled on top.\"",
    "ins": "Heat oven to 375 degrees F.\nMix wafer crumbs and butter until blended; press onto bottom and up side of 9-inch pie plate. Bake 10 minutes; cool.\nBeat chocolate pudding mix and 1 cup milk with whisk 2 min. (Pudding will be thick.) Spread onto bottom of crust. Gradually add remaining milk to cream cheese in large bowl with mixer until blended. Add vanilla pudding mix; beat 2 min. Reserve 1 Tbsp. peanut butter. Add remaining to vanilla pudding mixture; beat until blended. Stir in 1 cup COOL WHIP. Spread over chocolate pudding layer to within 1 inch of edge. Spoon remaining COOL WHIP onto center of pie.\nRefrigerate 3 hours. When ready to serve, microwave remaining peanut butter in microwaveable bowl on HIGH 15 sec. or until melted. Melt chocolate as directed on package. Drizzle peanut butter and chocolate over pie.",
    "pt": "15 m",
    "ct": "",
    "tt": "",
    "i": "1087281.jpg",
    "o": "",
    "st": "allrecipes"
}