{
    "id": 236015,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound skinless, boneless chicken breast halves",
        "1 1/2 cups shredded Monterey Jack cheese",
        "1 cup shredded Cheddar cheese",
        "1 (8 ounce) package cream cheese, softened",
        "salt and pepper to taste",
        "1 (8 ounce) package refrigerated crescent roll dough",
        "2 tablespoons melted butter, or as needed"
    ],
    "nut": [
        "Calories > 432 kcal",
        "Carbs > 12.1 g",
        "Cholesterol > 104 mg",
        "Fat > 31.1 g",
        "Protein > 24.6 g",
        "Sodium > 553 mg"
    ],
    "n": "Cheesy Chicken Wraps",
    "a": "Amy M",
    "r": "0",
    "s": 8,
    "des": "\"Super quick and easy chicken that is easily varied! This is great to play with: add part of a ranch seasoning packet, garlic, or maybe add some scallions. You can also switch up the cheeses! Great with pepper jack cheese. When I make it fairly plain my son likes to dip the roll ups in ranch.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.\nPlace chicken breasts into a large pot and cover with salted water by several inches; bring to a boil. Reduce heat to medium and simmer until no longer pink in the center and the juices run clear, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove chicken from water and cool. Shred chicken using two forks.\nThoroughly mix Monterey Jack cheese, Cheddar cheese, cream cheese, salt, and pepper together in a bowl. Stir chicken into cheese mixture.\nSeparate crescent roll dough and lay each piece flat on a work surface. Spread chicken-cheese mixture onto each piece of dough and roll dough into crescent roll shapes. Place rolls on prepared baking sheet and brush with melted butter.\nBake in the preheated oven until cheese is melted and rolls are golden, 20 to 25 minutes.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "2039535.jpg",
    "o": "",
    "st": "allrecipes"
}