{
    "id": 236037,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 tablespoons butter, divided",
        "2 small onions, minced, divided",
        "1/2 pound ground pork",
        "1/2 pound lean ground beef",
        "1 cup fine bread crumbs",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon ground black pepper",
        "2 eggs, beaten",
        "16 thin slices beef top round",
        "4 large dill pickles, quartered lengthwise",
        "2/3 cup chopped celery",
        "1 carrot, chopped",
        "4 garlic cloves, minced",
        "3 cups water",
        "1 (6 ounce) can tomato paste",
        "1/3 cup sherry",
        "4 packets beef bouillon granules",
        "1 bay leaf",
        "1 teaspoon cornstarch, or as needed",
        "1/3 cup cold water, or as needed"
    ],
    "nut": [
        "Calories > 476 kcal",
        "Carbs > 21.2 g",
        "Cholesterol > 161 mg",
        "Fat > 25.3 g",
        "Protein > 38.5 g",
        "Sodium > 2221 mg"
    ],
    "n": "Ontario Beef Rouladen",
    "a": "Leasa",
    "r": "0",
    "s": 8,
    "des": "\"The base of this recipe came from our area, the German community of a small town in Delhi, Ontario Canada. I've tweaked it a bit over time. My family loves this, and it's a good way to spend a cold afternoon. I serve this with whipped potatoes and a vegetable - tonight we had beets in Harvard sauce.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C).\nHeat 1 tablespoon butter over medium heat in a large frying pan; stir in 1 onion and saute until softened, about 5 minutes. Set aside to cool slightly.\nStir pork, ground beef, bread crumbs, salt, and pepper together in a bowl; stir in onion. Pour beaten eggs over meat mixture; mix with your hands until well combined.\nSpread about 1 1/2 tablespoons of meat mixture onto each beef slice; top each with one pickle quarter. Roll beef slices around filling; secure each roll with a toothpick.\nHeat 2 tablespoons butter in the same frying pan; place rolls into pan and brown on all sides, about 10 minutes. Remove rolls; place in a single layer in a roasting pan.\nHeat remaining 2 tablespoons butter in the same frying pan over medium heat; cook and stir remaining onion, celery, carrots, and garlic until vegetables are soft, about 10 minutes. Stir in 3 cups water, tomato paste, sherry, bouillon granules, and bay leaf; bring to a boil. Pour sauce over rolls in roasting pan.\nBake in the preheated oven until tender, about 3 hours; remove from oven to turn rolls over halfway through the cooking time.\nRemove rolls to a heated platter. Place roasting pan with sauce on the stove; bring to a boil. Whisk cornstarch and 1/3 cup water together in a cup; slowly whisk cornstarch mixture into sauce until thickened, about 5 minutes. Drizzle some sauce over the rouladen; serve the remaining sauce in a gravy boat.",
    "pt": "30 m",
    "ct": "3 h ",
    "tt": "4 h",
    "i": "1100839.jpg",
    "o": "",
    "st": "allrecipes"
}