{
    "id": 236016,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "2 pounds beef top round steak, cut into 1/2-inch cubes",
        "2 teaspoons ground black pepper",
        "2 yellow onions, diced",
        "2 tablespoons chopped garlic",
        "2 green bell pepper, diced",
        "1 yellow bell pepper, diced",
        "1 red bell pepper, diced",
        "3 (14.5 ounce) cans diced tomatoes",
        "2 (15 ounce) cans kidney beans, drained and rinsed",
        "2 (15 ounce) cans black beans, drained and rinsed",
        "1 (15 ounce) can yellow corn, drained",
        "1 (15 ounce) can tomato sauce"
    ],
    "nut": [
        "Calories > 377 kcal",
        "Carbs > 38.5 g",
        "Cholesterol > 68 mg",
        "Fat > 7.9 g",
        "Protein > 37.7 g",
        "Sodium > 887 mg"
    ],
    "n": "Fiesta Steak Chili",
    "a": "Steve Talbot",
    "r": "0",
    "s": 12,
    "des": "\"This is a basic recipe for non-traditional chili using steak. My wife is allergic to chili powder, so I don't use any in this recipe, but you are welcome to add some if you like. This is a very tame, full-flavor, colorful chili recipe that even the kids will like. There are plenty of other variations that you can use with this basic recipe, please change at will. Things we have tried include adding three or four fresh jalapenos, or adding TabascoÂ® habanaro sauce, or cilantro, or fresh tomatoes, or using red, yellow, orange, and green peppers, or hamburger instead of a steak or roast. Serve with tortilla chips, cheese and sour cream.\"",
    "ins": "Heat oil in a large pot over medium heat. Cook and stir steak and ground black pepper in hot oil until browned on all sides, 5 to 10 minutes.\nStir onions into beef; saute until onions are translucent, 3 to 4 minutes. Add garlic and cook until fragrant, about 1 minute.\nStir green bell peppers, yellow bell pepper, and red bell pepper into beef mixture one pepper at a time. Cook and stir until fragrant, 3 to 5 minutes.\nPour diced tomatoes, kidney beans, black beans, corn, and tomato sauce into beef-pepper mixture. Bring to a simmer and cook, stirring occasionally, until flavors blend and meat is tender, about 1 hour.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1093742.jpg",
    "o": "",
    "st": "allrecipes"
}