{
    "id": 236181,
    "old_rating": "4.76923",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil, or as needed",
        "3 chicken breasts, cut into cubes, or more to taste",
        "1/4 cup rice vinegar",
        "3 tablespoons soy sauce, or to taste",
        "2 teaspoons spicy mustard",
        "1/2 teaspoon chile oil",
        "1/2 cup Sriracha sauce, or more to taste",
        "1/2 cup butter, or to taste",
        "2 bunches green onions (scallions), chopped"
    ],
    "nut": [
        "Calories > 383 kcal",
        "Carbs > 12.3 g",
        "Cholesterol > 105 mg",
        "Fat > 29 g",
        "Protein > 19.7 g",
        "Sodium > 2196 mg"
    ],
    "n": "Sriracha Chicken with Scallions",
    "a": "Chas",
    "r": "0",
    "s": 4,
    "des": "\"I have adapted this recipe from a buffalo wing recipe. I was looking for something to cook with chicken, scallions, and Sriracha sauce with an Asian flavor. After about a year of tinkering, this is what I came up with. \n\nIt can be tweaked to accommodate personal taste on spiciness. Level of heat is akin to hot wings, maybe a step hotter. Everything in this recipe can be changed to suit personal tastes. Serve with steamed rice and any other side dishes you wish.\nThis is how I like to make it for my desired level of spicy. \n\nI would love any feedback and information on adaptations that have worked. Thanks!\"",
    "ins": "Coat the bottom of a skillet with vegetable oil and place over medium heat. Saute chicken in the hot oil until no longer pink in the center, 5 to 10 minutes. Add rice vinegar, soy sauce, mustard, chile oil, and Sriracha sauce, adding in exact order and waiting 1 minute between each addition for ingredient to layer.\nMelt butter, stirring occasionally, into the chicken mixture creating a sauce, 2 to 3 minutes; lower heat to medium-low. Add green onions and cook until slightly wilted, 2 to 3 minutes.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "4533555.jpg",
    "o": "",
    "st": "allrecipes"
}