{
    "id": 236104,
    "old_rating": "4.73469",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (8 pound) pork shoulder roast",
        "1 quart apple cider, or as needed",
        "BBQ Rub:",
        "5 tablespoons white sugar",
        "5 tablespoons light brown sugar",
        "2 tablespoons kosher salt",
        "2 tablespoons paprika",
        "1 tablespoon onion powder",
        "1 tablespoon freshly ground black pepper",
        "1 tablespoon garlic powder",
        "1 onion, chopped",
        "3 cups hickory chips, or more as needed, soaked in water"
    ],
    "nut": [
        "Calories > 442 kcal",
        "Carbs > 15.2 g",
        "Cholesterol > 104 mg",
        "Fat > 32.1 g",
        "Protein > 23.7 g",
        "Sodium > 2691 mg"
    ],
    "n": "Bob's Pulled Pork on a Smoker",
    "a": "bobthecook1",
    "r": "0",
    "s": 20,
    "des": "\"This is the correct way to smoke a pork shoulder with professional results--from the brine, to the rub and sauce, to the rave reviews you will receive. Smoke is the key to breaking down the fat which adds flavor and moisture to the shoulder. Place in a bun with your favorite BBQ sauce.\"",
    "ins": "Place pork shoulder in a large pot and add enough apple cider to cover. Combine white sugar, brown sugar, salt, paprika, onion powder, black pepper, and garlic powder in a bowl. Mix about 1/4 cup sugar rub into cider; reserve remaining rub.\nCover pot and refrigerate for 12 hours.\nPrepare smoker to about 210 degrees F (99 degrees C). Add enough wood chips to smoker.\nPour cider brine into the water pan of the smoker; add onion and about 1/4 cup more sugar rub. Spread remaining rub over pork shoulder. Transfer pork to the center of smoker.\nSmoke pork until very tender, about 8 hours. Monitor hickory chips and liquid, adding more wood and water, respectively, as needed. Transfer pork to a large platter and cool for 30 minutes before shredding with forks.",
    "pt": "10 m",
    "ct": "8 h",
    "tt": "20 h ",
    "i": "1198969.jpg",
    "o": "4539595.jpg,4537853.jpg,4537852.jpg,4507700.jpg,4483779.jpg,4475399.jpg",
    "st": "allrecipes"
}