{
    "id": 236103,
    "old_rating": "4.17391",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 (8 ounce) package panko bread crumbs",
        "6 (1-inch thick) bone-in pork chops, at room temperature",
        "1/2 cup mayonnaise, or as needed",
        "1 pinch Cajun seasoning, or to taste"
    ],
    "nut": [
        "Calories > 555 kcal",
        "Carbs > 29 g",
        "Cholesterol > 113 mg",
        "Fat > 35.8 g",
        "Protein > 37.3 g",
        "Sodium > 414 mg"
    ],
    "n": "Tom's Down To The Bone Pork Chops!",
    "a": "gutpyle",
    "r": "0",
    "s": 6,
    "des": "\"Are you sick 'n' tired of dried-out, tough pork chops? I was until I came up with this recipe. The trick to cooking meat and poultry is to know your internal temperatures. That is why you should invest in an instant-read, digital meat thermometer. I will NOT cook without one. And another thing people don'tÂ realize is that today's pork does NOT have to cook till it gets to 160 to 170 degrees F internal temperature. I like to serve these with some garlic smashed potatoes and grilled asparagus.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x13-inch baking dish with cooking spray and spread bread crumbs on a large plate.\nRinse pork chops and pat dry with paper towels.\nMix mayonnaise and Cajun seasoning in a bowl; brush mayonnaise mixture over pork chops. Gently press pork chops into bread crumbs to coat, shaking off excess crumbs. Arrange breaded pork chops in the prepared baking dish. Repeat with remaining chops.\nBake in the preheated oven until pork is slightly pink in the center, about 35 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Loosely cover pork chops with aluminum foil and let rest for 10 to 15 minutes before serving.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}