{
    "id": 236190,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 russet potatoes, peeled",
        "1/2 cup vegetable oil, or as needed",
        "2 tablespoons minced aji amarillo",
        "salt and ground black pepper to taste",
        "2 (5 ounce) cans tuna, drained",
        "1 small red onion, diced small",
        "1/2 cup mayonnaise, divided",
        "2 avocados, cut into thin strips",
        "3 hard-boiled eggs, thinly sliced"
    ],
    "nut": [
        "Calories > 533 kcal",
        "Carbs > 43.1 g",
        "Cholesterol > 94 mg",
        "Fat > 34.4 g",
        "Protein > 15.9 g",
        "Sodium > 134 mg"
    ],
    "n": "Peruvian Causa",
    "a": "Amber Berrocal",
    "r": "0",
    "s": 8,
    "des": "\"This spicy potato-layered dish with meat is a everyone-is-going-to-love-it dish! Even if people don't like certain ingredients, the combination is sensational! With this dish you can make the layers as thin or as thick as you like. You can substitute the tuna with chicken or other seafood.\"",
    "ins": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\nMash potatoes with a ricer or hand mixer until smooth. Gradually stir in oil until potatoes come together; add aji amarillo, salt, and pepper. Cool potato mixture in the refrigerator, about 20 minutes.\nStir tuna, onion, and 1/4 cup mayonnaise together in a bowl.\nLine a casserole dish with plastic wrap. Spread 1/2 the potato mixture on the bottom of the dish. Spread 2 tablespoons mayonnaise over the potatoes, spread the tuna mixture over the mayonnaise, and place the avocado slices in a single layer on top of the tuna mixture. Spread the remaining 1/2 of potato mixture over the avocados, and top with remaining 2 tablespoons mayonnaise. Place sliced eggs over the top. Cover casserole dish with plastic wrap and refrigerate until firm, about 30 minutes.\nInvert casserole dish onto a serving dish or baking sheet to remove potato casserole from dish. Remove plastic wrap and cut casserole into squares.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "2148629.jpg",
    "o": "",
    "st": "allrecipes"
}