{
    "id": 236283,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package linguine",
        "2 tablespoons olive oil, or as needed",
        "1 pound bacon, cut into bite-size pieces",
        "1/2 teaspoon dried rosemary",
        "1 1/2 pounds crimini mushrooms, sliced",
        "salt and ground black pepper to taste",
        "1 1/2 pounds Brussels sprouts, trimmed and chopped",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 557 kcal",
        "Carbs > 69 g",
        "Cholesterol > 33 mg",
        "Fat > 18.9 g",
        "Protein > 30.5 g",
        "Sodium > 752 mg"
    ],
    "n": "Bacon, Brussels Sprouts, and Mushroom Linguine",
    "a": "Nicole Berger",
    "r": "0",
    "s": 6,
    "des": "\"I am always looking for new ways to use Brussels sprouts. People always claim they had Brussels sprouts once and hated them, but I have converted several people with this recipe. I think the bacon helps. For kids or people who claim to not like Brussels sprouts, try shredding them to tone down the flavor a bit.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes; drain pasta, reserving 1/2 cup pasta water. Return pasta to the pot and toss with olive oil to coat.\nPlace bacon in a large skillet and cook and stir until bacon begins to crisp, about 10 minutes. Drain and discard 1/2 the bacon fat, leaving bacon in the skillet; stir in rosemary.\nStir mushrooms, salt, and black pepper into bacon mixture. Add Brussels sprouts; cook and stir until mushrooms and sprouts are heated through, 1 to 2 minutes. Pour reserved pasta water into bacon mixture; add linguine and Parmesan cheese and toss vegetables with pasta until thoroughly mixed and heated through, about 2 minutes. Season with salt and pepper.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "3876528.jpg",
    "o": "",
    "st": "allrecipes"
}