{
    "id": 236277,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound beef stew meat, cut into bite-size pieces",
        "1 tablespoon red wine vinegar",
        "2 teaspoons cornstarch",
        "1/2 teaspoon kosher salt",
        "1/8 teaspoon ground black pepper",
        "1 teaspoon vegetable oil",
        "1 small onion, diced",
        "Sauce:",
        "2 cups water",
        "1/4 cup Worcestershire sauce",
        "1/4 cup soy sauce",
        "2 tablespoons minced garlic, or more to taste",
        "2 cubes beef bouillon",
        "2 tablespoons cornstarch, or as needed"
    ],
    "nut": [
        "Calories > 191 kcal",
        "Carbs > 8.7 g",
        "Cholesterol > 42 mg",
        "Fat > 11 g",
        "Protein > 13.5 g",
        "Sodium > 1193 mg"
    ],
    "n": "No Mushroom Beef Tips",
    "a": "Kimberly",
    "r": "0",
    "s": 6,
    "des": "\"No mushroom beef tips. A quick put together meal in a pinch. Serve over noodles.\"",
    "ins": "Whisk red wine vinegar, 2 teaspoons cornstarch, kosher salt, and pepper together in a glass or ceramic bowl. Add beef to vinegar mixture and toss to coat. Marinate meat for at least 20 minutes. Drain beef and discard marinade.\nHeat vegetable oil in a large skillet over medium-high heat. Cook and stir beef and onion in hot oil until meat is browned and onions are soft and translucent, 5 to 10 minutes.\nStir water, Worcestershire sauce, soy sauce, garlic, and beef bouillon together in a pot over medium-high heat until bouillon dissolves, about 10 minutes. Ladle about 1/4 cup hot broth into a bowl; whisk 2 tablespoons cornstarch into bowl until dissolved. Stir cornstarch mixture into the broth mixture in the pot. Cook, stirring occasionally, until mixture thickens, about 5 minutes.\nStir beef and onion mixture and any accumulated pan juices into broth mixture; cook until heated through, 2 to 3 minutes.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "55 m",
    "i": "4488563.jpg",
    "o": "",
    "st": "allrecipes"
}