{
    "id": 236258,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup bread flour",
        "2 tablespoons white sugar",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "2/3 cup buttermilk",
        "1 egg, beaten",
        "2 tablespoons maple syrup (optional)",
        "2 tablespoons melted butter",
        "1/2 cup candy-coated peanut butter pieces (such as Reese's PiecesÂ®)"
    ],
    "nut": [
        "Calories > 243 kcal",
        "Carbs > 35.2 g",
        "Cholesterol > 42 mg",
        "Fat > 8.8 g",
        "Protein > 6.5 g",
        "Sodium > 379 mg"
    ],
    "n": "Jeweled Pancake Muffins - Puffins",
    "a": "la_sirene7",
    "r": "0",
    "s": 6,
    "des": "\"I love pancakes, but I hate everyone else eating fresh pancakes while I am still flipping them, especially if the ones left for me are the first ones i made. . .i.e cold. This recipe ensures that all the 'Puffins' are done at once. You can add a plethora of mix-ins like fresh fruit or a staple in our house Reese's PiecesÂ®. These are really good with a side of maple syrup, or even melted butter; however, plain is good too. I really like them without the mix-ins and peanut butter on top.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 24 mini-muffin cups.\nWhisk flour, sugar, baking powder, baking soda, and salt together in a bowl.\nStir buttermilk, egg, syrup, and butter together in a separate large bowl until just combined; add flour mixture and stir with a spoon until just combined and no lumps remain. Fold peanut butter pieces into the mixture; spoon into the prepared muffin cups.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 9 to 12 minutes. Cool in the pans for 3 minutes before serving.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "1100368.jpg",
    "o": "",
    "st": "allrecipes"
}