{
    "id": 236239,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups water",
        "1/4 cup soy sauce",
        "2 tablespoons rice wine",
        "2 tablespoons Korean red chili pepper paste (gochujang)",
        "2 tablespoons Korean red chili pepper flakes (gochugaru)",
        "1 tablespoon honey",
        "1 tablespoon white sugar",
        "1 pinch ground black pepper",
        "3 pounds bone-in chicken pieces, trimmed of fat and cut into small pieces",
        "10 ounces potatoes, cut into large chunks",
        "2 carrots, cut into large chunks",
        "1/2 large onion, cut into large chunks",
        "4 large garlic cloves, or more to taste",
        "2 slices fresh ginger, or more to taste",
        "2 scallions, cut into 2-inch lengths",
        "1 tablespoon sesame oil",
        "1 teaspoon sesame seeds"
    ],
    "nut": [
        "Calories > 896 kcal",
        "Carbs > 36.1 g",
        "Cholesterol > 121 mg",
        "Fat > 69.1 g",
        "Protein > 33.4 g",
        "Sodium > 1111 mg"
    ],
    "n": "Dakdoritang (Korean Spicy Chicken Stew)",
    "a": "Jason Lamar",
    "r": "0",
    "s": 4,
    "des": "\"'Dakdoritang' is a chicken dish that's cooked in a spicy red sauce along with vegetables such as potatoes, carrots, and onions. It's also called 'dakbokkeumtang' or 'dakmaeuntang.' It's usually made by cutting up a whole chicken into small pieces, but I use a combination of chicken thighs and wings. The result is succulent pieces of chicken packed with spicy and savory flavors!\"",
    "ins": "Stir water, soy sauce, rice wine, red chili pepper paste, red chili pepper flakes, honey, sugar, and black pepper together in a large pot; add chicken and bring to a boil. Reduce heat to medium, place a lid on the pot, and cook at a simmer until the chicken is browned, about 15 minutes.\nStir potatoes, carrots, onion, garlic, and ginger into the chicken mixture; replace cover atop the pot and cook, stirring occasionally, until the potatoes are tender, about 15 minutes. Remove cover and cook until the chicken is tender and the liquid has thickened slightly, about 10 minutes more. An instant-read thermometer inserted into a piece of chicken near the bone should read 165 degrees F (74 degrees C).\nStir scallions, sesame oil, and sesame seeds into the stew and remove pot from heat.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "2855532.jpg",
    "o": "",
    "st": "allrecipes"
}