{
    "id": 236223,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon coconut oil",
        "4 teaspoons chopped onion",
        "2 cloves garlic, minced",
        "3 1/2 tablespoons chopped fresh mushrooms",
        "1 tablespoon frozen chopped spinach, thawed and drained",
        "1/3 cup almond flour",
        "1/3 cup coconut flour",
        "2 tablespoons flax seed meal",
        "1/2 teaspoon salt",
        "1 pinch ground black pepper",
        "2 eggs",
        "2 tablespoons water",
        "1 tablespoon olive oil"
    ],
    "nut": [
        "Calories > 50 kcal",
        "Carbs > 4 g",
        "Cholesterol > 23 mg",
        "Fat > 3.2 g",
        "Protein > 1.7 g",
        "Sodium > 82 mg"
    ],
    "n": "Killer Crackers",
    "a": "Poppa Bear",
    "r": "0",
    "s": 16,
    "des": "\"Made especially for a paleo or ketogenic diet, as these are low in carbs but high in protein and fat. Also check out my 'Polar Bear Bars' and 'The Bearette's Croquettes'!\"",
    "ins": "Melt coconut oil in a skillet over medium heat; saute onion and garlic until onion is tender, about 5 minutes. Add mushrooms; saute until tender, about 5 minutes. Add spinach and cook until warmed, 2 to 3 minutes. Remove pan from heat and slightly cool vegetables.\nMix almond flour, coconut flour, flax seed meal, salt, and pepper in a bowl.\nTransfer vegetable mixture to a work surface and finely chop. Stir vegetable mixture into flour mixture; add eggs, water, and olive oil. Mix until dough is thoroughly combined and holds together.\nPreheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nTurn dough onto the prepared baking sheet and press into a flat rectangle. Place a second sheet of parchment paper atop dough and roll dough between the 2 sheets until about 1/16-thick. Remove top parchment paper. Cut edges of dough to make an even rectangle. Add excess dough to 1 end of rectangle and re-roll into even thickness.\nCut dough into 1-inch squares using a pizza cutter, keeping dough together.\nBake in the preheated oven until edges are browned, 18 to 20 minutes. Cool completely and break into squares.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "1106969.jpg",
    "o": "",
    "st": "allrecipes"
}