{
    "id": 236208,
    "old_rating": "4.51282",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 slices bacon, cut into 1-inch pieces",
        "3/4 cup chopped onion",
        "2 cloves garlic, chopped",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon ground black pepper",
        "1 (8 ounce) package reduced-fat cream cheese, cut into cubes",
        "1/4 cup sour cream",
        "1 prepared 16-inch pizza dough pastry",
        "1 cup shredded mozzarella cheese, or more to taste",
        "1/2 cup shredded reduced-fat Cheddar cheese",
        "4 jalapeno peppers, sliced into thin rings",
        "1 tablespoon dried parsley flakes"
    ],
    "nut": [
        "Calories > 293 kcal",
        "Carbs > 22.3 g",
        "Cholesterol > 44 mg",
        "Fat > 15.6 g",
        "Protein > 15.5 g",
        "Sodium > 689 mg"
    ],
    "n": "Jan's Jalapeno Popper Pizza",
    "a": "What's for dinner, mom?",
    "r": "0",
    "s": 8,
    "des": "\"All the goodness of jalapeno poppers in a pizza topping.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPlace the bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove bacon with a slotted spoon to drain on paper towels, reserving drippings in the pan.\nSaute onion in bacon drippings until translucent, 5 to 7 minutes. Add garlic; continue to saute until garlic is golden, 2 to 3 minutes. Season the onion mixture with cumin, oregano, and black pepper. Stir cream cheese and sour cream into the onion mixture until smooth and spreadable.\nSpread the cream cheese mixture evenly over the pizza dough; top with mozzarella and Cheddar cheeses. Arrange bacon and jalapeno pepper rings over the cheese layer. Sprinkle parsley over the entire pizza.\nBake in preheated oven until crust is firm and crispy and the cheese is browned and bubbly, about 30 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "1678233.jpg",
    "o": "1678233.jpg,1552156.jpg,1473570.jpg,1365990.jpg,1363210.jpg,1336433.jpg",
    "st": "allrecipes"
}