{
    "id": 236234,
    "old_rating": "4.85714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 lamb shanks",
        "2 tablespoons olive oil",
        "2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon smoked paprika",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon dried rosemary",
        "1 large onion, sliced",
        "6 cloves garlic, crushed",
        "1 cup chicken broth",
        "1/3 cup saba",
        "1/2 teaspoon chopped fresh rosemary"
    ],
    "nut": [
        "Calories > 338 kcal",
        "Carbs > 10.1 g",
        "Cholesterol > 84 mg",
        "Fat > 20.6 g",
        "Protein > 26.2 g",
        "Sodium > 1275 mg"
    ],
    "n": "Saba-Braised Lamb Shanks",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"If you're looking for a foolproof, wintry braised meat dish, this is virtually impossible to screw up! The only way to screw this up is to undercook the meat. The sauce has no thickeners, just pure 100% natural goodness.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nPlace lamb shanks into a large bowl; drizzle with olive oil. Sprinkle with salt, black pepper, smoked paprika, cinnamon, and rosemary. Toss the lamb shanks to spread oil and seasonings over the meat.\nSpread onion slices and garlic cloves into the bottom of a heavy 9x12-inch baking dish. Lay lamb shanks over onions and garlic.\nBake lamb in preheated oven for 30 minutes. Reduce oven temperature to 200 degrees F (95 degrees C).\nCombine chicken broth and saba in a bowl. Pour mixture over the lamb shanks. Cover baking dish tightly with foil and place baking dish on a baking sheet.\nBake lamb in the oven until a knife pierces the meat easily, 2 1/2 to 3 hours. The meat will be tender but not falling off the bone. Use tongs to turn the shanks over in the pan sauce. Increase temperature to 350 degrees F (175 degrees C).\nReturn shanks to oven and bake, uncovered, until meat is fork-tender and the sauce has thickened slightly, 10 to 15 minutes. Turn shanks over in the sauce after 10 minutes and check for tenderness; if still not tender enough, return to oven for 10 to 15 more minutes and test again.\nTransfer lamb shanks to a bowl and keep warm. Strain pan juices into a saucepan and place over medium heat. Bring to a boil and cook, stirring often, until thickened, about 5 minutes. Skim any excess grease from top of sauce. Taste and season with salt; stir in fresh rosemary. Serve sauce drizzled over lamb shanks.",
    "pt": "20 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "3494056.jpg",
    "o": "3494056.jpg,3154468.jpg,2814069.jpg,2612730.jpg,2585716.jpg,1467747.jpg",
    "st": "allrecipes"
}