{
    "id": 236275,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons ground cumin",
        "2 teaspoons garlic salt",
        "2 teaspoons ground dried chipotle pepper",
        "2 teaspoons paprika",
        "2 (10 ounce) cans diced tomatoes with green chile peppers",
        "1 (15 ounce) can black beans",
        "1 (8 ounce) can whole kernel corn",
        "2 pounds skinless, boneless chicken breast meat - cut into cubes",
        "1 tablespoon olive oil",
        "1 small red onion, diced",
        "1 cup uncooked instant rice",
        "1 cup grated Cheddar cheese"
    ],
    "nut": [
        "Calories > 448 kcal",
        "Carbs > 38.1 g",
        "Cholesterol > 106 mg",
        "Fat > 13.4 g",
        "Protein > 43.9 g",
        "Sodium > 1561 mg"
    ],
    "n": "Easy Southwestern Chicken",
    "a": "Martha C.",
    "r": "0",
    "s": 6,
    "des": "\"Yummy, easy, healthy dish my family loves! Easy to grab from what most of us have in the cabinet and have in 30 minutes from pantry to table. Enjoy!\"",
    "ins": "Combine cumin, salt, dried chipotle pepper, and paprika in a large, resealable plastic bag. Seal bag and shake to mix. Measure 2 teaspoons of the seasoning into a large bowl; add diced tomatoes with green chile peppers, black beans, and corn to the bowl and stir.\nPut chicken in the bag with the remaining seasoning; shake to coat.\nHeat olive oil in a large skillet over high heat. Turn seasoned chicken out into the skillet, add red onion, and saute in the hot oil until the chicken is browned, about 5 minutes.\nReduce heat to medium-high. Stir tomato mixture with the chicken; bring to a boil, add rice, and stir.\nReduce heat to low. Sprinkle Cheddar cheese over the chicken mixture. Place a cover on the skillet and simmer until the rice is tender and the chicken no longer pink in the middle, about 5 minutes. Remove from heat to cool for 5 minutes before serving.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "1901430.jpg",
    "o": "",
    "st": "allrecipes"
}