{
    "id": 236321,
    "old_rating": "4.79412",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Filling:",
        "1 tablespoon vegetable oil, divided",
        "1/2 cup diced onion",
        "1/2 cup diced poblano peppers",
        "1/2 cup sliced mushrooms",
        "salt and freshly ground black pepper to taste",
        "12 ounces skinless, boneless chicken breast halves, cut into 1/2-inch cubes",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon ground chipotle",
        "1 pinch dried Mexican oregano",
        "1 tablespoon water, or as needed",
        "4 ounces shredded pepperjack cheese",
        "1 pinch cayenne pepper, or to taste",
        "4 large flour tortillas",
        "1 egg white, beaten",
        "2 tablespoons vegetable oil",
        "1/4 cup guacamole (optional)",
        "1/4 cup sour cream (optional)",
        "1/4 cup salsa (optional)",
        "1/4 cup cilantro leaves (optional)"
    ],
    "nut": [
        "Calories > 618 kcal",
        "Carbs > 48.2 g",
        "Cholesterol > 85 mg",
        "Fat > 32.3 g",
        "Protein > 33.1 g",
        "Sodium > 848 mg"
    ],
    "n": "Chicken and Mushroom Chimichangas",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"This is not Mexican food. It's a 100% American invention. They are not deep fried; they are pan-fried in a little oil. I like to serve with dollops of guacamole, sour cream, and salsa. Moist chicken and earthy mushrooms combine with fresh green chiles and pepperjack cheese encased in a crispy tortilla.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a heavy baking sheet with parchment paper or a silicone baking mat.\nHeat 1 1/2 teaspoons vegetable oil in a heavy skillet over medium-high heat. Saute onion, poblano peppers, and mushrooms in the hot oil, sprinkling with salt, until they soften and release their juices, about 5 minutes. Continue to cook until vegetables begin to brown, 5 to 10 minutes.\nMove vegetables to the edges of the skillet, leaving a space in the center. Drizzle 1 1/2 teaspoons vegetable oil into the center. Add chicken breast pieces to the center of the skillet and sprinkle with salt, cumin, ground chipotle, and dried Mexican oregano. Cook and stir until chicken pieces are browned, about 5 minutes.\nStir chicken and vegetable mixture together in skillet; remove from heat. Drizzle water over chicken mixture and scrape the browned bits of food off of the bottom of the pan with a wooden spoon. Transfer mixture to a bowl and set aside to cool to a warm temperature.\nMix pepperjack cheese into chicken mixture; stir until thoroughly combined. Season with salt, black pepper, and cayenne pepper.\nPlace a heavy skillet over medium heat. When pan is hot, heat a tortilla in the skillet until warmed and flexible, about 30 seconds per side.\nPlace tortilla onto a work surface and spoon 1/4 the filling into the center of the tortilla. Fold bottom of tortilla just over filling. Brush top and the exposed parts of the inside of the tortilla with egg white. Fold right and left sides towards the center like an envelope, enclosing the filling. Roll tortilla over to fully enclose filling in a rectangular packet. Repeat with remaining tortillas and filling.\nHeat 2 tablespoons vegetable oil in heavy skillet over medium heat. Brown chimichangas on both sides in the hot oil until golden, 2 to 3 minutes per side. Transfer to prepared baking sheet.\nBake in the preheated oven until puffed up, golden brown, and the outside is crisp, 12 to 15 minutes. Spoon 1 tablespoon guacamole, 1 tablespoon sour cream, 1 tablespoon salsa, and 1 tablespoon cilantro onto each chimichanga.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "4470569.jpg",
    "o": "4470569.jpg,2086021.jpg,1916326.jpg,1574480.jpg,1512955.jpg,1509180.jpg",
    "st": "allrecipes"
}