{
    "id": 236378,
    "old_rating": "4.76316",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds roma (plum) tomatoes, quartered",
        "1 yellow onion, halved and quartered",
        "1/2 red bell pepper, chopped",
        "3 tablespoons olive oil",
        "1 tablespoon sea salt",
        "1 1/2 teaspoons freshly ground black pepper",
        "3 cloves garlic, halved",
        "5 cups low-sodium chicken broth",
        "2 teaspoons dried basil",
        "1 teaspoon dried parsley"
    ],
    "nut": [
        "Calories > 140 kcal",
        "Carbs > 14.7 g",
        "Cholesterol > 3 mg",
        "Fat > 7.6 g",
        "Protein > 5.4 g",
        "Sodium > 988 mg"
    ],
    "n": "Roasted Tomato Soup",
    "a": "Cindy Anschutz Barbieri",
    "r": "0",
    "s": 6,
    "des": "\"My husband wanted an easy dinner so I thought, 'How about soup and BLTs?' When I was at the grocery store, roma tomatoes were on sale and it came to me: roasted tomato soup for dinner! I already had an onion and 1/2 of a red bell pepper at home to create this flavorful soup. It is also a perfect paleo recipe for you to enjoy. Taste for any additional seasonings; serve and enjoy.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a large baking sheet with aluminum foil.\nSpread tomatoes, onion, and red bell pepper in 1 layer onto the prepared baking sheet. Drizzle olive oil over tomato mixture and season with salt and pepper.\nRoast in the preheated oven for 30 minutes; add garlic and continue roasting until tomato mixture is tender, about 15 more minutes.\nBring chicken broth, basil, and parsley to a boil in a large stockpot; reduce heat and simmer.\nPut half the tomato mixture into a blender. Cover and hold lid down; pulse a few times before leaving on to blend until smooth, adding a small amount of the warm chicken broth if liquid is needed. Pour pureed tomato mixture into stockpot with chicken broth. Puree remaining half of tomato mixture and add to chicken stock mixture, mixing well. Simmer for 5 minutes.",
    "pt": "10 m",
    "ct": "50 m",
    "tt": "1 h",
    "i": "1120140.jpg",
    "o": "4479237.jpg,4466574.jpg,4206586.jpg,4006316.jpg,3995680.jpg,3991511.jpg",
    "st": "allrecipes"
}