{
    "id": 236380,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "2 cups chopped almonds",
        "1/4 cup coconut oil, melted",
        "5 dried figs",
        "1 teaspoon sea salt",
        "Cheesecake:",
        "2 lemons, juiced",
        "2 teaspoons unflavored gelatin",
        "2 cups Greek yogurt",
        "1 (15 ounce) can cream of coconut",
        "2/3 cup honey",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon salt",
        "1 vanilla bean",
        "Berry Topping:",
        "2 cups frozen blueberries",
        "1 lemon, zested and juiced",
        "1 tablespoon honey",
        "1 tablespoon arrowroot powder"
    ],
    "nut": [
        "Calories > 463 kcal",
        "Carbs > 54.3 g",
        "Cholesterol > 8 mg",
        "Fat > 26.5 g",
        "Protein > 7.8 g",
        "Sodium > 287 mg"
    ],
    "n": "Greek Yogurt Cheesecake",
    "a": "loriallred",
    "r": "0",
    "s": 12,
    "des": "\"This is a no-bake Greek yogurt cheesecake. Use any variety of berry for the topping. You can also refrigerate the berry topping for 1 hour before serving so the sauce can 'set'. The sauce keeps for 1 week in the refrigerator or can be frozen.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Spread almonds onto a baking sheet.\nBake almonds in the preheated oven until roasted and fragrant, 10 to 15 minutes.\nCombine almonds, coconut oil, figs, and sea salt in a food processor; pulse until well combined. Press almond mixture into the bottom of a 9-inch springform pan; refrigerate until cooled, at least 30 minutes.\nHeat juice from 2 lemons and gelatin in the top of a double boiler over simmering water until gelatin is dissolved, about 5 minutes.\nProcess yogurt, cream of coconut, 2/3 cup honey, vanilla extract, salt, and vanilla bean together in a food processor until well combined, about 1 minute. Drizzle gelatin mixture through the feeding tube of the food processor while it is still running and process until incorporated, about 30 seconds. Pour yogurt mixture over the cooled crust; cover with plastic wrap and refrigerate, 8 hours to overnight.\nHeat blueberries, zest and juice from 1 lemon, 1 tablespoon honey, and arrowroot powder together in a small saucepan over medium heat until thickened, 5 to 10 minutes. Pour mixture into a blender and blend until smooth. Pour topping over chilled cheesecake.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "9 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}