{
    "id": 236312,
    "old_rating": "4.375",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup olive oil, divided",
        "1 large eggplant, peeled and thinly sliced",
        "1/2 teaspoon salt",
        "1 pound ground beef",
        "1 onion, chopped",
        "1 clove garlic, minced",
        "1 (16 ounce) jar spaghetti sauce",
        "1/2 teaspoon dried oregano",
        "1/2 cup grated Parmesan cheese, divided",
        "1 egg",
        "2 tablespoons grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 678 kcal",
        "Carbs > 31.4 g",
        "Cholesterol > 131 mg",
        "Fat > 48.9 g",
        "Protein > 29.9 g",
        "Sodium > 1030 mg"
    ],
    "n": "Baked Eggplant Alla Romana",
    "a": "Elizabeth",
    "r": "0",
    "s": 4,
    "des": "\"This recipe was given to me years ago. This casserole freezes well, so when eggplants are in the garden you may use them up.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat a few tablespoons of olive oil in a large skillet over medium-high heat. Fry eggplant slices in hot oil until browned thoroughly, 3 to 5 minutes per side. Add oil between batches as needed. Drain fried eggplant slices on paper towels and season with salt.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes. Add onion and garlic to the beef; cook and stir until onion is golden brown, about 5 minutes more.\nPour spaghetti sauce over the ground beef; add oregano and stir. Simmer mixture until sauce is heated through, 5 to 7 minutes.\nArrange about half the eggplant slices into the bottom of a shallow casserole dish to cover completely. Ladle about half the beef sauce over the eggplant. Sprinkle 1/4 cup Parmesan cheese over the sauce. Repeat layers.\nBeat egg with 2 tablespoons Parmesan cheese; pour over the top of the casserole.\nBake in preheated oven until bubbling around the edges and hot in the center, 20 to 25 minutes.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1627272.jpg",
    "o": "",
    "st": "allrecipes"
}