{
    "id": 236309,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 onions, roughly chopped, or more to taste",
        "3 stalks celery, roughly chopped",
        "1 cup sliced fresh mushrooms (optional)",
        "5 tablespoons minced garlic",
        "3 (900 ml) cartons chicken broth, divided",
        "3 (12 ounce) cans tomato paste",
        "1/2 cup dried oregano",
        "1/4 cup ground black pepper, or more to taste",
        "1/4 cup white sugar",
        "3 tablespoons celery salt",
        "2 teaspoons basil",
        "2 teaspoons onion powder",
        "2 teaspoons seasoned salt",
        "1 1/2 cups vegetable oil",
        "1/2 cup all-purpose flour"
    ],
    "nut": [
        "Calories > 201 kcal",
        "Carbs > 17.1 g",
        "Cholesterol > 3 mg",
        "Fat > 14.4 g",
        "Protein > 3.4 g",
        "Sodium > 1492 mg"
    ],
    "n": "Mel's Brown Pizza Sauce",
    "a": "LifeMadeDelicious",
    "r": "0",
    "s": 24,
    "des": "\"I live about 1 hour from my favorite pizza joint, so I decided to make my own sauce recipe for the days that I can't have the real thing (because let's face it, nothing beats the real thing). After many attempts (10 full batches, to be exact) at adjusting my recipe, this is what my taste buds came up with. I hope you will give it a try and enjoy it as much as my family and I do. For the ultimate pizza experience use BrothersÂ® pepperoni and MozzarellissimaÂ® pizza cheese.\"",
    "ins": "Working in batches, puree onions, celery, mushrooms, and garlic and 1/4 cup chicken broth in a food processor until smooth, adding more chicken broth as necessary.\nStir vegetable puree and remaining chicken broth together in large pot; bring to a boil, reduce heat to low, and simmer until flavors blend, about 45 minutes.\nStir tomato paste, oregano, black pepper, sugar, celery salt, basil, onion powder, and seasoned salt into broth mixture; bring to a boil, reduce heat to low, and simmer until flavors blend, about 45 minutes more.\nWhisk oil and flour into tomato mixture until pizza sauce is smooth.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1092868.jpg",
    "o": "",
    "st": "allrecipes"
}