{
    "id": 236325,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup warm water",
        "1/2 cup bread flour",
        "1 (.25 ounce) package active dry yeast",
        "1 1/2 teaspoons white sugar",
        "2 cups bread flour, or more as needed",
        "3 tablespoons olive oil, divided",
        "1 1/2 teaspoons salt"
    ],
    "nut": [
        "Calories > 273 kcal",
        "Carbs > 42.9 g",
        "Cholesterol > 0 mg",
        "Fat > 7.8 g",
        "Protein > 7.3 g",
        "Sodium > 584 mg"
    ],
    "n": "New York-Style Pizza Dough",
    "a": "Amanda-Rae",
    "r": "0",
    "s": 6,
    "des": "\"A simple and basic recipe that gives anyone longing for New York's famous pizza something to truly enjoy! Add some flavor to your dough by incorporating seasonings such as oregano or garlic powder (1/2 teaspoon of each is more than enough). The dough can also be frozen for longer storage.\"",
    "ins": "Combine water, 1/2 cup flour, yeast, and sugar in a bowl; stir well and let sit until mixture is foamy and bubbling, about 20 minutes.\nStir 2 cups flour, 2 tablespoons olive oil, and salt into yeast mixture using a wooden spoon until dough holds together; turn onto a lightly floured work surface.\nCoat the inside of a large bowl with 2 1/2 teaspoons olive oil.\nKnead dough, adding small amounts of flour as needed, until soft and slightly sticky, about 10 minutes.\nForm dough into a ball and place in the prepared bowl; drizzle about 1/2 teaspoon olive oil over dough and spread to coat entire ball. Cover bowl with a clean kitchen towel and place in a warm area of the kitchen until dough is doubled in size, about 2 hours.\nPunch dough down and place in a large resealable plastic bag; refrigerate 8 hours to overnight. When ready to use, remove dough from refrigerator and bring to room temperature before using.",
    "pt": "20 m",
    "ct": "",
    "tt": "",
    "i": "1933584.jpg",
    "o": "4518828.jpg,4471636.jpg,4171059.jpg,2883831.jpg,2645716.jpg,2323404.jpg",
    "st": "allrecipes"
}