{
    "id": 236439,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup rice wine",
        "1/2 teaspoon salt",
        "1 pound smelt",
        "1 tablespoon all-purpose flour, or as needed",
        "2 quarts oil for deep frying",
        "3/4 cup ice water",
        "1/2 cup all-purpose flour",
        "1/2 cup cornstarch",
        "2 egg yolks",
        "2 teaspoons sesame seeds",
        "2 teaspoons sesame oil",
        "1 teaspoon baking powder",
        "1/2 teaspoon white sugar",
        "1/2 teaspoon salt"
    ],
    "nut": [
        "Calories > 761 kcal",
        "Carbs > 32.5 g",
        "Cholesterol > 181 mg",
        "Fat > 52.3 g",
        "Protein > 23.6 g",
        "Sodium > 779 mg"
    ],
    "n": "Tempura-Battered Smelt",
    "a": "Brittney Tun",
    "r": "0",
    "s": 4,
    "des": "\"The classic Acadian way to cook smelt is to fry them. I put a twist on that tradition by frying them in this light tempura batter my husband and I use for shrimp. I serve this with heads on because, like anchovies, these fish are so small everything is edible. But you can remove heads and internal organs if desired.\"",
    "ins": "Whisk rice wine and 1/2 teaspoon salt together in a bowl. Lightly dust smelt with about 1 tablespoon flour. Add smelt to rice wine mixture; cover bowl with plastic wrap and marinate in the refrigerator for about 20 minutes.\nHeat oil in a deep-fryer or large wok to 375 degrees F (190 degrees C).\nMix ice water, 1/2 cup flour, cornstarch, egg yolks, sesame seeds, sesame oil, baking powder, sugar, and 1/2 teaspoon salt together in a bowl.\nRemove smelt from rice wine mixture and dip, 1 at a time, into the flour mixture until evenly coated. Discard remaining rice wine mixture.\nCarefully fry smelt, 2 or 3 at a time, in the hot oil until golden on all sides, 3 to 4 minutes. Remove with a slotted spoon and drain on paper towel-lined plates. Repeat frying with remaining smelt. Serve warm.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "55 m",
    "i": "1101484.jpg",
    "o": "",
    "st": "allrecipes"
}