{
    "id": 236466,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon extra-virgin olive oil",
        "1 pound bulk Italian sausage",
        "2 tablespoons minced garlic",
        "1 onion, chopped",
        "1 green bell pepper, chopped",
        "1 sweet Italian pepper, chopped",
        "1/2 teaspoon salt",
        "1 zucchini, sliced",
        "1 (28 ounce) can crushed tomatoes",
        "2 (14 ounce) cans tomato sauce",
        "1 (14.5 ounce) can diced tomatoes, drained",
        "1 tablespoon tomato paste, or more as needed (optional)",
        "2 teaspoons dried oregano",
        "2 teaspoons dried basil",
        "1 teaspoon onion powder",
        "1 teaspoon chopped dried rosemary",
        "1 teaspoon dried parsley",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon red pepper flakes (optional)"
    ],
    "nut": [
        "Calories > 191 kcal",
        "Carbs > 16.8 g",
        "Cholesterol > 18 mg",
        "Fat > 10.4 g",
        "Protein > 9.4 g",
        "Sodium > 1093 mg"
    ],
    "n": "Chunky Red Sauce with Ground Italian Sausage",
    "a": "Jenykell",
    "r": "0",
    "s": 10,
    "des": "\"This is a basic chunky red sauce with Italian sausage and lots of veggies! Great for lasagna or your favorite pasta dish! Also, if you want the benefit of the veggies, but have picky eaters at your table, you can put it all in the food processor and they will never know the difference! I speak from experience!\"",
    "ins": "Heat olive oil in a large saucepan or Dutch oven over medium-high heat. Cook and stir sausage and garlic in hot oil until browned and crumbly, 5 to 7 minutes. Transfer sausage and garlic to a plate using a slotted spoon, leaving any drippings in the saucepan.\nSaute onion, green pepper, sweet pepper, and salt in the same saucepan until slightly softened, about 5 minutes. Add zucchini and continue cooking until onion is translucent, 5 to 10 minutes more. Drain off any excess liquid.\nStir sausage, crushed tomatoes, tomato sauce, diced tomatoes, tomato paste, oregano, basil, rosemary, parsley, black pepper, and red pepper flakes into onion-zucchini mixture. Bring to a simmer, reduce heat to low, cover the saucepan with a lid, and cook, stirring occasionally, until flavors blend and sauce is thickened, about 2 hours.",
    "pt": "15 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "1117972.jpg",
    "o": "",
    "st": "allrecipes"
}