{
    "id": 236440,
    "old_rating": "4.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 1/2 cups water, divided",
        "1 cup red quinoa",
        "1 cup pearl (Israeli) couscous",
        "1 cup farro",
        "1 cucumber, seeded and chopped",
        "1/2 red onion, chopped",
        "1 orange bell pepper, seeded and chopped",
        "1 yellow squash, seeded and chopped",
        "1/2 cup extra-virgin olive oil",
        "1 lemon, juiced",
        "1/2 teaspoon kosher salt",
        "1 (6 ounce) container crumbled feta cheese"
    ],
    "nut": [
        "Calories > 424 kcal",
        "Carbs > 50.3 g",
        "Cholesterol > 19 mg",
        "Fat > 20.9 g",
        "Protein > 11.6 g",
        "Sodium > 370 mg"
    ],
    "n": "Quinoa, Couscous, and Farro Salad with Summer Vegetables",
    "a": "Chrissy Gaynor",
    "r": "0",
    "s": 8,
    "des": "\"This light and delicious salad is packed with protein, vitamins, and fiber. I tried this while visiting a resort in Marco Island and could not wait to recreate it myself. This salad is the perfect dish for a light lunch or a side dish at dinner. Your vegetarian friends will thank you for serving this at any dinner party or BBQ.\"",
    "ins": "Bring 2 cups water and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water has been absorbed, 15 to 20 minutes.\nBring 1 1/2 cup water and couscous to a boil in a separate saucepan. Reduce heat to medium-low, cover, and simmer until couscous is tender yet firm to the bite, about 10 minutes.\nBring 3 cups water and farro to a boil in a separate saucepan. Reduce heat to medium-low, cover, and simmer until farro is tender and water has been absorbed, about 25 minutes.\nCombine quinoa, couscous, farro, cucumber, red onion, orange bell pepper, and yellow squash together in a bowl.\nWhisk olive oil, lemon juice, and salt together in a bowl. Pour dressing over grain-vegetable mixture; toss to coat. Sprinkle feta cheese over salad. Refrigerate until chilled, at least 2 hours.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "1101162.jpg",
    "o": "",
    "st": "allrecipes"
}