{
    "id": 236467,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 tablespoons nonfat dry milk powder",
        "3/4 cup hot black tea, or as needed",
        "nonstick cooking spray with flour",
        "2 teaspoons ground cinnamon",
        "1 teaspoon ground nutmeg",
        "1 teaspoon ground allspice",
        "1/2 teaspoon ground cloves",
        "1/4 teaspoon ground black pepper",
        "1 cup all-purpose flour",
        "1 cup lightly packed brown sugar",
        "6 tablespoons unsweetened cocoa powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/4 cup sunflower seed oil",
        "1 egg, lightly beaten",
        "1 teaspoon grated fresh ginger"
    ],
    "nut": [
        "Calories > 305 kcal",
        "Carbs > 47.9 g",
        "Cholesterol > 29 mg",
        "Fat > 11.1 g",
        "Protein > 6.9 g",
        "Sodium > 504 mg"
    ],
    "n": "Chocolate Chai Cupcakes",
    "a": "rebeckamikaze",
    "r": "0",
    "s": 6,
    "des": "\"Indian spices and rich cocoa give these oversized chocolate cupcakes a twist. It's like hot chocolate and a chai latte blended together in cupcake form. For those conscious about their heart health, this recipe uses vegetable oil instead of butter and nonfat milk powder instead of whole milk. These cupcakes taste better after being refrigerated overnight.\"",
    "ins": "Put nonfat milk powder in a measuring cup; stir in enough black tea to make 1 cup. Stir until milk is dissolved. Set aside to cool.\nPreheat oven to 375 degrees F (190 degrees C). Spray a muffin pan with nonstick cooking spray.\nCombine cinnamon, nutmeg, allspice, cloves, and black pepper together in a small bowl.\nSift spice mixture, flour, brown sugar, cocoa powder, baking soda, baking powder, and salt together into a large bowl. Stir cooled tea mixture, oil, and egg into flour mixture until batter is just combined; fold in ginger. Spoon batter into the prepared muffin cups, filling each 3/4-full.\nBake in the preheated oven until a toothpick inserted in the center of a cupcake comes out clean, 12 to 15 minutes. Cool cupcakes on wire racks.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "40 m",
    "i": "2445996.jpg",
    "o": "",
    "st": "allrecipes"
}