{
    "id": 236488,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Base:",
        "1 cup all-purpose flour",
        "2 tablespoons confectioners' sugar",
        "1/2 cup butter",
        "1/3 cup seedless raspberry jam",
        "Filling:",
        "2/3 cup white sugar",
        "1/2 cup butter, softened",
        "2 eggs",
        "2/3 cup rice flour",
        "10 drops red food coloring, or as needed",
        "Icing:",
        "2 cups confectioners' sugar, or as needed",
        "1/3 cup butter, softened",
        "1 tablespoon milk, or as needed",
        "1 teaspoon maple extract"
    ],
    "nut": [
        "Calories > 156 kcal",
        "Carbs > 20.4 g",
        "Cholesterol > 32 mg",
        "Fat > 8.1 g",
        "Protein > 1.1 g",
        "Sodium > 59 mg"
    ],
    "n": "Canada Squares",
    "a": "RedApple",
    "r": "0",
    "s": 32,
    "des": "\"They're all red and white with a hint of maple. When sliced, the cookies reveal a white base, red middle, and white top. They will have you singing 'O Canada' for the rest of the day!\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C). Line bottom and sides of an 8-inch square baking pan with parchment paper; crease corners well.\nWhisk together 1 cup flour and 2 tablespoons confectioners' sugar; cut in 1/2 cup butter until mixture resembles fine crumbs. Pat mixture evenly into prepared pan.\nBake in the preheated oven for 20 minutes; remove to cool on a wire rack, about 15 minutes. Top base evenly with raspberry jam.\nPreheat oven to 375 degrees F (190 degrees C).\nBeat white sugar and 1/2 cup butter together until fluffy; beat in eggs until fluffy and pale yellow. Beat rice flour into egg mixture until well combined; stir in food coloring until batter reaches desired shade of red. Spread batter evenly over jam layer.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 30 minutes. Cool completely in the pan; about 20 minutes.\nBeat 2 cups confectioners' sugar and 1/3 cup butter together in a bowl with an electric mixer until smooth; stir in milk and maple extract. Spread icing evenly over cooled bars.\nHold edges of parchment paper; lift squares out of pan to a cutting board. Slice into 1-inch squares with a very sharp knife.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1102741.jpg",
    "o": "",
    "st": "allrecipes"
}