{
    "id": 236484,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds beef stew meat, cut across the grain into 1/4x1/2-inch strips",
        "2 teaspoons salt",
        "2 teaspoons ground black pepper",
        "1 teaspoon Spanish paprika",
        "1/4 cup butter",
        "1 1/2 onions, minced",
        "1 1/2 pounds sliced fresh mushrooms",
        "1 (10.5 ounce) can condensed beef broth, divided",
        "1/3 cup dry white wine",
        "6 cloves garlic, minced",
        "3 tablespoons ketchup",
        "salt and ground black pepper to taste",
        "1 (16 ounce) package broad egg noodles",
        "3 tablespoons all-purpose flour",
        "1 cup sour cream",
        "1 pinch paprika, for garnish"
    ],
    "nut": [
        "Calories > 543 kcal",
        "Carbs > 53.1 g",
        "Cholesterol > 135 mg",
        "Fat > 21.3 g",
        "Protein > 33.9 g",
        "Sodium > 887 mg"
    ],
    "n": "Classic Beef Stroganoff",
    "a": "ajthoma",
    "r": "0",
    "s": 8,
    "des": "\"This hearty comfort food is great when the weather turns.\"",
    "ins": "Season beef with salt, pepper, and Spanish paprika.\nMelt butter in a large skillet over medium heat. Saute onions and mushrooms in melted butter until onions are tender, 5 to 7 minutes; transfer to a bowl, retaining some of the butter in the skillet.\nCook and stir beef in retained butter until lightly browned, 5 to 7 minutes.\nStir 2/3 cup beef broth, white wine, garlic, and ketchup into the beef mixture; season with salt and pepper. Place a cover on the skillet and cook mixture at a simmer for 15 minutes.\nBring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes; drain.\nWhisk remaining beef broth and flour together in a bowl; add to beef mixture. Bring the mixture to a boil, stirring continually, and boil for 1 minute. Reduce heat to low, add sour cream, and stir until smoothly incorporated. Ladle over egg noodles and garnish with paprika.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "4329887.jpg",
    "o": "",
    "st": "allrecipes"
}