{
    "id": 236514,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 eggs",
        "2 avocados - halved, pitted, and mashed",
        "1 small white onion, diced",
        "1 plum (Roma) tomato, seeded and diced",
        "3 tablespoons finely chopped fresh cilantro",
        "1 lime, juiced",
        "1 jalapeno pepper, seeded and minced",
        "2 teaspoons chopped garlic",
        "salt and freshly ground black pepper to taste",
        "24 pickled garlic cloves (such as Sonoma Farm Tex-Mex Sweet & Hot Garlic ClovesÂ®)",
        "8 pickled jalapeno pepper slices, minced"
    ],
    "nut": [
        "Calories > 70 kcal",
        "Carbs > 3.3 g",
        "Cholesterol > 93 mg",
        "Fat > 5 g",
        "Protein > 3.7 g",
        "Sodium > 96 mg"
    ],
    "n": "Devilishly Different Green Deviled Eggs",
    "a": "CARMOMOF4",
    "r": "0",
    "s": 24,
    "des": "\"I was bored with traditional deviled eggs and had been trying to find more ways to cook with avocados. I made these for a Kentucky Derby party and all 24 were gone within minutes! Next time I will need to make a double batch.\"",
    "ins": "Place eggs in a saucepan; cover with water. Bring to a boil, remove from heat, and let eggs stand in hot water for 15 minutes. Remove eggs from hot water, cool under cold running water, and peel.\nStir together mashed avocado, onion, tomato, cilantro, lime juice, jalapeno, and chopped garlic; season with salt and pepper. Refrigerate guacamole, tightly covered, for 1 hour.\nDrain pickled garlic cloves and minced pickled jalapeno on a plate lined with paper towels.\nCut each egg in half lengthwise; set yolks aside for another use. Clean away any remaining yolk from egg white halves with a wet paper towel. Place egg whites cut-side up on a serving platter.\nSpoon a generous amount of guacamole into each egg white half; top each deviled egg with a pickled garlic clove. Sprinkle minced pickled jalapeno, salt, and black pepper over deviled eggs.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "1108984.jpg",
    "o": "",
    "st": "allrecipes"
}