{
    "id": 236599,
    "old_rating": "4.52174",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon olive oil",
        "1 1/4 pounds hot Italian sausage, casings removed",
        "1 1/4 pounds mild Italian sausage, casings removed",
        "1 onion, chopped",
        "salt to taste",
        "2 tablespoons ancho chile powder",
        "1 teaspoon paprika",
        "1 teaspoon ground cumin",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon chipotle chile powder",
        "1/2 teaspoon dried oregano",
        "2 1/2 cups water, or as needed",
        "1 cup tomato puree",
        "2 (15 ounce) cans cannellini beans, drained and rinsed",
        "1 red bell pepper, diced",
        "1 green bell pepper, diced"
    ],
    "nut": [
        "Calories > 599 kcal",
        "Carbs > 31.4 g",
        "Cholesterol > 88 mg",
        "Fat > 37.7 g",
        "Protein > 32.3 g",
        "Sodium > 1879 mg"
    ],
    "n": "Chef John's Italian Sausage Chili",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"I've added pork to ground beef in chili before, but I've never tried it with all Italian sausage, and I loved the results. We Italian'd this up even more with cannellini beans and a touch of basil, but other than that, it's a fairly classic chili. Garnish with sour cream, avocado, red onion, and basil.\"",
    "ins": "Heat oil in a large pot over medium-high heat. Cook and stir hot Italian sausage, mild Italian sausage, onion, and a pinch of salt together in the pot, breaking up sausage with a wooden spoon. Cook until sausage is browned and crumbly, and most of the liquid is evaporated, about 10 minutes.\nStir ancho chile powder, paprika, cumin, ground black pepper, chipotle chile powder, and oregano into sausage mixture; saute until fragrant, about 2 minutes.\nPour water and tomato puree into sausage mixture, bring to a simmer, reduce heat to medium-low, and cook on a steady simmer until sausage is tender, about 45 minutes. Add water as necessary and skim any fat that floats to the top.\nStir cannellini beans, red bell pepper, and green bell pepper into sausage mixture. Simmer until vegetables are tender, about 30 minutes. Season with salt to taste.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}