{
    "id": 236574,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large skinless, boneless chicken breast half",
        "2 pinches Montreal steak seasoning, or to taste",
        "1/3 cup hot pepper sauce (such as Frank's RedHotÂ®)",
        "2 tablespoons hot pepper sauce (such as Frank's RedHotÂ®)",
        "2 pieces tandoori naan bread",
        "1 teaspoon olive oil, or as needed",
        "1/2 cup blue cheese dressing (such as Marie'sÂ®), or to taste",
        "2 tablespoons diced red onion",
        "8 ounces shredded Cheddar cheese, or to taste",
        "1/2 cup shredded iceberg lettuce",
        "1 roma (plum) tomato, seeded and chopped"
    ],
    "nut": [
        "Calories > 1170 kcal",
        "Carbs > 53.7 g",
        "Cholesterol > 204 mg",
        "Fat > 78 g",
        "Protein > 65.5 g",
        "Sodium > 3328 mg"
    ],
    "n": "Grilled Buffalo Chicken Pizza",
    "a": "GraysonsMom",
    "r": "0",
    "s": 2,
    "des": "\"With spicy grilled chicken and cool, creamy dressing, this crispy flatbread pizza has all the flavors of a delicious Buffalo chicken sandwich. Juicy tomatoes and crisp lettuce give this dish a refreshing bite. I've been making this pizza for years and have yet to meet someone who doesn't love it. Garnish with pickled jalapenos, banana pepper rings, black olives, and blue cheese crumbles.\"",
    "ins": "Season chicken breast with Montreal steak seasoning. Place chicken in a resealable plastic bag and pour 1/3 cup hot pepper sauce into the bag. Seal bag and rub hot sauce into chicken. Transfer bag to the refrigerator and marinate for 12 hours or overnight.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nRemove chicken from the bag and discard marinade. Cook the chicken on the preheated grill until no longer pink in the center and the juices run clear, 5 to 7 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Transfer chicken to a cutting board to rest for 5 to 10 minutes.\nDice cooled chicken into bite-size pieces. Toss chicken and remaining 2 tablespoons hot sauce together in a bowl.\nBrush each naan with olive oil; cook on the grill until golden and toasted on one side, 3 to 5 minutes. Reduce heat to medium-low and transfer naan pieces, toasted-side up, to a baking sheet. Spread blue cheese dressing on the toasted side of each naan. Top each with diced chicken and red onion. Sprinkle Cheddar cheese over the top.\nReturn naan to grill and cook until cheese is melted and bottom is toasted and golden, 5 to 10 minutes more. Remove from grill, slice into pieces and top with lettuce and tomato.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "12 h ",
    "i": "1112369.jpg",
    "o": "",
    "st": "allrecipes"
}