{
    "id": 236535,
    "old_rating": "4.58333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 skinless, boneless chicken breast halves, or more to taste",
        "1 (8 ounce) container whipped cream cheese",
        "3/4 cup crumbled feta cheese",
        "1 tomato, diced",
        "1 (6 ounce) can chopped black olives",
        "1/4 onion, chopped",
        "1/4 cup chopped fresh spinach"
    ],
    "nut": [
        "Calories > 356 kcal",
        "Carbs > 6.6 g",
        "Cholesterol > 128 mg",
        "Fat > 23.2 g",
        "Protein > 30.4 g",
        "Sodium > 818 mg"
    ],
    "n": "Greek Cream Cheese-Stuffed Chicken",
    "a": "chikkin",
    "r": "0",
    "s": 6,
    "des": "\"A delicious creamy blend of Greek flavors rolled up in chicken. I just threw this together last night and it turned out amazing. I made 3 chicken breasts and still have a huge bowl of filling. I am going to try to make several other dishes with it. Tonight - stuffed burgers. Tomorrow - filling on rye bread topped with shrimp or cucumber as an appetizer. It might also be delicious with lamb, fish, or in a pita wrap with lettuce. Experiment with this filling because it is delicious all on its own. Serve with Greek salad or side dish of choice.\"",
    "ins": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nCut each chicken breast from one side through the middle horizontally to within one-half inch of the other side. Open the two sides and spread them out like an open book.\nMix cream cheese, feta cheese, tomato, olives, onion, and spinach together in a large bowl. Spoon cheese mixture onto 1 side of each opened chicken breast. Fold each chicken breast closed and place on a piece of aluminum foil.\nCook the chicken breasts on the preheated grill until no longer pink in the center and the juices run clear, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "1126659.jpg",
    "o": "",
    "st": "allrecipes"
}