{
    "id": 236509,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup mayonnaise",
        "2 tablespoons tomato paste",
        "2 tablespoons minced red onion",
        "1 tablespoon minced green bell pepper",
        "1 tablespoon minced red bell pepper",
        "1 tablespoon fresh lemon juice",
        "1/4 teaspoon salt",
        "3 pounds russet potatoes, peeled and cut into 1/4-inch strips",
        "4 cups olive oil for frying, or as needed",
        "salt to taste"
    ],
    "nut": [
        "Calories > 579 kcal",
        "Carbs > 43.9 g",
        "Cholesterol > 14 mg",
        "Fat > 44 g",
        "Protein > 5.5 g",
        "Sodium > 322 mg"
    ],
    "n": "Flemish Frites - Belgian Fries with Andalouse Sauce",
    "a": "6kids3cats",
    "r": "0",
    "s": 6,
    "des": "\"Belgian fries are cooked twice for a soft middle and crisp outside and served with a mayo sauce called 'Andalouse' that can be best described as vaguely similar to Thousand Island dressing. The sauce makes a great chip dip or vegetable dip as well. We go through so much of it, I double it! My husband's family is Belgian, Flemish to be exact. I am told Flemish is equated with quality. This is a snack that is worth the time and effort! Since this is all about quality, be sure to use firm, fresh potatoes. Bring the sauce to room temperature before serving.\"",
    "ins": "Stir mayonnaise, tomato paste, red onion, green bell pepper, red bell pepper, lemon juice, and salt together in a bowl. Cover the Andalouse sauce with plastic wrap and refrigerate 8 hours to overnight.\nHeat oil in a deep-fryer or large saucepan to 300 degrees F (150 degrees C).\nSubmerge potato strips in a bowl of ice water; rinse potatoes in several changes of cold water until water in the bowl is clear. Drain potatoes and pat dry.\nWorking in batches, fry potatoes in the hot oil until just cooked through but still white, about 5 minutes. Transfer fries to a paper-towel lined plate to drain. Bring oil back to temperature between batches. Cool potatoes to room temperature, about 30 minutes.\nIncrease oil temperature to 375 degrees F (190 degrees C). Working in batches, fry the potatoes again until deep golden, 5 to 10 minutes more. Transfer fries to a paper-towel lined plate to drain. Season fries with salt and serve with Andalouse sauce.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "9 h ",
    "i": "1949129.jpg",
    "o": "",
    "st": "allrecipes"
}