{
    "id": 236571,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup tandoori paste",
        "6 tablespoons plain yogurt",
        "2 skinless, boneless chicken breast halves",
        "6 tablespoons olive oil, divided",
        "4 pieces tandoori naan bread",
        "3 teaspoons spicy curry powder",
        "1 teaspoon ground turmeric",
        "1 yellow bell pepper, thinly sliced",
        "1 large red onion, thinly sliced",
        "4 (4 ounce) spreadable goat cheese",
        "1 tomato, thinly sliced",
        "4 ounces feta cheese"
    ],
    "nut": [
        "Calories > 1058 kcal",
        "Carbs > 64 g",
        "Cholesterol > 159 mg",
        "Fat > 65.8 g",
        "Protein > 53.7 g",
        "Sodium > 2444 mg"
    ],
    "n": "Indian Pizza",
    "a": "pinkimmie",
    "r": "0",
    "s": 4,
    "des": "\"If you love Indian food, then this pizza is for you! Add more or less curry powder to adjust spiciness.\"",
    "ins": "Whisk tandoori paste and yogurt together in a large glass or ceramic bowl. Add the chicken and toss to evenly coat. Cover the bowl with plastic wrap, and marinate in the refrigerator for 8 hours or overnight.\nPreheat oven to 400 degrees F (200 degrees C).\nHeat 1 tablespoon olive oil in a large skillet over medium-high heat. Remove chicken from marinade, shake to remove any excess, and discard marinade. Cook chicken breasts in hot oil, turning occasionally, until no longer pink in the center and the juices run clear, 10 to 12 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove chicken from skillet and shred using two forks.\nBrush each piece of naan with about 1 teaspoon olive oil and sprinkle a pinch of curry powder over each; arrange naan on a baking sheet.\nBake naan in the preheated oven until toasted and fragrant, about 5 minutes.\nHeat remaining 1/4 olive oil in a skillet over medium-high heat. Cook and stir yellow pepper, onion, 2 teaspoons curry powder, and turmeric in hot oil until vegetables soften, 5 to 7 minutes.\nSpread goat cheese onto each naan piece. Sprinkle more curry powder over the goat cheese. Top with shredded chicken, pepper mixture, tomato, and feta cheese. Sprinkle a pinch of curry powder over the top.\nBake in the oven until feta is soft, about 20 minutes.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "9 h",
    "i": "2337849.jpg",
    "o": "",
    "st": "allrecipes"
}