{
    "id": 236620,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon vegetable oil",
        "1/2 onion, chopped",
        "1 tablespoon crushed garlic",
        "2 skinless, boneless chicken breast halves, cut into 1-inch pieces",
        "1 pinch salt",
        "1 pinch ground white pepper, or to taste",
        "ground black pepper to taste (optional)",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1/2 cup mayonnaise",
        "1/2 cup grated Parmesan cheese",
        "1/4 cup frozen corn",
        "2 1/2 tablespoons sour cream",
        "1 tablespoon milk",
        "1 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 538 kcal",
        "Carbs > 13.1 g",
        "Cholesterol > 85 mg",
        "Fat > 43.1 g",
        "Protein > 25.4 g",
        "Sodium > 1013 mg"
    ],
    "n": "Simple Creamy Garlic-Mushroom Chicken",
    "a": "Housewife1",
    "r": "0",
    "s": 4,
    "des": "\"Cream of mushroom soup together with sour cream, corn, and Parmesan to coat chicken breasts served on your choice of pasta or rice. This recipe is for 4 adult servings with no leftovers. Use your own instincts to add a little of what you like. But stick closely to the recipe, it's worth it. You can substitute peas for the corn. Enjoy!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nHeat oil in a large skillet over medium-high heat. Saute onion and garlic in hot oil until slightly softened and fragrant, about 3 minutes. Add chicken pieces; season with salt, white pepper, and black pepper. Cook and stir chicken until no longer pink in the middle, 7 to 10 minutes; transfer to an 8-inch square baking dish.\nStir condensed soup, mayonnaise, Parmesan cheese, corn, sour cream, and milk together in a bowl; pour over chicken in the baking dish. Sprinkle Cheddar cheese over the top.\nBake in the preheated oven until bubbling and cheese is melted, about 20 minutes. Let rest for 5 minutes before serving.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "1662844.jpg",
    "o": "",
    "st": "allrecipes"
}