{
    "id": 236628,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup water",
        "1/2 cup long-grain brown rice",
        "1 pound ground bison",
        "6 green bell peppers - tops, seeds, and membranes removed",
        "1 (8 ounce) can tomato sauce",
        "1 tablespoon Worcestershire sauce",
        "1 tablespoon dried oregano",
        "1 tablespoon all-purpose seasoning (such as VegataÂ®)",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon onion powder",
        "salt and ground black pepper to taste",
        "1 (14.5 ounce) can diced tomatoes",
        "1 teaspoon Italian seasoning"
    ],
    "nut": [
        "Calories > 178 kcal",
        "Carbs > 23.2 g",
        "Cholesterol > 39 mg",
        "Fat > 1.9 g",
        "Protein > 16.8 g",
        "Sodium > 365 mg"
    ],
    "n": "Bison and Brown Rice Stuffed Peppers",
    "a": "katanity",
    "r": "0",
    "s": 6,
    "des": "\"Green bell peppers are filled with ground bison, cooked brown rice, tomato sauce, and seasonings, then baked for an hour with additional tomato sauce and Italian-style seasoning.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and liquid has been absorbed, about 20 minutes.\nHeat a large skillet over medium-high heat. Cook and stir bison in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nArrange bell peppers, cut-side up, in a baking dish. Slice bottoms of peppers if needed so they stand upright.\nMix rice, bison, tomato sauce, Worcestershire sauce, oregano, all-purpose seasoning, garlic powder, onion powder, salt, and pepper together in a bowl. Spoon rice-bison mixture into each bell pepper.\nMix diced tomatoes and Italian seasoning together in a bowl; pour over stuffed peppers.\nBake in the preheated oven, basting with diced tomatoes mixture every 15 minutes, until peppers are tender, about 1 hour.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4451876.jpg",
    "o": "",
    "st": "allrecipes"
}