{
    "id": 236678,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground lamb",
        "2 cups sliced fresh mushrooms",
        "1 large onion, diced small",
        "2 carrots, diced small",
        "1 clove garlic, minced",
        "1 (1 ounce) package dry onion soup mix",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "2 cups milk",
        "1 cup shredded sharp Cheddar cheese",
        "1 cup shredded Havarti cheese",
        "1 egg, beaten",
        "3 large potatoes, thinly sliced",
        "salt and ground black pepper, to taste"
    ],
    "nut": [
        "Calories > 435 kcal",
        "Carbs > 35.1 g",
        "Cholesterol > 106 mg",
        "Fat > 23 g",
        "Protein > 23.2 g",
        "Sodium > 626 mg"
    ],
    "n": "Lamb au Gratin",
    "a": "moms diner",
    "r": "0",
    "s": 8,
    "des": "\"A cross between a lamb shepherd's pie and potatoes au gratin. Experiment with your favorite cheeses.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Thoroughly grease a covered baking dish.\nHeat a large skillet over medium-high heat. Cook and stir ground lamb in the hot skillet until some of the fat begins to render; add onion, carrots, and garlic. Continue to cook and stir the mixture until the lamb is completely browned and crumbly, 5 to 7 minutes. Stir soup mix into the lamb mixture; remove skillet from heat.\nMelt butter in a saucepan over medium heat. Whisk flour into butter, 1 tablespoon at a time, making sure there are no lumps between additions. Pour milk into the butter mixture while whisking; continue to whisk until the milk thickens and the mixture is smooth.\nSwitch heat below saucepan to 'off.' Stir Cheddar cheese and Havarti cheese into the milk mixture until the cheese is melted and the sauce is smooth.\nSpoon a small amount of the cheese sauce into the beaten egg in a bowl; whisk together to temper the egg. Pour the tempered egg into the cheese sauce and stir.\nArrange sliced potatoes in the bottom of the prepared baking dish, overlapping to make a layer about 1/2-inch deep; season with salt and pepper. Pour about 1/3 of the cheese sauce over the potatoes and spread into an even layer. Spread the lamb mixture evenly atop the cheese sauce layer. Layer remaining potatoes atop the lamb; season again with salt and pepper. Pour remaining cheese over the top. Cover baking dish.\nBake in preheated oven until the potatoes are tender, about 90 minutes. Remove cover and continue baking until the top browns, about 30 minutes more.",
    "pt": "30 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}