{
    "id": 236612,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup all-purpose flour",
        "3 tablespoons paprika",
        "2 teaspoons cayenne pepper, divided",
        "1 pound beef chuck, cut into cubes",
        "2 tablespoons vegetable oil",
        "1 onion, chopped",
        "4 cups vegetable broth",
        "4 potatoes, cut into cubes",
        "1 (10 ounce) can diced tomatoes with green chile peppers (optional)",
        "2 carrots, diced",
        "1 tomato - peeled, seeded, and chopped (optional)",
        "1 habanero pepper, seeded and chopped",
        "1 habanero pepper, halved and seeded",
        "1 tablespoon ground black pepper",
        "1/2 teaspoon caraway seeds"
    ],
    "nut": [
        "Calories > 270 kcal",
        "Carbs > 34.2 g",
        "Cholesterol > 26 mg",
        "Fat > 10.4 g",
        "Protein > 11.5 g",
        "Sodium > 407 mg"
    ],
    "n": "Hot and Spicy Habanero Beef Stew",
    "a": "Rafal",
    "r": "0",
    "s": 8,
    "des": "\"This very spicy beef stew full of vegetables, spices, and habanero peppers is slow-cooked to perfection and will warm anyone up on long, cold winter days, but is fantastic all year long.\"",
    "ins": "Combine flour, paprika, and 1 teaspoon cayenne pepper in a large, resealable plastic bag; shake to mix. Add beef and shake to coat beef in flour mixture. Remove beef from bag and shake to remove any excess flour mixture.\nHeat oil in a skillet over medium-high heat. Cook beef in hot oil until browned on all sides, 5 to 7 minutes. Remove beef with a slotted spoon to a slow cooker, retaining oil and drippings in the skillet.\nSaute onion in retained drippings until soft and translucent, 5 to 7 minutes; add to beef in slow cooker.\nStir vegetable broth, potatoes, diced tomatoes with green chile peppers, carrots, tomato, chopped habanero pepper, habanero pepper halves, black pepper, and caraway seeds with the beef and onion in the slow cooker.\nCook on Low for 4 hours. Remove and discard the habanero pepper halves before serving.",
    "pt": "20 m",
    "ct": "4 h ",
    "tt": "4 h ",
    "i": "1106009.jpg",
    "o": "",
    "st": "allrecipes"
}