{
    "id": 236641,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Lamb Meatballs:",
        "1/4 cup Italian-seasoned bread crumbs",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon ground paprika",
        "1/4 teaspoon dried mint",
        "1/4 teaspoon dried basil",
        "1/4 teaspoon dried parsley",
        "1 pound ground lamb",
        "1 egg",
        "2 tablespoons finely chopped onion",
        "2 cloves garlic, minced",
        "1/2 teaspoon olive oil",
        "salt and ground black pepper to taste",
        "Sauce:",
        "1 (26 ounce) jar tomato sauce",
        "1 tablespoon capers",
        "4 leaves fresh basil leaves, torn",
        "1/4 teaspoon dried mint",
        "salt and ground black pepper to taste",
        "Remaining Ingredients:",
        "4 pieces tandoori naan bread",
        "8 slices Muenster cheese, or as needed"
    ],
    "nut": [
        "Calories > 771 kcal",
        "Carbs > 61 g",
        "Cholesterol > 187 mg",
        "Fat > 38 g",
        "Protein > 47.9 g",
        "Sodium > 1885 mg"
    ],
    "n": "Lamb Meatballs Over Tandoori Naan",
    "a": "jdwuscg",
    "r": "0",
    "s": 4,
    "des": "\"I love making lamb meatballs; the combination of mint and lamb make for a very exciting flavor profile. These meatballs are combined with a hearty prepared tomato sauce and then served over tandoori naan with melted cheese to create a delicious dish.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease a baking sheet.\nMix bread crumbs, garlic powder, paprika, 1/4 teaspoon mint, dried basil, and parsley together in a large bowl. Add ground lamb, egg, onion, garlic, olive oil, salt, and pepper; mix until evenly distributed. Form ground lamb into 1-inch balls and arrange in a single layer on the prepared baking sheet.\nBake in the preheated oven for 15 minutes. Flip meatballs and continue cooking until cooked through, about 10 minutes more. Remove meatballs from oven and reduce oven temperature to 350 degrees F (175 degrees C).\nPour tomato sauce into a saucepan over low heat; add capers, fresh basil, 1/4 teaspoon mint, salt, and pepper. Cook sauce, stirring occasionally, until heated through and flavors have blended, 5 to 10 minutes.\nPlace naan bread on a baking sheet. Spoon tomato sauce and meatballs on the naan; cover with Muenster cheese slices.\nBake in the oven until cheese is melted, 5 to 10 minutes.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "1108711.jpg",
    "o": "",
    "st": "allrecipes"
}