{
    "id": 236602,
    "old_rating": "4.86538",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds potatoes, peeled and quartered",
        "1 1/2 pounds cooked corned beef, finely chopped",
        "1 bunch green onions, chopped",
        "salt and ground black pepper to taste",
        "2 cloves garlic, crushed",
        "1 tablespoon butter",
        "1/4 cup roasted tomato salsa"
    ],
    "nut": [
        "Calories > 608 kcal",
        "Carbs > 36.2 g",
        "Cholesterol > 174 mg",
        "Fat > 35.5 g",
        "Protein > 35.8 g",
        "Sodium > 2068 mg"
    ],
    "n": "Chef John's Corned Beef Hash",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"When I'm cooking corned beef, watching it simmer in the aromatic broth, I'll sometimes close my eyes and picture the delicious plate of food I have coming. The funny thing is, it's not the sliced corned beef and cabbage I'm dreaming of, it's the corned beef hash I'm going to be making with the leftovers.\n Garnish with green onions and a poached egg.\"",
    "ins": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until almost tender but still firm, about 15 minutes. Drain and finely chop.\nCook beef in a large cast-iron or non-stick skillet over medium heat until fat begins to render. Stir green onions, salt, and pepper into beef. Add garlic and butter; cook and stir until butter is melted and garlic is fragrant, 1 to 2 minutes.\nStir potatoes, salsa, and a pinch of salt into beef mixture. Pat mixture down in the skillet with a spatula and divide hash into 4 sections. Cook, without stirring, until a crust forms on the bottom, about 5 minutes. Flip sections and cook until a crust forms on the bottom again, about 5 minutes more. Repeat cooking and flipping process, flipping every 5 minutes, until hash stays together and has a golden crust, 10 to 15 minutes.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "4487448.jpg",
    "o": "4487448.jpg,4486694.jpg,3929413.jpg,3616690.jpg,3616670.jpg,3515879.jpg",
    "st": "allrecipes"
}