{
    "id": 236630,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 small onion, chopped",
        "1 cup maple syrup",
        "2 tablespoons Dijon mustard",
        "6 cloves garlic, minced",
        "1 teaspoon horseradish",
        "1 teaspoon sesame oil",
        "freshly ground black pepper to taste",
        "1 1/2 pounds pork tenderloin",
        "1 teaspoon olive oil, or as needed"
    ],
    "nut": [
        "Calories > 301 kcal",
        "Carbs > 38.5 g",
        "Cholesterol > 63 mg",
        "Fat > 7.2 g",
        "Protein > 20.4 g",
        "Sodium > 176 mg"
    ],
    "n": "Maple and Garlic Marinated Pork Tenderloin",
    "a": "Tigerlady",
    "r": "0",
    "s": 6,
    "des": "\"Grilled pork tenderloin marinated in a deliciously sweet blend of real maple syrup, Dijon mustard, and a hint of sesame oil. Because I have one step-daughter that only eats chicken or fish, I separated some of the sauce into two bags; one for pork and one for 2 chicken breasts. She gave me one of the best compliments she ever has in the last year for my cooking: 'It is fine-dining quality.'\"",
    "ins": "Whisk onion, maple syrup, Dijon mustard, garlic, horseradish, sesame oil, and black pepper together in a shallow bowl. Add pork to marinade and turn to coat. Cover bowl with plastic wrap and marinate pork, 8 hours to overnight.\nRemove pork from marinade and pour marinade into a small saucepan. Cook marinade over medium-low heat until bubbling, about 5 minutes.\nHeat olive oil in a skillet over medium-high heat. Cook pork in the hot oil, basting with marinade, until browned, 2 to 3 minutes per side. Reduce heat to low and cook pork, basting occasionally with marinade, until no longer pink in the center, 15 to 25 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "8 h ",
    "i": "2219264.jpg",
    "o": "",
    "st": "allrecipes"
}