{
    "id": 236736,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Pesto:",
        "2 cups chopped fresh basil",
        "1/2 cup grated Parmesan cheese",
        "1/4 cup extra-virgin olive oil",
        "2 garlic cloves",
        "coarse salt and freshly ground black pepper to taste",
        "1/4 cup pine nuts",
        "Panini:",
        "8 fresh asparagus spears, trimmed, or more to taste",
        "2 tablespoons butter, softened",
        "4 slices soft oatmeal bread (such as Pepperidge FarmÂ®)",
        "4 slices provolone cheese",
        "1/4 pound sliced deli turkey meat"
    ],
    "nut": [
        "Calories > 961 kcal",
        "Carbs > 37.2 g",
        "Cholesterol > 110 mg",
        "Fat > 72.7 g",
        "Protein > 43.1 g",
        "Sodium > 1878 mg"
    ],
    "n": "Grilled Turkey Asparagus Pesto Paninis",
    "a": "bjean",
    "r": "0",
    "s": 2,
    "des": "\"These are fast, yet tasty sandwiches and are best on the grill! The oatmeal bread really gives these paninis great flavor, but you could use another type of hearty bread as well. My husband and I love them in the summer when the asparagus and basil are in season. Serve with a side of coleslaw for a satisfying crunchy side dish.\"",
    "ins": "Blend basil, Parmesan cheese, olive oil, garlic, salt, and pepper in a food processor or blender until smooth, scraping down sides as needed. Add pine nuts and pulse just until pine nuts are chopped, but still visible.\nPreheat grill for medium-low heat and lightly oil the grate.\nCook asparagus on the preheated grill directly on the grate or on a grill pan until tender, 5 to 10 minutes.\nSpread 1 1/2 teaspoons butter onto 1 side of each bread slice. Spread desired amount of pesto onto the opposite side of each bread slice. Layer provolone cheese and turkey on the pesto-side of 2 bread slices; top with a second bread slice, pesto-side down.\nPlace sandwiches directly on the grill and cook until golden brown and cheese is melted, about 6 minutes per side. Remove from grill and cut each sandwich in half.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "1527448.jpg",
    "o": "",
    "st": "allrecipes"
}