{
    "id": 236713,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 delicata squash, halved lengthwise and seeded",
        "2 tablespoons butter",
        "1 onion, chopped",
        "3 cups vegetable broth",
        "1 1/2 cups plain fat-free Greek yogurt",
        "1/2 teaspoon freshly grated nutmeg",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 218 kcal",
        "Carbs > 37.1 g",
        "Cholesterol > 12 mg",
        "Fat > 5.3 g",
        "Protein > 9.1 g",
        "Sodium > 421 mg"
    ],
    "n": "Creamy Delicata Squash Soup",
    "a": "Stella",
    "r": "0",
    "s": 5,
    "des": "\"Roasted squash lends a delicate sweetness to this creamy soup. Onions, vegetable broth, and roasted squash are cooked together with non-fat Greek yogurt and processed to a fine consistency for an incredibly rich-tasting soup. Chicken broth works fine for this, too.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C).\nPut squash halves into a large baking dish with cut-sides down. Pour enough water into the dish so the bottom 1/8-inch of the squash is submerged. Cover the baking dish with aluminum foil.\nRoast squash in preheated oven until the flesh is tender, 35 to 40 minutes. Set aside to cool.\nMelt butter in a large saucepan over low heat. Cook onion in butter, stirring occasionally, until softened, about 10 minutes.\nScrape the delicata squash flesh from the skin; add to the saucepan along with vegetable broth and yogurt. Stir the mixture until the squash and yogurt smoothly mix into the liquid. Bring to a simmer and cook until thickened, about 25 minutes.\nPour mixture from saucepan into a blender no more than half-full. Cover and hold lid in place with a towel; pulse a few times before leaving on to blend. Puree in batches until smooth and pour into a serving tureen. Season with salt and pepper to serve.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1112353.jpg",
    "o": "",
    "st": "allrecipes"
}