{
    "id": 236739,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (3 pound) flat-cut corned beef",
        "1 (32 ounce) carton beef stock",
        "water as needed",
        "5 large red potatoes, quartered",
        "3 tablespoons olive oil",
        "1 small head red cabbage, cut into 2-inch wedges"
    ],
    "nut": [
        "Calories > 582 kcal",
        "Carbs > 58.6 g",
        "Cholesterol > 97 mg",
        "Fat > 26.9 g",
        "Protein > 27.9 g",
        "Sodium > 1230 mg"
    ],
    "n": "Caramelized Corned Beef",
    "a": "mhonomichl",
    "r": "0",
    "s": 6,
    "des": "\"If you are tired of flavorless boiled corned beef, try cooking it in the oven. The key to this recipe is melting the fat and caramelizing the meat in the oven. As long as you are dragging out the slow cooker, you may want to cook an extra corned beef and potatoes to use for a second meal or corned beef hash.\"",
    "ins": "Place corned beef in a slow cooker. Pour beef stock over corned beef and add enough water to raise liquid to within 2 inches of top.\nCook on Low for 5 hours 15 minutes to 7 hours 15 minutes. Add potatoes to slow cooker and cook for 45 minutes.\nPreheat oven to 350 degrees F (175 degrees C) and set rack to center. Grease a roasting pan.\nRemove corned beef from slow cooker and blot dry with a paper towel. Strain potatoes from slow cooker using a slotted spoon, reserving liquid in slow cooker. Place corned beef, fat-side up, and potatoes, cut-side up, in the roasting pan; generously brush with olive oil.\nCook in the preheated oven until outside of corned beef is caramelized and browned, 45 to 60 minutes.\nPlace cabbage in the slow cooker; cook on Low until tender, 15 to 20 minutes.\nSlice corned beef and serve in roasting pan with potatoes. Strain cabbage and serve on the side.",
    "pt": "20 m",
    "ct": "6 h ",
    "tt": "7 h ",
    "i": "1112321.jpg",
    "o": "",
    "st": "allrecipes"
}