{
    "id": 236740,
    "old_rating": "4.63158",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons butter",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "4 cloves garlic, chopped",
        "1/4 cup all-purpose flour",
        "1 teaspoon dill seed",
        "1/2 teaspoon tarragon leaves",
        "1/4 teaspoon ground black pepper",
        "4 cups chicken broth",
        "3 cups chopped cabbage",
        "2 cups finely chopped deli corned beef",
        "2 cups half-and-half",
        "1 (8 ounce) package cream cheese",
        "2 tablespoons cornstarch",
        "2 tablespoons water"
    ],
    "nut": [
        "Calories > 317 kcal",
        "Carbs > 12.9 g",
        "Cholesterol > 86 mg",
        "Fat > 25.1 g",
        "Protein > 11.1 g",
        "Sodium > 1008 mg"
    ],
    "n": "Cabbage and Corned Beef Chowder",
    "a": "HomerSoda",
    "r": "0",
    "s": 8,
    "des": "\"This is the creamiest soup that made even my 5-year-old lick the bowl clean! Best served with Reuben sandwiches. Can be adapted to a slow cooker.\"",
    "ins": "Melt butter and olive oil together in a stockpot over medium heat; saute onion and garlic until onion is slightly softened, about 5 minutes. Add flour, dill seed, tarragon leaves, and black pepper to onion mixture; cook and stir until flour is dissolved and fragrant, about 3 minutes.\nPour chicken broth over onion mixture and stir until blended, 2 to 3 minutes. Add cabbage and corned beef; cook, stirring frequently, until cabbage is tender, about 20 minutes. Add half-and-half and cook just until liquid is warm but not boiling, about 5 minutes.\nStir half-and-half into the pot; continue to cook just until liquid is warm but not boiling, about 5 minutes.\nMelt cream cheese over low heat in a saucepan until creamy, 2 to 3 minutes. Whisk cornstarch and water together in a bowl; stir into cream cheese until smooth. Stir cream cheese mixture into soup; cook over low heat, stirring constantly, until cheese melts and soup is thickened, about 5 minutes.",
    "pt": "10 m",
    "ct": "45 m",
    "tt": "55 m",
    "i": "4486604.jpg",
    "o": "",
    "st": "allrecipes"
}