{
    "id": 236743,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cake:",
        "1 (16.25 ounce) package white cake mix",
        "1 1/4 cups water",
        "3 egg whites",
        "1/3 cup vegetable oil",
        "2 teaspoons lemon extract",
        "Frosting:",
        "1 cup cold heavy whipping cream",
        "1 (8 ounce) package cream cheese, softened",
        "3/4 cup white sugar",
        "1 teaspoon vanilla extract",
        "Filling:",
        "1/3 cup blueberry pie filling"
    ],
    "nut": [
        "Calories > 419 kcal",
        "Carbs > 46.8 g",
        "Cholesterol > 48 mg",
        "Fat > 24.1 g",
        "Protein > 4.5 g",
        "Sodium > 333 mg"
    ],
    "n": "Lemon Blueberry Cake",
    "a": "Kamill",
    "r": "0",
    "s": 12,
    "des": "\"This is an easy cake mix-cake with marvelous frosting. For more lemon flavor, I sometimes add lemon rind.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 8-inch pans.\nBeat cake mix, water, egg whites, vegetable oil, and lemon extract together in a bowl using an electric mixer on medium speed until batter is well combined, about 2 minutes. Pour batter into prepared pans.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 25 to 30 minutes. Cool in pans for 10 minutes before transferring it to a wire rack to cool completely.\nBeat cream in a chilled bowl using an electric mixer until soft peaks are almost forming into stiff peaks; place bowl in refrigerator.\nBeat cream cheese, sugar, and vanilla extract together in a separate bowl using an electric mixer until smooth and creamy. Fold whipped cream into cream cheese mixture.\nPlace 1 cake on a plate; top with blueberry pie filling. Place second cake atop blueberry filling. Generously frost cake with whipped cream cheese frosting.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "3770360.jpg",
    "o": "",
    "st": "allrecipes"
}