{
    "id": 236846,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups pecan halves",
        "non-stick cooking spray",
        "1 (14 ounce) can refrigerated cinnamon roll dough, separated",
        "3/4 cup dark corn syrup",
        "1/2 cup packed light brown sugar",
        "3 tablespoons butter, melted",
        "3 large eggs, at room temperature",
        "2 teaspoons ground cinnamon",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon salt",
        "1 cup cream cheese frosting"
    ],
    "nut": [
        "Calories > 591 kcal",
        "Carbs > 71.2 g",
        "Cholesterol > 65 mg",
        "Fat > 33.7 g",
        "Protein > 6.1 g",
        "Sodium > 575 mg"
    ],
    "n": "Cinnamon Bun Pecan Pie",
    "a": "Courkanykay13",
    "r": "0",
    "s": 10,
    "des": "\"I absolutely love this recipe! Great for family gatherings or holidays!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Spread pecans onto a baking sheet.\nBake in the preheated oven until pecans are toasted and fragrant, 5 to 10 minutes.\nSpray a 9-inch pie pan with cooking spray. Line a baking sheet with parchment paper or aluminum foil.\nPress the cinnamon rolls into the bottom of the pie pan, sealing edges together to create the 'crust'.\nWhisk corn syrup and brown sugar together in a bowl until thick and sticky. Add butter and whisk until mixture is smooth. Whisks eggs, 1 at a time, into brown sugar mixture, whisking well after each addition, until eggs are fully incorporated. Stir cinnamon, vanilla extract, and salt into brown sugar mixture.\nLayer the toasted pecans over the cinnamon roll 'crust'. Pour the brown sugar mixture over pecans. Place the pie on the prepared baking sheet.\nBake in the preheated oven for 15 minutes. Cover crust with pieces of aluminum foil to avoid burning.\nReduce oven temperature to 350 degrees F (175 degrees C). Continue baking until pie is set in the middle, 20 to 25 minutes. Cool pie for 15 minutes.\nPlace cream cheese frosting in a microwave-safe bowl; heat in microwave until frosting is thinned and pourable, about 30 seconds. Drizzle frosting over pie and set aside until frosting has slightly hardened, about 20 minutes.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "1859504.jpg",
    "o": "",
    "st": "allrecipes"
}