{
    "id": 236807,
    "old_rating": "3.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Gnocchi:",
        "1 pound ricotta cheese",
        "3 large eggs",
        "1 teaspoon salt, or to taste",
        "1/2 teaspoon ground black pepper",
        "1 pinch ground nutmeg",
        "1 cup all-purpose flour",
        "Sauce:",
        "1 tablespoon olive oil",
        "1/2 cup sliced fresh morel mushrooms, or more to taste",
        "3 cloves garlic, minced",
        "3 cups vegetable broth",
        "1 cup fresh green peas, or more to taste",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 277 kcal",
        "Carbs > 27.3 g",
        "Cholesterol > 116 mg",
        "Fat > 11.3 g",
        "Protein > 16.1 g",
        "Sodium > 749 mg"
    ],
    "n": "Ricotta Gnocchi with Fresh Peas and Mushrooms",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"If I made this same combination of ingredients 100 times, each version would be different, which I how I believe these things should work. When I buy peas at the farmer's market, I'm not thinking I need 2 cups, I'm thinking I need to buy some peas. The same goes for the mushrooms. Grab a handful and keep moving. Garnish with Parmigiano-Reggiano cheese and fresh parsley, mint, or basil.\"",
    "ins": "Process ricotta, eggs, 1 teaspoon salt, pepper, and nutmeg in a food processor until smooth. Add flour and blend until a smooth, semi-stiff batter forms. Transfer gnocchi batter to a bowl, cover the bowl with plastic wrap, and refrigerate for 1 hour.\nHeat oil in a large saucepan over medium-high heat. Saute mushrooms in hot oil until soft and fragrant, 3 to 5 minutes. Add garlic and saute for 1 minute. Add vegetable broth, bring to a boil and reduce to a simmer; stir in peas. Cook until peas are soft, 3 to 5 minutes. Season with salt and pepper to taste.\nFill a large pot with lightly salted water and bring to a rolling boil.\nWorking in batches, drop spoonfuls of ricotta batter into boiling water. Bring water back to a boil and cook for 3 minutes. Remove gnocchi to ice water to stop the cooking process, then drain and reserve. Repeat with remaining batter.\nCombine gnocchi and mushroom sauce in a saucepan and cook until heated through, 2 to 5 minutes.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "2 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}