{
    "id": 236814,
    "old_rating": "4.5098",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 teaspoons olive oil, or to taste",
        "2 whole rainbow trout, gutted and cleaned, heads and tails still on",
        "1/4 teaspoon dried dill weed",
        "1/4 teaspoon dried thyme",
        "salt and freshly ground black pepper to taste",
        "1/2 large onion, sliced",
        "2 thin slices lemon (optional)",
        "2 tablespoons hot water"
    ],
    "nut": [
        "Calories > 373 kcal",
        "Carbs > 1.5 g",
        "Cholesterol > 162 mg",
        "Fat > 15.3 g",
        "Protein > 54.2 g",
        "Sodium > 159 mg"
    ],
    "n": "Baked Fresh Rainbow Trout",
    "a": "In-a-Pickle",
    "r": "0",
    "s": 6,
    "des": "\"Very easy and tasty recipe I invented one day with ingredients on hand, for fresh rainbow trout (farmed or wild) that my family loves. It takes very little time and is much lighter than ocean fish. I use whole fish you can buy already  gutted from the supermarket, with heads and tails still on. Make sure you pick trout that are really, really fresh. I find the dish doesn't even need lemon slices but you can use them if you like. The key is to remember to add the water to the dish as instructed in directions, which keeps fish from drying out. Serve with rice and veggies. Light and delicious. Be careful of bones! Make sure to add hot water to the dish; cold water can crack the baking dish.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9x13-inch baking dish with about 1 teaspoon olive oil.\nPlace trout in the prepared baking dish and coat with remaining olive oil. Season the inside and outside of fish with dill, thyme, and salt. Stuff each fish with onion slices; grind pepper over the top. Place 1 lemon slice on each fish.\nBake in the preheated oven for 10 minutes; add water to dish. Continue baking until fish flake easily with a fork, about 10 minutes more.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "1431579.jpg",
    "o": "4517009.jpg,4505633.jpg,4503720.jpg,4480669.jpg,4463814.jpg,4277752.jpg",
    "st": "allrecipes"
}