{
    "id": 236819,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 slices bacon",
        "1/4 cup red wine vinegar",
        "1/4 cup seasoned rice vinegar",
        "1 (2 ounce) can anchovy fillets (such as King OscarÂ®), diced (optional)",
        "1/2 teaspoon ground white pepper",
        "2 tablespoons extra-virgin olive oil",
        "1 yellow onion, thinly sliced",
        "2 cloves garlic, minced",
        "12 ounces baby spinach (such as DoleÂ®)",
        "4 hard-boiled eggs, peeled and sliced",
        "1/2 cup green onions, finely chopped",
        "1/4 cup grated Asiago cheese"
    ],
    "nut": [
        "Calories > 210 kcal",
        "Carbs > 8.2 g",
        "Cholesterol > 162 mg",
        "Fat > 14.1 g",
        "Protein > 12.9 g",
        "Sodium > 840 mg"
    ],
    "n": "Easy Warm Spinach Salad",
    "a": "440DartRacer",
    "r": "0",
    "s": 6,
    "des": "\"I came up with this recipe the same way I think a lot of cooks come up with new ideas - by sticking my head in the refrigerator and wondering what I could throw together with what I had. It turned out to be easy and very tasty so I thought I would share.\"",
    "ins": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Crumble bacon.\nWhisk red wine vinegar, seasoned rice vinegar, anchovies, and white pepper together in a bowl until dressing is evenly mixed.\nHeat olive oil in a large wok or skillet over medium-high heat; saute onion and garlic until onion is transparent, 5 to 10 minutes. Lower heat to medium. Add spinach, working in batches, to onion mixture, tossing and mixing until spinach wilts, 1 to 2 minutes.\nTransfer spinach mixture to a serving bowl; top with egg slices and bacon.\nPour dressing into the wok; bring to just under a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Pour dressing over spinach mixture; sprinkle with green onions and Asiago cheese.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "2778292.jpg",
    "o": "",
    "st": "allrecipes"
}