{
    "id": 236938,
    "old_rating": "4.74074",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil for brushing, or as needed",
        "2 eggplant, cut into 1/2-inch thick slices",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "1/4 pound mushrooms, sliced",
        "3 cloves garlic, minced",
        "1 (15 ounce) can tomato sauce",
        "3/4 teaspoon dried basil",
        "3/4 teaspoon dried oregano",
        "salt and ground black pepper to taste",
        "2 cups shredded mozzarella cheese",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 267 kcal",
        "Carbs > 20.3 g",
        "Cholesterol > 30 mg",
        "Fat > 15.3 g",
        "Protein > 15.6 g",
        "Sodium > 734 mg"
    ],
    "n": "Cheesy Eggplant Parmesan Casserole",
    "a": "lyndalou",
    "r": "0",
    "s": 6,
    "des": "\"My mom would make this when I was young, and it was always a favorite. Serve with a crisp green salad and garlic bread.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nBrush about 2 tablespoons olive oil onto eggplant slices; arrange in a single layer in a shallow baking dish.\nBake in the preheated oven until eggplant is tender and browned, 20 to 25 minutes. Remove eggplant from oven and reduce temperature to 350 degrees F (175 degrees C).\nHeat 1 tablespoon olive oil in a large skillet or frying pan over medium heat; cook and stir onion, mushrooms, and garlic until onion is softened, 5 to 10 minutes. Add tomato sauce, basil, and oregano; bring to a boil. Reduce heat and simmer until sauce is slightly reduced, about 10 minutes; season with salt and pepper.\nArrange about 1/2 the eggplant slices in a 2-quart casserole dish; top with 1/2 the sauce, 1/2 the mozzarella cheese, and 1/2 the Parmesan cheese. Repeat layering with the remaining ingredients.\nBake in the preheated oven until hot and bubbling, about 25 minutes. Cool for about 5 minutes before serving.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "2101603.jpg",
    "o": "4476965.jpg,3793684.jpg,3790511.jpg,3663677.jpg,3534128.jpg,2850899.jpg",
    "st": "allrecipes"
}