{
    "id": 236903,
    "old_rating": "4.18182",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons salt",
        "1 tablespoon fennel seed",
        "3 tablespoons white sugar",
        "3 tablespoons paprika",
        "2 tablespoons chili powder",
        "4 teaspoons ground black pepper",
        "1 tablespoon onion powder",
        "1 tablespoon garlic powder",
        "6 pounds pork back ribs",
        "3/4 cup barbeque sauce",
        "3 tablespoons honey",
        "3 tablespoons cider vinegar"
    ],
    "nut": [
        "Calories > 872 kcal",
        "Carbs > 32.9 g",
        "Cholesterol > 234 mg",
        "Fat > 59.9 g",
        "Protein > 49.6 g",
        "Sodium > 2907 mg"
    ],
    "n": "Kansas City BBQ Ribs",
    "a": "RuthE",
    "r": "0",
    "s": 6,
    "des": "\"Get your napkins ready! These sumptuous ribs will be devoured by one and all. The overnight rest in the fridge lets the spice rub penetrate and really flavor these meaty ribs.\"",
    "ins": "Grind salt and fennel seed together in a blender or coffee grinder. Stir fennel-salt mixture, sugar, paprika, chili powder, black pepper, onion powder, and garlic powder together in a bowl.\nCut each pork slab into 3 pieces, about 5 ribs each. Pat ribs dry with a paper towel and rub spice mixture over each piece. Place ribs on a plate, cover with plastic wrap, and refrigerate, 8 hours to overnight.\nAllow ribs to sit at room temperature for 1 hour.\nPreheat grill between 270 degrees F (132 degrees C) and 300 degrees F (149 degrees C) for indirect grilling and lightly oil the grate.\nGrill ribs on the preheated grill with the cover down, turning once, until no longer pink in the center, about 1 1/2 hours. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\nCombine barbeque sauce, honey, and cider vinegar in a small saucepan; bring to a boil. Reduce heat and simmer until sauce is thickened and smooth, about 10 minutes. Brush sauce onto ribs.\nCook ribs for 15 minutes; flip, baste the other side, and cook until ribs are glazed and tender when pierced with a fork, about 15 minutes more. Let ribs stand for 10 minutes before serving.",
    "pt": "15 m",
    "ct": "2 h",
    "tt": "11 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}