{
    "id": 236925,
    "old_rating": "4.26829",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound ground beef",
        "1 small onion, chopped",
        "1 green bell pepper, chopped",
        "1 red bell pepper, chopped",
        "1 clove garlic, chopped",
        "1 (14.5 ounce) can petite diced tomatoes",
        "1 cup ketchup",
        "1 tablespoon brown sugar",
        "1 teaspoon yellow mustard",
        "salt and ground black pepper to taste",
        "2 cups frozen whole-kernel corn",
        "1 (16 ounce) package penne pasta",
        "1 1/2 cups shredded Colby-Jack cheese"
    ],
    "nut": [
        "Calories > 513 kcal",
        "Carbs > 63.6 g",
        "Cholesterol > 59 mg",
        "Fat > 18.8 g",
        "Protein > 25.1 g",
        "Sodium > 656 mg"
    ],
    "n": "Sloppy Joe Casserole",
    "a": "Theresa Harnar",
    "r": "0",
    "s": 8,
    "des": "\"This is a great comfort food recipe that I love to make on a cold winter day. It is also a hit at our church's potluck dinners.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat a large skillet over medium-high heat. Cook and stir beef, onion, green bell pepper, red bell pepper, and garlic in the hot skillet until beef is browned and crumbly, 5 to 7 minutes; drain and discard grease.\nStir tomatoes, ketchup, brown sugar, mustard, salt, and pepper into ground beef mixture; reduce heat and simmer until heated through, about 10 minutes.\nBring a large pot of lightly salted water to a boil. Cook corn in the boiling water until cooked through, about 5 minutes; drain.\nBring a large pot of lightly salted water to a boil; add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain.\nMix corn, pasta, and Colby-Jack cheese into ground beef mixture; pour into a 9x13-inch baking dish.\nBake in the preheated oven until heated through and cheese is melted, about 20 minutes.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1125610.jpg",
    "o": "4517868.jpg,4467344.jpg,3198834.jpg,3158162.jpg,3158056.jpg,3092210.jpg",
    "st": "allrecipes"
}