{
    "id": 236976,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 lasagna noodles",
        "3 cups cooked diced chicken, or more to taste",
        "2 (12 fluid ounce) cans evaporated milk",
        "1 (1 ounce) package ranch dressing mix (such as Hidden ValleyÂ®)",
        "ground black pepper to taste",
        "1 1/2 cups shredded Cheddar cheese",
        "1 1/2 cups shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 458 kcal",
        "Carbs > 29.6 g",
        "Cholesterol > 103 mg",
        "Fat > 22 g",
        "Protein > 34.4 g",
        "Sodium > 642 mg"
    ],
    "n": "Julie's Cheesy Chicken Lasagna",
    "a": "Joan Gerland Crabtree",
    "r": "0",
    "s": 8,
    "des": "\"My sister Julie has made this recipe for years and it has turned into a family favorite. Kids and adults love it and I love that it is easy to prepare and tastes wonderful. It is truly a comfort food. Goes great with a lettuce- and fruit-type salad along with garlic bread.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nBring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain.\nCombine chicken, milk, ranch dressing mix, and black pepper in a skillet; bring to a boil. Reduce heat and simmer until sauce is reduced and thickened, about 20 minutes.\nLayer 4 lasagna noodles in the bottom of the prepared baking dish. Spread 1/2 the sauce over noodles. Sprinkle 1/2 the Cheddar cheese and 1/2 the mozzarella cheese over sauce. Repeat layering with remaining ingredients.\nBake in the preheated oven until bubbling and cheeses are slightly browned, 30 to 40 minutes. Cool for 10 minutes before cutting.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "3841857.jpg",
    "o": "",
    "st": "allrecipes"
}