{
    "id": 236933,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16.25 ounce) package white cake mix (such as Duncan HinesÂ®)",
        "1 cup water",
        "1/4 cup vegetable oil",
        "3 egg whites",
        "1/2 cup frozen sliced strawberries, thawed",
        "1 1/2 cups buttercream icing",
        "1 cup strawberry glaze"
    ],
    "nut": [
        "Calories > 424 kcal",
        "Carbs > 66.6 g",
        "Cholesterol > 0 mg",
        "Fat > 16 g",
        "Protein > 3.2 g",
        "Sodium > 408 mg"
    ],
    "n": "Strawberry Roll Cake",
    "a": "baibairox",
    "r": "0",
    "s": 10,
    "des": "\"This is a great party treat. Fluffy cake, buttercream icing, and strawberries make this especially yummy. Kids love it!  It pairs great with vanilla ice cream. Don't worry about leftovers as there won't be any!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and lightly flour a rimmed 9x13-inch baking sheet.\nBeat cake mix, water, vegetable oil, and egg whites together in a bowl using an electric mixer on low speed until moistened, about 30 seconds. Beat batter on medium speed for 2 minutes. Pour batter into prepared baking sheet.\nBake in the preheated oven until a toothpick inserted into the cake comes out clean, 15 to 20 minutes. Cool cake for at least 30 minutes.\nGently release cake onto a clean towel. Place a second clean towel on top of cake and smooth out any wrinkles in towel. Slowly roll cake around top towel.\nStrain strawberries, reserving juice. Mix strawberry juice and icing together in a bowl until icing turns pink.\nStir strawberries and strawberry glaze together in a separate bowl.\nGently unroll cake and remove top towel. Spread icing onto cake; top icing with strawberry mixture. Carefully roll cake around the filling; slice into rounds.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "1118334.jpg",
    "o": "",
    "st": "allrecipes"
}