{
    "id": 236994,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 bunch green onions - white parts chopped, green parts cut into 3 1/2-inch lengths",
        "10 ounces whole pork belly",
        "salt to taste",
        "1/4 cup packed brown sugar",
        "2 tablespoons rice vinegar",
        "2 tablespoons fish sauce",
        "1 tablespoon ginger juice",
        "1/2 teaspoon soy sauce",
        "4 cloves garlic, sliced",
        "4 whole dried red chile peppers",
        "1/2 cup water"
    ],
    "nut": [
        "Calories > 410 kcal",
        "Carbs > 39.3 g",
        "Cholesterol > 51 mg",
        "Fat > 19.7 g",
        "Protein > 20.6 g",
        "Sodium > 2273 mg"
    ],
    "n": "Chef John's Caramel Pork Belly",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"I wasn't really sure I understood the true essence of unctuousness, but after eating this caramel pork belly I'm pretty sure I get it now. Each bite was pure pleasure. I'm usually a very fast eater, but I tried to eat as slowly as I possibly could. It was just so unctuous.\"",
    "ins": "Preheat oven to 200 degrees F (95 degrees C).\nLay a large sheet of aluminum foil on a flat work surface. Lay 1/2 the green parts of the green onions down in the center of the foil. Place pork belly, fattiest-side down, on top of the green onions and top pork belly with remaining 1/2 the green parts of the green onions; sprinkle with salt. Fold aluminum foil tightly around pork and green onions. Wrap pork belly again in another sheet of aluminum foil. Place wrapped pork, seam-side up, in a loaf pan.\nCook pork belly in preheated oven for 5 1/2 hours. Turn off the oven heat and let cool in the oven for 2 hours. Remove from oven and chill in the refrigerator for 8 hours to overnight.\nRemove pork from foil and discard green onions. Cut pork into 8 pieces.\nCook bacon in a skillet over medium heat until crisp all over, 2 to 4 minutes per side.\nWhisk brown sugar, rice vinegar, fish sauce, ginger juice, and soy sauce together in a bowl.\nRemove most of the fat from the skillet and discard. Add 1 tablespoon of the brown sugar glaze and increase heat to medium-high. Cook until pork is glazed on all sides and pieces are caramelized, about 10 minutes. Make a well in the center of the skillet and add chopped white parts of the green onion, garlic, and peppers. Saute until fragrant, about 1 minute.\nPour water and remaining brown sugar glaze into skillet; simmer until sauce thickens, 3 to 5 minutes.",
    "pt": "30 m",
    "ct": "6 h",
    "tt": "16 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}