{
    "id": 237074,
    "old_rating": "4.18182",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 tablespoon vegetable oil",
        "1 cup petite-cut potato",
        "1 small onion, minced",
        "1/2 pound ground beef",
        "2 1/2 tablespoons curry powder",
        "1 1/2 tablespoons minced garlic",
        "1 tablespoon minced fresh ginger root",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/2 cup chicken stock",
        "1 cup peas",
        "1 (15 ounce) package prepared pie crusts, at room temperature and each cut into quarters",
        "1 egg",
        "1/4 teaspoon ground turmeric",
        "1/4 teaspoon curry powder"
    ],
    "nut": [
        "Calories > 731 kcal",
        "Carbs > 62.3 g",
        "Cholesterol > 82 mg",
        "Fat > 44.8 g",
        "Protein > 20.8 g",
        "Sodium > 1046 mg"
    ],
    "n": "Easy Meat Samosas",
    "a": "skybear",
    "r": "0",
    "s": 4,
    "des": "\"A easy American adaptation of samosas. Baked for less fat and less mess. These are also good with just potatoes; replace meat with 1 extra cup of potatoes.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Prepare a baking sheet with cooking spray.\nHeat oil in a large skillet over medium-high heat. Saute potato and onion in hot oil until onion is translucent, about 5 minutes.\nBreak beef into small pieces and add to the skillet; cook and stir until browned and crumbly, 5 to 7 minutes. Season beef mixture with 2 1/2 tablespoons curry powder, garlic, ginger, salt, and pepper.\nPour chicken stock over the beef mixture; add peas and stir. Bring mixture to a simmer and cook until the stock is nearly evaporated and the potatoes are tender, 4 to 5 minutes.\nMoisten edges of each pie crust triangle with wet fingers. Spoon about 1/3 cup of the beef mixture into the middle of each dough piece. Fold dough over the filling into a triangle; crimp edges together with a fork to seal beef inside the triangle. Arrange samosas onto the prepared baking sheet.\nBeat egg with turmeric and 1/4 teaspoon curry powder in a bowl; brush over the samosas.\nBake samosas in preheated oven until golden brown, about 20 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "2617032.jpg",
    "o": "",
    "st": "allrecipes"
}