{
    "id": 23708,
    "old_rating": "4.07692",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package wide egg noodles",
        "1 (16 ounce) package cottage cheese",
        "1 (8 ounce) package cream cheese",
        "1 pint sour cream",
        "1 teaspoon vanilla extract",
        "1 cup white sugar",
        "6 eggs, beaten",
        "1/2 cup butter, melted",
        "2 cups graham cracker crumbs",
        "1/2 cup butter, melted",
        "1/2 cup white sugar"
    ],
    "nut": [
        "Calories > 386 kcal",
        "Carbs > 37.6 g",
        "Cholesterol > 122 mg",
        "Fat > 22.4 g",
        "Protein > 9.5 g",
        "Sodium > 276 mg"
    ],
    "n": "Noodle Pudding",
    "a": "AGK1",
    "r": "0",
    "s": 20,
    "des": "\"This noodle pudding is a family favorite. The recipe has been passed to many friends. It can also be frozen and it travels well.  Can be baked for 30 minutes, allowed to cool and then be frozen. Cut into serving size pieces before freezing. Defrost after freezing and then bake at 350 degrees for 30 minutes or until hot.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).  Grease a large casserole dish.\nBring a large pot of lightly salted water to a boil. Add egg noodles and cook for 8 to 10 minutes or until al dente; drain.\nBlend together cottage cheese and cream cheese until smooth.  Mix in sour cream, vanilla, sugar and eggs.  When noodles are done stir together 1/2 cup butter and noodles in a large bowl. Combine cheese mixture and noodles; Blend well.  Place all in one large casserole dish.\nTo make the topping: Mix together graham cracker crumbs, butter and sugar until it looks like large crumbs. Sprinkle evenly over top of noodle mixture.\nBake at 350 degrees for 15 minutes. Lower oven to 325 degrees and continue baking for 45 minutes more. Allow to cool before cutting and serve warm.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "21748.jpg",
    "o": "",
    "st": "allrecipes"
}