{
    "id": 237035,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 slices bacon, cut into 1/2-inch pieces",
        "1 tablespoon olive oil",
        "1 clove garlic, minced",
        "1 sweet onion, chopped",
        "2 pounds yellow squash, cut into bite-size pieces",
        "4 pickled artichoke hearts, chopped",
        "2 tablespoons capers with liquid, or more to taste",
        "1/2 teaspoon crushed fresh rosemary leaves",
        "salt to taste",
        "ground white pepper to taste"
    ],
    "nut": [
        "Calories > 129 kcal",
        "Carbs > 13.5 g",
        "Cholesterol > 7 mg",
        "Fat > 6.8 g",
        "Protein > 5.5 g",
        "Sodium > 330 mg"
    ],
    "n": "Savory Summer Squash with Bacon",
    "a": "Katrinika",
    "r": "0",
    "s": 4,
    "des": "\"I love squash but wanted a new recipe with fewer calories. I did a search on flavorful ingredients and came up with a bunch of pasta recipes. So I thought, why not substitute yellow squash for pasta? And it worked! All the ingredients can be prepared in advance and refrigerated until ready to cook. Long, slender young squash make for the best texture.\"",
    "ins": "Place 2 paper towels on a microwave-safe plate; add bacon and top with another paper towel. Cook in microwave on high until some grease is absorbed, about 30 seconds.\nTransfer bacon to a deep skillet and cook over medium-high heat, stirring often, until crisp, 5 to 10 minutes. Lower heat to medium; stir garlic into bacon and cook until fragrant, about 30 seconds. Add onion; cook and stir until onion is slightly translucent and still firm, about 5 minutes.\nMix squash into onion-bacon mixture; cook and stir until squash is slightly softened, about 5 minutes. Add artichoke hearts; cook until heated through, 2 to 3 minutes. Add capers and rosemary; cover skillet and cook, stirring often, until squash is softened but firm to the bite, about 5 more minutes. Season with salt and white pepper.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "1124643.jpg",
    "o": "",
    "st": "allrecipes"
}