{
    "id": 237067,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons salted butter",
        "1 large sweet onion, chopped",
        "2 cloves garlic, minced",
        "1 teaspoon salt, divided",
        "1/2 teaspoon ground black pepper, divided",
        "1 1/2 cups chopped carrots",
        "4 cups chopped yellow potatoes",
        "1 cup whole milk",
        "1 cup half-and-half",
        "1 tablespoon ground coriander",
        "1 tablespoon ground cumin",
        "2 teaspoons curry powder",
        "2 teaspoons garam masala",
        "1 teaspoon ground ginger",
        "1 1/2 cups frozen peas",
        "1 sheet frozen puff pastry"
    ],
    "nut": [
        "Calories > 374 kcal",
        "Carbs > 40.1 g",
        "Cholesterol > 26 mg",
        "Fat > 21 g",
        "Protein > 8.1 g",
        "Sodium > 479 mg"
    ],
    "n": "Samosa Pot Pie",
    "a": "rsstone",
    "r": "0",
    "s": 8,
    "des": "\"This easy vegetarian recipe offers a fresh take on traditional pot pie. To serve, use a large spoon to cut sections of the pastry and scoop with filling into shallow bowls. If desired, serve chutney, yogurt, and chopped cucumbers on the side.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nMelt butter in a large stockpot over medium heat. Cook and stir sweet onion, garlic, 1/2 teaspoon salt, and 1/4 teaspoon black pepper in hot butter until onion is translucent, about 10 minutes.\nStir carrots into the onion mixture; continue cooking and stirring until the carrot is slightly softened, about 5 minutes more. Add potatoes; stir.\nMix milk, half-and-half, 1/2 teaspoon salt, 1/4 teaspoon pepper, coriander, cumin, curry powder, garam masala, and ginger together in a bowl until the spices are dissolved into the liquid; pour over the vegetable mixture in the pot. Bring the mixture to a boil. Stir peas into the boiling mixture; cook until peas are warmed, 2 to 3 minutes. Pour contents of pot into a 13x9-inch baking dish.\nCut frozen puff pasty lengthwise into 3 even pieces; arrange atop the vegetable mixture.\nBake in preheated oven until the pastry is puffed and golden brown and the vegetables are tender, about 40 minutes.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}