{
    "id": 237027,
    "old_rating": "4.48148",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 potatoes, peeled and cubed",
        "1/4 cup oil",
        "2 small onions, finely chopped",
        "3 tablespoons coriander seed",
        "1 tablespoon curry powder",
        "1 (1 inch) piece fresh ginger, grated",
        "1 teaspoon salt",
        "1 teaspoon ground turmeric",
        "1 teaspoon ground cumin",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon cayenne pepper",
        "1/8 teaspoon ground cinnamon",
        "2 roma (plum) tomatoes, finely chopped",
        "1/2 cup frozen peas",
        "4 prepared pie crusts",
        "2 egg whites, beaten, or as needed"
    ],
    "nut": [
        "Calories > 315 kcal",
        "Carbs > 32.7 g",
        "Cholesterol > 0 mg",
        "Fat > 18.7 g",
        "Protein > 4.9 g",
        "Sodium > 396 mg"
    ],
    "n": "Easy Baked Indian Samosas",
    "a": "pho1962",
    "r": "0",
    "s": 16,
    "des": "\"This has all the flavor and heartiness of a great samosa without the frying. Although this is an easier, healthier version of the fried samosa, it tastes very authentic. This recipe has the added advantage that you can make ahead and freeze uncooked samosas, simply skip the egg brushing, freeze until you're ready and cook at 350 degrees F (175 degrees C) for 25 to 30 minutes. Serve warm, plain, or with chutney.\"",
    "ins": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and transfer potatoes to a bowl; coarsely mash.\nPreheat oven to 400 degrees F (200 degrees C).\nHeat oil in a skillet over medium-high heat; cook and stir onions, coriander seed, curry powder, ginger, salt, turmeric, cumin, allspice, cayenne pepper, and cinnamon until onion is lightly browned, about 5 minutes. Remove skillet from heat and stir tomatoes and peas into onion mixture; pour into mashed potatoes and thoroughly mix. Cool completely.\nCut each pie crust into 8 even triangles. Spoon filling onto the wide end of each triangle; fold corners over filling creating a triangular 'hat' shape. Pinch the dough together to form a seal. Brush egg white over each samosa and arrange on a baking sheet.\nBake in the preheated oven until samosas are golden brown, about 15 minutes.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "3449161.jpg",
    "o": "",
    "st": "allrecipes"
}