{
    "id": 237071,
    "old_rating": "2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons vegetable oil",
        "2 cups diced sweet potato",
        "1 1/2 cups diced eggplant",
        "1 small onion, diced small",
        "2 tablespoons curry powder",
        "1 tablespoon ground cumin",
        "1 tablespoon garam masala (optional)",
        "3 cups vegetable broth, or more if needed",
        "1/4 cup all-purpose flour, or as needed",
        "2 sheets prepared pie crust"
    ],
    "nut": [
        "Calories > 366 kcal",
        "Carbs > 37.4 g",
        "Cholesterol > 0 mg",
        "Fat > 22.3 g",
        "Protein > 5 g",
        "Sodium > 451 mg"
    ],
    "n": "Baked Sweet Potato Vegetable Samosas",
    "a": "cburg",
    "r": "0",
    "s": 8,
    "des": "\"Samosas are a delicious Indian treat. A crisp outside pastry with a savory filling that is either vegetarian, chicken, or lamb. This recipe is a spin on the classic samosa, using sweet potatoes instead of plain, and using pre-made pie crust so they can be baked in the oven instead of deep-fried. Chicken stock can be used for vegetable stock if you're not concerned about keeping them vegetarian-friendly.\"",
    "ins": "Heat vegetable oil in a large, heavy-bottomed pot over medium-high heat. Saute sweet potato, eggplant, and onion in hot oil until the onion is softened, 7 to 10 minutes; season with curry powder, cumin, and garam masala.\nPour stock into the pot. Bring liquid to a simmer, reduce heat to medium-low, and cook until vegetables are completely tender, adding more broth as needed to keep mixture moist, 10 to 15 minutes. Remove pot from heat and set aside to let mixture cool completely.\nPreheat oven to 350 degrees F (175 degrees C).\nLie each pie crust onto a lightly-floured surface. Cut each crust into 8 wedges. Spoon 2 tablespoons of the vegetable mixture into the middle of each triangle.\nBring two corners of each triangle together, pressing the dough along the edges to seal. Bring up the last corner and seal the last edge. Arrange samosas onto a baking sheet.\nBake in preheated oven until golden brown, about 45 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}