{
    "id": 237060,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 portobello mushroom caps, cubed",
        "2 tablespoons all-purpose flour",
        "1 tablespoon olive oil",
        "2 potatoes, cubed",
        "2 carrots, sliced",
        "1 onion, sliced",
        "3 cloves garlic, minced",
        "4 sprigs fresh rosemary",
        "20 fluid ounces stout beer",
        "1 1/2 cups vegetable broth",
        "1/2 (6 ounce) can tomato paste",
        "2 teaspoons Worcestershire sauce",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1 1/2 teaspoons cold water",
        "1 1/2 teaspoons cornstarch",
        "4 slices French bread",
        "1/2 cup shredded Swiss cheese"
    ],
    "nut": [
        "Calories > 399 kcal",
        "Carbs > 60.4 g",
        "Cholesterol > 12 mg",
        "Fat > 8.4 g",
        "Protein > 13.8 g",
        "Sodium > 1195 mg"
    ],
    "n": "Vegetarian Stout French Onion Soup",
    "a": "Matthieu Duquette",
    "r": "0",
    "s": 4,
    "des": "\"I love Irish stout stew and French onion soup. Plus my wife is a vegetarian. So I came up with this infusion that is, in my opinion, amazing! Portobello mushrooms replace cubed beef, and it is all topped off with a Swiss cheese-crusted slice of artisan bread, French onion-soup style. Serve with a frosty stout and enjoy! Happy St. Patrick's Day!\"",
    "ins": "Toss mushrooms and flour together in a bowl until coated.\nHeat olive oil in a large skillet over medium heat; cook and stir coated mushrooms until browned, 5 to 10 minutes.\nCombine potatoes, carrots, onion, garlic, and rosemary in a large stockpot; top with cooked mushrooms. Stir beer, vegetable broth, tomato paste, Worcestershire sauce, salt, and pepper into vegetable mixture. Cover stockpot and cook over medium-high heat until vegetables are tender and soup flavors have blended, about 1 hour.\nWhisk water and cornstarch together in a bowl until dissolved; stir into soup until thickened, about 3 minutes.\nSet oven rack about 5 inches from the heat source and preheat the oven's broiler.\nArrange bread slices on a baking sheet and sprinkle Swiss cheese over each slice.\nBroil bread in the preheated oven until cheese is melted and golden, about 1 minute.\nLadle soup into bowls using a slotted ladle; top each with a bread slice. Ladle broth over bread until saturated.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1120533.jpg",
    "o": "",
    "st": "allrecipes"
}