{
    "id": 237066,
    "old_rating": "4.92308",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup milk",
        "1/4 cup butter",
        "1/4 cup white sugar",
        "1 teaspoon salt",
        "4 1/2 teaspoons active dry yeast",
        "1 teaspoon white sugar",
        "1/2 cup warm water (110 degrees F/45 degrees C)",
        "3 1/2 cups bread flour, divided, or as needed",
        "1 egg, lightly beaten",
        "1 tablespoon all-purpose flour, or more as needed, for dusting"
    ],
    "nut": [
        "Calories > 144 kcal",
        "Carbs > 23.5 g",
        "Cholesterol > 17 mg",
        "Fat > 3.5 g",
        "Protein > 4.3 g",
        "Sodium > 156 mg"
    ],
    "n": "Grandma Rita's Soft Butter Rolls",
    "a": "Lela",
    "r": "0",
    "s": 18,
    "des": "\"Want a roll that stays soft for days? Try these fluffy, soft rolls made with butter and love. This is my Grandma's recipe. The rolls are quick to rise due to the two packages of yeast. A special thanks to Baking Nana for writing the directions that are clear and easy to follow.\"",
    "ins": "Pour milk into a glass 2-cup measuring cup and heat in the microwave until it starts to boil and climb the sides, about 1 minute. Add butter, 1/4 cup sugar, and salt to the scalded milk; set aside to cool until it gets below 110 degrees F (45 degrees C).\nDissolve yeast and 1 teaspoon sugar in warm water in a large bowl. Let stand until the yeast softens and begins to form a creamy foam, about 10 minutes.\nPour milk mixture into the yeast mixture; add 2 cups bread flour and egg. Stir the mixture with a wooden spoon until smooth. Add remaining flour, 1/2 cup at a time, mixing thoroughly after each addition, until the dough is smooth and a little tacky.\nTurn dough out onto a sheet of flour-dusted waxed paper and lightly knead to pull dough together; shape into a ball. Place dough in a large, lightly-oiled bowl, and turn to coat. Cover with a towel and let rise in a warm place for about 30 minutes.\nLine a baking sheet with parchment paper. Divide dough into thirds. Break each third into six evenly sized balls and arrange onto prepared baking sheet. Cover balls with a towel to rise further for another 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven until browned, about 15 minutes.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "4484011.jpg",
    "o": "4316043.jpg,4315543.jpg,4132178.jpg,3341702.jpg,3309882.jpg,2053058.jpg",
    "st": "allrecipes"
}