{
    "id": 237012,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 MissionÂ® Small/Fajita Super Soft Flour Tortillas, cut into 4 equal pieces",
        "12 jumbo shrimp, peeled, deveined, tails intact",
        "3 tablespoons Sriracha hot sauce",
        "1 tablespoon soy sauce",
        "1 teaspoon toasted sesame oil",
        "2 tablespoons lime juice",
        "1 tablespoon honey",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "2 cups vegetable oil for frying",
        "Toothpicks as needed"
    ],
    "nut": [
        "Calories > 414 kcal",
        "Carbs > 19.2 g",
        "Cholesterol > 227 mg",
        "Fat > 22.1 g",
        "Protein > 27.6 g",
        "Sodium > 1601 mg"
    ],
    "n": "Firecracker Shrimp Taquitos",
    "a": "Mission Foods",
    "r": "0",
    "s": 4,
    "des": "\"Spicy jumbo shrimp are wrapped in a tortilla triangle with a tail 'handle,' then deep fried for these delicious appetizer bites.\"",
    "ins": "In a mixing bowl, combine sriracha, soy sauce, sesame oil, lime juice, honey, salt and pepper.  Whisk well to combine. Add shrimp to bowl and toss to combine. Cover and refrigerate for at least 30 minutes.\nLay the tortilla triangles onto a work surface.  Place a shrimp on top of each with the tail extended from the tip of the triangle.  Roll up tightly.  The tail will stick out from the tortilla.  Secure with a toothpick.  Store in the refrigerator until ready to fry.\nHeat the oil in a medium size saucepan over high heat. When the temperature reads 350 degrees F on a thermometer it is ready to use. Maintain the temperature by adjusting the heat up or down when necessary.\nUsing tongs and working in small batches, carefully place the shrimp in the hot oil.  Fry until tortilla is a deep golden brown and the tail of the shrimp curls, about 2 minutes.  Remove the toothpick from each and serve with peanut sauce or Thai chili sauce.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "1111623.jpg",
    "o": "",
    "st": "allrecipes"
}