{
    "id": 237041,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "1/2 onion, minced",
        "3 large cloves garlic, minced",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1 (8 ounce) package fresh sugar snap peas",
        "5 slices American cheese, or more to taste",
        "1 1/2 cups frozen diced southern-style hash brown potatoes, or more to taste"
    ],
    "nut": [
        "Calories > 501 kcal",
        "Carbs > 21.1 g",
        "Cholesterol > 101 mg",
        "Fat > 32.2 g",
        "Protein > 31.5 g",
        "Sodium > 1075 mg"
    ],
    "n": "Marianne's Hot Dish",
    "a": "GENTLEWOMAN",
    "r": "0",
    "s": 4,
    "des": "\"This is a twist on Tater TotÂ® hot dish. This is an easy recipe to personalize. You can use any ground meat or a mixture of beef and pork. I often use smoked Gouda cheese, Havarti cheese, and I bet Swiss cheese would be good, too. The vegetable can be easily switched to any vegetable you like (string beans, broccoli, or mixed veggies). I would use fresh or frozen rather than canned if you can.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat a large skillet over medium-high heat. Cook and stir beef, onion, and garlic in the hot skillet until browned and crumbly, 5 to 7 minutes. Transfer ground beef mixture, using a slotted spoon, to a 2-quart casserole dish; retain drippings in the skillet.\nSpread cream of mushroom soup over ground beef mixture.\nCook and stir mushrooms in the beef drippings over medium heat until tender and browned, 5 to 10 minutes; spread over soup layer in casserole dish.\nArrange snap peas over mushroom layer; cover with American cheese slices. Layer potatoes over cheese.\nBake in the preheated oven until cheese is melted and potatoes are browned and crisp, about 1 hour.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "3769023.jpg",
    "o": "",
    "st": "allrecipes"
}