{
    "id": 237061,
    "old_rating": "4.70588",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Dressing:",
        "2 tablespoons rice vinegar",
        "1 tablespoon Dijon mustard",
        "3 tablespoons olive oil, or more to taste",
        "24 large asparagus spears",
        "salt and ground black pepper to taste",
        "1 pinch cayenne pepper",
        "1 teaspoon vegetable oil, or as needed",
        "4 ounces pastrami, sliced into thin strips"
    ],
    "nut": [
        "Calories > 169 kcal",
        "Carbs > 5.6 g",
        "Cholesterol > 19 mg",
        "Fat > 13 g",
        "Protein > 8.8 g",
        "Sodium > 383 mg"
    ],
    "n": "Chef John's Shaved Asparagus Salad",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"When you shave asparagus thin with a peeler and give it a quick curing/pickling in the mustard dressing, the harsh attributes mellow out substantially, and the sweet, grassy flavor comes through. In fact, it was so delicious that I contemplated serving it without the fried meat. Happily, that passed.\"",
    "ins": "Whisk vinegar and mustard together in a mixing bowl. Slowly drizzle in olive oil while whisking rapidly until the dressing is thick and creamy.\nHold an asparagus stalk at the stem, tip pointing away from you, on a work surface. Shave ribbons of asparagus off of the stalk with a vegetable peeler, moving the peeler from the stem-end to the tip. Repeat with remaining asparagus. Transfer asparagus strips to a bowl.\nSprinkle salt, black pepper, and cayenne pepper over asparagus; drizzle dressing over the top and toss to coat. Let sit until asparagus wilts slightly, 2 to 4 minutes.\nHeat vegetable oil in a skillet over medium-high heat. Cook and stir pastrami in hot oil until almost crisp, 2 to 3 minutes.\nDivide asparagus salad between four plates and top with pastrami.",
    "pt": "15 m",
    "ct": "5 m",
    "tt": "20 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}