{
    "id": 237134,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Rosemary Crust:",
        "1 3/4 cups all-purpose flour",
        "1 teaspoon roughly chopped fresh rosemary",
        "salt and ground black pepper to taste",
        "10 tablespoons cold butter, cut into cubes",
        "1/3 cup ice water",
        "Sweet Potato-Parmesan Filling:",
        "2 pounds sweet potatoes",
        "1/2 cup milk",
        "1/2 teaspoon olive oil, or to taste",
        "1/2 cup butter, softened",
        "2 eggs",
        "1/4 cup grated Parmesan cheese",
        "2 cloves garlic, minced",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 373 kcal",
        "Carbs > 35.9 g",
        "Cholesterol > 95 mg",
        "Fat > 23 g",
        "Protein > 6.4 g",
        "Sodium > 247 mg"
    ],
    "n": "Savory Sweet Potato Pie",
    "a": "Madison Meehan",
    "r": "0",
    "s": 10,
    "des": "\"Was inspired by my rosemary roasted sweet potatoes to make this; works great as a pie! Super delicious and easy to make. Even people in my family who don't like sweet potatoes loved it! Simple as one whole pie or bake in mini cupcake pans for easy appetizers or individual portioned side dish.\"",
    "ins": "Pulse flour, rosemary, salt, and pepper together in a food processor until evenly mixed; add cold butter and pulse until mixture resembles coarse crumbs. Drizzle cold water into mixture and pulse until dough comes together. Transfer dough to a bowl and refrigerate, 1 hour to 2 days.\nPlace sweet potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 50 minutes. Drain and run cold water over sweet potatoes; carefully remove peels.\nStir milk and olive oil together in a bowl.\nBeat sweet potato and softened butter together in a bowl using an electric mixer until smooth. Stir milk-olive oil mixture, eggs, Parmesan cheese, and garlic into sweet potato mixture until smooth; season with salt and pepper.\nPreheat oven to 350 degrees F (175 degrees C).\nRoll dough on a floured surface using a rolling pin. Roll dough around rolling pin and press in a pie dish, trimming edges. Pour sweet potato filling into crust.\nBake in the preheated oven until a knife inserted in the middle of the filling comes out clean, 55 to 60 minutes. Cool pie about 5 minutes before serving.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "3 h ",
    "i": "3166597.jpg",
    "o": "",
    "st": "allrecipes"
}