{
    "id": 237162,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 pounds skinless, boneless chicken thighs, trimmed",
        "2 cups water",
        "2 cups low-sodium soy sauce",
        "1 (13.5 ounce) can coconut milk",
        "1 1/2 cups brown sugar",
        "1 bunch green onions, chopped",
        "1/4 cup white onion, chopped",
        "1 teaspoon sesame oil",
        "1/2 teaspoon minced garlic"
    ],
    "nut": [
        "Calories > 530 kcal",
        "Carbs > 36 g",
        "Cholesterol > 106 mg",
        "Fat > 28.6 g",
        "Protein > 33.4 g",
        "Sodium > 2241 mg"
    ],
    "n": "Grilled Hawaiian Chicken",
    "a": "AmyLiz",
    "r": "0",
    "s": 8,
    "des": "\"This is a family favorite! Every time I serve this chicken, I get rave reviews! I serve this over coconut rice garnished with green onions. It makes a beautiful presentation. To make coconut rice, simply replace half of the water with coconut milk and cook rice as directed. This recipe makes a lot of marinade. If I am serving more people I will increase the amount of chicken and keep the recipe for the marinade the same. Goes really well with steamed broccoli or edamame.\"",
    "ins": "Whisk water, soy sauce, coconut milk, brown sugar, green onions, white onion, sesame oil, and garlic together in a large glass or ceramic bowl. Add chicken thighs and toss to evenly coat. Cover the bowl with plastic wrap and marinate in the refrigerator, 4 hours to overnight.\nPreheat grill for medium heat and lightly oil the grate.\nRemove chicken from marinade and discard the marinade.\nCook chicken on the preheated grill until no longer pink in the center and the juices run clear, 5 to 7 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "4 h ",
    "i": "4524614.jpg",
    "o": "",
    "st": "allrecipes"
}