{
    "id": 237176,
    "old_rating": "4.54545",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 6x9-inch sheet frozen puff pastry, thawed",
        "6 spears fresh asparagus, trimmed",
        "1 tablespoon Dijon mustard",
        "1 1/2 teaspoons creme fraiche",
        "1 pinch ground black pepper",
        "1 pinch cayenne pepper",
        "2 teaspoons butter, melted",
        "2 tablespoons freshly grated Parmigiano-Reggiano cheese, or to taste"
    ],
    "nut": [
        "Calories > 795 kcal",
        "Carbs > 58.8 g",
        "Cholesterol > 40 mg",
        "Fat > 56.6 g",
        "Protein > 14.6 g",
        "Sodium > 869 mg"
    ],
    "n": "Chef John's Asparagus Tart",
    "a": "Chef John",
    "r": "0",
    "s": 1,
    "des": "\"As long as you're pretty good at making rectangles, and trimming things to the right length, this recipe is a breeze. By the way, I'll give the specific ingredient amounts I used here, but this really depends on how much asparagus you have, and how long you want your tart to be.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with a silicone baking mat.\nLay puff pastry out on the prepared baking sheet. Fold edges up to create a 1/2-inch wide border. Prick inside base of dough completely with a fork.\nBake in the preheated oven until golden and puffed, about 10 minutes. Press puffed center down with the back of a fork to deflate.\nBring a large pot of lightly salted water to a boil. Add asparagus and cook uncovered until bright green, about 1 minute. Drain in a colander and immediately immerse in ice water for several minutes until cold to stop the cooking process. Drain.\nStir mustard, creme fraiche, black pepper, and cayenne pepper together in a small bowl; spread into the bottom of the cooled tart shell. Lay asparagus spears, trimming as necessary to fit the tart shell, in the center of the tart on top of the mustard spread. Brush melted butter over the asparagus and crust and sprinkle Parmigiano-Reggiano cheese over the top.\nBake in the oven until pastry is browned and asparagus is tender, 10 to 12 minutes.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}