{
    "id": 237121,
    "old_rating": "4.74684",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large spaghetti squash, halved lengthwise and seeded",
        "1 pound ground turkey sausage",
        "1/2 cup diced onion",
        "1 cup pizza sauce",
        "1 cup coarsely chopped baby spinach leaves",
        "1/2 cup diced red bell pepper",
        "1/4 cup unsweetened applesauce",
        "1 teaspoon dried basil",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon dried oregano",
        "1/4 teaspoon ground black pepper",
        "3 eggs, beaten"
    ],
    "nut": [
        "Calories > 295 kcal",
        "Carbs > 29.8 g",
        "Cholesterol > 152 mg",
        "Fat > 13 g",
        "Protein > 19.2 g",
        "Sodium > 775 mg"
    ],
    "n": "Paleo Spaghetti Pie (Grain, Gluten, and Dairy Free)",
    "a": "Shannon Felgner",
    "r": "0",
    "s": 6,
    "des": "\"This paleo recipe is so good even your non-paleo friends will love it! My picky husband and young children enjoyed this 'spaghetti pie' and even came back for seconds. Plus, there are no pricey, exotic ingredients. I had nearly everything on hand.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Place spaghetti squash, cut-side down, on a baking sheet.\nBake squash in the preheated oven until cooked through, about 25 minutes. When cool enough to handle, scoop out the strands of squash with a spoon and place in an 8-inch square baking dish.\nReduce oven temperature to 350 degrees F (175 degrees C).\nCook and stir turkey sausage and onion in a large skillet over medium-high heat until turkey is browned, 4 to 6 minutes. Remove from heat and stir pizza sauce, spinach, red bell pepper, applesauce, basil, garlic powder, oregano, and black pepper into turkey mixture. Spread mixture over squash in baking dish.\nPour eggs over turkey mixture and toss egg, turkey mixture, and squash together until egg is just combined.\nBake in the preheated oven until mixture is bubbling and eggs are set, about 1 hour.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4479065.jpg",
    "o": "4479065.jpg,4045515.jpg,3986110.jpg,3973496.jpg,3442758.jpg,3219817.jpg",
    "st": "allrecipes"
}