{
    "id": 237167,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds beef short ribs, or more to taste",
        "2 tablespoons salt",
        "2 teaspoons garlic powder",
        "2 teaspoons ground black pepper",
        "1/2 cup all-purpose flour",
        "2 tablespoons vegetable oil",
        "4 cloves garlic cloves, minced and divided",
        "3 cups beef broth",
        "1 cup Cabernet Sauvignon wine",
        "1 onion, sliced"
    ],
    "nut": [
        "Calories > 337 kcal",
        "Carbs > 14.3 g",
        "Cholesterol > 61 mg",
        "Fat > 17 g",
        "Protein > 23.6 g",
        "Sodium > 2762 mg"
    ],
    "n": "Braised Cabernet Beef Short Ribs",
    "a": "Jennifer G.",
    "r": "0",
    "s": 6,
    "des": "\"This recipe uses boneless beef short ribs and, after browning, can be made either in a covered dish in the oven or in your slow cooker. The short ribs turn out extremely tender and flavorful. I normally serve this dish over white rice.\"",
    "ins": "Season ribs with salt, garlic powder, and black pepper. Sprinkle flour over both sides of the ribs.\nHeat oil in a large pot over medium-high heat. Cook about half the garlic in the hot oil until golden brown, 2 to 3 minutes; add short ribs and cook until completely browned, 2 to 3 minutes per side.\nPour beef broth and wine into the pot; bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Transfer ribs and liquid to the crock of your slow cooker; put remaining garlic and sliced onion atop the ribs.\nCook on Low for 5 hours. Remove ribs to a wide and shallow serving bowl. Ladle liquid from crock into a large skillet.\nBring the liquid in a skillet to a boil and cook until reduced in volume by half, 5 to 7 minutes. Pour sauce over the ribs and turn ribs to coat.",
    "pt": "10 m",
    "ct": "5 h ",
    "tt": "5 h ",
    "i": "4441151.jpg",
    "o": "",
    "st": "allrecipes"
}