{
    "id": 237127,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 tablespoons butter",
        "2 green onions, chopped",
        "3 cloves garlic, minced, or more to taste",
        "1 1/2 teaspoons chopped fresh thyme",
        "5 tablespoons all-purpose flour",
        "1 1/4 teaspoons salt",
        "1/2 teaspoon ground black pepper",
        "2 cups milk",
        "1 cup heavy whipping cream",
        "1 (8 ounce) container sour cream",
        "1 cup shredded fontina cheese",
        "2 pounds red potatoes, thinly sliced, ends discarded",
        "1/4 cup Italian-style panko bread crumbs, or as needed"
    ],
    "nut": [
        "Calories > 426 kcal",
        "Carbs > 29.9 g",
        "Cholesterol > 93 mg",
        "Fat > 30.4 g",
        "Protein > 10.1 g",
        "Sodium > 635 mg"
    ],
    "n": "Tuscan Cheese Potato Bake",
    "a": "NancyW",
    "r": "0",
    "s": 8,
    "des": "\"Tasty combination of potatoes, cheese, and cream sauce with a crispy topping. You may add more cheese as a topping under the panko crumbs if desired. For a lighter version, use milk to replace the heavy cream and light sour cream instead of regular. You may also use Cheddar, Parmesan, or low-fat cheese.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 3-quart baking dish.\nMelt butter in a large saucepan over medium-high heat. Saute onion, garlic, and thyme in hot butter until onion is tender, 3 to 5 minutes. Whisk flour, salt, and black pepper into onion mixture.\nGradually whisk milk and cream into onion mixture; bring to a boil, reduce heat to low, and simmer until sauce thickens, about 2 minutes.\nStir sour cream into sauce until smooth; add fontina cheese and stir until cheese melts.\nArrange 1/2 the potatoes in the bottom of the prepared baking dish. Pour 1/2 the cheese sauce over the potatoes. Repeat with remaining potatoes and cheese sauce. Top with bread crumbs to cover potatoes entirely.\nBake in the preheated oven until potatoes are tender and bread crumbs are golden brown, 60 to 70 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1542029.jpg",
    "o": "",
    "st": "allrecipes"
}