{
    "id": 237187,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 pound ground beef",
        "1 small onion, diced",
        "1 quart beef broth",
        "1 (24 ounce) jar marinara sauce",
        "1/2 cup diced pepperoni",
        "1/2 cup grated Parmesan cheese",
        "1 1/2 tablespoons granulated garlic",
        "1 1/2 tablespoons dried minced onion",
        "1 1/2 tablespoons dried oregano",
        "4 ounces dried cheese ravioli",
        "1/2 cup shredded mozzarella cheese, or to taste"
    ],
    "nut": [
        "Calories > 294 kcal",
        "Carbs > 19.6 g",
        "Cholesterol > 48 mg",
        "Fat > 16.6 g",
        "Protein > 16.3 g",
        "Sodium > 1127 mg"
    ],
    "n": "Ben's Pizza Soup",
    "a": "Angie Rubeck Ward",
    "r": "0",
    "s": 8,
    "des": "\"This recipe is inspired by my son. When he had his wisdom teeth taken out he desperately wanted pizza and I refused to put some in the blender. I searched and combined a few other recipes to come up with this. I think it would be good with green pepper and mushrooms but my family is picky!\"",
    "ins": "Heat a large skillet over medium-high heat. Cook and stir beef and onion in the hot skillet until beef is browned and crumbly, 5 to 7 minutes; drain and discard grease.\nStir beef-onion mixture, beef broth, marinara sauce, pepperoni, Parmesan cheese, garlic, minced onion, and oregano together in a large pot; bring to a boil, reduce heat to low, and simmer until flavors blend, about 20 minutes.\nWhile soup is simmering, bring a pot of lightly salted water to a boil. Cook the ravioli at a boil, stirring occasionally, until cooked through yet firm to the bite, about 14 minutes; drain.\nStir ravioli into soup and cook until heated through, 3 to 5 minutes. Ladle soup into bowls and top with mozzarella cheese.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "1922390.jpg",
    "o": "",
    "st": "allrecipes"
}