{
    "id": 237277,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (32 fluid ounce) containers vegetable broth",
        "32 fluid ounces water",
        "2 egg whites",
        "1 1/2 cups miso paste",
        "2 tablespoons ginger paste",
        "1 tablespoon sesame oil",
        "2 cups edamame (green soybeans)",
        "2 cups shiitake mushrooms, thinly sliced",
        "2/3 cup chopped spring onions",
        "1 clove garlic, minced",
        "1 teaspoon soy sauce",
        "1 1/2 cups cubed firm tofu",
        "1 teaspoon cayenne pepper",
        "2/3 cup crumbled dried nori (seaweed)",
        "2 tablespoons white sugar"
    ],
    "nut": [
        "Calories > 329 kcal",
        "Carbs > 36.1 g",
        "Cholesterol > 0 mg",
        "Fat > 12.2 g",
        "Protein > 22 g",
        "Sodium > 2465 mg"
    ],
    "n": "Vegetarian Nori Miso",
    "a": "Retroantix",
    "r": "0",
    "s": 8,
    "des": "\"I began trying to make a clear soup recipe, which quickly grew out of control to incorporate elements of miso, egg drop soup, and seaweed. I serve it as a main dish with a side of brown basmati rice.\"",
    "ins": "Combine vegetable broth and water in a large pot; bring to a boil. Drop egg whites into the boiling broth and boil until egg whites are cooked, about 10 seconds. Skim egg whites from surface of broth using a slotted spoon and transfer to a plate to cool.\nReduce heat to medium. Mix miso paste, ginger paste, and sesame oil into broth using a potato masher or ladle until fully incorporated. Add edamame, mushrooms, spring onion, garlic, and soy sauce to miso broth; cover pot with a lid, reduce heat to medium-low, and cook until mushrooms are no longer floating on the surface, about 10 minutes.\nMix tofu and cayenne pepper into miso broth. Tear cooled egg whites into small pieces and add to miso broth. Stir nori and sugar into miso broth; cover pot and simmer, stirring occasionally, until soup flavors have blended, about 1 hour.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1126179.jpg",
    "o": "",
    "st": "allrecipes"
}