{
    "id": 237216,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "water to cover",
        "1 cup dried lentils",
        "1/2 cup wheat germ",
        "1 small onion, finely diced",
        "1/2 cup finely chopped green bell pepper",
        "1/4 cup shredded mozzarella cheese",
        "1 egg, beaten",
        "1 tablespoon finely chopped green chile pepper",
        "1 clove garlic, minced",
        "salt and ground black pepper to taste",
        "1/4 cup vegetable oil, divided"
    ],
    "nut": [
        "Calories > 195 kcal",
        "Carbs > 19.8 g",
        "Cholesterol > 26 mg",
        "Fat > 9 g",
        "Protein > 9.7 g",
        "Sodium > 35 mg"
    ],
    "n": "'Meat's Too Expensive!' Vegetarian Burgers",
    "a": "MMEIST99",
    "r": "0",
    "s": 8,
    "des": "\"Veggie burgers with a kick! My husband and I are not vegetarians at all, but we're trying to cut down on the amount of chicken and meat we eat because it's so expensive. Lentils do the job here: super cheap, super easy, super tasty! Serve on big buns with tomato slices, onion, ketchup, and avocado instead of mayo!\"",
    "ins": "Pour enough water into a pot that will cover lentils and wheat germ; bring to a boil. Add lentils and wheat germ, reduce heat, and simmer until lentils are tender, adding more water if needed, 20 to 25 minutes. Remove pot from heat and cool slightly; mash lentil mixture until thick and lumpy.\nTransfer mashed lentil mixture to a bowl. Mix onion, green bell pepper, mozzarella cheese, egg, green chile pepper, garlic, salt, and pepper into lentil mixture until thoroughly mixed; shape into 8 patties.\nHeat about 2 tablespoons vegetable oil in a large skillet over high heat. Lower heat to medium-high and cook 4 patties in the hot oil until golden brown, about 3 minutes per side. Repeat with remaining oil and patties.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "1126074.jpg",
    "o": "",
    "st": "allrecipes"
}