{
    "id": 237209,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 green chile peppers",
        "Pico de Gallo:",
        "1 green bell pepper, halved, divided",
        "2 small tomatoes, diced",
        "1 small onion, divided",
        "3 fresh jalapeno peppers, diced",
        "2 tablespoons chopped fresh cilantro",
        "2 tablespoons tomato juice",
        "1 lime, juiced",
        "1 clove garlic, minced",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon garlic salt",
        "Filling:",
        "3 tablespoons extra-light olive oil, divided",
        "2 cooked skinless, boneless chicken breast halves, diced",
        "7 mushrooms, sliced",
        "1 tablespoon chili powder",
        "1/2 teaspoon dried oregano",
        "1 pinch garlic salt",
        "1 pinch ground black pepper",
        "1/3 cup red enchilada sauce, or more to taste",
        "Quesadilla:",
        "1/2 cup shredded pepperjack cheese",
        "1/2 cup shredded Cheddar cheese",
        "4 (10 inch) flour tortillas"
    ],
    "nut": [
        "Calories > 706 kcal",
        "Carbs > 52 g",
        "Cholesterol > 115 mg",
        "Fat > 35.4 g",
        "Protein > 46.6 g",
        "Sodium > 1301 mg"
    ],
    "n": "Quesadillas de los Bajos",
    "a": "Kermit Short",
    "r": "0",
    "s": 4,
    "des": "\"A warm, pleasing Tex-Mex dish that's great as a meal with Spanish rice and beans or as a fun snack. This is a really easy recipe and comes together very quickly once you've got all the slicing and dicing done. Serve with sour cream.\"",
    "ins": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Arrange green chile peppers on a baking sheet.\nRoast peppers in the preheated oven, turning 1 or 2 times, until skins are charred and blackened, 5 to 10 minutes. Transfer chile peppers to a resealable plastic bag and seal; set aside until steam starts to peel away skins, about 10 minutes. Carefully open bag and peel skins from peppers. Dice peppers.\nDice 1/2 the bell pepper and 2/3 the onion and mix with tomatoes, jalapeno peppers, cilantro, tomato juice, lime juice, garlic, salt, 1/2 teaspoon black pepper, and 1/4 teaspoon garlic salt together in a bowl. Cover pico de gallo and refrigerate.\nHeat 1 tablespoon olive oil in a skillet over medium heat. Thinly slice the remaining 1/3 onion and 1/2 bell pepper; cook and stir with chicken and mushrooms in the hot oil until vegetables are just tender, 5 to 10 minutes. Add roasted green chile peppers, chili powder, oregano, 1 pinch garlic salt, and 1 pinch black pepper; cook and stir until fragrant, about 30 seconds. Stir enough enchilada sauce into vegetable mixture just to coat.\nSpread pepperjack cheese and Cheddar cheese onto 1/2 of each tortilla. Spread a layer of vegetable mixture over cheese layer. Fold each tortilla over vegetable-cheese layer. Brush the outsides of tortillas with remaining 2 tablespoons olive oil.\nCook quesadillas, working in batches, in a sandwich press or in a skillet over medium heat until browned and cheeses are melted, about 2 minutes; cut into 4 wedges. Serve quesadillas with the pico de gallo.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "3929114.jpg",
    "o": "",
    "st": "allrecipes"
}