{
    "id": 237260,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 eggs",
        "6 large red potatoes, cubed",
        "3/4 cup fresh peas",
        "1/2 small head cauliflower, broken into very small florets",
        "1 cup soy salad dressing (such as VegenaiseÂ®)",
        "3 green onions, white and light green parts only, thinly sliced",
        "2 tablespoons Dijon mustard",
        "1 tablespoon minced fresh parsley",
        "1 tablespoon dill pickle relish",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 256 kcal",
        "Carbs > 42.5 g",
        "Cholesterol > 80 mg",
        "Fat > 7 g",
        "Protein > 7.7 g",
        "Sodium > 254 mg"
    ],
    "n": "Potato, Pea, and Egg Salad with Some Sneaky Cauliflower",
    "a": "Whitney Price",
    "r": "0",
    "s": 10,
    "des": "\"Potatoes, peas, and eggs in a classic salad dressing. Sneaking in a little cauliflower improves the nutrition without changing the taste. The firm potatoes camouflage the cauliflower from those who would balk at eating vegetables! Blanching the cauliflower and peas also helps preserve their nutrients.\"",
    "ins": "Place eggs in a saucepan and cover with water. Bring to a boil, remove from heat, and let eggs stand in hot water for 15 minutes. Remove eggs from hot water; cool under cold running water, about 5 minutes.\nPlace potatoes into a large pot, cover with salted water, and bring to a boil; reduce heat to medium-low and simmer until tender but still firm, about 10 minutes. Remove potatoes with a slotted spoon, reserving hot potato water; place potatoes into a bowl to cool to room temperature, about 20 minutes.\nPlace peas and cauliflower florets in a metal strainer; place strainer into the hot potato water to blanch vegetables, about 3 minutes. Drain; allow to cool to room temperature, about 10 minutes.\nPeel and chop eggs; place into bowl with potatoes. Place peas, cauliflower, salad dressing, green onions, Dijon mustard, parsley, and pickle relish; stir to coat all ingredients evenly with dressing. Season with salt and pepper; chill in the refrigerator until ready to serve.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}