{
    "id": 237253,
    "old_rating": "4.36364",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "7 ounces Chinese-style chow mein stir-fry noodles",
        "Peanut Sauce:",
        "1/4 cup soy sauce",
        "3 tablespoons creamy peanut butter",
        "3 tablespoons vegetable oil",
        "2 tablespoons white sugar",
        "4 teaspoons rice wine vinegar",
        "4 teaspoons sesame oil",
        "Stir-Fry:",
        "vegetable oil, divided",
        "2 teaspoons sesame oil, divided",
        "3 skinless, boneless chicken breast halves, cut into cubes",
        "1 tablespoon minced garlic",
        "1 tablespoon minced fresh ginger root",
        "2 cups thinly sliced cremini mushrooms",
        "2 cups bean sprouts",
        "1/2 cup chopped green onion",
        "1/4 cup chopped cilantro"
    ],
    "nut": [
        "Calories > 463 kcal",
        "Carbs > 30.3 g",
        "Cholesterol > 35 mg",
        "Fat > 28.5 g",
        "Protein > 23 g",
        "Sodium > 929 mg"
    ],
    "n": "Thai Peanut Chicken Lo Mein",
    "a": "Tonja",
    "r": "0",
    "s": 6,
    "des": "\"Kids love this, and we always get rave reviews and requests for the recipe. You can add additional vegetables as desired (broccoli, snow peas, etc.), though you may then need to increase the amount of peanut sauce if you add significant amounts of veggies.\"",
    "ins": "Bring 2 quarts lightly salted water to a boil. Cook chow mein in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 12 minutes; drain.\nWhisk soy sauce, peanut butter, 4 teaspoons vegetable oil, sugar, vinegar, and 4 teaspoons sesame oil together in a bowl until smooth.\nHeat 2 teaspoons vegetable oil and 1 teaspoon sesame oil in a large skillet over medium-high heat. Saute chicken, garlic, and ginger in hot oil until chicken is no longer pink in the center, 5 to 10 minutes. Remove chicken mixture with a slotted spoon to a bowl, retaining drippings in the skillet.\nHeat an additional 1 tablespoon vegetable oil and 1 teaspoon sesame oil in the skillet with the drippings; saute mushrooms until fragrant, 15 to 30 seconds.\nReturn the chicken to the skillet; add drained chow mein noodles, bean sprouts, and green onion. Toss mixture to distribute chicken and vegetables throughout the noodles. Drizzle peanut sauce over the noodles and toss to coat; cook until sauce is warmed, about 1 minute. Remove skillet from heat and garnish with cilantro.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "4512811.jpg",
    "o": "",
    "st": "allrecipes"
}