{
    "id": 237240,
    "old_rating": "4.40741",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 boneless chicken breast halves with skin",
        "salt and ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "2 teaspoons herbes de Provence",
        "2 tablespoons olive oil",
        "1/4 cup sliced shallots",
        "1/2 cup pitted and sliced green olives",
        "1/2 cup brine-cured pitted olives, such as Kalamata, halved lengthwise and brine reserved",
        "1 cup chicken broth",
        "1 lemon, zested and juiced",
        "1/2 teaspoon cumin",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "2 tablespoons cold butter, cut into four pieces"
    ],
    "nut": [
        "Calories > 645 kcal",
        "Carbs > 7 g",
        "Cholesterol > 208 mg",
        "Fat > 37.2 g",
        "Protein > 69.4 g",
        "Sodium > 1141 mg"
    ],
    "n": "Chicken and Olives",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"The sharp, briny bite of olives is the dominant flavors here, which is why it pairs so well with chicken breast. This is one of those dishes where, if you tasted the chicken and sauce separately, you probably wouldn't be very impressed, but together they're magic.\"",
    "ins": "Season skin-side of chicken with salt, black pepper, and cayenne pepper. Turn breasts over and season skinless side with salt, black pepper, cayenne, and herbes de Provence. Turn again so that the skin-side is facing up; rest for 10 minutes.\nHeat olive oil in a large skillet over high heat. Place chicken skin-side down in hot oil. Reduce heat to medium-high and cook chicken until skin is well-browned, about 5 minutes. Turn chicken and cook until just browned, about 2 minutes; transfer to a plate.\nReduce heat to medium. Cook and stir shallots in the hot skillet until just softening and golden brown, about 2 minutes. Stir olives into shallots and cook until fragrant, about 30 seconds.\nPour the chicken broth into the skillet; bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add lemon juice, 2 tablespoons of the reserved olive brine, lemon zest, and cumin; increase heat to high and cook until sauce is reduced by half, 2 to 3 minutes.\nReduce heat to low and return chicken, skin-side up, to the skillet. Cover the skillet with a lid and cook until no longer pink in the center and the juices run clear, about 5 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove chicken to a plate and cover with aluminum foil.\nStir parsley and butter into sauce, stirring continuously until butter is melted and sauce is shiny. Spoon sauce over chicken.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}