{
    "id": 237324,
    "old_rating": "4.44444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package spaghetti",
        "1/2 cup margarine",
        "1/4 cup all-purpose flour",
        "2 cups milk",
        "1 (1 pound) package processed cheese food (such as VelveetaÂ®), cut into cubes",
        "2 cups chopped cooked chicken",
        "1 cup chicken broth",
        "1/2 cup sliced fresh mushrooms",
        "1/4 teaspoon salt",
        "1/8 teaspoon cayenne pepper"
    ],
    "nut": [
        "Calories > 391 kcal",
        "Carbs > 35 g",
        "Cholesterol > 46 mg",
        "Fat > 19.6 g",
        "Protein > 18 g",
        "Sodium > 723 mg"
    ],
    "n": "My Chicken Spaghetti",
    "a": "S",
    "r": "0",
    "s": 12,
    "des": "\"My family has always loved this dish. This makes a big batch, so serve half immediately and freeze remainder. Add additional liquid when you serve frozen portion.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes; drain.\nMelt margarine in a large saucepan over medium heat. Stir flour into the margarine until the flour is completely moistened. Gradually stream milk into the saucepan while whisking with the flour mixture until the milk is incorporated into a smooth mixture.\nStir processed cheese food into the milk mixture in small amounts, letting each addition melt smoothly into the liquid before adding the next; add chicken, chicken broth, mushrooms, salt, and cayenne pepper. Stir mixture, add cooked spaghetti, and toss to coat. Divide the chicken spaghetti between 2 baking dishes.\nBake in preheated oven until the sauce is thick and the edges begin to brown, about 30 minutes.",
    "pt": "10 m",
    "ct": "50 m",
    "tt": "1 h",
    "i": "1124049.jpg",
    "o": "",
    "st": "allrecipes"
}