{
    "id": 237342,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil",
        "1 (8 ounce) package seitan, sliced",
        "1 1/2 teaspoons vegetable oil",
        "1/2 cup mushrooms, cut into bite-size pieces, or to taste",
        "1/4 cup all-purpose flour",
        "1 cup water, or as needed",
        "2 cubes vegetable bouillon",
        "1 pinch cayenne pepper, or to taste (optional)",
        "1 pinch dried rosemary, or to taste (optional)",
        "1 pinch dried thyme, or to taste (optional)",
        "1 small head cauliflower, cut into bite-size pieces"
    ],
    "nut": [
        "Calories > 347 kcal",
        "Carbs > 30.4 g",
        "Cholesterol > 0 mg",
        "Fat > 12.7 g",
        "Protein > 30.8 g",
        "Sodium > 371 mg"
    ],
    "n": "Seitan and Cauliflower",
    "a": "mary jane",
    "r": "0",
    "s": 2,
    "des": "\"Seitan and cauliflower with mushroom gravy is vegan and goes well with mashed potatoes!\"",
    "ins": "Heat 1 tablespoon oil in a skillet over medium-high heat; saute seitan until cooked through and browned, about 5 minutes. Remove skillet from heat and cover with a lid.\nHeat 1 1/2 teaspoons vegetable oil in a small saucepan over medium-high heat; saute mushrooms until lightly browned, about 3 minutes. Whisk flour into mushroom mixture using a fork until mushrooms are coated, 2 to 3 minutes.\nSlowly pour water into mushroom-flour mixture while constantly stirring with a fork until smooth; add bouillon cubes. Decrease heat to medium-low and continue stirring until bouillon is dissolved and gravy is smooth, 5 to 10 minutes more. Season gravy with cayenne pepper, rosemary, and thyme.\nMix cauliflower into seitan; cook and stir over medium heat until cauliflower is slightly softened, 3 to 5 minutes. Add gravy; bring to a boil, reduce heat, cover skillet, and simmer, stirring occasionally, until seitan is softened, 7 to 10 minutes.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}