{
    "id": 237365,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 red potatoes, diced",
        "1 (15 ounce) can kidney beans, rinsed and drained",
        "2 tablespoons olive oil, divided",
        "1 1/2 pounds beef stew meat, cut into bite-size chunks",
        "1 cup diced onion",
        "1 teaspoon ground turmeric",
        "1 teaspoon salt, or more to taste",
        "1/2 teaspoon ground black pepper",
        "2 cups chopped fresh spinach",
        "1 cup chopped fresh parsley",
        "1/2 cup chopped fresh cilantro",
        "1/4 cup chopped fresh chives",
        "4 cups chicken broth",
        "1 cup lime juice",
        "2 teaspoons minced garlic"
    ],
    "nut": [
        "Calories > 298 kcal",
        "Carbs > 21.6 g",
        "Cholesterol > 63 mg",
        "Fat > 11.9 g",
        "Protein > 27 g",
        "Sodium > 1248 mg"
    ],
    "n": "Not-Quite-Persian Ghormeh Sabzi (Green Stew) for the Slow Cooker",
    "a": "Jedigeek",
    "r": "0",
    "s": 6,
    "des": "\"This is Persian green stew. I titled this 'Not Quite Ghormeh Sabzi' because I'm not quite Persian, but I grew up with a Persian step-father who would cook the most awesome Ghormeh Sabzi. \nMy understanding is that Ghormeh Sabzi literally means 'green stew' in Farsi but since many of my Persian friends have taken delight in teaching me to say the wrong thing, don't take my word for it.\n Every Persian I know makes this slightly differently, so the version here is a mix of several recipes, based largely on what I could get at any major grocery store. It's not traditional, but it's so good. Serve over white rice.\"",
    "ins": "Mix diced potatoes and kidney beans in a slow cooker.\nHeat 1 tablespoon olive oil in a large skillet over medium heat. Cook beef and onion in hot oil until both are beginning to brown, about 7 minutes; season with turmeric, 1 teaspoon salt, and black pepper. Transfer beef mixture to the slow cooker.\nHeat remaining olive oil in the skillet over medium-high heat. Saute spinach, parsley, cilantro, and chives in the skillet until slightly wilted, 5 to 6 minutes; add to the slow cooker.\nStir chicken broth, lime juice, and garlic into the mixture in the slow cooker.\nCook on High for 4 hours. Adjust salt as needed.",
    "pt": "25 m",
    "ct": "4 h ",
    "tt": "4 h ",
    "i": "1123512.jpg",
    "o": "",
    "st": "allrecipes"
}