{
    "id": 23733,
    "old_rating": "4.54167",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup cake flour",
        "1/4 cup unsweetened cocoa powder",
        "1 1/2 cups white sugar",
        "3 (1 ounce) squares semisweet chocolate, grated",
        "12 egg whites",
        "1 teaspoon cream of tartar",
        "1/4 teaspoon salt",
        "1/4 teaspoon vanilla extract",
        "1 1/2 teaspoons lemon juice",
        "confectioners' sugar for dusting"
    ],
    "nut": [
        "Calories > 222 kcal",
        "Carbs > 44.9 g",
        "Cholesterol > 0 mg",
        "Fat > 3.1 g",
        "Protein > 6.3 g",
        "Sodium > 126 mg"
    ],
    "n": "Chocolate Angel Food Cake II",
    "a": "veggigoddess",
    "r": "0",
    "s": 10,
    "des": "\"This is a yummy change to standard Angel Food cake.  It has a light and delicate flavor and hits the spot of that chocolate craving. Note: for best flavor and texture, serve the cake on the day it's made and be sure to avoid any traces of yolk in the egg whites, which would prevent them from whipping to their fullest.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). If it does not have a removable bottom, line a 9 inch tube pan with parchment paper.  Sift together the flour, cocoa and 3/4 cup of the sugar.  Set aside.  Measure 3 tablespoons of the flour mixture and toss with the grated chocolate.\nIn a large bowl, using an electric mixer set at low speed, beat egg whites until foamy.  Increase mixer speed to medium, stir in cream of tartar and salt, and continue to beat until egg whites form soft peaks.  Gradually mix in the remaining 3/4 cup sugar and beat until stiff peaks form.  Stir in the vanilla and lemon juice.\nGently fold the flour mixture into the beaten egg whites, then fold in the grated chocolate, stirring just until no white streaks remain.\nGently scrape the batter into the prepared pan.  Smooth the surface of the batter and tap the pan lightly to remove any air bubbles.  Bake in center of the preheated oven for 60 minutes, or until the surface springs back when touched.  Cool completely, and sprinkle with confectioners' sugar before serving, if desired.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "204031.jpg",
    "o": "590862.jpg,204026.jpg,204025.jpg,108480.jpg,108378.jpg,108379.jpg",
    "st": "allrecipes"
}