{
    "id": 237394,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups elbow macaroni",
        "3 eggplants, peeled and cut lengthwise into 1/4-inch thick slices",
        "6 tablespoons olive oil, divided",
        "2 teaspoons garlic powder",
        "salt and ground black pepper to taste",
        "1 onion, diced",
        "1 (8 ounce) package sliced fresh mushrooms",
        "6 chicken thighs",
        "1 pinch garlic powder, or more to taste",
        "1/2 cup Marsala wine",
        "1/4 cup water",
        "1/4 cup tomato paste",
        "2 teaspoons fresh oregano leaves",
        "2 leaves fresh sweet basil, chopped",
        "1 sprig fresh rosemary, leaves stripped",
        "1/4 cup grated Parmesan-Romano cheese, or to taste (optional)"
    ],
    "nut": [
        "Calories > 481 kcal",
        "Carbs > 28.4 g",
        "Cholesterol > 74 mg",
        "Fat > 26.9 g",
        "Protein > 25.9 g",
        "Sodium > 208 mg"
    ],
    "n": "Chicken Marsala with Eggplant and Pasta Casserole",
    "a": "Brenda Briscoe",
    "r": "0",
    "s": 6,
    "des": "\"I love chicken Marsala as well as eggplant and pasta, so I done this twist on the dish. I have a huge herb and spice garden, so I normally use all fresh. I hope you enjoy as much as I.\"",
    "ins": "Grease a 9x13-inch baking dish.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain and transfer pasta to the prepared baking dish.\nPlace eggplant slices in a large pot of lightly salted water. Let eggplant soak to help remove some of the bitterness, about 30 minutes. Drain and pat eggplant strips with a paper towel to dry; transfer to a baking sheet. Brush eggplant with about 2 tablespoons olive oil; season with 2 teaspoons garlic powder, salt, and pepper.\nHeat a large skillet over medium-high heat; saute eggplant until slightly browned, 5 to 10 minutes. Spread cooked eggplant over pasta.\nPour 2 tablespoons olive oil into the same skillet; saute onion and mushrooms until tender, 5 to 10 minutes. Spread onion mixture over eggplant layer.\nSeason chicken thighs with garlic powder, salt, and pepper to taste.\nPour remaining 2 tablespoons olive oil into the same skillet; cook chicken until browned, about 5 minutes per side. Arrange chicken on the onion layer.\nPreheat oven to 400 degrees F (200 degrees C).\nPour wine into the skillet, and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add water, tomato paste, oregano, basil, and rosemary leaves; cook and stir until sauce is smooth and thickened, about 5 minutes. Add chicken to the sauce, cover skillet, decrease heat to low, and simmer while oven preheats, 5 to 10 minutes.\nArrange chicken atop the onion layer and pour sauce over chicken and vegetables. Cover dish with aluminum foil.\nBake in the preheated oven until chicken is no longer pink and the juices run clear, 20 to 30 minutes. An instant-read thermometer inserted in the thickest part of chicken should read 165 degrees F (74 degrees C). Sprinkle Parmesan-Romano cheese over chicken.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "1949008.jpg",
    "o": "",
    "st": "allrecipes"
}