{
    "id": 237320,
    "old_rating": "4.82",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 slices bacon, cut into 1/2-inch pieces",
        "3 1/2 pounds beef short ribs",
        "salt and ground black pepper to taste",
        "6 sprigs fresh thyme, leaves stripped",
        "1 bay leaf",
        "1 onion, diced",
        "3 cloves garlic, minced",
        "2 tablespoons all-purpose flour",
        "1 cup dry sherry",
        "1 quart beef broth"
    ],
    "nut": [
        "Calories > 490 kcal",
        "Carbs > 9.3 g",
        "Cholesterol > 86 mg",
        "Fat > 38.6 g",
        "Protein > 22.4 g",
        "Sodium > 739 mg"
    ],
    "n": "Sherry Braised Beef Short Ribs",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"Beef short ribs are pretty much foolproof, and as long as two things happen, you are in for some very fine eats. First, the beef must be really well browned Â– I'm talking deep, dark, crusty, and caramelized. The other key step is easier. To paraphrase an expression, 'stick a fork in them, they're done.' Just braise them until they're fork-tender. After browning properly, the only way to mess these up is to undercook them, so don't.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Transfer crisped bacon with a slotted spoon to a Dutch oven. Retain bacon drippings in the skillet.\nGenerously season short ribs with salt and pepper.\nHeat bacon drippings in the same skillet over high heat. Cook short ribs in hot bacon fat until browned and caramelized on all sides, 3 to 5 minutes per side. Transfer ribs to the Dutch oven, reserving drippings in the skillet. Add thyme and bay leaf to the ribs mixture.\nReduce heat under the same skillet to medium. Cook and stir onion in the skillet until soft and golden, 5 to 10 minutes. Add garlic; cook and stir until fragrant, about 30 seconds.\nWhisk flour into onion mixture and stir until the mixture becomes paste-like and light golden brown, 1 to 3 minutes.\nPour sherry into onion mixture; cook until thick and hot, about 2 minutes. Pour onion-sherry mixture into Dutch oven; add beef broth and salt to taste. Bring ribs mixture to a simmer and cover the Dutch oven with a lid.\nTransfer Dutch oven to the preheated oven and cook until short ribs are fork tender, about 2 hours. Remove ribs to a serving dish, reserving sauce in the pot.\nSet Dutch oven high heat and boil sauce until reduced and slightly thickened, about 10 minutes. Spoon reduced sauce over ribs.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "4535537.jpg",
    "o": "4535537.jpg,4478792.jpg,4470552.jpg,4464968.jpg,4458526.jpg,4390750.jpg",
    "st": "allrecipes"
}