{
    "id": 237433,
    "old_rating": "4.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 flour tortillas, cut into strips",
        "cooking spray",
        "1 tablespoon peanut oil, or as needed",
        "1 1/2 cups chopped onion",
        "1/4 cup chopped red bell peppers",
        "2 cloves garlic, minced",
        "1 (14.5 ounce) can stewed tomatoes with juice, chopped",
        "2 cups diced zucchini",
        "2 cups frozen sweet corn",
        "1/2 cup diced mushrooms",
        "5 cups vegetable broth",
        "3/4 tablespoon chili powder",
        "1 1/2 teaspoons hot pepper sauce",
        "salt and ground black pepper to taste",
        "2 tablespoons chopped fresh cilantro",
        "1 avocado - peeled, pitted, and sliced",
        "1 cup shredded Monterey Jack cheese"
    ],
    "nut": [
        "Calories > 259 kcal",
        "Carbs > 32.2 g",
        "Cholesterol > 13 mg",
        "Fat > 12 g",
        "Protein > 8.9 g",
        "Sodium > 621 mg"
    ],
    "n": "Vegetarian Tortilla Soup with Avocado",
    "a": "april",
    "r": "0",
    "s": 8,
    "des": "\"One thing I've missed in the years of my being vegetarian is the delicious tortilla soup a local Mexican restaurant makes. I've finally mastered my vegetarian version, that can easily be vegan if the cheese isn't added at the end. My omnivore boyfriend thinks it's divine! Black beans can be added for extra protein.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nArrange tortilla strips on a baking sheet and lightly with cooking spray.\nBake in the preheated oven until golden and crispy, 8 to 10 minutes.\nHeat peanut oil in a stockpot over medium-high heat; saute onion, red bell pepper, and garlic until onion is translucent, 5 to 10 minutes. Add tomatoes with juice, zucchini, corn, and mushrooms; saute until zucchini is slightly softened, 3 to 4 minutes.\nMix vegetable broth, chili powder, hot sauce, salt, and pepper into vegetable mixture; bring to a boil. Reduce heat and simmer soup until vegetables are tender, 20 to 25 minutes. Stir cilantro into soup and remove stockpot from heat.\nLadle soup into serving bowls; top with tortilla strips, avocado slices, and Monterey Jack cheese.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "4506216.jpg",
    "o": "",
    "st": "allrecipes"
}