{
    "id": 237439,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cake:",
        "1 (16.5 ounce) package white cake mix",
        "1 cup water",
        "3 large egg whites",
        "1/4 cup oil",
        "2 tablespoons ground cinnamon, divided",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon lemon extract",
        "1 tablespoon white sugar",
        "Frosting:",
        "1/2 cup butter, room temperature",
        "3 cups confectioners' sugar, or more as needed",
        "3 tablespoons honey",
        "1/2 teaspoon ground cinnamon",
        "2 tablespoons milk, or as needed",
        "1 tablespoon honey, for drizzling"
    ],
    "nut": [
        "Calories > 286 kcal",
        "Carbs > 46.2 g",
        "Cholesterol > 14 mg",
        "Fat > 11 g",
        "Protein > 1.9 g",
        "Sodium > 218 mg"
    ],
    "n": "Sopapilla Cupcakes",
    "a": "MrsFisher0729",
    "r": "0",
    "s": 18,
    "des": "\"A cinnamon sugary cupcake reminiscent of the deep-fried Mexican dessert!\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Line 18 muffin cups with paper liners.\nMix cake mix, water, egg whites, oil, 1 tablespoon cinnamon, vanilla extract, and lemon extract together in the bowl of a stand mixer; mix on low for 30 seconds. Increase speed to medium and mix batter for 2 minutes. Fill muffin cups 2/3-full with batter.\nCombine white sugar and 1 tablespoon cinnamon together in a small bowl; sprinkle over batter.\nBake in the preheated oven until a toothpick inserted in a cupcake comes out clean, about 15 minutes. Cool cupcakes to room temperature.\nBeat butter in a bowl using an electric mixer until creamy and fluffy, 1 to 2 minutes. Add confectioners' sugar, 3 tablespoons honey, and 1/2 teaspoon cinnamon; beat until just combined. Mix milk, 1 tablespoon at a time, into creamed butter mixture until desired consistency of frosting is reached. Spoon frosting into a piping bag or a plastic bag with a snipped corner; pipe onto each cupcake. Drizzle honey over each frosted cupcake.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "55 m",
    "i": "1124409.jpg",
    "o": "4521209.jpg,4510188.jpg,4479623.jpg,3751919.jpg,3751216.jpg,3370710.jpg",
    "st": "allrecipes"
}