{
    "id": 237429,
    "old_rating": "4.14286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cake:",
        "3/4 cup unsalted butter, at room temperature",
        "1/2 cup vegetable oil",
        "2 cups white sugar",
        "2 teaspoons coconut extract",
        "1 teaspoon vanilla extract",
        "4 eggs",
        "3 cups self-rising flour",
        "1 cup unsweetened coconut milk",
        "1/2 cup pineapple juice",
        "Icing:",
        "1/4 cup confectioners' sugar, or more as needed",
        "1/4 cup pineapple juice",
        "1 cup unsalted butter, softened",
        "1 teaspoon coconut extract",
        "1/4 cup shredded coconut",
        "1 (20 ounce) can crushed pineapple, drained"
    ],
    "nut": [
        "Calories > 506 kcal",
        "Carbs > 52.5 g",
        "Cholesterol > 100 mg",
        "Fat > 31.8 g",
        "Protein > 4.6 g",
        "Sodium > 324 mg"
    ],
    "n": "Pineapple Coconut Cake",
    "a": "Brenda Vandervort",
    "r": "0",
    "s": 16,
    "des": "\"An experiment gone great!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease two 9-inch square pans.\nBeat 3/4 cup butter in a bowl using an electric mixer until light and fluffy. Slowly drizzle oil into creamed butter while continuing to beat butter until mixture is smooth. Beat white sugar, 1 cup at a time, into butter mixture until incorporated. Add 2 teaspoons coconut extract and vanilla extract; mix well. Beat eggs, 1 at a time, into butter mixture, beating well until each egg is fully incorporated.\nMix flour, alternating with coconut milk, into butter mixture, ending with flour until batter is just mixed. Mix 1/2 cup pineapple juice into batter. Pour batter into the prepared pans.\nBake in the preheated oven until a toothpick inserted in the center of each cake comes out clean, 45 to 50 minutes.\nMix confectioners' sugar and 1/4 cup pineapple juice together in a bowl until sugar is dissolved. Beat 1 cup butter into sugar mixture until light and fluffy. Add 1 teaspoon coconut extract; beat until icing is smooth, adding more confectioners' sugar until desired consistency is reached.\nPlace 1 cake on a serving platter and top with a layer of icing. Place second cake over icing layer. Cover entire cake with remaining icing. Dust sides of cake with shredded coconut and top with crushed pineapple.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "1806585.jpg",
    "o": "",
    "st": "allrecipes"
}