{
    "id": 237499,
    "old_rating": "4.43678",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 eggs",
        "2 tablespoons milk",
        "1 cup all-purpose flour",
        "1 tablespoon salt",
        "1 teaspoon ground black pepper",
        "1 pinch cayenne pepper",
        "1 1/2 pounds skinless, boneless chicken breast cutlets, pounded flat",
        "2 tablespoons olive oil",
        "1 tablespoon butter",
        "1 cup vegetable broth",
        "1/2 cup dry sherry",
        "2 lemons, juiced",
        "1/4 cup cold butter, cut into chunks",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 627 kcal",
        "Carbs > 31.5 g",
        "Cholesterol > 328 mg",
        "Fat > 32.1 g",
        "Protein > 48.4 g",
        "Sodium > 2305 mg"
    ],
    "n": "Chef John's Chicken French",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Chicken French has everything I love in a recipe. It's delicious and easy, frugal, yet fancy, and everyone loves it. Better yet, it has a vague, confusing history and completely preposterous name. This not-French recipe hails from the Rochester area of New York State, where it's a staple on virtually every Italian-American restaurant menu.\"",
    "ins": "Beat eggs and milk together in a shallow bowl. Whisk flour, salt, black pepper, and cayenne pepper together in another shallow bowl.\nGently press chicken into flour mixture to coat; shake off excess flour. Dip into egg mixture and coat completely.\nHeat olive oil and 1 tablespoon butter together in a large skillet over medium heat. Cook chicken in hot oil until lightly browned, 2 to 3 minutes per side. Transfer chicken to a plate.\nCook and stir vegetable broth, sherry, and lemon juice in the same skillet; bring to a boil and cook until sauce is reduced by half. Remove from heat and add cold butter chunks; stir until butter is melted and sauce is shiny and thickened, 1 to 2 minutes. Stir parsley into sauce and season with salt and pepper.\nReturn chicken to the skillet over medium heat, spoon sauce over the top, and cook until chicken is heated through and no longer pink in the center, 1 to 3 minutes more.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "25 m",
    "i": "4518617.jpg",
    "o": "4518617.jpg,4476607.jpg,4017805.jpg,3899915.jpg,3899910.jpg,3896168.jpg",
    "st": "allrecipes"
}