{
    "id": 237474,
    "old_rating": "4.95",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup pomegranate molasses",
        "4 cloves garlic, minced",
        "1 tablespoon chopped fresh rosemary",
        "1 tablespoon kosher salt",
        "2 teaspoons freshly ground black pepper",
        "1 teaspoon Aleppo pepper",
        "1 teaspoon dried mint",
        "1 teaspoon ground cumin",
        "1 (5 pound) boneless leg of lamb, butterflied",
        "kitchen twine",
        "salt to taste",
        "water as needed",
        "1 tablespoon pomegranate molasses, or as needed"
    ],
    "nut": [
        "Calories > 326 kcal",
        "Carbs > 1.2 g",
        "Cholesterol > 115 mg",
        "Fat > 20.6 g",
        "Protein > 31.9 g",
        "Sodium > 804 mg"
    ],
    "n": "Chef John's Roasted Leg of Lamb",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"I've done more than a few lamb dishes dedicated to Easter, but inexplicably have never posted one for a whole leg of lamb. It's such a classic Easter menu option, and, when prepared using this method, makes for a very user-friendly hunk of meat.\"",
    "ins": "Stir 1/4 cup pomegranate molasses, garlic, rosemary, kosher salt, black pepper, Aleppo pepper, mint, and cumin together in a bowl.\nArrange the butterflied leg of lamb onto a work surface with the fatty side facing down. Cut 2 deep slashes in each of the the fleshy ends of the meat. Flip the lamb and cut 10 to 20 shallow slashes across the surface of the fat.\nSpread 3/4 the pomegranate molasses mixture onto the meat-side of the lamb to coat completely. Fold meat together and turn into a large bowl. Spread remaining pomegranate mixture over the fatty side of the meat. Cover the bowl with plastic wrap and refrigerate 8 hours to overnight.\nPreheat oven to 350 degrees F (175 degrees C). Place a roasting rack in the bottom of a roasting pan.\nRemove lamb from marinade and discard excess marinade. Gather roast and place onto a work surface with fatty side facing upwards. Tie the center section of the roast with kitchen twine to cinch the roast together. Repeat ties four times along the length of the roast.\nSeason roast with salt and transfer to prepared roasting pan. Pour water below the rack to cover the bottom of the pan.\nRoast in the preheated oven until hot and slightly pink in the center, about 1 3/4 hours. An instant-read thermometer inserted into the center should read at least 135 degrees F (57 degrees C). Rest for 15 minutes, transfer to a plate, and brush with remaining pomegranate molasses.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "10 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}