{
    "id": 237496,
    "old_rating": "4.7",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 prepared pastry dough for 9-inch pie",
        "2 cups pecan halves",
        "1 cup light brown sugar",
        "1/2 cup butter",
        "1/2 cup white sugar",
        "1/2 cup light corn syrup",
        "3 tablespoons all-purpose flour",
        "2 tablespoons milk",
        "1 tablespoon bourbon",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon salt",
        "3 large eggs, whisked"
    ],
    "nut": [
        "Calories > 527 kcal",
        "Carbs > 57.5 g",
        "Cholesterol > 80 mg",
        "Fat > 32.3 g",
        "Protein > 5.4 g",
        "Sodium > 314 mg"
    ],
    "n": "Chef John's Pecan Pie",
    "a": "Chef John",
    "r": "0",
    "s": 10,
    "des": "\"This is my idea of the perfect pecan pie. It has the perfect ratio of crunchy nuts to the sweet, sticky goodness underneath. And thanks to the blind-baking, the crust is wonderfully crisp.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nRoll pie dough in a 9 1/2-inch glass pie dish and crimp the edges. Cover dough in parchment paper and press paper down to line the dough; pour pie weights on top of the parchment paper and spread evenly over the bottom.\nBake in the preheated oven for 20 minutes. Remove parchment paper and pie weights to a bowl. Bake crust until lightly golden and set, about 10 minutes more.\nSpread pecans out on a baking sheet. Bake in the oven until lightly toasted, 7 to 8 minutes.\nStir brown sugar, butter, white sugar, corn syrup, flour, milk, bourbon, vanilla extract, and salt together in a saucepan over medium heat; bring to a boil, whisking constantly. Remove from heat and cool for 5 to 10 minutes.\nWhisk eggs in a large bowl. Slowly drizzle sugar mixture into eggs, whisking constantly.\nSpread pecans out in the bottom of the crust. Pour sugar mixture over nuts and gently stir with a spatula to coat all of the nuts.\nBake pie in the preheated oven until crust is golden brown and pie is set, 40 to 45 minutes. Cool completely.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "4463762.jpg",
    "o": "4463762.jpg,4370739.jpg,4330193.jpg,4102403.jpg,3820032.jpg,3305531.jpg",
    "st": "allrecipes"
}