{
    "id": 237460,
    "old_rating": "4.22222",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "10 plantains, peeled and broken into chunks",
        "1/2 teaspoon salt",
        "1/2 cup milk",
        "1/4 cup butter",
        "Filling:",
        "1 tablespoon canola oil",
        "1 pound ground beef",
        "1 yellow onion, chopped",
        "1 green bell pepper, chopped",
        "1/2 cup tomato sauce",
        "1 teaspoon crushed garlic",
        "1/2 cube chicken bouillon",
        "1/2 pound shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 783 kcal",
        "Carbs > 100.6 g",
        "Cholesterol > 107 mg",
        "Fat > 35.1 g",
        "Protein > 26.8 g",
        "Sodium > 739 mg"
    ],
    "n": "Pastelon de Platano Maduro (Dominican-Style Yellow Plantain Pie)",
    "a": "Mirelly",
    "r": "0",
    "s": 6,
    "des": "\"This is a typical dish from the Dominican Republic. It can be used as the main dish, with a salad on the side. You can also have it as a side. It's a healthy and delicious meal. \nIt's an easy to make recipe. Enjoy it!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Spray a baking dish with cooking spray.\nPlace plantains and salt into a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until plantains turn a darker yellow; add 1 cup water to the pot, bring to a boil, and cook until tender, about 15 minutes. Drain.\nMash plantains, milk, and butter together in the pot until smooth.\nHeat oil in a large skillet over medium heat. Cook and stir ground beef, onion, bell pepper, tomato sauce, garlic, and chicken bouillon, adding water if mixture gets too dry, in hot oil until beef is browned and cooked through, 10 to 12 minutes.\nSpread 1/2 of the mashed plantains into the bottom of the prepared baking dish. Pour meat mixture over the plantains and top with Cheddar cheese. Spread remaining mashed plantains over the cheese.\nBake in the preheated oven until plantains are golden and filling is bubbling, about 10 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "4543001.jpg",
    "o": "4542983.jpg,4542982.jpg,4506748.jpg,4361479.jpg,4042568.jpg,2617065.jpg",
    "st": "allrecipes"
}