{
    "id": 237497,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 eggs, beaten",
        "1 teaspoon chopped fresh basil",
        "1 teaspoon chopped fresh oregano",
        "1 tablespoon olive oil",
        "1/3 cup diced onion",
        "salt and ground black pepper to taste",
        "1/2 cup sliced mushrooms",
        "1/2 pound lean ground chuck",
        "1/2 cup cooked chopped spinach, squeezed dry, or more to taste",
        "2 tablespoons grated Parmigiano-Reggiano cheese, or more to taste"
    ],
    "nut": [
        "Calories > 879 kcal",
        "Carbs > 13.6 g",
        "Cholesterol > 715 mg",
        "Fat > 60 g",
        "Protein > 72 g",
        "Sodium > 613 mg"
    ],
    "n": "Joe's Special Beef and Spinach Scramble",
    "a": "Chef John",
    "r": "0",
    "s": 1,
    "des": "\"This mammoth plate of food features three eggs, a half-pound of meat, and more than enough spinach. Apparently a late-night patron requested his spinach omelet include a hamburger patty, and this is what happened. In respect to good ol' made-up 'Joe,' I've kept the original portions, so feel free to share with a friend or three. This version is mostly meat and spinach, but if you want something closer to a classic scramble, then cut the beef and spinach amounts in half. This is how most restaurants that copy the recipe do it!\"",
    "ins": "Beat eggs, basil, and oregano together in a bowl.\nHeat oil in a large skillet over medium-high heat. Saute onions with a pinch of salt in hot oil until onion is translucent, 4 to 6 minutes; add mushrooms with another pinch of salt. Saute mushrooms and onion until mushrooms are soft and brown around the edges, 4 to 6 minutes more.\nStir ground beef, pepper, and salt into the mushroom mixture. Cook and stir until meat is lightly browned and crumbly, 1 to 3 minutes. Turn off the heat. Push all meat to one side of the skillet and tilt the skillet so that the excess grease runs down to the bottom of the pan. Use a paper towel to blot the grease.\nStir spinach into beef mixture and cook over medium heat until spinach is heated through, about 1 minute. Add eggs; cook and stir until eggs are set, 3 to 4 minutes. Season with salt and pepper and top with Parmigiano-Reggiano cheese.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}