{
    "id": 237576,
    "old_rating": "4.88372",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds ground beef",
        "1 pound bulk Italian sausage",
        "1 large onion, diced",
        "1 tablespoon minced garlic",
        "2 (16 ounce) cans kidney beans, rinsed and drained",
        "2 (16 ounce) cans chili beans, undrained",
        "2 (14.5 ounce) cans diced tomatoes",
        "2 (14.5 ounce) cans crushed tomatoes",
        "2 ribs celery, chopped",
        "1 green bell pepper, coarsely chopped",
        "1/2 red bell pepper, chopped",
        "1/2 (7 ounce) can chipotle chiles in adobo sauce, finely chopped",
        "1/2 (3 ounce) package bacon bits",
        "1 tablespoon chili sauce",
        "1 tablespoon hot pepper sauce (such as Frank's RedHotÂ®)",
        "1 tablespoon chili powder",
        "2 teaspoons brown sugar",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon salt"
    ],
    "nut": [
        "Calories > 402 kcal",
        "Carbs > 33.7 g",
        "Cholesterol > 65 mg",
        "Fat > 18.3 g",
        "Protein > 28.1 g",
        "Sodium > 1257 mg"
    ],
    "n": "Slow Cooker Chipotle Chili",
    "a": "duboo",
    "r": "0",
    "s": 12,
    "des": "\"My friend Keni's love of smokey chipotle peppers inspired this recipe. It comes together perfectly and is a unique chili that will stand out against others. It is a spicy chili that at the same time is mellow. It gives you the kick without the lingering burn like many chilis do.\"",
    "ins": "Heat a large skillet over medium-high heat. Cook and stir beef and sausage in the hot skillet until some of the fat renders, 2 to 3 minutes; add onion and garlic and continue to cook and stir until the meats are browned and crumbly, 5 to 7 minutes more. Transfer beef mixture to a slow cooker.\nStir kidney beans, chili beans, diced tomatoes, crushed tomatoes, celery, green bell pepper, red bell pepper, chipotle chiles, bacon bits, chili sauce, hot pepper sauce, chili powder, brown sugar, cumin, and salt with the beef mixture.\nCook on Low until vegetables are completely tender but the celery retains a slight bit of firmness, 6 to 8 hours (or 3 to 4 hours on High).",
    "pt": "25 m",
    "ct": "6 h ",
    "tt": "6 h ",
    "i": "4517377.jpg",
    "o": "4501237.jpg,4478846.jpg,3945417.jpg,3561291.jpg,3133533.jpg,3057265.jpg",
    "st": "allrecipes"
}