{
    "id": 23755,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 eggs",
        "8 ounces bacon",
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "2 cups milk",
        "2 cups shredded Cheddar cheese",
        "1/2 cup sour cream",
        "1 teaspoon cayenne pepper",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "6 cornbread",
        "1 cup shredded Cheddar cheese",
        "6 green onions, chopped"
    ],
    "nut": [
        "Calories > 799 kcal",
        "Carbs > 34 g",
        "Cholesterol > 328 mg",
        "Fat > 59.1 g",
        "Protein > 33 g",
        "Sodium > 1580 mg"
    ],
    "n": "Texas Brunch",
    "a": "LYNN WILLIAMS",
    "r": "0",
    "s": 6,
    "des": "\"Once you try this, it will become your favorite brunch item. You may substitute cooked sausage for the bacon if you wish.\"",
    "ins": "Place eggs in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and chop.\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nIn a medium sized saucepan, melt butter over medium heat. When butter has melted, whisk in the flour. Stir until all lumps have dissolved. Slowly pour in the milk, stirring constantly, until thickened.\nAs gravy begins to thicken,  add chopped eggs and 2 cup cheese. Cook 3 to 5 minutes to melt the cheese and heat through. Stir in the sour cream, cayenne, salt and pepper; stir until heated through. Keep warm over low heat until ready to serve (do not boil).\nSlice cornbread pieces and lay open on serving plates. Ladle a generous amount of egg mixture over the cornbread, top with remaining shredded cheese, crumbled bacon, and green onion.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "599460.jpg",
    "o": "",
    "st": "allrecipes"
}