{
    "id": 237573,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup hazelnuts",
        "3 tablespoons confectioners' sugar",
        "2 tablespoons canola oil",
        "1 tablespoon unsweetened cocoa powder",
        "1/2 teaspoon vanilla extract, or more to taste",
        "1/2 teaspoon salt, or more to taste",
        "1 (12 ounce) bag dark chocolate chips"
    ],
    "nut": [
        "Calories > 87 kcal",
        "Carbs > 8.6 g",
        "Cholesterol > 0 mg",
        "Fat > 6.2 g",
        "Protein > 1.2 g",
        "Sodium > 39 mg"
    ],
    "n": "Homemade NutellaÂ® (Chocolate-Hazelnut Spread)",
    "a": "grampnana",
    "r": "0",
    "s": 32,
    "des": "\"We were able to purchase fresh hazelnuts while in Portland last fall. This is one of the many ways to enjoy them.  Hoping for a 'healthier' version of the store-bought variety, dark chocolate is used here with great results (for dark chocolate lovers) or it may be made with milk chocolate for the more traditional flavor.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nSpread hazelnuts onto a baking sheet and roast in preheated oven until slightly browned and the skins are slightly blistered, 10 to 15 minutes.\nSpread a kitchen towel onto a flat work surface. Put the hazelnuts in the middle of the towel and wrap the towel around the nuts. Roll towel vigorously to strip the nuts from as much of the skins as you can remove. Discard skins and set nuts aside to cool completely.\nPut hazelnuts in a food processor and grind into a paste; add sugar, canola oil, cocoa powder, vanilla, and salt. Continue to process the mixture until it is as smooth as you can get it.\nMelt the chocolate in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Pour chocolate into the food processor and blend into the hazelnut mixture. Use a spatula to transfer into a container with a tight-fitting lid, but cool completely at room temperature before sealing tightly.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "4465844.jpg",
    "o": "",
    "st": "allrecipes"
}