{
    "id": 237648,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 cups water",
        "1 pinch salt",
        "1/4 cup pearl barley",
        "3 sweet potatoes, peeled and cubed",
        "2 tablespoons olive oil",
        "1/4 teaspoon Cajun seasoning",
        "2 (15.25 ounce) cans black beans, rinsed and drained",
        "1/4 cup coconut milk",
        "1 tablespoon canola oil",
        "1 bunch kale, stems removed and discarded, leaves torn into bite-size pieces"
    ],
    "nut": [
        "Calories > 999 kcal",
        "Carbs > 153.6 g",
        "Cholesterol > 0 mg",
        "Fat > 29.8 g",
        "Protein > 39.6 g",
        "Sodium > 2127 mg"
    ],
    "n": "The West Seattle Sweet Potato and Kale Bowl",
    "a": "Seattle Dad",
    "r": "0",
    "s": 2,
    "des": "\"This recipe makes for a nice, robust bowl of food you can feel good about eating. We often eat sweet potato and black bean burritos, but wanted to challenge ourselves to add some leafy greens we had from the West Seattle Farmer's Market. This is the result.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nBring water and salt to a boil in a pot; add barley. Reduce heat to low and cover the pot; cook until water is absorbed and barley is softened, about 20 minutes.\nToss sweet potatoes with olive oil and Cajun seasoning in a bowl; spread onto a baking sheet.\nRoast sweet potatoes in the preheated oven for 15 minutes; flip and continue cooking until tender, about 10 minutes more.\nCombine black beans and coconut milk in a saucepan over medium heat; cook, stirring occasionally, until heated through and coconut milk thickens, 7 to 10 minutes.\nHeat canola oil in a skillet over medium-high heat; saute kale until slightly wilted, about 5 minutes. Divide kale between 2 plates. Spoon barley over kale; top with black bean mixture and sweet potatoes.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "2254424.jpg",
    "o": "",
    "st": "allrecipes"
}