{
    "id": 237689,
    "old_rating": "4.13636",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (1 pound) fresh or frozen skinless salmon fillet",
        "Reynolds WrapÂ® Heavy Duty Aluminum Foil",
        "1 small red onion, thinly sliced",
        "1 tablespoon olive oil",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 lemon, thinly sliced",
        "6 Greek pita flatbreads",
        "2 cups chopped romaine lettuce",
        "1 cup fresh cherry or grape tomatoes, quartered",
        "1 (5.3 ounce) container plain Greek yogurt",
        "1 tablespoon snipped fresh basil",
        "1 tablespoon snipped fresh dill weed"
    ],
    "nut": [
        "Calories > 344 kcal",
        "Carbs > 33.7 g",
        "Cholesterol > 50 mg",
        "Fat > 13.7 g",
        "Protein > 21.9 g",
        "Sodium > 430 mg"
    ],
    "n": "Grilled Salmon Greek Pitas",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 6,
    "des": "\"Tuck grilled salmon, lettuce, and onion inside a pita, and pair with a yogurt dip for a refreshing summertime lunch.\"",
    "ins": "Thaw fish if frozen. Rinse and pat dry with paper towels. Preheat grill to medium-high.\nTear off an 18x18-inch sheet of Reynolds Wrap(R) Heavy Duty Aluminum Foil. Place onion in the center of the sheet. Top with salmon. Drizzle with the olive oil and sprinkle with the salt and black pepper. Top with lemon slices. Bring up foil sides. Double-fold top and ends to seal packet, leaving room for heat circulation inside.\nStack flatbreads; wrap tightly in heavy duty aluminum foil.\nGrill salmon packet over medium-high heat in covered grill 12 to 14 minutes or until fish begins to flake when tested with a fork and vegetables are tender.\nAdd the flatbread packet to the grill for the last 5 minutes of cooking to warm through, turning once. Remove all from grill.\nOpen packets carefully by cutting along top folds with a sharp knife, allowing steam to escape. Then open top of foil. Discard lemon slices. Use two forks to pull the salmon apart into chunks.\nAssemble sandwiches by topping pita with the salmon, onions, lettuce, and tomatoes. Fold in half to serve. In a small bowl, mix together the yogurt, basil, and dill. Serve over pita sandwiches.",
    "pt": "20 m",
    "ct": "14 m",
    "tt": "34 m",
    "i": "1127877.jpg",
    "o": "1214393.jpg,1211298.jpg,1211140.jpg,1210776.jpg,1207389.jpg,1207381.jpg",
    "st": "allrecipes"
}