{
    "id": 237631,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 cups smashed fresh apricots",
        "2 1/2 cups xylitol",
        "1 tablespoon ground cinnamon",
        "1 teaspoon lemon juice",
        "6 half pint canning jars with lids and rings"
    ],
    "nut": [
        "Calories > 66 kcal",
        "Carbs > 23.7 g",
        "Cholesterol > 0 mg",
        "Fat > 0.1 g",
        "Protein > 0.4 g",
        "Sodium > < 1 mg"
    ],
    "n": "Sugar- and Pectin-Free Preserves",
    "a": "IlsaB",
    "r": "0",
    "s": 25,
    "des": "\"This is a delicious jam/preserves recipe that I came up when when I started limiting the amount of sugar I eat. It's delicious without added sugar or those nasty artificial sugars (sucralose, aspartame, etc.). I love this best on a slice of whole grain whole wheat toast with some butter. Refrigerate before serving.\"",
    "ins": "Combine apricots, xylitol, cinnamon, and lemon juice together in a saucepan. Bring to a boil, stirring constantly, and continue boiling until a thermometer inserted into mixture reads 220 degrees F (104 degrees C), 10 to 15 minutes.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack apricot mixture into hot, sterilized jars, filling to within 1 inch of the top. Run a knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 5 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}