{
    "id": 237637,
    "old_rating": "4.70455",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons white miso paste",
        "2 tablespoons water",
        "2 tablespoons mirin (Japanese sweet wine)",
        "2 tablespoons sake",
        "1 tablespoon brown sugar",
        "2 (7 ounce) black cod fillets"
    ],
    "nut": [
        "Calories > 290 kcal",
        "Carbs > 20.9 g",
        "Cholesterol > 72 mg",
        "Fat > 1.9 g",
        "Protein > 37.3 g",
        "Sodium > 846 mg"
    ],
    "n": "Miso-Glazed Black Cod",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"This is my take on the oft requested miso-glazed, black cod, made famous by chef Nobu Matsuhisa. In addition to a taste and texture to die for, this is one of the easiest fish recipes of all time. A couple minutes to make the sauce, some brushing, a short wait, and you're broiling. By the way, I don't like to cook both sides. I like the heat to only penetrate from the top down. This makes for a lovely caramelized top, and a super juicy interior. Cooking times will vary, but simply broil the fish until the bones pull out with no effort, and the meat flakes.\"",
    "ins": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil and lightly grease the aluminum foil.\nWhisk miso paste, water, mirin, sake, and brown sugar together in a small skillet over medium heat until mixture simmers and thickens slightly, 1 to 3 minutes. Remove from heat and cool completely.\nPlace cod fillets on prepared baking sheet. Brush fillets all over with miso mixture. Rest fillets at room temperature to quickly marinate, 15 to 20.\nBroil fillets in the preheated oven for 5 minutes. Turn the baking sheet 180 degrees and continue broiling until fish flakes easily with a fork, about 5 minutes more. Remove pin bones.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "40 m",
    "i": "4324921.jpg",
    "o": "4324921.jpg,3858219.jpg,3297605.jpg,3294265.jpg,2143383.jpg,1986576.jpg",
    "st": "allrecipes"
}