{
    "id": 237677,
    "old_rating": "4.42564",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 (32 ounce) package frozen bite-size potato nuggets (such as Tater TotsÂ®), divided",
        "1 pound ground beef",
        "1 cup chopped onion",
        "2 teaspoons Worcestershire sauce",
        "2 teaspoons Montreal-style steak seasoning (optional)",
        "1 teaspoon garlic powder",
        "1/2 teaspoon ground black pepper",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1/2 cup milk",
        "1/2 cup grated Cheddar cheese",
        "1 teaspoon Worcestershire sauce",
        "1 cup grated Cheddar cheese"
    ],
    "nut": [
        "Calories > 440 kcal",
        "Carbs > 34.4 g",
        "Cholesterol > 61 mg",
        "Fat > 27.7 g",
        "Protein > 19.3 g",
        "Sodium > 1131 mg"
    ],
    "n": "Tater TotsÂ® Casserole",
    "a": "Kristy",
    "r": "0",
    "s": 8,
    "des": "\"My family loves this casserole. It is easy to prepare and makes enough for two meals. Serve with a crisp salad and fresh pineapple for a complete meal your family will love!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Prepare a 13x9-inch casserole dish with cooking spray.\nSpread 20 potato nuggets in the casserole dish.\nBake in preheated oven until warmed through, about 10 minutes.\nHeat a large skillet over medium-high heat. Cook and stir beef and onion in the hot skillet until beef is completely browned, 5 to 7 minutes; drain and discard grease. Season beef mixture with 2 teaspoons Worcestershire sauce, steak seasoning, garlic powder, and black pepper.\nStir cream of mushroom soup, milk, 1/2 cup Cheddar cheese, and 1 teaspoon Worcestershire sauce together in a bowl.\nSmash the warmed potato nuggets in the casserole dish to cover the bottom completely. Spread ground beef mixture over the mashed potato nuggets. Pour soup mixture evenly over the beef layer. Top with remaining potato nuggets and sprinkle 1 cup Cheddar cheese evenly over the nuggets.\nBake in preheated oven until casserole is bubbly and potatoes golden brown, 30 to 40 minutes.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "1130247.jpg",
    "o": "4541767.jpg,4524314.jpg,4510814.jpg,4505672.jpg,4487991.jpg,4481507.jpg",
    "st": "allrecipes"
}