{
    "id": 237780,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 pounds chicken wings",
        "Rub:",
        "1 1/2 tablespoons garlic powder",
        "1 tablespoon onion powder",
        "1 tablespoon paprika",
        "1 tablespoon chili powder",
        "1 tablespoon cumin",
        "1 (1.41 ounce) package sazon seasoning",
        "1 teaspoon cayenne pepper",
        "4 cups oil for frying",
        "cooking spray",
        "Sauce: ",
        "1/2 cup butter",
        "1 1/2 cups hot sauce (such as Frank's RedHot Â®)",
        "1 1/2 cups maple-flavored syrup ",
        "3 tablespoons brown sugar",
        "1 1/2 tablespoons garlic powder",
        "1 tablespoon ground cumin",
        "1 tablespoon onion powder",
        "1 tablespoon paprika",
        "1 tablespoon chili powder",
        "3/4 teaspoon cayenne pepper",
        "2 cups all-purpose flour"
    ],
    "nut": [
        "Calories > 553 kcal",
        "Carbs > 61.8 g",
        "Cholesterol > 63 mg",
        "Fat > 28.1 g",
        "Protein > 16.2 g",
        "Sodium > 1640 mg"
    ],
    "n": "True Wings",
    "a": "true",
    "r": "0",
    "s": 10,
    "des": "\"Since I started making this back in the 90's I've called them my world-famous wings. I wanted to make wings for the big game and wanted them to be something better than just fried wings. Serve with blue cheese or ranch dressing.\"",
    "ins": "Place wings in a large glass bowl. Sprinkle 1 1/2 tablespoons garlic powder, 1 tablespoon onion powder, 1 tablespoon paprika, 1 tablespoon chili powder, 1 tablespoon cumin, sazon seasoning, and 1 teaspoon cayenne pepper over chicken wings and rub spices into wings to coat completely. Cover the bowl with plastic wrap and refrigerate, 1 hour to overnight.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil and spray with cooking spray.\nMelt butter in a saucepan over medium heat; whisk hot sauce and syrup into butter. Add brown sugar, 1 1/2 tablespoons garlic powder, 1 tablespoon cumin, 1 tablespoon onion powder, 1 tablespoon paprika, 1 tablespoon chili powder, and 3/4 teaspoon cayenne pepper; whisk until well-combined and the sauce is hot, 2 to 3 minutes. Remove from heat.\nPour flour into a shallow bowl. Gently press the chicken wings into the flour to coat and shake off any excess.\nWorking in batches, cook wings in hot oil until the skin is golden and crispy, the meat is no longer pink at the bone and the juices run clear, 5 to 10 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Transfer wings to a plate lined with a paper towel to drain excess oil.\nDip each chicken wing in the hot sauce mixture and place on the prepared baking sheet.\nBake in the preheated oven until sauce starts to caramelize, about 20 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "2029566.jpg",
    "o": "",
    "st": "allrecipes"
}