{
    "id": 237726,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons ground black pepper",
        "1 tablespoon fennel seed",
        "2 teaspoons salt",
        "4 cloves garlic, crushed",
        "4 sprigs rosemary, leaves stripped and bruised",
        "2 tablespoons olive oil",
        "1 orange, juiced",
        "1 pinch cayenne pepper, or to taste",
        "1 (2 pound) flank steak",
        "1 tablespoon olive oil, or as needed",
        "2 oranges, halved"
    ],
    "nut": [
        "Calories > 319 kcal",
        "Carbs > 6.1 g",
        "Cholesterol > 51 mg",
        "Fat > 19.8 g",
        "Protein > 28.3 g",
        "Sodium > 1219 mg"
    ],
    "n": "Garlic Fennel Flank Steak with Oranges",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"While this dish may appear to be inspired by Italian or Spanish influences (which it is), it's also a take on one of my favorite Chinese dishes: spicy orange beef. I love to grill flank steak with a highly-flavored rub of garlic, fennel, salt and black pepper.\"",
    "ins": "Grind black pepper and fennel seed together in a mortar with a pestle. Pour half the pepper mixture into a small bowl and stir in salt.\nStir remaining pepper mixture, garlic, rosemary, 2 tablespoons olive oil, orange juice, and cayenne pepper together in a bowl.\nRub rosemary mixture over both sides of flank steak, poking mixture into steak several times with a fork. Transfer steak to a resealable plastic bag and marinate in the refrigerator for 2 hours. Remove steak from marinade; scrape off and discard any excess marinade.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nSprinkle reserved pepper-fennel mixture over steak. Drizzle 1 tablespoon olive oil over orange halves.\nCook steak on the preheated grill until it begins to firm and is reddish-pink and juicy in the center, about 5 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Remove to a plate to rest for 10 to 15 minutes before slicing across the grain.\nPlace oranges, flesh-side down, on the grill and cook until flesh is golden and caramelized, 3 to 5 minutes. Place steak and 3 orange halves on a serving platter. Squeeze remaining caramelized orange half over the steak.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}