{
    "id": 237778,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 zucchinis",
        "salt and ground black pepper to taste",
        "2 tomatoes, chopped",
        "1/2 cup crushed crackers",
        "1/2 cup fresh corn kernels",
        "1/4 cup finely chopped black olives (optional)",
        "2 mushrooms, finely chopped, or more to taste (optional)",
        "2 tablespoons mild pineapple salsa",
        "1 large clove garlic, minced",
        "1 teaspoon Italian seasoning",
        "1/2 teaspoon dried oregano, or more to taste",
        "1/4 cup shredded smoked Gouda cheese, or more to taste"
    ],
    "nut": [
        "Calories > 248 kcal",
        "Carbs > 31.5 g",
        "Cholesterol > 9 mg",
        "Fat > 11.7 g",
        "Protein > 7.7 g",
        "Sodium > 470 mg"
    ],
    "n": "Italian-Style Stuffed Zucchini  (Kid-Friendly)",
    "a": "Suzanne",
    "r": "0",
    "s": 4,
    "des": "\"Zucchini boats stuffed with a tomato/vegetable mixture and topped with smoked gouda. The cheese gets toasty and melty and ties the flavors together. My kids (6 and 9) thought it would be gross when they looked at it, but loved it once they tried it!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nCut each zucchini in half lengthwise and hollow out the center using a spoon to create a \"boat\". Lay each half, face-up, on a baking sheet and season with salt and pepper.\nBake in the preheated oven until hot and slightly tender, about 10 minutes.\nStir tomatoes, crackers, corn, olives, mushrooms, salsa, garlic, Italian seasoning, and oregano together in a bowl. Season with salt and pepper.\nCook and stir tomato mixture in a skillet over medium heat until all liquid evaporates, 5 to 10 minutes. Spoon tomato mixture into zucchini \"boats\". Top each \"boat\" with Gouda cheese.\nBake stuffed zucchini \"boats\" in the oven until tender and cheese is melted, about 15 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "2499082.jpg",
    "o": "",
    "st": "allrecipes"
}