{
    "id": 237853,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Wontons:",
        "12 wonton wrappers",
        "2 avocados from Mexico, peeled, pitted and sliced",
        "1/2 cup coleslaw mix (shredded cabbage and carrots)",
        "1/4 cup chopped red onion",
        "1/4 cup chopped fresh cilantro",
        "2 quarts oil for frying",
        "Dip:",
        "3/4 cup mayonnaise",
        "3/4 cup sour cream",
        "1 (4 ounce) can chopped green chiles",
        "1 (1 ounce) packet dry ranch dressing mix",
        "1 clove garlic, minced",
        "1/4 cup chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 348 kcal",
        "Carbs > 11 g",
        "Cholesterol > 13 mg",
        "Fat > 33.7 g",
        "Protein > 2.2 g",
        "Sodium > 408 mg"
    ],
    "n": "Avocado Wontons with Spicy Ranch Dip",
    "a": "Avocados from Mexico",
    "r": "0",
    "s": 12,
    "des": "\"Wontons filled with avocado, coleslaw mix, red onion and fresh cilantro are deep fried until crispy and served with a creamy ranch-style dip.\"",
    "ins": "Lay out a square wonton wrapper with one point facing you. Place 1 to 2 slices of avocado in the center. Top with cole slaw mix, onion and cilantro. Moisten the edges of the wonton using your finger dipped in water. Fold wonton over to make a triangle. Then flip in the two corners to secure. Press all edges to ensure the seams are secure. Continue until all of the wontons are filled.\nHeat oil in a cast iron pan over medium-high heat to 350 degrees F, or when a drop of water sizzles when sprinkled on surface. If necessary, cook wontons in batches to avoid crowding. Fry wontons on each side until wrappers are golden brown and crisp, 2 to 3 minutes. Drain on paper towels.\nCombine mayonnaise, sour cream, green chiles, ranch dressing mix, garlic and cilantro in a bowl. Stir until well blended (you can also use a blender for this). Serve as a dipping sauce for the wontons.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "1150180.jpg",
    "o": "",
    "st": "allrecipes"
}