{
    "id": 237827,
    "old_rating": "4.56129",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (14.75 ounce) can red salmon, skin and bone removed, drained and flaked",
        "2 eggs",
        "1/2 lemon, juiced",
        "1 tablespoon chopped capers",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon cayenne pepper",
        "12 saltine crackers",
        "1 tablespoon bread crumbs, or as needed",
        "1 tablespoon butter",
        "1 tablespoon olive oil"
    ],
    "nut": [
        "Calories > 305 kcal",
        "Carbs > 14.6 g",
        "Cholesterol > 174 mg",
        "Fat > 14.6 g",
        "Protein > 30.9 g",
        "Sodium > 1020 mg"
    ],
    "n": "Chef John's Salmon Cakes",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"I'm using canned salmon for this delicious recipe. Every grocery store carries it, and canned salmon is almost always wild salmon. I'm not going to go into the wild-versus-farmed salmon debate here, but wild is not only more eco-friendly, it tastes better and is more nutritious. You could use fresh cooked salmon for this recipe if you have leftovers, but since we are mixing this up with eggs and cracker crumbs, fresh salmon just isn't necessary, so why spend the extra cash?\"",
    "ins": "Stir salmon, eggs, lemon juice, capers, salt, black pepper, and cayenne pepper together in a bowl until well-combined.\nCrush saltine crackers with your hands into the salmon mixture and mix well. Wrap the bowl with plastic wrap and refrigerate, 30 minutes to overnight.\nDust a plate with half the bread crumbs. Divide salmon mixture into 4 portions and shape into patties; place onto prepared plate and sprinkle remaining bread crumbs atop the salmon patties.\nMelt butter and oil in a large skillet over medium heat. Cook patties in hot oil until cooked and heated through, about 5 minutes per side.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "55 m",
    "i": "4520456.jpg",
    "o": "4520456.jpg,4460549.jpg,3529471.jpg,3375812.jpg,3308333.jpg,3291604.jpg",
    "st": "allrecipes"
}