{
    "id": 237814,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (6 ounce) lobster tail",
        "Marinade:",
        "1/4 cup olive oil",
        "1/4 cup chopped Italian flat-leaf parsley",
        "3 tablespoons lime juice",
        "salt and ground black pepper to taste",
        "water as needed",
        "Pasta:",
        "1/2 pound angel hair pasta",
        "1/4 cup olive oil",
        "1/2 cup sliced fresh mushrooms",
        "1 teaspoon minced garlic",
        "2 tablespoons butter",
        "1 tablespoon capers",
        "1/4 cup chopped Italian flat-leaf parsley",
        "4 cherry tomatoes, cut into quarters",
        "1 tablespoon lime juice"
    ],
    "nut": [
        "Calories > 1004 kcal",
        "Carbs > 69.2 g",
        "Cholesterol > 81 mg",
        "Fat > 70.9 g",
        "Protein > 26.9 g",
        "Sodium > 717 mg"
    ],
    "n": "Bob Lob Lobster",
    "a": "Sheri from Bham, AL",
    "r": "0",
    "s": 2,
    "des": "\"We had one fresh lobster tail and 2 people who wanted to eat it! We threw what we had in the fridge and pantry on the stove, and viola! Add olive oil, salt, and pepper to taste. Top pasta with Parmesan cheese if desired. Yum yum.\"",
    "ins": "Cut lobster tail lengthwise along shell to within 1/2-inch of the end of the tail.\nWhisk 1/4 cup olive oil, 1/4 cup parsley, 3 tablespoons lime juice, salt, and pepper together in a shallow bowl until marinade is evenly mixed. Place lobster tail, cut-side up, in the marinade and spoon marinade over the meat; marinate for about 10 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nLine a baking dish with aluminum foil. Fill the dish with water about 1/2-inch deep. Remove lobster from marinade, reserving marinade for basting. Place lobster in the baking dish. Spoon 1/2 of the marinade over the lobster.\nBake lobster in the preheated oven, basting every 5 minutes with remaining marinade, until lobster meat is cooked through and opaque, 20 to 25 minutes. Remove meat from shell and chop.\nBring a large pot of lightly salted water to a boil. Cook angel hair in the boiling water, stirring occasionally until cooked through but firm to the bite, 4 to 5 minutes. Drain pasta, reserving 3 tablespoons pasta water.\nHeat 1/4 cup olive oil in a skillet over medium heat; cook and stir mushrooms and garlic until fragrant, about 3 minutes. Add butter and capers; cook and stir until butter is melted, about 1 minute. Add 1/4 cup parsley and tomatoes; cook and stir for 1 minute.\nMix lobster meat, 1 tablespoon lime juice, cooked pasta, and reserved pasta water into mushroom mixture; cook and stir until heated through, about 1 minute.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}