{
    "id": 237824,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (.25 ounce) package active dry yeast (such as Fleischmann's RapidRiseÂ®)",
        "3 1/2 cups all-purpose flour, divided, or more as needed",
        "1 cup warm water (105 degrees F/41 degrees C)",
        "1 large egg",
        "3 tablespoons melted butter",
        "3 tablespoons sugar",
        "1 1/4 teaspoons salt",
        "1 teaspoon olive oil",
        "3 tablespoons melted butter, or as needed"
    ],
    "nut": [
        "Calories > 310 kcal",
        "Carbs > 46.8 g",
        "Cholesterol > 46 mg",
        "Fat > 10.4 g",
        "Protein > 6.9 g",
        "Sodium > 436 mg"
    ],
    "n": "Chef John's Hot Dog Buns",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"Don't get me wrong; if you hand me a hot dog at the ball game, it's not like I'm going to throw it back in your face, but given the choice this butter-crisped, split-topped bun is the way to go. Thanks to its genius design the meat and fixings go in the top, which leaves three relatively flat sides to toast in butter.\"",
    "ins": "Line a baking sheet with a silicone mat or parchment paper.\nPlace yeast into bowl of a large stand mixer; whisk 1/2 cup flour and water into yeast until mixture is smooth. Let stand until mixture is foamy, 10 to 15 minutes.\nWhisk egg, 3 tablespoons melted butter, sugar, and salt into yeast mixture; add remaining flour and stir.\nFit a dough hook onto stand mixer and knead the dough on low speed until soft and sticky, 5 to 6 minutes. Scrape sides if needed. Poke and prod the dough with a silicone spatula; if large amounts of dough stick to the spatula, add a little more flour.\nTransfer dough onto a floured work surface; dough will be sticky and elastic but not stick to your fingers. Form the dough lightly into a smooth, round shape, gently tucking loose ends underneath.\nWipe out stand mixer bowl, drizzle olive oil into the bowl, and turn dough over in the bowl several times to coat surface thinly with oil. Cover bowl with aluminum foil. Let dough rise in a warm place until doubled in size, about 2 hours.\nTransfer dough to a floured work surface and form into a 5x10-inch rectangle about 1/2-inch thick. Cut dough into 8 equal lengths. Turn each slice cut-side up and form into a hot dog bun shape about 5 inches long. Transfer dough, cut-sides up, to the prepared baking sheet about set them about 1/4-inch apart.\nCut a slit about 1/8-inch deep down the center of each bun. Brush 2 tablespoons melted butter over the top and sides of each bun. Let rise until almost doubled in size and the buns have risen into each other, about 45 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nBake buns in the preheated oven until golden brown, about 20 minutes. Brush tops with remaining melted butter.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "3 h ",
    "i": "4487711.jpg",
    "o": "4487711.jpg,3287302.jpg,2392276.jpg,2392272.jpg,2057744.jpg,1489830.jpg",
    "st": "allrecipes"
}