{
    "id": 237830,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (1 pound) flat iron steaks, at room temperature",
        "1 teaspoon dry beef bouillon powder",
        "5 tablespoons olive oil",
        "1/4 cup finely chopped onion",
        "3 tablespoons minced garlic",
        "2 tablespoons chili powder",
        "1 tablespoon balsamic vinegar",
        "1 tablespoon lime juice",
        "1 tablespoon molasses",
        "1 tablespoon smoked paprika",
        "1 tablespoon onion powder",
        "1 teaspoon ground cumin",
        "1/2 teaspoon dried cilantro",
        "1/4 teaspoon ground black pepper",
        "1 pinch dried rubbed sage"
    ],
    "nut": [
        "Calories > 634 kcal",
        "Carbs > 12.8 g",
        "Cholesterol > 155 mg",
        "Fat > 44.2 g",
        "Protein > 48.3 g",
        "Sodium > 303 mg"
    ],
    "n": "Western Style Flat Iron Steaks",
    "a": "Alta Nesbitt Rees Sieker",
    "r": "0",
    "s": 4,
    "des": "\"Flat iron steaks are a tender cut of meat from the top blade or shoulder of the chuck portion, usually in a triangle shape resembling an iron, hence the name. \nI use a variety of common spices to create my zesty rub/marinade.\"",
    "ins": "Rub steaks all over with beef bouillon powder.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nWhisk olive oil, onion, garlic, chili powder, balsamic vinegar, lime juice, molasses, paprika, onion powder, cumin, cilantro, black pepper, and sage together in a shallow baking dish until marinade is thick and well-combined. Place steaks in marinade and turn to coat completely. Cover the dish with plastic wrap and let stand at room temperature to marinate meat, about 15 minutes.\nCook the steaks on the preheated grill, basting frequently with marinade, until steaks start to firm and are reddish-pink and juicy in the center, 6 to 7 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Remove steaks to a plate and let rest for 3 minutes before slicing.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "50 m",
    "i": "1430368.jpg",
    "o": "",
    "st": "allrecipes"
}