{
    "id": 237920,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup water",
        "1/2 cup white rice",
        "5 slices bacon",
        "1 (14 ounce) can black beans",
        "2 teaspoons taco seasoning mix, divided",
        "1 teaspoon vegetable oil, or as needed",
        "5 flour tortillas",
        "2 tomatoes, diced",
        "1 green bell pepper, chopped",
        "1 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 573 kcal",
        "Carbs > 60.2 g",
        "Cholesterol > 61 mg",
        "Fat > 24.9 g",
        "Protein > 26.7 g",
        "Sodium > 1148 mg"
    ],
    "n": "Bacon Tacos",
    "a": "Jason Melo Hall",
    "r": "0",
    "s": 5,
    "des": "\"Bacon is delicious and so are tacos. Together they make an amazing meal! Serve all ingredients a la carte.\"",
    "ins": "Bring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and liquid has been absorbed, 20 to 25 minutes.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned and crispy, about 10 minutes. Drain the bacon slices on paper towels, retaining the drippings in the skillet. Crumble bacon.\nPreheat oven to 250 degrees F (120 degrees C).\nCombine beans and 1 teaspoon taco seasoning mix in a saucepan over low heat; cook and stir until warmed, about 5 minutes.\nCook and stir the cooked rice and 1 teaspoon taco seasoning mix in the reserved bacon drippings until evenly coated, 2 to 3 minutes.\nBrush vegetable oil over each tortilla and arrange tortillas on a baking sheet.\nBake tortillas in the preheated oven until warmed, about 5 minutes.\nPlace black bean mixture, rice mixture, bacon, tomatoes, green bell peppers, and Cheddar cheese each in separate bowls; serve with tortillas.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "3777338.jpg",
    "o": "",
    "st": "allrecipes"
}