{
    "id": 237993,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound lean ground beef",
        "salt and ground black pepper to taste",
        "1 small yellow onion, diced",
        "2 cloves garlic, diced",
        "1 (1.25 ounce) package taco seasoning",
        "1 pinch red pepper flakes, or to taste",
        "2 tablespoons canola oil",
        "1 (11 ounce) package pizza dough",
        "1 cup shredded Cheddar cheese",
        "1 small green onion, minced"
    ],
    "nut": [
        "Calories > 447 kcal",
        "Carbs > 30.4 g",
        "Cholesterol > 70 mg",
        "Fat > 24.5 g",
        "Protein > 23.7 g",
        "Sodium > 962 mg"
    ],
    "n": "Ground Beef Taco Flatbread",
    "a": "samlawali",
    "r": "0",
    "s": 6,
    "des": "\"Was looking for a quick and easy dinner for me and the man. Had leftover pizza dough that I like to use for flatbreads. It is simple to add veggies to meat mixture and play with the flavors! Feel free to add your favorite hot sauce for a spicier kick. Serve with a side salad to complete the meal. You can switch out ingredients as you like; turkey or chicken for beef or experiment with different cheeses. Fold flatbread like a taco and enjoy!\"",
    "ins": "Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add yellow onion, garlic, taco seasoning, and red pepper flakes; cook and stir until onion is tender, about 10 minutes.\nHeat oil in a separate skillet over medium heat.\nRoll dough into a thin crust onto a work surface; cut into 6 equal pieces.\nFry each piece of dough in the hot oil until golden, about 1 minute per side. Transfer cooked flatbread to a paper towel-lined plate.\nTop each flatbread with ground beef mixture, Cheddar cheese, and green onion.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "1210029.jpg",
    "o": "",
    "st": "allrecipes"
}