{
    "id": 237937,
    "old_rating": "3.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup whole wheat panko bread crumbs",
        "1/2 cup cornmeal",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 (5.3 ounce) container VOSKOSÂ® Nonfat Vanilla Greek Yogurt",
        "3 eggs, lightly beaten",
        "2 cups fresh or frozen corn kernels (thawed, if frozen)",
        "1 (6 ounce) can crabmeat, drained, flaked and cartilage removed",
        "2 tablespoons olive oil",
        "Roasted Pepper-Yogurt Aioli:",
        "2 (5.3 ounce) containers VOSKOSÂ® Nonfat Vanilla Greek Yogurt",
        "1/4 cup roasted red peppers, drained",
        "4 teaspoons lemon juice",
        "2 cloves garlic, minced"
    ],
    "nut": [
        "Calories > 271 kcal",
        "Carbs > 35.1 g",
        "Cholesterol > 108 mg",
        "Fat > 8.3 g",
        "Protein > 16.4 g",
        "Sodium > 281 mg"
    ],
    "n": "Crab and Corn Cakes with Roasted Pepper-Yogurt Aioli",
    "a": "Voskos",
    "r": "0",
    "s": 6,
    "des": "\"Whole wheat panko crumbs and cornmeal add a golden crunch to these sweet corn and crabmeat appetizer cakes. The tangy Greek yogurt-red pepper aioli topper adds a creamy contrast to the summery dish.\"",
    "ins": "Stir together the whole wheat panko, cornmeal, salt, and pepper. Whisk in VOSKOS(R) Nonfat Vanilla Greek Yogurt and eggs until combined. Stir in corn and crabmeat.\nCoat a very large nonstick skillet with olive oil. Heat over medium-high heat. Using a 1/4-cup measure, add six portions of the corn-crab mixture to the hot skillet, spacing evenly. Cook about 6 minutes or until golden brown, turning once. Transfer to a warm serving plate. Repeat with remaining corn-crab mixture. Serve warm with Roasted Pepper-Yogurt Aioli (see below).\nRoasted Pepper-Yogurt Aioli: Add VOSKOS(R) Nonfat Vanilla Greek Yogurt, red pepper, lemon juice, and garlic to a blender or food processor. Cover and blend until smooth.",
    "pt": "30 m",
    "ct": "12 m",
    "tt": "42 m",
    "i": "1133467.jpg",
    "o": "",
    "st": "allrecipes"
}