{
    "id": 237983,
    "old_rating": "4.3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 small onion, chopped",
        "2 (15 ounce) cans pinto beans, rinsed and drained",
        "2 (15 ounce) cans crushed tomatoes",
        "1 (15 ounce) can cream-style corn",
        "1 (6 ounce) box cornbread mix",
        "1 egg, lightly beaten",
        "1 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 515 kcal",
        "Carbs > 56.5 g",
        "Cholesterol > 99 mg",
        "Fat > 21 g",
        "Protein > 27.9 g",
        "Sodium > 1403 mg"
    ],
    "n": "Easy Tamale Casserole",
    "a": "Gwendelyn Robinson Grizzle",
    "r": "0",
    "s": 6,
    "des": "\"My mom liked to make the Hamburger HelperÂ® version of this recipe. When I moved to another state, I could not find it, so I came up with this. Memories of home. My hubby likes for me to spice this up sometimes, so I will use a 14-ounce can of tomatoes and green chiles in it or just use a Mexican-style cornbread mix sometimes.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nHeat a cast-iron skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Season beef with salt and pepper.\nStir onion into the ground beef; cook and stir for 1 minute and immediately remove skillet from heat.\nStir pinto beans and crushed tomatoes into the beef mixture.\nBeat cream-style corn, cornbread mix, and egg together in a bowl until smooth; spread over the top of the ground beef mixture in the skillet. Sprinkle Cheddar cheese over the corn mixture.\nBake in preheated oven until the cheese is melted and the cornbread is set in the middle, about 25 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "4029771.jpg",
    "o": "",
    "st": "allrecipes"
}