{
    "id": 237952,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 pound ground beef chuck",
        "1 cup sliced onion",
        "1/2 cup water",
        "1 cup sliced mushrooms",
        "1 (12 ounce) jar brown gravy (such as HeinzÂ®)",
        "4 eggs",
        "4 cups cooked rice"
    ],
    "nut": [
        "Calories > 602 kcal",
        "Carbs > 61.4 g",
        "Cholesterol > 259 mg",
        "Fat > 24 g",
        "Protein > 32.3 g",
        "Sodium > 629 mg"
    ],
    "n": "Hawaiian Loco Moco",
    "a": "INA",
    "r": "0",
    "s": 4,
    "des": "\"I ate this at a sports bar/cafe on the big island of Hawaii. This is a local dish served many ways, but this version is my favorite. They usually make it with SPAMÂ®. Also you can make this using leftover rice, pre-cooked burgers, and jarred sauce.\"",
    "ins": "Prepare a large skillet with cooking spray and heat over medium heat.\nDivide ground chuck into 4 equal portions; form into patties.\nFry patties in skillet until beginning to firm and are hot and slightly pink in the center, about 6 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Remove patties to a plate, retaining drippings in the skillet.\nStir onion and water into the reserved drippings. Reduce heat to low and cook until the onions are slightly softened, about 5 minutes. Stir mushrooms into the onion mixture; cook until mushrooms are cooked through, about 5 minutes more.\nPour gravy over the onion and mushroom mixture; stir. Cook until the gravy is hot, about 5 minutes. Gently lie patties into the gravy; simmer until reheated through.\nWhile the patties simmer in gravy, prepare a separate skillet with cooking spray and heat over medium heat. Fry eggs in the hot skillet until the white is opaque but the yolk remains runny, 2 to 3 minutes.\nDivide rice between 4 plates. Top each rice portion with a beef patty and top the patties each with an egg. Pour gravy equally over each portion.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "3854404.jpg",
    "o": "",
    "st": "allrecipes"
}