{
    "id": 237936,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups thinly sliced Brussels sprouts*",
        "1 medium apple, coarsely chopped",
        "4 slices bacon, crisp-cooked and crumbled",
        "1/2 cup sliced almonds, toasted**",
        "Honey Yogurt Dressing:",
        "1 (5.3 ounce) container VOSKOSÂ® Nonfat Honey Greek Yogurt",
        "1 tablespoon cider vinegar",
        "1/4 teaspoon salt"
    ],
    "nut": [
        "Calories > 94 kcal",
        "Carbs > 9.7 g",
        "Cholesterol > 5 mg",
        "Fat > 4.4 g",
        "Protein > 5.7 g",
        "Sodium > 160 mg"
    ],
    "n": "Brussels Sprouts Slaw with Honey Yogurt Dressing",
    "a": "Voskos",
    "r": "0",
    "s": 8,
    "des": "\"A quick cook in the microwave and these mini heads of cabbage slice neatly for a slaw that melds its personality with sweet chopped apple, crumbled bacon, and a creamy Greek yogurt dressing. Like other cruciferous vegetables, Brussels sprouts bring Vitamins A and C to the meal, along with some iron.\"",
    "ins": "Combine Brussels sprouts and 2 tablespoons water in a medium microwave-safe bowl; cover. Microwave on 100% power (high) for 4 minutes, stirring halfway through. Immediately chill the Brussels sprouts by plunging into a bowl of ice water; drain well. Remove any excess moisture from the Brussels sprouts by using a salad spinner or place Brussels sprouts in a colander and use paper towels to absorb the excess moisture.\nCombine Brussels sprouts and apple in a large bowl. Pour Honey Yogurt Dressing (see below) over Brussels sprouts mixture; toss gently to coat. Add bacon; toss gently to combine. Cover and chill for 2 to 24 hours. Just before serving, gently stir in almonds.\nHoney Yogurt Dressing: Stir together VOSKOS(R) Nonfat Honey Greek Yogurt, cider vinegar, and salt in a bowl. Chill up to 24 hours.",
    "pt": "30 m",
    "ct": "4 m",
    "tt": "2 h ",
    "i": "1133468.jpg",
    "o": "",
    "st": "allrecipes"
}