{
    "id": 237978,
    "old_rating": "4.42308",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Quinoa:",
        "2 cups reduced-sodium chicken broth",
        "1 cup quinoa",
        "1/2 cup chopped scallions",
        "1 1/2 teaspoons lemon juice",
        "Blackened Chicken:",
        "1 teaspoon paprika",
        "1 teaspoon ground cumin",
        "1 teaspoon onion powder",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon cayenne pepper",
        "1/2 teaspoon sea salt",
        "4 (4 ounce) skinless, boneless chicken breast halves",
        "non-stick cooking spray",
        "Avocado Cream Sauce:",
        "1/2 avocado",
        "1/4 cup plain non-fat Greek-style yogurt",
        "1 1/2 teaspoons lemon juice",
        "1/2 teaspoon garlic powder"
    ],
    "nut": [
        "Calories > 367 kcal",
        "Carbs > 33.2 g",
        "Cholesterol > 71 mg",
        "Fat > 10.3 g",
        "Protein > 35 g",
        "Sodium > 356 mg"
    ],
    "n": "Blackened Chicken with Avocado Cream Sauce",
    "a": "skinnymom",
    "r": "0",
    "s": 4,
    "des": "\"This recipe will kick your taste buds into high gear! The perfect blend of paprika, cumin, and cayenne pepper will have your mouth buzzing with flavor and heat, but don't worry, the addition of the avocado and Greek yogurt cream sauce acts as a cooling agent for all that fire! The quinoa adds a gentle basic flavor to this intense dish and contributes a satisfying amount of nutritious fiber and protein to keep you and your family full and happy!\"",
    "ins": "Bring chicken broth to a boil in a saucepan. Stir quinoa into the broth and bring again to a boil; reduce heat to medium-low, cover, and simmer until quinoa is tender and broth has been absorbed, 15 to 20 minutes.\nStir scallions and 1 1/2 teaspoons lemon juice into the quinoa.\nMix paprika, cumin, onion powder, black pepper, cayenne pepper, and sea salt together in a small bowl; rub onto chicken breasts to season completely.\nPrepare a large skillet with cooking spray and heat over medium-high heat.\nLay chicken breasts into the hot skillet, cover skillet with a lid, and cook until chicken is no longer pink in the center and the juices run clear, about 7 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nBlend avocado, yogurt, 1 1/2 teaspoons lemon juice, and garlic powder in a food processor until smooth.\nSpread quinoa onto a serving platter. Arrange chicken breasts onto the platter. Drizzle avocado cream sauce over the chicken breasts.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "3467232.jpg",
    "o": "",
    "st": "allrecipes"
}