{
    "id": 237964,
    "old_rating": "4.76923",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 cups water",
        "5 pounds lean ground pork",
        "3 onions, chopped",
        "2 tablespoons salt",
        "2 1/2 cups ground dry bread crumbs, or more as needed",
        "1 teaspoon ground allspice",
        "5 pastries for double-crust pies"
    ],
    "nut": [
        "Calories > 499 kcal",
        "Carbs > 35 g",
        "Cholesterol > 49 mg",
        "Fat > 31.3 g",
        "Protein > 18.4 g",
        "Sodium > 882 mg"
    ],
    "n": "Terri's Tourtiers (French-Canadian Santa Pies)",
    "a": "mauigirl",
    "r": "0",
    "s": 30,
    "des": "\"This recipe is a Christmas tradition first given to me by my French-Canadian sister-in-law in the form of a lovely homemade pie. Her family has made dozens of these to share every year with friends and family during the holiday season for generations. In fact, earlier generations stored their newly made pies in the snow banks outside their Quebec homes for keeping through the winter. The tradition of gathering the family to share the assembly of dozens of pies still thrives to this day. Her little grandson could not pronounce the name so he renamed them Santa pies, and the tradition continues. Serve with cornichons or gherkins and grainy Dijon mustard.\"",
    "ins": "Bring water to a boil in a large saucepan; crumble pork into the boiling water. Reduce heat and simmer until pork is no longer pink, 10 to 15 minutes. Drain water into a large bowl and transfer pork to a separate bowl; refrigerate pork. Refrigerate broth until fat separates from water, at least 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nPlace pork in a large skillet; add onions and salt. Cook and stir pork mixture over medium heat until onion is soft and translucent, 10 to 15 minutes.\nSkim and discard the fat from the broth. Pour the remaining broth over the pork-onion mixture; stir in bread crumbs and allspice until well mixed. Add more bread crumbs if mixture is runny. Remove skillet from heat.\nPress 5 pie crusts into five 9-inch pie dishes. Divide ground pork mixture among the 5 prepared pie crusts. Place 1 pie crust over each pie, crimping edges together to seal. Cut slits into the top crust of each pie for ventilation.\nBake in the preheated oven until pies are golden brown, about 1 hour.",
    "pt": "1 h",
    "ct": "1 h ",
    "tt": "3 h ",
    "i": "1446783.jpg",
    "o": "",
    "st": "allrecipes"
}