{
    "id": 238096,
    "old_rating": "2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter, softened",
        "1/4 cup confectioners' sugar",
        "1/4 cup packed brown sugar",
        "1/4 teaspoon salt",
        "1 egg",
        "1/2 teaspoon vanilla extract",
        "2 cups all-purpose flour",
        "1/2 cup miniature semisweet chocolate chips",
        "48 round wooden toothpicks",
        "1 cup finely chopped pecans",
        "1 (11 ounce) package caramel bits (such as KraftÂ®)",
        "2 tablespoons water"
    ],
    "nut": [
        "Calories > 95 kcal",
        "Carbs > 12.2 g",
        "Cholesterol > 9 mg",
        "Fat > 4.9 g",
        "Protein > 1.3 g",
        "Sodium > 44 mg"
    ],
    "n": "Caramel Cookie Pops",
    "a": "benson_lorraine",
    "r": "0",
    "s": 48,
    "des": "\"You can substitute any type of nuts for the pecans and dip the pops in whatever else you'd like.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease baking sheets.\nBeat butter, confectioners' sugar, brown sugar, and salt together in a bowl until light and fluffy. Add egg and vanilla extract; beat until smooth. Gradually beat flour into butter mixture until dough is smooth; stir chocolate chips into dough.\nShape dough into 1-inch balls and place 2-inches apart on prepared baking sheets.\nBake until cookies are set, 10 to 12 minutes. Immediately press a round toothpick into the center of each cookie; remove to wire racks to cool completely.\nPlace pecans in a shallow bowl. Line a flat work surface with a sheet of waxed paper.\nStir caramels and water together in a saucepan over medium-low heat until caramels melt and mixture is smooth, 3 to 5 minutes.\nHold a cookie by the toothpick and dip it into the caramel mixture, turning to coat completely. Remove from caramel and let any excess caramel drip off into the saucepan. Immediately dip the bottom and sides of each caramel-coated cookie into pecans. Transfer to wax paper to cool until set. Repeat with remaining cookies.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "1288906.jpg",
    "o": "",
    "st": "allrecipes"
}