{
    "id": 238036,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons butter, divided",
        "1 teaspoon olive oil",
        "1 1/2 cups fresh corn kernels, divided",
        "salt and ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "1 clove garlic, pressed",
        "2 1/2 cups water, divided",
        "1/2 cup polenta"
    ],
    "nut": [
        "Calories > 166 kcal",
        "Carbs > 26.6 g",
        "Cholesterol > 7 mg",
        "Fat > 5.6 g",
        "Protein > 4.6 g",
        "Sodium > 211 mg"
    ],
    "n": "Chef John's Three Corn Polenta",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"When I first began my career as a cook in San Francisco, I remember talking with a Chef about an upcoming menu on which he was thinking of using polenta as the side dish. I asked him if he was talking about polanda. He said he'd never heard of polanda. I called my mom and told her we were going to serve something called polenta at the restaurant. I asked her if she had ever heard of it. She laughed and said that they were the same things! She explained that 'pol-an-da' was just our family's mispronunciation of the actual name polenta. I was pretty embarrassed, to say the least!\"",
    "ins": "Melt 1 teaspoon butter and olive oil in a saucepan over medium-low heat. Cook and stir 2/3 of the corn, with a pinch of salt and a pinch of cayenne pepper in the hot butter and oil until the corn is fragrant and golden, about 10 minutes. Add garlic; cook and stir until fragrant, about 30 seconds.\nPour 2 cups water into corn mixture; bring to a simmer and whisk polenta into mixture. Bring to a simmer again, reduce heat to low, and simmer, stirring occasionally, until mixture is thick and polenta absorbs the water, 20 minutes. Add remaining 1/2 cup water and stir; cook for until water is completely absorbed, about 10 minutes more.\nStir remaining corn and 1 teaspoon butter into polenta mixture. Remove from heat, cover the pot, and let sit for 5 minutes before serving.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}