{
    "id": 238049,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 pounds potatoes, peeled",
        "1/4 cup butter",
        "6 egg yolks",
        "salt to taste",
        "1 pinch ground white pepper, or to taste",
        "10 1/2 ounces shredded Cheddar cheese",
        "1/2 large onion, diced",
        "2 eggs",
        "1/4 cup water",
        "1 cup sifted all-purpose flour, or as needed",
        "1 cup soft bread crumbs, or as needed.",
        "1 quart vegetable oil for frying"
    ],
    "nut": [
        "Calories > 446 kcal",
        "Carbs > 34.8 g",
        "Cholesterol > 204 mg",
        "Fat > 27.7 g",
        "Protein > 15 g",
        "Sodium > 322 mg"
    ],
    "n": "Cheese and Potato Rissoles",
    "a": "Louise Honey-Jones",
    "r": "0",
    "s": 10,
    "des": "\"These rissoles are something we used to have with our chips from the local fish and chip shop when we lived in south Wales. As they are unheard of in Canada, I thought I would share the recipe for others to experience great Welsh comfort food.\"",
    "ins": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain potatoes and mash in the bottom of the pot until no lumps remain.\nPut pot over low heat. Stir butter into the mashed potatoes; cook, stirring constantly, until the butter has melted and the potatoes are no longer moist. Spread potatoes into the bottom of a wide bowl and refrigerate until cooled completely, at least 30 minutes.\nBeat egg yolks into cooled potatoes; season with salt and white pepper. Stir Cheddar cheese and diced onion into the potatoes. Shape potato mixture into tennis ball-sized spheres, arrange into a baking dish, and refrigerate until chilled completely through, at least 1 hour.\nBeat eggs and water together in a bowl. Spread flour and bread crumbs into two separate wide bowls.\nGently roll potato balls in flour to coat and shake to remove excess flour. Dip each into the beaten egg, turning to coat. Press each egg-coated ball into bread crumbs, again turning to coat on all sides.  Gently toss between your hands so any bread crumbs that haven't stuck can fall away. Place the breaded balls onto a plate while breading the rest; do not stack.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nDeep-fry potato balls in batches in hot oil until golden brown, about 5 minutes. Add more oil and return to 375 degrees F (190 degrees C) between batches. Drain fried balls on a plate lined with paper towel.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "1195227.jpg",
    "o": "",
    "st": "allrecipes"
}