{
    "id": 238091,
    "old_rating": "4.52",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Taco Filling:",
        "1 tablespoon oil, or as needed",
        "4 carrots, chopped",
        "1 potato, chopped",
        "2 leeks, chopped (optional)",
        "1 onion, chopped",
        "1 sweet potato, shredded",
        "1 (15 ounce) can black beans, rinsed and drained",
        "2 tablespoons ground cumin",
        "1 teaspoon dried oregano",
        "1 teaspoon chili powder",
        "1 pinch cayenne pepper",
        "salt and ground black pepper to taste",
        "Tacos:",
        "16 (6 inch) corn tortillas",
        "1 avocados - peeled, pitted, and mashed",
        "1/2 cup crumbled queso fresco",
        "1/2 cup salsa",
        "1/4 cup finely chopped fresh cilantro",
        "1/2 teaspoon lime juice, or to taste"
    ],
    "nut": [
        "Calories > 334 kcal",
        "Carbs > 56.2 g",
        "Cholesterol > 5 mg",
        "Fat > 8.9 g",
        "Protein > 11 g",
        "Sodium > 400 mg"
    ],
    "n": "Dave's Mexican Veggie Tacos",
    "a": "Dave",
    "r": "0",
    "s": 8,
    "des": "\"One pan. Great spice. People will beg for the recipe. I swear by this and I'm not even a vegetarian. Substitute your favorite cheese for the queso fresco if desired.\"",
    "ins": "Heat oil in a skillet over medium heat; cook and stir carrots until lightly browned, about 5 minutes. Add potato; cook and stir until lightly browned and mostly tender, 5 to 10 minutes. Add leeks and onion; cook and stir until onion is lightly browned, 5 to 10 minutes.\nMix shredded sweet potato, black beans, cumin, oregano, chili powder, cayenne pepper, salt, and pepper into carrot-potato mixture; cook and stir until sweet potato is tender, about 10 minutes. Remove skillet from heat and transfer sweet potato mixture to a bowl, scraping skillet clean with a rubber spatula.\nHeat each tortilla in the same skillet over medium heat until warmed, about 30 seconds per side. Spread mashed avocado onto each warmed tortilla and top with sweet potato mixture, queso fresco, salsa, cilantro, and lime juice.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "1450971.jpg",
    "o": "",
    "st": "allrecipes"
}