{
    "id": 238072,
    "old_rating": "4.28571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 head cauliflower, cored and cut into small florets",
        "2 tablespoons olive oil",
        "2 shallots, minced",
        "1/2 cup chicken stock",
        "salt and ground black pepper to taste",
        "1/2 pound fettuccine",
        "1 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 258 kcal",
        "Carbs > 33.5 g",
        "Cholesterol > 12 mg",
        "Fat > 9.3 g",
        "Protein > 11.8 g",
        "Sodium > 296 mg"
    ],
    "n": "Cauliflower Fettuccine Alfredo",
    "a": "tlcampbell",
    "r": "0",
    "s": 6,
    "des": "\"Dr. Oz recommended cauliflower sauce in place of Alfredo. A little cream, red pepper, and garlic can be added for flavor. Let me know if you have any suggestions to improve color or taste. Garnish with more Parmesan cheese if desired.\"",
    "ins": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower to steamer, cover, and steam until tender, about 20 minutes. Cool cauliflower until cool enough to handle, about 15 minutes.\nHeat olive oil in a skillet over medium heat; cook and stir shallot until translucent, about 10 minutes. Pour chicken stock over shallot; cook until heated through, about 3 minutes. Remove skillet from heat and cool, about 15 minutes.\nStir cauliflower into shallot mixture; blend using a hand blender until sauce is smooth and silky. Season sauce with salt and pepper.\nFill a large pot with lightly salted water and bring to a rolling boil. Stir in the fettuccine, bring water back to a boil, and cook pasta over medium heat until cooked through but still firm to the bite, about 8 minutes; drain.\nToss pasta with sauce in a bowl until evenly coated. Sprinkle Parmesan cheese over pasta.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "4229575.jpg",
    "o": "",
    "st": "allrecipes"
}