{
    "id": 238044,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "CriscoÂ® No-Stick Cooking Spray",
        "1 1/4 cups graham cracker crumbs",
        "6 tablespoons butter, melted",
        "1 (19.5 ounce) box PillsburyÂ® Family Size Chocolate Fudge Brownie Mix",
        "1/2 cup CriscoÂ® Pure Vegetable Oil",
        "1/4 cup water",
        "2 large eggs",
        "1 (14 ounce) can Eagle BrandÂ® Sweetened Condensed Milk",
        "1 (11.5 ounce) package milk chocolate chips",
        "1 (13 ounce) jar marshmallow creme",
        "1 cup miniature marshmallows"
    ],
    "nut": [
        "Calories > 231 kcal",
        "Carbs > 29.8 g",
        "Cholesterol > 20 mg",
        "Fat > 10.1 g",
        "Protein > 2 g",
        "Sodium > 110 mg"
    ],
    "n": "Fudgy S'mores Brownie Bars",
    "a": "Eagle brand",
    "r": "0",
    "s": 40,
    "des": "\"A rich fudgy brownie layer on a graham cracker crumb base is spread with creamy chocolate and a layer of marshmallow creme, dotted with mini marshmallows, and quickly browned under the broiler.\"",
    "ins": "Heat oven to 350 degrees F. Coat 13 x 9-inch baking pan with no-stick cooking spray. Combine graham cracker crumbs and butter in medium bowl, stirring until evenly moistened. Sprinkle 1 cup graham cracker mixture evenly into bottom of prepared pan. Prepare brownie batter according to package directions using oil, water and eggs. Spread over crumbs in pan. Bake 28 to 31 minutes or until set in center. Cool completely in pan on wire rack.\nMicrowave sweetened condensed milk and chocolate chips in medium microwave-safe bowl on HIGH 2 minutes. Stir until completely melted and smooth. Pour over brownie layer. Freeze until firm, about 1 hour.\nHeat broiler to HIGH. Spread marshmallow creme evenly over chocolate layer. Sprinkle evenly with remaining graham cracker crumbs. Sprinkle evenly with mini marshmallows. Broil 6 inches from heat 2 minutes or until lightly browned.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "3702432.jpg",
    "o": "",
    "st": "allrecipes"
}