{
    "id": 238157,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups rolled oats",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "2 eggs",
        "1/3 cup honey",
        "1/4 cup almond milk",
        "1 tablespoon coconut oil, or as desired",
        "1 teaspoon vanilla extract",
        "1 cup blueberries",
        "1 teaspoon coconut oil, or as needed"
    ],
    "nut": [
        "Calories > 345 kcal",
        "Carbs > 57.4 g",
        "Cholesterol > 93 mg",
        "Fat > 10.1 g",
        "Protein > 8.9 g",
        "Sodium > 401 mg"
    ],
    "n": "Blueberry Oatmeal Pancakes",
    "a": "TheLadyBrianna",
    "r": "0",
    "s": 4,
    "des": "\"I'm trying to eat less flour, but I also insist that my meals be tasty. After trying dozens of other people's recipes, I took ideas from all of them to create this. It's probably the most delicious thing I've ever had! By substituting out the eggs, it's easy to turn this into a vegan meal as well. Try a bite before topping with syrup, it's decadently yummy as-is! I make 'silver dollar' pancakes to take as snacks to potlucks.\"",
    "ins": "Process oats in a blender or food processor until the consistency of flour. Combine ground oats, cinnamon, baking powder, and salt in a bowl.\nWhisk eggs, honey, almond milk, 1 tablespoon coconut oil, and vanilla extract together in a separate bowl. Stir oat mixture into egg mixture until batter is well mixed; fold in blueberries.\nHeat 1 teaspoon coconut oil on a griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "1224708.jpg",
    "o": "4507371.jpg,4506966.jpg,4233161.jpg,4233155.jpg,3163928.jpg,2106490.jpg",
    "st": "allrecipes"
}