{
    "id": 23816,
    "old_rating": "4.63492",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (.25 ounce) package active dry yeast",
        "1 teaspoon sugar",
        "1/2 cup warm water (110 degrees F/45 degrees C)",
        "1 (12 fluid ounce) can evaporated milk",
        "1/4 cup warm water",
        "1/4 cup shortening, melted",
        "1/4 cup honey",
        "2 teaspoons salt",
        "6 cups bread flour",
        "2 tablespoons butter, melted"
    ],
    "nut": [
        "Calories > 184 kcal",
        "Carbs > 29.6 g",
        "Cholesterol > 7 mg",
        "Fat > 4.9 g",
        "Protein > 5.3 g",
        "Sodium > 218 mg"
    ],
    "n": "Blue Ribbon White Bread",
    "a": "Kristin Zaharias",
    "r": "0",
    "s": 24,
    "des": "\"This is a county fair 'blue ribbon' winning loaf that is very tender and creamy.\"",
    "ins": "In a small bowl, dissolve yeast and sugar in 1/2 cup warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, combine the yeast mixture with the evaporated milk, 1/4 cup water, shortening, honey, salt and 2 cups flour. Stir well to combine. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nPunch dough down and divide in half.  Roll out each half and roll into loaf shapes, sealing seams by pinching.  Place in buttered 9x5 inch bread pans.  Butter the tops of each loaf with melted butter; cover loosely with plastic wrap.  Let rise in warm area until doubled, about 30 minutes.\nPlace a small pan of hot water on the bottom shelf of the oven. Preheat oven to 375 degrees F (190 degrees C).\nUncover loaves and bake until tops are golden brown, about 25 to 35 minutes. Brush butter onto crusts while warm.  Slice when cool.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "2 h ",
    "i": "12699.jpg",
    "o": "3879067.jpg,3094987.jpg,2794854.jpg,2794851.jpg,2794794.jpg,2784347.jpg",
    "st": "allrecipes"
}