{
    "id": 238132,
    "old_rating": "4.5625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 skinless, boneless chicken breasts, cut into 20 pieces",
        "8 ounces Spanish chorizo, cut into 1/2 inch pieces",
        "1 tablespoon olive oil",
        "1 tablespoon sherry vinegar",
        "2 teaspoons chopped fresh oregano",
        "1 pinch cayenne pepper, or to taste",
        "salt and ground black pepper to taste",
        "1 red onion, cut into 1-inch squares",
        "1 red bell pepper, cut into 1-inch squares",
        "4 (12-inch) bamboo or metal skewers"
    ],
    "nut": [
        "Calories > 372 kcal",
        "Carbs > 5.6 g",
        "Cholesterol > 82 mg",
        "Fat > 26.6 g",
        "Protein > 26.1 g",
        "Sodium > 770 mg"
    ],
    "n": "Chorizo and Chicken Skewers",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"At some point this summer, you'll get tired of grilled chicken. No matter the marinade or the delivery system, you will simply reach your limit, and that's when you need to reach for the chorizo. Impale a few slices of this famously delicious Spanish sausage in between your chunks of chicken. As it grills it will splatter its spicy, smokey fat all over its much blander skewer-mate, and once again you and grilled chicken will be good buddies.\"",
    "ins": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nPlace chicken and chorizo in a large bowl; add olive oil, sherry vinegar, oregano, cayenne pepper, black pepper, and salt. Stir until chicken and chorizo are completely coated.\nThread chicken, chorizo, red onion, and red bell pepper evenly onto 4 skewers, making sure that each piece of chicken touches 1 piece of chorizo. Place finished skewers on a plate, cover with plastic wrap, and refrigerate until cold 15 to 30 minutes.\nCook on the preheated grill, turning occasionally, until chicken is cooked through, about 10 minutes.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "35 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}