{
    "id": 23813,
    "old_rating": "4.37391",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup orange juice",
        "1/2 cup dry white wine",
        "1/2 cup maple syrup",
        "2 teaspoons chopped fresh rosemary",
        "1/2 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "4 skinless, boneless chicken breast halves",
        "2 tablespoons butter",
        "2 tablespoons olive oil"
    ],
    "nut": [
        "Calories > 398 kcal",
        "Carbs > 33.9 g",
        "Cholesterol > 84 mg",
        "Fat > 14.2 g",
        "Protein > 27.8 g",
        "Sodium > 414 mg"
    ],
    "n": "Rosemary Chicken with Orange-Maple Glaze",
    "a": "LINDA W.",
    "r": "0",
    "s": 4,
    "des": "\"Chicken breasts adorned with a fresh rosemary rub, then sauteed and braised in a sauce of orange juice, white wine and maple syrup. This wonderfully rich glaze makes an elegant, quick dinner to serve to guests. To serve, place chicken on top of hot cooked rice on each plate and spoon sauce over the top. Wonderful served with steamed asparagus.\"",
    "ins": "Bring orange juice and wine to a boil in a small saucepan. Reduce heat slightly, but keep high enough to continue a low boil for 5 minutes, stirring occasionally. Stir in maple syrup and continue boiling for another 5 to 6 minutes, stirring frequently, until glossy and just slightly thickened. Set aside.\nIn a small bowl mix together the rosemary, salt and pepper. Rub mixture on both sides of chicken breasts, and set aside.\nMelt butter and olive oil in a large skillet over medium high heat. Add chicken breasts, cover skillet and saute for about 5 minutes on each side until lightly browned. Pour orange-maple mixture over chicken (mixture will boil and bubble). Reduce heat to simmer; cover and let cook for another 10 minutes, basting occasionally, until chicken is cooked through and sauce has turned into a rich, thick glaze.",
    "pt": "5 m",
    "ct": "30 m",
    "tt": "35 m",
    "i": "211765.jpg",
    "o": "4524012.jpg,4328271.jpg,4222547.jpg,3189200.jpg,3188700.jpg,2077165.jpg",
    "st": "allrecipes"
}