{
    "id": 238261,
    "old_rating": "4.69231",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/4 pounds russet potatoes, peeled and grated",
        "1/2 yellow onion, grated",
        "2 large eggs",
        "3 tablespoons all-purpose flour",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 pinch cayenne pepper",
        "1 cup vegetable oil for frying"
    ],
    "nut": [
        "Calories > 315 kcal",
        "Carbs > 52.1 g",
        "Cholesterol > 93 mg",
        "Fat > 8.3 g",
        "Protein > 9.3 g",
        "Sodium > 633 mg"
    ],
    "n": "Chef John's Classic Potato Pancakes",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"The one and only way to not get perfectly crispy potato pancakes is to not squeeze them properly. More than half the procedure was dedicated to grating, soaking, draining, and squeezing the potatoes. If you don't thoroughly squeeze all the liquid from the potatoes, the pancakes just won't crisp up as well. Top with thinly sliced smoked salmon, sour cream, and fresh dill.\"",
    "ins": "Place potatoes and onion into a large bowl and pour enough cold water in the bowl to cover by several inches. Let rest until potatoes and onion are completely soaked, 20 to 30 minutes. Pour potato mixture into a colander, rinse, drain, and squeeze repeatedly to remove all moisture.\nWhisk eggs, flour, salt, black pepper, and cayenne pepper together in a bowl until smooth.\nMix potato mixture and egg mixture together in a large bowl with a spatula.\nHeat 1/4-inch oil in a heavy skillet over medium-high heat. When oil shimmers, drop large spoonfuls of potato batter into hot oil and flatten with a spatula to about 1/2-inch thick. Cook until the edges of pancakes are golden brown and crispy, 3 to 5 minutes. Reduce heat to medium, flip pancakes, and cook until golden brown and crispy on the other side, about 5 minutes more. Repeat cooking process with remaining batter.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "45 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}