{
    "id": 238266,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup sliced almonds",
        "4 cups vegetable stock",
        "2 cups quinoa",
        "1 English cucumber, diced",
        "15 grape tomatoes, quartered",
        "1 bunch fresh flat-leaf parsley, stemmed and leaves finely chopped",
        "1 orange bell pepper, diced",
        "3/4 cup crumbled feta cheese",
        "1/2 cup raisins",
        "1/4 cup chopped black olives",
        "4 scallions, white and light green parts, chopped",
        "1/2 cup fresh lemon juice",
        "1/2 cup olive oil"
    ],
    "nut": [
        "Calories > 282 kcal",
        "Carbs > 30.2 g",
        "Cholesterol > 8 mg",
        "Fat > 15.4 g",
        "Protein > 7.5 g",
        "Sodium > 292 mg"
    ],
    "n": "Veggie, Almond, and Raisin Quinoa Salad",
    "a": "misspia",
    "r": "0",
    "s": 12,
    "des": "\"The original recipe is from a friend, and I modified it by adding some ingredients to the recipe. Since it has an abundance of goodness in it, I'll often eat it alone as a meal. I've also served this as a side dish with bbq chicken or lamb shish-kabobs.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spread almonds onto a baking sheet.\nBake almonds in the preheated oven until lightly toasted and fragrant, 5 to 10 minutes.\nBring vegetable stock and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and stock has been absorbed, 15 to 20 minutes. Transfer quinoa to a bowl and refrigerate until chilled, about 30 minutes.\nMix almonds, cucumber, tomatoes, parsley, orange bell pepper, feta cheese, raisins, olives, and scallions into quinoa.\nWhisk lemon juice and olive oil together in a bowl; pour over quinoa mixture and stir until quinoa mixture is coated.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "1201375.jpg",
    "o": "",
    "st": "allrecipes"
}