{
    "id": 238260,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons olive oil, divided, or as needed",
        "1/2 cup diced onion",
        "1/2 cup diced red bell pepper",
        "salt and ground black pepper to taste",
        "6 ounces spicy Italian sausage, removed from casings and crumbled",
        "4 ounces calamari tentacles, minced",
        "1/4 cup chopped fresh flat-leaf parsley",
        "1 large egg",
        "1/8 teaspoon smoked paprika",
        "1 1/2 pounds cleaned calamari tubes",
        "18 toothpicks, or as needed"
    ],
    "nut": [
        "Calories > 228 kcal",
        "Carbs > 7.9 g",
        "Cholesterol > 236 mg",
        "Fat > 13.5 g",
        "Protein > 17.8 g",
        "Sodium > 399 mg"
    ],
    "n": "Grilled Sausage-Stuffed Calamari",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"I usually go out of my way to simplify the recipes we post here, but for some things, like this Spanish-inspired, sausage-stuffed calamari recipe, there just are no acceptable shortcuts to take. However, your efforts will be rewarded with something that tastes every bit the effort it took to make. Serve with lemon wedges.\"",
    "ins": "Heat 1 tablespoon olive oil in a skillet over medium heat. Cook and stir onion and red pepper with a pinch of salt in hot oil until onion is soft and translucent, 5 to 7 minutes. Remove from heat and cool to room temperature.\nStir sausage, minced tentacles, onion mixture, parsley, egg, smoked paprika, salt, and pepper together in a bowl until evenly combined. Transfer mixture to a piping bag.\nPipe sausage mixture into tubes, filling about each tube about 2/3 full. Thread a toothpick through the top of each tube to fasten the opening together. Place stuffed tubes on a plate, cover the plate with plastic wrap, and refrigerate until completely chilled, about 1 hour.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nBrush tubes with remaining olive oil to coat on all sides and season with salt.\nCook stuffed calamari on the preheated grill, turning occasionally, until stuffing is cooked through, 10 to 12 minutes. An instant-read thermometer inserted into the center should read at least 155 degrees F (68 degrees C).",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}