{
    "id": 238215,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 skinless, boneless chicken breast halves",
        "water to cover",
        "1/4 cup grated Parmesan cheese",
        "2 cloves garlic, chopped",
        "1 small onion, chopped",
        "1 (4 ounce) can chopped green chile peppers",
        "1 clove garlic, chopped",
        "1 (8 ounce) package cream cheese",
        "2 cups shredded Mexican cheese blend, divided",
        "2 tablespoons olive oil",
        "6 corn tortillas, or as needed",
        "1 (28 ounce) can green enchilada sauce",
        "8 ounces sour cream",
        "2 tablespoons milk, or as needed"
    ],
    "nut": [
        "Calories > 696 kcal",
        "Carbs > 26 g",
        "Cholesterol > 171 mg",
        "Fat > 51.5 g",
        "Protein > 35.2 g",
        "Sodium > 815 mg"
    ],
    "n": "Linda's Enchiladas (Revised)",
    "a": "Debra Tiihonen",
    "r": "0",
    "s": 6,
    "des": "\"Linda's enchiladas are kicked up a notch!\"",
    "ins": "Place chicken in a large skillet and pour in enough water to cover; add Parmesan cheese and 2 chopped cloves of garlic. Bring water to a boil and cook until chicken is no longer pink in the center, about 28 minutes. Remove skillet from heat, reserving 1/2 cup water mixture from the skillet. Transfer chicken to a work surface and shred using 2 forks.\nCombine onion, green chile peppers, and 1 chopped clove of garlic in a pot; add cream cheese and 1 cup Mexican cheese blend. Cook and stir mixture over medium heat until cream cheese is melted, 3 to 4 minutes. Slowly pour the reserved 1/2 cup water mixture from chicken over cream cheese mixture, while continuously stirring until mixture is smooth. Remove pot from heat and stir shredded chicken into cream cheese sauce.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat oil in a skillet over medium-low heat. Place tortillas in the hot oil, working in batches, until warmed, about 30 seconds per side. Spoon 1 to 2 tablespoons cream cheese-chicken sauce down the center of each warmed tortilla; roll tortilla around filling.\nPour enough green enchilada sauce to cover the bottom of a 9x13-inch baking dish. Arrange filled tortillas in the enchilada sauce. Pour remaining enchilada sauce over filled tortillas.\nMix sour cream and milk together in a bowl until thin enough to pour. Pour sour cream mixture over filled tortillas; top with remaining Mexican cheese blend.\nBake in the preheated oven until heated through and cheese is melted and bubbling, 20 to 25 minutes.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "2787122.jpg",
    "o": "",
    "st": "allrecipes"
}