{
    "id": 238323,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter, softened",
        "1 cup granular no-calorie sucralose sweetener (such as SplendaÂ®)",
        "1/2 cup brown sugar replacement (such as SplendaÂ® Brown Sugar Blend)",
        "2 eggs",
        "2 tablespoons milk",
        "1 1/2 teaspoons vanilla extract",
        "1 1/2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "4 cups whole oats",
        "1 cup blueberries",
        "1/2 cup sliced almonds"
    ],
    "nut": [
        "Calories > 98 kcal",
        "Carbs > 9.6 g",
        "Cholesterol > 21 mg",
        "Fat > 5.8 g",
        "Protein > 2.1 g",
        "Sodium > 94 mg"
    ],
    "n": "Almond-Blueberry Oatmeal De-lites",
    "a": "Walter Moline",
    "r": "0",
    "s": 42,
    "des": "\"Wanted to come up with a new cookie using sugar substitutes that were fun and flavorful. Starting with a basic oatmeal cookie recipe, I decided to add blueberries and almond slices instead of raisins and chocolate chips. First time I ever made them, and they look, smell, and taste amazing.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nBeat butter, sucralose sweetener, and brown sugar replacement together with an electric mixer in a large bowl until smooth. Beat 1 egg into butter mixture. Beat last egg into mixture along with milk and vanilla extract.\nMix flour, baking soda, and salt together in a bowl; add to butter mixture and beat. Fold oats, blueberries, and sliced almonds into the dough.\nHeat baking sheets in preheated oven until slightly warmed.\nDrop dough by rounded teaspoonful two inches apart onto warmed baking sheets.\nBake in preheated oven until edges start to turn golden brown, 13 to 15 minutes. Let cookies cool on baking sheet for five minutes before removing to wire cooling racks to cool completely.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "1280718.jpg",
    "o": "",
    "st": "allrecipes"
}