{
    "id": 238314,
    "old_rating": "4.89474",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 slices bacon, chopped",
        "1 potato, peeled and sliced into thin 1-inch pieces",
        "2 tablespoons water, or as needed",
        "1 clove garlic, thinly sliced",
        "1/2 teaspoon red pepper flakes",
        "salt and ground black pepper to taste",
        "1 bunch Swiss chard, chopped",
        "8 eggs, beaten",
        "1/3 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 150 kcal",
        "Carbs > 6.6 g",
        "Cholesterol > 196 mg",
        "Fat > 8.9 g",
        "Protein > 11.2 g",
        "Sodium > 342 mg"
    ],
    "n": "Bacon and Potato Frittata with Greens",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"This is a wonderful meal anytime of day or night. My grandfather used to make frittatas quite often. Instead of finishing a frittata under the broiler he would cook it halfway, put a plate on top of the pan, flip the pan over, and slide the frittata back into the pan to cook the other side. Sometimes a frittata would stick; other times the hot oil would drip on him as he performed this maneuver. It was during these moments that I learned all the really good Italian curse words I still use to this day.\"",
    "ins": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\nCook and stir bacon in a large oven-proof skillet over medium heat until evenly browned and crispy, about 10 minutes. Drain all but 1 teaspoon bacon grease from the skillet.\nStir potato slices, water, garlic, red pepper flakes, salt, and black pepper into bacon; cover the skillet with a lid and cook until potatoes are tender, about 10 minutes.\nMix Swiss chard into potato mixture; cook and stir until chard is slightly wilted, 2 to 3 minutes.\nPour eggs over potato-chard mixture, stir gently, and remove skillet from heat. Top egg mixture with Parmesan cheese.\nBroil in the preheated oven until eggs are set and frittata is golden brown around the edges, 3 to 4 minutes.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "35 m",
    "i": "4531057.jpg",
    "o": "4531057.jpg,4511212.jpg,4465017.jpg,4461572.jpg,3929234.jpg,3265796.jpg",
    "st": "allrecipes"
}