{
    "id": 238387,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups fresh blackberries",
        "2 tablespoons white sugar",
        "1 teaspoon vanilla extract",
        "Batter:",
        "1 1/4 cups all-purpose flour",
        "3/4 cup white sugar",
        "1/2 cup almond meal",
        "2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "1 pinch ground cinnamon",
        "1 cup milk",
        "7 tablespoons butter, divided",
        "3 tablespoons sliced almonds, or to taste"
    ],
    "nut": [
        "Calories > 339 kcal",
        "Carbs > 45.8 g",
        "Cholesterol > 29 mg",
        "Fat > 15.8 g",
        "Protein > 5.8 g",
        "Sodium > 282 mg"
    ],
    "n": "Chef John's Blackberry Buckle",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"This type of rustic dessert is called a buckle because the fruit sinks into the buttery batter as it bakes and 'buckles' the surface with its juicy weight. I was going to tell you to use any berry you want, but I changed my mind. This really needs to be done with blackberries. I added a handful of almond meal, since I had it around, and I think almonds and blackberries have a thing for one another.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nStir blackberries, 2 tablespoons sugar, and vanilla extract together in a bowl; let rest, 15 to 20 minutes.\nWhisk flour, 3/4 cup sugar, almond meal, baking powder, salt, and cinnamon together in a bowl. Stir milk into flour mixture until batter is just combined.\nMelt 6 tablespoons butter in a skillet over medium-high heat; pour into the bottom of a 8x12-inch baking dish. Pour batter over melted butter into the baking dish, using a spatula to gently distribute batter without mixing it into the butter, leaving a 1-inch butter border around the sides of the dish.\nScatter blackberries over the batter and spoon any accumulated blackberry juices over the top.\nBake buckle in the preheated oven until crisped and browned around the edges, about 1 hour.\nMelt remaining butter in a small skillet over medium-high heat. Cook and stir almonds in hot butter until golden brown and toasted, 2 to 3 minutes. Sprinkle toasted almonds over blackberry buckle and cool buckle to room temperature.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4533035.jpg",
    "o": "4533035.jpg,4519813.jpg,4161467.jpg,3892243.jpg,3065260.jpg,2494369.jpg",
    "st": "allrecipes"
}