{
    "id": 238318,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cake:",
        "1 (15.25 ounce) package yellow cake mix",
        "4 eggs",
        "1 (5.1 ounce) package instant vanilla pudding mix",
        "1/2 cup water",
        "1/2 cup pineapple juice",
        "1/2 cup vegetable oil",
        "1 tablespoon poppy seeds",
        "Sauce:",
        "1 cup sugar",
        "1 cup butter",
        "1/4 cup pineapple juice",
        "3 tablespoons confectioners' sugar for dusting"
    ],
    "nut": [
        "Calories > 390 kcal",
        "Carbs > 45.1 g",
        "Cholesterol > 72 mg",
        "Fat > 22.8 g",
        "Protein > 2.8 g",
        "Sodium > 404 mg"
    ],
    "n": "Grandma Cathy's Pineapple Poppy Seed Cake",
    "a": "sam0703",
    "r": "0",
    "s": 16,
    "des": "\"I have been making this cake for over twenty years now. It is a family and friend-favorite. This cake is extremely moist and very rich.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10-inch fluted tube pan (such as Bundt(R)).\nBeat yellow cake mix, eggs, instant pudding mix, water, pineapple juice, oil and poppy seeds together in a large bowl; pour into prepared pan.\nBake in preheated oven until a toothpick inserted into the center of the cake comes out clean, about 45 minutes.\nRemove cake from oven, rest on wire cooling rack. Run knife between cake and sides of pan to release. Using a skewer, poke holes in the cake at 1/2-inch intervals. Pour sauce over cake and let rest in pan for 45 minutes to cool.\nStir sugar, pineapple juice, and butter together in a saucepan over medium heat until the butter melts, 1 to 2 minutes; bring to a boil and cook for 1 minute more. Remove saucepan from heat and pour sauce over the cake.\nLet cake cool and absorb the sauce at room temperature for at least 45 minutes.\nRemove cake from pan and dust with confectioners' sugar.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "1322262.jpg",
    "o": "",
    "st": "allrecipes"
}