{
    "id": 238361,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds beef top sirloin, trimmed and cut into bite-size pieces",
        "2 tablespoons blackened seasoning (such as Chef Paul Prudhomme'sÂ® Blackened Steak MagicÂ®), or more to taste",
        "2 tablespoons vegetable oil",
        "Blue Cheese Sauce:",
        "1 (3 ounce) package cream cheese",
        "3 tablespoons evaporated milk",
        "8 ounces blue cheese crumbles",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon ground white pepper",
        "1/4 teaspoon cayenne pepper"
    ],
    "nut": [
        "Calories > 288 kcal",
        "Carbs > 2.6 g",
        "Cholesterol > 72 mg",
        "Fat > 20.7 g",
        "Protein > 22.3 g",
        "Sodium > 820 mg"
    ],
    "n": "Blackened Steak Bites with Blue Cheese Sauce",
    "a": "amym",
    "r": "0",
    "s": 8,
    "des": "\"This recipe is similar to an appetizer served at my favorite Italian restaurant. It is a nice change from the usual appetizers and always gets rave reviews! I have used tenderloin in the past, but have found that a good quality top sirloin works very well and is less expensive. Bernaise sauce is a good alternative if you don't like blue cheese.\"",
    "ins": "Season sirloin with blackened seasoning to coat on all sides.\nHeat oil in a cast-iron skillet on an outdoor grill until the oil is smoking. Cook steak bites in hot oil in small batches, reheating oil between batches, until slightly crusty, 1 to 2 minutes per side.\nStir cream cheese and evaporated milk together in a saucepan over low heat to melt the cream cheese. Whisk blue cheese crumbles, garlic powder, white pepper, and cayenne pepper into the cream cheese mixture; simmer, stirring frequently, until the blue cheese melts into a smooth sauce, 2 to 3 minutes. Serve blue cheese sauce with the beef bites.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "20 m",
    "i": "3833664.jpg",
    "o": "",
    "st": "allrecipes"
}