{
    "id": 238321,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds extra lean ground beef",
        "1 tablespoon minced garlic, or more to taste",
        "1 cup chopped green bell pepper",
        "1 cup chopped red onion",
        "1 cup chopped carrot",
        "1 cup chopped zucchini",
        "1 cup chopped celery",
        "1 tablespoon ground cumin",
        "1 tablespoon chili powder",
        "1 1/2 teaspoons dried oregano",
        "1 1/2 teaspoons ground coriander",
        "1/4 teaspoon ground black pepper, or to taste",
        "1 (28 ounce) can diced tomatoes",
        "1 (14 ounce) can whole kernel corn, drained",
        "1 (10.75 ounce) can condensed tomato soup",
        "1 (4.5 ounce) can sliced mushrooms, drained",
        "1/4 cup barbeque sauce",
        "1 package taco seasoning mix, or to taste",
        "1 (19 ounce) can black beans, drained and rinsed",
        "1 (19 ounce) can garbanzo beans, drained and rinsed",
        "1 (19 ounce) can red kidney beans, drained and rinsed",
        "1 (15 ounce) can baked beans in tomato sauce",
        "1/2 cup chopped fresh cilantro, or to taste",
        "1 tablespoon lime juice"
    ],
    "nut": [
        "Calories > 467 kcal",
        "Carbs > 63.4 g",
        "Cholesterol > 47 mg",
        "Fat > 12 g",
        "Protein > 28.7 g",
        "Sodium > 1488 mg"
    ],
    "n": "Grey Cup Chili",
    "a": "LINDA BAKER",
    "r": "0",
    "s": 10,
    "des": "\"Hearty three-bean chili with vegetables. \nServed with thick slices of garlic bread, it's a Grey Cup party staple.\"",
    "ins": "Cook and stir ground beef and garlic in a large non-stick pot over medium-high heat until beef is no longer pink, about 10 minutes. Stir bell pepper, red onion, carrot, zucchini, and celery into beef mixture; cook and stir until vegetables soften, about 5 minutes.\nStir cumin, chili powder, oregano, coriander, and black pepper into beef mixture; cook for 1 minute. Stir tomatoes, corn, tomato soup, mushrooms, barbecue sauce, and taco seasoning into chili; bring to a boil. Reduce heat to low; cover and simmer, stirring occasionally, for 20 minutes.\nStir black beans, garbanzo beans, kidney beans, and baked beans into chili; simmer until heated through, about 15 minutes. Remove chili from heat; stir in cilantro and lime juice.",
    "pt": "30 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "3089580.jpg",
    "o": "",
    "st": "allrecipes"
}