{
    "id": 23834,
    "old_rating": "4.50108",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 ounces fettuccini pasta",
        "1/2 cup butter",
        "5 cloves garlic, chopped",
        "1 cup heavy cream",
        "1 egg yolk",
        "2 cups freshly grated Parmesan cheese",
        "2 tablespoons dried parsley"
    ],
    "nut": [
        "Calories > 854 kcal",
        "Carbs > 55.9 g",
        "Cholesterol > 231 mg",
        "Fat > 59.4 g",
        "Protein > 27.2 g",
        "Sodium > 807 mg"
    ],
    "n": "Fettuccine Alfredo V",
    "a": "Greg",
    "r": "0",
    "s": 4,
    "des": "\"The absolute best Alfredo sauce. You do not want to use a grated parmesan that you buy on a shelf.  When you cook with that type, your Alfredo goes from a sauce to a gooey mess.  You want to buy a very good and very hard parmesan in triangle form.  Also,  make sure the cream doesn't boil too much or there will not be enough liquid to make the Alfredo sauce smooth.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Add fettucine pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large skillet melt the butter and add the chopped garlic.  Cook on low for about 5 minutes, stirring often, making sure not to burn the garlic.\nPour about a 1/4 cup of the heavy cream into a small bowl.  Add the egg yolk and beat together; put aside.  Pour the remaining cream into the frying pan.  Increase the heat to medium-high.   As the cream starts to boil, mix rapidly using a whisk.  Slowly add the cream/egg mixture.  You do not want the egg to curdle.  Continue whisking until well blended.\nAdd 1 cup of the Parmesan cheese and continue to mix the cream.  Pour in the remaining Parmesan and the parsley, mix until smooth.  Immediately remove from stove. Serve over cooked pasta.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "20 m",
    "i": "16208.jpg",
    "o": "4529501.jpg,3943607.jpg,3840348.jpg,3690792.jpg,3638598.jpg,3628495.jpg",
    "st": "allrecipes"
}