{
    "id": 238396,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound rigatoni",
        "1/2 pound Italian sausage, casings removed and broken into chunks",
        "1/4 cup extra virgin olive oil",
        "1/2 cup minced yellow onion",
        "1 red bell pepper, sliced",
        "2 cloves garlic, minced",
        "1/4 cup dry white wine",
        "4 cups canned diced tomatoes, undrained",
        "1 pinch red pepper flakes",
        "salt and ground black pepper to taste",
        "1/4 cup grated Romano cheese",
        "2 tablespoons chopped fresh basil",
        "4 ounces crumbled goat cheese"
    ],
    "nut": [
        "Calories > 883 kcal",
        "Carbs > 98.1 g",
        "Cholesterol > 52 mg",
        "Fat > 37.9 g",
        "Protein > 33.7 g",
        "Sodium > 1095 mg"
    ],
    "n": "Mama's Goat Cheese Rigatoni",
    "a": "Celeste",
    "r": "0",
    "s": 4,
    "des": "\"Rigatoni mixed with chunks of Italian sausage, bell peppers, and garlic and topped with crumbled goat cheese makes this pasta dish a wonderful treat for the taste buds!\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook rigatoni in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 13 minutes; drain.\nHeat olive oil in a large pot over medium heat. Cook and stir sausage in the hot oil until lightly browned, 5 to 7 minutes. Add onion, red bell pepper, and garlic to sausage mixture; cook and stir until peppers are tender, 5 to 10 minutes.\nStir white wine into sausage mixture; bring to a simmer and cook until slightly reduced, 3 to 5 minutes. Add tomatoes, red pepper flakes, salt, and black pepper; bring to a boil, reduce heat to medium-low, and simmer, stirring frequently, until sauce thickens, 10 to 15 minutes.\nMix rigatoni, Romano cheese, and fresh basil into sausage mixture; bring to a simmer and cook until cheese melts and flavors blend, about 3 minutes. Ladle into bowls and top with goat cheese.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}