{
    "id": 238499,
    "old_rating": "4.19231",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound beef flank steak, trimmed of fat",
        "1/4 cup lime juice",
        "1 tablespoon vegetable oil",
        "1 tablespoon chili powder",
        "1/2 teaspoon salt",
        "1/4 teaspoon cayenne pepper",
        "Reynolds WrapÂ® Heavy Duty Aluminum Foil",
        "2 red, yellow or green sweet peppers (or combination), thinly sliced",
        "1 medium onion, thinly sliced",
        "2 cloves garlic, minced",
        "8 (6- to 7-inch) flour tortillas",
        "Guacamole, salsa, and/or sour cream (optional)"
    ],
    "nut": [
        "Calories > 404 kcal",
        "Carbs > 42 g",
        "Cholesterol > 36 mg",
        "Fat > 17.2 g",
        "Protein > 20 g",
        "Sodium > 757 mg"
    ],
    "n": "Easy Flank Steak Fajitas",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 4,
    "des": "\"Marinated steak strips and flavorful veggies make a delicious fajita filling--perfect for busy weeknight dinners.\"",
    "ins": "Place steak in a large resealable plastic bag. Add lime juice, vegetable oil, chili powder, salt, and cayenne pepper to the steak in bag. Seal bag; turn to coat steak.\nMarinate in the refrigerator 30 minutes to 1 hour.\nPreheat oven to 400 degrees F. Drain meat; discard marinade. Center meat on a sheet (12x18 inches) of Reynolds Wrap(R) Heavy Duty Aluminum Foil. Bring up foil sides. Double fold top and ends to seal packet, leaving room for heat circulation inside. Center sweet peppers, onion, and garlic on another sheet (12x18 inches) of heavy duty aluminum foil. Repeat steps above to make another foil packet.\nWrap tortillas tightly in heavy duty aluminum foil.\nBake meat and vegetable foil packets 30 to 35 minutes or until meat is desired doneness (145 degrees F for medium rare) and vegetables are tender, adding tortillas to the oven for the last 10 minutes of baking or until heated through.\nOpen packets carefully by cutting along top fold with a sharp knife, allowing steam to escape; then open top of foil packet. Thinly slice the meat.\nFill warm tortillas with meat and pepper mixture to serve. If desired, top with guacamole, salsa, and/or sour cream.",
    "pt": "25 m",
    "ct": "",
    "tt": "",
    "i": "1238005.jpg",
    "o": "",
    "st": "allrecipes"
}