{
    "id": 238443,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 large onion, minced",
        "5 slices thick-cut reduced-sodium bacon, chopped",
        "1 stalk celery, minced",
        "2 cloves garlic, minced",
        "1 sprig fresh rosemary, leaves stripped and finely chopped",
        "1 red squash - peeled, seeded, and cubed",
        "1 large carrot, peeled and minced",
        "1/2 teaspoon paprika",
        "1/4 teaspoon cayenne pepper",
        "1 gallon chicken stock, or more as needed",
        "salt and freshly ground black pepper to taste"
    ],
    "nut": [
        "Calories > 193 kcal",
        "Carbs > 21.7 g",
        "Cholesterol > 12 mg",
        "Fat > 10 g",
        "Protein > 7.4 g",
        "Sodium > 1960 mg"
    ],
    "n": "Simple Pumpkin Soup",
    "a": "JULIE in NL",
    "r": "0",
    "s": 6,
    "des": "\"A simple, comforting, and delicious pumpkin squash soup. Drizzle heavy whipping cream over soup and sprinkle finely chopped celery leaves and finely sliced green onion for garnish.\"",
    "ins": "Heat a large soup pot over medium-low heat; add olive oil and heat until it starts to smoke. Decrease heat to low and add onion, bacon, celery, garlic, and rosemary to the hot oil. Cover pot with a lid and cook until onion is tender and bacon is cooked through, 3 to 5 minutes.\nMix squash, carrot, paprika, and cayenne pepper into onion-bacon mixture; return lid and increase heat to medium-low. Cook squash mixture, stirring occasionally, until squash is softened and nearly cooked through, about 20 minutes.\nPour chicken stock over squash mixture and increase heat to medium-high; cook until squash is cooked through, about 10 minutes more. Remove pot from heat and cool soup slightly, 2 to 3 minutes.\nBlend soup using an immersion blender until smooth; season with salt and pepper. Add more chicken stock for a thinner soup.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "1341138.jpg",
    "o": "",
    "st": "allrecipes"
}