{
    "id": 238402,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 jalapeno pepper, seeded",
        "1 habanero pepper, seeded",
        "4 cloves garlic",
        "2 tablespoons vegetable oil",
        "2 tablespoons sherry vinegar",
        "2 tablespoons mayonnaise",
        "2 teaspoons salt",
        "2 Cornish game hens, halved lengthwise",
        "1 pinch salt to taste"
    ],
    "nut": [
        "Calories > 417 kcal",
        "Carbs > 1.6 g",
        "Cholesterol > 154 mg",
        "Fat > 33.3 g",
        "Protein > 26 g",
        "Sodium > 1277 mg"
    ],
    "n": "Chef John's Grilled Game Hens",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"The idea for these grilled game hens is borrowed from my highly successful Cornell chicken experiments, and uses a similar acid/salt/oil/egg concoction. This time the part of egg is played by mayo. Needless to say, you can season this a million ways and use any combination of hot chilies, but the little kick the habanero adds is really nice.\"",
    "ins": "Blend jalapeno pepper, habanero pepper, garlic, vegetable oil, sherry vinegar, mayonnaise, and 2 teaspoons salt together in a blender until marinade is smooth.\nPlace halved hens in a large bowl. Pour marinade over the chickens and turn to coat completely. Cover the bowl with plastic wrap and marinate in the refrigerator for 3 hours.\nPreheat an outdoor grill for medium heat and lightly oil the grate.\nRemove hens from marinade, shaking off any excess, place hens on a plate, skin-side up. Discard remaining marinade. Season skin-side of hens with salt.\nCook hens on the preheated grill, turning occasionally, until skin is crisped, meat is no longer pink at the bone, and juices run clear, about 45 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C).",
    "pt": "10 m",
    "ct": "45 m",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}