{
    "id": 238459,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2/3 cup 1/2-inch butternut squash cubes",
        "1/2 cup chopped cauliflower",
        "1/2 cup chopped broccoli",
        "1/2 cup raw walnuts",
        "1/4 cup raw almonds",
        "1/4 cup raw sunflower seed kernels",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground cumin",
        "1/8 teaspoon ground black pepper",
        "1 tablespoon vegetable oil"
    ],
    "nut": [
        "Calories > 250 kcal",
        "Carbs > 9.9 g",
        "Cholesterol > 0 mg",
        "Fat > 22.4 g",
        "Protein > 6.9 g",
        "Sodium > 301 mg"
    ],
    "n": "Cheryl's Veggie-Nut Patties",
    "a": "CS22",
    "r": "0",
    "s": 4,
    "des": "\"Vegan, gluten-free, and paleo-friendly veggie burger patties with a nutty taste. \n\nI came up with this recipe when I had a hard time finding any recipes for veggie burgers or patties that were grain-free and bean-free, and which actually contained vegetables. Both my husband and I love it. He had his on a burger bun with lettuce, avocado, and tomato.\"",
    "ins": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add butternut squash cubes, cover, and steam until tender, 7 to 10 minutes. Transfer squash to a bowl and mash; measure 1/2 cup mashed squash and reserve.\nPlace the steamer insert back into the saucepan and refill with water to reach just below the bottom of the steamer. Bring water to a boil. Add cauliflower and broccoli, cover, and steam until tender, 2 to 6 minutes.\nProcess walnuts, almonds, and sunflower seeds together in a blender or food processor until mixture resembles coarse breadcrumbs. Add broccoli and cauliflower, blend until finely chopped and incorporated.\nBlend 1/2 cup mashed squash, salt, cumin, and black pepper into the nuts mixture until well-mixed. If mixture is too thick to process, transfer it to a bowl and mix by hand.\nDivide mixture into 4 equal portions and shape into patties.\nHeat oil in a large skillet over medium-high heat. Cook patties in hot oil until browned and heated through, about 2 minutes per side.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "1323244.jpg",
    "o": "",
    "st": "allrecipes"
}