{
    "id": 238425,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (6 ounce) package wild rice (such as Uncle Ben's Â®)",
        "3 cups water",
        "6 yellow squash, halved lengthwise",
        "1 splash olive oil, or to taste",
        "2 small summer squash, diced",
        "2 bell peppers, or more to taste, diced",
        "2 cucumbers, diced",
        "1 onion, diced",
        "3 cherry or grape tomatoes, or more to taste",
        "1 cup shredded Gouda cheese"
    ],
    "nut": [
        "Calories > 261 kcal",
        "Carbs > 39.8 g",
        "Cholesterol > 23 mg",
        "Fat > 7.4 g",
        "Protein > 12.9 g",
        "Sodium > 179 mg"
    ],
    "n": "Stuffed Yellow Summer Squash",
    "a": "crys",
    "r": "0",
    "s": 6,
    "des": "\"I grew everything here in my garden; it was from the first harvest, so it was a lot cheaper on the budget, because we all know fresh fruit and veggies can get expensive. All in all, we had a great time cooking our 'own' food. Even my 4-year-old had fun helping. You can add sausage to the rice just to give a little extra kick.\"",
    "ins": "Bring water and wild rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender, 30 to 45 minutes. Drain excess liquid, fluff rice with a fork, and cook uncovered for 5 minutes more.\nPreheat oven to 350 degrees F (175 degrees C).\nArrange yellow squash halves onto a baking sheet.\nBake yellow squash in preheated oven until tender, about 20 minutes.\nHeat olive oil in a large skillet over medium-high heat. Saute summer squash, bell peppers, cucumbers, onion, and tomatoes in hot oil until tender, about 5 minutes.\nMound rice atop each of the squash halves. Top rice with a portion of the sauteed vegetable mixture.\nReturn squash to preheated oven and bake for 30 minutes more. Sprinkle Gouda cheese over the stuffed squash halves and bake until the cheese is melted, about 5 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}