{
    "id": 238470,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon peanut oil",
        "2 tablespoons minced garlic",
        "1 bunch fresh spinach, coarsely chopped",
        "1 bunch arugula, coarsely chopped",
        "1 bunch radish greens, coarsely chopped",
        "3 tablespoons butter",
        "1/4 cup all-purpose flour",
        "1 cup vegetable broth, divided",
        "1 cup skim milk",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 147 kcal",
        "Carbs > 13.4 g",
        "Cholesterol > 16 mg",
        "Fat > 8.8 g",
        "Protein > 6.1 g",
        "Sodium > 202 mg"
    ],
    "n": "No Basil Pesto",
    "a": "janed",
    "r": "0",
    "s": 6,
    "des": "\"We don't eat basil due to allergies and have found this to be an excellent replacement to a favorite way to serve pasta. We grow our own radishes, and this is a one way to not waste these nutritional greens. I imagine you could pick up radishes from farmers markets, but you will want to cook the greens asap and store as puree in the fridge. Serve pesto over your pasta of choice (homemade fettuccine is perfect) and top with Parmesan cheese.\"",
    "ins": "Heat peanut oil in a large skillet over medium heat; cook and stir garlic until fragrant, about 1 minute. Add spinach, arugula, and radish greens to garlic; cook and stir until greens are completely cooked and wilted, working in batches if needed, 5 to 10 minutes. Drain any excess water from greens.\nBlend greens mixture in a food processor until pureed into 1 1/2 to 2 cups.\nMelt butter in a saucepan over medium heat; cook and stir 1/2 cup pureed greens until warmed, 2 to 3 minutes. Stir flour into pureed greens in the saucepan; slow pour in 1/2 of the broth while whisking until smooth. Bring pureed greens-broth mixture to a boil and cook until heated through, adding more broth if it looks too dry, about 3 minutes.\nStir milk, remaining broth, and remaining pureed greens into greens-broth mixture and cook until heated through, 1 to 2 minutes; season with salt and pepper.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "1242797.jpg",
    "o": "",
    "st": "allrecipes"
}