{
    "id": 238404,
    "old_rating": "4.9",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup cherry tomato halves",
        "1/4 cup balsamic vinegar",
        "1/4 cup extra virgin olive oil",
        "2 tablespoons thinly sliced basil",
        "1 pinch cayenne pepper",
        "salt and freshly ground black pepper to taste",
        "6 slices French bread",
        "1 tablespoon olive oil",
        "2 swordfish steaks",
        "1 teaspoon grapeseed oil"
    ],
    "nut": [
        "Calories > 749 kcal",
        "Carbs > 50.5 g",
        "Cholesterol > 53 mg",
        "Fat > 44.2 g",
        "Protein > 36.6 g",
        "Sodium > 702 mg"
    ],
    "n": "Chef John's Grilled Swordfish Bruschetta",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"There are two keys to this recipe. First, add enough oil and vinegar to your tomatoes to make a good amount of 'sauce' with which to douse the grilled fish and bread. Second, grill the bread very well over the coals. It should be golden brown with distinctive charred grill marks. The bitter hit from these stripes of charred bread actually makes the tomatoes even sweeter and more delicious.\"",
    "ins": "Stir tomatoes, balsamic vinegar, extra virgin olive oil, basil, cayenne pepper, salt, and black pepper together in a bowl. Let sit until flavors blend, at least 30 minutes.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate. Brush bread slices with olive oil.\nCook bread slices on the preheated grill until browned and crispy, 2 to 3 minutes per side.\nBrush swordfish steaks with grapeseed oil and season with salt and black pepper.\nCook swordfish steaks on the preheated grill until fish flakes easily with a fork, about 4 minutes per side.\nDivide bread slices between two plates and top each plate with 1 swordfish steak. Spoon 1/2 of the cherry tomato mixture over each steak.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}