{
    "id": 23846,
    "old_rating": "3.98137",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 eggs",
        "2 3/4 cups macaroni",
        "1/2 (10 ounce) package frozen English peas",
        "2 (5 ounce) cans tuna, drained",
        "3 tablespoons mayonnaise",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 342 kcal",
        "Carbs > 40.8 g",
        "Cholesterol > 108 mg",
        "Fat > 9.5 g",
        "Protein > 22.1 g",
        "Sodium > 220 mg"
    ],
    "n": "Cold Macaroni and Tuna Salad",
    "a": "HSTR",
    "r": "0",
    "s": 6,
    "des": "\"This is a simple and good recipe that is great served on those hot summer days and can even be prepared the night before so that it is ready and cold when you come home from work the next day. My husband never ate this until we got married and in the summer he requests it every other week. You can substitute chicken for the tuna and it is great that way also. I serve it on a leaf of lettuce, for looks, with an assortment of crackers. Happy eating!\"",
    "ins": "Place eggs in a saucepan and cover with water. Bring to a boil, remove from heat, and let eggs stand in hot water for 15 minutes. Remove eggs from hot water, cool under cold running water, and peel.\nBring a large pot of lightly salted water to a boil. Add macaroni pasta and cook for 8 to 10 minutes or until al dente; drain and rinse under cold water.\nPut frozen peas into a colander and rinse with hot water; drain well.\nPlace the macaroni and peas in a large bowl. Dice eggs and add to the bowl. Put the tuna in the bowl, flaking it apart.\nStir mayonnaise into the mixture a little at a time, so the mixture is moist but not soggy. Sprinkle the salt and pepper and mix one last time. Cover and refrigerate for a least 1 hour or overnight.",
    "pt": "25 m",
    "ct": "18 m",
    "tt": "1 h ",
    "i": "409524.jpg",
    "o": "",
    "st": "allrecipes"
}