{
    "id": 238551,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons olive oil, divided",
        "1 onion, cut into matchstick-size pieces",
        "1 green bell pepper, cut into matchstick-size pieces",
        "1 red bell pepper, cut into matchstick-size pieces",
        "1 (4 ounce) package mushrooms, sliced",
        "1 (10 ounce) package seitan, thinly sliced",
        "salt and ground black pepper to taste",
        "4 hoagie rolls, split lengthwise",
        "4 slices provolone cheese"
    ],
    "nut": [
        "Calories > 688 kcal",
        "Carbs > 84.1 g",
        "Cholesterol > 20 mg",
        "Fat > 22.7 g",
        "Protein > 36.8 g",
        "Sodium > 1208 mg"
    ],
    "n": "Seitan Philly Cheese Steak Sandwiches",
    "a": "jgaines",
    "r": "0",
    "s": 4,
    "des": "\"Quick, easy vegetarian dinner that is a guaranteed success! This recipe hinges on the quality of the seitan that is used. We make our own. For people in the Northeast, Susie'sÂ® sliced seitan is very good and comes in a variety of flavors. We add and subtract veggies based on what finicky kids will eat that day.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nHeat 1 tablespoon oil in a skillet over medium heat; cook and stir onion, green bell pepper, and red bell pepper until onion is translucent, 5 to 10 minutes. Add mushrooms; cook and stir until tender, 5 to 10 minutes. Transfer vegetable mixture to a bowl.\nPour remaining olive oil into the skillet over medium heat; add seitan and cook, turning frequently, until browned on all sides, 5 to 10 minutes. Return vegetable mixture to skillet and mix with seitan; season with salt and pepper.\nArrange hoagie rolls on a baking sheet and fill with seitan-veggie mixture. Place 1 provolone cheese slice over the filling of each sandwich.\nHeat sandwiches in the preheated oven until cheese is melted, about 5 minutes.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "2100820.jpg",
    "o": "",
    "st": "allrecipes"
}