{
    "id": 238622,
    "old_rating": "4.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 medium zucchini, halved lengthwise",
        "2 (4 ounce) skinless, boneless chicken breast halves, cut into bite-size pieces",
        "2 tablespoons butter",
        "1/4 cup chopped onion",
        "5 sliced fresh mushrooms",
        "1/4 cup bite-size broccoli florets",
        "1 (15 ounce) jar ClassicoÂ® Creamy Alfredo Sauce",
        "ground black pepper to taste",
        "1 roma (plum) tomato, thinly sliced",
        "shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 386 kcal",
        "Carbs > 14.5 g",
        "Cholesterol > 150 mg",
        "Fat > 26.3 g",
        "Protein > 24.1 g",
        "Sodium > 1324 mg"
    ],
    "n": "Chicken Alfredo Zucchini Boats",
    "a": "WynnD",
    "r": "0",
    "s": 4,
    "des": "\"Chicken, mushrooms, onion, broccoli and ClassicoÂ® Creamy Alfredo sauce add the perfect punch to these zucchini boats!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a rimmed baking sheet with cooking spray.\nSlice zucchini in half lengthwise and remove inner flesh with a small scoop or spoon leaving a 1/2-inch thick shell. Chop the zucchini flesh and reserve.\nLightly oil a non-stick skillet and set over medium heat. Add chicken; cook and stir until beginning to brown, about 5 minutes. Remove chicken from pan.\nMelt butter in skillet. Add onions, mushrooms, and broccoli. Cook and stir until onions are soft and broccoli is crisp tender, about 8 minutes. Add reserved zucchini flesh and chicken; continue to cook about 5 more minutes.\nStir in the Alfredo sauce and bring to a low simmer; simmer 5 minutes. Season with pepper.\nFill zucchini boats with Alfredo mixture; place on prepared baking sheet. Top with 1 tablespoon shredded mozzarella cheese, tomato slice, and Parmesan cheese.\nBake until zucchini are tender and cheese has melted, about 20 minutes. Let cool 5 minutes before serving.",
    "pt": "10 m",
    "ct": "45 m",
    "tt": "55 m",
    "i": "1307466.jpg",
    "o": "3793011.jpg,3771000.jpg,2595866.jpg,2041873.jpg,1385049.jpg,1370092.jpg",
    "st": "allrecipes"
}