{
    "id": 238617,
    "old_rating": "4.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons corn oil",
        "1/2 cup finely chopped onion",
        "3 large cloves garlic, minced",
        "4 cups large cauliflower florets",
        "Salt and pepper to taste",
        "1 (24 ounce) jar ClassicoÂ® Four Cheese Sauce",
        "1/2 cup dry white wine",
        "2 tablespoons chopped fresh parsley, divided",
        "1 tablespoon finely grated Parmesan cheese",
        "1 cup freshly grated mozzarella cheese"
    ],
    "nut": [
        "Calories > 312 kcal",
        "Carbs > 26.5 g",
        "Cholesterol > 26 mg",
        "Fat > 16 g",
        "Protein > 12.6 g",
        "Sodium > 892 mg"
    ],
    "n": "Broiled Cauliflower with Four Cheese Tomato Sauce",
    "a": "Holiday Baker",
    "r": "0",
    "s": 4,
    "des": "\"Florets of cauliflower simmer in a cheesy tomato sauce, then are finished under the broiler with Parmesan and mozzarella cheese for a fresh and easy side dish.\"",
    "ins": "Heat oil in a large pan over medium-high heat. Add onion and saute until beginning to soften but not brown, 2 to 3 minutes. Stir in garlic and cook another minute. Add the cauliflower; salt and pepper to taste. Cook and stir another minute to combine.\nStir in the sauce and white wine; add 1 tablespoon of the parsley. Cook and stir 5 minutes at a low simmer.\nTurn heat to medium-low, cover. Cook until cauliflower is almost tender, about 10 more minutes, stirring a few times.\nTurn broiler to high. Line a rimmed baking sheet with foil. Spray lightly with cooking spray.\nPour cauliflower and tomato sauce onto the baking sheet. Gently scoop some of the tomato sauce back over the top of the cauliflower. Spread the cauliflower evenly on the sheet.\nSprinkle Parmesan cheese then mozzarella cheese over the cauliflower.\nBroil until cheese is bubbly and slightly browned in spots, about 2 minutes. Watch carefully so cheese doesn't burn. Let rest 3 minutes before transferring to serving platter. Garnish with remaining fresh parsley.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "1307464.jpg",
    "o": "",
    "st": "allrecipes"
}