{
    "id": 238681,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 slices bacon, sliced into small strips",
        "1 onion, chopped",
        "1 tart apple, chopped",
        "1 1/2 cups chicken broth",
        "1 (8 ounce) can crushed pineapple, drained and juice reserved",
        "1 (8 ounce) can pineapple rings, drained and juice reserved",
        "2 tablespoons tomato puree",
        "2 tablespoons all-purpose flour",
        "1 1/2 tablespoons curry powder",
        "salt to taste",
        "5 skinless, boneless chicken breast halves - pounded to about 3/4-inch thickness"
    ],
    "nut": [
        "Calories > 294 kcal",
        "Carbs > 26.2 g",
        "Cholesterol > 78 mg",
        "Fat > 7.9 g",
        "Protein > 29.1 g",
        "Sodium > 630 mg"
    ],
    "n": "Pineapple and Chicken Curry",
    "a": "ANGELA97303",
    "r": "0",
    "s": 5,
    "des": "\"This is a wonderful sauce of pineapple, apple, onion, curry, and bacon that mixes together to make the most flavorful sauce for chicken on rice.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat a large skillet over medium-high heat. Saute bacon, onion, and apple in hot skillet until onion is slightly softened, about 5 minutes.\nStir chicken broth, reserved pineapple juices, tomato puree, flour, and curry powder into bacon mixture; bring to a simmer, reduce heat to medium-low, and cook, stirring often, until flavors blend and sauce thickens, about 10 minutes. Remove skillet from heat; stir crushed pineapple and salt into curry sauce.\nPlace chicken in a single layer in a glass baking dish. Pour curry sauce over the chicken.\nBake chicken in the preheated oven until no longer pink in the center and the juices run clear, 30 to 35 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Garnish with pineapple rings.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "3294643.jpg",
    "o": "",
    "st": "allrecipes"
}