{
    "id": 238614,
    "old_rating": "4.45161",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 large green bell peppers, cut in half lengthwise, seeds removed",
        "1 pound ground beef sirloin",
        "4 ounces ground Italian sausage",
        "1 cup cooked brown rice",
        "1 teaspoon dried Italian seasoning",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 clove garlic, minced",
        "1/4 cup freshly grated Parmesan cheese",
        "1 large egg, lightly beaten",
        "1 (24 ounce) jar ClassicoÂ® Tomato and Basil Pasta Sauce, divided",
        "2 cups shredded part-skim mozzarella cheese",
        "Fresh chopped parsley"
    ],
    "nut": [
        "Calories > 638 kcal",
        "Carbs > 37.3 g",
        "Cholesterol > 171 mg",
        "Fat > 32.7 g",
        "Protein > 48.2 g",
        "Sodium > 1411 mg"
    ],
    "n": "Italian-Style Stuffed Peppers",
    "a": "Classico",
    "r": "0",
    "s": 4,
    "des": "\"Stuffed peppers take on an Italian feel with the help of ClassicoÂ® Fresh Tomato & Basil Sauce, Italian sausage, Parmesan cheese, and Italian seasonings.  It's comfort food kicked up a notch--and gluten free!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a roasting pan (large enough to accommodate 8 pepper halves in a single layer) with cooking spray.\nCombine the ground sirloin, Italian sausage, brown rice, Italian seasonings, salt, pepper, garlic, Parmesan cheese, egg, and 1/2 cup Classico(R) Tomato & Basil sauce in a large bowl. Mix until combined.\nDivide meat mixture evenly among the green pepper halves; press to compress slightly. Arrange halves in prepared pan. Spoon the remaining Classico(R) Tomato & Basil sauce onto the tops of the meat and peppers.  Cover tightly with foil.\nBake until the peppers are soft and internal temperature of the meat reaches 165 degrees F, about 1 1/2 hours.\nRemove from oven. Remove foil and top each pepper with shredded cheese.\nTurn oven to broil. Place peppers, uncovered under the broiler. Broil until the cheese is melted and bubbly, about 5 minutes. Sprinkle with parsley.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "1307500.jpg",
    "o": "4387239.jpg,3683714.jpg,2738001.jpg,2615687.jpg,2603379.jpg,1404483.jpg",
    "st": "allrecipes"
}