{
    "id": 238692,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (11 ounce) packages hot dog buns",
        "1/2 cup butter",
        "1 onion, chopped",
        "15 fluid ounces water, or more as needed",
        "1 pinch dried sage, or to taste",
        "1 pinch poultry seasoning, or to taste",
        "salt and ground black pepper to taste",
        "2 chicken legs, or more to taste",
        "2 chicken thighs, or more to taste",
        "2 chicken breasts, or more to taste",
        "2 (10.5 ounce) cans cream of chicken soup, divided",
        "1/2 cup milk, or more as needed"
    ],
    "nut": [
        "Calories > 757 kcal",
        "Carbs > 60.8 g",
        "Cholesterol > 139 mg",
        "Fat > 38.6 g",
        "Protein > 39.6 g",
        "Sodium > 1344 mg"
    ],
    "n": "Grandma's Chicken Stuffing Bake",
    "a": "Savannah",
    "r": "0",
    "s": 6,
    "des": "\"This is a recipe my grandma made for me before she died. It is delicious if you love stuffing.\"",
    "ins": "Crumble hot dog buns into a bowl and allow to dry out, at least 4 hours.\nPreheat oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking dish.\nMelt butter in a skillet over medium-high heat; saute onion until tender, about 5 minutes. Pour onion and butter over hot dog buns; add enough water to moisten the mixture and stir well. Season bread mixture with sage, poultry seasoning, salt, and pepper.\nArrange chicken legs, chicken thighs, and chicken breasts in the prepared baking dish. Pour 1 can cream of chicken soup over chicken; top with bun mixture.\nBake in the preheated oven for 40 minutes. Pour second can of soup over stuffing and add enough milk to moisten the mixture.\nContinue baking until soup is bubbling, chicken is no longer pink at the bone, and the juices run clear, 10 to 15 minutes more. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "5 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}