{
    "id": 238616,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 medium eggplants, peeled and cut lengthwise into 1/4-inch thick slices",
        "6 ounces bulk mild Italian sausage",
        "1/2 cup part-skim ricotta cheese",
        "1 egg, lightly beaten",
        "2 cloves garlic, minced",
        "1 teaspoon chopped fresh oregano",
        "2 teaspoons chopped fresh basil",
        "1 tablespoon grated Parmesan cheese",
        "1 (24 ounce) jar ClassicoÂ® Tomato and Basil Sauce",
        "1/4 cup shredded Italian cheese blend"
    ],
    "nut": [
        "Calories > 340 kcal",
        "Carbs > 34.4 g",
        "Cholesterol > 79 mg",
        "Fat > 15.7 g",
        "Protein > 18.3 g",
        "Sodium > 911 mg"
    ],
    "n": "Eggplant Manicotti with Sausage",
    "a": "Classico",
    "r": "0",
    "s": 4,
    "des": "\"A new twist on traditional manicotti without pasta, eggplant slices stand in for the manicotti shells and bake with ricotta in a rich tomato-basil sauce with fresh herbs.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nLine a 15x17-inch baking pan with aluminum foil and spray with oil (for eggplant slices). Lightly oil a 9x13-inch baking dish (for the manicotti).\nArrange eggplant slices in a single layer in 15x17 pan. Roast eggplant until softened, about 20 minutes. Reduce oven temperature to 350 degrees F (175 degrees C).\nCook sausage in a non-stick skillet over medium heat until it begins to brown and is no longer pink, breaking up clumps as it cooks. Remove from pan and drain on paper towels.\nCombine ricotta cheese, egg, garlic, oregano, basil and Parmesan in a medium bowl; mix until smooth and well blended.\nPour a cup of Classico Tomato & Basil Pasta Sauce into the 9x13 pan and spread evenly on the bottom of the pan.\nPut 1 tablespoon of ricotta mixture onto longer end of eggplant slice and top with a scant teaspoon of crumbled sausage; roll up into thin roll. Place on pasta sauce in 9x13 pan. Repeat with eggplant slices making 2 rows of eggplant rolls in pan.\nSprinkle remaining sausage over eggplant rolls. Spread remaining pasta sauce over eggplant rolls. Top with shredded Italian cheese blend.\nBake until sauce is bubbly, about 20 minutes. Let stand 5 minutes before serving.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "1307533.jpg",
    "o": "",
    "st": "allrecipes"
}