{
    "id": 238722,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (400 g) package Europe's BestÂ® Roasted Gourmet Tuscan Inspired Blend",
        "1 egg, beaten",
        "1 (475 gram) tub ricotta cheese",
        "3/4 cup grated Parmesan cheese, divided",
        "1/4 cup chopped fresh basil",
        "Salt and pepper",
        "1 (1 kg) log prepared polenta",
        "2 teaspoons Spectrum NaturalsÂ® Olive Oil",
        "2 (24 ounce) jars pasta sauce",
        "1 (340 gram) package Yves Veggie CuisineÂ® Italian Veggie Ground Round",
        "2 cups shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 412 kcal",
        "Carbs > 44.7 g",
        "Cholesterol > 56 mg",
        "Fat > 14.9 g",
        "Protein > 24.9 g",
        "Sodium > 1322 mg"
    ],
    "n": "Tuscan Roasted Vegetable Lasagna",
    "a": "Yves Veggie Cuisine",
    "r": "0",
    "s": 10,
    "des": "\"Roasted vegetables and polenta layer together with Italian-seasoned Veggie Ground Round and cheese in a not-so-traditional vegetarian lasagna.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nThaw vegetables and chop into small pieces. Set aside.\nIn a large bowl, mix together egg, ricotta, 1/2 cup (125 mL) of the Parmesan cheese and basil. Season with salt and pepper. Set aside.\nCut polenta into 1/4-inch (0.5 cm) slices. Set aside.\nLightly grease 13 x 9-inch (33 x 23 cm) baking pan with oil. Spread 1-1/2 cups (375 mL) of the pasta sauce onto the bottom. Arrange a layer of polenta over sauce. Spread half of the roasted vegetable mixture over polenta.\nIn a large bowl, mix together remaining sauce and veggie ground round. Spread half of the veggie sauce over vegetables.\nSpread ricotta mixture carefully over vegetables. Sprinkle with 1 cup (250 mL) of the mozzarella. Add another layer of polenta (you may have some left over).\nAdd remaining roasted vegetables, then remaining pasta sauce. Top with remaining 1/4 cup (50 mL) Parmesan and remaining 1 cup (25 mL) mozzarella. Cover loosely with foil.\nBake in the preheated oven for 20 minutes; remove foil and bake 20 minutes longer or until bubbly. Let stand for 10 minutes before serving.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "1283146.jpg",
    "o": "",
    "st": "allrecipes"
}