{
    "id": 238760,
    "old_rating": "4.35714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 ReynoldsÂ® Slow Cooker Liner",
        "1 (15 ounce) jar roasted red peppers, drained and chopped",
        "1 (32 ounce) container chicken broth",
        "2 (15.5 ounce) cans white (cannelloni) beans, rinsed and drained",
        "1 (28 ounce) can Italian-style diced tomatoes, drained",
        "1 (14 ounce) can artichoke hearts, rinsed, drained, and quartered",
        "4 stalks celery, chopped",
        "2 medium onions, chopped",
        "1 tablespoon olive oil",
        "4 cloves garlic, minced",
        "8 cups Swiss chard, chopped",
        "20 ounces fresh or frozen cheese tortellini, uncooked",
        "1/4 cup finely shredded Parmesan cheese",
        "Parmesan Crisps:",
        "1 1/2 cups finely shredded Parmesan cheese",
        "1 teaspoon snipped fresh thyme or rosemary",
        "1/2 teaspoon coarsely ground black pepper"
    ],
    "nut": [
        "Calories > 315 kcal",
        "Carbs > 42.8 g",
        "Cholesterol > 30 mg",
        "Fat > 9.1 g",
        "Protein > 16.4 g",
        "Sodium > 1482 mg"
    ],
    "n": "Slow Cooker Tortellini",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 12,
    "des": "\"Perfect for cold-weather entertaining--make this soup ahead of time, freeze, and simply reheat when your guests have arrived.\"",
    "ins": "Line a 5- to 6-quart slow cooker with a Reynolds(R) Slow Cooker Liner; set aside.\nAdd the roasted peppers, broth, beans, tomatoes, artichoke hearts, celery, onions, olive oil, and garlic to the lined-slow cooker. Stir gently with a wooden spoon or rubber scrapper to combine.\nCover and cook on high for 5 hours.\nStir in Swiss chard and tortellini gently with a rubber spatula and cook 7 to 9 minutes more or until pasta is just al dente. Serve with Parmesan cheese and Parmesan Crisps, if desired.\nParmesan Crisps: Preheat oven to 375 degrees F. Line two large baking sheets with Reynolds(R) Parchment Paper. In a small bowl, combine Parmesan cheese, fresh thyme or rosemary, and black pepper. Spoon the cheese mixture into 12 portions, 4 inches apart onto prepared baking sheets. Pat each cheese portion into a 5-inch circle. Bake 4 to 6 minutes or until bubbly and golden brown. Let stand on baking sheet until completely cooled. Carefully remove crisps from parchment paper.",
    "pt": "35 m",
    "ct": "10 m",
    "tt": "50 m",
    "i": "1298763.jpg",
    "o": "4289497.jpg,2595967.jpg,2085021.jpg,1598274.jpg,1556896.jpg,1509707.jpg",
    "st": "allrecipes"
}