{
    "id": 238746,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 sheet Reynolds WrapÂ® Heavy Duty Aluminum Foil",
        "1 sheet Reynolds WrapÂ® Aluminum Foil",
        "1 tablespoon olive oil",
        "1/2 teaspoon salt",
        "1 teaspoon ground black pepper, divided",
        "4 cups sliced mushrooms",
        "1 red onion, thinly sliced",
        "1 pound ground beef",
        "1 tablespoon Worcestershire sauce",
        "1/4 cup crumbled blue cheese",
        "4 hamburger buns, split",
        "Lettuce leaves (optional)",
        "Sliced tomatoes (optional)"
    ],
    "nut": [
        "Calories > 426 kcal",
        "Carbs > 29.4 g",
        "Cholesterol > 77 mg",
        "Fat > 22 g",
        "Protein > 27.5 g",
        "Sodium > 764 mg"
    ],
    "n": "Blue Cheese Stuffed Burgers",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 4,
    "des": "\"Sharp, creamy blue cheese wrapped inside juicy burgers and topped with grilled mushrooms and onions make for a perfect summer dinner.\"",
    "ins": "Combine olive oil, salt, and 1/2 teaspoon black pepper in a small bowl. Center half of the mushrooms and onion on a sheet (12x18 inches) of Reynolds Wrap(R) Heavy Duty Aluminum Foil. Drizzle with half of the olive oil mixture. Bring up foil sides. Double-fold top and ends to seal packet, leaving room for heat circulation inside. Repeat to make two packets.\nLine a baking sheet with Reynolds Wrap(R) Aluminum Foil. Mix the beef, Worcestershire sauce, and 1/2 teaspoon black pepper in a large bowl until combined. Shape beef mixture into eight thin, 4-inch diameter patties on the prepared baking sheet. Place 1 tablespoon of the blue cheese onto the center of each of four of the patties. Top with the remaining four patties; pinch edges to seal.\nTransfer burgers on the foil and foil packets to the rack of an uncovered grill directly over medium-high heat and grill for 10 minutes or until burgers are done (160 degrees F) and vegetables are tender. Toast cut sides of hamburger buns during the last minute of grilling.\nOpen packets carefully by cutting along top fold with a sharp knife, allowing steam to escape; then open top of foil packet.\nServe burgers on buns with grilled vegetables and lettuce and/or tomato slices, if desired.",
    "pt": "25 m",
    "ct": "10 m",
    "tt": "35 m",
    "i": "1298692.jpg",
    "o": "",
    "st": "allrecipes"
}