{
    "id": 238778,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup granulated sugar, divided",
        "1/3 cup all-purpose flour",
        "1/8 teaspoon salt",
        "1 cup low-fat milk",
        "2 teaspoons freshly grated lemon zest",
        "1/2 cup lemon juice",
        "2 tablespoons butter, melted",
        "2 large egg yolks",
        "3 egg whites, at room temperature (see Tip)",
        "Confectioners' sugar for dusting"
    ],
    "nut": [
        "Calories > 179 kcal",
        "Carbs > 32.4 g",
        "Cholesterol > 60 mg",
        "Fat > 4.3 g",
        "Protein > 3.7 g",
        "Sodium > 96 mg"
    ],
    "n": "Lemon Pudding Cakes from EatingWell",
    "a": "Breana Lai",
    "r": "0",
    "s": 8,
    "des": "\"These magical little desserts start out as one batter and separate during baking into fluffy cake hiding a creamy layer of lemon pudding.\"",
    "ins": "Preheat oven to 350 degrees F. Coat eight 4- to 6-ounce (1/2- to 3/4-cup) ovenproof ramekins or custard cups with cooking spray; place in a large deep roasting pan or baking dish. Put a kettle of water on to boil for the water bath.\nWhisk 3/4 cup granulated sugar, flour and salt in a medium bowl. Make a well in the dry ingredients. Add milk, lemon zest, lemon juice, butter and egg yolks. Whisk until smooth.\nBeat egg whites in a mixing bowl with an electric mixer on medium speed until soft peaks form (see Tip). Gradually add the remaining 1/4 cup sugar and continue beating until stiff and glossy. Fold the egg whites into the batter (it will be thinner than other cake batter and it's OK if it's a little lumpy). Evenly divide among the prepared ramekins placed in the roasting pan.\nPlace the roasting pan in the oven and carefully pour in enough boiling water to come almost halfway up the sides of the ramekins.\nBake the pudding cakes until golden brown and the cakes have pulled away slightly from the sides of the ramekins, 25 to 30 minutes. Transfer the ramekins to a wire rack to cool for 15 minutes. Dust with confectioners sugar and serve warm or at room temperature.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "1295621.jpg",
    "o": "",
    "st": "allrecipes"
}