{
    "id": 238755,
    "old_rating": "4.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Reynolds WrapÂ® Pan Lining Paper",
        "8 ounces whole wheat rotini pasta",
        "3 cups fresh broccoli florets",
        "1 medium onion, chopped",
        "3 cloves garlic, minced",
        "4 tablespoons butter, divided",
        "2 tablespoons all-purpose flour",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground black pepper",
        "2 1/2 cups milk",
        "8 ounces Cheddar cheese, shredded",
        "4 ounces reduced-fat cream cheese, cubed and softened",
        "1/2 cup fine dry Italian-seasoned bread crumbs"
    ],
    "nut": [
        "Calories > 388 kcal",
        "Carbs > 35.2 g",
        "Cholesterol > 59 mg",
        "Fat > 20.2 g",
        "Protein > 16.9 g",
        "Sodium > 483 mg"
    ],
    "n": "Homemade Mac and Cheese Casserole",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 8,
    "des": "\"Whole wheat pasta and lots of fresh broccoli add a little wholesomeness to this classically indulgent comfort food.\"",
    "ins": "Preheat oven to 350 degrees F. Line a 2-quart casserole dish with Reynolds Wrap(R) Pan Lining Paper, parchment side up. No need to grease dish.\nCook the pasta in a large saucepan according to the package directions, adding the broccoli for the last 3 minutes of cooking. Drain. Return to the saucepan and set aside.\nCook the onion and garlic in 2 tablespoons hot butter in a large skillet 5 to 7 minutes or until tender. Stir in flour, salt, and black pepper. Add the milk all at once. Cook and stir over medium heat until slightly thickened and bubbly. Add cheddar cheese and cream cheese, stirring until melted. Pour cheese sauce over the pasta and broccoli and stir until well combined.\nMelt the remaining 2 tablespoons butter and mix with the bread crumbs in a small bowl. Transfer the pasta mixture to the prepared casserole dish. Top with the buttery bread crumbs.\nBake, uncovered, about 25 minutes or until bubbly and internal temperature is 165 degrees F. Let stand for 10 minutes before serving.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "4420300.jpg",
    "o": "4483946.jpg,4483300.jpg,4221012.jpg,4083647.jpg,3370836.jpg,3205185.jpg",
    "st": "allrecipes"
}