{
    "id": 238807,
    "old_rating": "4.89655",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup dried porcini mushrooms",
        "1/2 cup water",
        "2 1/2 pounds beef short ribs",
        "salt and freshly ground black pepper to taste",
        "2 tablespoons vegetable oil",
        "1 onion, sliced",
        "2 cloves garlic, minced",
        "2 cups beef broth",
        "1 cup tomato sauce",
        "1 teaspoon dried rosemary",
        "1/2 teaspoon salt",
        "1 pinch cayenne pepper",
        "1 bay leaf"
    ],
    "nut": [
        "Calories > 362 kcal",
        "Carbs > 6.3 g",
        "Cholesterol > 58 mg",
        "Fat > 29.9 g",
        "Protein > 16.5 g",
        "Sodium > 557 mg"
    ],
    "n": "Short Ribs Braised with Mushrooms and Tomatoes",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"The short ribs are slowly braised with easy-to-find dried porcini mushrooms (for real, ask someone at the fancy grocery store and they'll find them for you!) until they turn into a triumph of fork-tender goodness. I love these short ribs over mashed potatoes, but the rich tomato and mushroom gravy is fantastic over soft polenta as well. I really hope you give this cool weather wonder a try.\"",
    "ins": "Combine mushrooms and water in a bowl; soak until mushrooms are rehydrated, about 30 minutes. Drain mushrooms and reserve liquid; dice mushrooms.\nPreheat oven to 325 degrees F (165 degrees C).\nSeason short ribs all over with salt and black pepper.\nHeat vegetable oil in a skillet over medium-high heat. Cook short ribs in hot oil until browned on all sides, 7 to 12 minutes. Transfer ribs to a Dutch oven.\nReturn skillet to heat and saute onion with a pinch of salt in hot pan until softened, about 3 minutes. Add garlic and saute until fragrant, about 1 minute more. Stir mushrooms into onion mixture.\nPour reserved mushroom liquid into skillet and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Stir beef broth, tomato sauce, rosemary, 1/2 teaspoon salt, cayenne pepper, and bay leaf into onion mixture.\nPour tomato mixture over short ribs into Dutch oven and cover Dutch oven with a lid.\nCook short ribs in the preheated oven until short ribs are fork-tender, about 2 hours.",
    "pt": "15 m",
    "ct": "2 h ",
    "tt": "3 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}