{
    "id": 238838,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup white sugar",
        "1/4 cup unsalted butter",
        "2 teaspoons cinnamon",
        "4 large ripe plantains, peeled and cut diagonally into 1/2-inch slices",
        "1 sheet frozen puff pastry, thawed",
        "1 cup mascarpone cheese",
        "1/2 cup confectioners' sugar"
    ],
    "nut": [
        "Calories > 780 kcal",
        "Carbs > 104.3 g",
        "Cholesterol > 67 mg",
        "Fat > 41 g",
        "Protein > 8.1 g",
        "Sodium > 129 mg"
    ],
    "n": "Plantain Tarte Tatin",
    "a": "Curtis Wolfe",
    "r": "0",
    "s": 6,
    "des": "\"This adds a Latin flair to any meal! You can add soda (pop for those of you from the midwest) (red FantaÂ®, Orange CrushÂ®, or Inca KolaÂ®) to add color and flavor.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nHeat an oven-proof skillet over medium heat. Sprinkle white sugar evenly into the bottom of the skillet; cook until sugar melts and turns golden brown, about 1 minute. Reduce heat to low and stir butter into sugar. Stir cinnamon into butter mixture and remove from heat.\nDip each plantain slice into butter mixture to coat on both sides. Arrange coated plantains in a shingled pattern to cover the bottom of the skillet.\nSpread puff pastry sheet over plantains, tucking corners into the skillet.\nBake in the preheated oven until puff pastry is golden brown, 30 to 35 minutes. Remove from oven and cool briefly. Place a serving plate upside-down over the top of the skillet; flip the skillet to remove tarte tatin from the pan.\nWhisk mascarpone cheese and confectioners' sugar together in a bowl until smooth. Spread a large dollop of mascarpone mixture over the top of the plantains. Serve with remaining mascarpone mixture on the side.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "1747311.jpg",
    "o": "",
    "st": "allrecipes"
}