{
    "id": 238859,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Chile Paste:",
        "5 Thai chiles, chopped",
        "1 tablespoon salt",
        "1 tablespoon white sugar",
        "1 teaspoon garlic powder",
        "1/2 teaspoon red pepper flakes",
        "1/2 cup farro",
        "1 1/2 cups water",
        "1 teaspoon beef base (such as Better than BouillonÂ®)",
        "1 tablespoon sesame oil",
        "1 clove garlic, minced",
        "1 cup chopped young broccoli florets and leaves",
        "6 grape tomatoes, quartered",
        "1/2 teaspoon dried basil",
        "1/2 teaspoon dried oregano",
        "1 teaspoon unsalted butter",
        "1 tablespoon lemon juice"
    ],
    "nut": [
        "Calories > 589 kcal",
        "Carbs > 99.5 g",
        "Cholesterol > 10 mg",
        "Fat > 21.1 g",
        "Protein > 15.2 g",
        "Sodium > 7034 mg"
    ],
    "n": "Spicy Broccoli and Tomato with Farro",
    "a": "J. Whitcomb",
    "r": "0",
    "s": 1,
    "des": "\"I wanted to make a pasta salad, but didn't feel like going shopping, so I rummaged through my kitchen to see what was available that could be done in less than an hour - difficult for me, since I like to cook from scratch as much as possible! I ate it as a main dish, but it would also make a great side dish. The chile paste recipe came from an online guide to pickled mangoes. The mangoes didn't come out well, so I use the chile paste to add a kick to any of my recipes.\"",
    "ins": "Combine Thai chiles, salt, sugar, garlic powder, and red pepper flakes in a mortar and pestle. Pound until a paste is formed.\nPlace farro in a pot and cover with water; bring to a boil over medium-high heat. Reduce heat and add beef base. Cook farro, stirring occasionally, until tender yet firm to the bite, about 30 minutes. Drain.\nHeat sesame oil in a large saucepan over medium heat. Add garlic; cook until browned, 2 to 3 minutes. Stir in broccoli; cook until color brightens, about 3 minutes. Mix in tomatoes, basil, and oregano. Add butter and the chile paste, stirring constantly until melted, about 3 minutes. Add lemon juice; stir briefly. Remove pan from heat and mix in the cooked farro.",
    "pt": "20 m",
    "ct": "38 m",
    "tt": "58 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}