{
    "id": 238891,
    "old_rating": "4.45",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/3 cup all-purpose flour",
        "1/2 teaspoon garlic salt",
        "1/2 teaspoon ground black pepper",
        "2 pounds beef for stew, cut into 1-inch cubes",
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "1 1/2 cups beef broth",
        "1/2 cup red wine",
        "1 tablespoon Worcestershire sauce",
        "3 potatoes, diced",
        "4 carrots, sliced",
        "1 stalk celery, chopped",
        "2 cloves garlic, minced",
        "2 bay leaves",
        "1 (1.5 ounce) package beef stew seasoning mix (such as McCormickÂ®)",
        "1 teaspoon paprika"
    ],
    "nut": [
        "Calories > 249 kcal",
        "Carbs > 21.5 g",
        "Cholesterol > 48 mg",
        "Fat > 8.2 g",
        "Protein > 19.3 g",
        "Sodium > 637 mg"
    ],
    "n": "Best of All: Slow Cooker Beef Stew",
    "a": "Bobbee Valentine",
    "r": "0",
    "s": 10,
    "des": "\"I have tried many beef stew recipes from this site. This is the one! I took the best from each and got this no-fail version.\"",
    "ins": "Whisk flour, garlic salt, and black pepper together in a small bowl; pour into a large resealable plastic bag. Place stew beef in bag, seal the bag, and shake to coat beef to coat completely.\nHeat olive oil in a large skillet over medium-high heat; saute coated beef in hot oil until browned on all sides, about 10 minutes. Stir onion into beef; saute until onion is softened, 5 to 7 minutes. Pour beef and onions into a slow cooker.\nStir beef broth, red wine, and Worcestershire sauce together in a bowl. Pour broth mixture into the same skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Transfer broth mixture to the slow cooker.\nMix potatoes, carrots, celery, garlic, bay leaves, beef stew seasoning mix, and paprika into beef mixture.\nCook on High for 1 hour. Reduce heat to Low and cook until meat is tender, 6 to 7 hours.",
    "pt": "30 m",
    "ct": "7 h ",
    "tt": "7 h ",
    "i": "4383904.jpg",
    "o": "3979886.jpg,3851521.jpg,3604266.jpg,3208631.jpg,3055776.jpg,1558749.jpg",
    "st": "allrecipes"
}