{
    "id": 238895,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup all-purpose flour",
        "2 1/2 pounds lamb shanks",
        "salt and freshly ground black pepper to taste",
        "2 tablespoons unsalted butter",
        "1 cup dry white wine",
        "1 (14.5 ounce) can diced tomatoes",
        "1 1/2 cups chopped onion",
        "3/4 cup chicken broth",
        "1/2 cup chopped celery",
        "5 sprigs fresh thyme, leaves removed"
    ],
    "nut": [
        "Calories > 479 kcal",
        "Carbs > 23.3 g",
        "Cholesterol > 128 mg",
        "Fat > 20.2 g",
        "Protein > 36.7 g",
        "Sodium > 439 mg"
    ],
    "n": "Lamb Osso Buco Slow-Cooked",
    "a": "Nancy",
    "r": "0",
    "s": 4,
    "des": "\"There are two tricks to this recipe: browning the lamb shanks before they go into the slow cooker and reducing the sauce before serving. The result is an osso buco you'd be hard-pressed to distinguish from the labor-intensive classic.\"",
    "ins": "Put flour into a shallow wide bowl. Season lamb shanks all over with salt and pepper; dredge through the flour until coated, shaking off any excess flour.\nHeat a large skillet over medium heat; add butter and heat until foaming. Cook lamb shanks in the hot butter until golden, about 5 minutes per side. Transfer lamb shanks to a slow cooker.\nPour wine into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon; transfer to the slow cooker. Add tomatoes with their juice, onion, chicken broth, celery, and thyme leaves to slow cooker.\nCook on Low until lamb is very tender and almost falling off the bone, 6 to 8 hours. Transfer lamb shanks to a platter and cover with aluminum foil.\nTransfer the sauce in the slow cooker to a large skillet; simmer over high heat until sauce is reduced to about 2 cups, 10 to 15 minutes. Season sauce with salt and pepper.",
    "pt": "15 m",
    "ct": "6 h ",
    "tt": "6 h ",
    "i": "2229594.jpg",
    "o": "",
    "st": "allrecipes"
}