{
    "id": 238834,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup rum",
        "2/3 pound dried cranberries",
        "3/4 cup red wine",
        "1 teaspoon lemon zest, or to taste",
        "1 whole clove",
        "1 pound all-purpose flour"
    ],
    "nut": [],
    "n": "Pomeranian Bread Dumplings",
    "a": "THELASTBARON",
    "r": "0",
    "s": 8,
    "des": "\"Another recipe compiled from old recipes used in Pomerania, an ancient Germany region abutting the Baltic Sea, divided between Germany and Poland after World War II. The dumplings are very unusual in that they contain a combination of bread, meat, and dried fruit, and therefore can be served as an appetizer or as a very rich accompaniment to fowl, game, or pork dishes. I like to serve them with turkey at Thanksgiving, making dried cranberries one of the ingredients.\"",
    "ins": "Combine cranberries and rum in a bowl; soak cranberries in rum, 8 hours to over night. Drain and discard rum.\nCombine cranberries, red wine, lemon zest, and clove together in a saucepan; bring to a boil, reduce heat to medium, and simmer until flavors combine, about 15 minutes. Strain cranberries; discard wine and clove.\nBeat flour, milk, eggs, and a pinch of salt together in a large bowl until air bubbles form.\nCook and stir bacon, bologna, and bread cubes in a large skillet over medium-high heat until lightly browned and crisp, 5 to 10 minutes. Cool in skillet.\nTransfer bacon mixture and all accumulated pan drippings to flour mixture; stir until an elastic dough forms.\nBring a large pot of salted water to a boil; reduce heat to medium-high to maintain a rapid simmer. Butter a warm baking dish.\nWorking in batches, form dough into dumplings using two large spoons; drop dumplings into simmering water. Cook until dumplings are set, about 15 minutes. Transfer cooked dumplings to prepared baking dish, cover the dish, and keep in a warm place until ready to serve. Top dumplings with cranberry mixture.",
    "pt": "25 m",
    "ct": "40 m",
    "tt": "9 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}