{
    "id": 238843,
    "old_rating": "4.82143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound extra large shrimp (16-20), peeled and deveined, tail left on",
        "2 tablespoons olive oil, or more as needed",
        "1 teaspoon red pepper flakes, or to taste",
        "1 teaspoon salt, or to taste",
        "1 pinch Aleppo pepper flakes, or to taste",
        "1/2 yellow onion, sliced",
        "3 cloves garlic, minced",
        "1/2 teaspoon dried oregano",
        "1 cup white wine",
        "1 1/2 cups canned crushed tomatoes (such as San Marzano)",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "2 tablespoons thinly sliced fresh basil leaves"
    ],
    "nut": [
        "Calories > 247 kcal",
        "Carbs > 12.5 g",
        "Cholesterol > 173 mg",
        "Fat > 8.2 g",
        "Protein > 20.8 g",
        "Sodium > 907 mg"
    ],
    "n": "Chef John's Shrimp Fra Diavolo",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"This recipe features the devilishly delicious shrimp fra diavolo, or 'shrimp brother devil' if we are being literal for comic effect. It's really good and turns any pile of pasta or rice into a memorable meal. Some people like to add a little lemon, but I don't think it needs it unless your wine is too sweet.\"",
    "ins": "Combine shrimp, olive oil, red pepper flakes, salt, and Aleppo pepper flakes in a bowl; toss to coat shrimp completely in oil and spices.\nHeat a large skillet over high heat until very hot. Cook shrimp in a single layer until browned on one side, about 2 minutes. Turn shrimp and cook until browned on the other side, about 1 minute more. Transfer shrimp to a bowl.\nHeat the same skillet over medium heat. Cook and stir onion with a pinch of salt in hot skillet until onions are slightly golden and just becoming translucent; 2 to 4 minutes. Add garlic and oregano to onion; cook and stir until fragrant, 15 to 30 seconds.\nPour white wine into onions and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon; add crushed tomatoes and lower heat to medium-low. Cook and stir until tomato mixture thickens and flavors blend, 10 to 15 minutes.\nReturn shrimp to skillet along with any accumulated juices in the bowl. Cook until shrimp are reheated, 2 to 4 minutes. Stir parsley and basil into sauce and season with salt, red pepper flakes, and Aleppo pepper flakes.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "4515364.jpg",
    "o": "4515364.jpg,4509862.jpg,4487728.jpg,4484250.jpg,4334035.jpg,4290096.jpg",
    "st": "allrecipes"
}