{
    "id": 23893,
    "old_rating": "4.67333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 (.25 ounce) packages active dry yeast",
        "1/2 cup white sugar",
        "2 cups warm water",
        "4 cups all-purpose flour",
        "1/2 cup powdered milk",
        "1 1/2 teaspoons baking powder",
        "1/2 cup shortening",
        "1 pound lean ground beef",
        "1 pound ground Italian sausage",
        "1 cup chopped onion",
        "3 cups shredded cabbage",
        "3 tablespoons prepared mustard",
        "2 teaspoons salt",
        "2 teaspoons ground black pepper",
        "1/2 cup shredded, processed American cheese",
        "1/2 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 630 kcal",
        "Carbs > 55 g",
        "Cholesterol > 69 mg",
        "Fat > 34.3 g",
        "Protein > 24.6 g",
        "Sodium > 1129 mg"
    ],
    "n": "Kraut Bierocks",
    "a": "Kim Van Pelt",
    "r": "0",
    "s": 10,
    "des": "\"These meat-and-cabbage-mixture filled sweet rolls make a great main dish, and are also great as a snack.  They reheat well, so leftovers are also great!  Sauerkraut can be used in place of the cabbage for more of a 'kraut flavor'.\"",
    "ins": "To Make Sweet Dough: In a medium bowl combine the yeast, sugar and water and mix together; let stand 10 minutes. Stir in flour, dry milk, baking powder and shortening, then knead mixture for 10 minutes, adding as little flour as necessary. Cover bowl with a damp cloth and let rise in a warm place for 30 minutes, then knead again.\nTo Make Filling: Meanwhile, brown beef, sausage and onion in a large skillet over medium high heat. Drain extra fat from skillet, then stir in cabbage, mustard, salt and pepper and cook for 5 minutes. Add cheese and cook, stirring, until cheese is melted.\nPreheat oven to 350 degrees F (175 degrees C).\nFlatten a piece of dough. Place large spoonful of meat filling onto dough and fold over to form a round bun. Lay folded-side-down in a lightly greased 9x13 inch baking dish. Repeat with remaining dough and filling.\nBake in preheated oven for 20 minutes, or until golden brown.",
    "pt": "45 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "3993062.jpg",
    "o": "3993062.jpg,1397974.jpg,934550.jpg,828975.jpg,108805.jpg,49874.jpg",
    "st": "allrecipes"
}