{
    "id": 238961,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup sucralose sugar substitute (such as SplendaÂ® Granulated)",
        "1 teaspoon ground cinnamon",
        "3/4 cup light margarine (such as Smart BalanceÂ® Light)",
        "1 1/2 cups sugar and sucralose blend for baking (such as SPLENDAÂ® Sugar Blend)",
        "6 very ripe bananas, mashed",
        "3/4 cup egg substitute",
        "1 (16 ounce) container reduced-fat sour cream",
        "2 teaspoons vanilla extract",
        "2 teaspoons ground cinnamon",
        "4 1/2 cups white whole wheat flour (such as King ArthurÂ®)",
        "1 scoop vanilla protein powder (optional)",
        "1 tablespoon baking soda",
        "1/2 teaspoon salt substitute (such as MortonÂ® Lite Saltâ„¢ Mixture)",
        "1 cup chopped walnuts (optional)"
    ],
    "nut": [
        "Calories > 205 kcal",
        "Carbs > 31.3 g",
        "Cholesterol > 6 mg",
        "Fat > 6.1 g",
        "Protein > 5.3 g",
        "Sodium > 159 mg"
    ],
    "n": "Sweet and Tangy Sour Cream Banana Bread",
    "a": "TJandBecca",
    "r": "0",
    "s": 32,
    "des": "\"Sour cream gives enough tangy bite to take the edge off this banana bread's sweetness. Dusting the baking pans with cinnamon-sugar gives these small four loaves a gentle spice undertone.\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C). Grease four 7x3-inch loaf pans.\nMix 1/4 cup sucralose sugar substitute and 1 teaspoon cinnamon together in a bowl. Dust the prepared loaf pans with sugar-cinnamon mixture.\nBeat margarine and 1 1/2 cups sucralose blend for baking together in a bowl using an electric mixer until smooth and creamy. Mix bananas, egg substitute, sour cream, vanilla extract, and 2 teaspoons cinnamon into creamed margarine mixture until smooth. Stir flour, protein powder, baking soda, and salt substitute into banana mixture until batter is just mixed; fold in walnuts. Pour batter into the prepared loaf pans.\nBake in the preheated oven until a toothpick inserted in the center of a loaf comes out clean, about 1 hour.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}