{
    "id": 238920,
    "old_rating": "4.28571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound dry cannellini beans",
        "2 tablespoons butter, or to taste",
        "1 onion, diced",
        "2 cloves garlic, chopped",
        "1 (1 1/2) pound smoked pork shank",
        "1 quart water",
        "2 cups chicken stock",
        "2 bay leaves",
        "2 sprigs fresh oregano",
        "2 sprigs fresh rosemary",
        "1 pinch red pepper flakes, or to taste",
        "1 tomato, diced",
        "1 recipe homemade gremolata (see footnote)",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 458 kcal",
        "Carbs > 51.5 g",
        "Cholesterol > 74 mg",
        "Fat > 11.7 g",
        "Protein > 38.6 g",
        "Sodium > 1189 mg"
    ],
    "n": "Smoked Pork Shank with White Beans",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"Beautiful smoked pork shank delicious with white beans.\"",
    "ins": "Place cannellini beans in a large container and cover with several inches of cool water; let stand 8 hours to overnight. Drain and rinse.\nMelt butter in a heavy pot over medium heat. Cook and stir onion in hot butter until translucent, about 5 minutes. Add garlic; cook and stir until fragrant, about 1 minute.\nStir pork shank, water, chicken stock, and bay leaves into onion mixture; bring to simmer, reduce heat to low, cover the pot with a lid, and simmer until flavors blend, about 45 minutes.\nTurn shank over and stir oregano, rosemary, and red pepper flakes into chicken stock mixture; add beans and stir. Return mixture to a simmer, cover the pot with a lid, and simmer until beans are almost tender, about 1 hour. Simmer uncovered until beans are tender, about 30 minutes more. Cool to room temperature, cover the pot, and refrigerate, 8 hours to overnight.\nSpoon accumulated fat from the top of the chilled bean mixture and discard fat. Remove pork shank; cut meat into slices and discard bone.\nStir sliced pork shank, tomato, gremolata, salt, and black pepper into bean mixture over medium heat; cook and stir until heated through, 10 to 15 minutes.",
    "pt": "15 m",
    "ct": "2 h ",
    "tt": "18 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}