{
    "id": 238900,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 slices bacon",
        "Creamed Beef:",
        "1/4 cup butter",
        "1 quart whole milk",
        "1/2 pound dried beef, shredded",
        "1/2 cup all-purpose flour",
        "1/2 pound diced fresh mushrooms",
        "Scrambled Eggs:",
        "1/2 cup butter",
        "16 eggs",
        "1 cup evaporated milk"
    ],
    "nut": [
        "Calories > 421 kcal",
        "Carbs > 13.8 g",
        "Cholesterol > 375 mg",
        "Fat > 29.7 g",
        "Protein > 25.5 g",
        "Sodium > 1037 mg"
    ],
    "n": "Creamed Chip Beef Casserole",
    "a": "Robin Wells",
    "r": "0",
    "s": 10,
    "des": "\"Dried chip beef with scrambled eggs and bacon casserole! This is great as a fix-ahead dish and it freezes nicely as well. I say that this will serve 10, but folks love it so much they generally go back for more!\"",
    "ins": "Preheat oven to 275 degrees F (135 degrees C). Butter a 9x13-inch casserole dish.\nPlace the bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels and crumble.\nMelt 1/4 cup butter in a skillet over medium-low heat; add milk, beef, and flour. Cook and stir beef mixture until smooth, about 3 minutes. Mix mushrooms into creamed beef and cook until thick and bubbling, 5 to 7 minutes.\nMelt 1/2 cup butter in a large skillet over medium heat. Whisk eggs and evaporated milk together in the melted butter; cook until eggs are almost set, about 5 minutes.\nSpread about 2/3 of the creamed beef into the prepared casserole dish; top with the scrambled eggs. Add the remaining creamed beef to eggs and sprinkle bacon over the top.\nBake in the preheated oven until eggs are set, 20 to 30 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "2123073.jpg",
    "o": "",
    "st": "allrecipes"
}