{
    "id": 238969,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup black truffle-infused olive oil, divided",
        "1 (10 ounce) package crimini mushrooms, sliced",
        "1/4 cup diced red bell pepper",
        "1/4 cup minced flat-leaf parsley",
        "2 cloves garlic, pressed, or more to taste",
        "1 (8 ounce) package cream cheese, softened",
        "salt and ground black pepper to taste",
        "1/2 large baguette, sliced into thin rounds"
    ],
    "nut": [
        "Calories > 206 kcal",
        "Carbs > 14.9 g",
        "Cholesterol > 25 mg",
        "Fat > 13.9 g",
        "Protein > 5.7 g",
        "Sodium > 226 mg"
    ],
    "n": "Truffle Bruschetta",
    "a": "Auntermma",
    "r": "0",
    "s": 10,
    "des": "\"I love the unique and delicate flavor of truffles. This recipe highlights the truffle flavor in a creamy texture spread. The appetizer will fill your home with a lovely aroma and presents well on a platter. Mushroom lovers beware! This appetizer spread can be made ahead and stored in the fridge until you are ready to for your guests.\"",
    "ins": "Heat 2 tablespoons truffle-infused oil in a skillet over medium heat; cook and stir mushrooms until most of the liquid has evaporated, about 5 minutes. Add red bell pepper, parsley, and garlic to mushrooms; cook and stir until mushrooms are golden and lightly browned, about 5 minutes more. Remove skillet from heat.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nStir remaining truffle-infused oil and cream cheese into mushroom mixture until cheese melts from the heat of the skillet; season with salt and pepper. Spread mushroom-cheese mixture onto each baguette round. Arrange rounds on a baking sheet.\nBroil bruschetta until bread is warmed, 2 to 3 minutes.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "25 m",
    "i": "1920829.jpg",
    "o": "",
    "st": "allrecipes"
}