{
    "id": 23895,
    "old_rating": "4.5625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup warm milk",
        "1 egg",
        "2 tablespoons butter",
        "2 tablespoons sugar",
        "1/2 teaspoon salt",
        "3 1/3 cups bread flour",
        "1 1/2 teaspoons active dry yeast",
        "1/3 cup butter",
        "1/2 cup brown sugar",
        "2 tablespoons milk",
        "1 cup chopped walnuts",
        "1/4 cup butter, melted",
        "1/2 cup brown sugar",
        "2 teaspoons ground cinnamon",
        "1/2 cup chopped walnuts",
        "1/2 cup raisins"
    ],
    "nut": [
        "Calories > 336 kcal",
        "Carbs > 39.3 g",
        "Cholesterol > 37 mg",
        "Fat > 17.8 g",
        "Protein > 6.8 g",
        "Sodium > 156 mg"
    ],
    "n": "Moist Cinnamon Rolls",
    "a": "MARYLYN PISSERI",
    "r": "0",
    "s": 15,
    "des": "\"These are moist, delicious rolls.  They can be made gooey by making a caramel sauce.  They also freeze well.\"",
    "ins": "Place milk, egg, butter, sugar, salt, flour and yeast in bread machine pan.  Make sure you add yeast last.  Set bread machine on Dough cycle and begin.\nIn a medium sauce pan, melt  1/3 cup butter over medium-low heat. Stir in 1/2 cup brown sugar, 2 tablespoons milk and 1 cup walnuts.  Stir constantly until well blended.  Pour this sauce in a 9x13 inch pan; set aside.\nAfter the cycle is complete, put the dough on a lightly floured board, and roll the dough into a rectangle about 10x15.  Brush the dough with melted butter and sprinkle with brown sugar, cinnamon, nuts and raisins.\nRoll the dough up tightly like a jelly roll, starting with the long side.  Press the edges to seal.  With a knife, or preferably a long piece of dental floss, cut the roll into one inch pieces. Place the pieces in the prepared pan on top of the caramel sauce.\nCover with a damp cloth and let rise in a warm place until double in size, about 1 1/2 to 2 hours.  Preheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven for 15 to 20 minutes, until brown. Remove from oven and immediately turn upside down onto a platter.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "217337.jpg",
    "o": "4274310.jpg,3049487.jpg,3049482.jpg,3049480.jpg,3041513.jpg,1099954.jpg",
    "st": "allrecipes"
}