{
    "id": 239038,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound medium button or mini-bella mushrooms",
        "2 tablespoons unsalted butter",
        "1 large onion, finely chopped",
        "1 large clove garlic, minced",
        "1 cooked boneless chicken breast half, finely diced*",
        "1 1/2 tablespoons Diamond CrystalÂ® Kosher Salt",
        "3/4 teaspoon coarsely ground pepper",
        "1 tablespoon all-purpose flour",
        "1 cup whipping cream",
        "5 tablespoons chopped fresh parsley, divided",
        "finely shredded mozzarella or Parmesan cheese (optional)"
    ],
    "nut": [
        "Calories > 228 kcal",
        "Carbs > 7.6 g",
        "Cholesterol > 73 mg",
        "Fat > 19.8 g",
        "Protein > 7 g",
        "Sodium > 1476 mg"
    ],
    "n": "Chicken-Stuffed Mushrooms",
    "a": "Diamond Crystal Salt",
    "r": "0",
    "s": 6,
    "des": "\"Mushroom caps filled with a creamy onion, garlic, and diced chicken mixture are baked until piping hot for a crowd-pleasing party appetizer.\"",
    "ins": "Heat oven to 350 degrees F.\nRemove stems from mushrooms, but do not discard. Using a small melon baller, scoop out insides of mushrooms, leaving at least half shell to allow more room for filling. Finely chop mushroom stems and centers.\nMelt butter over medium heat in large skillet. Add onion and garlic; cook 1 minute. Stir in chicken, chopped mushrooms, Diamond Crystal(R) Kosher Salt, and pepper. Cook and stir 3 minutes longer. Blend in flour, cream and 3 tablespoons parsley. Cook and stir until bubbly and thickened. Remove from heat.\nSpoon mixture evenly into mushroom caps. Place in lightly oiled, shallow baking dish. Bake 10 minutes. Top with remaining 2 tablespoons parsley and garnish with mozzarella or Parmesan cheese, if desired. Bake 5 to 10 minutes longer or until hot and cheese melts. Garnish with additional parsley, if desired.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "1381037.jpg",
    "o": "",
    "st": "allrecipes"
}