{
    "id": 239013,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons sesame oil, divided",
        "2 large skinless, boneless chicken breast halves, cubed",
        "salt and ground black pepper to taste",
        "1 large bell pepper, cut into 1/2-inch squares",
        "1/2 sweet onion, cut into 1/2-inch squares",
        "1 cup teriyaki sauce",
        "1 cup chicken broth",
        "1/2 sweet onion, chopped",
        "1 teaspoon garlic powder",
        "1/2 cup cashew pieces",
        "3 dashes Asian-style hot sauce, or to taste (optional)",
        "1 cup frozen pineapple chunks, thawed",
        "4 slices Swiss cheese, cut into strips"
    ],
    "nut": [
        "Calories > 493 kcal",
        "Carbs > 29.5 g",
        "Cholesterol > 86 mg",
        "Fat > 25.2 g",
        "Protein > 37.9 g",
        "Sodium > 3257 mg"
    ],
    "n": "Sweet Onion and Pineapple Chicken Teriyaki",
    "a": "MELANKAY",
    "r": "0",
    "s": 4,
    "des": "\"This recipe combines the flavors of teriyaki sauce, pineapple, sweet onion, red pepper, cashews and a little garlic with tender chicken and swiss cheese (it's a wonderful addition!). It is easy to prepare; just requires a little simmer-time.  Serve over your favorite rice.\"",
    "ins": "Heat 1 tablespoon sesame oil in a large skillet over medium-high heat; cook and stir chicken, salt, and pepper in hot oil until chicken is almost cooked through, 5 to 7 minutes.\nHeat remaining 1 tablespoon sesame oil in a small skillet over medium heat; cook and stir bell pepper and onion squares until edges of peppers are tender, about 5 minutes. Remove skillet from heat.\nMix teriyaki sauce, chicken broth, chopped sweet onion, and garlic powder with chicken; bring to a boil. Reduce heat to medium-low and simmer until liquid is reduced by half and chicken is cooked through, 15 to 20 minutes.\nStir bell pepper-onion mixture, cashew pieces, and hot sauce into chicken mixture and simmer until heated through, 2 to 3 minutes. Remove skillet from heat. Stir pineapple into chicken mixture. Arrange Swiss cheese slices over chicken mixture.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "1968954.jpg",
    "o": "",
    "st": "allrecipes"
}