{
    "id": 239006,
    "old_rating": "3.92857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 teaspoon olive oil",
        "1 clove garlic, minced",
        "1/4 cup soy sauce",
        "1/2 lemon, juiced",
        "1 teaspoon honey",
        "1/2 teaspoon olive oil",
        "1/3 teaspoon packed brown sugar",
        "1/4 teaspoon sea salt, plus more for garnish",
        "1/4 teaspoon ground black pepper, plus more for garnish",
        "1/4 teaspoon red pepper flakes",
        "4 (6 ounce) fillets salmon",
        "1 tablespoon olive oil"
    ],
    "nut": [
        "Calories > 299 kcal",
        "Carbs > 5 g",
        "Cholesterol > 75 mg",
        "Fat > 14.2 g",
        "Protein > 37.1 g",
        "Sodium > 1082 mg"
    ],
    "n": "Sweet Glazed Salmon",
    "a": "Leeves",
    "r": "0",
    "s": 4,
    "des": "\"This recipe is the most delicious salmon recipe, easy to prepare and very refreshing. Everyone that ate this dish loved it. I made this recipe, and it is easily my favorite.\"",
    "ins": "Heat 1/4 teaspoon olive oil in a small skillet over medium-high heat. Saute garlic in hot oil until just beginning to brown.\nMix sauteed garlic, soy sauce, lemon juice, honey, 1/2 teaspoon olive oil, brown sugar, sea salt, black pepper, and red pepper flakes together in a bowl; pour into a large resealable plastic bag. Add salmon fillets, turning to coat with the marinade, squeeze bag to remove excess air, and seal the bag. Marinate in the refrigerator for 1 hour.\nRemove salmon from the marinade and shake to remove excess liquid. Reserve 3 tablespoons marinade and discard remainder.\nHeat 1 tablespoon olive oil in a large skillet over medium heat. Arrange salmon fillets in the hot skillet, pour reserved marinade over the salmon, and place a lid on the skillet; cook until salmon is browned on each side and flakes easily with a fork, occasionally spooning liquid from the pan over the fillets, 2 to 3 minutes per side.  Garnish salmon with additional sea salt and black pepper.",
    "pt": "15 m",
    "ct": "5 m",
    "tt": "1 h ",
    "i": "1480685.jpg",
    "o": "4521675.jpg,4466197.jpg,4006996.jpg,3920910.jpg,3716004.jpg,3490775.jpg",
    "st": "allrecipes"
}