{
    "id": 23900,
    "old_rating": "4.38826",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 eggs",
        "1/2 cup unbleached all-purpose flour",
        "1/2 teaspoon baking powder",
        "1 tablespoon sugar",
        "1 pinch salt",
        "1 cup milk",
        "1 teaspoon vanilla extract",
        "2 tablespoons unsalted butter, melted",
        "1/2 teaspoon ground nutmeg",
        "1/4 cup unsalted butter",
        "1/2 cup white sugar, divided",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1 large tart apple - peeled, cored and sliced"
    ],
    "nut": [
        "Calories > 456 kcal",
        "Carbs > 51.5 g",
        "Cholesterol > 237 mg",
        "Fat > 24 g",
        "Protein > 10.3 g",
        "Sodium > 143 mg"
    ],
    "n": "German Apple Pancake",
    "a": "Mollie_Cole",
    "r": "0",
    "s": 4,
    "des": "\"Also known as a Dutch baby, this is a terrific 'special day' recipe.  If you are strapped for time, you can start it the evening before and pretty much pop it in the oven. The presentation is excellent! You can shorten the preparation time by using apple pie filling, but the crisp of new apples really makes it.\"",
    "ins": "In a large bowl, blend eggs, flour, baking powder, sugar and salt.  Gradually mix in milk, stirring constantly. Add vanilla, melted butter and 1/2 teaspoon nutmeg.  Let batter stand for 30 minutes or overnight.\nPreheat oven to 425 degrees F (220 degrees C).\nMelt butter in a 10 inch oven proof skillet, brushing butter up on the sides of the pan. In a small bowl, combine 1/4 cup sugar, cinnamon and 1/2 teaspoon nutmeg. Sprinkle mixture over the butter. Line the pan with apple slices. Sprinkle remaining sugar over apples. Place pan over medium-high heat until the mixture bubbles, then gently pour the batter mixture over the apples.\nBake in preheated oven for 15 minutes.  Reduce heat to 375 degrees F (190 degrees C) and bake for 10 minutes.  Slide pancake onto serving platter and cut into wedges.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "1844911.jpg",
    "o": "4532912.jpg,4508217.jpg,4506735.jpg,4506725.jpg,4481432.jpg,4473245.jpg",
    "st": "allrecipes"
}