{
    "id": 239047,
    "old_rating": "4.60754",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1/2 onion, diced",
        "salt to taste",
        "8 ounces spicy Italian sausages, casings removed",
        "3 1/2 cups low-sodium chicken broth, divided, or as needed",
        "1 1/4 cups orecchiette pasta, or more to taste",
        "1/2 cup roughly chopped arugula, or to taste",
        "1/4 cup finely grated Parmigiano-Reggiano cheese, or to taste"
    ],
    "nut": [
        "Calories > 662 kcal",
        "Carbs > 46.2 g",
        "Cholesterol > 60 mg",
        "Fat > 39.1 g",
        "Protein > 31.2 g",
        "Sodium > 1360 mg"
    ],
    "n": "One Pan Orecchiette Pasta",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"Every year when it's time to go back to school I get inundated with requests from students to post recipes that are super-easy, cost pennies, and require a bare minimum of kitchen equipment. This delicious orecchiette pasta recipe only has a handful of ingredients, is very cheap to make, and most importantly: only uses one pan or pot for the entire procedure.\"",
    "ins": "Heat olive oil in a large, deep skillet over medium heat. Cook and stir onion with a pinch of salt in hot oil until onion is soft and golden, 5 to 7 minutes. Stir sausage into onions; cook and stir until sausage is broken up and browned, 5 to 7 minutes.\nPour 1 1/2 cups chicken broth into sausage mixture and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add orecchiette pasta; cook and stir pasta in hot broth, adding remaining broth when liquid is absorbed, until pasta is cooked through and most of the broth is absorbed, about 15 minutes.\nStir arugula into pasta-sausage mixture until arugula wilts. Ladle pasta into bowls and dust with Parmigiano-Reggiano cheese.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "4541124.jpg",
    "o": "4541124.jpg,4540373.jpg,4540349.jpg,4539136.jpg,4528838.jpg,4513763.jpg",
    "st": "allrecipes"
}