{
    "id": 239020,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 butternut squash, halved and seeded",
        "1/2 cup bread crumbs",
        "1/4 cup brown sugar",
        "1/4 cup grated Parmigiano-Reggiano cheese",
        "1 egg",
        "1 teaspoon almond extract",
        "1 (16 ounce) package wonton wrappers",
        "1 egg white",
        "1/4 cup olive oil",
        "1/4 cup finely diced pancetta",
        "1/2 cup sweet corn",
        "1/2 teaspoon dried thyme",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 323 kcal",
        "Carbs > 51.5 g",
        "Cholesterol > 27 mg",
        "Fat > 9.7 g",
        "Protein > 8.9 g",
        "Sodium > 384 mg"
    ],
    "n": "Candice's Butternut Squash Ravioli",
    "a": "Dice",
    "r": "0",
    "s": 10,
    "des": "\"This ravioli dish is impressive and surprisingly not difficult to make. Although it does take some time to assemble everything, it is well worth it! You can add freshly grated Parmesan cheese to ravioli before serving.\"",
    "ins": "Place butternut squash in a microwave-safe dish; cook in microwave until soft, about 15 minutes on 70 percent. Spoon the squash meat into a bowl and mash until smooth; allow to cool slightly, about 15 minutes.\nStir bread crumbs, brown sugar, Parmigiano-Reggiano cheese, egg, and almond extract into cooled squash until smooth.\nSpoon 1 teaspoon squash mixture in the center of half of the wonton wrappers. Brush the outer edges of each wrapper with egg white and top with another wonton wrapper, pressing the edges together to seal each ravioli.\nBring a large pot of salted water to a boil; cook 3 to 4 ravioli at a time in the boiling water until cooked through and floating on top of water, 3 to 4 minutes. Remove cooked ravioli with a slotted spoon and transfer to a serving bowl.\nHeat olive oil in a skillet over medium heat; cook and stir pancetta in hot oil until browned, about 5 minutes. Add corn, thyme, salt, and pepper; cook and stir until warmed, 2 to 3 minutes. Pour pancetta mixture over ravioli.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}