{
    "id": 239122,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Pastry:",
        "4 cups all-purpose flour",
        "1 teaspoon salt",
        "1 pound lard (such as TenderflakeÂ®)",
        "1 egg, lightly beaten",
        "11 tablespoons ice cold water",
        "1 tablespoon white vinegar",
        "Butter Tart Filling:",
        "1 cup brown sugar",
        "1/4 cup melted butter",
        "2 eggs",
        "1 cup raisins, rinsed and patted dry",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 326 kcal",
        "Carbs > 29.7 g",
        "Cholesterol > 46 mg",
        "Fat > 21.7 g",
        "Protein > 3.2 g",
        "Sodium > 123 mg"
    ],
    "n": "Gramma's Butter Tarts",
    "a": "GoGoGoMom",
    "r": "0",
    "s": 24,
    "des": "\"This is my Grandma's recipe for butter tarts in homemade pastry.\"",
    "ins": "Whisk flour and 1 teaspoon salt together in a large bowl; cut lard into flour mixture with a pastry blender until crumbly. Make a well in the flour mixture and place 1 beaten egg into the well.\nPour ice cold water and vinegar into flour mixture; stir with a wooden spoon until a dough forms. Divide dough into two balls; wrap dough in waxed paper and chill in the refrigerator for 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nBeat brown sugar and butter together in a bowl with an electric mixer until smooth; beat in 2 eggs one at a time. Stir raisins and vanilla extract into butter mixture.\nRoll out one ball of dough on a lightly floured surface to 1/8-inch thickness; reserve remaining dough for another use. Cut dough into circles large enough to fit into the bottom and partway up sides of the wells of a muffin tin using a round biscuit cutter. Press dough circles lightly into muffin tin to form tart shells; fill each shell 3/4 full with raisin mixture.\nBake in the preheated oven until filling is bubbly and pastry is lightly browned, about 20 minutes.",
    "pt": "1 h ",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "2655075.jpg",
    "o": "",
    "st": "allrecipes"
}