{
    "id": 239123,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Filling:",
        "2/3 cup brown sugar",
        "1/2 cup currants",
        "1/2 cup chopped pecans",
        "1 small apple - peeled, cored, and grated",
        "3 tablespoons butter",
        "3 tablespoons reduced-fat cream cheese",
        "1 tablespoon maple syrup",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon ground cinnamon",
        "1 pinch salt",
        "2 eggs, beaten, divided",
        "Dough:",
        "1/2 cup low-fat milk",
        "1/4 cup white sugar",
        "2 tablespoons butter",
        "2 tablespoons plain low-fat yogurt",
        "1 egg, lightly beaten",
        "1 teaspoon active dry yeast",
        "2 cups all-purpose flour, or as needed",
        "Topping:",
        "1 teaspoon white sugar"
    ],
    "nut": [
        "Calories > 258 kcal",
        "Carbs > 37 g",
        "Cholesterol > 62 mg",
        "Fat > 10.4 g",
        "Protein > 5.5 g",
        "Sodium > 87 mg"
    ],
    "n": "Reduced Fat Butter Tart and Apple Nut Roll",
    "a": "thriftybob",
    "r": "0",
    "s": 12,
    "des": "\"How can you make a butter tart reduced fat? Well, I love butter tarts and apples, and nut rolls, too, and so I came up with a recipe combining the 3, while trimming things a bit to keep it light. Take a pic quick before it all disappears on you!\"",
    "ins": "Place brown sugar, currants, pecans, grated apple, 3 tablespoons butter, cream cheese, maple syrup, vanilla extract, cinnamon, and pinch of salt in a saucepan; bring to a boil. Reduce heat; simmer until slightly thickened, about 10 minutes. Leave to cool slightly, about 10 minutes.\nReserve about 1 tablespoon of the 2 beaten eggs for topping. Whisk a small amount of the warm apple mixture into the remaining beaten eggs; whisk the egg mixture into the apple mixture. Return saucepan to low heat; simmer, stirring occasionally, until apple mixture is thickened to the consistency of jam, about 5 minutes. Set  filling mixture aside to cool, about 15 minutes.\nPreheat oven to 325 degrees F (165 degrees C). Grease a large baking sheet.\nHeat milk in a small saucepan over medium heat until it begins to bubble, about 3 minutes. Remove milk mixture from heat; stir in sugar, 2 tablespoons butter, and yogurt. Set milk mixture aside to cool until lukewarm, about 10 minutes; stir in 1 beaten egg and yeast.\nPour milk mixture into a large bowl; stir in the flour gradually until a soft dough forms. Divide dough into two balls; roll each ball out into an oval about 3/16-inch thick on a lightly floured surface, dusting with flour as needed to avoid sticking.\nSpread filling evenly over dough to within 2 inches of edges; roll up, jelly-roll style, and crimp the ends of rolls to close; transfer rolls to the prepared baking sheet. Using a sharp knife, make a few diagonal slits in the tops of the rolls. Whisk together the 1 teaspoon white sugar and reserved egg for topping; brush over the surface of the rolls.\nBake in the preheated oven until golden brown, about 25 minutes, turning the baking sheet halfway through baking time. Allow to cool at least 10 minutes before slicing.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}