{
    "id": 239170,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons olive oil, or as needed",
        "White Sauce:",
        "5 tablespoons butter",
        "3 tablespoons arrowroot flour",
        "1 teaspoon dried marjoram",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly cracked black pepper",
        "1/4 teaspoon ground nutmeg",
        "2 cups almond milk",
        "2 cups ricotta cheese",
        "Filling:",
        "1 small butternut squash, peeled and cut into bite-size pieces",
        "12 ounces kale, torn into small pieces",
        "1 onion, quartered and sliced",
        "Topping:",
        "1/2 cup almond meal",
        "1/2 cup nutritional yeast",
        "5 tablespoons butter",
        "3 tablespoons grated Parmesan cheese",
        "1/2 teaspoon dried marjoram",
        "1/4 teaspoon ground thyme",
        "1/4 teaspoon sea salt"
    ],
    "nut": [
        "Calories > 412 kcal",
        "Carbs > 33.7 g",
        "Cholesterol > 59 mg",
        "Fat > 26 g",
        "Protein > 16.6 g",
        "Sodium > 478 mg"
    ],
    "n": "Gluten-Free Kale and Butternut Squash Gratin",
    "a": "Angela Sackett | Superhotmama",
    "r": "0",
    "s": 8,
    "des": "\"A new gluten-free and nutrient-packed side dish that will become a favorite classic dish for the family table or a holiday meal.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease an 11x13-inch glass baking dish baking with olive oil.\nMelt 5 tablespoons butter in a saucepan over medium-low heat; cook until bubbling and beginning to brown, 2 to 3 minutes. Stir arrowroot flour into the butter until completely moistened; season with 1 teaspoon marjoram, salt, black pepper, and nutmeg.\nPour almond milk over the arrowroot mixture, whisking continually to integrate. Bring mixture to a boil, stir ricotta cheese into the mixture until smooth, and immediately remove saucepan from heat.\nPour about 1/3 of the ricotta mixture into the prepared baking dish and spread into an even layer. Layer about half the butternut squash, kale, and onion atop the sauce, respectively; top with about 1/2 of the ricotta mixture. Layer remaining squash, kale, and onion over the second layer of ricotta mixture and then cover with remaining ricotta mixture. Cover the dish tightly with aluminum foil.\nBake in preheated oven until the squash is tender, about 30 minutes. Remove and discard aluminum foil.\nMash the almond meal, nutritional yeast, 5 tablespoons butter, Parmesan cheese, 1/2 teaspoon marjoram, thyme, and sea salt together with a fork or pastry cutter; spread in a layer atop the gratin.\nContinue baking until the gratin is bubbling and the topping is browned, 5 to 10 minutes.",
    "pt": "25 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "1445840.jpg",
    "o": "",
    "st": "allrecipes"
}