{
    "id": 239199,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "5 tablespoons olive oil, or more as needed",
        "2 ounces butter",
        "1 cup all-purpose flour",
        "salt and ground black pepper to taste",
        "1 pound beef chuck steak, cut across the grain into 1 1/2-inch-thin strips",
        "1 (8 ounce) package button mushrooms",
        "1/2 cup dry red cooking wine",
        "1/2 cup beef broth",
        "1 (8 ounce) package egg noodles",
        "1 (15 ounce) jar Holland-style pearl onions, drained",
        "1 1/2 cups sour cream"
    ],
    "nut": [
        "Calories > 683 kcal",
        "Carbs > 58.4 g",
        "Cholesterol > 111 mg",
        "Fat > 40.9 g",
        "Protein > 20.5 g",
        "Sodium > 379 mg"
    ],
    "n": "Show-Off Stroganoff",
    "a": "KINCATT",
    "r": "0",
    "s": 6,
    "des": "\"This recipe was handed down over several generations. Simply delicious! Serve over hot egg noodles. Enjoy!\"",
    "ins": "Heat olive oil and butter together in a skillet over low heat until smooth.\nWhisk flour, salt, and pepper together in a shallow bowl. Coat beef strips in flour mixture, gently shaking off any excess flour.\nIncrease heat under skillet to medium. Add beef to skillet and cook and stir until browned, 1 to 2 minutes per side. Mix mushrooms into beef, adding more oil if pan is dry; cook and stir until mushrooms are lightly browned, about 5 minutes.\nPour wine into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon; continue cooking until liquid is reduced by half, 5 to 10 minutes. Add beef broth and return to a boil.\nCover skillet and cook until beef is tender, 20 to 25 minutes.\nBring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain.\nMix onions into beef mixture; cook and stir until onions are warmed, 3 to 5 minutes. Remove skillet from heat and gently stir sour cream into beef mixture; serve over noodles.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "4479132.jpg",
    "o": "",
    "st": "allrecipes"
}