{
    "id": 239145,
    "old_rating": "4.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds fresh freestone peaches, peeled and sliced",
        "1 cup white sugar, divided",
        "1 tiny pinch salt",
        "1/4 cup all-purpose flour",
        "1 tablespoon cornstarch",
        "1 teaspoon lemon juice",
        "1 pinch cayenne pepper",
        "1 pinch ground cinnamon",
        "1 pastry for a 10-inch double crust pie",
        "1 1/2 tablespoons butter, cut into tiny pieces",
        "1 tablespoon heavy whipping cream, or to taste",
        "1 tablespoon white sugar, or to taste"
    ],
    "nut": [
        "Calories > 325 kcal",
        "Carbs > 47.2 g",
        "Cholesterol > 7 mg",
        "Fat > 14.3 g",
        "Protein > 2.6 g",
        "Sodium > 223 mg"
    ],
    "n": "Chef John's Peach Pie",
    "a": "Chef John",
    "r": "0",
    "s": 10,
    "des": "\"Above and beyond beautiful, this lattice design is also very practical. When you're making pie with something like peaches, the relatively open top allows for lots of moisture to evaporate, which helps prevent the dreaded 'watery-pie syndrome.' That's also the reason we boil the excess juices down to a syrup.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nStir peaches, 1/2 cup sugar, and salt together in a bowl. Let sit for 20 to 30 minutes. Strain accumulated juices into a saucepan and return strained peaches to bowl.\nBring juices in saucepan to a boil; reduce heat to medium-high, and cook until mixture thickens to a syrup, 5 to 10 minutes.\nWhisk 1/2 cup sugar, flour, and cornstarch together in a bowl. Stir lemon juice, cayenne pepper, and cinnamon into peaches; add flour mixture and toss to coat. Pour peach syrup over peach mixture and stir.\nRoll out half the pastry to fit a 10-inch pie plate. Place bottom crust in pie plate. Pour peach filling into pie shell, tap pie plate against a surface to settle filling, and dot with butter.\nRoll remaining crust into an 11-inch circle and cut into 1-inch strips using a paring knife or pastry wheel.\nLay 5 strips of pie crust over the top of the pie. Weave remaining pastry dough strips through to form a lattice top. Fold the ends of the lattice strips under the bottom crust and crimp the crust. Brush cream over the top and sprinkle with 1 tablespoon sugar.\nBake in the preheated oven until browned and bubbling, about 1 hour 15 minutes. Cool completely before slicing.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "4541551.jpg",
    "o": "4541551.jpg,4539631.jpg,4538232.jpg,4537523.jpg,4536272.jpg,4533586.jpg",
    "st": "allrecipes"
}