{
    "id": 239161,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray (such as PamÂ®)",
        "1 teaspoon extra-virgin olive oil",
        "1 1/2 teaspoons salt, divided",
        "1 (1 pound) package whole wheat penne pasta",
        "1 pound lean ground turkey",
        "1 large sweet onion, diced",
        "1 red bell pepper, diced",
        "3 cloves garlic, minced",
        "2 teaspoons ground black pepper, divided",
        "6 mild Italian sausages",
        "2 (24 ounce) jars tomato and basil pasta sauce (such as BertolliÂ®), divided",
        "1 (14.5 ounce) can petite diced tomatoes, undrained",
        "1 (10 ounce) block mozzarella-style vegan cheese (such as Follow Your HeartÂ®), shredded",
        "2 (8 ounce) packages shredded mozzarella-style vegan cheese (such as DaiyaÂ®)",
        "2 teaspoons garlic powder",
        "1 1/2 teaspoons Italian seasoning"
    ],
    "nut": [
        "Calories > 625 kcal",
        "Carbs > 49.7 g",
        "Cholesterol > 50 mg",
        "Fat > 31.8 g",
        "Protein > 30.8 g",
        "Sodium > 2127 mg"
    ],
    "n": "Non-Dairy Baked Penne Pasta",
    "a": "Joanne",
    "r": "0",
    "s": 12,
    "des": "\"This is a tasty lactose-free baked pasta dish that I serve with a garden salad and slices of garlic bread. My family loves it! See my note about making this into a vegan or vegetarian dish.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray two 9x13-inch baking dishes with cooking spray.\nBring a large pot of water with olive oil and 1/2 teaspoon salt to a boil; add whole wheat penne and cook, stirring occasionally, until tender yet firm to the bite, about 7 to 10 minutes. Drain.\nCook and stir turkey, onion, red bell pepper, garlic, remaining salt, and 1 teaspoon black pepper together in a large skillet over medium-low heat until turkey is browned and crumbly, 7 to 10 minutes. Drain and discard grease.\nPlace sausages in a pot and cover with cold water; bring water to a boil, reduce heat to medium, and simmer until sausages are no longer pink in the center, about 20 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).\nRemove and discard sausage casings; chop sausage and stir into turkey mixture. Stir penne, 1 1/2 jars tomato-basil sauce, diced tomatoes, shredded block of mozzarella-style vegan cheese, 1 package shredded mozzarella-style vegan cheese, garlic powder, Italian seasoning, and remaining black pepper into turkey-sausage mixture.\nSpread the remaining tomato-basil sauce in the bottoms of the prepared baking dishes. Divide turkey-sausage mixture between the baking dishes and top each with remaining shredded mozzarella-style cheese.\nBake in the preheated oven until cheese is melted and sauce is bubbling, about 30 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}