{
    "id": 239287,
    "old_rating": "4.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package cavatappi (corkscrew macaroni)",
        "6 tablespoons butter",
        "1/2 cup flour",
        "5 1/2 cups milk, divided",
        "2 1/2 cups shredded smoked Gouda cheese",
        "2 cups shredded sharp Cheddar cheese",
        "1 1/2 cups shredded Swiss cheese",
        "1 1/2 cups grated Parmesan cheese, divided",
        "1/2 cup dry bread crumbs",
        "1 tablespoon truffle oil"
    ],
    "nut": [
        "Calories > 565 kcal",
        "Carbs > 42.8 g",
        "Cholesterol > 98 mg",
        "Fat > 31.2 g",
        "Protein > 29.1 g",
        "Sodium > 646 mg"
    ],
    "n": "Four-Cheese Truffled Macaroni and Cheese",
    "a": "Hilary van Santen",
    "r": "0",
    "s": 12,
    "des": "\"This is one of my favorite things to make once the weather gets a chill in the air. It's great for cheese-lovers (like myself) and works great as leftovers or at dinner parties! Truffle oil has by far been one of the best culinary purchases I have made. One little bottle has lasted me a year, and can be used with so many things, like this recipe. Top with a pinch of truffle salt!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking dish.\nBring a large pot of lightly salted water to a boil. Cook cavatappi in boiling water, stirring occasionally, until cooked through but firm to the bite, about 8 minutes. Drain.\nMelt butter in a large pot over medium-low heat. Whisk flour into butter until mixture has a thick, paste-like consistency, about 30 seconds. Slowly whisk 2 cups milk into butter-flour mixture until smooth. Stir in remaining milk, increase heat to medium high, and cook, whisking constantly, until mixture is thick and almost boiling, 5 to 10 minutes.\nStir Gouda cheese, Cheddar cheese, Swiss cheese, and 1 cup Parmesan cheese into milk mixture until cheese melts and cheese sauce is smooth. Fold cavatappi into cheese sauce; pour mixture into prepared baking dish.\nStir remaining Parmesan cheese and bread crumbs together in a small bowl. Sprinkle bread crumbs mixture over cavatappi mixture and drizzle truffle oil over the top.\nBake in the preheated oven until golden and bubbling, about 30 minutes. Cool for 10 minutes before serving.",
    "pt": "5 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "1490044.jpg",
    "o": "4515486.jpg,4503749.jpg,4372735.jpg,4211862.jpg,3930118.jpg,3175309.jpg",
    "st": "allrecipes"
}