{
    "id": 239231,
    "old_rating": "4.94286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds pickling cucumbers, sliced",
        "1/2 yellow onion, sliced",
        "2 red jalapeno peppers, thinly sliced into rings",
        "3 tablespoons kosher salt",
        "2 cups distilled white vinegar",
        "2 cups white sugar",
        "1/4 cup water",
        "2 cloves garlic, sliced",
        "1 tablespoon mustard seed",
        "1 teaspoon celery seeds",
        "1 teaspoon whole black peppercorns",
        "1/2 teaspoon ground turmeric",
        "1/8 teaspoon ground cloves"
    ],
    "nut": [
        "Calories > 38 kcal",
        "Carbs > 9.5 g",
        "Cholesterol > 0 mg",
        "Fat > 0.1 g",
        "Protein > 0.3 g",
        "Sodium > 361 mg"
    ],
    "n": "Chef John's Bread and Butter Pickles",
    "a": "Chef John",
    "r": "0",
    "s": 48,
    "des": "\"At the end of summer during the Great Depression the excess cucumber crop was sliced, salted, pickled, and put up in jars for the cold, lean months ahead. I can just imagine what a treat it was to fill a sandwich with these sweet crunchy coins (bread and butter pickles, as they came to be known). I'm sure it was a wonderful break from what must have been a fairly flavorless existence. For longer storage, you can process the pickles in canning jars in a boiling water canner.\"",
    "ins": "Combine cucumbers, onion, and peppers in a bowl; pour kosher salt over the top and stir to coat completely. Cover the bowl with plastic wrap and refrigerate, stirring occasionally, 2 to 4 hours. Rinse cucumber mixture in a colander under cold water until all salt is washed away, 3 to 4 minutes. Drain.\nStir vinegar, sugar, water, garlic, mustard seed, celery seed, peppercorns, turmeric, and ground cloves together in a saucepan; bring to a simmer and cook until brine flavors combine, about 2 minutes. Add cucumber mixture to brine; heat until almost boiling, remove from heat, and cool completely. Transfer to jars and store in the refrigerator.",
    "pt": "15 m",
    "ct": "5 m",
    "tt": "2 h ",
    "i": "4538191.jpg",
    "o": "4538191.jpg,3804820.jpg,3702055.jpg,3138499.jpg,2461847.jpg,2447116.jpg",
    "st": "allrecipes"
}