{
    "id": 239232,
    "old_rating": "4.92857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 slices bread, toasted",
        "4 ounces shredded sharp Cheddar cheese",
        "1 tablespoon butter",
        "1 clove garlic, chopped",
        "1 quart chicken stock",
        "2 heads broccoli, florets separated and stems chopped",
        "1/3 cup heavy whipping cream",
        "1/4 teaspoon cayenne pepper",
        "salt to taste"
    ],
    "nut": [
        "Calories > 338 kcal",
        "Carbs > 24.9 g",
        "Cholesterol > 65 mg",
        "Fat > 21.6 g",
        "Protein > 14.3 g",
        "Sodium > 1105 mg"
    ],
    "n": "Simple Broccoli Soup with Cheddar Croutons",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"This is a classic and very simple technique for homemade vegetable soups. I'm using broccoli, but almost any vegetable will work. I am a disciple of the Gordon Ramsey school of vegetable soups. It's basically the vegetable, some stock or water, cooked until tender, pureed, and seasoned simply. His 'crazy' theory is that the star of the bowl should be the featured vegetable itself.\"",
    "ins": "Top each toast slice with Cheddar cheese. Melt cheese with a kitchen torch until bubbling and golden, 30 seconds. (footnote: broiler)\nMelt butter in a pot over high heat. Cook and stir garlic in hot butter until fragrant and sizzling, about 15 seconds. Add stock to pot and bring to a boil. Stir broccoli into stock, pushing broccoli down into liquid; return to a boil and cook until broccoli is tender, 7 to 8 minutes.\nPuree broccoli mixture using an immersion blender until soup is smooth.\nStir cream, cayenne pepper, and salt into soup; puree with immersion blender again until smooth, about 30 seconds. Ladle soup into bowls and top with cheese toast.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "25 m",
    "i": "4439538.jpg",
    "o": "4439538.jpg,4136759.jpg,4072165.jpg,3359470.jpg,2739483.jpg,2711545.jpg",
    "st": "allrecipes"
}