{
    "id": 239268,
    "old_rating": "4.52941",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "olive oil cooking spray",
        "1 spaghetti squash, halved lengthwise and seeded",
        "1 slice bacon, chopped, or more to taste",
        "1 tablespoon olive oil (optional)",
        "1 onion, chopped",
        "2 tablespoons minced garlic",
        "salt and ground black pepper to taste",
        "1 cup red wine",
        "2 (14 ounce) cans diced tomatoes",
        "1 tablespoon Italian seasoning",
        "1/2 cup shredded mozzarella cheese",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 191 kcal",
        "Carbs > 17 g",
        "Cholesterol > 14 mg",
        "Fat > 7.1 g",
        "Protein > 7.7 g",
        "Sodium > 553 mg"
    ],
    "n": "Nancy's Baked Spaghetti Squash",
    "a": "Jenny",
    "r": "0",
    "s": 6,
    "des": "\"I got this recipe from my mother-in-law. Even my two young sons love this dish, despite their aversion to all things vegetable! Delicious served with a green salad and crusty bread.\n\nThis can also be frozen for up to a month. I often buy a large squash, double the sauce, and make a second batch to freeze. Cover with a layer of plastic wrap, then a layer of foil and freeze. Defrost overnight in the fridge and bake as directed.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Spray a baking sheet and a 9-inch square baking dish with cooking spray.\nPierce the squash halves with a fork and arrange, cut-side down, on the prepared baking sheet.\nBake squash in the preheated oven until a knife easily slices into the flesh, about 1 hour 20 minutes. Remove squash from oven and cool until cool enough to handle, at least 15 minutes.\nPlace bacon in a large skillet or Dutch oven; cook and stir over medium-high heat until evenly browned, about 10 minutes. Remove bacon with a slotted spoon and drain on a paper towel-lined plate, reserving about 1 tablespoon drippings in the skillet. If the drippings don't equal 1 tablespoon, add olive oil to the skillet and heat over medium heat.\nCook and stir onion and garlic in the bacon drippings over medium heat until golden brown, 10 to 15 minutes; season with salt.\nSlowly pour wine over the onion mixture and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon; add tomatoes and Italian seasoning, Season tomato mixture with black pepper. Cook and stir tomato mixture over medium-high heat until sauce is thickened, about 5 minutes.\nShred the spaghetti squash meat using a fork, discarding the peel. Stir squash meat into tomato sauce until evenly incorporated; spoon into the prepared baking dish. Sprinkle mozzarella cheese and Parmesan cheese over squash mixture.\nBake in the preheated oven until cheese is melted and browned, 20 to 30 minutes. Top cheese layer with bacon.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}