{
    "id": 239226,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds skinless, boneless chicken breasts, cut into 1-inch pieces",
        "2 tablespoons olive oil",
        "2 large carrots, cut into 1/4-inch pieces",
        "1 large onion, chopped",
        "1/2 teaspoon salt",
        "1 teaspoon Cajun seasoning",
        "1/4 cup all-purpose flour",
        "1/2 cup orange juice",
        "1 (14.5 ounce) can chicken broth",
        "1 cup frozen peas",
        "1/4 cup chopped flat-leaf parsley, divided",
        "1 tablespoon chopped fresh dill",
        "1/2 cup buttermilk",
        "2 1/2 cups corn flakes cereal"
    ],
    "nut": [
        "Calories > 249 kcal",
        "Carbs > 19.5 g",
        "Cholesterol > 66 mg",
        "Fat > 6.6 g",
        "Protein > 26.9 g",
        "Sodium > 594 mg"
    ],
    "n": "Buttermilk Chicken and Corn Flake Baked Casserole",
    "a": "Donna Henderson Hopgood",
    "r": "0",
    "s": 8,
    "des": "\"This recipe combines the flavors of not just one but two of our favorite comfort food recipes: chicken pot pie and buttermilk fried chicken. The ultimate in yummy casseroles!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nPlace chicken in a large pot and cover with water; bring to a boil and cook until chicken is no longer pink in the center, about 5 minutes. Drain.\nHeat olive oil in a large skillet over medium heat. Stir carrots, onion, and salt into hot skillet, cover the skillet, and cook, stirring occasionally, until onions are tender, 8 to 10 minutes. Stir Cajun seasoning into vegetables.\nSprinkle flour over vegetable mixture in the skillet; cook and stir until flour taste cooks off, about 1 minute. Gradually stir orange juice and broth, respectively, into vegetable mixture; bring to a boil.\nStir chicken, peas, 1/2 of the parsley, and dill into broth mixture; remove from heat and stir in buttermilk. Pour buttermilk mixture into a baking dish.\nBake in the preheated oven for 15 minutes. Stir corn flakes and remaining parsley together in a bowl. Sprinkle corn flake mixture over chicken mixture; bake until corn flakes are golden and casserole is bubbling, about 5 minutes more. Let rest 5 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "1626869.jpg",
    "o": "",
    "st": "allrecipes"
}