{
    "id": 239293,
    "old_rating": "3.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter, softened",
        "1 cup brown sugar",
        "1/2 cup white sugar",
        "3/4 teaspoon baking soda",
        "1/2 teaspoon salt",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "2 1/2 cups all-purpose flour",
        "3 apples - peeled, cored, and diced",
        "1 cup individually wrapped caramels, unwrapped",
        "1 1/2 teaspoons ground cinnamon"
    ],
    "nut": [
        "Calories > 174 kcal",
        "Carbs > 26.3 g",
        "Cholesterol > 29 mg",
        "Fat > 7.2 g",
        "Protein > 2 g",
        "Sodium > 139 mg"
    ],
    "n": "Gooey Caramel Apple Cookies",
    "a": "C@ts-m0m",
    "r": "0",
    "s": 30,
    "des": "\"Gooey caramel, diced sweet, juicy apples and a hint of cinnamon in a moist and chewy cookie. Once cool, store in an airtight container. Cortland apples are recommended, but use your choice.\"",
    "ins": "Beat butter, brown sugar, white sugar, baking soda, and salt together with an electric mixer in a large mixing bowl until creamy and smooth. Beat 1 egg into the butter mixture until completely blended. Add the remaining egg and vanilla together and beat until smooth.\nBeat as much of the flour into the butter mixture as you can with the mixer. Use a wooden spoon to stir any remaining flour into the batter.\nMix diced apples, caramels, and cinnamon together in a separate bowl; fold into the batter. Refrigerate batter until chilled, at least 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Grease baking sheets.\nDrop dough by rounded teaspoonfuls 2 inches apart onto prepared sheets.\nBake in preheated oven until the tops are golden brown, about 8 minutes. Cool cookies on baking sheets for 1 minute before removing to a wire rack to cool completely.",
    "pt": "20 m",
    "ct": "8 m",
    "tt": "58 m",
    "i": "2656455.jpg",
    "o": "",
    "st": "allrecipes"
}