{
    "id": 239381,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons white sugar",
        "2 tablespoons brown sugar, divided",
        "1 cup all-purpose flour",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon pumpkin pie spice",
        "1 pinch salt",
        "1 tablespoon butter, cut into large chunks",
        "4 eggs",
        "1 cup milk",
        "1 teaspoon vanilla extract",
        "1/8 teaspoon almond extract"
    ],
    "nut": [
        "Calories > 198 kcal",
        "Carbs > 27.1 g",
        "Cholesterol > 132 mg",
        "Fat > 6.3 g",
        "Protein > 7.7 g",
        "Sodium > 79 mg"
    ],
    "n": "Shannon's Oven Pancake",
    "a": "Shannon",
    "r": "0",
    "s": 6,
    "des": "\"This is the perfect lazy weekend breakfast, which bakes up puffy and beautiful! Spices can be easily omitted or added according to your personal taste. Be creative and serve with your favorite toppings! Feel free to experiment with any combination of your favorite spices such as nutmeg, ginger, cloves, apple pie spice, allspice, etc.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nStir white sugar and 1 tablespoon brown sugar together in a small bowl. Stir flour, cinnamon, pumpkin pie spice, and salt together in a separate bowl with a whisk.\nPut butter in an 8-inch cake pan and melt in preheated oven, 3 to 5 minutes.\nSprinkle remaining brown sugar over the melted butter in the cake pan.\nBeat eggs, milk, vanilla extract, and almond extract together in a larger bowl with an electric mixer; stir into the flour mixture until you have a smooth batter. Pour the batter over the butter and brown sugar in the cake pan. Sprinkle white and brown sugar mixture over the batter.\nBake in the preheated oven until puffed and golden, 20 to 25 minutes.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "1500833.jpg",
    "o": "",
    "st": "allrecipes"
}