{
    "id": 239435,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Spice Rub:",
        "2 teaspoons paprika",
        "2 teaspoons ancho chile powder",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon ground allspice",
        "2 (1 1/2 inches thick) pork chops",
        "1 1/2 tablespoons vegetable oil",
        "salt to taste"
    ],
    "nut": [
        "Calories > 522 kcal",
        "Carbs > 3.3 g",
        "Cholesterol > 126 mg",
        "Fat > 34.7 g",
        "Protein > 47.6 g",
        "Sodium > 91 mg"
    ],
    "n": "Sorta Blackened Chile-Rubbed Pork",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"This chile-rubbed pork chop video recipe is a kinder, gentler version of the 'blackened' cooking technique. We start on high heat, but cook the chops on medium, and then finish the cooking by wrapping the chops in foil. This produces a very moist chop, as the meat has time to 'rest' as it finishes cooking.\"",
    "ins": "Mix paprika, ancho chile powder, black pepper, and allspice together in a spice shaker or bowl.\nPlace pork chops on a plate and coat both sides of chops with spice mixture. Sprinkle the remaining spice mixture onto the plate and pat the outsides of each chop into the spice mixture until entire chop is coated.\nPut coated pork chops in a resealable plastic bag and refrigerate for flavors to absorb into the pork chops, 4 to 12 hours.\nHeat oil in a skillet over medium-high heat. Place pork chops in the hot oil and reduce heat to medium; season with salt. Cook pork chops until partially blackened, 5 to 6 minutes per side.\nTransfer pork chops to a sheet of aluminum foil and wrap edges together creating a seal. Allow pork chops to \"cook\" from the residual heat inside the foil wrap, about 10 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\nPlace pork chops on a serving plate and spoon residual juices in the foil over each chop.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}