{
    "id": 239448,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup all-purpose flour",
        "1 teaspoon poultry seasoning",
        "salt and ground black pepper to taste",
        "2 eggs",
        "2 tablespoons milk",
        "1 cup seasoned bread crumbs",
        "1/2 cup grated Parmesan cheese",
        "1 teaspoon ground black pepper",
        "2 1/2 cups prepared stuffing",
        "1 quart oil for frying, or as needed"
    ],
    "nut": [
        "Calories > 448 kcal",
        "Carbs > 40.7 g",
        "Cholesterol > 68 mg",
        "Fat > 26.7 g",
        "Protein > 11.5 g",
        "Sodium > 958 mg"
    ],
    "n": "Deep-Fried Stuffing",
    "a": "themoodyfoodie",
    "r": "0",
    "s": 6,
    "des": "\"If you thought leftover Thanksgiving stuffing was boring, this dish will change your mind! Any kind of stuffing (sausage, oyster, corn bread, or any variety of boxed) can be used. Heat up some gravy and bring on the cranberry sauce.\"",
    "ins": "Combine flour, poultry seasoning, salt, and black pepper to taste in a shallow bowl. Beat eggs and milk together in a second shallow bowl until smooth. Mix bread crumbs, Parmesan cheese, and 1 teaspoon black pepper together in a third shallow bowl.\nScoop stuffing, about 2 tablespoons per serving, and roll into a ball using your hands, forming about 12 balls. Dredge each ball through the flour mixture, shaking off any excess. Transfer each ball to the egg mixture and evenly coat. Roll each ball in the bread crumbs mixture until evenly coated. Set each stuffing ball on a plate and allow to sit for the coating to stick to the stuffing.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nCarefully lower 4 to 5 stuffing balls into the hot oil and fry until golden brown on all sides, about 4 minutes; transfer to a paper towel-lined plate using a slotted spoon. Repeat with the remaining stuffing balls.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}