{
    "id": 239433,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 ounces pancetta bacon, thickly sliced",
        "1 teaspoon olive oil, or as needed",
        "12 ounces pizza dough, or more to taste, cut into quarters",
        "1 tablespoon all-purpose flour, or as needed",
        "1 cup olive oil, or as needed",
        "1/2 cup ricotta cheese",
        "2 teaspoons chopped fresh thyme, or to taste",
        "ground black pepper to taste",
        "20 slices fresh peach",
        "1/4 cup freshly grated Parmigiano-Reggiano cheese, or to taste",
        "4 teaspoons extra-virgin olive oil, or to taste"
    ],
    "nut": [
        "Calories > 504 kcal",
        "Carbs > 46.3 g",
        "Cholesterol > 34 mg",
        "Fat > 25.8 g",
        "Protein > 19.8 g",
        "Sodium > 1098 mg"
    ],
    "n": "Fried Peach and Pancetta Pizza",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Growing up, I always loved when my family made pizza from scratch, but what I loved even more was what came after the meal. Any extra dough and scraps were rolled out, left to rise, fried, and sprinkled with sugar to create a simple, but delicious donut-like treat.Â \n\nHere we're doing a savory twist, using the same technique to make a pizza featuring ricotta, pancetta, and peaches. Garnish with extra sprig of thyme if desired.\"",
    "ins": "Preheat an oven to 475 degrees F (245 degrees C). Line baking sheets with aluminum foil.\nSprinkle pancetta into a cold skillet and drizzle 1 teaspoon olive oil over pancetta. Cook and stir pancetta over medium heat until browned and caramelized, 5 to 10 minutes. Remove pan from heat and cool pancetta in the oil in the skillet.\nPlace 1 dough quarter on a work surface and lightly dust with flour; roll into a 1/8-inch-thick irregularly shaped crust. Stretch dough with your hands to an even thickness; let rest on the work surface for 5 minutes. Repeat with remaining dough.\nHeat about 1 cup olive oil, reaching about 1/2-inch depth, in a heavy cast iron skillet over medium-high heat. Fry each piece of dough until browned and cooked through, about 2 minutes per side. The first side will be lighter than the second side. Drain the crusts on paper towels.\nTransfer pizza crusts, lighter-side up, to prepared baking sheets. Spread about 2 tablespoons ricotta cheese onto each crust using the back of a spoon. Sprinkle about 1/2 teaspoon fresh thyme over ricotta layer. Sprinkle pancetta over the ricotta-thyme layer; season with black pepper. Nestle about 5 peach slices onto each pizza, working around the pancetta pieces. Sprinkle 1 tablespoon Parmesan-Reggiano cheese over each pizza. Drizzle about 1 teaspoon extra-virgin olive oil over Parmesan-Reggiano layer.\nBake in the preheated oven until cheese is melted and peaches are lightly browned and tender, 12 to 15 minutes. Cool pizzas for 5 to 10 minutes on the baking sheet.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}