{
    "id": 239476,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 large tomatoes",
        "2 cups chopped carrot",
        "1 pinch ground cinnamon, or more to taste",
        "1 pinch salt to taste",
        "red onion, sliced",
        "5 cloves garlic",
        "1 fresh jalapeno pepper",
        "3 tablespoons Sriracha hot chile sauce, or to taste",
        "1 1/2 teaspoons ground cinnamon",
        "1 tablespoon vegetable oil, or to taste",
        "1 1/2 cups water",
        "1 cube chicken bouillon, or more to taste",
        "2 cups shredded cooked chicken",
        "1 (15 ounce) can black beans, rinsed and drained",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 230 kcal",
        "Carbs > 21.6 g",
        "Cholesterol > 37 mg",
        "Fat > 8.6 g",
        "Protein > 17.2 g",
        "Sodium > 846 mg"
    ],
    "n": "Sriracha Chicken Soup",
    "a": "ChelsEats",
    "r": "0",
    "s": 6,
    "des": "\"This is a great soup for a chilly night! The spice and sweetness work together to warm you right up.\"",
    "ins": "Preheat an oven to 500 degrees F (260 degrees C). Line a baking sheet with aluminum foil.\nRoast tomatoes in preheated oven on the prepared baking sheet until completely softened, about 25 minutes. Transfer tomatoes to a cutting board to cool.\nSpread chopped carrot onto the prepared baking sheet; season with a pinch of cinnamon and salt.\nRoast carrots in preheated oven until tender, about 25 minutes.\nHeat a large skillet over medium-high heat. Toast onion slices, garlic cloves, and jalapeno pepper in the skillet until beginning to char, 5 to 7 minutes.\nPeel cooled tomatoes and put in a blender bowl; add onion, garlic, jalapeno pepper, Sriracha chile sauce, and 1 1/2 teaspoons cinnamon and puree until smooth.\nHeat vegetable oil in a large stockpot or Dutch oven over medium-high heat. Stir pureed tomato mixture into the oil; cook and stir until the mixture thickens, about 5 minutes.\nPour water into the pot; add chicken bouillon and stir. Bring liquid to a simmer, reduce heat to medium-low, and cook mixture, stirring occasionally, until the liquid reduces slightly, about 15 minutes.\nStir chicken and black beans into the soup; bring again to a simmer and cook until beans are softened, about 15 minutes. Add carrots and cook to reheat the carrots, 2 to 3 minutes. Season soup with salt and pepper.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4477545.jpg",
    "o": "",
    "st": "allrecipes"
}