{
    "id": 239421,
    "old_rating": "4.91176",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Dough:",
        "2 tablespoons active dry yeast",
        "1/2 cup granulated sugar",
        "1/2 cup water at room temperature",
        "1 cup milk at room temperature",
        "1/4 cup butter, melted",
        "1 egg, lightly beaten",
        "1 teaspoon vanilla extract",
        "4 cups all-purpose flour",
        "1/2 teaspoon Diamond CrystalÂ® Kosher Salt",
        "Caramel Sauce:",
        "1/2 cup butter",
        "1 cup dark brown sugar, packed",
        "1/4 teaspoon Diamond CrystalÂ® Kosher Salt, or to taste",
        "3 tablespoons heavy cream",
        "1 1/3 cups chopped pecans",
        "Filling:",
        "1 cup brown sugar",
        "2 teaspoons cinnamon",
        "4 tablespoons butter, melted"
    ],
    "nut": [
        "Calories > 386 kcal",
        "Carbs > 53.3 g",
        "Cholesterol > 42 mg",
        "Fat > 17.8 g",
        "Protein > 5.1 g",
        "Sodium > 171 mg"
    ],
    "n": "Salted Caramel Pecan Sticky Buns",
    "a": "Rae",
    "r": "0",
    "s": 18,
    "des": "\"Soft, sticky, sweet, with a touch of salt and the crunch of pecans, these delightful sticky buns make a special dessert treat. My family absolutely loves them.\"",
    "ins": "Combine yeast, sugar, water and milk in a large bowl. Let sit until foamy, 5 to 10 minutes.\nMix in butter, egg, and vanilla. Stir in flour and Diamond Crystal(R) Kosher Salt and mix until dough comes together; you may need additional flour. Knead until smooth and elastic, 8 to 10 minutes. Place dough in an oiled bowl; cover with a cloth and set in a warm place to rise until doubled, 1 1/2 to 2 hours.\nSpray two 9-inch cake pans liberally with cooking spray.\nFor the caramel sauce, combine 1/2 cup butter and 1 cup dark brown sugar in a small saucepan over medium heat. Cook until sugar dissolves in the butter. Stir in the heavy cream and Diamond Crystal(R) Kosher Salt; mix well but do not bring to a boil. Sauce will be thick. Divide sauce equally into cake pans. Sprinkle equal amounts of pecans on top of caramel sauce.\nDivide dough into two equal portions and roll out each section into a rectangle approximately 14x6 inches.\nFor the filling, mix brown sugar and cinnamon together. Brush melted butter evenly on each rectangle and sprinkle with brown sugar cinnamon mix. Starting with the longer side roll up each rectangle. Cut each roll into 9 equal portions. Place rolls into prepared cake pans and let rise until doubled, about 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBake until browned and baked through, 25 to 30 minutes.\nImmediately (and carefully as sauce will be very hot) invert onto a plate. Serve warm.",
    "pt": "2 h ",
    "ct": "30 m",
    "tt": "3 h",
    "i": "1474025.jpg",
    "o": "4535667.jpg,4525250.jpg,4515416.jpg,4035720.jpg,3680671.jpg,3675072.jpg",
    "st": "allrecipes"
}