{
    "id": 239423,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "For Salted Naan Sticks:",
        "1/2 teaspoon active dry yeast",
        "1 teaspoon granulated sugar",
        "1 1/2 cups warm milk (110 degrees F)",
        "1 teaspoon Diamond CrystalÂ® Kosher Salt",
        "3 1/2 cups all-purpose flour, plus more as needed",
        "4 teaspoons melted butter, or more as needed for brushing",
        "Diamond CrystalÂ® Coarse Sea Salt, to sprinkle on top",
        "For Mango Chutney:",
        "1 tablespoon peanut oil",
        "1/2 teaspoon panch phoron (Bengali Five Spice)*",
        "1 (1/2 inch) piece fresh ginger, grated",
        "2 ripe mangoes, peeled and chopped",
        "1/4 teaspoon red chili powder or cayenne pepper",
        "1 pinch garam masala",
        "1 pinch asafoetida powder",
        "2 tablespoons jaggery (or light brown sugar)",
        "Diamond CrystalÂ® Kosher Salt, to taste"
    ],
    "nut": [
        "Calories > 288 kcal",
        "Carbs > 41.2 g",
        "Cholesterol > 6 mg",
        "Fat > 6 g",
        "Protein > 7 g",
        "Sodium > 257 mg"
    ],
    "n": "Salted Naan Sticks with Mango Chutney",
    "a": "ItalianSpice",
    "r": "0",
    "s": 12,
    "des": "\"A South Asian staple with a salty 'twist' served alongside some mango chutney for dipping. I found the spices at an Indian grocery store.\"",
    "ins": "Combine the yeast and sugar to the warm milk and let stand until a creamy foam forms on the surface, 3 to 5  minutes.\nStir in Diamond Crystal(R) Kosher Salt and 3 1/2 cups of flour to the milk mixture; mix 8 to 10 minutes. Sprinkle in additional flour as needed to keep the dough from sticking to the sides of the bowl, but do not exceed a total of 4 1/2 cups flour. Cover and let rise 2 hours.\nPunch dough down and divide into 12 equal pieces; form them into balls. Cover with plastic wrap or a clean towel and let rest for an additional 30 minutes.\nPut a pizza stone in the oven. Preheat an oven to 500 degrees F (260 degrees C).\nDivide each ball half; and roll out each half with the palm of your hands to make 2 long sticks. Pinch together at one end, then twist them around each other. Pinch them together at the other end.\nCook on pizza stone until the sticks puff up a little and small, light brown spots begin to appear, 3 to 5 minutes.\nBrush each naan stick with butter and sprinkle with Diamond Crystal(R) Coarse Sea Salt. Serve with Mango Chutney.\nFor Mango Chutney, heat oil over medium-high heat in a heavy pot. Pour in the panch phoron and cook until seeds begin to sizzle and release their fragrance, 30 seconds or so.\nUsing a microplane, grate ginger into the pan and fry for only seconds until its raw aroma goes away. Stir in the mango. Add red chili powder, garam masala powder and asafoetida and stir. Reduce heat to medium; allow mixture to simmer for 1 to 2 minutes.\nAdd powdered jaggery and Diamond Crystal(R) Kosher Salt; continue to stir and cook 2 to 3 minutes. As soon as mixture begins to caramelize, remove pot from heat.\nSpoon the mango chutney in a bowl and serve warm or at room temperature.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "1474027.jpg",
    "o": "",
    "st": "allrecipes"
}