{
    "id": 239417,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup chopped pecans",
        "1/2 cup granulated sugar",
        "6 tablespoons heavy cream",
        "9 (1 ounce) squares semi-sweet baking chocolate, divided",
        "1/8 teaspoon Diamond CrystalÂ® Kosher Salt or Coarse Sea Salt",
        "1/2 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 195 kcal",
        "Carbs > 21.2 g",
        "Cholesterol > 10 mg",
        "Fat > 12.8 g",
        "Protein > 2.1 g",
        "Sodium > 23 mg"
    ],
    "n": "Salted Caramel and Toasted Pecan Truffles",
    "a": "*~Lissa~*",
    "r": "0",
    "s": 12,
    "des": "\"Pecan caramel chocolate candies are reconstructed in this fancy and decadent confection: toasted pecans enrobed in a caramel-chocolate filling are coated in dark chocolate and accented with flaky Diamond CrystalÂ® Salt.\"",
    "ins": "Toast pecans in a dry skillet over medium heat until golden and fragrant, about 1 minute. Set aside to cool.\nHeat sugar over medium-high heat in a heavy pan or Dutch oven, stirring constantly. When sugar begins to melt, stir and cook until sugar turns a rich golden color. If color is too light, caramel flavor will be too faint.\nRemove caramelized sugar from heat; stir in cream. Return to heat and reduce heat to low. Cook and stir until caramel is well-dissolved into the cream. Remove from heat and stir in salt, vanilla, and half of the chocolate. Stir until chocolate has melted. Stir in toasted pecan bits.\nTransfer mixture to a bowl and cool slightly. Cover and refrigerate until set, about an hour.\nForm/roll into 24 small balls, about 3/4- to 1-inch, and arrange on a parchment-lined baking sheet.  Chill 1 hour.\nPlace the remaining chocolate in a microwave-safe bowl; microwave on High for about 15 seconds; stir; continue to microwave in 15-second intervals until chocolate is melted.\nUsing a fork, roll the balls in the melted chocolate and place back on the parchment-lined bake sheet.  Quickly sprinkle truffles with a few grains of Diamond Crystal(R) Kosher Salt or Coarse Sea Salt. Chill to set, about an hour.",
    "pt": "8 m",
    "ct": "10 m",
    "tt": "4 h",
    "i": "1474018.jpg",
    "o": "",
    "st": "allrecipes"
}