{
    "id": 239405,
    "old_rating": "4.94444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup butter or margarine",
        "1 1/4 teaspoons Diamond CrystalÂ® Sea Salt, divided",
        "1 cup sugar",
        "1/4 cup water",
        "3/4 cup coarsely chopped cashews, divided",
        "3/4 cup milk chocolate chips or chopped milk chocolate"
    ],
    "nut": [
        "Calories > 356 kcal",
        "Carbs > 38.7 g",
        "Cholesterol > 36 mg",
        "Fat > 22.7 g",
        "Protein > 3.1 g",
        "Sodium > 576 mg"
    ],
    "n": "Easy Cashew Sea Salt Toffee",
    "a": "magicallydelicious",
    "r": "0",
    "s": 8,
    "des": "\"Ready in minutes, this toffee takes all the guesswork out of candy making, and is by far the most requested holiday treat I make. My family won't let me in the door without a few batches in tow. Makes a great gift wrapped up in a holiday tin!\"",
    "ins": "Butter the top edges of a 2-quart microwave-safe casserole. Add butter, 1 teaspoon of the Diamond Crystal(R) Sea Salt, sugar, and water to the casserole. DO NOT STIR. Microwave on high for 6 to 8 minutes. Check contents for color change. Continue microwaving on high a minute at a time until the mixture just begins to turn a tan color. You need to watch it carefully, and remember: DON'T STIR.\nSprinkle 1/2 cup of the chopped cashews into a 9-into circle on a Silpat mat, parchment paper, or on a buttered baking sheet.\nCarefully pour the liquid mixture evenly over the top of the cashews.  Immediately sprinkle on the chocolate chips. Allow to sit for 1 minute to melt the chocolate.\nUse spatula to smooth out chocolate over the entire sheet of candy.\nSprinkle the remaining cashews and 1/4 teaspoon Diamond Crystal(R) Sea Salt over the top. Refrigerate to cool completely. When cool, break into bite-sized pieces. Store tightly covered in refrigerator.",
    "pt": "5 m",
    "ct": "8 m",
    "tt": "1 h",
    "i": "1473992.jpg",
    "o": "4458211.jpg,1824633.jpg,1731260.jpg,1719886.jpg,1719884.jpg,1637014.jpg",
    "st": "allrecipes"
}