{
    "id": 239543,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 large halibut steaks",
        "salt and ground black pepper to taste",
        "2 tablespoons olive oil",
        "2 cups sliced chanterelle mushrooms",
        "1 cup corn kernels",
        "1/3 cup diced roasted red peppers",
        "1/2 cup water",
        "1 lemon, juiced",
        "1 tablespoon butter",
        "1 tablespoon minced fresh tarragon"
    ],
    "nut": [
        "Calories > 562 kcal",
        "Carbs > 30.9 g",
        "Cholesterol > 87 mg",
        "Fat > 25.7 g",
        "Protein > 53.6 g",
        "Sodium > 533 mg"
    ],
    "n": "Grilled Halibut Steaks with Corn and Chanterelles",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"I think seafood and mushrooms are really great together, and when you add the smokiness from the grill, you have yourself a great autumn meal. Garnish with lemon wedges and micro greens. You can substitute red bell pepper for the roasted red pepper, if desired. You can substitute any mushrooms for the chanterelle mushrooms, if desired.\"",
    "ins": "Preheat grill for medium-high heat and lightly oil the grate. Season halibut steaks with salt and black pepper.\nHeat olive oil in a skillet over medium heat. Cook and stir chanterelle mushrooms with a pinch of salt in hot oil until soft and caramelized, about 10 minutes. Stir corn and peppers into mushrooms until corn is toasted, about 2 minutes.\nPour water into mushroom mixture; bring to a simmer and cook until reduced, about 5 minutes. Stir lemon juice and butter into mushroom mixture until butter melts and liquid is almost evaporated.\nCook halibut steaks on the preheated grill until until the fish flakes easily with a fork, 3 to 5 minutes per side. Divide mushroom mixture between two plates and sprinkle tarragon over each. Top mushrooms with halibut steaks.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}