{
    "id": 239535,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Turkey Salisbury Steaks:",
        "1 pound ground turkey",
        "2/3 cup bread crumbs, or to taste",
        "1 egg, beaten",
        "1 1/2 teaspoons onion powder, or to taste",
        "1 1/2 teaspoons garlic powder, or to taste",
        "1 1/2 teaspoons ground black pepper, or to taste",
        "Cranberry-Orange Gravy",
        "1 (12 ounce) package fresh cranberries",
        "1 cup orange juice",
        "3 tablespoons granular no-calorie sucralose sweetener (such as SplendaÂ®)",
        "1/4 cup water",
        "1 tablespoon cornstarch"
    ],
    "nut": [
        "Calories > 225 kcal",
        "Carbs > 22.3 g",
        "Cholesterol > 87 mg",
        "Fat > 7.3 g",
        "Protein > 18.3 g",
        "Sodium > 145 mg"
    ],
    "n": "Turkey Salisbury Steak with Cranberry-Orange Gravy",
    "a": "tashathegreat",
    "r": "0",
    "s": 6,
    "des": "\"I made this one night on a whim, not knowing what to do with the ground turkey I had taken out of the freezer. It came out amazing! I served it over baked stuffing and with green bean casserole. My two picky eaters (8 and 5) loved this recipe.\"",
    "ins": "Mix ground turkey, bread crumbs, egg, onion powder, garlic powder, and black pepper together in a large bowl; set aside for 5 minutes.\nStir cranberries, orange juice, and sweetener together in a saucepan; bring to a boil. Stir water and cornstarch together in a bowl; stream into the boiling cranberry mixture while stirring. Bring liquid again to a boil and cook until thickened to your desired consistency, 5 to 10 minutes.\nHeat a large skillet over medium heat. Shape the turkey mixture into 6 patties. Fry the patties in the skillet until completely browned on the bottom, about 7 minutes. Flip the patties and continue cooking until no longer pink in the center and the juices run clear, 3 to 4 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nPour the cranberry-orange gravy over the patties; bring to a simmer and continue cooking until the sauce thickens further, 3 to 4 minutes more.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "2736077.jpg",
    "o": "",
    "st": "allrecipes"
}