{
    "id": 239522,
    "old_rating": "4.18182",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 large head cauliflower, cut into florets and divided",
        "1 1/2 cups chopped onion",
        "2/3 cup peeled and diced russet potato",
        "1 carrot, peeled and chopped",
        "3 cloves garlic",
        "1 1/2 teaspoons salt",
        "4 cups water",
        "2 cups shredded sharp Cheddar cheese",
        "3/4 cup milk",
        "1 tablespoon minced fresh dill",
        "freshly ground black pepper to taste",
        "1 teaspoon cumin seeds (optional)"
    ],
    "nut": [
        "Calories > 240 kcal",
        "Carbs > 18 g",
        "Cholesterol > 42 mg",
        "Fat > 13.4 g",
        "Protein > 14.3 g",
        "Sodium > 887 mg"
    ],
    "n": "Cauliflower Soup with Cheese",
    "a": "kac",
    "r": "0",
    "s": 6,
    "des": "\"Excellent soup for fall or winter nights! Easy to make! Serve with extra cheese on top.\"",
    "ins": "Measure 2 cups cauliflower florets into a bowl and set aside.\nMix remaining cauliflower florets, onion, potato, carrot, garlic, and salt together in a Dutch oven or stockpot. Pour water over cauliflower mixture; bring to a boil, reduce heat to medium-low, and cook at a simmer until all vegetables are tender, 30 to 40 minutes.\nPour soup in batches into a blender no more than half full. Hold lid in place while pulsing blender a few times before leaving on to puree until smooth. Return pureed soup to the pot.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Put reserved cauliflower into the steamer basket, place lid on saucepan, and steam cauliflower until just tender, about 5 minutes; add to pot with pureed mixture.\nStir Cheddar cheese, milk, dill, and black pepper into the soup.\nHeat a small skillet over medium-high heat. Toast cumin seeds in hot skillet until lightly toasted and fragrant, 1 to 2 minutes; stir into the soup.\nContinue heating soup until heated through, 5 to 10 minutes.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "2026730.jpg",
    "o": "",
    "st": "allrecipes"
}