{
    "id": 239542,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons olive oil",
        "1 large onion, sliced",
        "1 teaspoon chopped fresh rosemary",
        "salt to taste",
        "1 tablespoon cornmeal",
        "1 prepared pizza dough",
        "1/4 teaspoon freshly ground black pepper",
        "4 ounces crumbled feta cheese",
        "1/2 cup raw pumpkin seeds, or to taste",
        "1/3 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 137 kcal",
        "Carbs > 14.9 g",
        "Cholesterol > 10 mg",
        "Fat > 6.3 g",
        "Protein > 5 g",
        "Sodium > 312 mg"
    ],
    "n": "Pumpkin Seed Flatbread with Sweet Onions and Feta",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"As I researched the health benefits of pumpkin seeds I discovered that not only did they have lots of nutritional benefits, but contained large amounts of tryptophan. Yes, that tryptophan, the 'turkey valium' you read about every year. I've always wanted to try them instead of pine nuts on various recipes. Little did I know I was really inventing an alternative medicinal treatment.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nHeat olive oil in a skillet over medium-high heat; saute onion in hot oil until slightly softened, 3 to 4 minutes. Add rosemary and a pinch of salt; saute until onions are golden and soft, about 5 minutes more.\nSpread cornmeal over the bottom of a baking sheet. Stretch pizza dough in a thin layer onto baking sheet over cornmeal. Spread onions onto dough and sprinkle black pepper over the top. Sprinkle feta cheese, pumpkin seeds, and Parmesan cheese over the top of the onions.\nBake on the bottom rack of the preheated oven for 5 minutes. Rotate the baking sheet 180 degrees and bake 5 minutes more. Transfer baking sheet to the middle rack of the oven and bake until bread is golden, crispy, and cheese is melted, about 5 minutes. Transfer flatbread to a wire rack to cool.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}