{
    "id": 239592,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 1/4 cups all-purpose flour",
        "1/2 teaspoon baking soda",
        "2 1/2 cups icing sugar, divided",
        "3/4 cup butter",
        "6 ounces BAKER'S Semi-Sweet Chocolate",
        "1/2 (250 g) package PHILADELPHIA Brick Cream Cheese",
        "1/4 cup light corn syrup",
        "2 tablespoons water",
        "2/3 cup multi-colored nonpareils (orange, red and yellow)"
    ],
    "nut": [
        "Calories > 223 kcal",
        "Carbs > 30.9 g",
        "Cholesterol > 20 mg",
        "Fat > 10.7 g",
        "Protein > 2.1 g",
        "Sodium > 84 mg"
    ],
    "n": "Chocolate Leaf Cookies",
    "a": "PHILADELPHIA Cream Cheese",
    "r": "0",
    "s": 25,
    "des": "\"These cookies are attractive as they are delicious!\"",
    "ins": "Mix flour, baking soda and 1-1/2 cups sugar until blended. Microwave butter and 3 oz. chocolate in large microwaveable bowl on HIGH 2 minutes or until butter is melted; stir until chocolate is completely melted and mixture is well blended. Add cream cheese; mix well. Gradually beat in flour mixture until blended. Refrigerate 30 minutes.\nMeanwhile, melt remaining chocolate as directed on package. Beat corn syrup, water and remaining sugar in medium bowl until blended. Add chocolate; mix well. Spoon into resealable plastic bag; seal bag.\nHeat oven to 375 degrees F (190 degrees C). Roll dough to 1/8-inch thickness on lightly floured surface. Use 3-inch cookie cutter to cut dough into leaf shapes, re-rolling scraps as necessary. Place, 2 inches apart, on parchment-covered baking sheets.\nBake 12 minutes or until edges are lightly browned. Cool on baking sheet 3 minutes. Remove to wire racks; cool completely.\nCut small piece off one bottom corner of icing bag; use to pipe icing onto cookies, then gently shake cookies to form even layer of icing. Sprinkle with nonpareils. Let stand until firm.",
    "pt": "30 m",
    "ct": "12 m",
    "tt": "1 h ",
    "i": "1556348.jpg",
    "o": "",
    "st": "allrecipes"
}