{
    "id": 239625,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound almonds",
        "8 cups all-purpose flour",
        "1/4 pound unsweetened cocoa powder",
        "2 tablespoons baking powder",
        "2 tablespoons ground cinnamon",
        "1 teaspoon salt",
        "3 cups white sugar",
        "1 1/2 cups shortening",
        "6 eggs",
        "1 (6 ounce) can evaporated milk",
        "1 teaspoon vanilla extract",
        "Frosting:",
        "1 cup confectioners' sugar",
        "1/4 teaspoon almond extract",
        "1 tablespoon water, or as needed"
    ],
    "nut": [
        "Calories > 239 kcal",
        "Carbs > 34 g",
        "Cholesterol > 24 mg",
        "Fat > 10.2 g",
        "Protein > 4.7 g",
        "Sodium > 123 mg"
    ],
    "n": "Italian Chocolate Balls  (Tuttu Balls)",
    "a": "Sam Scopellite",
    "r": "0",
    "s": 48,
    "des": "\"Delicious round chocolate Italian cookies. Store cookies in a sealed can or cookie jars.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Spread almonds onto a baking sheet.\nBake almonds until toasted and fragrant, 5 to 10 minutes. Remove baking sheet from oven and cool almonds slightly; chop.\nSift flour 2 times. Mix cocoa powder, baking powder, cinnamon, and salt together with flour in a bowl. Beat white sugar, shortening, and eggs together in a separate bowl using an electric mixer until smooth and creamy.\nMix creamed mixture into flour mixture. Add almonds, evaporated milk, and vanilla extract to flour mixture and mix well using your hands or a large spoon until dough holds together and is smooth. Roll dough into 1-inch balls and place on a baking sheet.\nBake in the oven until bottoms are slightly brown, about 10 minutes. Transfer cookies to a wire rack to cool completely.\nStir confectioners' sugar and almond extract together in a bowl; add enough water to make a thin frosting. Roll cookies in the frosting and place on a wire rack to dry.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}