{
    "id": 239607,
    "old_rating": "4.41176",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "1 cup white sugar",
        "1 cup brown sugar",
        "2 teaspoons ground cinnamon",
        "1 teaspoon baking powder",
        "1 teaspoon ground nutmeg",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon freshly grated nutmeg, or more to taste",
        "1 cup fresh cranberries, or more to taste",
        "2 cups mashed, cooked butternut squash",
        "4 large eggs, lightly beaten",
        "1/2 cup coconut oil",
        "1/2 cup safflower oil",
        "1 (1 inch) piece fresh ginger, peeled and pressed through a garlic press"
    ],
    "nut": [
        "Calories > 228 kcal",
        "Carbs > 32.2 g",
        "Cholesterol > 31 mg",
        "Fat > 10.3 g",
        "Protein > 3 g",
        "Sodium > 62 mg"
    ],
    "n": "Butternut Squash and Cranberry Muffins",
    "a": "InvisiGyrl",
    "r": "0",
    "s": 24,
    "des": "\"I got some butternut squash and cranberries (both I am not fond of) in my 'Bountiful Basket' last week. Not having a clue what to do with them, I came up with this surprisingly yummy muffin. I made up this recipe with what I had on hand. It is really very light, tasty, and not too sweet. I serve mine with honey or sweetened cream cheese. If possible, always choose organic.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease or line 24 muffin cups with paper liners.\nMix flour, white sugar, brown sugar, cinnamon, baking powder, ground nutmeg, cloves, baking soda, and freshly grated nutmeg together in a bowl; fold in cranberries. Beat butternut squash, eggs, coconut oil, safflower oil, and ginger together in a separate bowl until smooth; stir into flour mixture until batter is just mixed. Spoon batter into the prepared muffin cups.\nBake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, about 25 minutes.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "1528573.jpg",
    "o": "",
    "st": "allrecipes"
}