{
    "id": 239639,
    "old_rating": "4.72222",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup white sugar",
        "3 eggs, separated",
        "2 tablespoons brandy",
        "2 cups brewed espresso, cooled, divided",
        "2 (8 ounce) packages mascarpone cheese",
        "1 pinch white sugar",
        "30 ladyfingers (such as SavoiardiÂ®)",
        "3 tablespoons unsweetened cocoa powder"
    ],
    "nut": [
        "Calories > 324 kcal",
        "Carbs > 25.7 g",
        "Cholesterol > 155 mg",
        "Fat > 21.6 g",
        "Protein > 7.5 g",
        "Sodium > 84 mg"
    ],
    "n": "Authentic Tiramisu",
    "a": "Kim's Cooking Now!",
    "r": "0",
    "s": 12,
    "des": "\"On my first trip to Italy to meet my husband's family back in 1995, I didn't speak a word of Italian. But I did learn how to make great 'dolci' from his sister, Maria. This was her recipe and now when we go back they ask me to make it!\"",
    "ins": "Beat 1/2 cup sugar, egg yolks, brandy, and 1 tablespoon espresso together in a bowl using an electric mixer until smooth, 2 to 3 minutes. Add mascarpone cheese to sugar-egg mixture and beat until well blended, 3 to 5 minutes.\nBeat egg whites and a pinch sugar in a bowl using an electric mixer until stiff peaks form. Gently fold egg whites into mascarpone mixture.\nPour remaining espresso into a shallow dish. Dip 1 side of each ladyfinger into the espresso and arrange on a serving platter in 2 horizontal rows of 6 with 2 1/2 ladyfingers in opposite direction on both ends to form a rectangular shape.\nSpread 1/2 of the mascarpone mixture onto the ladyfinger layer and dust with 1/2 of the cocoa powder. Repeat with remaining ladyfingers dipped in espresso, mascarpone mixture, and cocoa powder. Refrigerate tiramisu until ladyfingers have softened from the espresso and mascarpone mixture, 2 to 3 hours.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "3416470.jpg",
    "o": "4518717.jpg,3899802.jpg,3614081.jpg,3315700.jpg,3075517.jpg,2687906.jpg",
    "st": "allrecipes"
}