{
    "id": 239678,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 (6 inch) corn tortillas, cut into 1-inch strips",
        "1 tablespoon vegetable oil",
        "1 medium onion, chopped",
        "1 teaspoon dried oregano leaves, crushed",
        "2 cloves garlic, minced",
        "1 (10.75 ounce) can Campbell'sÂ® Condensed Tomato, Chipotle & Olive Oil Soup",
        "1 cup water",
        "2 cups shredded cooked chicken",
        "1/4 teaspoon freshly cracked black pepper",
        "1 cup shredded Monterey Jack cheese or crumbled queso fresco",
        "2 tablespoons chopped fresh cilantro leaves",
        "4 wedges lime"
    ],
    "nut": [
        "Calories > 487 kcal",
        "Carbs > 47.1 g",
        "Cholesterol > 83 mg",
        "Fat > 19.6 g",
        "Protein > 31.5 g",
        "Sodium > 773 mg"
    ],
    "n": "Chicken Chilaquiles from Campbell's Kitchen",
    "a": "Campbell's Kitchen",
    "r": "0",
    "s": 4,
    "des": "\"This Mexican-inspired dish features a combination of shredded cooked chicken, tomato chipotle soup, onion, garlic, cheese and crispy tortilla strips. It's easy to prepare, super delicious and guaranteed to be a hit at your dinner table!\"",
    "ins": "Heat the oven to 350 degrees F.  Arrange the tortilla strips on 2 baking sheets.\nBake for 10 minutes or until the tortilla strips are crisp and lightly browned.  Reserve 5 tortilla strips.\nHeat the oil in a 12-inch skillet over medium-high heat.  Add the onion and oregano and cook for 2 minutes, stirring occasionally.  Add the garlic and cook and stir for 1 minute.\nStir in the soup and water and heat to a boil.  Reduce the heat to medium.  Cook, uncovered, for 5 minutes.  Stir in the chicken and black pepper and cook until the mixture is hot and bubbling.\nStir in the remaining tortilla strips and cook until the mixture is hot.  Remove the skillet from the heat.  Sprinkle the chicken mixture with the cheese.  Top with the reserved tortilla strips and the cilantro, if desired.  Serve with the lime wedges.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "1502846.jpg",
    "o": "",
    "st": "allrecipes"
}