{
    "id": 239616,
    "old_rating": "4.19412",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "olive oil cooking spray",
        "3/4 cup gluten-free baking flour (such as Premium GoldÂ® Flax and Ancient Grains All-Purpose Flour)",
        "1 cup water",
        "1/2 teaspoon garlic powder, or to taste",
        "salt and ground black pepper to taste",
        "2 heads cauliflower, cut into bite-size pieces",
        "2 tablespoons butter",
        "1/2 cup hot pepper sauce (such as Frank's RedHotÂ®)",
        "1 teaspoon honey"
    ],
    "nut": [
        "Calories > 218 kcal",
        "Carbs > 36.2 g",
        "Cholesterol > 15 mg",
        "Fat > 7.1 g",
        "Protein > 8.5 g",
        "Sodium > 907 mg"
    ],
    "n": "Buffalo Cauliflower",
    "a": "ddmama",
    "r": "0",
    "s": 4,
    "des": "\"This is a great substitution for buffalo wings! Can be made gluten-free, vegan, or vegetarian. Make sure to coat your cookie sheet well with oil or they will stick. Husband and kids give this two thumbs up! Dip this in ranch or blue cheese for even more added flavor, but it doesn't need it.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C). Lightly grease a baking sheet with cooking spray.\nMix flour, water, garlic powder, salt, and pepper together in a bowl using a whisk until batter is smooth and somewhat runny. Add cauliflower to batter and mix until cauliflower is coated; spread onto the baking sheet.\nBake in the preheated oven until lightly browned, 20 to 25 minutes.\nMelt butter in a saucepan over medium heat. Remove saucepan from heat and stir hot pepper sauce and honey into butter until smooth. Brush hot sauce mixture over each cauliflower piece, repeating brushing until all the hot sauce mixture is used.\nBake in the oven until cauliflower is browned, about 10 minutes. Remove baking sheet from oven and allow the cauliflower to cool 10 to 15 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "4506886.jpg",
    "o": "4506886.jpg,4501226.jpg,4481949.jpg,4481931.jpg,4477954.jpg,4471933.jpg",
    "st": "allrecipes"
}