{
    "id": 239609,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup pepitas",
        "olive oil cooking spray",
        "1/4 teaspoon cayenne pepper",
        "salt and ground black pepper to taste",
        "1 pound Brussels sprouts, trimmed and thinly sliced",
        "1/2 pound curly kale, chopped",
        "1/2 pound lacinato (dinosaur) kale, chopped",
        "1/2 pound napa cabbage, chopped",
        "1 1/2 cups sweetened dried cranberries (such as CraisinsÂ®)",
        "1 (15 ounce) can mandarin oranges, drained and sliced in half, or more to taste",
        "3 green onions, thinly sliced",
        "4 fresh strawberries, sliced, or to taste (optional)",
        "1 (12 ounce) bottle poppy seed salad dressing (such as Marie'sÂ®)",
        "3 tablespoons orange juice concentrate"
    ],
    "nut": [
        "Calories > 631 kcal",
        "Carbs > 71.6 g",
        "Cholesterol > 21 mg",
        "Fat > 34.3 g",
        "Protein > 10.4 g",
        "Sodium > 524 mg"
    ],
    "n": "Kale, Cabbage, and Brussels Sprout Salad",
    "a": "Crystal S",
    "r": "0",
    "s": 6,
    "des": "\"Hale and hearty, this kale salad is a powerhouse of nutrients that is very easy to eat! The salad bursts with the flavor of mandarin oranges, sweet and tart strawberries, and has a pleasant poppy seed dressing. When mangoes are in season, you can substitute them for the mandarin oranges or walnuts and pomegranates, toasted cashews or walnuts, and apples in the fall for different flavors. The possibilities are endless!\"",
    "ins": "Pour pepitas into a bowl and coat with cooking spray. Sprinkle cayenne pepper, salt, and pepper over pepitas and toss to coat.\nCook and stir coated pepitas in a skillet over medium-low heat until lightly toasted and fragrant, about 5 minutes. Remove skillet from heat and allow pepitas to cool.\nCombine Brussels sprouts, curly kale, lacinato kale, napa cabbage, dried cranberries, mandarin oranges, green onions, strawberries, and toasted pepitas in a large bowl.\nMix poppy seed dressing and orange juice together in a bowl; pour over Brussels sprouts mixture and toss well.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "25 m",
    "i": "2139605.jpg",
    "o": "",
    "st": "allrecipes"
}