{
    "id": 239786,
    "old_rating": "4.47059",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds boneless pork butt (shoulder)",
        "8 cloves garlic, peeled",
        "1/4 cup olive oil",
        "1 orange, juiced, orange parts of peel removed and sliced into thin strips",
        "1 tablespoon kosher salt",
        "2 bay leaves, torn in half",
        "1 teaspoon ground black pepper",
        "1 teaspoon ground cumin",
        "3/4 teaspoon ground cinnamon",
        "1/2 teaspoon Chinese 5-spice powder"
    ],
    "nut": [
        "Calories > 317 kcal",
        "Carbs > 2.1 g",
        "Cholesterol > 89 mg",
        "Fat > 22.6 g",
        "Protein > 25.5 g",
        "Sodium > 1036 mg"
    ],
    "n": "Crispy Pork Carnitas",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"There's nothing like carnitas. Cubes of fragrantly spiced pork are slowly cooked in lard until they're crispy on the outside while at the same time remaining soft and succulent inside. Bust some up on a warm tortilla, drizzle with braising liquid, top with a little salsa, onion, and cilantro, and you're probably enjoying the world's best taco.\"",
    "ins": "Preheat oven to 275 degrees F (135 degrees C).\nRemove fat from pork; cut pork meat into 2-inch cubes and roughly chop fat.\nMix pork, garlic, olive oil, orange peel, orange juice, salt, bay leaves, black pepper, cumin, cinnamon, and 5-spice powder together in a bowl until pork is coated completely. Transfer mixture to a 9x13-inch baking dish. Place baking dish on a baking sheet and cover baking dish tightly with heavy-duty aluminum foil.\nBake in the preheated oven until pork is fork-tender, about 3 1/2 hours.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nTransfer meat to a colander set over a bowl. Remove garlic, bay leaves, and orange peels from baking dish and pour accumulated juices from the baking dish over meat in colander into the bowl. Return meat to the baking dish and drizzle accumulated juices over each piece of meat.\nCook meat under the preheated broiler for 3 minutes. Drizzle more accumulated juices over meat and continue broiling until crispy, 3 to 5 minutes. Transfer pork to a serving plate and drizzle more accumulated juices over the top.",
    "pt": "15 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "4508861.jpg",
    "o": "4508861.jpg,4184332.jpg,4092788.jpg,3855016.jpg,3849731.jpg,3470755.jpg",
    "st": "allrecipes"
}