{
    "id": 239700,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package spaghetti",
        "1 tablespoon oil",
        "1 onion, chopped",
        "1 bunch fresh parsley, stems removed and leaves chopped",
        "3 cloves garlic, minced",
        "9 cardamom pods",
        "1 cinnamon stick",
        "1/2 teaspoon ground turmeric",
        "1/2 teaspoon cumin seeds",
        "2 (14.5 ounce) cans Italian-style diced tomatoes",
        "1 tablespoon white sugar",
        "1/2 (7 ounce) container Greek yogurt",
        "kosher salt to taste"
    ],
    "nut": [
        "Calories > 288 kcal",
        "Carbs > 53.7 g",
        "Cholesterol > 3 mg",
        "Fat > 4 g",
        "Protein > 9.7 g",
        "Sodium > 518 mg"
    ],
    "n": "Culture-Blend Spaghetti",
    "a": "LADYBIRD1995",
    "r": "0",
    "s": 8,
    "des": "\"I was looking for a way to use spices that help with health such as turmeric, cinnamon, and cardamom pods, but I had spaghetti. So I made up this recipe. My family really enjoyed it. It's kind of a blend of the Indian recipes I've tried recently and regular spaghetti. My husband thought it might taste good with chicken added.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain and return spaghetti to pot.\nHeat oil in a skillet over medium heat. Cook and stir onion in the hot oil until softened, about 5 minutes. Add parsley, garlic, cardamom pods, cinnamon stick, turmeric, and cumin seeds to onion; cook and stir until garlic is softened, 2 to 3 minutes. Stir tomatoes and sugar into onion mixture and cook until heated through and fragrant, 5 to 10 minutes.\nPour tomato sauce mixture over spaghetti and mix well. Stir yogurt and salt into spaghetti mixture.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}