{
    "id": 239853,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (1 pound) chorizo sausage",
        "1 (10 ounce) container refrigerated pizza crust",
        "1 (15 ounce) jar nacho cheese sauce, or to taste",
        "1 (16 ounce) package frozen hash brown potatoes, thawed",
        "6 eggs",
        "1/2 cup salsa",
        "1 tablespoon taco seasoning mix, or more to taste",
        "2 tablespoons butter",
        "1 cup shredded Mexican cheese blend, or more to taste"
    ],
    "nut": [
        "Calories > 422 kcal",
        "Carbs > 24.2 g",
        "Cholesterol > 145 mg",
        "Fat > 29.6 g",
        "Protein > 18.4 g",
        "Sodium > 1196 mg"
    ],
    "n": "Mexican Breakfast Pizza",
    "a": "Laura Burger Pozdol",
    "r": "0",
    "s": 12,
    "des": "\"Breakfast pizza is topped with chorizo, nacho cheese sauce, spiced-up eggs, and frozen hash browns using refrigerated pizza crust. A tasty pizza for anyone who enjoys spicy foods. You can adjust the heat intensity to satisfy any taste buds by choosing mild cheese sauce and chorizo.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.\nHeat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until cooked through, 5 to 7 minutes; drain and discard grease.\nSpread pizza crust dough onto the prepared baking sheet; top with a layer of nacho cheese sauce. Layer hash brown potatoes evenly over the nacho cheese layer. Sprinkle chorizo over potatoes.\nBeat eggs, salsa, and taco seasoning together in a bowl using a whisk until smooth.\nMelt butter in a skillet over medium heat; cook and stir egg mixture until eggs are set and scrambled, 5 to 7 minutes. Transfer scrambled eggs to a plate; allow to cool until easily handled. Sprinkle scrambled eggs over chorizo layer and top with Mexican cheese blend.\nBake in the preheated oven until crust is golden brown and cheese is melted and bubbling, 15 to 20 minutes.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "1643971.jpg",
    "o": "",
    "st": "allrecipes"
}