{
    "id": 239855,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups water",
        "1 cup quinoa",
        "2 tablespoons olive oil",
        "1/2 onion, chopped",
        "1 red bell pepper, chopped",
        "1 pinch Himalayan salt to taste",
        "1 1/4 pounds ground turkey",
        "1 pinch freshly ground black pepper to taste",
        "4 cloves garlic, minced",
        "1 teaspoon minced fresh sage",
        "1 teaspoon minced fresh rosemary",
        "1/2 cup grated Mizithra cheese"
    ],
    "nut": [
        "Calories > 330 kcal",
        "Carbs > 32.6 g",
        "Cholesterol > 77 mg",
        "Fat > 15.1 g",
        "Protein > 24.6 g",
        "Sodium > 303 mg"
    ],
    "n": "Quinoa with Ground Turkey",
    "a": "halfnotes",
    "r": "0",
    "s": 6,
    "des": "\"This was a dish I threw together last minute that was a success! My husband and kids loved it and will be a dish we have often. The cheese really complements the dish and should not be left out.\"",
    "ins": "Bring water and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water has been absorbed, 15 to 20 minutes.\nHeat olive oil in a skillet over medium heat. Cook and stir onion and red bell pepper in the hot oil until tender and starting to brown, about 10 minutes; season with salt.\nGenerously season ground turkey with salt and pepper; add to onion mixture and increase temperature to medium-high. Cook and stir turkey mixture until almost browned and crumbly, 5 to 7 minutes; drain excess grease and reduce heat to medium-low. Add garlic, sage, and rosemary to turkey mixture; cook and stir until fragrant and turkey is browned, 2 to 3 minutes more.\nMix quinoa into turkey mixture and cook until quinoa is heated through, 2 to 3 minutes. Add Mizithra cheese to quinoa and turkey and remove skillet from heat; season with salt and pepper.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "4082195.jpg",
    "o": "",
    "st": "allrecipes"
}