{
    "id": 239864,
    "old_rating": "4.18182",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Crust:",
        "1 (4.8 ounce) package graham crackers",
        "2 tablespoons ground ginger",
        "6 tablespoons butter, melted",
        "Filling:",
        "3 (8 ounce) packages cream cheese, softened",
        "1/2 cup white sugar",
        "1/2 cup packed brown sugar",
        "1 (15 ounce) can pumpkin puree",
        "1 tablespoon ground cinnamon",
        "1 tablespoon ground ginger",
        "2 teaspoons ground nutmeg",
        "1 teaspoon ground cloves",
        "1/4 teaspoon salt",
        "3 eggs",
        "Topping:",
        "1 cup sour cream",
        "3 tablespoons confectioners' sugar, or to taste",
        "1 tablespoon vanilla extract",
        "1 pinch ground cinnamon, for garnish"
    ],
    "nut": [
        "Calories > 226 kcal",
        "Carbs > 17.6 g",
        "Cholesterol > 66 mg",
        "Fat > 16 g",
        "Protein > 3.9 g",
        "Sodium > 220 mg"
    ],
    "n": "Pumpkin Cheesecake Cupcakes",
    "a": "Cassandra",
    "r": "0",
    "s": 24,
    "des": "\"After deciding against buying a springform pan, but wanting cheesecake for Thanksgiving, I combined a few recipes to get this final product. It got great reviews from all the family! These cupcakes really should be made the day before, as well as the frosting. I store mine in tupperware in the fridge so they set up nicely.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line 24 muffin cups with foil liners.\nCrush graham crackers and 2 tablespoons ground ginger together in a resealable plastic bag; pour into a bowl. Add butter to graham cracker mixture and mix with a fork or pastry blender until blended.\nBeat cream cheese, white sugar, and brown sugar together in a large bowl until creamy; beat in pumpkin puree. Add cinnamon, 1 tablespoon ginger, nutmeg, cloves, and salt; add eggs 1 at a time, beating well after each addition.\nPress 1 tablespoon graham cracker mixture into the base of each prepared muffin cup, pressing mixture slightly up the sides of the liners. Fill each cup with cream cheese mixture.\nBake in the preheated oven until tops are smooth and cupcakes jiggle slightly when moved, about 15 minutes. Cool in the pans for 10 minutes before transferring to a wire rack to cool.\nStir sour cream, confectioners' sugar, and vanilla extract together in a bowl until frosting is smooth. Top each cheesecake with the topping and sprinkle with cinnamon.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "4006268.jpg",
    "o": "",
    "st": "allrecipes"
}