{
    "id": 239836,
    "old_rating": "4.1875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons unsalted butter",
        "5 cloves garlic",
        "1 green bell pepper, diced",
        "1 small onion, chopped",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1 cup white wine",
        "1 cup chicken broth",
        "2 tablespoons cornstarch",
        "1/4 cup cold water",
        "1/4 cup heavy cream",
        "1/4 cup grated Romano cheese",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 254 kcal",
        "Carbs > 12.5 g",
        "Cholesterol > 49 mg",
        "Fat > 15.1 g",
        "Protein > 7.4 g",
        "Sodium > 421 mg"
    ],
    "n": "White Wine and Mushroom Sauce",
    "a": "Karen Lindsay",
    "r": "0",
    "s": 4,
    "des": "\"Mushrooms, peppers, onions, and garlic combined with white wine make a simply elegant dish.\"",
    "ins": "Melt butter in a heavy skillet over medium heat. Cook garlic in hot butter until browned, about 5 minutes.\nMash the garlic in the skillet and stir into the butter; add green bell pepper and onion and cook until the onion is translucent, 5 to 7 minutes.\nStir mushrooms into the pepper and onion mixture; cook and stir until the mushrooms are slightly browned, about 5 minutes. Stream heavy cream into the mixture while stirring; add Romano cheese and Parmesan cheese. Continue cooking until the mixture is hot and the cheese is melted, 5 to 10 minutes more.\nPour wine into the skillet and cook until the liquid is reduced in volume by half, 5 to 10 minutes; add chicken broth, bring to a simmer, and cook until slightly reduced, about 5 minutes.\nMix water and cornstarch together in a small bowl until cornstarch is completely dissolved; stir into the liquid in the skillet and cook, stirring regularly, until the liquid is thickened, 5 to 10 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "3267170.jpg",
    "o": "",
    "st": "allrecipes"
}