{
    "id": 239889,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon olive oil",
        "1 3/4 cups diced onions",
        "1 teaspoon minced garlic",
        "1 (26 ounce) can cream of chicken soup",
        "1/4 cup white wine",
        "2 teaspoons ground black pepper",
        "1 teaspoon herbes de Provence",
        "1 teaspoon poultry seasoning",
        "1/2 teaspoon dried oregano",
        "1/4 teaspoon dried basil",
        "salt to taste",
        "4 cups cubed cooked turkey",
        "1 1/4 cups diced potatoes",
        "1 cup frozen peas",
        "1 cup diced carrots",
        "2 pastries for 9-inch double-crust pies"
    ],
    "nut": [
        "Calories > 490 kcal",
        "Carbs > 40.1 g",
        "Cholesterol > 40 mg",
        "Fat > 27 g",
        "Protein > 20.3 g",
        "Sodium > 782 mg"
    ],
    "n": "\"Black Friday\" Turkey Pot Pie",
    "a": "Bordeaux",
    "r": "0",
    "s": 12,
    "des": "\"Working retail for 20+ years means having something easy to heat at home for your own sanity and the hungry loved ones at home once the dust settles at work and as the weekend unwinds. This recipe makes enough for two pies using ingredients left over from \nthe Thanksgiving day feast. Open a bottle of Beaujolais and enjoy!\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nHeat olive oil in a deep skillet over medium heat; cook and stir onions and garlic until onions are translucent, about 5 minutes. Add cream of chicken soup, wine, black pepper, herbes de Provence, poultry seasoning, oregano, basil, and salt to onion mixture and bring to a simmer; remove skillet from heat.\nGently stir turkey, potatoes, peas, and carrots into soup mixture until filling is evenly mixed.\nFit 2 pie crusts into two 9-inch pie dishes. Pour filling into the pie crusts and top each with a second pie crust, pinching the edges together to seal. Cut several slits in the top crust of each pie for ventilation.\nBake in the preheated oven until crusts are golden brown and filling is bubbling, 30 to 35 minutes. Cool pies for 10 minutes before serving.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}