{
    "id": 239879,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups finely crushed pretzels",
        "2 cups white sugar, divided",
        "3/4 cup butter, melted",
        "4 (250 g) packages PHILADELPHIA Brick Cream Cheese, softened",
        "3 tablespoons butterscotch-flavoured liqueur",
        "5 eggs",
        "1/4 cup caramel sauce",
        "1 1/4 cups whipping cream, divided",
        "1 1/4 cups BAKER'S Semi-Sweet Chocolate Chips"
    ],
    "nut": [
        "Calories > 632 kcal",
        "Carbs > 53.7 g",
        "Cholesterol > 173 mg",
        "Fat > 44.7 g",
        "Protein > 9.4 g",
        "Sodium > 490 mg"
    ],
    "n": "Caramel-Pretzel Cheesecake",
    "a": "PHILADELPHIA Cream Cheese",
    "r": "0",
    "s": 16,
    "des": "\"This rich, chocolate ganache-topped caramel cheesecake has a delightfully contrasting salted pretzel crust.\"",
    "ins": "Heat oven to 350 degrees F (175 degrees C).\nCombine pretzel crumbs, 1/2 cup sugar and butter; press onto bottom and 2 inches up side of 9-inch springform pan.\nReserve 2 tablespoons of the remaining sugar. Beat remaining sugar with cream cheese in large bowl with mixer until blended. Add liqueur; mix well. Add eggs, 1 at a time, mixing on low speed after each just until blended; pour into crust.\nBake 1 hour to 1 hour 5 minutes or until centre is almost set. Run knife around rim of pan to loosen cake; cool before removing rim. Refrigerate cheesecake 4 hours.\nSpoon caramel sauce over cheesecake, spreading to within 2 inches of edge. Bring 1/4 cup whipping cream to boil in small saucepan. Remove from heat. Add chocolate chips; stir until melted. Let stand 10 minutes or until slightly thickened. Pour over cheesecake; spread to completely cover top.\nBeat remaining cream in medium bowl with mixer on high speed until soft peaks form. Add reserved sugar; beat until stiff peaks form. Spoon into pastry bag fitted with star tip; use to pipe whipped cream onto cheesecake just before serving.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "6 h ",
    "i": "1558926.jpg",
    "o": "",
    "st": "allrecipes"
}