{
    "id": 239865,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons butter, or as needed",
        "2 cups white sugar",
        "1 cup milk",
        "2 (1 ounce) squares unsweetened chocolate",
        "1 tablespoon light corn syrup",
        "1/8 teaspoon salt",
        "2 tablespoons butter, cut into pieces",
        "1 teaspoon vanilla extract",
        "1/2 cup chopped nuts (optional)"
    ],
    "nut": [
        "Calories > 239 kcal",
        "Carbs > 38.3 g",
        "Cholesterol > 12 mg",
        "Fat > 10 g",
        "Protein > 2.3 g",
        "Sodium > 63 mg"
    ],
    "n": "Nuclear-Era Fudge",
    "a": "Brent Hagwood",
    "r": "0",
    "s": 12,
    "des": "\"Made in the microwave. The name comes from an uncle who wouldn't eat this tasty treat back when microwave ovens were a relatively new household appliance; he was afraid of the radiation. My, how far we've come!\"",
    "ins": "Grease a loaf pan and a deep 3-quart microwave-safe casserole dish with the 2 tablespoons butter.\nCombine sugar, milk, chocolate, syrup and salt in the casserole dish. Cover dish with plastic wrap.\nHeat sugar mixture in the microwave oven on High for 5 minutes; stir well. Remove plastic and continue to cook in the microwave until the chocolate mixture reaches soft-ball stage, about 235 degrees (113 degrees F), 4 to 7 minutes. Stir again thoroughly and continue cooking on High for 6 to 7 minutes. Lie butter atop the chocolate mixture and set aside to let it melt as the chocolate mixture cools.\nStir vanilla into the cooled chocolate mixture; beat continuously with a wooden spoon until the fudge is thick and starts to lose its shine. Fold nuts through the fudge; spread quickly into the prepared loaf pan.\nLet fudge sit until set, 30 to 40 minutes. Cut while still slightly warm.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}