{
    "id": 239838,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cashew Butter:",
        "2 cups roasted, salted cashews",
        "4 teaspoons peanut oil, divided",
        "7 teaspoons water, divided",
        "Cookies:",
        "1/4 cup packed light brown sugar",
        "1/4 cup white sugar",
        "1/4 cup coconut oil",
        "1/4 cup unsalted butter, softened",
        "1 large egg",
        "1 1/2 cups quinoa flour",
        "3/4 teaspoon baking soda",
        "1/2 teaspoon xanthan gum",
        "1/2 teaspoon ground cardamom",
        "1/8 teaspoon ground mace",
        "2 cups unsweetened coconut flakes"
    ],
    "nut": [
        "Calories > 425 kcal",
        "Carbs > 30.3 g",
        "Cholesterol > 26 mg",
        "Fat > 32.3 g",
        "Protein > 7.6 g",
        "Sodium > 247 mg"
    ],
    "n": "Coconut Cashew Cookies",
    "a": "smallbitesbigworld",
    "r": "0",
    "s": 12,
    "des": "\"I just love nuts, especially cashews! So, about 15 years ago I started experimenting with making a cashew cookie based on the Betty CrockerÂ® peanut butter cookie recipe. Over time, I have become gluten-free, so I've also tried a variety of gf flours. Finally, I meet with success! This is a moist cookie that holds up to dunking in tea or coffee with a nutty, light, mildly sweet flavor that is a bit exotic. Make these for afternoon tea parties or pull some out for surprise guests.\"",
    "ins": "Place cashews, 1 tablespoon peanut oil, and 1 teaspoon water in a food processor or blender; pulse until cashews are ground. Add 1 tablespoon water to cashew mixture and pulse until a thick and chunky paste starts to form. Add remaining 1 tablespoon water and 1 teaspoon peanut oil to mixture and pulse until desired consistency is reached. Measure 1/2 cup cashew butter and store remaining cashew butter in a container in the refrigerator for another use.\nMix brown sugar, white sugar, cashew butter, coconut oil, butter, and egg in a large bowl. Combine quinoa flour, baking soda, xanthan gum, cardamom, and mace in a separate bowl; pour into sugar mixture and mix until dough easily forms into a ball. Cover bowl with plastic wrap and refrigerate dough for 1 1/2 hours.\nPreheat oven to 375 degrees F (190 degrees C).\nSpread coconut flakes into a shallow bowl. Form cookie dough into small round balls using a spring-loaded scoop. Roll each cookie dough ball in the coconut and arrange on a baking sheet. Press each ball with a fork dipped in quinoa flour, making a criss-cross pattern.\nBake in the preheated oven until cookies are lightly browned on the edges, about 8 minutes. Cool cookies on the baking sheet for 2 minutes before transferring to a wire rack to cool completely.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}