{
    "id": 239827,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 russet potatoes, peeled and cubed",
        "3 carrots, sliced",
        "3 tablespoons olive oil",
        "3 skinless, boneless chicken breast halves, cut into bite-size pieces",
        "1 large onion, diced",
        "6 cloves garlic, minced, or more to taste",
        "3 tablespoons hot (Madras) curry powder",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon cayenne pepper, or to taste",
        "2 (15 ounce) cans garbanzo beans (chickpeas), drained and rinsed",
        "1 (14.5 ounce) can fire-roasted diced tomatoes, with juice",
        "1 (6 ounce) can tomato paste",
        "3 tablespoons lemon juice",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 279 kcal",
        "Carbs > 39 g",
        "Cholesterol > 24 mg",
        "Fat > 7.5 g",
        "Protein > 15.6 g",
        "Sodium > 577 mg"
    ],
    "n": "Timm Curry",
    "a": "Barryxxiv",
    "r": "0",
    "s": 8,
    "des": "\"Garbanzo beans, cubes of seared chicken breast, carrots, and potatoes simmer until tender in a blend of spices and tomato. Serve by itself in a bowl or over rice. Also great over plain quinoa if you're really watching the calories/carbs.\"",
    "ins": "Place potatoes into a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until halfway tender, about 8 minutes. Drain and reserve potato-cooking water.\nPlace carrots into a pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until halfway tender, about 4 minutes. Drain.\nHeat olive oil in a large Dutch oven over medium-high heat. Saute chicken and onion in hot oil until onion is translucent and chicken is no long pink in the center, 5 to 10 minutes.\nReduced heat to medium. Stir garlic, curry powder, cinnamon, cloves, and cayenne pepper into chicken mixture; cook and stir until fragrant, about 2 minutes.\nStir potatoes, carrots, garbanzo beans, diced tomatoes with juice, tomato paste, and lemon juice into chicken mixture. Pour reserved potato water into chicken mixture until desired consistency is reached, about 2 cups. Cook, stirring occasionally, until heated through and potatoes and carrots are tender, 10 to 15 minutes more. Season with salt and black pepper.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "3957841.jpg",
    "o": "",
    "st": "allrecipes"
}