{
    "id": 239976,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups pitted dates, chopped",
        "1/2 cup water",
        "1/4 cup brown sugar",
        "1 tablespoon cider vinegar",
        "1/2 cup milk",
        "2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "2 1/2 cups regular rolled oats",
        "1 1/2 cups brown sugar",
        "1/2 cup melted butter",
        "1/2 cup butter-flavored shortening (such as CriscoÂ®), melted"
    ],
    "nut": [
        "Calories > 497 kcal",
        "Carbs > 81.5 g",
        "Cholesterol > 21 mg",
        "Fat > 18.2 g",
        "Protein > 5.6 g",
        "Sodium > 175 mg"
    ],
    "n": "Date Turnovers",
    "a": "Colleen L",
    "r": "0",
    "s": 12,
    "des": "\"This is my own recipe that I perfected after a few not so perfect batches. I have been making these cookies for several years and everyone loves them.\"",
    "ins": "Heat dates, water, and 1/4 cup brown sugar in a saucepan over medium heat; cook until dates are very soft, about 5 minutes. Set aside to cool to room temperature.\nStir vinegar into milk in a bowl; set aside to curdle, about 10 minutes.\nWhisk flour and baking soda together in a large bowl; stir in oats and 1 1/2 cups brown sugar. Stir butter, shortening, and milk mixture into flour mixture; cover dough and refrigerate until firm, about 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nRoll dough out on a lightly floured surface about 1/8-inch thick; cut dough circles with a round cookie cutter. Place about 1 tablespoon date mixture in the center of each circle; fold circle in half and press edges together tightly to seal. Place cookies on the prepared baking sheets.\nBake in the preheated oven until golden, about 10 minutes. Remove to cool completely on a wire rack.",
    "pt": "45 m",
    "ct": "15 m",
    "tt": "2 h ",
    "i": "1725635.jpg",
    "o": "",
    "st": "allrecipes"
}