{
    "id": 239922,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large sweet potato, peeled and cut into chunks",
        "1 1/2 cups all-purpose flour",
        "1 cup white sugar",
        "1 teaspoon baking powder",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "3/4 cup butter",
        "1/2 cup pumpkin seeds",
        "1/2 cup brown sugar",
        "3 large ripe bananas, mashed",
        "1/2 cup golden raisins (optional)"
    ],
    "nut": [
        "Calories > 368 kcal",
        "Carbs > 60.1 g",
        "Cholesterol > 62 mg",
        "Fat > 13.2 g",
        "Protein > 4.5 g",
        "Sodium > 159 mg"
    ],
    "n": "Banana Sweet Potato Cake",
    "a": "Kath",
    "r": "0",
    "s": 12,
    "des": "\"Sweet bananas and sweet potatoes make up this moist cake. I add candied pumpkin seeds and vanilla.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 5x8-inch baking dish.\nPlace sweet potato into a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and mash sweet potato until smooth.\nSift flour, white sugar, and baking powder together in a large bowl. Whisk eggs and vanilla extract together in another large bowl.\nMelt butter in a saucepan over medium heat; cook and stir pumpkin seeds and brown sugar in hot butter until brown sugar is melted, 1 to 2 minutes. Stir bananas and mashed sweet potato into pumpkin seed mixture. Remove from heat and cool slightly.\nStir banana mixture into egg mixture until well-combined. Pour banana-egg mixture into flour mixture and stir until batter is just combined; stir in raisins. Pour into prepared baking dish.\nBake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, about 1 hour.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "3992549.jpg",
    "o": "",
    "st": "allrecipes"
}