{
    "id": 240092,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds beef neck bones",
        "1 onion, cut into chunks",
        "3 cups tomato sauce, or more to taste",
        "1 cup water, or more as needed",
        "1 tablespoon chopped fresh parsley, or to taste",
        "1 tablespoon chopped fresh oregano, or to taste",
        "1 pinch red pepper flakes, or to taste",
        "salt and freshly ground black pepper to taste",
        "1 pound penne pasta, or to taste",
        "1/4 cup grated Parmesan cheese, or to taste"
    ],
    "nut": [
        "Calories > 243 kcal",
        "Carbs > 47.8 g",
        "Cholesterol > 2 mg",
        "Fat > 2.2 g",
        "Protein > 9.9 g",
        "Sodium > 544 mg"
    ],
    "n": "Penne Pasta with Simple Beef Neck Sauce",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"This recipe does take a long time, but requires very little effort, and you'll be rewarded with a wonderful, richly-flavored sauce. The hardest thing will be getting some neck bones, but a quick conversation with your friendly neighborhood butcher should be all you need. You can use any prepared tomato-based pasta sauce in place of the tomato sauce, if desired.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Spread neck bones and onions out in the bottom of a roasting pan.\nRoast in the preheated oven until bones are browned and caramelized, 45 minutes.\nCombine beef and onions, tomato sauce, and water in a large pot; bring to a simmer, reduce heat to low, and simmer, skimming fat and adding water as needed, until meat is falling off the bones, about 6 hours.\nStir parsley, oregano, red pepper flakes, salt, and ground black pepper into tomato sauce mixture; simmer until flavors combine, 10 to 15 minutes.\nBring a large pot of lightly salted water to a boil; add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain.\nStir penne and 1/2 of the sauce together in a bowl with some of the Parmesan cheese. Spoon into bowls and top with remaining sauce and Parmesan cheese.",
    "pt": "20 m",
    "ct": "7 h ",
    "tt": "7 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}