{
    "id": 240087,
    "old_rating": "4.44898",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon vegetable oil",
        "2 skinless, boneless chicken breast halves",
        "2 cups chicken broth",
        "1 (15 ounce) can black beans, rinsed and drained",
        "1 (15 ounce) can cannellini beans, drained and rinsed",
        "1 (14.5 ounce) can diced tomatoes, drained and rinsed",
        "1/2 yellow onion, chopped",
        "1 1/2 tablespoons chili powder, or more to taste",
        "1 clove garlic, minced",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon paprika",
        "1/2 teaspoon mustard powder",
        "1/2 teaspoon garlic powder",
        "1 dash hot sauce (such as CholulaÂ®), or to taste",
        "1 pinch salt and ground black pepper to taste",
        "1/2 cup sour cream"
    ],
    "nut": [
        "Calories > 370 kcal",
        "Carbs > 42.4 g",
        "Cholesterol > 49 mg",
        "Fat > 10.3 g",
        "Protein > 25.9 g",
        "Sodium > 1387 mg"
    ],
    "n": "Slow Cooker Chicken Chili",
    "a": "carry016",
    "r": "0",
    "s": 4,
    "des": "\"This is so incredibly easy, and I have made it numerous times. I love making this for freezer meals and passing it along to my friends with new babies. This makes a great freezer meal; you can add all ingredients into a freezer bag before or after cooking and freeze.\"",
    "ins": "Lightly grease the crock of your slow cooker with vegetable oil.\nPut chicken breasts into the bottom of the slow cooker crock; add chicken broth, black beans, cannellini beans, diced tomatoes, yellow onion, chili powder, garlic, cumin, paprika, garlic powder, hot sauce, salt, and black pepper.\nCook on Low for 6 hours (or on High for 3 hours).\nRemove chicken breasts from the crock to a cutting board. Shred chicken into strands with a pair of forks and return it to the mixture in the crock; add sour cream and stir.\nContinue cooking on Low for 30 minutes more.",
    "pt": "10 m",
    "ct": "6 h ",
    "tt": "6 h ",
    "i": "1781751.jpg",
    "o": "",
    "st": "allrecipes"
}