{
    "id": 240055,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (18.25 ounce) package brownie mix (such as PillsburyÂ®)",
        "2/3 cup vegetable oil",
        "2 eggs",
        "1/4 cup water",
        "1 (6 ounce) bag semisweet chocolate chips (optional)",
        "1 (8 ounce) package cream cheese, softened",
        "2 cups half-and-half",
        "1 (3.3 ounce) package instant white chocolate pudding mix",
        "1 pint heavy whipping cream",
        "2 (6 ounce) packages chocolate-covered nougat bites (such as 3 MusketeersÂ® Bites)"
    ],
    "nut": [
        "Calories > 898 kcal",
        "Carbs > 81 g",
        "Cholesterol > 149 mg",
        "Fat > 63.6 g",
        "Protein > 9.5 g",
        "Sodium > 370 mg"
    ],
    "n": "3 MusketeersÂ® Trifle",
    "a": "Keep It Simple Cook",
    "r": "0",
    "s": 10,
    "des": "\"A favorite of the men in my house who love their 3 MusketeersÂ®. It is a quick and easy dessert that looks and tastes fantastic. It's also flexible. You can make numerous substitutions such as Cool WhipÂ® for whipping cream for a sweeter trifle or milk for half-and-half. Any bite-size candy can be substituted. French vanilla pudding mix or other favorite can be substituted for white chocolate pudding mix. Make it your own.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking dish.\nCombine brownie mix, vegetable oil, eggs, and water in a bowl until batter is smooth; fold in chocolate chips. Spread batter into the prepared baking dish.\nBake in the preheated oven until the top is dry and the edges have started to pull away from the sides of the pan, 45 to 50 minutes. Cool brownies completely. Cut into bite-size pieces.\nBeat cream cheese in a large bowl using an electric mixer until smooth. Beat 1/2 cup half-and-half into cream cheese until incorporated. Beat remaining 1 1/2 cups half-and-half and pudding mix into cream cheese mixture on low speed until pudding is well blended, about 2 minutes.\nBeat cream in a separate bowl using an electric mixer until soft peaks form; fold into pudding mixture.\nPlace a layer of brownie bites in the bottom of a trifle bowl or a large bowl with straight sides; top with a layer of pudding mixture and a layer of chocolate-covered nougat bites. Continue layering 2 or 3 more times in the same order with remaining ingredients.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "2106150.jpg",
    "o": "",
    "st": "allrecipes"
}