{
    "id": 240127,
    "old_rating": "4.81818",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil",
        "3 cloves garlic, chopped, or more to taste",
        "2 onions, chopped",
        "5 carrots, sliced",
        "4 cups chicken broth",
        "2 (15 ounce) cans diced tomatoes with garlic and oregano",
        "1/2 cup red wine (optional)",
        "1 (16 ounce) package frozen green beans",
        "1 (15 ounce) can pinto beans, rinsed and drained",
        "1 (10 ounce) package frozen chopped spinach",
        "2 tablespoons chopped fresh basil",
        "1 tablespoon chopped fresh oregano",
        "salt and pepper to taste",
        "1/2 cup seashell pasta, or more to taste",
        "1/4 cup freshly grated Parmesan cheese, or to taste"
    ],
    "nut": [
        "Calories > 223 kcal",
        "Carbs > 29.8 g",
        "Cholesterol > 5 mg",
        "Fat > 6.9 g",
        "Protein > 8.2 g",
        "Sodium > 868 mg"
    ],
    "n": "Easy Minestrone",
    "a": "Lu",
    "r": "0",
    "s": 8,
    "des": "\"I wanted a soup recipe that I could make with staples that I always have on hand. This has become a family favorite so I always make enough to freeze. Serve topped with grated Parmesan cheese.\"",
    "ins": "Heat olive oil in a large pot over medium-low heat. Cook and stir garlic in hot oil until fragrant, 2 to 3 minutes. Add onion; cook and stir until slightly softened, 4 to 5 minutes. Stir in carrots until heated through, 1 to 2 minutes.\nPour chicken broth and diced tomatoes into onion mixture; bring to a boil, stirring frequently. Add red wine, reduce heat to low, and stir green beans, pinto beans, spinach, basil, oregano, salt, and black pepper into broth mixture. Bring to a simmer, reduce heat to medium-low, and simmer until vegetables are tender, about 40 minutes.\nBring a large pot of lightly salted water to a boil. Cook seashell pasta in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain and stir pasta into soup. Ladle soup into bowls and top with Parmesan cheese.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "3416376.jpg",
    "o": "",
    "st": "allrecipes"
}