{
    "id": 240104,
    "old_rating": "4.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup arrowroot starch",
        "2/3 cup white rice flour",
        "2/3 cup brown rice flour",
        "1 tablespoon white sugar (optional)",
        "14 tablespoons cold butter, cut into chunks",
        "2 large cold eggs",
        "1 tablespoon white vinegar",
        "1 tablespoon cold water, or more as needed (optional)"
    ],
    "nut": [
        "Calories > 167 kcal",
        "Carbs > 15.8 g",
        "Cholesterol > 50 mg",
        "Fat > 11 g",
        "Protein > 1.7 g",
        "Sodium > 80 mg"
    ],
    "n": "Gluten-Free Pie Crust",
    "a": "Sandra LeRose",
    "r": "0",
    "s": 16,
    "des": "\"I have tried a lot of recipes trying to find one that compared with the traditional wheat crust that I have been missing.  After throwing away many batches, I finally came up with this one and my family loves it. They said they couldn't tell the difference (I am not sure I believe that) but it sure did satisfy my cravings. \nHope you like it too.\"",
    "ins": "Combine arrowroot starch, white rice flour, brown rice flour, and sugar in a food processor; pulse until blended. Add butter to flour mixture and pulse until mixture is the consistency of oatmeal.\nTransfer flour-butter mixture to a bowl; add eggs and vinegar. Knead mixture just until blended. Mix water, 1 tablespoon at a time, into dough (if dough is too dry) until dough holds together. Split dough into 2 balls, wrap in plastic wrap, and refrigerate until chilled, about 1 hour.\nSpread a piece of plastic wrap on a work surface and sprinkle with arrowroot starch. Place 1 dough ball on the plastic wrap and flatten using your hands. Dust rolling pin with arrowroot starch and roll over dough until even thickness and about 9 inches in diameter. Repeat with remaining dough.",
    "pt": "20 m",
    "ct": "",
    "tt": "",
    "i": "2230783.jpg",
    "o": "",
    "st": "allrecipes"
}