{
    "id": 240115,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons butter, divided",
        "1 Granny Smith apple, peeled and sliced",
        "1 tablespoon packed brown sugar",
        "4 (4 ounce) skinless, boneless chicken breast halves",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper, or to taste",
        "1 onion, sliced into rings and rings separated",
        "1/2 cup apple cider",
        "1/4 cup apple cider vinegar",
        "2 cups cooked wide noodles"
    ],
    "nut": [
        "Calories > 373 kcal",
        "Carbs > 37.5 g",
        "Cholesterol > 105 mg",
        "Fat > 12.7 g",
        "Protein > 26.5 g",
        "Sodium > 266 mg"
    ],
    "n": "Apple Cider Chicken with Noodles",
    "a": "LAURDSED",
    "r": "0",
    "s": 4,
    "des": "\"Easy to prepare, tangy twist on skillet chicken.\"",
    "ins": "Melt butter in a large skillet over medium heat; cook and stir apples until lightly browned, 5 to 10 minutes. Sprinkle brown sugar over apples and cook until apples are tender, about 5 minutes more. Transfer apples to a plate.\nArrange chicken on a sheet of waxed paper; season both sides with cinnamon, salt, and pepper. Melt remaining butter in the same skillet and cook chicken until browned, 2 to 3 minutes per side. Transfer chicken to a plate.\nCook and stir onion in the same skillet used for chicken until tender, 5 to 10 minutes. Stir cider and vinegar into onion, reduce heat to medium-low, and simmer until sauce is slightly thickened, about 2 minutes.\nReturn chicken to onion mixture, spooning cider sauce over chicken and cook until chicken is no longer pink in the center and the liquid is reduced by half, 5 to 10 minutes more. Spoon apples into chicken mixture and cook until apples are warmed, 2 to 3 minutes.\nArrange noodles on plate, top with chicken, and spoon sauce over chicken.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "4174603.jpg",
    "o": "",
    "st": "allrecipes"
}