{
    "id": 240134,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 1/4 cups all-purpose flour, divided",
        "1 cup warm water (105 degrees F/41 degrees C)",
        "1 (.25 ounce) package active dry yeast",
        "2 1/2 tablespoons vegetable oil, divided",
        "1 large egg white",
        "1 tablespoon sugar",
        "1 1/2 teaspoons salt",
        "1 teaspoon honey, or more to taste",
        "Topping:",
        "1 large egg white",
        "2 teaspoons water",
        "1/2 teaspoon caraway seeds, or to taste",
        "coarse sea salt to taste"
    ],
    "nut": [
        "Calories > 159 kcal",
        "Carbs > 27.7 g",
        "Cholesterol > 0 mg",
        "Fat > 3.2 g",
        "Protein > 4.3 g",
        "Sodium > 328 mg"
    ],
    "n": "Beef on Weck, Part 1: Kummelweck Roll",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"Welcome to one of this country's most delicious unknown sandwiches, the Beef on Weck. This simple but brilliant creation features thinly sliced, horseradish-covered roast beef piled high on a freshly baked kummelweck roll. The roll's fragrant caraway seeds and coarse salt are a perfect accent, and when you add a steaming ramekin of fresh beef jus for dunking, you'll understand why this is the pride of Western New York.\"",
    "ins": "Whisk 1/2 cup flour, 1 cup warm water, and yeast together in the bowl of a stand mixer. Let sit until foamy, 10 to 15 minutes.\nStir 2 tablespoons oil, 1 egg white, sugar, salt, and honey into yeast mixture; whisk until smooth. Gradually add flour to yeast mixture while mixer is running with the dough hook attached; knead until a soft, sticky dough forms, 3 to 4 minutes.\nDrizzle remaining vegetable oil into the bowl and turn dough to coat. Cover the bowl and let dough rise until doubled in size, 1 to 2 hours.\nLine a baking sheet with a silicone baking mat.\nTurn dough out onto a lightly floured work surface, flatten dough, and press into rectangle. Cut dough into 12 pieces and form pieces into rolls. Place rolls 2-inches apart on prepared baking sheet. Cover and let rise until doubled in size, about 30 minutes.\nPreheat oven to 425 degrees F (220 degrees C).\nWhisk 1 egg white and 2 teaspoons water together in a small bowl. Use kitchen shears to cut an X at the top of each roll. Brush rolls with egg white mixture and sprinkle with caraway seeds and salt.\nBake in the preheated oven until golden brown, 18 to 20 minutes.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}