{
    "id": 240135,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds beef top-sirloin roast",
        "salt and pepper to taste",
        "1 tablespoon vegetable oil",
        "2 teaspoons all-purpose flour, or as needed",
        "2 1/2 cups cold beef broth",
        "2 teaspoons aged balsamic vinegar, or to taste",
        "4 kummelweck dinner rolls, split",
        "1/4 cup extra-hot prepared horseradish, or to taste"
    ],
    "nut": [
        "Calories > 388 kcal",
        "Carbs > 17.9 g",
        "Cholesterol > 79 mg",
        "Fat > 13.5 g",
        "Protein > 46.1 g",
        "Sodium > 817 mg"
    ],
    "n": "Beef on Weck, Part 2: Roast Beef",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"There are many cuts of beef used for this, including top round, rump roast, and brisket, but I like to use a nice, thick top-sirloin roast. Instead of cooking it in the oven, I like to pan-roast this on the stove top. Since top sirloin roasts are only a couple inches thick, they cook relatively fast. They're also tender, flavorful, and because of their shape, very easy to slice thinly, which is one of the keys to this amazing sandwich. Serve with chips or fries, and pickles.\"",
    "ins": "Season beef with salt and black pepper.\nHeat oil in a large skillet over medium-high heat. Cook beef roast in hot oil until browned on all sides on each side, 4 to 5 minutes per side. An instant-read thermometer inserted into the center should read 125 degrees F (52 degrees C). Transfer beef to a plate to rest.\nRemove skillet from heat and whisk flour into skillet until flour taste cooks off, about 1 minute. Pour cold beef broth into skillet; place skillet over medium-high heat. Stir balsamic vinegar, black pepper, and any accumulated juices from the roast beef plate into beef broth mixture; cook until jus reduces slightly, about 5 minutes. Season with salt.\nSlice sirloin as thinly as possible against the grain. Pile meat onto the base of each roll. Spread a thick layer of horseradish on the top bun and place top bun over meat. Serve with jus for dipping.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}