{
    "id": 240133,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "salt and freshly ground black pepper to taste",
        "2 tablespoons olive oil, divided",
        "1/2 teaspoon cumin",
        "1/4 teaspoon ground coriander",
        "1 pinch cayenne pepper (optional)",
        "4 whole quail",
        "8 slices cured lemon, patted dry",
        "1 cup chicken broth",
        "1 slice cured lemon, minced"
    ],
    "nut": [
        "Calories > 285 kcal",
        "Carbs > 4 g",
        "Cholesterol > 84 mg",
        "Fat > 20.1 g",
        "Protein > 21.7 g",
        "Sodium > 3469 mg"
    ],
    "n": "Roast Quail with Cured Lemon",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"I usually don't tell you how to eat, but here I'm going to. You want to make sure each bite of quail has at least a tiny piece of the preserved lemon mashed on to it. You can gauge your own personal tolerance for how much of the condiment to use, but it totally makes the bite. The way just a little bit of lemon draws out the flavors of the meat is a lot of fun.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nWhisk 1 tablespoon olive oil, cumin, and coriander together in a large bowl; place quail in bowl and toss to coat quail completely.\nPlace 1 cured lemon slice in the cavity of each quail. Tie a piece of twine around the wings and under breast above the legs of each quail; tie legs together with twine.\nHeat remaining olive oil in a large skillet over high heat. Cook quail in hot oil until browned on all sides, 2 to 4 minutes per side. Remove from heat. Turn each quail, breast-side facing up. Place 1 slice cured lemon on each quail breast and sprinkle each with cayenne pepper.\nRoast in the preheated oven until slightly pink at the bone, 10 to 15 minutes.\nRemove quail to a plate. Pour chicken broth into skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Cook until reduced by half, about 5 minutes. Stir minced lemon into broth mixture. Return quail to skillet and pour sauce over quail until heated through, 2 to 3 minutes.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}