{
    "id": 240123,
    "old_rating": "4.37931",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup flour",
        "1/4 cup cornstarch",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon salt",
        "6 cube steaks",
        "2 tablespoons butter, or as needed",
        "1 cup milk, or to taste",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 264 kcal",
        "Carbs > 11 g",
        "Cholesterol > 55 mg",
        "Fat > 13.6 g",
        "Protein > 22.8 g",
        "Sodium > 311 mg"
    ],
    "n": "Cube Steak with Gravy",
    "a": "C Hills",
    "r": "0",
    "s": 6,
    "des": "\"This is my husband's favorite cube steak, passed down from his grandma. Yummy steak with great gravy as long as you're patient while making the gravy. Best served with rice.\"",
    "ins": "Whisk flour, cornstarch, 1 teaspoon black pepper, and 1/2 teaspoon salt together in a shallow bowl. Spread 1 tablespoon of the flour mixture onto a plate; press each cube steak into flour mixture to coat completely.\nPlace coated steaks on a work surface and pound each several times with a meat tenderizer on each side to pound flour into steak. Pound each steak a second time to further incorporate flour mixture into the meat.\nMelt butter in a large skillet over medium-high heat until skillet is about 350 degrees F (175 degrees C). Cook steaks in hot butter until browned, 2 to 3 minutes per side. Transfer steaks and any stray pieces of meat to a plate and tent with aluminum foil to keep warm. Let skillet cool briefly.\nHeat the same skillet over low heat. Pour enough milk into the skillet to cover the bottom of the pan. Whisk 1 tablespoon flour mixture into hot milk until gravy has a cream-like consistency, 10 to 15 minutes. Add more flour mixture as necessary to thicken gravy. Transfer any steak scraps back into the skillet and season gravy with salt and black pepper.\nPlace hot steaks on plates and top with gravy.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "25 m",
    "i": "4505636.jpg",
    "o": "4536365.jpg,4483128.jpg,4451108.jpg,4321949.jpg,3947269.jpg,3412350.jpg",
    "st": "allrecipes"
}