{
    "id": 240205,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 large sweet potatoes",
        "1 cup butter (such as Land O'LakesÂ®), melted",
        "5 eggs, beaten",
        "1 (12 fluid ounce) can evaporated milk (such as PETÂ®)",
        "1 cup white sugar, or to taste",
        "1 tablespoon all-purpose flour",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon lemon juice",
        "3 pie shells, thawed"
    ],
    "nut": [
        "Calories > 301 kcal",
        "Carbs > 32 g",
        "Cholesterol > 64 mg",
        "Fat > 17.4 g",
        "Protein > 4.8 g",
        "Sodium > 244 mg"
    ],
    "n": "World's Best Sweet Potato Pie",
    "a": "Lewis",
    "r": "0",
    "s": 24,
    "des": "\"Being from the South, we love our sweet potato pie. While many use many different ingredients to make their sweet potato pie this one stands out for its simplicity and goodness. This recipe was passed down to me from my best friend's mother who would cook the absolutely best sweet potato pies. After asking many times she finally wrote it down for me. Prepare yourself for the world's best sweet potato pie. Enjoy with whipped cream.\"",
    "ins": "Place sweet potatoes into a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until tender, 40 to 50 minutes. Drain water, peel sweet potatoes, and mash in a bowl.\nPreheat oven to 425 degrees F (220 degrees C).\nMix butter and eggs together in a bowl until smooth; stir into mashed sweet potatoes. Mix milk, sugar, flour, vanilla extract, nutmeg, baking powder, and lemon juice into sweet potato mixture; pour into the 3 pie shells.\nBake in the preheated oven for 10 minutes. Lower oven temperature to 350 degrees F (175 degrees C) and continue to bake until a toothpick inserted in the center of a pie comes out clean, about 40 minutes more. Cool pies for 15 to 30 minutes before refrigerating to cool completely, 1 to 2 hours.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "3 h",
    "i": "4186737.jpg",
    "o": "",
    "st": "allrecipes"
}