{
    "id": 240281,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (18.25 ounce) package white cake mix (with pudding)",
        "1 (15 ounce) can pumpkin puree",
        "1 cup Mott'sÂ® Natural Applesauce",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground allspice",
        "Frosting:",
        "1 (8 ounce) package cream cheese, room temperature",
        "4 tablespoons butter, room temperature",
        "1 1/2 teaspoons vanilla extract",
        "3 cups confectioners' sugar",
        "1 vanilla bean, seeds removed and set aside",
        "Candy:",
        "1 1/2 cups white sugar",
        "1/2 cup water",
        "1/2 cup Mott'sÂ® Natural Applesauce",
        "1/4 teaspoon cinnamon",
        "1 pinch nutmeg",
        "1/4 cup confectioners' sugar",
        "2 tablespoons chopped pecans (optional)"
    ],
    "nut": [
        "Calories > 313 kcal",
        "Carbs > 57.1 g",
        "Cholesterol > 18 mg",
        "Fat > 9.2 g",
        "Protein > 2.2 g",
        "Sodium > 258 mg"
    ],
    "n": "Autumn Harvest Cupcakes",
    "a": "ilkaisha",
    "r": "0",
    "s": 21,
    "des": "\"These cupcakes are full of fall flavors! The cake itself is made healthier with pumpkin and applesauce in place of eggs, oil and water. The candy recipe makes plenty for extra snacking.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Prepare cupcake pans with paper liners.\nCombine cake mix, pumpkin, applesauce, 1 teaspoon ground cinnamon, 1/2 teaspoon ground nutmeg, 1/2 teaspoon ground ginger, 1/4 teaspoon ground cloves, and 1/4 teaspoon ground allspice in a large bowl. Using electric mixer, combine until thick cake batter forms.\nPortion into prepared cupcake tins, about 2 tablespoons each. Bake for 15-20 minutes until toothpick comes out clean and the tops begin to brown.\nFor the Frosting: With an electric mixer fitted with a whisk attachment, whip cream cheese and butter until well combined, scraping sides of the bowl as necessary. Add vanilla and whip until incorporated.\nAdd 3 cups of powdered sugar, one cup at a time, whipping the frosting to incorporate each cup fully before adding the next. Add the vanilla seeds and whip one last time. Spread or pipe onto cupcakes.\nFor the Candy: Line a baking sheet with aluminum foil. Sprinkle with powdered sugar and pecan pieces, if desired.\nCombine sugar, water, Mott's(R) Natural Applesauce, cinnamon, and nutmeg to a large saucepan. Heat on medium until mixture starts to boil. Stir regularly until candy reaches hard-crack phase (300 degrees F on a candy thermometer, or until the candy audibly crackles when dropped into a cup of cold water).\nPour prepared candy over powdered sugar and pecan pieces. Allow to completely cool and harden before breaking into pieces. Sprinkle onto frosted cupcakes.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1687005.jpg",
    "o": "",
    "st": "allrecipes"
}