{
    "id": 240240,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound Yukon Gold potatoes, peeled",
        "2 (4 ounce) skin-on, boneless salmon fillets",
        "salt and ground black pepper to taste",
        "9 tablespoons olive oil, divided",
        "1 lemon, juiced, divided",
        "1 teaspoon herb mustard (such as tarragon mustard)",
        "1 cup cherry tomatoes, halved",
        "2 cups mushrooms, cut into 1-inch pieces",
        "1 clove garlic, peeled",
        "1 pinch cayenne pepper, or to taste"
    ],
    "nut": [
        "Calories > 831 kcal",
        "Carbs > 27.7 g",
        "Cholesterol > 50 mg",
        "Fat > 68.2 g",
        "Protein > 30.4 g",
        "Sodium > 173 mg"
    ],
    "n": "Crispy-Skin Salmon on Potato Mushroom Salad",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"This dish shows off the importance of contrasting textures and temperatures when assembling a dish. The hot, crisp-skinned salmon tops a warm, soft, earthy mushroom and potato salad; both are surrounded by a cool, tangy tomato citronette (vinaigrette made with citrus instead of vinegar). You'll be amazed how delicious the skin of the salmon gets when cooked this crisp!\"",
    "ins": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 10 to 20 minutes. Drain and cut into bite-size chunks.\nCut 1/2-inch deep slashes lengthwise down the skin-side of each fillet. Season each fillet with salt and black pepper and rub 1/2 teaspoon olive oil into each.\nStir tomatoes, 3 tablespoons olive oil, 1/2 of the lemon juice, herb mustard, salt, and black pepper together in a bowl until well-combined. Cover the bowl with plastic wrap and refrigerate until chilled.\nHeat 3 tablespoons olive oil in a nonstick skillet over medium heat. Cook and stir mushrooms and whole garlic clove over medium heat until mushrooms start to wilt, 5 to 10 minutes; remove garlic from skillet. Stir potato chunks, salt, and cayenne pepper into mushrooms; squeeze remaining lemon juice into skillet. Cook and stir until potatoes are crispy and golden, 10 to 12 minutes.\nHeat remaining olive oil in a nonstick skillet over medium-high heat. Place salmon, skin-side down, in hot skillet and cook until fish is white about halfway up the sides, 5 to 6 minutes. Flip fish and cook until desired doneness is reached, 3 to 5 minutes more.\nDivide potato-mushroom mixture between 2 plates and top each with a salmon fillet. Garnish with tomato mixture.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}