{
    "id": 240225,
    "old_rating": "4.40984",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons honey, or more to taste",
        "1 tablespoon Dijon mustard, or more to taste",
        "1/2 teaspoon ground black pepper, or to taste",
        "1/2 (3 pound) pork loin",
        "1/2 (8 ounce) can pineapple chunks, drained",
        "1/4 teaspoon salt, or to taste"
    ],
    "nut": [
        "Calories > 203 kcal",
        "Carbs > 9.3 g",
        "Cholesterol > 55 mg",
        "Fat > 9.9 g",
        "Protein > 18.4 g",
        "Sodium > 200 mg"
    ],
    "n": "Sweet and Savory Pineapple Pork Loin",
    "a": "Pipsy D",
    "r": "0",
    "s": 6,
    "des": "\"This is a quick, easy, and healthy way to prepare pork loin with no added fat. The pork turns out very moist and the sauce is very flavorful. Serve with your favorite vegetable side dish or salad for a complete meal. Serve over rice with a generous helping of the sauce. Yum!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nMix honey, Dijon mustard, and black pepper together in a bowl until texture of a paste.\nHeat a cast iron skillet over medium-high heat. Cook pork loin in the hot skillet until browned on all sides, about 5 minutes. Transfer pork loin to a baking dish. Spread honey paste over entire pork loin. Spread pineapple chunks around pork loin and sprinkle salt over pork loin.\nPlace a cooking thermometer into the pork loin and cover dish with aluminum foil.\nBake in the preheated oven for 5 minutes. Decrease oven temperature to 375 degrees F (190 degrees C). Continue cooking until pork is cooked through, 30 to 45 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\nTransfer pork loin to a work surface and let rest, 3 to 5 minutes. Blend pineapple chunks and drippings in a blender until sauce is smooth; serve alongside pork loin.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "1990402.jpg",
    "o": "",
    "st": "allrecipes"
}