{
    "id": 240251,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large head cauliflower, cut into florets",
        "1/4 cup butter (such as KerrygoldÂ®), melted",
        "salt and ground black pepper to taste",
        "5 cloves garlic",
        "1 tablespoon olive oil",
        "6 ounces diced pancetta",
        "1 sweet onion, diced",
        "2 teaspoons dried thyme",
        "1 teaspoon dried rosemary",
        "1 teaspoon ground turmeric",
        "28 fluid ounces chicken stock",
        "1 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 269 kcal",
        "Carbs > 11.6 g",
        "Cholesterol > 51 mg",
        "Fat > 20.6 g",
        "Protein > 11.7 g",
        "Sodium > 853 mg"
    ],
    "n": "Roasted Cauliflower and Pancetta Soup",
    "a": "Lora",
    "r": "0",
    "s": 6,
    "des": "\"Flavorful pancetta, cauliflower, and cheese soup.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nArrange cauliflower tightly into a 9x13-inch glass baking dish. Pour melted butter over cauliflower and lightly season with salt and pepper. Place garlic cloves into the cauliflower.\nRoast in the preheated oven until cauliflower is tender and browned, about 30 minutes.\nHeat olive oil in a large skillet over medium heat. Cook and stir pancetta in the hot oil until browned and crisp, 5 to 10 minutes. Transfer pancetta to paper towel-lined bowl, reserving pancetta drippings in the skillet.\nCook and stir onion in the pancetta drippings until tender, about 5 minutes. Mix thyme, rosemary, and turmeric into onion.\nPour chicken stock over onion mixture and bring to a boil. Add cauliflower and garlic to chicken stock. Reduce heat to medium and simmer soup until cauliflower is very soft, about 15 minutes. Stir pancetta into soup.\nBlend soup using an immersion blender until completely smooth. Stir Cheddar cheese, 1 to 2 tablespoons at a time, into soup until melted.",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "4463077.jpg",
    "o": "",
    "st": "allrecipes"
}