{
    "id": 240232,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (6 ounce) chicken breast halves",
        "1 (14 ounce) can artichoke hearts, drained and quartered",
        "1 (12 fluid ounce) can fat-free evaporated milk",
        "1 (12 ounce) jar roasted red peppers, drained and chopped",
        "1 (10.75 ounce) can 98% fat-free cream of mushroom soup",
        "1 cup fat-free chicken broth",
        "2 lemons, juiced",
        "1/2 teaspoon oregano",
        "1/2 teaspoon dried tarragon",
        "1/4 teaspoon red pepper flakes",
        "salt and ground black pepper to taste",
        "2 cups pipette pasta",
        "2 tablespoons grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 564 kcal",
        "Carbs > 66.8 g",
        "Cholesterol > 106 mg",
        "Fat > 7.7 g",
        "Protein > 55.6 g",
        "Sodium > 1319 mg"
    ],
    "n": "Creamy Lemon Chicken with Pasta",
    "a": "jennifer",
    "r": "0",
    "s": 4,
    "des": "\"This easy, low-fat recipe has great Mediterranean flavors (lemon, tarragon, oregano, artichoke hearts) and really leaves you satisfied. For company, I've thinned the sauce with some chicken broth or white wine and served it over angel hair pasta for a more formal presentation. I created this because I wanted a recipe that uses the items I have in my pantry every day. This and a salad and you are done! You can use mostaccioli or another dry short pasta in place of the pipette, if desired.\"",
    "ins": "Heat a large nonstick skillet over medium-high heat. Place chicken breasts into skillet, cover the skillet with a lid, and cook until browned on both sides, 3 to 4 minutes per side. Transfer chicken to a plate to rest.\nStir browned chicken, artichoke hearts, evaporated milk, cream of mushroom soup, chicken broth, lemon juice, oregano, tarragon, red pepper flakes, salt, and black pepper together in a large, deep skillet; bring to a boil, reduce heat to low, cover the skillet with a lid, and cook until chicken is no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nBring a large pot of lightly salted water to a boil; add pipette pasta and cook, stirring occasionally, until almost tender, 5 to 6 minutes. Drain, reserving 1/4 cup of pasta water. Stir pasta and reserved pasta water into chicken and sauce mixture. Simmer until pasta is tender yet still firm to the bite and sauce is slightly thickened, about 5 minutes. Slice chicken breasts, ladle sauce and chicken into bowls, and top with Parmesan cheese.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "3101131.jpg",
    "o": "",
    "st": "allrecipes"
}