{
    "id": 240268,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "butter-flavored cooking spray",
        "2 cups 2% milk",
        "1 cup heavy whipping cream",
        "3 eggs",
        "3/4 cup white sugar",
        "1 teaspoon vanilla extract",
        "1 vanilla bean, halved lengthwise",
        "4 large day-old chocolate croissants, cut into 1/2-inch-thick pieces",
        "1 (6 ounce) bag chocolate chips",
        "1 tablespoon confectioners' sugar, or to taste"
    ],
    "nut": [
        "Calories > 308 kcal",
        "Carbs > 33.9 g",
        "Cholesterol > 90 mg",
        "Fat > 18.2 g",
        "Protein > 5.5 g",
        "Sodium > 169 mg"
    ],
    "n": "Chocolate Croissant Bread Pudding",
    "a": "MichelleD",
    "r": "0",
    "s": 12,
    "des": "\"I love bread pudding and I love chocolate croissants. Why not combine them? My daughters love chocolate, so this was a winner in my house. It's like a combination of a soft-brownie-cakey-chocolate-chip-cookie with a bit of a creamy texture inside. It tastes good warm, as all melted chocolate desserts do, but even better cooled. My daughters couldn't wait to eat, so good luck holding out for it to cool.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray muffin cups or brownie pan with cooking spray.\nMix milk, cream, eggs, sugar, and vanilla extract together in a bowl. Scrape the insides from each vanilla bean half into the milk mixture. Stir milk mixture until smooth and light yellow in color. Carefully stir croissant pieces into milk mixture until all pieces are wet; let soak for at least 10 minutes.\nFold chocolate chips into croissant mixture. Spoon croissant mixture into the prepared muffin cups.\nBake in the preheated oven until bubbling and golden brown, 35 to 45 minutes. Cool pudding for 30 minutes to 1 hour; transfer to a plate and sift powdered sugar over each.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "4476077.jpg",
    "o": "",
    "st": "allrecipes"
}