{
    "id": 240332,
    "old_rating": "4.46154",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 skinless, boneless chicken thighs",
        "1 (8 ounce) package cream cheese, softened",
        "1 (4 ounce) can diced jalapeno peppers with juice",
        "1/4 cup green enchilada sauce",
        "1 pinch salt and ground black pepper to taste",
        "16 (6 inch) flour tortillas",
        "2 cups shredded pepperjack cheese",
        "2 tablespoons vegetable oil"
    ],
    "nut": [
        "Calories > 1207 kcal",
        "Carbs > 71.7 g",
        "Cholesterol > 326 mg",
        "Fat > 67.6 g",
        "Protein > 74.7 g",
        "Sodium > 2087 mg"
    ],
    "n": "Slow Cooker Jalapeno Popper Taquitos",
    "a": "themoodyfoodie",
    "r": "0",
    "s": 4,
    "des": "\"These are a spicy twist on traditional taquitos. The slow cooker gives this recipe ease, while the flavors keep things exciting! Serve with sour cream, guacamole, or avocado ranch salad dressing.\"",
    "ins": "Combine chicken thighs, cream cheese, jalapeno peppers with juice, green enchilada sauce, salt, and black pepper together in a slow cooker.\nCook on High for 3 to 4 hours. Shred chicken with 2 forks and stir with sauce in the slow cooker to combine.\nPreheat oven to 425 degrees F (220 degrees C). Spray a baking sheet with cooking spray.\nSpread tortillas out on a flat work surface and sprinkle pepperjack cheese evenly in the center of each tortilla. Spread about 2 tablespoons of chicken mixture over cheese on each tortilla. Tightly roll each tortilla and place, seam-side down, on the prepared baking sheet. Brush top and sides of each rolled tortilla with vegetable oil.\nBake in the preheated oven until cheese melts, and tortillas start to brown, 10 to 15 minutes. Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Cook taquitos under the broiler until crisped, 2 to 3 minutes more.",
    "pt": "15 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}