{
    "id": 240320,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons butter",
        "1 tablespoon olive oil",
        "2 leeks, minced",
        "1 sweet onion, chopped",
        "12 cloves garlic, minced",
        "4 large fresh bay leaves",
        "1 teaspoon ground coriander",
        "5 russet potatoes, cut into bite-size pieces",
        "1 cube chicken bouillon",
        "1 quart chicken stock, or as needed",
        "1/2 pound shredded Colby-Monterey Jack cheese",
        "1 cup heavy whipping cream",
        "salt and ground black pepper to taste",
        "1/4 cup chopped fresh chives, or more to taste"
    ],
    "nut": [
        "Calories > 392 kcal",
        "Carbs > 32.3 g",
        "Cholesterol > 76 mg",
        "Fat > 25.4 g",
        "Protein > 11 g",
        "Sodium > 770 mg"
    ],
    "n": "Cheesy Potato Leek Soup",
    "a": "KymarahD",
    "r": "0",
    "s": 8,
    "des": "\"This recipe is an offshoot of the more classical potato leek soups. This is sort of a meat-and-potatoes type of recipe!  It has a lot of cheese in it and can be served chunky or smooth. It is a family-favorite!\"",
    "ins": "Melt butter and olive oil in a large pot over medium-high heat. Saute leeks, onion, garlic, bay leaves, and coriander in hot butter and oil until softened and translucent, about 7 minutes. Add potatoes and chicken bouillon to the pot and pour enough chicken stock over the top to cover vegetables. Bring to a boil, reduce heat to medium-low, and simmer, stirring occasionally, until vegetables are tender, about 20 minutes.\nMash potatoes to desired consistency with a potato masher. Stir Colby-Monterey Jack cheese and cream into potato mixture, return soup to a simmer, and cook until cheese melts and soup is hot, about 15 minutes more. Season with salt and pepper. Remove and discard bay leaves.\nLadle soup into bowls and top with chives.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "1820434.jpg",
    "o": "",
    "st": "allrecipes"
}