{
    "id": 240333,
    "old_rating": "4.17949",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 ounces spaghetti",
        "1 1/2 tablespoons olive oil",
        "cooking spray",
        "1 1/2 cups grated Parmesan cheese, divided",
        "1 1/2 cups tomato-based pasta sauce",
        "12 (1 ounce) cooked meatballs"
    ],
    "nut": [
        "Calories > 198 kcal",
        "Carbs > 17 g",
        "Cholesterol > 33 mg",
        "Fat > 9.3 g",
        "Protein > 11 g",
        "Sodium > 317 mg"
    ],
    "n": "Spaghetti and Meatballs Muffin Bites",
    "a": "Snacking in the Kitchen",
    "r": "0",
    "s": 12,
    "des": "\"There's a reason spaghetti and meatballs appear on so many dinner tables - it's a comforting meal, easy to put together, and loaded with flavor. This recipe turns the traditional meal into party-ready, individual servings of spaghetti and meatballs muffin bites.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 7 minutes. Drain and toss in a bowl with olive oil; refrigerate until cooled, about 15 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Spray 12 muffin cups with cooking spray.\nToss cooled spaghetti with 1 cup Parmesan cheese. Divide spaghetti between the 12 prepared muffin cups, arranging noodles in each cup to create \"nests\" for the meatballs.\nTop each \"nest\" with 1 tablespoon pasta sauce, 1 meatball, and 1 more tablespoon pasta sauce, respectively. Sprinkle remaining Parmesan cheese over the tops of each meatball \"nest.\"\nBake in the preheated oven until pasta and meatballs are heated through and cheese melts, 20 to 25 minutes. Cool slightly before transferring muffin bites to a serving platter.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "4131584.jpg",
    "o": "4131584.jpg,3768318.jpg,3753393.jpg,3086973.jpg,2809196.jpg,2722591.jpg",
    "st": "allrecipes"
}