{
    "id": 240324,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "2 cups sifted all-purpose flour",
        "1 cup confectioners' sugar",
        "1 tablespoon lemon zest",
        "1 cup butter, softened",
        "Filling:",
        "4 eggs",
        "2 cups white sugar",
        "1/4 cup all-purpose flour",
        "1 teaspoon baking powder",
        "5 fluid ounces fresh lemon juice",
        "1 tablespoon lemon zest",
        "1/4 cup confectioners' sugar, or as needed"
    ],
    "nut": [
        "Calories > 107 kcal",
        "Carbs > 16.3 g",
        "Cholesterol > 26 mg",
        "Fat > 4.3 g",
        "Protein > 1.2 g",
        "Sodium > 43 mg"
    ],
    "n": "Luscious Lemon Triangles",
    "a": "Lori",
    "r": "0",
    "s": 48,
    "des": "\"A traditional lemon bar with zest! The addition of lemon zest in both the crust and filling makes this dessert even more refreshing.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish and then line it with enough aluminum foil to leave overhang along all edges for lifting finished dessert from the pan. Grease the foil.\nStir 2 cups flour, 1 cup confectioners' sugar, and 1 tablespoon lemon zest together in a bowl. Mash butter into the flour mixture until the mixture resembles fine crumbs; press into the bottom of the prepared dish.\nBake in preheated oven until golden brown, 15 to 20 minutes.\nBeat eggs in the bowl of a stand mixer until lightened in color.\nMix white sugar, 1/4 cup flour, and baking powder in a bowl until no lumps remain; beat into the eggs until incorporated fully. Stir lemon juice and lemon zest to the egg mixture; pour over the prepared crust.\nBake in preheated oven until set in the middle and the edges are slightly golden, about 25 minutes.\nCool pastry in the pan until just warm to the touch, dust with confectioners' sugar, and cool completely. Lift pastry from pan by the foil and refrigerate until slightly firmed. Cut into 2-inch squares; halve each square diagonally to get triangles.",
    "pt": "25 m",
    "ct": "40 m",
    "tt": "2 h ",
    "i": "2180844.jpg",
    "o": "3718672.jpg,3500207.jpg,2324738.jpg,2315430.jpg,2306958.jpg,2006648.jpg",
    "st": "allrecipes"
}