{
    "id": 240399,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 parsnips, peeled and cut into 1/2-inch slices",
        "6 tablespoons olive oil, divided",
        "1 large apple - peeled, cored, and cut into 1/2-inch slices",
        "1 large pear - peeled, cored, and cut into 1/2-inch slices",
        "2 large leeks, white parts only, halved lengthwise and thinly sliced crosswise",
        "1 tablespoon balsamic vinegar",
        "1 quart chicken stock",
        "1 (2 inch) sprig fresh rosemary"
    ],
    "nut": [
        "Calories > 375 kcal",
        "Carbs > 46.6 g",
        "Cholesterol > < 1 mg",
        "Fat > 21.6 g",
        "Protein > 3.3 g",
        "Sodium > 709 mg"
    ],
    "n": "Parsnip, Pear, and Apple Soup",
    "a": "BigShotsMom",
    "r": "0",
    "s": 4,
    "des": "\"I adapted this recipe from some I had seen online, making it heartier and more to my family's taste. The blend of parsnips and fruits make such a satisfying, flavorful combination. Serve with a dollop of plain yogurt or sour cream.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nToss parsnips with 2 tablespoons olive oil in a bowl; spread parsnips onto a baking sheet.\nBake in the preheated oven until slightly tender, 20 to 25 minutes. Reduce oven heat to 350 degrees F (175 degrees C).\nToss apples and pears with 2 tablespoons olive oil in a bowl. Push parsnips to one side of the baking sheet and spread apples and pears onto the other side of the baking sheet.\nBake in the oven until fruit is soft and caramelized, 15 to 20 minutes.\nHeat remaining olive oil in a large pot over medium heat. Cook and stir leeks in hot oil until leeks are soft, about 5 minutes. Sprinkle balsamic vinegar over leeks. Stir parsnips, apples, pears, chicken stock, and rosemary into leeks. Bring to a simmer and cook until fruits and vegetables are completely tender and easily mashed against the side of the pot, about 20 minutes.\nPuree vegetable mixture using an immersion blender (or blend in batches in a blender) until soup has an applesauce-like consistency.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "1808048.jpg",
    "o": "",
    "st": "allrecipes"
}