{
    "id": 240312,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 egg yolks",
        "1/2 cup almond paste, broken into pieces",
        "2 cups unsalted butter, chopped and softened",
        "1 3/4 cups white sugar",
        "1/2 teaspoon salt",
        "3 3/4 cups all-purpose flour"
    ],
    "nut": [
        "Calories > 117 kcal",
        "Carbs > 12.7 g",
        "Cholesterol > 30 mg",
        "Fat > 7 g",
        "Protein > 1.2 g",
        "Sodium > 21 mg"
    ],
    "n": "Cut-Out Sugar Cookies",
    "a": "StevenandMaggie McClain",
    "r": "0",
    "s": 60,
    "des": "\"My mother-in-law uses this recipe every holiday season to bake cookies with the kids. I'm not much of a sugar cookie person, but these taste wonderful and hold up to shaping very well. They don't get dry and hard like so many other recipes. When cookies are cool you can ice and decorate. Store in a tightly sealed container with waxed paper between layers at room temperature for up to 2 weeks or freeze for up to 3 months.\"",
    "ins": "Beat egg yolks and almond paste together in a bowl using a mixer on medium speed until crumbly, about 2 minutes. Add butter, sugar, and salt to almond paste mixture and beat until creamy, about 3 minutes; reduce speed to low and gradually beat in flour just until blended.\nDivide dough into 4 pieces and flatten each into a disk on a lightly floured surface. Wrap each disk in plastic wrap and chill for 2 hours.\nPreheat oven to 375 degrees F (190 degrees C).\nPlace 1 dough piece on a lightly floured surface and roll into 1/4-inch thickness using a floured rolling pin. Cut dough into shapes using floured cookie cutters. Arrange cookies 1-inch apart on a large baking sheet. Form any remaining scraps into a disk and refrigerate.\nBake in the preheated oven until lightly browned, 10 to 12 minutes. Transfer cookies to a wire rack to cool. Repeat with remaining dough.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "3 h ",
    "i": "4299702.jpg",
    "o": "",
    "st": "allrecipes"
}