{
    "id": 240328,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups water, or as needed",
        "1 cup lentils",
        "cooking spray",
        "1 cup quick-cooking oats",
        "1 small onion, grated",
        "3/4 cup shredded Colby-Jack cheese",
        "1/4 cup dried cranberries",
        "1 tablespoon poultry seasoning",
        "1/8 teaspoon seasoned salt",
        "1 1/2 cups fresh cranberry sauce",
        "1/2 cup egg substitute",
        "3/4 cup fresh cranberry sauce"
    ],
    "nut": [
        "Calories > 503 kcal",
        "Carbs > 88.4 g",
        "Cholesterol > 20 mg",
        "Fat > 9 g",
        "Protein > 19.8 g",
        "Sodium > 258 mg"
    ],
    "n": "Thanksgiving Lentil Loaf",
    "a": "SSwisher",
    "r": "0",
    "s": 5,
    "des": "\"The non-meat eaters in my family love this recipe and request it at family meals, especially at Thanksgiving. Serve this with mashed potatoes or whipped acorn squash and a salad or add it for a non-meat alternative with normal Thanksgiving food.\"",
    "ins": "Bring water and lentils to a boil on a saucepan; reduce heat and simmer until lentils are tender, adding more water if needed, 35 to 40 minutes.\nSpray an 8-inch square glass baking dish with cooking spray.\nDrain lentils and beat with an electric mixer until mostly smooth; cool slightly.\nMix oats, onion, Colby-Jack cheese, dried cranberries, poultry seasoning, and seasoned salt together in a large bowl. Mix 1 1/2 cups cranberry sauce and egg substitute together in a separate bowl; stir into oats mixture. Slowly stir cooled lentil puree into oats mixture until evenly combined. Spread mixture into the prepared baking dish, smoothing the top with the back of a spoon.\nCover dish with plastic wrap and refrigerate until firm, at least 4 hours.\nPreheat oven to 350 degrees F (175 degrees C). Remove plastic wrap from baking dish.\nBake in the preheated oven for 30 minutes. Spoon 3/4 cup cranberry sauce over loaf and continue baking until loaf is cooked through, about 15 minutes more.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "5 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}