{
    "id": 240410,
    "old_rating": "2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter, softened",
        "1/2 cup white sugar",
        "2 large eggs",
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/8 teaspoon ground cloves",
        "1/8 teaspoon ground nutmeg",
        "1/2 cup milk",
        "5 tablespoons rum, divided",
        "3 tablespoons white sugar"
    ],
    "nut": [
        "Calories > 219 kcal",
        "Carbs > 28.1 g",
        "Cholesterol > 52 mg",
        "Fat > 8.9 g",
        "Protein > 3.6 g",
        "Sodium > 249 mg"
    ],
    "n": "Hot Buttered Rum Muffins",
    "a": "Cookin' in FL",
    "r": "0",
    "s": 12,
    "des": "\"Wonderful buttery flavor. Enjoy!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease 12 muffin cups.\nBeat butter with an electric mixer at medium speed in a large bowl until creamy. Beat 1/2 cup sugar into the butter until fully incorporated. Beat one egg into the butter mixture until fully incorporated before beating second egg into the mixture.\nStir flour, baking powder, salt, cloves, and nutmeg together in a separate bowl. Mix milk and 3 tablespoons rum in a third bowl.\nAlternately add small amounts of the flour mixture and the milk mixture to the butter mixture while beating on Low speed, mixing each addition until just incorporated into a batter. Spoon batter into prepared muffin cups to about 3/4 full.\nBake in the preheated oven until golden brown and a toothpick inserted into the center of a muffin comes out clean, 20 to 25 minutes. Remove muffins immediately from the cups to cool on a wire rack.\nStir remaining rum and 3 tablespoons sugar together in a small saucepan over low heat; cook, stirring constantly, until the sugar dissolves, 3 to 5 minutes. Brush rum mixture onto the tops of the warm muffins.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}