{
    "id": 240480,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup water",
        "1 cup fresh cranberries",
        "2 cups white sugar, divided",
        "2 cups all-purpose flour",
        "2 tablespoons ground ginger",
        "2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/2 cup butter, softened",
        "1 egg",
        "2 tablespoons maple sugar, or as needed"
    ],
    "nut": [
        "Calories > 117 kcal",
        "Carbs > 21.2 g",
        "Cholesterol > 14 mg",
        "Fat > 3.3 g",
        "Protein > 1.1 g",
        "Sodium > 78 mg"
    ],
    "n": "Cranberry Ginger Wafers with Maple Sugar",
    "a": "Cheerios",
    "r": "0",
    "s": 30,
    "des": "\"A bite of ginger with cranberries that would go well with an afternoon tea or lunch. I have made this recipe for a tribute to Canada on July 1st, Canada Day, with maple sugar topping to help us remember our heritage of maple syrup in Canada.\"",
    "ins": "Bring water, cranberries, and 1 cup sugar to a boil in a saucepan; boil for 5 minutes. Reduce heat and simmer until cranberries pop, about 2 minutes; remove from heat to cool. Pour cranberry mixture through a strainer; reserve liquid for another use.\nWhisk flour, ginger, baking powder, and baking soda together in a bowl.\nBeat butter and remaining 1 cup white sugar with an electric mixer in a bowl until smooth; beat in egg. Stir drained cranberries into butter mixture; stir in flour mixture until fully incorporated. Cover dough; chill in the refrigerator until moderately firm, about 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nRoll dough out on a lightly floured surface about 1/4 inch thick; cut into circles with a round cookie cutter. Place cookies on the prepared baking sheet; sprinkle with maple sugar.\nBake in the preheated oven until light golden on the bottom, about 10 minutes; remove to cool completely on a wire rack.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}