{
    "id": 240592,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (3 pound) fryer chickens",
        "water to cover",
        "1 cup dry sherry",
        "1 onion, sliced",
        "1/2 cup sliced celery",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon curry powder",
        "1/2 cup butter",
        "1 pound fresh mushrooms",
        "2 (16 ounce) packages long grain and wild rice mix",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1 cup sour cream"
    ],
    "nut": [
        "Calories > 539 kcal",
        "Carbs > 40.3 g",
        "Cholesterol > 66 mg",
        "Fat > 33.7 g",
        "Protein > 17.4 g",
        "Sodium > 1096 mg"
    ],
    "n": "Easy Chicken and Wild Rice Casserole",
    "a": "cathiebakes",
    "r": "0",
    "s": 20,
    "des": "\"A terrific recipe from a family cookbook. It's great when you make it, but it's even better the next day!\"",
    "ins": "Place chicken in a deep pot and cover with water; add sherry, onion, celery, salt, and curry powder. Bring liquid to a boil, cover pot, reduce heat to medium-low, and simmer until chicken is no longer pink near the bone, about 1 hour. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C).\nStrain broth from chicken mixture into a bowl and transfer chicken to a work surface to cool until easily handled. Pull meat from the bones and cut into bite-size pieces. Discard bones, onion, and celery.\nHeat butter in a skillet over medium-high heat; saute mushrooms until golden brown, about 10 minutes.\nBring reserved chicken broth and wild rice to a boil in a large saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender, about 45 minutes. Drain excess liquid, fluff rice with a fork, and cook uncovered 5 minutes more.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine chicken, rice, and about 1/2 of the mushrooms in a 4-quart casserole dish. Mix mushroom soup and sour cream together in a bowl and stir into chicken-rice mixture. Arrange remaining mushrooms in a circle on top of the casserole.\nBake in the preheated oven until bubbling, about 1 hour.",
    "pt": "15 m",
    "ct": "3 h",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}