{
    "id": 240543,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cloves garlic, finely chopped, or more to taste",
        "1/4 teaspoon dried rosemary, or more to taste",
        "1 pinch crushed dried sage",
        "1 pinch finely ground dried thyme",
        "salt and ground black pepper to taste",
        "1 (4.5 pound) bone-in prime rib roast",
        "1/4 cup Worcestershire sauce, or more to taste",
        "1/4 cup soy sauce, or more to taste"
    ],
    "nut": [
        "Calories > 340 kcal",
        "Carbs > 2.9 g",
        "Cholesterol > 90 mg",
        "Fat > 21.8 g",
        "Protein > 31 g",
        "Sodium > 637 mg"
    ],
    "n": "Easy Prime Rib Roast",
    "a": "TheGoddessGiGi",
    "r": "0",
    "s": 8,
    "des": "\"I'm new to cooking, and I recently purchased a rib-eye roast, and had no idea what it was. I put a few ingredients together and cooked it and to my surprise, it was the best prime rib I've ever had. I thought I would share it with you. Hope you enjoy!\"",
    "ins": "Mix garlic, rosemary, sage, thyme, salt, and pepper together in a small bowl. Pat garlic mixture over entire roast. Make an incision down the middle of the roast, keeping parallel with the bones. Place the roast in a plastic roasting bag and pour Worcestershire sauce and soy sauce into the bag, concentrating on the incision in the roast. Tie the bag and refrigerate roast to marinate, turning often, at least 2 hours.\nRemove roast from refrigerator and allow to come to room temperature, 1 to 2 hours. Remove roast from bag and discard marinade. Place roast, fat-side up, in a roasting pan.\nPreheat an oven to 500 degrees F (260 degrees C).\nBake in the preheated oven for 15 minutes. Lower heat to 350 degrees F (175 degrees C) and continue cooking until an internal temperature of 145 degrees F (65 degrees C), about 1 hour. Let roast stand for 20 minutes before slicing.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "4 h ",
    "i": "4408428.jpg",
    "o": "",
    "st": "allrecipes"
}