{
    "id": 240525,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (4 ounce) lobster tails, split in half",
        "salt to taste",
        "2 tablespoons clarified butter",
        "2 tablespoons sherry wine",
        "1/2 cup heavy whipping cream",
        "2 large egg yolks",
        "1 pinch freshly grated nutmeg",
        "1 pinch cayenne pepper, or to taste",
        "1 tablespoon chopped fresh flat-leaf parsley, or to taste"
    ],
    "nut": [
        "Calories > 297 kcal",
        "Carbs > 3.6 g",
        "Cholesterol > 227 mg",
        "Fat > 22.4 g",
        "Protein > 19.6 g",
        "Sodium > 448 mg"
    ],
    "n": "Lobster Newberg",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"This really is a great, and simple recipe. The sauce is pretty rich, so you want something just thick enough to coat the meat, but not so thick that it covers it up. Having said that, if you cook it a little further, until it almost starts to simmer, it will get a bit thicker, if that's your preference. Just don't go too far, or the yolks may start to form curds, and you'll lose the silkiness. Serve over buttered toast or in freshly baked puff pastry shells.\"",
    "ins": "Season lobster tails with salt.\nHeat clarified butter in a large skillet over medium-high heat. Place tails, meat-side down, in hot butter and saute until just cooked through, about 2 minutes per side. Transfer to a plate to cool.\nPour sherry into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Cook until sherry is reduced by half, about 1 minute. Remove skillet from heat.\nPull meat from shells; discard shells and roughly chop lobster meat. Pour any accumulated juices from the plate into sherry mixture in the skillet.\nWhisk cream, eggs yolks, nutmeg, and cayenne pepper together in a bowl.\nWhisk cream mixture into sherry mixture, return skillet to medium-low heat, and cook, stirring constantly, until sauce is thick enough to coat the back of a spoon, 3 to 7 minutes. Stir lobster into sauce and cook until heated through. Season with parsley and salt.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "25 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}