{
    "id": 240564,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil, or as needed",
        "2 onions, roughly chopped, divided",
        "4 carrots, cut into 1/2-inch rounds",
        "1 clove garlic, minced",
        "1/4 teaspoon red pepper flakes",
        "1/4 teaspoon Greek seasoning (such as Cavender'sÂ®) (optional)",
        "1 pinch dried rosemary",
        "1 pinch ground thyme",
        "1 pinch dried basil",
        "1 pinch Italian seasoning",
        "1 bay leaf",
        "salt and ground black pepper to taste",
        "1 (32 ounce) can diced tomatoes with juice",
        "1 pound ground beef",
        "4 potatoes, peeled and cut into chunks",
        "1 stalk celery, chopped"
    ],
    "nut": [
        "Calories > 279 kcal",
        "Carbs > 31.3 g",
        "Cholesterol > 35 mg",
        "Fat > 10.8 g",
        "Protein > 13.5 g",
        "Sodium > 279 mg"
    ],
    "n": "Mom's Basic Vegetable Beef Stew",
    "a": "PJandAngie",
    "r": "0",
    "s": 8,
    "des": "\"This basic recipe uses simple and often used ingredients. It can be spiced up any way, but our spices we have found bring out the best flavor and they are the key to this recipe. Ground pork or ground lamb can be substituted for ground beef. It can also be cooked on the stovetop, which we do, or slow cooker. Eat as a stew or serve over rice, crushed chips or crackers, or cornbread.\"",
    "ins": "Pour in enough olive oil into a large stockpot to coat the bottom; add 1 onion, carrots, garlic, red pepper flakes, Greek seasoning, rosemary, thyme, basil, Italian seasoning, bay leaf, salt, and pepper. Cook and stir onion mixture over medium heat until onion is softened and lightly browned, about 15 minutes.\nPour diced tomatoes over onion mixture; add ground beef, breaking apart with a wooden spoon and stir. Bring liquid to a boil and cook until ground beef is cooked through and carrots are tender, about 10 minutes.\nStir potatoes, remaining onion, and celery into tomato mixture and cook until potatoes are tender, 15 to 20 minutes. Remove stockpot from heat and let sit, 20 to 30 minutes.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "3478823.jpg",
    "o": "",
    "st": "allrecipes"
}