{
    "id": 240528,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Custard:",
        "3 eggs",
        "2/3 cup lightly packed brown sugar",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground cloves",
        "1 1/2 cups canned pumpkin puree",
        "1 cup low-fat evaporated milk",
        "Topping:",
        "2 tablespoons brown sugar",
        "1 tablespoon all-purpose flour",
        "1/4 teaspoon ground cinnamon",
        "1/2 tablespoon melted butter",
        "3 tablespoons chopped toasted pecans",
        "Garnish:",
        "Whipped cream (optional)"
    ],
    "nut": [
        "Calories > 250 kcal",
        "Carbs > 40.5 g",
        "Cholesterol > 101 mg",
        "Fat > 7.4 g",
        "Protein > 7.6 g",
        "Sodium > 248 mg"
    ],
    "n": "Pumpkin Pecan Custard",
    "a": "Egg Farmers of Ontario",
    "r": "0",
    "s": 6,
    "des": "\"What could be better than two timeless recipes combined? The taste of traditional pumpkin pie artfully blended with classic custard make for a charming union of flavours.\"",
    "ins": "Custard: Preheat oven to 350 degrees F (180 degrees C). Lightly grease six 6-ounce (180 mL) ramekins and arrange on baking sheet.\nIn a medium bowl or large glass measuring cup, beat eggs lightly with a fork. Add 2/3 cup (150 mL) brown sugar, cinnamon, vanilla, allspice, ginger, nutmeg and cloves. Stir in pumpkin puree until blended. Slowly stir in evaporated milk. Pour evenly into prepared ramekins.\nBake in the preheated oven for 20 minutes.\nTopping: Meanwhile, in small bowl, combine 2 tablespoons (30 mL) brown sugar, flour and 1/4 teaspoon (1 mL) cinnamon. Add melted butter and stir in pecans.\nAfter baking custards for 20 minutes, remove from oven and sprinkle nut mixture evenly over custards and bake for an additional 15 minutes or until a knife inserted near the centre comes out clean.\nTransfer to rack to cool. Serve warm or chilled with a dollop of whipped cream, if desired.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "1770534.jpg",
    "o": "",
    "st": "allrecipes"
}