{
    "id": 240588,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons unsalted butter",
        "1 large onion, chopped",
        "1 jalapeno pepper, seeded and chopped, or more to taste",
        "4 cloves garlic, minced",
        "1 (14.5 ounce) can chicken broth",
        "2 tablespoons cornstarch",
        "4 cups shredded American cheese",
        "1 (14.5 ounce) can diced tomatoes",
        "1 (4 ounce) can diced green chile peppers",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon cayenne pepper",
        "12 corn tortillas, warmed",
        "3 cups shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 705 kcal",
        "Carbs > 34.4 g",
        "Cholesterol > 142 mg",
        "Fat > 47.9 g",
        "Protein > 35.3 g",
        "Sodium > 2114 mg"
    ],
    "n": "Soft Cheese Tacos",
    "a": "Janet Casey",
    "r": "0",
    "s": 6,
    "des": "\"I grew up in Oklahoma City eating soft cheese tacos at Ninos Mexican Restaurant. I've spent years searching the internet for this recipe, and at 62 years old, I've finally found it.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat butter in a pot over medium-low heat. Cook and stir onion and jalapeno pepper in the hot butter until onion is translucent, about 5 minutes. Add garlic to onion mixture and cook until fragrant, about 30 seconds.\nWhisk chicken broth and cornstarch together in a bowl until smooth; pour into the onion mixture. Cook, stirring constantly, until broth thickens, about 2 minutes. Reduce temperature to low and slowly stir American cheese, 1/4 cup at a time, into broth mixture until cheese is completely melted and sauce is smooth, 5 to 10 minutes.\nStir diced tomatoes, green chile peppers, cumin, and cayenne pepper into cheese sauce and keep pot over low heat. Divide cheese sauce in half, reserving 1/2 of the sauce for another use.\nSprinkle about 1/4 cup Cheddar cheese down the center of 1 tortilla and roll tortilla around cheese. Place rolled tortilla, seam-side down, in a baking dish. Repeat with remaining tortillas and Cheddar cheese. Cover dish with aluminum foil.\nBake in the preheated oven until cheese is melted, 10 to 12 minutes. Remove foil and pour the reserved 1/2 of the cheese sauce over tacos.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "3183930.jpg",
    "o": "",
    "st": "allrecipes"
}