{
    "id": 240675,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 large potatoes, peeled and cubed",
        "2 (14.5 ounce) cans chicken broth",
        "3 tablespoons olive oil",
        "3 tablespoons butter",
        "1 large onion, diced",
        "1 cup sliced mushrooms",
        "salt and ground black pepper to taste",
        "8 ounces grated Swiss cheese"
    ],
    "nut": [
        "Calories > 560 kcal",
        "Carbs > 69.8 g",
        "Cholesterol > 53 mg",
        "Fat > 23.7 g",
        "Protein > 18.9 g",
        "Sodium > 743 mg"
    ],
    "n": "Cheese Rosti (Roschti)",
    "a": "Captain Walker",
    "r": "0",
    "s": 6,
    "des": "\"Rosti is considered by some to be the national dish of Switzerland. This is one of many variations. The potato cake doesn't hold together very well. That's ok. Just so long as the little potato strips maintain their integrity. You don't want to end up with mashed potatoes. The object is to make a large potato cake that is light brown and crisp on the outside with soft distinct potato strips on the inside (think big hash brown).\"",
    "ins": "Place potatoes in large pot with chicken broth and add enough water to cover potatoes completely; bring to a boil and cook until potatoes are tender but still firm, about 15 minutes. Drain potatoes, transfer to a bowl and refrigerate until chilled, 8 hours to overnight.\nPreheat oven to 400 degrees F (200 degrees C).\nGrate potatoes, discarding any lumps or skin that don't pass through the grater.\nHeat olive oil and butter in a large, oven-proof skillet over medium-high heat. Saute onion and mushrooms in hot oil mixture until soft but not browned, 5 to 7 minutes. Stir potatoes into skillet. Season potato mixture with salt and black pepper; stir gently and shape into a large potato cake in the skillet.\nCook the potato cake in the skillet until base of cake is browned, 5 to 10 minutes. Place a plate on top of the skillet, turn the skillet upside-down to remove the cake from the pan, and slide cake, browned-side up, back into skillet. Cook until the other side of the cake is browned, 5 to 10 minutes more. Sprinkle Swiss cheese over the top of the cake.\nBake in the preheated oven until cheese melts and starts to brown, 10 to 20 minutes. Cool in the skillet for 10 minutes before slicing.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "9 h ",
    "i": "1965276.jpg",
    "o": "",
    "st": "allrecipes"
}