{
    "id": 240656,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "1 1/2 cups graham cracker crumbs",
        "1/2 cup butter, melted",
        "3 tablespoons white sugar",
        "1/2 teaspoon ground cinnamon",
        "Filling:",
        "3/4 cup caramel ice cream topping",
        "1 cup chopped pecans",
        "5 tablespoons butter",
        "1/2 cup brown sugar",
        "1/4 teaspoon salt",
        "5 Granny Smith apples, cored and sliced",
        "1 (8 ounce) package cream cheese",
        "1/4 cup white sugar",
        "1 egg, beaten",
        "1 teaspoon lemon juice",
        "1 teaspoon vanilla extract",
        "Toppings:",
        "1 cup frozen whipped topping, thawed (optional)",
        "1/4 cup caramel ice cream topping, or to taste (optional)",
        "1/4 cup chopped pecans, or to taste (optional)"
    ],
    "nut": [
        "Calories > 723 kcal",
        "Carbs > 79.6 g",
        "Cholesterol > 104 mg",
        "Fat > 45.4 g",
        "Protein > 6.8 g",
        "Sodium > 541 mg"
    ],
    "n": "Candied Apple Pie",
    "a": "Imagine14me2",
    "r": "0",
    "s": 8,
    "des": "\"This is a wonderful twist on a candied apple.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nMix graham cracker crumbs, melted butter, 3 tablespoons white sugar, and cinnamon together in a bowl; press into a pie pan.\nBake crust in preheated oven until set, 6 to 8 minutes.\nSpread 3/4 cup caramel ice cream topping over the pie crust. Sprinkle 1 cup chopped pecans over the caramel. Refrigerate until the caramel is set, at least 15 minutes.\nMelt 5 tablespoons butter in a saucepan. Stir brown sugar and salt into the butter; add apples and stir to coat. Cook until apples are fork-tender, 10 to 15 minutes; transfer to a bowl and refrigerate until completely cool, at least 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nBeat cream cheese, white sugar, egg, lemon juice, and vanilla extract together in a bowl until smooth.\nSpread chilled apple mixture over the caramel and pecans in the pie crust; top with the cream cheese layer.\nBake in preheated oven until a knife inserted into the center comes out clean, about 30 minutes. Let pie cool completely, at least 30 minutes.\nTop pie with whipped topping. Drizzle 1/4 cup caramel ice cream topping over the pie. Sprinkle 1/4 cup pecans over the caramel and whipped topping.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}