{
    "id": 240607,
    "old_rating": "4.85714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 legs duck",
        "salt and freshly ground black pepper to taste",
        "2 tablespoons vegetable oil",
        "1/4 cup water, or as needed",
        "3 tablespoons olive oil, or more to taste",
        "2 cups diced yellow onion",
        "1 teaspoon ground turmeric",
        "1/2 teaspoon ground cinnamon",
        "1/8 teaspoon ground nutmeg",
        "6 cups chicken broth, or more as needed",
        "2/3 cup pomegranate molasses",
        "1/4 cup honey",
        "3 cups walnut halves"
    ],
    "nut": [
        "Calories > 616 kcal",
        "Carbs > 19.8 g",
        "Cholesterol > 102 mg",
        "Fat > 48 g",
        "Protein > 31 g",
        "Sodium > 837 mg"
    ],
    "n": "Duck Fesenjan",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"A savory stew featuring duck, pomegranate, and walnuts, which is every bit as exotic as it sounds. This is my interpretation of the ancient classic. I'm assuming like most similar recipes, every household has their own version, and this kind of thing can easily be tailored to your tastes.\"",
    "ins": "Season duck legs all over with salt and black pepper.\nHeat vegetable oil in a large skillet over high heat. Place duck legs, skin-side down, in hot oil and cook until browned, 2 to 5 minutes; turn and cook until browned on the other side, 2 to 4 minutes more. Transfer legs to a plate; pour rendered duck fat into a bowl.\nPour water into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Remove from heat.\nHeat about 2 tablespoons duck fat and olive oil in Dutch oven medium heat. Cook and stir onion in hot oil and fat until golden brown, 7 to 10 minutes. Add turmeric, cinnamon, nutmeg; cook and stir until fragrant, 1 minute.\nPour chicken broth, pomegranate molasses, honey, and reserved water mixture from the skillet into onions; bring to a simmer.\nGrind walnuts to a fine powder in a food processor.\nCook and stir walnuts in a skillet over medium heat until fragrant, 2 to 3 minutes. Stir walnuts into broth mixture; place duck legs in broth to cover in broth. Reduce heat and simmer until duck legs are tender, 3 to 4 hours. Transfer duck to a serving dish.\nBring broth mixture to a boil; cook until reduced and desired sauce consistency is reached. Season with salt. Ladle sauce over duck legs.",
    "pt": "15 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}