{
    "id": 240646,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Stuffing:",
        "2 tablespoons corn oil",
        "1 large onion, minced",
        "2 stalks celery, minced",
        "3 carrots, minced",
        "6 slices canned pineapple, minced (juice reserved)",
        "1/2 cup cooked rice",
        "1/2 cup golden raisins",
        "1 1/2 tablespoons chopped fresh parsley",
        "1 teaspoon dried savory",
        "1 teaspoon paprika, or more to taste",
        "1 teaspoon lemon juice, or to taste",
        "salt and freshly ground pepper to taste",
        "12 pork chop crown roast",
        "1 tablespoon vegetable oil, or as needed",
        "6 slices canned pineapple",
        "1 chicken bouillon cube",
        "6 sprigs watercress, or as desired",
        "freshly ground black pepper",
        "12 paper frills"
    ],
    "nut": [
        "Calories > 338 kcal",
        "Carbs > 15 g",
        "Cholesterol > 72 mg",
        "Fat > 18.5 g",
        "Protein > 27.4 g",
        "Sodium > 167 mg"
    ],
    "n": "Crown Roast of Pork",
    "a": "Lucky Noodles",
    "r": "0",
    "s": 12,
    "des": "\"Impress everyone with this tasty dish that is also easy to prepare. Don't forget to order your roast from the butcher a few days before your next party.\"",
    "ins": "Heat corn oil in a skillet over medium heat; cook and stir onion and celery until lightly browned, about 5 minutes. Add carrots, minced pineapple, rice, raisins, parsley, savory, and paprika to onion mixture; cook and stir until stuffing is heated through, 5 to 10 minutes. Season stuffing with lemon juice, salt, and pepper. Remove skillet from heat and allow stuffing to cool.\nPreheat oven to 375 degrees F (190 degrees C). Grease a roasting pan.\nStand the crown roast in the prepared roasting pan and rub vegetable oil over entire roast. Spoon stuffing into the center of the roast. Cover stuffing with a piece of aluminum foil. Wrap each chop bone with foil to prevent charring.\nBake in the preheated oven until pork is cooked through and juices are amber in color, about 2 1/4 hours. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\nTransfer roast to a serving platter and tent a piece of aluminum foil over roast to keep warm, reserving juices in the roasting pan.\nPour the juices in the roasting pan into a skillet and heat over medium heat; cook and stir pineapple slices until golden brown, about 4 minutes per side. Slit 1 side of each pineapple slice and arrange in a curling twist around the roast.\nCarefully skim the fat from the roasting pan juices and add reserved pineapple juice to the skillet. Crumble the bouillon cube into the liquid; bring to a boil. Cook and stir pineapple juice mixture until browned and slightly reduced, about 5 minutes. Transfer to a sauceboat or small bowl to serve alongside roast.\nRemove foil from the tips of the pork chops and replace with paper frills. Garnish each pineapple twist with a watercress sprig.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "3 h",
    "i": "1868614.jpg",
    "o": "",
    "st": "allrecipes"
}