{
    "id": 240606,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 quarts water",
        "3 tablespoons kosher salt",
        "2 cups basmati rice, rinsed",
        "1 pinch ground cumin",
        "salt to taste",
        "2 tablespoons olive oil",
        "1 russet potato, cut into 1/4-inch slices",
        "3 tablespoons butter, cut into thin slices, or to taste",
        "1 pinch saffron threads",
        "1 1/2 tablespoons hot water",
        "1 tablespoon chopped parsley, or to taste"
    ],
    "nut": [
        "Calories > 255 kcal",
        "Carbs > 41.6 g",
        "Cholesterol > 11 mg",
        "Fat > 8.3 g",
        "Protein > 4.2 g",
        "Sodium > 2223 mg"
    ],
    "n": "Persian Rice",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"I believe I've posted a few fool-proof methods for cooking perfect rice, but this Persian version takes the grand prize, and it's not even close for second. The beauty of this method is that it doesn't rely on any specific measurements, or even exact times. This will make some of you very nervous, but just go with it.\"",
    "ins": "Bring water and kosher salt to a boil in a pot; add rice and cook, stirring, for exactly 7 minutes. Drain.\nHeat olive oil in a pot over medium-high heat. Cover bottom of pot with 1 layer of potato slices. Sprinkle cumin and salt over potatoes. Cook until potatoes are sizzling, 2 to 3 minutes; top potatoes with rice to form an even layer. Reduce heat to low and place butter slices over rice.\nTop pot with a layer of clean paper towels and place lid over towels. Steam until rice is fluffy, about 45 minutes.\nGrind saffron threads with a mortar and pestle. Mix crushed saffron with 1 1/2 tablespoons hot water in a large bowl. Add a couple spoonfuls of rice to saffron mixture and stir until rice is yellow.\nSpoon remaining rice into a serving bowl, top with saffron rice, and line edges of bowl with potatoes. Garnish with parsley.",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "4523631.jpg",
    "o": "4523631.jpg,4518898.jpg,4511099.jpg,3931345.jpg,3613030.jpg,2059174.jpg",
    "st": "allrecipes"
}