{
    "id": 240601,
    "old_rating": "4.61111",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup roasted pistachio nut meats",
        "1 1/2 cups white sugar, divided",
        "3/4 cup all-purpose flour",
        "3/4 cup cake flour",
        "2 teaspoons baking powder",
        "3/4 teaspoon salt",
        "3/4 cup unsalted butter, at room temperature",
        "4 large eggs",
        "2/3 cup milk, at room temperature",
        "2 teaspoons vanilla"
    ],
    "nut": [
        "Calories > 175 kcal",
        "Carbs > 20.9 g",
        "Cholesterol > 47 mg",
        "Fat > 9.1 g",
        "Protein > 3.2 g",
        "Sodium > 151 mg"
    ],
    "n": "Real Pistachio Cupcakes",
    "a": "Candice",
    "r": "0",
    "s": 24,
    "des": "\"St. Patrick would certainly give his approval. Because these cupcakes are the real deal! No pudding mixes here, just roasted pistachios. A wonderfully not-too-sweet pale green cupcake that is sure to please. Easy and quick to make, too!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line 24 muffin cups with paper liners.\nBlend pistachios with 1/2 cup sugar in a blender until finely ground.\nSift all-purpose flour, cake flour, baking powder, and salt together in a bowl.\nBeat 1 cup sugar and butter together in a large bowl with an electric mixer until light and fluffy. Beat one egg at a time into the creamy butter mixture, thoroughly integrating each egg before adding the next.\nStir milk and vanilla extract together in a separate bowl.\nAlternately stir flour mixture and milk mixture in small amounts into the butter mixture beginning and ending with the flour mixture; stir just until it comes together into a batter. Fold the ground pistachios into the batter. Spoon batter into the prepared muffin cups to about 2/3 full.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 15 to 18 minutes. Cool in the muffin cups for 5 minutes before removing to cool completely on a wire rack.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "2028148.jpg",
    "o": "4471320.jpg,4399306.jpg,3438683.jpg,3396536.jpg,2693282.jpg,2222815.jpg",
    "st": "allrecipes"
}