{
    "id": 240624,
    "old_rating": "3.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "4 skinless, boneless chicken breast halves, cut into cubes",
        "2 tablespoons garlic powder, or to taste, divided",
        "1 (16 ounce) package macaroni",
        "1/2 cup butter, divided",
        "1/4 cup all-purpose flour",
        "4 cups whole milk",
        "1 pound Cheddar cheese, shredded",
        "2 sleeves buttery round crackers (such as RitzÂ®), crushed"
    ],
    "nut": [
        "Calories > 851 kcal",
        "Carbs > 69.3 g",
        "Cholesterol > 138 mg",
        "Fat > 44.9 g",
        "Protein > 41.1 g",
        "Sodium > 775 mg"
    ],
    "n": "Garlic Chicken Mac and Cheese",
    "a": "Ruth Mayhan-Evinger",
    "r": "0",
    "s": 8,
    "des": "\"A hearty macaroni and cheese dish jazzed up with garlic and chicken. I get requests for this at EVERY potluck! I experimented to get this dish after eating out at Dave and Buster's in Philadelphia, PA. This is my take on it.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nPrepare a large skillet with cooking spray and place over medium heat. Cook chicken in skillet until no longer pink in the center, 5 to 7 minutes; season with 1 tablespoon garlic powder and transfer to a baking dish.\nBring a large pot of lightly salted water to a boil. Cook macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes; drain and mix with chicken in the baking dish.\nMelt 1/4 cup butter in a large pot over medium heat. Cook flour in melted butter until the flour is cooked and the mixture forms a roux, about 5 minutes. Stream milk into the pot while stirring to mix with the roux completely; cook until just about simmering, about 5 minutes more. Add Cheddar cheese in small amounts to the sauce and stir to melt completely before adding the next portion; cook and stir until thick and smooth, 2 to 3 minutes. Pour the sauce over the chicken and macaroni; stir to coat.\nMelt 1/4 cup butter in the skillet in which you cooked the chicken over medium heat. Stir remaining tablespoon garlic powder into the melted butter; cook until fragrant, 1 to 2 minutes. Remove skillet from heat and stir crushed crackers into the butter mixture to coat; spread over the chicken and macaroni mixture in the baking dish.\nBake in preheated oven until the topping is crispy, 35 to 45 minutes.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4122704.jpg",
    "o": "",
    "st": "allrecipes"
}