{
    "id": 240674,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package elbow macaroni",
        "1 tablespoon vegetable oil",
        "1/2 cup butter, melted",
        "2 teaspoons olive oil",
        "1/2 onion, minced",
        "1 cup crumbled blue cheese",
        "1 cup shredded Muenster cheese",
        "1 cup shredded sharp Cheddar cheese",
        "1 cup shredded Monterey Jack cheese",
        "1 1/2 cups half-and-half",
        "2 eggs, beaten",
        "1 tablespoon Worcestershire sauce",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground black pepper",
        "8 ounces processed cheese food, cubed",
        "1 tablespoon butter, cut into small chunks"
    ],
    "nut": [
        "Calories > 506 kcal",
        "Carbs > 32.6 g",
        "Cholesterol > 115 mg",
        "Fat > 32.8 g",
        "Protein > 20.5 g",
        "Sodium > 671 mg"
    ],
    "n": "Kim's Five Cheese-n-Mac",
    "a": "KimmerDan",
    "r": "0",
    "s": 12,
    "des": "\"Mac-n-cheese! Worcestershire, onion, and blue cheese add a kick to the traditional recipe!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch baking dish.\nBring a large pot of lightly salted water to a boil. Add elbow macaroni and vegetable oil to the boiling water and cook, stirring occasionally, until cooked through but firm to the bite, 8 to 10 minutes. Drain and return pasta to the pot. Stir 1/2 cup melted butter into macaroni.\nHeat olive oil in a skillet over medium-high heat. Saute onion in hot oil until tender and translucent, 3 to 7 minutes.\nStir blue cheese, Muenster cheese, Cheddar cheese, and Monterey Jack cheese together in a large bowl. Whisk sauteed onion, half-and-half, eggs, Worcestershire sauce, salt, and black pepper together in another bowl.\nMix 3 1/2 cups of the cheese mixture, half-and-half mixture, and processed cheese food into macaroni. Pour macaroni mixture into the prepared baking dish. Sprinkle remaining cheese mixture over the top and dot with 1 tablespoon butter.\nBake in the preheated oven until hot and bubbling around the edges, about 35 minutes.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}