{
    "id": 240741,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 onion, thinly sliced",
        "1/4 cup white vinegar",
        "1 tablespoon salt",
        "1 large large eggplant, peeled and sliced into long strips",
        "1 tablespoon olive oil, or as needed",
        "2 large pita bread rounds, cut into 1-inch squares",
        "2 tomatoes, cut into thin strips",
        "1 large green bell pepper, sliced into thin strips",
        "1/2 cup olive oil",
        "1/4 cup sumac powder",
        "salt to taste"
    ],
    "nut": [
        "Calories > 448 kcal",
        "Carbs > 38.5 g",
        "Cholesterol > 0 mg",
        "Fat > 31.5 g",
        "Protein > 6.5 g",
        "Sodium > 1956 mg"
    ],
    "n": "Zesty Eggplant Salad",
    "a": "captnsaj",
    "r": "0",
    "s": 4,
    "des": "\"My wife's specialty. Similar to fattoush, but with a different assortment of vegetables, including (of course) eggplant which gives this salad an extra zing! This dish was a hit at a holiday potluck. The salad is ready to serve, but letting the entire salad soak overnight is recommended.\"",
    "ins": "Place onion in a bowl and add vinegar and 1 tablespoon salt. Let onion soak for 1 hour.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nArrange eggplant on a baking sheet and brush with 1 tablespoon olive oil until evenly coated.\nBroil eggplant until flesh is pink, about 5 minutes. Flip eggplant and broil until other side is pink, about 5 minutes more. Cool eggplant. Reduce oven's temperature to 450 degrees F (230 degrees C).\nSpread pita bread on a baking sheet.\nCook pita bread in preheated oven until toasted and crispy, about 10 minutes.\nCombine tomatoes and green bell pepper in a large bowl; add eggplant and onion with vinegar and salt. Mix olive oil and sumac into tomato mixture; season with salt. Toss pita bread pieces into salad just before serving.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}