{
    "id": 240742,
    "old_rating": "4.72222",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil, or as needed",
        "1 pound chicken sausage",
        "4 ounces chorizo sausage",
        "1 large sweet potato, diced",
        "2 teaspoons garlic powder",
        "1/4 teaspoon cayenne pepper",
        "salt and ground black pepper to taste",
        "1/2 cup chicken broth, or more as needed",
        "1 zucchini, diced",
        "1 cup fresh spinach (optional)",
        "1 egg"
    ],
    "nut": [
        "Calories > 377 kcal",
        "Carbs > 24.5 g",
        "Cholesterol > 114 mg",
        "Fat > 20.6 g",
        "Protein > 21.9 g",
        "Sodium > 1280 mg"
    ],
    "n": "Paleo Hash",
    "a": "bizzymomma",
    "r": "0",
    "s": 5,
    "des": "\"I was craving a hash and decided to throw together something that was paleo-friendly. The sweet potatoes in this give it a touch of sweetness, the chorizo gives it a flavorful punch, and the egg tops this dish off perfectly! It is an easy dish to choose different veggies and make it your own! Have fun with it!\"",
    "ins": "Heat olive oil in a skillet over medium heat. Cook and stir chicken sausage and chorizo sausage in the hot oil until browned and cooked through, about 10 minutes. Drain excess grease.\nStir sweet potato, garlic powder, cayenne pepper, salt, and pepper into sausage mixture; add chicken broth and simmer, adding more chicken broth if mixture gets too dry, until sweet potato is tender, 10 to 15 minutes. Mix zucchini and spinach into sweet potato-sausage mixture and simmer until zucchini is tender, 5 to 10 minutes. Drain excess liquid.\nFill a large saucepan with 2 to 3 inches of water and bring to a boil. Reduce the heat to medium-low and keep the water at a gentle simmer. Crack an egg into a small bowl then gently slip the egg into the simmering water, holding the bowl just above the surface of the water. Poach the egg until the whites are firm and the yolks have thickened but are not hard, 2 1/2 to 3 minutes. Remove egg from the water with a slotted spoon.\nTop sweet potato-sausage mixture with poached egg.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "4466629.jpg",
    "o": "4431714.jpg,3947937.jpg,3488848.jpg,3363768.jpg,3361864.jpg,2949793.jpg",
    "st": "allrecipes"
}