{
    "id": 240718,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 (12 ounce) package NO YOLKSÂ® Extra Broad Noodles",
        "2 cups chopped green beans (fresh or thawed if frozen)",
        "1/3 cup balsamic vinegar",
        "2 tablespoons maple syrup",
        "2 tablespoons Dijon mustard",
        "1 1/2 teaspoons minced garlic",
        "3/4 teaspoon salt, divided",
        "3/4 teaspoon ground black pepper, divided",
        "3 tablespoons extra virgin olive oil",
        "4 (4 ounce) boneless, skinless salmon fillets",
        "1 cup thinly sliced red onion",
        "1 cup thinly sliced red bell pepper",
        "1 cup torn fresh basil leaves"
    ],
    "nut": [
        "Calories > 546 kcal",
        "Carbs > 51.5 g",
        "Cholesterol > 67 mg",
        "Fat > 23.1 g",
        "Protein > 30.8 g",
        "Sodium > 726 mg"
    ],
    "n": "NO YOLKSÂ® Maple Balsamic Glazed Salmon with Noodles",
    "a": "NO YOLKSÂ® Noodles",
    "r": "0",
    "s": 4,
    "des": "\"The salmon and olive oil in this recipe contain heart healthy omega 3 and monounsaturated fatty acids. This dish comes together with a sweet and tangy balsamic vinaigrette, but you can shortcut the prep by using any favourite bottled balsamic dressing.\"",
    "ins": "Prepare the noodles according to package directions. Add the green beans 4 minutes before draining.\nWhisk the vinegar with the syrup, mustard, garlic and 1/2 teaspoon (2 mL) each salt and pepper until combined. Whisk in the olive oil until well combined. Measure out and reserve 2 tablespoon (30 mL) of the dressing. Toss the hot cooked noodles and beans with the onion, red pepper, basil and remaining dressing.\nMeanwhile, lightly coat a nonstick pan with cooking spray and set over medium heat. Season the salmon with the remaining salt and pepper. Add the salmon and cook for 3 to 4 minutes per side or until just a hint of coral remains. Brush salmon with reserved dressing. Serve the noodle mixture topped with a piece of salmon.",
    "pt": "20 m",
    "ct": "8 m",
    "tt": "28 m",
    "i": "1920853.jpg",
    "o": "",
    "st": "allrecipes"
}