{
    "id": 24075,
    "old_rating": "4.62469",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package lasagna noodles",
        "3 cups heavy cream",
        "2 (10.75 ounce) cans condensed cream of mushroom soup",
        "1 cup grated Parmesan cheese",
        "1/4 cup butter",
        "1 tablespoon olive oil",
        "1/2 large onion, diced",
        "4 cloves garlic, sliced",
        "5 mushrooms, diced",
        "1 roasted chicken, shredded",
        "salt and ground black pepper to taste",
        "1 cup ricotta cheese",
        "1 bunch fresh spinach, rinsed",
        "3 cups shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 620 kcal",
        "Carbs > 23.1 g",
        "Cholesterol > 166 mg",
        "Fat > 45.4 g",
        "Protein > 31 g",
        "Sodium > 872 mg"
    ],
    "n": "Chicken and Spinach Alfredo Lasagna",
    "a": "Sue",
    "r": "0",
    "s": 12,
    "des": "\"A different, yet wonderful twist on normal lasagna!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Cook lasagna noodles for 8 to 10 minutes, or until al dente. Drain, and rinse with cold water.\nIn a saucepan over low heat, mix together heavy cream, cream of mushroom soup, Parmesan cheese, and butter. Simmer, stirring frequently, until well blended.\nHeat the olive oil in a skillet over medium heat. Cook and stir the onion in olive oil until tender, then add garlic and mushrooms. Mix in the chicken, and cook until heated through. Season with salt and pepper.\nLightly coat the bottom of a 9x13 inch baking dish with enough of the cream sauce mixture to coat. Layer with 1/3 of the lasagna noodles, 1/2 cup ricotta, 1/2 of the spinach, 1/2 the chicken mixture, and 1 cup mozzarella. Top with 1/3 the cream sauce mixture, and repeat the layers. Place the remaining noodles on top, and spread with remaining sauce.\nBake 1 hour in the preheated oven, or until brown and bubbly. Top with the remaining mozzarella, and continue baking until cheese is melted and lightly browned.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "1512862.jpg",
    "o": "4525391.jpg,4480251.jpg,4476645.jpg,4468818.jpg,4322278.jpg,3776111.jpg",
    "st": "allrecipes"
}