{
    "id": 240895,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 tablespoon butter",
        "2 yellow onions, diced",
        "3 ribs celery, diced",
        "1/2 cup white wine",
        "4 potatoes, chopped",
        "2 cups fish stock",
        "1 tablespoon chopped fresh thyme",
        "1 teaspoon seafood seasoning (such as Old BayÂ®)",
        "1 bay leaf",
        "salt and ground black pepper to taste",
        "1 cup heavy whipping cream",
        "1 (4 ounce) fillet sea bass, chopped, or more to taste",
        "1/2 teaspoon white sugar",
        "3 dashes hot sauce"
    ],
    "nut": [
        "Calories > 354 kcal",
        "Carbs > 31.9 g",
        "Cholesterol > 67 mg",
        "Fat > 19.9 g",
        "Protein > 9.5 g",
        "Sodium > 460 mg"
    ],
    "n": "Tammy's Fish Chowder",
    "a": "Tammy",
    "r": "0",
    "s": 6,
    "des": "\"Fish chowder that's a little thinner than restaurant chowders. I made this with a homemade fish stock made from sea bass and used the cooked fish from the stock for the chowder as well. Serve with crusty French bread.\"",
    "ins": "Heat olive oil and butter in a large stockpot over medium heat; cook and stir onions and celery in the hot oil until softened, about 5 minutes. Add wine; raise heat to medium-high and cook until wine is reduced by half, 2 to 3 minutes.\nMix potatoes, fish stock, thyme, seafood seasoning, bay leaf, salt, and pepper into onion mixture; bring to a boil, reduce heat to medium-low, cover stockpot, and simmer until potatoes are tender but not falling apart, 10 to 15 minutes.\nHeat cream in a small saucepan over medium heat just until cream is steaming, about 5 minutes. Stir cream and sea bass into potato mixture; cook until sea bass is cooked through, about 10 minutes. Season chowder with sugar, hot sauce, salt, and pepper.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "1963937.jpg",
    "o": "",
    "st": "allrecipes"
}