{
    "id": 240814,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups water",
        "1/2 cup amaranth",
        "1 cup peanut butter",
        "1 cup white sugar",
        "1/2 cup butter, softened",
        "1 large egg",
        "1 1/2 cups all-purpose flour",
        "1 1/2 cups whole wheat pastry flour",
        "1 cup quick-cooking oats",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt"
    ],
    "nut": [
        "Calories > 140 kcal",
        "Carbs > 17.2 g",
        "Cholesterol > 12 mg",
        "Fat > 6.7 g",
        "Protein > 3.7 g",
        "Sodium > 135 mg"
    ],
    "n": "Peanut Butter and Amaranth Cookies",
    "a": "Cheerios",
    "r": "0",
    "s": 36,
    "des": "\"A chewy peanut butter cookie that has a crunchy texture with the goodness of amaranth cereal in every bite.\"",
    "ins": "Combine water and amaranth together in a saucepan; bring to a boil, reduce heat to medium-low, and simmer until water is absorbed and amaranth grains are fluffy, about 20 minutes. Cool for 10 to 15 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nBeat cooked amaranth and peanut butter together in a large bowl until smooth. Beat in sugar until completely dissolved. Add butter to amaranth mixture and mix; stir in egg until smooth.\nWhisk all-purpose flour, pastry flour, oats, baking powder, baking soda, and salt together in a bowl. Gradually add flour mixture to amaranth mixture, stirring until the dough starts to come away from the sides of the bowl.\nForm dough into small balls and place 2-inches apart on a baking sheet. Dip a fork into flour and press dough balls with fork to flatten.\nBake in the preheated oven until set, about 15 minutes. Cool on the baking sheet for 3 to 5 minutes before removing to a wire rack to cool completely.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "2514674.jpg",
    "o": "",
    "st": "allrecipes"
}