{
    "id": 240821,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup rice flour",
        "1/4 cup garbanzo flour",
        "1/4 cup potato starch",
        "1/4 cup arrowroot powder",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon baking soda",
        "1/2 teaspoon xanthan gum",
        "1/4 teaspoon salt",
        "1/2 cup So DeliciousÂ® Dairy Free Vanilla Coconut Milk",
        "1 cup organic raw cane sugar",
        "1/3 cup coconut oil",
        "1 cup unsweetened applesauce",
        "1 teaspoon vanilla extract",
        "1/2 cup unsweetened coconut flakes",
        "Coconut Flake Coating:",
        "1/2 cup powdered sugar",
        "1 tablespoon hot water, plus additional if needed",
        "1/2 cup unsweetened coconut flakes, or more as needed"
    ],
    "nut": [
        "Calories > 335 kcal",
        "Carbs > 44.3 g",
        "Cholesterol > 0 mg",
        "Fat > 17.3 g",
        "Protein > 2.4 g",
        "Sodium > 217 mg"
    ],
    "n": "Coconut Vanilla Doughnuts",
    "a": "So DeliciousÂ® Dairy Free",
    "r": "0",
    "s": 8,
    "des": "\"These oven-baked homemade doughnuts are sugar glazed then dusted with coconut flakes.\"",
    "ins": "Grease a 6-donut pan with coconut oil and preheat oven to 350 degrees F.\nSift together all the flour ingredients: rice, garbanzo, potato starch, arrowroot, baking powder, baking soda, xanthan gum and salt. Whisk together in a bowl and set aside.\nIn a medium pot, add in milk and coconut oil and allow to warm over low heat until the coconut oil melts (do not allow to boil). Mix gently with a wooden spoon while it's warming. Once the coconut oil is melted, remove from heat and add in the sugar. Stir together to allow the sugar to dissolve completely. Add in apple sauce and vanilla extract and stir to combine.\nPour the liquid mixture into the dry ingredients and mix gently to combine together well. (If clumps still develop, you can use an immersion blender and mix the batter for a few minutes until you see a very smooth consistency in the batter.)\nAdd in coconut flakes and mix with a wooden spoon to combine. Pour into pre-greased donut pan and fill about halfway to allow for rising of the batter.\nBake for 15 minutes at 350 degrees F. Remove from the oven and allow to cool 15 to 30 minutes. Gently scrape the sides of each well and flip the pan over to remove. You can use a toothpick to help the donuts lift out of the pan.\nTo coat the donuts in coconut flakes: Make a glaze by adding the powdered sugar into a small bowl and adding in 1 tablespoon at a time of hot water. Mix well to combine. Coat the donuts thinly with the glaze and drop onto a plate with coconut flakes to coat all over. Makes 6-8 donuts.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "1927460.jpg",
    "o": "",
    "st": "allrecipes"
}