{
    "id": 240888,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 slices bacon",
        "3 jalapeno peppers, minced",
        "1 cup yellow cornmeal",
        "1 cup skim milk",
        "3/4 cup gluten-free flour",
        "2 tablespoons white sugar",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "2 eggs",
        "1/4 cup butter, melted",
        "1 cup shredded pepperjack cheese, divided",
        "5 green onions, chopped"
    ],
    "nut": [
        "Calories > 333 kcal",
        "Carbs > 27.4 g",
        "Cholesterol > 113 mg",
        "Fat > 19.4 g",
        "Protein > 12.5 g",
        "Sodium > 808 mg"
    ],
    "n": "Cheesy Bacon Jalapeno Skillet Cornbread",
    "a": "Megan",
    "r": "0",
    "s": 6,
    "des": "\"After some trial and error, this is by far my favorite cornbread recipe. It's spicy, moist, and the cast iron skillet gives it a lovely crispy brown crust, plus bacon! Also I love that it doesn't use buttermilk because I hate buying it just for cornbread. And it's gluten-free.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nPlace bacon in a cast iron skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels, reserving bacon grease in the skillet. Spread the grease up the sides of the skillet using a paper towel.\nCook jalapeno peppers in the bacon grease over medium heat until lightly browned, about 5 minutes.\nCombine cornmeal and skim milk together in a bowl; let sit until some of the liquid is absorbed, 5 to 10 minutes.\nWhisk flour, sugar, baking powder, and salt together in a separate bowl. Mix eggs and butter into cornmeal mixture; stir into flour mixture just until batter is moist. Fold 1/2 cup pepperjack cheese and green onions into batter. Pour batter into the cast iron skillet; crumble bacon over top and sprinkle remaining cheese over bacon.\nBake in the preheated oven until set and a toothpick inserted in the center comes out clean, about 18 minutes.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "2116654.jpg",
    "o": "4503042.jpg,4080964.jpg,3957463.jpg,3957461.jpg,3620456.jpg,3424680.jpg",
    "st": "allrecipes"
}