{
    "id": 240886,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 small octopus, at room temperature",
        "water to cover",
        "1/4 cup red wine vinegar",
        "2 cups whole wheat orzo pasta",
        "1 (14.5 ounce) can chicken broth",
        "1 teaspoon cooking oil, or as needed",
        "1 cup chopped yellow bell pepper",
        "1 cup chopped baby bella mushrooms",
        "7 kalamata olives, pitted and chopped",
        "ground black pepper to taste",
        "1 cup torn fresh spinach",
        "1 lemon, juiced, or to taste",
        "2 tablespoons crumbled feta cheese, or to taste"
    ],
    "nut": [
        "Calories > 554 kcal",
        "Carbs > 65.2 g",
        "Cholesterol > 120 mg",
        "Fat > 8.9 g",
        "Protein > 50.9 g",
        "Sodium > 1352 mg"
    ],
    "n": "Orzo and Octopus Skillet",
    "a": "Mingh Daniel",
    "r": "0",
    "s": 3,
    "des": "\"This colorful meal includes whole wheat orzo, vegetables, and octopus. Prep is relatively easy. You can cook the orzo, saute the vegetables, and boil the octopus at the same time. Enjoy eating healthy.\"",
    "ins": "Place octopus in a pot and add enough water to cover; add red wine vinegar. Bring liquid to a boil, cover pot, reduce heat to medium, and simmer until a toothpick goes through the thickest part of the octopus smoothly, about 30 minutes. Remove octopus from pot and chop into bite-size pieces. Discard water-vinegar mixture.\nCombine orzo and chicken broth in a small pot over medium heat; allow orzo to absorb the chicken broth, adding more water, about 1 tablespoon at a time, if orzo gets too dry. Cook until orzo is tender yet firm to the bite, 5 to 8 minutes; drain.\nHeat oil in a skillet over medium-high heat; saute yellow bell pepper, mushrooms, and olives until tender, 5 to 10 minutes. Season bell pepper mixture with black pepper.\nMix orzo, spinach, and octopus into bell pepper mixture until spinach begins to wilt from the heat of the orzo. Add lemon juice to orzo mixture; top with feta cheese.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "2037965.jpg",
    "o": "",
    "st": "allrecipes"
}