{
    "id": 240866,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Chicken:",
        "1/2 cup all-purpose flour",
        "4 (6 ounce) skinless, boneless chicken breast halves, pounded thin",
        "salt and ground black pepper to taste",
        "1 teaspoon olive oil",
        "Sauce:",
        "1/2 cup apple juice",
        "1/2 cup sweet red wine",
        "1 tablespoon butter",
        "1 pinch salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 320 kcal",
        "Carbs > 16.3 g",
        "Cholesterol > 105 mg",
        "Fat > 8.3 g",
        "Protein > 37 g",
        "Sodium > 185 mg"
    ],
    "n": "Pan-Seared Chicken with Apple-Red Wine Sauce",
    "a": "KidChef",
    "r": "0",
    "s": 4,
    "des": "\"This is one of my favorite recipes, invented quickly before a dinner with relatives. Any red wine will do for this recipe, but pick a dessert wine if you can. Be careful to pound the chicken breasts thin enough so that they cook through in the pan.\"",
    "ins": "Pour flour into a shallow dish. Dredge chicken through the flour, shaking off excess flour; season with salt and pepper.\nHeat olive oil in a skillet over medium-high heat for 1 minute. Place a small piece of chicken into the hot oil. If the oil sizzles, it is ready. Cook chicken in the hot oil until golden brown on the outside and no longer pink in the center, about 5 minutes per side. Transfer chicken to a serving dish, retaining the oil and browned bits of food in the pan.\nLower heat to medium and pour apple juice and red wine into the pan; bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Let mixture sit over medium heat until sauce is a syrup-like consistency, 2 to 3 minutes. Stir butter until sauce until melted; season with salt and pepper. Spoon sauce over chicken.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "3268813.jpg",
    "o": "",
    "st": "allrecipes"
}