{
    "id": 240894,
    "old_rating": "4.70588",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups water",
        "1 cup quinoa",
        "1 tablespoon olive oil",
        "1 small onion, diced",
        "1 yellow bell pepper, diced",
        "1 orange bell pepper, diced",
        "1 jalapeno pepper, minced",
        "2 cloves garlic, minced",
        "1 (15 ounce) can black beans, rinsed and drained",
        "1/3 cup chopped fresh cilantro",
        "1 tablespoon chili powder",
        "1 teaspoon lime juice",
        "1 teaspoon ground cumin",
        "salt and ground black pepper to taste",
        "1 (10 ounce) can enchilada sauce",
        "2 cups shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 388 kcal",
        "Carbs > 38.6 g",
        "Cholesterol > 40 mg",
        "Fat > 18 g",
        "Protein > 19.2 g",
        "Sodium > 673 mg"
    ],
    "n": "Black Bean and Quinoa Enchilada Bake",
    "a": "S T Andersen",
    "r": "0",
    "s": 6,
    "des": "\"Great dish for Mexican night with lots of different possibilities. The best thing about this recipe is it can be served by itself for a main dish on Mexican night, or be eaten with tortilla chips as a dip or even rolled up in a tortilla as a taco, burrito, or enchilada. Garnish with green onions, avocado, tomatoes, or/and sour cream. Very versatile recipe. So enjoy and learn the many uses of oh so healthy quinoa.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring water and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water has been absorbed, 15 to 20 minutes.\nHeat olive oil in a skillet over medium heat; cook and stir onion, yellow bell pepper, orange bell pepper, jalapeno pepper, and garlic in the hot oil until softened, about 10 minutes.\nMix black beans, pepper mixture, quinoa, cilantro, chili powder, lime juice, cumin, salt, and pepper together in a bowl; transfer to a casserole dish. Pour enchilada sauce over quinoa mixture, spreading sauce evenly over the top. Sprinkle Cheddar cheese over sauce. Cover dish with aluminum foil.\nBake in the preheated oven for 20 minutes. Remove foil and continue baking until cheese is bubbling, 10 to 15 minutes.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4539338.jpg",
    "o": "4510731.jpg,4510728.jpg,2367184.jpg,2367183.jpg,1996793.jpg,1996792.jpg",
    "st": "allrecipes"
}