{
    "id": 240980,
    "old_rating": "4.81818",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 ReynoldsÂ® Slow Cooker Liner",
        "1 pound lean ground beef",
        "1 medium green bell pepper, chopped",
        "1 small onion, chopped",
        "2 (15 ounce) cans red kidney beans, undrained",
        "2 (1.25 ounce) packages chili seasoning mix",
        "1 (15 ounce) can tomato sauce",
        "1 (10 ounce) can diced tomatoes and green chiles",
        "Shredded cheese (optional)",
        "Sour cream (optional)"
    ],
    "nut": [
        "Calories > 497 kcal",
        "Carbs > 52.3 g",
        "Cholesterol > 81 mg",
        "Fat > 17 g",
        "Protein > 38.9 g",
        "Sodium > 3025 mg"
    ],
    "n": "Slow Cooker Game Day Chili",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 4,
    "des": "\"When it comes to tailgate foods, chili is a classic dish that is perfect for football weather.  Our recipe for a hearty beef chili can be prepared in a slow cooker, meaning that it's easy to prepare, store and transport.  And best of all, with a Reynoldsâ„¢ Slow Cooker liner, cleaning up at your next tailgate will be easier than ever.\"",
    "ins": "Open Reynolds(R) Slow Cooker Liner and place it inside a 5- to 6 1/2 -quart slow cooker bowl. Fit liner snugly against the bottom and sides of bowl; pull top of liner over rim of bowl.\nBrown ground beef, bell pepper and onion in a large skillet over medium-high heat, stirring occasionally, until beef is no longer pink. Drain well.\nPlace beef mixture into slow cooker liner. Combine remaining ingredients in a medium bowl. Pour over beef mixture; gently stir with wooden or plastic spoon to combine. Place lid on slow cooker.\nCook on LOW for 6 to 7 hours OR on HIGH for 3 to 3 1/2 hours until heated through.\nCarefully remove lid to allow steam to escape. Serve food directly from slow cooker liner. Do not lift or transport liner with food inside. Cool slow cooker completely; remove liner and toss.",
    "pt": "30 m",
    "ct": "6 h",
    "tt": "6 h ",
    "i": "1978176.jpg",
    "o": "",
    "st": "allrecipes"
}