{
    "id": 240995,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Marinated Chicken:",
        "1/4 cup water",
        "3 tablespoons light soy sauce",
        "2 tablespoons canola oil",
        "2 tablespoons cornstarch",
        "1 tablespoon sesame oil",
        "1 1/2 teaspoons white sugar",
        "3/4 teaspoon salt",
        "1/2 teaspoon garlic powder",
        "1 (20 ounce) package skinless, boneless chicken thighs, sliced",
        "Stir-Fry:",
        "1 head cauliflower, cut into florets",
        "1/4 cup canola oil for frying, or as needed",
        "4 cloves garlic, smashed",
        "1 cup water, or to taste, divided",
        "1 (10.75 ounce) can cream of mushroom soup (such as Campbell'sÂ®)",
        "1/4 cup oyster sauce",
        "3/4 teaspoon white sugar",
        "3/4 teaspoon salt"
    ],
    "nut": [
        "Calories > 299 kcal",
        "Carbs > 14.8 g",
        "Cholesterol > 64 mg",
        "Fat > 17.4 g",
        "Protein > 21.2 g",
        "Sodium > 1341 mg"
    ],
    "n": "Chicken and Cauliflower Stir-Fry",
    "a": "Darling",
    "r": "0",
    "s": 6,
    "des": "\"A delicious mix of East meets West. Tasty, marinated chicken slices tossed with fresh cauliflower in a creamy mushroom sauce. Perfect over steamed rice. \nFor best results, marinate the chicken overnight or at least 1/2 hour before cooking. This is a family-favorite from my kitchen to yours. Enjoy!\"",
    "ins": "Stir 1/4 cup water, soy sauce, 2 tablespoons canola oil, cornstarch, sesame oil, 1 1/2 teaspoons sugar, 3/4 teaspoon salt, and garlic powder together in a large glass bowl until smooth. Stir chicken into the marinade to coat. Cover the bowl with plastic wrap and marinate chicken in the refrigerator for at least 30 minutes to overnight.\nBring a large pot of lightly salted water to a boil. Cook cauliflower florets in boiling water until just barely tender, 3 to 5 minutes. Drain cauliflower and immediately immerse in an ice water bath for several minutes until cold to stop the cooking process; drain.\nHeat canola oil in a large wok or skillet over high heat until nearly smoking. Add garlic to the hot oil; sprinkle salt over the garlic. Cook garlic in hot oil, using a spoon to keep garlic pressed into the oil, until the cloves are dark brown, 2 to 3 minutes. Remove and discard garlic cloves.\nDrain chicken and discard marinade. Stir chicken into the hot oil and let it cook undisturbed until browned, 3 to 5 minutes. Stir chicken. Pour 1/2 cup water over the chicken. Scrape bottom of wok with the flat edge of a wooden spoon to scrape any browned bits from the bottom of the wok into the liquid.\nPour cream of mushroom soup and remaining 1/2 cup water over the chicken; stir. Add oyster sauce, 3/4 teaspoon sugar, and 3/4 teaspoon salt to the chicken mixture. Stir cauliflower with the chicken and coat completely in sauce; cook and stir until the cauliflower is tender and the chicken is no longer pink in the center, 5 to 7 minutes.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}