{
    "id": 240905,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "4 slices thick-cut bacon, diced",
        "1/2 (12 ounce) package frozen chopped spinach, thawed and drained",
        "4 mushrooms, chopped",
        "1/4 green bell pepper, chopped",
        "2 slices onion, chopped",
        "1 pinch salt and ground black pepper to taste",
        "6 eggs",
        "1 tablespoon heavy whipping cream",
        "1 1/4 cups shredded Colby-Jack cheese, divided",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 pinch onion powder",
        "1 pinch garlic powder"
    ],
    "nut": [
        "Calories > 237 kcal",
        "Carbs > 4 g",
        "Cholesterol > 223 mg",
        "Fat > 17.7 g",
        "Protein > 16.5 g",
        "Sodium > 669 mg"
    ],
    "n": "Low-Carb Bacon Spinach Egg Cups",
    "a": "Paula T",
    "r": "0",
    "s": 6,
    "des": "\"Low-carb egg, and cheese veggie muffins perfect for on the go. You can make them ahead and reheat in the microwave a few seconds. A great change from the usual low-carb bacon and eggs!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray 12 muffin cups with cooking spray.\nCook and stir bacon in a skillet over medium-high heat until crisp, about 10 minutes. Transfer bacon to a bowl, reserving bacon grease in the skillet.\nCombine spinach, mushrooms, green bell pepper, onion, salt, and ground black pepper to taste in the skillet with bacon grease; cook and stir until softened, about 5 minutes. Transfer vegetable mixture to a bowl and place in the freezer to cool, about 5 minutes.\nWhisk eggs and cream together in a bowl; stir in 1 cup Colby-Jack cheese, 1/2 teaspoon salt, 1/4 teaspoon ground black pepper, onion powder, and garlic powder. Add cooled vegetables and bacon to egg mixture and mix gently.\nScoop 1/4 cup egg mixture into each muffin cup; top each with remaining Colby-Jack cheese.\nBake in the preheated oven until egg cups are set, about 20 minutes.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "4519878.jpg",
    "o": "4518879.jpg,4484243.jpg,4484242.jpg,4484241.jpg,4477949.jpg,4472167.jpg",
    "st": "allrecipes"
}