{
    "id": 241003,
    "old_rating": "3.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup rice vinegar",
        "2 tablespoons white sugar",
        "1/2 teaspoon salt",
        "1 cup matchstick-cut carrots",
        "1 cup matchstick-cut daikon radish",
        "2 cups water",
        "1 cup basmati rice",
        "Dressing:",
        "1 1/2 tablespoons vegetable oil",
        "1 tablespoon lime juice",
        "2 teaspoons grated ginger",
        "1 teaspoon sesame oil",
        "1 clove garlic, minced",
        "1/2 teaspoon chile paste (such as sambal oelek), or to taste",
        "1/2 teaspoon salt",
        "1/3 cup chopped fresh cilantro",
        "1/4 cup chopped roasted peanuts",
        "2 green onions, thinly sliced"
    ],
    "nut": [
        "Calories > 216 kcal",
        "Carbs > 33.8 g",
        "Cholesterol > 0 mg",
        "Fat > 7.8 g",
        "Protein > 4.3 g",
        "Sodium > 467 mg"
    ],
    "n": "Namasu Rice Salad with Pickled Daikon Radish and Carrots",
    "a": "AnnInLondon",
    "r": "0",
    "s": 6,
    "des": "\"Pickled carrot and daikon radish can be found in Korean, Vietnamese, and Japanese cuisine. Combined with rice in this cool, light and flavorful salad, it will remind you of sushi and rice rolls. Shrimp or crab can be added to make this into a main dish salad.\"",
    "ins": "Whisk rice vinegar, sugar, and 1/2 teaspoon salt together in a bowl; add carrots and radish and stir until well-coated. Cover the bowl with plastic wrap and refrigerate, stirring occasionally, until flavors blend, at least 1 hour. Drain.\nBring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and liquid is absorbed, 20 to 25 minutes. Spread rice out on a baking sheet and cool to room temperature.\nWhisk vegetable oil, lime juice, ginger, sesame oil, garlic, chile paste, and remaining salt together in a large bowl. Add rice, drained carrot mixture, cilantro, peanuts, and green onions to the bowl; stir until salad is well-coated. Serve warm or cold.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "2228784.jpg",
    "o": "",
    "st": "allrecipes"
}