{
    "id": 241098,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 tablespoon white vinegar",
        "5 dashes hot sauce",
        "1/2 teaspoon salt",
        "1/8 teaspoon ground black pepper",
        "2 cloves garlic, minced, or more to taste",
        "1/4 onion, chopped",
        "1 onion, thinly sliced",
        "1/2 small zucchini, cut into small chunks",
        "1/4 (6 ounce) can sliced black olives",
        "1 cup shredded Cabbage",
        "1 tablespoon sliced jalapeno pepper, or to taste",
        "1 (15 ounce) can black beans, rinsed and drained",
        "4 burrito-size tortillas, or as needed"
    ],
    "nut": [
        "Calories > 417 kcal",
        "Carbs > 60.6 g",
        "Cholesterol > 0 mg",
        "Fat > 13.9 g",
        "Protein > 13.4 g",
        "Sodium > 1289 mg"
    ],
    "n": "Vegetarian Black Bean Burritos",
    "a": "ZAINAB19",
    "r": "0",
    "s": 4,
    "des": "\"This is one of our favorite summer dinners - a black bean vegetarian burrito. Full of flavor and good for you too! Serve on flour or corn tortillas with cheese, sour cream or yogurt, tomatoes, and whatever burrito toppings you like!\"",
    "ins": "Whisk olive oil, vinegar, hot sauce, salt, and black pepper together in a microwave-safe glass or ceramic bowl.\nLayer garlic, chopped onion, sliced onion, zucchini, olives, cabbage, jalapeno, and black beans, respectively, over hot sauce mixture. Cover the bowl with plastic wrap and poke a few holes in the top.\nMicrowave for 5 minutes; stir, recover with plastic wrap, and microwave until filling is hot throughout, about 5 minutes more.\nSpoon hot filling in a line across the middle of a tortilla. Fold opposing edges of the tortilla to overlap the filling. Roll 1 of the opposing edges around the filling into a burrito. Repeat with remaining tortillas and filling.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "2176343.jpg",
    "o": "",
    "st": "allrecipes"
}