{
    "id": 241035,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 lime, juiced",
        "1/2 lemon, juiced",
        "2 tablespoons white sugar",
        "2 (1.5 fluid ounce) jiggers reposado tequila (such as Jose CuervoÂ® Gold)",
        "1 cup ice cubes, or as needed",
        "salt as needed",
        "1 teaspoon brandy-based orange liqueur (such as Grand MarnierÂ®), or to taste (optional)"
    ],
    "nut": [
        "Calories > 322 kcal",
        "Carbs > 32.2 g",
        "Cholesterol > 0 mg",
        "Fat > 0 g",
        "Protein > 0.2 g",
        "Sodium > 164 mg"
    ],
    "n": "Gerry's Margarita",
    "a": "BloodyGerry",
    "r": "0",
    "s": 1,
    "des": "\"The perfect margarita made with all fresh ingredients! I love margaritas. Let me rephrase that, I love good margaritas. This recipe took me about 6 months to perfect, and 5 years to share. I promise once you taste the freshness and balance of this recipe, you'll not only impress yourself, but your friends too. This recipe is consistent, and will come out the same exact way every time. Here are some dos and don'ts to make sure it comes out my way, Gerry's way. Use 2 heaping tablespoons white sugar. The most common mistake is people don't use enough white sugar because they think its too much. The drink will be tart. Don't worry most of the sugar stays in the shaker. Let the drink rest after shaking. That little bit of water from the ice melting helps the balance.\"",
    "ins": "Squeeze lime juice and lemon juice into a cocktail shaker; top with sugar. Pour tequila over sugar mixture and add ice. Cover shaker and shake. Allow shaker to rest for 1 to 2 minutes.\nSpread salt onto a plate. Rub the lemon around the rim of the margarita glass and dip the rim into the salt to coat. Pour margarita into glass and top with brandy-based orange liqueur.",
    "pt": "10 m",
    "ct": "",
    "tt": "",
    "i": "2082829.jpg",
    "o": "",
    "st": "allrecipes"
}