{
    "id": 241000,
    "old_rating": "4.46667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cheese Sauce:",
        "2 tablespoons butter, or as needed",
        "2 tablespoons all-purpose flour, or as needed",
        "1 cup cold milk",
        "2 ounces shredded provolone cheese, or more to taste",
        "1 pinch ground nutmeg",
        "1 pinch cayenne pepper",
        "salt to taste",
        "1 (12 ounce) skirt steak",
        "salt and freshly ground black pepper to taste",
        "3 tablespoons olive oil, divided, or as needed",
        "1/4 cup water",
        "1/3 cup diced onion",
        "1/3 cup diced sweet peppers",
        "2 baguettes, or as needed, cut into 48 1/2-inch thick slices",
        "1/4 cup shredded provolone cheese, or as needed"
    ],
    "nut": [
        "Calories > 280 kcal",
        "Carbs > 34.8 g",
        "Cholesterol > 18 mg",
        "Fat > 9.9 g",
        "Protein > 12.9 g",
        "Sodium > 489 mg"
    ],
    "n": "Mini Philly Cheesesteaks",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"Miniaturized sandwiches don't usually float my boat, or submarine, as they're almost always not as good as the full-sized versions, but these mini Philly cheesesteaks really captured everything I love about the classic.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line baking sheets with aluminum foil.\nMelt butter in a skillet over medium-high heat. Whisk flour into hot butter and cook, whisking constantly, until mixture is pale and flour taste cooks off, about 1 minute. Pour milk into flour mixture and cook, whisking constantly, until mixture is hot and thickened, 3 to 6 minutes. Add 2 ounces provolone cheese, nutmeg, cayenne pepper, and salt; stir until cheese is completely melted. Remove from heat.\nSeason steak all over with salt and ground black pepper.\nHeat 1 tablespoon olive oil in skillet over medium-high heat. Cook steak in hot oil, turning occasionally, until meat is slightly firm and pink on the inside, 5 to 7 minutes. Transfer meat to a plate.\nReturn skillet to heat and pour water into the skillet; bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Pour liquid from the skillet over steak. Cool steak to room temperature; dice meat and place meat and accumulated juices from the plate into a large bowl.\nHeat 1 tablespoon oil in a skillet over medium-high heat; saute onion and peppers in hot oil until softened and slightly translucent, about 5 minutes.\nStir peppers and onions mixture into diced meat; season with salt and pepper.\nSpread bread slices out on prepared baking sheets and drizzle remaining olive oil over the top. Turn slices over so that the oiled-side is facing down. Spread a thick layer of cheese mixture onto each slice. Spoon meat mixture over cheese. Sprinkle provolone cheese over the top of each slice.\nBake in the preheated oven until browned and cheese is melted, 12 to 15 minutes.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}