{
    "id": 241097,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 bunch celery, sliced",
        "1 large onion, chopped",
        "2 tablespoons chili powder",
        "1 tablespoon ground cumin",
        "2 cloves garlic, minced, or more to taste",
        "1 (28 ounce) can diced tomatoes",
        "1 (15 ounce) can cannellini beans, drained and rinsed",
        "1 (15 ounce) can red kidney beans, drained and rinsed",
        "1 tablespoon lime juice, or to taste",
        "hot sauce to taste",
        "salt and ground black pepper to taste",
        "8 (10 inch) warm flour tortillas"
    ],
    "nut": [
        "Calories > 382 kcal",
        "Carbs > 60.1 g",
        "Cholesterol > 0 mg",
        "Fat > 9.8 g",
        "Protein > 12.6 g",
        "Sodium > 925 mg"
    ],
    "n": "Appetizing Vegetarian Burritos",
    "a": "Jennyness",
    "r": "0",
    "s": 8,
    "des": "\"An easy vegetarian burrito recipe I whipped up one night. This is very basic and can be dolled up however you like. I serve these topped with sour cream, shredded Cheddar cheese, chopped tomatoes, and sliced green onions.\"",
    "ins": "Heat oil in a large skillet over medium-high heat. Saute celery and onion in hot oil until onion starts to turn translucent, 5 to 7 minutes. Add chili powder and cumin; saute until onion is soft, about 5 minutes more. Stir garlic into onion mixture and saute until fragrant, about 30 seconds.\nStir tomatoes into onion mixture; bring to a simmer, reduce heat to medium, and cook and stir until liquid is mostly evaporated and mixture is thick, 5 to 10 minutes.\nMix cannellini beans and red kidney beans into tomato mixture; cook until bean filling is heated through, 5 to 10 minutes. Season filling with lime juice, hot sauce, salt, and black pepper.\nSpoon filling in a line across the middle of a tortilla. Fold opposing edges of the tortilla to overlap the filling. Roll 1 of the opposing edges around the filling into a burrito. Repeat with remaining filling and tortillas.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "2055840.jpg",
    "o": "",
    "st": "allrecipes"
}