{
    "id": 241085,
    "old_rating": "4.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/3 cup lite soy sauce",
        "1 tablespoon Thai garlic chile paste",
        "2 cloves garlic, diced",
        "2 teaspoons cayenne pepper",
        "1 1/2 teaspoons diced fresh ginger",
        "1/2 (16 ounce) package linguine-style rice noodles",
        "3 tablespoons olive oil",
        "1 (12 ounce) package extra-firm tofu, cut into 1/2-inch cubes",
        "3 green onions, minced",
        "1 cup snow peas",
        "1/2 green bell pepper, sliced",
        "1/2 red bell pepper, sliced"
    ],
    "nut": [
        "Calories > 834 kcal",
        "Carbs > 115.2 g",
        "Cholesterol > 0 mg",
        "Fat > 31.3 g",
        "Protein > 25.4 g",
        "Sodium > 1708 mg"
    ],
    "n": "Spicy Tofu Stir Fry",
    "a": "Leah",
    "r": "0",
    "s": 2,
    "des": "\"This is a very hot and spicy tofu recipe that I made up one night for a change. My husband loves it and he's the typical steak-and-potatoes kind of guy!\"",
    "ins": "Whisk soy sauce, garlic chile paste, garlic, cayenne pepper, and ginger together in a small bowl until chile paste is completely dissolved.\nPlace noodles in a large bowl and cover with hot water. Set aside until noodles are softened, 8 to 10 minutes. Drain and rinse.\nHeat oil in a large wok over medium heat. Cook and stir tofu cubes in hot oil until browned on all sides, 3 to 6 minutes. Stir green onion into tofu; cook and stir until fragrant, about 2 minutes. Pour 1/2 of the soy sauce mixture over tofu mixture; bring to a simmer and cook until sauce reduces, about 5 minutes.\nStir snow peas, green bell pepper, and red bell pepper into tofu mixture; cook and stir until vegetables are heated through, about 5 minutes. Pour remaining soy sauce mixture over the top; cook and stir until liquid reduces and vegetables are tender yet still crisp to the bite, about 5 minutes. Add rice noodles to tofu mixture and toss to coat; cook until noodles are heated through and flavors combine, 2 to 5 minutes.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "3955128.jpg",
    "o": "",
    "st": "allrecipes"
}