{
    "id": 241096,
    "old_rating": "3.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "1 tablespoon minced garlic",
        "1 tablespoon chili powder, divided",
        "2 teaspoons ground black pepper, divided",
        "2 teaspoons cayenne pepper, divided",
        "1 teaspoon ground cumin",
        "1 cup canned pinto beans, rinsed and drained",
        "1 cup canned black beans, rinsed and drained",
        "1 cup frozen corn, thawed, drained",
        "1 cup cooked brown rice",
        "6 burrito-size flour tortillas"
    ],
    "nut": [
        "Calories > 394 kcal",
        "Carbs > 66.9 g",
        "Cholesterol > 0 mg",
        "Fat > 9.2 g",
        "Protein > 12.6 g",
        "Sodium > 746 mg"
    ],
    "n": "Gracie's Amazing Vegetarian Burritos",
    "a": "That Grace",
    "r": "0",
    "s": 6,
    "des": "\"These are quick and easy to make, as well as incredibly tasty and filling. One of my husband's very favorite dishes, he always stuffs himself with one too many! Serve with grape tomatoes, shredded cheese, chopped lettuce, sour cream, and fresh guacamole. You can use any wrap instead of the flour tortillas, if desired.\"",
    "ins": "Heat oil in a large skillet or wok over medium-high heat. Cook and stir onion, garlic, 1 1/2 teaspoons chili powder, 1 teaspoon black pepper, 1 teaspoon cayenne pepper, and cumin in hot oil until onion softens, 3 to 5 minutes.\nStir pinto beans, black beans, corn, and rice together in a bowl. Add bean mixture to skillet 1 cup at a time, stirring well after each addition. Stir remaining chili powder, black pepper, and cayenne pepper into beans mixture, reduce heat to medium, cover the skillet with a lid, and cook, stirring as necessary, until heated through and flavors blend, 3 to 5 minutes.\nSpoon 1/6 of the bean mixture in a line across the middle of 1 tortilla. Fold opposing edges of the tortilla to overlap the filling. Roll 1 of the opposing edges around the filling into a burrito. Repeat with remaining bean mixture and tortillas.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "4263328.jpg",
    "o": "",
    "st": "allrecipes"
}