{
    "id": 241168,
    "old_rating": "4.375",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 strips bacon",
        "10 stalks asparagus, trimmed",
        "1 teaspoon vegetable oil, or as needed",
        "1/3 red onion, diced",
        "1/2 tomato, diced",
        "3 button mushrooms, sliced",
        "5 eggs",
        "3 tablespoons heavy whipping cream",
        "1 pinch freshly ground nutmeg",
        "salt and ground black pepper to taste",
        "1/2 cup grated mozzarella cheese"
    ],
    "nut": [
        "Calories > 538 kcal",
        "Carbs > 10.2 g",
        "Cholesterol > 544 mg",
        "Fat > 39.6 g",
        "Protein > 36.6 g",
        "Sodium > 1088 mg"
    ],
    "n": "Asparagus Omelette",
    "a": "the newdy foodies",
    "r": "0",
    "s": 2,
    "des": "\"Who knew asparagus and eggs tasted so good together? Fantastic for lazy Sunday mornings (that turn into afternoons) or a quick dinner. The Master Omelettier's secret to a gorgeous and fluffy omelette is to cook covered on medium-low until the final step - adding cheese and broiling in the oven for 2 minutes, or until brown.  For the fearless cook and the adventurous eater, consider adding some smoked salmon flavored cream cheese. Enjoy with toast or fresh croissants. Bon appetite!\"",
    "ins": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Crumble bacon pieces.\nBring a large pot of lightly salted water to a boil. Add asparagus and cook until tender yet firm to the bite, 2 to 3 minutes. Drain.\nHeat vegetable oil in a skillet over medium-high heat; saute onion, tomato, and mushrooms until tender, about 5 minutes.\nWhisk eggs and cream together in a bowl; add bacon, sauteed vegetables, asparagus, nutmeg, salt, and pepper.\nPour egg mixture into an oven-proof nonstick skillet and cover skillet. Cook over medium-low until cooked through, 10 to 12 minutes. Sprinkle mozzarella cheese over omelette.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nBroil omelette in the preheated oven until a golden crust starts to form on the top, about 2 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "2147619.jpg",
    "o": "",
    "st": "allrecipes"
}