{
    "id": 241171,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 orange, zested and juiced",
        "1 lemon, zested and juiced",
        "1/4 cup coconut milk",
        "2 tablespoons chia seeds",
        "1 teaspoon vanilla extract",
        "2 cups all-purpose flour",
        "1/2 cup white sugar",
        "1 teaspoon baking soda",
        "1 teaspoon ground ginger",
        "1 teaspoon ground cardamom",
        "3/4 teaspoon salt",
        "1/2 cup cold coconut oil, divided into 8 equal-size pieces",
        "1/4 cup finely chopped pecans",
        "1/4 cup finely chopped almonds",
        "1/4 cup hemp seed hearts"
    ],
    "nut": [
        "Calories > 201 kcal",
        "Carbs > 21.9 g",
        "Cholesterol > 0 mg",
        "Fat > 11.8 g",
        "Protein > 3.5 g",
        "Sodium > 189 mg"
    ],
    "n": "Vegan Lemon-Orange Pecan-Almond Hemp-Chia Ginger-Cardamom Scones",
    "a": "Kameron",
    "r": "0",
    "s": 16,
    "des": "\"My foray into scone variants has taken another complicated turn; loving every turn along the way though!\"",
    "ins": "Preheat convection oven to 300 degrees F (150 degrees C). Line baking sheets with parchment paper.\nStir orange juice and lemon juice together in a small bowl; add enough water, if necessary, to equal 7 tablespoons liquid.\nStir juice mixture, coconut milk, orange zest, lemon zest, chia seeds, and vanilla extract together in a bowl; set aside until chia seeds gel, about 10 minutes.\nCombine flour, sugar, baking soda, ginger, cardamom, and salt in the bowl of a food processor; pulse until just-combined. Add cold coconut oil pieces and process until mixture resembles wet sand. Pour chia mixture into flour mixture; pulse until dough begins to come together.\nTransfer dough to a bowl and add pecans, almonds, and hemp; knead with your hands until nuts and seeds are evenly distributed. Divide dough into 2 pieces, and flatten each piece into a 1-inch thick disc. Cut each disc into 8 wedges, and places wedges on prepared baking sheets.\nBake in the preheated oven until tops spring back when pressed, 30 to 35 minutes.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "3481961.jpg",
    "o": "",
    "st": "allrecipes"
}