{
    "id": 241103,
    "old_rating": "4.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup orange juice",
        "1/4 cup lime juice",
        "2 tablespoons olive oil",
        "1 teaspoon dried minced garlic",
        "1 teaspoon dried minced onion",
        "3/4 teaspoon dried oregano",
        "1/2 teaspoon dried cilantro leaves",
        "1/2 teaspoon salt",
        "1/2 teaspoon coarsely ground black pepper",
        "1 1/2 pounds boneless chicken breasts, cut into thin strips",
        "1 green bell pepper, cut into thin strips",
        "1 onion, thinly sliced",
        "8 (8 inch) flour tortillas"
    ],
    "nut": [
        "Calories > 309 kcal",
        "Carbs > 31.7 g",
        "Cholesterol > 49 mg",
        "Fat > 8.7 g",
        "Protein > 24.6 g",
        "Sodium > 546 mg"
    ],
    "n": "Garlic Onion Chicken Fajitas with Lime",
    "a": "Melissa mieske",
    "r": "0",
    "s": 8,
    "des": "\"The aroma of the lime is so good, and when you cook it it fills the kitchen and people come-a-running. I accompany this with southwest-style rice.\"",
    "ins": "Whisk orange juice, lime juice, olive oil, garlic, dried onion, oregano, cilantro, salt, and black pepper together in a bowl until marinade is smooth. Measure out 1/4 cup of the marinade and set aside. Pour remaining marinade into a resealable plastic bag, place chicken in the bag, squeeze out excess air, and seal the bag. Marinate chicken in the refrigerator for at least 30 minutes.\nRemove chicken from marinade and shake off excess; discard remaining marinade.\nCook and stir chicken in a large skillet over medium-high heat until lightly browned and cooked through, 3 to 7 minutes. Transfer chicken to a plate. Cook and stir pepper and onion in the same skillet with reserved 1/4 cup of marinade until vegetables are tender and liquid is reduced, about 5 minutes. Return chicken to skillet; cook and stir until heated through, 2 to 3 minutes.\nSpoon chicken mixture into tortillas.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "55 m",
    "i": "2154067.jpg",
    "o": "",
    "st": "allrecipes"
}