{
    "id": 241101,
    "old_rating": "4.60714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Marinade:",
        "4 cloves garlic",
        "1 tablespoon kosher salt",
        "3 tablespoons lime juice",
        "3 tablespoons olive oil",
        "3 tablespoons minced fresh cilantro, or more to taste",
        "1 teaspoon chili powder",
        "1/2 teaspoon white sugar",
        "1/2 teaspoon paprika",
        "1/4 teaspoon cayenne pepper",
        "1 1/2 pounds beef skirt steak, cut across the grain into 1/4-inch strips",
        "6 whole wheat tortillas, or as needed",
        "1 tablespoon canola oil, divided",
        "1 large onion, cut into slices",
        "1 red bell pepper, cut into strips",
        "1 clove garlic, minced",
        "1/4 teaspoon salt"
    ],
    "nut": [
        "Calories > 453 kcal",
        "Carbs > 48.1 g",
        "Cholesterol > 38 mg",
        "Fat > 21.8 g",
        "Protein > 27.4 g",
        "Sodium > 1974 mg"
    ],
    "n": "Sizzlin' Fajitas",
    "a": "Tara Daley",
    "r": "0",
    "s": 4,
    "des": "\"These fajitas are my husband's favorite quick-and-easy dinner. They are so tasty! If you do not have the time to marinate the meat for 2 or more hours, just leave it out at room temperature, keeping the bag zipped tightly for about 20 to 30 minutes. Serve with sour cream, Cheddar cheese or Monterey Jack cheese, and lime wedges.\"",
    "ins": "Grind garlic with kosher salt with a mortar and pestle until a paste forms. Whisk garlic paste, lime juice, olive oil, cilantro, chili powder, sugar, paprika, and cayenne pepper together in a bowl; pour marinade into a resealable plastic bag. Add skirt steak strips, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator, 2 hours to overnight.\nRemove steak from marinade and shake off excess; discard remaining marinade.\nPreheat oven to 300 degrees F (150 degrees C). Wrap tortillas tightly in aluminum foil to form a packet and place packet on a baking sheet.\nBake in the preheated oven until warmed through, about 10 minutes. Keep warm.\nHeat 1 teaspoon canola oil in a large skillet over high heat until oil begins to smoke. Saute onion and bell pepper in hot oil until browned and almost tender, 4 to 5 minutes. Transfer onion and pepper to a plate.\nHeat 1 teaspoon canola oil in the same skillet over high heat until oil starts to smoke. Cook 1/2 of the steak in hot oil until browned on all sides but still pink in the center, 4 to 6 minutes. Transfer cooked steak to the plate with onion and pepper.\nHeat remaining canola oil in the same skillet. Cook remaining steak in hot oil until browned on all sides but still pink in the center, 4 to 6 minutes. Stir cooked steak, onion, bell pepper, and any accumulated juices back into the skillet. Add minced garlic and salt; cook and stir until fragrant and heated through. Remove from heat. Divide steak mixture between warm tortillas.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "2 h ",
    "i": "2042091.jpg",
    "o": "",
    "st": "allrecipes"
}