{
    "id": 241201,
    "old_rating": "3.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (14.5 ounce) package tortilla chips, or to taste",
        "2 pounds shredded Monterey Jack cheese",
        "1 1/2 pounds large peeled and deveined cooked shrimp, tails removed and shrimp quartered",
        "1 cup mayonnaise",
        "4 chipotle peppers in adobo sauce, chopped",
        "1/2 cup chopped fresh cilantro",
        "1/4 cup dried minced onion (such as McCormickÂ® Coarse Grind Blend White and Green Onions)",
        "1 1/2 tablespoons ground cumin",
        "1/4 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 387 kcal",
        "Carbs > 15 g",
        "Cholesterol > 111 mg",
        "Fat > 27.7 g",
        "Protein > 20.1 g",
        "Sodium > 482 mg"
    ],
    "n": "Shrimp Nachos",
    "a": "Hudson's Mama",
    "r": "0",
    "s": 20,
    "des": "\"This is my most requested recipe to bring to get-togethers and there's always someone who hasn't had them who asks for the recipe. You can make it days ahead of time and have it out of the oven in just a few minutes when you need it. Add more chipotle peppers if you like it spicier. This recipe makes a lot, but it actually freezes well. I usually freeze half of it and have it another time. If you're making it for a party, though, bring it all because it will be gone!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nSpread tortilla chips onto the prepared baking sheet.\nMix Monterey Jack cheese, shrimp, mayonnaise, chipotle peppers in adobo sauce, cilantro, minced onion, cumin, and black pepper together in a bowl. Spoon mixture onto the tortilla chips.\nBake in the preheated oven for 3 minutes. Turn on the broiler and broil nachos until lightly browned, 3 to 4 minutes. Allow nachos to sit at room temperature for about 2 minutes before serving.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "25 m",
    "i": "3888583.jpg",
    "o": "",
    "st": "allrecipes"
}