{
    "id": 241281,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound dried red beans",
        "3 andouille sausage links",
        "2 tablespoons butter",
        "2 cups minced onions",
        "1 cup minced green bell pepper",
        "1/2 cup minced celery",
        "4 bay leaves",
        "1 slice ham steak, cubed, or more to taste",
        "2 tablespoons Creole seasoning, divided",
        "7 cups chicken broth",
        "2 tablespoons chopped garlic",
        "1 cup tomato sauce",
        "2 teaspoons vinegar",
        "1/2 cup chopped green onions, divided",
        "2 tablespoons chopped fresh parsley",
        "3 cups cooked rice, or to taste"
    ],
    "nut": [
        "Calories > 508 kcal",
        "Carbs > 80.5 g",
        "Cholesterol > 27 mg",
        "Fat > 9.3 g",
        "Protein > 26.8 g",
        "Sodium > 2124 mg"
    ],
    "n": "My Red Beans and Rice",
    "a": "Kelly Hughes",
    "r": "0",
    "s": 6,
    "des": "\"This is the creamy red beans and rice everyone asks me to make.\"",
    "ins": "Place red beans into a large container and cover with several inches of cool water; let stand 8 hours to overnight. Drain.\nHeat a skillet over medium heat; cook sausage until cooked through, 10 to 15 minutes. Transfer sausage to a work surface and slice.\nHeat butter in a skillet over medium heat; cook and stir onions, bell pepper, celery, and bay leaves until softened, about 5 minutes. Add sausage, ham, and 1/2 of the Creole seasoning; saute over medium-high heat until lightly browned, about 10 minutes. Stir drained beans into sausage mixture.\nMix chicken broth, garlic, and remaining Creole seasoning into bean mixture; cover skillet and simmer on low for 3 hours.\nStir tomato sauce, vinegar, and 1/2 of the green onions into bean mixture, slightly smashing beans with a potato masher. Simmer, uncovered, until thickened and beans are tender, about 30 minutes more. Mix remaining green onions and parsley into beans and serve over cooked rice.",
    "pt": "10 m",
    "ct": "3 h ",
    "tt": "12 h ",
    "i": "3962812.jpg",
    "o": "",
    "st": "allrecipes"
}