{
    "id": 241293,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup sliced almonds (optional)",
        "1 (10 ounce) package frozen strawberries - thawed, drained, and juice reserved",
        "water as needed",
        "1/2 cup white sugar",
        "2 tablespoons cornstarch",
        "1 (8 ounce) package cream cheese, softened",
        "2 tablespoons white sugar",
        "1 teaspoon vanilla extract",
        "1 cup milk",
        "3 eggs, beaten",
        "1 1/2 teaspoons white sugar",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1 loaf Italian bread",
        "1 tablespoon butter, or as needed"
    ],
    "nut": [
        "Calories > 802 kcal",
        "Carbs > 107.3 g",
        "Cholesterol > 171 mg",
        "Fat > 31.5 g",
        "Protein > 22.9 g",
        "Sodium > 998 mg"
    ],
    "n": "Strawberry French Toast",
    "a": "Grammy M B H",
    "r": "0",
    "s": 5,
    "des": "\"This makes an elegant looking breakfast or brunch and can be made up the night before then grilled in the morning. I have used fresh strawberries and just blended them to use in making the sauce. Top with whipped cream.\"",
    "ins": "Cook and stir almonds in a skillet over medium high heat until fragrant and toasted, 3 to 5 minutes.\nAdd enough water to reserved strawberry liquid to equal 1 cup liquid.\nStir 1/2 cup sugar and cornstarch together in a saucepan over medium heat. Gradually stir strawberry liquid into sugar mixture; cook, stirring constantly, until mixture is clear and thick, 3 to 5 minutes. Stir strawberries and almonds into sugar mixture.\nBeat cream cheese, 2 tablespoons sugar, and vanilla extract together in a bowl. Whisk milk, eggs, 1 1/2 teaspoons sugar, cinnamon, and nutmeg together in a bowl.\nSlice bread at 1 1/2-inch intervals about 3/4 of the way through. Cut a slit in the center of each slice to form a pocket, and fill each pocket with 1 rounded tablespoon of the cream cheese mixture. Separate slices from loaf by cutting each slice the rest of the way through the loaf.\nDip bread slices in egg mixture to coat completely.\nMelt butter on a griddle over medium-high heat. Working in batches, cook bread slices on preheated griddle until golden brown, 2 to 5 minutes per side. Serve French toast with strawberry-almond mixture.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "2087745.jpg",
    "o": "",
    "st": "allrecipes"
}