{
    "id": 241209,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Salsa:",
        "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TELÂ®)",
        "2 onions, chopped, divided",
        "1 (1.25 ounce) package salsa seasoning mix",
        "salt and ground black pepper to taste",
        "2 (4 ounce) pork steaks, or more to taste",
        "1/2 cup butter",
        "1 (15 ounce) can refried beans",
        "1 burrito seasoning",
        "8 large flour tortillas",
        "1 (15 ounce) can chili, or more as needed",
        "1 (8 ounce) package shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 641 kcal",
        "Carbs > 65.8 g",
        "Cholesterol > 84 mg",
        "Fat > 31.9 g",
        "Protein > 24.2 g",
        "Sodium > 1938 mg"
    ],
    "n": "Pork and Bean Burrito",
    "a": "Teresa Sykes",
    "r": "0",
    "s": 8,
    "des": "\"This is a delicious burrito that is baked in your oven. The beans and salsa make it extra good!\"",
    "ins": "Mix diced tomatoes with green chile peppers, 1 chopped onion, salsa seasoning mix, salt, and pepper together in a bowl; refrigerate until the salsa flavors blend, at least 1 hour.\nBring a pot of water to a boil. Cook pork steaks in the boiling water until cooked through, 10 to 15 minutes. Remove pork steaks from water and cut into pieces.\nHeat butter in a skillet over medium heat; cook and stir pork and remaining 1 chopped onion in the hot butter until onion is tender, about 30 minutes. Mix refried beans, burrito seasoning, and 1/2 of the salsa into the pork mixture.\nPreheat oven to 350 degrees F (175 degrees C).\nSpoon pork mixture down the center of each tortilla and roll tortilla around the filling. Place burritos in a baking dish. Top burritos with chili and Cheddar cheese.\nBake in the preheated oven until cheese is melted, 10 to 15 minutes. Serve burritos with remaining salsa.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}