{
    "id": 241285,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Crepes:",
        "1 cup all-purpose flour",
        "4 eggs",
        "1/2 cup milk",
        "1/2 cup cold water",
        "2 tablespoons butter, melted",
        "Peanut Butter Filling:",
        "1 cup smooth peanut butter, at room temperature",
        "3 tablespoons confectioners' sugar",
        "1/2 teaspoon vanilla extract",
        "1/2 teaspoon rum-flavored extract",
        "Chocolate Sauce:",
        "1 1/3 cups milk chocolate chips",
        "3/4 cup 18% cream, at room temperature",
        "1/2 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 341 kcal",
        "Carbs > 26.1 g",
        "Cholesterol > 83 mg",
        "Fat > 23.4 g",
        "Protein > 10.3 g",
        "Sodium > 174 mg"
    ],
    "n": "Peanut Butter-Filled Crepes with Warm Chocolate Sauce",
    "a": "Fanny Bay Gourmet",
    "r": "0",
    "s": 12,
    "des": "\"Look out Mr. Reese because here comes an easy-to-make, decadent version of the peanut butter cup. Lightly sweetened and delicate peanut butter filling spread over a easy-to-make crepe and topped with melted milk chocolate chips. The crepes are easily rolled or folded for a 'suzette' style presentation.\"",
    "ins": "Blend flour, eggs, milk, cold water, and butter together in a food processor or blender until smooth, about 30 seconds. Scrape batter off the sides with a rubber spatula and blend 15 seconds more. Place batter in the refrigerator, at least 1 hour.\nBeat peanut butter in the bowl of a stand mixer using the paddle attachment until smooth and creamy. Beat confectioners' sugar, 1 tablespoon at a time, into creamed peanut butter, mixing well after each addition. Add 1/2 teaspoon vanilla extract and rum-flavored extract and mix well. Store peanut butter filling in an air-tight container until 30 minutes before needed.\nHeat a 10-inch non-stick skillet over medium-low heat. Remove the skillet from the burner; add a scant 1/4 cup batter to the center of the pan and swirl and tilt immediately to spread the batter evenly over the bottom of the skillet. Return the skillet to the heat. Cook crepe until edges appear slightly dry and pull away from the pan, about 1 minute. Gently slip a thin spatula under the crepe and gently flip. Cook the second side until lightly browned on the bottom, 45 to 60 seconds. Transfer crepe to a plate. Repeat until all the batter is used, separating each crepe with waxed or parchment paper.\nMelt chocolate chips in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Mix cream and 1/2 teaspoon vanilla extract into the melted chocolate; cook, stirring frequently, until chocolate sauce is thickened, about 20 minutes.\nSpread peanut butter filling over each crepe and drizzle warm chocolate sauce over filling. Fold crepe in half or roll crepe around filling for Suzette-style crepes.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "2 h ",
    "i": "2155073.jpg",
    "o": "",
    "st": "allrecipes"
}