{
    "id": 241359,
    "old_rating": "4.69231",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups chicken broth, divided",
        "1 1/2 cups white rice",
        "1 pound andouille sausage, diced",
        "1 large sweet onion (such as VidaliaÂ®), chopped",
        "3 green onions, or to taste, chopped",
        "1 cup chopped celery",
        "1 large green bell pepper, chopped",
        "2 tablespoons Creole seasoning (such as Tony Cachere'sÂ®)",
        "2 tablespoons minced garlic",
        "1 teaspoon hot sauce (such as Frank'sÂ® RedHot Â®)",
        "ground black pepper to taste",
        "1 (14.5 ounce) can tomato sauce",
        "1 (14.5 ounce) can diced tomatoes",
        "1 pound shrimp, peeled and deveined",
        "1 cooked whole chicken breast, shredded",
        "1 cup chicken broth"
    ],
    "nut": [
        "Calories > 425 kcal",
        "Carbs > 36.6 g",
        "Cholesterol > 136 mg",
        "Fat > 18.6 g",
        "Protein > 25 g",
        "Sodium > 1588 mg"
    ],
    "n": "Andouille, Shrimp, and Chicken Jambalaya",
    "a": "Mandybelcanto",
    "r": "0",
    "s": 8,
    "des": "\"A Cajun jambalaya that suits the whole family!\"",
    "ins": "Bring 3 cups chicken broth and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and liquid has been absorbed, 20 to 25 minutes.\nHeat cast-iron Dutch oven over medium-high heat. Cook and stir andouille sausage in hot pot until browned, about 5 minutes. Remove sausage from the pot with a slotted spoon, retaining any drippings in the pot.\nSaute sweet onion, green onions, celery, and bell pepper in the sausage drippings until tender, 5 to 7 minutes. Season vegetable mixture with Creole seasoning, minced garlic, hot sauce, and black pepper; cook for 1 minute more.\nPour tomato sauce and diced tomatoes over the vegetable mixture; stir and add shrimp, shredded chicken, browned sausage, and 1 cup chicken broth into the tomato mixture. Bring the mixture to a boil, reduce heat to medium-low, and cook at a simmer until he shrimp are no longer translucent, 10 to 15 minutes.\nScoop rice into bowls and ladle jambalaya over the rice.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "2074174.jpg",
    "o": "",
    "st": "allrecipes"
}