{
    "id": 241337,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 1/4 cups 2% cottage cheese",
        "2 cups butter, softened",
        "5 cups all-purpose flour, or as needed",
        "Lemon Glaze:",
        "1 1/2 cups confectioners' sugar (optional)",
        "3 tablespoons lemon juice (optional)",
        "1 lemon, zested (optional)"
    ],
    "nut": [
        "Calories > 151 kcal",
        "Carbs > 14.3 g",
        "Cholesterol > 23 mg",
        "Fat > 8.7 g",
        "Protein > 3.9 g",
        "Sodium > 135 mg"
    ],
    "n": "Cottage Cheese Puff Pastry",
    "a": "WestCoastMom",
    "r": "0",
    "s": 48,
    "des": "\"This is an easy cheater puff pastry recipe from my mother-in-law. She would always make lemon crescents with these, but you can use it for sweet or savory appetizers, turnovers, strudel, or any recipe requiring puff pastry. This comes together for me very quickly and easily, perfect for someone intimidated by pastry recipes!\"",
    "ins": "Beat cottage cheese and butter in a large bowl with an electric mixer until well combined with most cottage cheese curds intact, scraping down the sides of the bowl a few times.\nStir flour into butter mixture gradually with a wooden spoon just until a soft dough forms that is no longer sticky; turn dough out onto a floured surface. Bring dough together with floured hands; knead 3 to 4 turns.\nRoll dough gently into a fairly thick square, fold in half, and pat to flatten again; fold dough in half again in the opposite direction. Repeat rolling and folding process 2 more times. Roll dough into an 8-inch square; divide into 4 equal portions. Wrap each portion in plastic wrap; refrigerate for 4 hours or up to overnight.\nPreheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nRoll one portion of dough out on a lightly floured surface 1/4-inch thick. Cut dough into 4-inch squares with a sharp knife; cut each square diagonally to make 2 triangles.\nRoll each dough triangle from the long edge toward the triangle point to form crescent shapes; place on prepared baking sheet.\nBake in the preheated oven until golden, about 20 minutes. Remove to cool on a wire rack.\nWhisk confectioners' sugar, lemon juice, and lemon zest together in a bowl until smooth; brush or drizzle lemon glaze over tops of cooled crescents.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "4 h ",
    "i": "2105307.jpg",
    "o": "",
    "st": "allrecipes"
}