{
    "id": 241309,
    "old_rating": "4.86842",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "18 ounces semisweet chocolate, chopped",
        "10 tablespoons unsalted butter",
        "5 large eggs, at room temperature",
        "4 teaspoons white sugar",
        "4 teaspoons all-purpose flour",
        "1 pinch cayenne pepper",
        "1 pinch salt"
    ],
    "nut": [
        "Calories > 333 kcal",
        "Carbs > 26.2 g",
        "Cholesterol > 103 mg",
        "Fat > 25.2 g",
        "Protein > 5.8 g",
        "Sodium > 43 mg"
    ],
    "n": "Chef John's Chocolate Decadence",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"This 'flourless' chocolate cake was all the rage in the 1980s. As I vaguely remember, the decade celebrated decadent overindulgence and this dessert is that and more. By modern standards, this cake is ridiculously rich. In fact, some of you may find it too intense, but most true chocolate fiends will be in heaven. Serve with ice-cold fresh raspberry sauce.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Butter and flour a 9-inch cake pan.\nMelt semisweet chocolate and unsalted butter together in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula, until chocolate and butter are completely melted and combined. Remove from heat.\nBeat eggs and sugar together in a bowl with a whisk or an electric mixer until pale and very thick, 5 to 10 minutes. Sift in flour, cayenne, and salt; whisk to combine.\nPour 1/4 of the egg mixture into chocolate mixture; stir to combine. Pour chocolate mixture into remaining egg mixture and stir until cake batter is combined. Pour batter into prepared cake pan.\nBake in the preheated oven until just barely set, with a jiggle below the surface, 14 to 15 minutes. Cool to room temperature, wrap in aluminum foil, and refrigerate until chilled, at least 1 hour.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "2 h",
    "i": "4515588.jpg",
    "o": "4515588.jpg,4483794.jpg,4477660.jpg,4469339.jpg,2065482.jpg,2063242.jpg",
    "st": "allrecipes"
}