{
    "id": 241446,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups rolled oats",
        "1/2 cup flax seed meal",
        "1/2 cup sliced almonds",
        "1/2 cup unsweetened shredded coconut",
        "1/4 cup chia seeds (optional)",
        "1/2 cup honey",
        "1/4 cup firmly packed brown sugar",
        "2 tablespoons coconut oil",
        "1 teaspoon vanilla extract",
        "1 teaspoon coconut extract",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon salt",
        "5 tablespoons unsweetened cocoa powder"
    ],
    "nut": [
        "Calories > 225 kcal",
        "Carbs > 30.8 g",
        "Cholesterol > 0 mg",
        "Fat > 10.8 g",
        "Protein > 4.6 g",
        "Sodium > 103 mg"
    ],
    "n": "Cocoa-Coconut Granola Bars",
    "a": "Jessica",
    "r": "0",
    "s": 12,
    "des": "\"Crisp, chewy, and chocolate-y granola bars straight from your own oven! Why buy mediocre-tasting packaged ones full of junk and unknown ingredients? These contain my two favorite ingredients, chocolate and coconut. This recipe is easy to customize and swap out for your favorite ingredients.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch square baking dish.\nSpread rolled oats, flax seed meal, sliced almonds, shredded coconut, and chia seeds onto a baking sheet.\nToast oats mixture in preheated oven, stirring every 5 minutes, until lightly toasted, about 15 minutes.\nReduce oven heat to 300 degrees F (150 degrees C).\nCombine honey, brown sugar, coconut oil, vanilla extract, coconut extract, ground cinnamon, and salt together in a saucepan over medium-low heat; cook and stir until the sugar is completely dissolved, about 3 minutes. Stir cocoa powder into the honey mixture until dissolved.\nMix toasted oat mixture and the honey mixture in a large bowl and stir until the dry ingredients are coated; spread into the prepared baking dish and press into an even layer.\nBake in preheated oven until golden brown, 18 to 20 minutes.\nCool bars in pan for 10 minutes, immediately cut into squares, and remove from pan.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4051919.jpg",
    "o": "",
    "st": "allrecipes"
}