{
    "id": 241459,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup cream cheese, softened",
        "1/4 cup shredded Cheddar cheese",
        "2 slices cooked bacon, crumbled",
        "2 green onions, chopped",
        "2 tablespoons pesto sauce",
        "1/4 clove garlic, minced",
        "1 pinch dried parsley",
        "1 pork tenderloin, butterflied and pounded flat",
        "salt and ground black pepper to taste",
        "5 tablespoons butter",
        "1/2 cup white wine",
        "1/2 cube chicken bouillon",
        "1/2 cup heavy whipping cream"
    ],
    "nut": [
        "Calories > 657 kcal",
        "Carbs > 4.7 g",
        "Cholesterol > 210 mg",
        "Fat > 53.8 g",
        "Protein > 31.9 g",
        "Sodium > 739 mg"
    ],
    "n": "Pesto and Cheese Stuffed Pork Tenderloin",
    "a": "Kim Schoonveld Waters",
    "r": "0",
    "s": 3,
    "des": "\"Pork tenderloin is rolled around a pesto, Cheddar cheese, and cream cheese filling. It is browned then baked for a flavorful main dish. Cream sauce is added before serving. Delicious.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking dish.\nMix cream cheese, Cheddar cheese, bacon, green onions, pesto sauce, garlic, and parsley together in a bowl. Lay pork tenderloin on a flat work surface and spread cheese mixture on one side of the meat. Roll tenderloin around the filling like a jellyroll. Season meat with salt and black pepper.\nMelt butter in a large skillet over medium-high heat. Place rolled pork tenderloin in hot butter and cook, turning, until browned on all sides, 7 to 10 minutes. Transfer tenderloin to the prepared baking dish, reserving drippings in skillet.\nBake in the preheated oven until pork is no longer pink in the center, about 1 1/2 hours. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\nPlace the skillet with reserved drippings over medium-high heat. Pour in white wine and bouillon, bring to a simmer, reduce heat to low, and add cream; stir until sauce thickens slightly, about 5 minutes. Pour sauce over tenderloin.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "3973573.jpg",
    "o": "",
    "st": "allrecipes"
}