{
    "id": 241455,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons coconut oil",
        "1 yellow onion, finely chopped",
        "3 tablespoons tomato paste",
        "2 cloves garlic, crushed",
        "1 tablespoon gluten-free all purpose baking flour",
        "3 cups vegetable broth",
        "1 (15 ounce) can crushed tomatoes",
        "2 tablespoons chopped fresh basil",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon pure maple syrup",
        "1 bay leaf",
        "1 (13.5 ounce) can coconut milk",
        "sea salt to taste",
        "fresh basil for garnish"
    ],
    "nut": [
        "Calories > 282 kcal",
        "Carbs > 20.1 g",
        "Cholesterol > 0 mg",
        "Fat > 22.7 g",
        "Protein > 4.7 g",
        "Sodium > 541 mg"
    ],
    "n": "Classic Dairy-Free Cream of Tomato and Basil Soup",
    "a": "Only Gluten Free Recipes",
    "r": "0",
    "s": 5,
    "des": "\"This is a deliciously creamy tomato soup with the essence of basil. Using coconut milk instead of cream creates a rich in flavor and tasty dairy-free, gluten-free soup.\"",
    "ins": "Heat coconut oil in a pot over medium-high heat. Saute onion in hot coconut oil until softened, about 5 minutes. Stir tomato paste and garlic with the onion; cook and stir until the garlic is fragrant, about 2 minutes more.\nSprinkle flour over the onion mixture and stir to incorporate; add vegetable broth, crushed tomatoes, chopped basil, lemon juice, maple syrup, and bay leaf. Bring the broth to a boil, reduce heat to medium-low, and cook at a simmer until the tomatoes are completely softened, about 20 minutes.\nTurn heat below pot off. Remove and discard bay leaf. Pour soup into a blender. Hold lid in place and pulse blender a few times to get mixture moving before leaving on to blend into a puree; pour pureed soup into the pot and place over medium-low heat.\nStir coconut milk into pureed soup until the color is consistent; heat until the soup is warmed. Season soup with sea salt and garnish with fresh basil sprigs.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "4219190.jpg",
    "o": "",
    "st": "allrecipes"
}