{
    "id": 241454,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup scalded milk",
        "4 1/2 tablespoons shortening",
        "1/4 cup sugar",
        "2 1/4 teaspoons salt",
        "3/4 cup warm water",
        "1 (.25 ounce) package active dry yeast",
        "4 1/2 cups all-purpose flour, divided",
        "1 teaspoon melted shortening, or as needed"
    ],
    "nut": [
        "Calories > 121 kcal",
        "Carbs > 20.4 g",
        "Cholesterol > < 1 mg",
        "Fat > 3 g",
        "Protein > 2.8 g",
        "Sodium > 222 mg"
    ],
    "n": "Alice's Turkey Day Light Rolls",
    "a": "Jeff",
    "r": "0",
    "s": 24,
    "des": "\"I'm sure these rolls were the reason for the original Thanksgiving! Mom stopped making them years ago and I wondered why until I got the recipe. Plan ahead, they're worth the effort. Enjoy.\"",
    "ins": "Stir milk, 4 1/2 tablespoons shortening, sugar, and salt together in a bowl. Cool until mixture is lukewarm.\nPour water into a bowl and sprinkle yeast over the top. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes; stir. Stir milk mixture into yeast mixture until smooth.\nBeat 2 1/4 cups flour into yeast mixture until smooth. Gradually stir in remaining flour until dough comes together.\nTurn dough out onto a lightly floured work surface and knead until dough is smooth and elastic, about 8 minutes. Place dough in an oiled bowl, brush with melted shortening, cover the bowl with a clean towel, and set in a warm place to rise until doubled in volume, about 2 hours.\nPunch dough down and form into 24 rolls. Place rolls on a lightly greased baking dish, cover with a towel, and let rise until doubled in volume, about 40 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in the preheated oven until golden brown, 12 to 15 minutes.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "3 h ",
    "i": "3416263.jpg",
    "o": "",
    "st": "allrecipes"
}