{
    "id": 241480,
    "old_rating": "4.64",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "2 pounds lamb shoulder chops, or more to taste",
        "salt and ground black pepper to taste",
        "1 small yellow onion, sliced",
        "4 cloves garlic, minced",
        "2 tablespoons chopped fresh rosemary",
        "1 cup beef broth",
        "1 cup red wine",
        "2 tablespoons cornstarch",
        "1/2 cup water",
        "1 tablespoon Worcestershire sauce"
    ],
    "nut": [
        "Calories > 360 kcal",
        "Carbs > 5.9 g",
        "Cholesterol > 90 mg",
        "Fat > 23.1 g",
        "Protein > 23.3 g",
        "Sodium > 258 mg"
    ],
    "n": "Braised Lamb Shoulder Chops",
    "a": "kalphen",
    "r": "0",
    "s": 6,
    "des": "\"Lamb shoulder chops are one of the most inexpensive cuts of lamb, and slow-cooking them is the best way to get that nice lamb flavor. The meat falls right off the bone with this recipe.\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C).\nHeat olive oil in a skillet over medium-high heat. Season lamb chops with salt and pepper. Sear lamb in hot oil until browned, 1 to 2 minutes per side. Remove chops to a plate to drain, reserving drippings in the skillet.\nSaute onion and garlic in reserved drippings until tender, about 5 minutes.\nTransfer drained lamb chops to a baking dish; add onion mixture. Sprinkle rosemary over the chops. Pour beef broth and red wine into the baking dish. Cover dish with aluminum foil.\nBake in preheated oven for 3 hours.\nRemove lamb to a serving platter. Carefully drain liquid from baking dish into a saucepan and place over medium heat. Beat cornstarch and water together in a bowl using a whisk to assure no lumps remain; stir into the liquid in the saucepan. Add Worcestershire sauce and cook until the liquid thickens into a gravy, about 5 minutes.",
    "pt": "20 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "4540677.jpg",
    "o": "4540676.jpg,4540004.jpg,4487910.jpg,4210280.jpg,4174993.jpg,4054157.jpg",
    "st": "allrecipes"
}