{
    "id": 241470,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Chive Butter:",
        "1/4 cup butter, softened",
        "3 tablespoons chopped fresh chives",
        "1/4 teaspoon cayenne pepper",
        "Cheddar Biscuits:",
        "2 cups flour",
        "2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "6 tablespoons cold butter",
        "1 1/4 cups shredded extra-sharp Cheddar cheese",
        "1/4 cup grated Parmesan cheese",
        "1 cup buttermilk",
        "1 egg, lightly beaten"
    ],
    "nut": [
        "Calories > 228 kcal",
        "Carbs > 17.7 g",
        "Cholesterol > 56 mg",
        "Fat > 14.6 g",
        "Protein > 7 g",
        "Sodium > 378 mg"
    ],
    "n": "Cheddar Biscuits with Chive Butter",
    "a": "RuthE",
    "r": "0",
    "s": 12,
    "des": "\"Chives are the first herb to come up in the spring, and their delicate flavor pairs well with these biscuits. A little bit of Parmesan cheese makes the flavor of Cheddar cheese really pop; try it next time you make mac and cheese!\"",
    "ins": "Beat softened butter, chives, and cayenne pepper together in a bowl until well-combined and smooth.\nPreheat oven to 450 degrees F (230 degrees C).\nStir flour, baking powder, baking soda, and salt together in a bowl. Cut cold butter into flour mixture with a pastry blender or two knives until mixture resembles oatmeal. Add Cheddar cheese and Parmesan cheese; toss to coat. Stir buttermilk into flour mixture until dough is just-moistened.\nTurn dough out onto a floured work surface and gently knead until dough comes together, about 6 to 8 times. Roll dough into a 9-inch square (1/2 inch thick) with a floured rolling pin. Cut dough lengthwise into 4 strips and crosswise into 6 strips. Place biscuits on a baking sheet and brush tops with beaten egg.\nBake biscuits in the preheated oven until golden, about 15 minutes. Transfer to a rack and cool until warm, at least 15 minutes. Serve with chive butter.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "2258386.jpg",
    "o": "",
    "st": "allrecipes"
}