{
    "id": 241499,
    "old_rating": "4.86667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound dry red kidney beans",
        "1 tablespoon vegetable oil",
        "12 ounces andouille sausage, diced",
        "1 cup finely diced onion",
        "3/4 cup chopped celery",
        "3/4 cup poblano peppers",
        "4 cloves garlic, minced",
        "2 quarts chicken broth, or more as needed",
        "1 smoked ham hock",
        "2 bay leaves",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon dried thyme",
        "1/2 teaspoon cayenne pepper, or to taste",
        "hot sauce to taste",
        "4 cups cooked white rice",
        "2 tablespoons chopped green onion, or to taste"
    ],
    "nut": [
        "Calories > 542 kcal",
        "Carbs > 62.9 g",
        "Cholesterol > 46 mg",
        "Fat > 20.5 g",
        "Protein > 25.9 g",
        "Sodium > 1384 mg"
    ],
    "n": "Chef John's Red Beans and Rice",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"Any time someone asks the question, 'What exactly is soul food?' the answer should always be 'a comforting bowl of red beans and rice.' Just sit them down, give them a spoon, and when they finish, ask them if they understand. They will.\"",
    "ins": "Place beans in a large container and cover with several inches of cool water; let stand 8 hours to overnight. Drain and rinse.\nHeat vegetable oil in a large pot over medium heat. Cook and stir sausage in hot oil until oils slightly release from sausage and edges brown, 5 to 7 minutes. Stir onion, celery, and poblano pepper into sausage; cook and stir until vegetables soften and start to turn translucent, 5 to 10 minutes. Stir garlic into sausage mixture; cook and stir until fragrant, about 1 minute.\nStir chicken broth, ham hock, bay leaves, black pepper, thyme, cayenne pepper, and hot sauce into sausage mixture; bring to a boil, reduce heat to low, and simmer gently, stirring occasionally, for 1 1/2 hours. Add salt and continue simmering until beans are soft, meat is tender, and desired consistency is reached, 1 1/2 to 2 hours more. Season with salt.\nSpoon rice into bowls, ladle red beans mixture over rice, and top with green onion.",
    "pt": "30 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}