{
    "id": 241534,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 ReynoldsÂ® Slow Cooker Liner",
        "1 1/2 pounds boneless, skinless chicken thighs (or mix of thighs and breasts)",
        "1 teaspoon salt, divided",
        "1/2 teaspoon crushed black pepper, divided",
        "1 small onion, diced",
        "4 cloves garlic, crushed",
        "1 jalapeno, halved*",
        "3/4 cup orange juice",
        "2 limes, juiced",
        "1 tablespoon soy sauce",
        "2 teaspoons ground cumin",
        "1 small bunch cilantro, stems cut off and leaves coarsely chopped",
        "12 corn tortillas",
        "Serving suggestions: diced red onion, chopped cilantro leaves, fresh lime juice"
    ],
    "nut": [
        "Calories > 324 kcal",
        "Carbs > 31.5 g",
        "Cholesterol > 64 mg",
        "Fat > 13 g",
        "Protein > 21.7 g",
        "Sodium > 620 mg"
    ],
    "n": "Slow Cooker Pulled Chicken Tacos",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 6,
    "des": "\"Tacos always keep the family running home for dinner. Here's a new take on classic pulled chicken tacos, with a hint of sweet orange, tangy lime and savory soy sauce. There's minimal chopping and prep work, so you can get out of the kitchen fast. Use a slow cooker liner in this recipe to make clean-up even easier.\"",
    "ins": "Line a 4-6 quart slow cooker with a Reynolds(R) Slow Cooker Liner.\nTrim any large pieces of fat from chicken thighs.  Season chicken with half the salt and pepper; add to slow cooker.\nAdd onion, garlic, jalapeno, orange juice, lime juice, soy sauce, cumin, and the remaining salt and pepper to slow cooker.  Stir gently with a wooden or silicon spoon to combine.\nCover and cook on high setting for 2 to 3 hours or low-heat setting for 4 to5 hours, until chicken is done.\nCarefully remove lid to allow steam to escape.  Use slotted spoon to transfer chicken to a large bowl or cutting board. Shred into bite-size chunks.  The chicken should easily shred when it is cooked through.\nLadle out some of the juices from the slow cooker, leaving enough to mix with shredded chicken.\nSpoon shredded chicken back into lined slow cooker.  Season to taste with additional salt, pepper, and cumin, if necessary.\nWarm tortillas in oven or on stove top.\nTo serve, top each tortilla with shredded chicken, diced red onion, chopped cilantro, and a squeeze of fresh lime juice.",
    "pt": "10 m",
    "ct": "4 h",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}