{
    "id": 241530,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Reynolds WrapÂ® Aluminum Foil",
        "2/3 cup apple cider",
        "2 tablespoons olive oil",
        "2 tablespoons apple cider vinegar",
        "2 tablespoons coarse-grain Dijon mustard",
        "2 tablespoons honey",
        "2 teaspoons chopped fresh thyme",
        "1/4 teaspoon salt",
        "1 1/2 pounds carrots, peeled and cut into sticks",
        "1 1/2 pounds parsnips, peeled and cut into sticks"
    ],
    "nut": [
        "Calories > 161 kcal",
        "Carbs > 31.2 g",
        "Cholesterol > 0 mg",
        "Fat > 4.1 g",
        "Protein > 2 g",
        "Sodium > 211 mg"
    ],
    "n": "Cider-Roasted Carrots and Parsnips",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 8,
    "des": "\"These two root vegetables blend for a side dish with enough character to hold the spotlight next to grilled or roasted meat, poultry, or fish. The hint of vinegar, Dijon, honey, and thyme will make you forget it's actually good for you. Skip-a-step by lining the vegetable roasting pan with aluminum foil. To line the pan fast, turn pan upside down and press sheet of aluminum foil around it. With aluminum foil, you can use either shiny side up or dull side up. Remove the aluminum foil. Turn over, drop foil inside. Crimp edges and you're ready to cook. After the meal there is no extra cleanup. Just toss the foil.\"",
    "ins": "Preheat the oven to 400 degrees F. Line a roasting pan with Reynolds Wrap(R) Aluminum Foil; set aside. In a very large bowl whisk together the apple cider, oil, vinegar, mustard, honey, thyme, and salt. Add carrots and parsnips and toss to coat. Transfer vegetables and liquid to the prepared roasting pan; spread in an even layer.\nRoast, uncovered, for 35 minutes or until vegetables are tender and liquid has evaporated, stirring twice during roasting. Makes 8 servings.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2115878.jpg",
    "o": "",
    "st": "allrecipes"
}