{
    "id": 241564,
    "old_rating": "4.53333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1/3 pound ground beef",
        "salt and ground black pepper to taste",
        "24 wonton wrappers",
        "1 3/4 cups grated Parmesan cheese",
        "1 3/4 cups shredded mozzarella cheese",
        "3/4 cup ricotta cheese",
        "1 cup pasta sauce (such as Muir GlenÂ®)",
        "1/4 cup chopped fresh basil, or to taste (optional)"
    ],
    "nut": [
        "Calories > 201 kcal",
        "Carbs > 13.9 g",
        "Cholesterol > 35 mg",
        "Fat > 9.5 g",
        "Protein > 14.3 g",
        "Sodium > 497 mg"
    ],
    "n": "Lasagna Cupcakes",
    "a": "Kim Piper",
    "r": "0",
    "s": 12,
    "des": "\"Italian cupcakes.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Prepare muffin cups with cooking spray.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; season with salt and pepper. Drain and discard grease from the beef.\nCut wonton wrappers into 2 1/4-inch circles with a biscuit cutter. Press one wonton into the bottom of each muffin cup. Sprinkle even amounts of Parmesan cheese, mozzarella cheese, and ricotta cheese into each muffin cup; top each portion with even amounts of ground beef and pasta sauce.\nDivide 1/2 cup Parmesan cheese, 1/2 cup mozzarella cheese, half the ricotta cheese, 1/2 the ground beef mixture, and 1/2 cup pasta sauce, between the muffin cups and layer, respectively, atop the wonton wrapper; repeat layering with remaining wonton wrappers, 1/2 cup Parmesan cheese, 1/2 cup mozzarella cheese, remaining ricotta cheese, remaining ground beef, and remaining pasta sauce. Top the 'cupcakes' with remaining Parmesan cheese and mozzarella cheese.\nBake in preheated oven until edges of 'cupcakes' are browned, 18 to 20 minutes; let cook in tins for 5 minutes before running a knife around the edges of the cupcakes to loosen the edges to remove. Garnish with fresh basil to serve.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "4519207.jpg",
    "o": "4519207.jpg,4508167.jpg,4458538.jpg,4458512.jpg,4458509.jpg,4092809.jpg",
    "st": "allrecipes"
}