{
    "id": 241531,
    "old_rating": "4.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups apple or hickory wood chips",
        "1 (2 1/2 pound) boneless pork top loin roast (single loin)",
        "2 tablespoons snipped fresh rosemary",
        "1 tablespoon olive oil",
        "4 cloves garlic, minced",
        "1/2 teaspoon pepper",
        "1/4 teaspoon salt",
        "4 sprigs fresh rosemary",
        "1/2 lemon or lime",
        "Reynolds WrapÂ® Aluminum Foil"
    ],
    "nut": [
        "Calories > 221 kcal",
        "Carbs > 1.5 g",
        "Cholesterol > 67 mg",
        "Fat > 13.2 g",
        "Protein > 23.1 g",
        "Sodium > 114 mg"
    ],
    "n": "Rosemary and Garlic Smoked Pork Roast",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 8,
    "des": "\"Covering meat with aluminum foil after removing from the grill keeps the surface from cooling off too fast while it stands. The standing time helps it retain its juices so the meat won't be dry. You can use the same method to keep hot-from-the-oven rolls or a hot side dish warm for a short time while waiting for the rest of the meal.\"",
    "ins": "At least 1 hour before grilling, soak wood chips in enough water to cover. Drain wood chips after soaking.\nTrim fat from meat. For rub, combine the snipped rosemary, the olive oil, garlic, pepper, and salt. Sprinkle rub evenly over meat; rub in with your fingers. Insert a meat thermometer into the center of meat.\nFor a charcoal grill, arrange medium coals around a drip pan. Pour 1 inch of water into drip pan. Test for medium-low heat above the pan. (Hold your hand, palm side down, in the place where the meat will cook. Count \"one thousand one, one thousand two,\" etc. Being able to keep your hand there for a count of five is equal to medium-low.) Sprinkle half of the wood chips over the coals; sprinkle rosemary sprigs over chips. Place meat on grill rack over drip pan. Cover; grill for 1 to 1-1/4 hours or until meat thermometer registers 155 degrees F. Add remaining wood chips halfway through grilling.\nFor a gas grill, preheat grill. Reduce heat to medium-low. Adjust for indirect cooking; following manufacturer's directions. Grill as above, except place meat on a rack in a roasting pan.\nRemove meat from grill. Squeeze juice from lemon or lime over meat. Cover with Reynolds Wrap(R) Aluminum Foil; let stand for 10 minutes before carving.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2115885.jpg",
    "o": "",
    "st": "allrecipes"
}