{
    "id": 241520,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2/3 cup sweetened flaked coconut",
        "1 (7 ounce) box caramel and toasted coconut cookies (such as Girl Scout SamoasÂ®)",
        "1 (8 ounce) package cream cheese, at room temperature",
        "1/2 cup white sugar",
        "1 tablespoon coconut extract",
        "1/2 teaspoon vanilla extract",
        "1/2 teaspoon amaretto liqueur",
        "1/4 teaspoon almond extract",
        "2 eggs, at room temperature, lightly beaten",
        "1/2 cup sour cream",
        "1 pinch salt",
        "1 cup whipped cream"
    ],
    "nut": [
        "Calories > 244 kcal",
        "Carbs > 22.3 g",
        "Cholesterol > 60 mg",
        "Fat > 16.1 g",
        "Protein > 3.6 g",
        "Sodium > 137 mg"
    ],
    "n": "SamoaÂ® Cheesecake Cupcakes",
    "a": "KyddRobinson",
    "r": "0",
    "s": 12,
    "des": "\"I love all three of these things separately, and I love them even more when they're together!\"",
    "ins": "Heat a skillet over medium heat; cook and stir coconut until fragrant and toasted, about 5 minutes. Remove skillet from heat.\nPreheat oven to 275 degrees F (135 degrees C). Line 12 muffin cups with paper liners. Place 1 cookie into the bottom of each muffin cup.\nBeat cream cheese in a bowl using an electric mixer until  smooth and creamy. Gradually beat sugar, coconut extract, vanilla extract, amaretto liqueur, and almond extract into cream cheese until smooth. Pour eggs into cream cheese mixture, a little at a time, and beat, scraping sides after each addition, until smooth. Beat sour cream and salt into cream cheese mixture; pour into the prepared muffin cups, filling almost to the top.\nBake in the preheated oven for 11 minutes; rotate pan and continue cooking until cheesecake is set, 11 to 14 minutes more. Cool cheesecake in pan for 15 minutes on a wire rack. Transfer cheesecakes to a plate and refrigerate until chilled, at least 4 hours.\nTop each cheesecake with whipped cream and toasted coconut.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "5 h",
    "i": "3840454.jpg",
    "o": "",
    "st": "allrecipes"
}