{
    "id": 241629,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups water",
        "1 cup couscous (such as Rice SelectÂ®)",
        "1 tablespoon olive oil",
        "1 onion, diced",
        "2 cups marinara sauce",
        "1 cup beef broth",
        "1 tablespoon balsamic vinegar",
        "1/4 teaspoon red pepper flakes",
        "1 pound vegan beef crumbles (such as Gimme LeanÂ®)",
        "1 (10 ounce) can diced tomatoes",
        "1/4 cup chopped fresh flat-leaf parsley",
        "4 cloves garlic, minced",
        "1 teaspoon freshly ground black pepper",
        "1 pinch ground cayenne pepper",
        "1 cup finely grated Parmigiano-Reggiano cheese, divided",
        "4 large green bell peppers, halved and seeded"
    ],
    "nut": [
        "Calories > 313 kcal",
        "Carbs > 37.3 g",
        "Cholesterol > 10 mg",
        "Fat > 9.2 g",
        "Protein > 19.7 g",
        "Sodium > 789 mg"
    ],
    "n": "Jodi's Stuffed Peppers",
    "a": "JAH",
    "r": "0",
    "s": 8,
    "des": "\"Stuff green bell peppers with a mixture of couscous, vegetables, and vegan beef for a simple and satisfying supper.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nBring water to a boil in a saucepan; remove from heat and stir couscous into the water. Cover saucepan and let stand until water is absorbed completely, 5 to 10 minutes. Fluff couscous with a fork.\nHeat olive oil in a large skillet over medium heat; cook and stir onion in hot oil until onion starts to soften, about 5 minutes. Transfer 1/2 of the onion to a large bowl.\nPour marinara sauce, beef broth, balsamic vinegar, and red pepper flakes into skillet with remaining onion; cook and stir until heated through, about 1 minute. Pour marinara mixture into a 9x13-inch baking dish.\nStir vegan beef crumbles, diced tomatoes, parsley, garlic, black pepper, and cayenne pepper into onions in the large bowl until well-mixed. Add couscous and 3/4 of the Parmigiano-Reggiano cheese and stir until filling is well-combined. Stuff each pepper half with couscous mixture and place stuffed peppers in marinara sauce in the baking dish. Sprinkle remaining Parmigiano-Reggiano cheese over peppers and cover the baking dish with aluminum foil.\nBake in the preheated oven for 45 minutes. Remove aluminum foil and continue baking until peppers are tender and cheese is browned, 20 to 25 minutes more.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}