{
    "id": 241697,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound dried chickpeas (garbanzo beans)",
        "4 cups water",
        "3/4 pound ham hocks",
        "1 bay leaf",
        "1/2 teaspoon oregano",
        "1 pound Italian sausage links, cut into chunks",
        "1 large onion, chopped",
        "1 green bell pepper, chopped",
        "1 clove garlic, crushed",
        "1/2 teaspoon Worcestershire sauce",
        "1/2 teaspoon salt",
        "1 dash ground black pepper"
    ],
    "nut": [
        "Calories > 702 kcal",
        "Carbs > 50.1 g",
        "Cholesterol > 96 mg",
        "Fat > 40.3 g",
        "Protein > 35.6 g",
        "Sodium > 807 mg"
    ],
    "n": "Chickpea Pot",
    "a": "Recipe Revival",
    "r": "0",
    "s": 6,
    "des": "\"Warm up during the cold months with this hearty chick-pea and ham dish. This recipe was found in an old recipe box and was typed word-for-word.\"",
    "ins": "Put chickpeas and water in a large pot; soak beans 8 hours to overnight. Or, bring the beans and water to a boil in a large pot over high heat. Once boiling, turn off the heat, cover, and let stand 1 hour.\nAdd ham hocks, oregano, and bay lead to the water and chickpeas; bring to a boil, place a lid on the pot, reduce heat to medium-low, and cook at a simmer until the chickpeas are tender, about 2 hours. Remove and discard bay leaf.\nHeat a skillet over medium-high heat. Saute sausage chunks in hot skillet until some of the fat renders, 2 to 3 minutes; add onion, bell pepper, and garlic and saute until lightly browned, about 5 minutes. Add sausage mixture to the mixture in the pot along with Worcestershire sauce, salt, and pepper.\nBring the mixture to a simmer, cover the pot, and cook until the sausage chunks are no longer pink in the center, about 20 minutes.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "10 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}