{
    "id": 241600,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (49.5 fluid ounce) can low fat, low sodium chicken broth",
        "5 pounds russet potatoes, peeled and cut into cubes",
        "4 carrots, peeled and diced",
        "4 stalks celery, diced",
        "1 small onion, diced",
        "1 cup broccoli florets",
        "1 (10 ounce) can fat-free cream of celery soup",
        "1 (10 ounce) can fat-free cream of chicken soup",
        "8 ounces Monterey Jack cheese, shredded",
        "8 ounces pepperjack cheese, shredded",
        "1 teaspoon ground black pepper",
        "1 teaspoon parsley flakes",
        "1 (14.5 ounce) can fat-free reduced-sodium chicken broth, or to taste"
    ],
    "nut": [
        "Calories > 348 kcal",
        "Carbs > 43.1 g",
        "Cholesterol > 39 mg",
        "Fat > 13.2 g",
        "Protein > 15.2 g",
        "Sodium > 683 mg"
    ],
    "n": "Ang's Creamy Potato Soup",
    "a": "AlabamaAng",
    "r": "0",
    "s": 12,
    "des": "\"This is a creamy, cheesy soup that I created several years ago. It makes for a hearty main dish and is also the perfect side to a roast or ham. Although I normally try to stay away from the canned cream soups, I think they fit well in this dish. Of course, it's not the healthiest of recipes, but don't we all need to splurge every now and then?\"",
    "ins": "Pour 49.5 ounce can chicken broth into a 5-quart pot; add potatoes, carrots, celery, and onions; bring to boil, reduce heat to medium-low, and cook, stirring occasionally, and cook until the potatoes are completely tender, 20 to 25 minutes.\nGently mash potatoes into the soup to thicken to your desired texture.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil; add broccoli, cover, and steam until tender, 2 to 6 minutes.\nStir broccoli, celery soup, chicken soup, Monterey Jack cheese, pepperjack cheese, pepper, and parsley into the soup; add 14.5 ounce can chicken broth. Cook and stir until the cheese is melted, about 5 minutes.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "4542659.jpg",
    "o": "",
    "st": "allrecipes"
}