{
    "id": 241761,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 tablespoons olive oil, or more as needed",
        "15 small fresh jalapeno peppers, diced",
        "4 ears fresh corn, kernels cut from cob",
        "3 plum tomatoes, diced",
        "1 red onion, diced",
        "1 yellow bell pepper, diced",
        "5 Scotch bonnet chile peppers, diced",
        "1/2 cup shredded carrots",
        "5 cloves garlic, diced",
        "3 cups cider vinegar, or more as needed"
    ],
    "nut": [
        "Calories > 45 kcal",
        "Carbs > 5.6 g",
        "Cholesterol > 0 mg",
        "Fat > 2 g",
        "Protein > 0.9 g",
        "Sodium > 7 mg"
    ],
    "n": "Sweet Heat: Mark I",
    "a": "Brian Waltz - WL Events",
    "r": "0",
    "s": 24,
    "des": "\"This sauce will surprise you with a sweet initial flavor followed by rising heat, and is excellent for grilled wings, as a dip, or as a marinade.\"",
    "ins": "Heat oil in a large Dutch oven over medium heat. Cook and stir jalapeno peppers, corn, tomatoes, red onion, yellow bell pepper, Scotch bonnet peppers, carrots, and garlic in hot oil until onion is translucent, 10 to 20 minutes.\nPour enough cider vinegar into Dutch oven to cover vegetables by 1/2-inch. Bring to a boil, reduce heat to medium, and cook at a low boil until liquid is reduced to just covering the vegetables, about 20 minutes. Reduce heat to medium-low and simmer until liquid is slightly more reduced, about 20 minutes more. Pour mixture through a strainer to separate vegetables from liquid; reserve liquid.\nPour 1 cup of vegetables into a blender. Cover and hold lid down; pulse a few times before leaving on to blend. Add another cup of vegetables and continue pureeing until smooth. Repeat with remaining vegetables. Add reserved liquid and blend until desired sauce consistency is reached.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "2283959.jpg",
    "o": "",
    "st": "allrecipes"
}