{
    "id": 241738,
    "old_rating": "4.58333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 1/4 cups all-purpose flour",
        "1/2 cup whole wheat flour",
        "1/4 cup rolled oats",
        "1 1/4 teaspoons baking soda",
        "1 teaspoon baking powder",
        "1 1/2 teaspoons salt",
        "1/4 cup cold unsalted butter, cut into small cubes",
        "1 3/4 cups buttermilk",
        "1 large egg",
        "2 tablespoons honey, or more to taste",
        "2 teaspoons grated orange zest",
        "1 cup dried currants",
        "1/3 cup golden raisins"
    ],
    "nut": [
        "Calories > 195 kcal",
        "Carbs > 36 g",
        "Cholesterol > 20 mg",
        "Fat > 3.9 g",
        "Protein > 5.1 g",
        "Sodium > 382 mg"
    ],
    "n": "Chef John's Irish Soda Bread",
    "a": "Chef John",
    "r": "0",
    "s": 16,
    "des": "\"St. Patrick's Day is right around the corner, and what better way to celebrate than with a loaf or two of Irish soda bread? If made correctly, this is one of the best quick breads (those leavened without yeast) you'll ever have. Subtly sweet, with a light, tender crumb, and not at all dry. You can use quick-cooking oats in place of rolled oats, if desired.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper or silicone baking mat.\nWhisk all-purpose flour, whole wheat flour, oats, baking soda, baking powder, and salt together in a bowl. Cut butter into flour mixture using a pastry blender until mixture resembles coarse meal.\nBeat buttermilk, egg, honey, and orange zest together in a bowl. Pour buttermilk mixture, currants, and raisins into flour mixture; stir with a wooden spoon until a wet, sticky dough comes together.\nTurn dough out onto a well-floured work surface; press dough together into a soft ball of dough and cut into 2 pieces. Form each half into a smooth, round loaf. Transfer to prepared baking sheet and let rest for 15 minutes. Cut a 1/2-inch deep \"X\" into the top of each loaf with a serrated knife.\nBake in the preheated oven until golden brown and fragrant, about 45 minutes. Transfer loaves to a wire rack to cool completely before slicing.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4502664.jpg",
    "o": "4502664.jpg,4487313.jpg,4486624.jpg,4486610.jpg,4486340.jpg,4486333.jpg",
    "st": "allrecipes"
}