{
    "id": 241796,
    "old_rating": "4.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Meatloaf:",
        "2 tablespoons butter",
        "2 slices bacon, chopped",
        "1/2 yellow onion, chopped",
        "1 carrot, cubed",
        "1 red bell pepper, chopped",
        "1 fresh poblano pepper, chopped (optional)",
        "4 button mushrooms, chopped",
        "3 cloves garlic",
        "1/4 teaspoon dried rosemary",
        "2 cups fresh bread crumbs",
        "1/4 cup milk",
        "1 large egg",
        "2 teaspoons kosher salt, or to taste",
        "1 teaspoon Worcestershire sauce",
        "1 teaspoon freshly ground black pepper",
        "1 pinch cayenne pepper",
        "2 pounds ground buffalo",
        "7 slices thick-cut bacon, or more as needed",
        "Glaze:",
        "2 tablespoons rice vinegar (optional)",
        "2 tablespoons brown sugar (optional)",
        "1 tablespoon Dijon mustard (optional)"
    ],
    "nut": [
        "Calories > 348 kcal",
        "Carbs > 19.3 g",
        "Cholesterol > 135 mg",
        "Fat > 13.6 g",
        "Protein > 35.8 g",
        "Sodium > 1239 mg"
    ],
    "n": "Bacon-Wrapped Buffalo Meatloaf",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"Most people who replace their ground beef with buffalo, in recipes like meatballs, burgers, and meatloaf, are usually disappointed. Ground buffalo is much leaner than ground beef, which is the biggest challenge. In case you're new, it's the fat that provides most of the flavor and moisture. Also, for whatever reason, pre-packaged buffalo is ground very fine, almost to a paste, which can lead to a rubbery meatloaf, unless you use a few tricks.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch baking dish.\nMelt butter in a large skillet over medium-heat. Cook and stir chopped bacon in hot butter until almost crisp, 5 to 10 minutes.\nPulse onion, carrot, celery, red bell pepper, poblano pepper, mushrooms, and garlic in a food processor until finely chopped. Add vegetable mixture and rosemary to bacon in the skillet; cook and stir until vegetables soften and sweeten, about 5 minutes.\nMix vegetable mixture, bread crumbs, and milk together in a bowl. Let cool to room temperature. Stir egg, salt, Worcestershire sauce, black pepper, and cayenne pepper into vegetable mixture. Add buffalo meat to vegetable mixture and mix with your hands until well-blended.\nTurn meat mixture out into prepared baking dish and shape into a 9x5x3-inch meatloaf. Lay bacon strips crosswise over the top of the meatloaf, tucking in ends of bacon under the loaf.\nWhisk rice vinegar, brown sugar, and mustard together in a bowl until glaze is smooth.\nBake meatloaf in the preheated oven for 30 minutes. Brush glaze over loaf and continue baking until no longer pink in the center, about 30 minutes more. An instant-read thermometer inserted into the center should read at least 155 degrees F (68 degrees C). Cool for 10 minutes before slicing.",
    "pt": "40 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}