{
    "id": 241742,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray (such as PamÂ®)",
        "1 (18.25 ounce) package strawberry cake mix",
        "1 cup water",
        "1/3 cup vegetable oil",
        "3 cups eggs",
        "1 (14 ounce) can sweetened condensed milk",
        "1 (12 fluid ounce) can evaporated milk",
        "4 eggs",
        "1 teaspoon vanilla extract",
        "2 (3 ounce) packages strawberry-flavored gelatin (such as Jell-OÂ®)",
        "2 cups boiling water",
        "1 cup cold water"
    ],
    "nut": [
        "Calories > 638 kcal",
        "Carbs > 82 g",
        "Cholesterol > 370 mg",
        "Fat > 26.4 g",
        "Protein > 20.1 g",
        "Sodium > 612 mg"
    ],
    "n": "Ruby's Strawberry Jell-OÂ® Flan Cake",
    "a": "Ruby Atallah- Hamdallah",
    "r": "0",
    "s": 10,
    "des": "\"This cake recipe was created by me; I wanted to try something unique, something that is different than any cakes that I have made before. This 3 layer cake is creamy and so moist! The result was amazing! My friends and family loved it!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a fluted cake pan (such as Bundt(R)) with cooking spray.\nBeat cake mix, 1 cup water, vegetable oil, and 3 eggs together in a bowl with an electric mixer on low speed for 30 seconds. Increase speed to medium and beat until batter is smooth, about 2 minutes.\nBeat condensed milk, evaporated milk, 4 eggs, and vanilla extract together in another bowl until flan mixture is smooth, about 3 minutes. Pour into prepared cake pan. Pour 3/4 of the strawberry cake batter on top of the flan mixture. Set cake pan in a roasting pan. Pour water into the roasting pan to read halfway up the sides of the cake pan.\nBake in the preheated oven until a knife inserted into the center of the cake comes out clean, 45 to 55 minutes. Cool to room temperature, about 30 minutes. Refrigerate until chilled, at least 6 hours.\nPlace a plate on top of the cake pan and invert to loosen cake. Flip cake pan and plate back to return cake to the pan.\nCombine boiling water and gelatin in a bowl; stir until gelatin is dissolved. Pour 1 cup cold water into gelatin mixture. Let cool until gelatin mixture is warm to the touch. Pour gelatin mixture into the cake pan along the sides so that the gelatin runs under the cake and cake begins to float. Refrigerate until set; at least 5 hours.\nRemove cake from refrigerator and place pan in hot water to loosen from the sides of the cake pan. Invert onto a serving plate.",
    "pt": "45 m",
    "ct": "45 m",
    "tt": "13 h",
    "i": "2353877.jpg",
    "o": "",
    "st": "allrecipes"
}