{
    "id": 241705,
    "old_rating": "4.62791",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup dry garbanzo beans",
        "1/2 yellow onion, diced",
        "1/2 cup chopped fresh flat-leaf parsley",
        "4 cloves minced garlic",
        "1 tablespoon all-purpose flour, or more as needed",
        "2 teaspoons lemon juice",
        "1 1/2 teaspoons salt, or to taste",
        "1 teaspoon ground cumin",
        "1/2 teaspoon ground coriander",
        "1/4 teaspoon baking soda",
        "1/8 teaspoon cayenne pepper",
        "oil for frying"
    ],
    "nut": [
        "Calories > 271 kcal",
        "Carbs > 24.4 g",
        "Cholesterol > 0 mg",
        "Fat > 16.9 g",
        "Protein > 7.1 g",
        "Sodium > 646 mg"
    ],
    "n": "Chef John's Falafel",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"Unlike most of America's other favorite fast foods, falafel is rarely attempted at home, which is a shame, since it's very simple to do, and even a relative novice like me can get some very decent results. One word of warning: you do need to know you're going to have a craving for this a full day before you actually want to eat it.\"",
    "ins": "Place garbanzo beans into a large container and cover with several inches of cool water; let stand 12 to 24 hours. Drain.\nBlend garbanzo beans, onion, parsley, garlic, flour, lemon juice, salt, cumin, coriander, baking soda, and cayenne pepper together in a food processor, scraping down the sides of the bowl as necessary, until mixture is finely ground and holds together when pressed. Transfer garbanzo mixture to a bowl, cover with plastic wrap, and refrigerate until flavors blend, 1 to 2 hours.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nDivide dough into 12 portions and roll each with moistened hands into a ball.\nWorking in batches, cook falafel balls in hot oil until browned and crispy, about 5 minutes. Transfer to a wire rack to drain.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "12 h ",
    "i": "4509713.jpg",
    "o": "4509713.jpg,3960205.jpg,3771121.jpg,3645809.jpg,3337939.jpg,2930436.jpg",
    "st": "allrecipes"
}