{
    "id": 241841,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2/3 cup beer",
        "1/2 cup masa flour",
        "1 egg",
        "2 tablespoons white sugar (optional)",
        "1 1/2 teaspoons baking powder",
        "1 1/2 cups sweetened corn-based cereal (such as Cap'N CrunchÂ®), crushed",
        "1/2 cup cornmeal",
        "24 shrimp",
        "3 cups oil for frying",
        "Dipping Sauce:",
        "1/2 cup marmalade",
        "2 tablespoons deli-style Dijon mustard"
    ],
    "nut": [
        "Calories > 329 kcal",
        "Carbs > 45.9 g",
        "Cholesterol > 67 mg",
        "Fat > 13 g",
        "Protein > 7.2 g",
        "Sodium > 364 mg"
    ],
    "n": "Captain Crunch and Cornmeal Shrimp",
    "a": "Marie Medek Brenden",
    "r": "0",
    "s": 6,
    "des": "\"Tried to make coconut shrimp only to find out I had no coconut. This quickly thrown together hodgepodge of three recipes turned out to be a winner. Super sweet by itself, but even better with the marmalade dipping sauce. My 2- and 6-year-old were big fans, too!\"",
    "ins": "Line a baking sheet with waxed paper.\nWhisk beer, masa flour, egg, sugar, and baking powder together in a bowl until beer batter is smooth. Place crushed cereal in a shallow bowl and cornmeal in a third shallow bowl.\nDredge shrimp through cornmeal, holding shrimp by the tail; shake off excess cornmeal. Dip shrimp in beer batter, allowing excess to drip back into batter. Roll shrimp in the crushed cereal until evenly coated. Arrange coated shrimp on the prepared baking sheet and freeze for 15 minutes.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nWorking in batches, fry shrimp in the hot oil, turning once, until golden brown, 2 to 3 minutes. Transfer cooked shrimp to a paper towel-lined plate using tongs.\nStir marmalade and mustard together in a bowl until sauce is smooth. Serve cooked shrimp alongside dipping sauce.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}