{
    "id": 241898,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 pounds veal bones (joint and marrow bones)",
        "1 tablespoon vegetable oil",
        "3 onions, cut into eighths",
        "4 carrots, cut into 2-inch pieces",
        "4 ribs celery, cut into 2-inch pieces",
        "1 (6 ounce) can tomato paste",
        "10 quarts cold water",
        "2 cups cold water"
    ],
    "nut": [
        "Calories > 19 kcal",
        "Carbs > 3.6 g",
        "Cholesterol > 0 mg",
        "Fat > 0.5 g",
        "Protein > 0.5 g",
        "Sodium > 58 mg"
    ],
    "n": "Demi-Glace",
    "a": "Chef John",
    "r": "0",
    "s": 36,
    "des": "\"This is my technique for veal demi-glace, and there's not much to it. I'm going for a pure veal stock reduction, fortified with nothing more than mirepoix and tomato. I don't do the classic roux-based espagnole sauce, which is traditionally mixed with veal stock and reduced by half.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C). Place veal bones in a roasting pan.\nRoast bones in the preheated oven until well-browned, about 75 minutes.\nWhile bones are roasting, drizzle oil onto a baking sheet. Spread onion, carrots, and celery onto baking sheet; spread tomato paste over the vegetables and mix to coat.\nRoast vegetable mixture in the preheated oven until vegetables are well-browned, about 45 minutes.\nTransfer vegetable mixture and bones to a large stockpot. Pour 10 quarts water into stockpot.\nPour 2 cups water into the bones roasting pan, set the pan over high heat, and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Pour liquid into the stockpot with the bones.\nBring bones, vegetables, and water in the stockpot to a boil, reduce heat to low, and simmer gently, skimming foam as necessary, until meat and all connective tissue is completely off the bones, about 18 hours.\nSet a colander over a bowl and ladle vegetables, bones, and meat into colander. Discard vegetables, bones, and meat; return any broth to the stockpot.\nBring broth to a boil; cook at a boil until liquid reduces to approximately 1 gallon in volume, 30 minutes to 1 hour.\nStrain broth through a fine-mesh strainer into a large container set in an ice bath; chill to room temperature. Cover the container with a lid or plastic wrap and chill in the refrigerator until demi-glace is cold and set, 8 hours to overnight.\nScrape and discard any fat from the surface of set demi-glace. Turn demi-glace out onto a work surface. Cut into 16 blocks, wrap each block in plastic wrap, and place wrapped blocks in a resealable plastic bag. Store in the freezer.",
    "pt": "30 m",
    "ct": "19 h ",
    "tt": "1 d ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}