{
    "id": 241844,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 3/8 cups all-purpose flour",
        "2 cups white sugar",
        "5 tablespoons anise seed",
        "1/2 cup warm water",
        "2 (.25 ounce) packages active dry yeast",
        "2 cups warm milk",
        "8 eggs, at room temperature",
        "1/2 cup butter, melted"
    ],
    "nut": [
        "Calories > 448 kcal",
        "Carbs > 81.4 g",
        "Cholesterol > 89 mg",
        "Fat > 8.1 g",
        "Protein > 11.9 g",
        "Sodium > 73 mg"
    ],
    "n": "Italian Anise Bread",
    "a": "Lindsey322",
    "r": "0",
    "s": 20,
    "des": "\"My family has been making this Easter bread for generations. It's origins are in a family bakery owned by my great-great aunts off the boat from Italy. My mom and I are the only remaining individuals who know how to make this, so I'm posting it hoping to share it with others. It is made the old world way, so it is not quick, but it is delicious and well worth the work and wait.\"",
    "ins": "Combine flour, sugar, and anise seed together in a very large bowl; create a well in the center.\nMix warm water and yeast together in a bowl. Let stand until the yeast softens and begins to form a creamy foam, about 10 minutes.\nBeat warm milk, eggs, and butter together in a bowl; stir into yeast mixture. Add milk mixture to the well in the flour mixture. Knead flour-milk mixture using your hands until dough and your hands are no longer sticky. Cover dough with a clean cotton cloth and let rise, 8 hours to overnight.\nGrease and flour 6 loaf pans.\nPunch dough down and divide into 6 portions. Mold each portion into a round shape and place each in a prepared pan. Cover pans and let rise for 1 hour more.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in the preheated oven until bread is cooked through, 45 to 50 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "10 h",
    "i": "2211431.jpg",
    "o": "",
    "st": "allrecipes"
}