{
    "id": 241805,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package extra-firm tofu, sliced 1/2 inch thick",
        "cooking spray",
        "1/2 cup teriyaki sauce",
        "1 tablespoon sesame seeds",
        "1 clove garlic, minced",
        "1 teaspoon hot sauce",
        "1/2 teaspoon white sugar",
        "1 small head romaine lettuce, or to taste, torn",
        "3 strawberries, or more to taste, sliced",
        "1/4 cup raspberry vinaigrette dressing"
    ],
    "nut": [
        "Calories > 173 kcal",
        "Carbs > 17.7 g",
        "Cholesterol > 0 mg",
        "Fat > 6.9 g",
        "Protein > 12.8 g",
        "Sodium > 1636 mg"
    ],
    "n": "Baked Tofu Bites on a Bed of Leafy Romaine",
    "a": "pattyjean",
    "r": "0",
    "s": 4,
    "des": "\"A simplified baked tofu-bite recipe served on a bed of leafy romaine, spritzed with raspberry vinaigrette, and garnished with fresh sliced strawberries.\"",
    "ins": "Lay tofu slices onto several layers of paper towel; top with more paper towel. Place something heavy onto the tofu to squeeze excess water from the tofu; let sit until the tofu is drained, 20 to 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Prepare a baking sheet with cooking spray.\nStir teriyaki sauce, sesame seeds, garlic, hot sauce, and sugar together in a bowl. Cut pressed tofu into 1/2-inch cubes and add to teriyaki sauce mixture; stir gently to coat. Cover bowl with plastic wrap and marinate 5 to 10 minutes.\nSpread tofu onto prepared baking sheet and bake in preheated oven for 15 minutes, flip, and continue baking until golden brown, about 15 minutes more.\nPrepare a bed of romaine lettuce on a salad platter. Arrange strawberry slices around the edge of the lettuce bed. Spritz or drizzle raspberry vinaigrette over the lettuce. Pile warm baked tofu onto the lettuce.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "2324242.jpg",
    "o": "",
    "st": "allrecipes"
}