{
    "id": 241891,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups white sugar",
        "1 cup butter, softened",
        "3 eggs",
        "1 1/2 cups sour cream",
        "1 1/2 teaspoons vanilla extract",
        "5 cups all-purpose flour, or more as needed",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda"
    ],
    "nut": [
        "Calories > 178 kcal",
        "Carbs > 24.9 g",
        "Cholesterol > 33 mg",
        "Fat > 7.7 g",
        "Protein > 2.7 g",
        "Sodium > 96 mg"
    ],
    "n": "LofthouseÂ® Sugar Cookie Rip-Off",
    "a": "COOKIELOVER2",
    "r": "0",
    "s": 36,
    "des": "\"This recipe is similar to the sugar cookies purchased at bakeries.  Roll them no more than 1/4 inch for true lofthouse, thicker if you like a more cake-like cookie. These do not brown on the edges, but when cooled, you will notice the light golden brown underneath. This is a delicate flavor cookie, not sugary sweet. The sweetness will come from the icing that you choose to use; confectioners' sugar mixed with milk is your best bet.\"",
    "ins": "Beat sugar and butter together with an electric mixer in a large bowl until smooth. Add eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat sour cream and vanilla extract with the last egg.\nMix 5 cups flour, baking soda, and baking powder together in a separate bowl; beat with the creamy mixture until just incorporated into a dough. Cover the bowl with plastic wrap and refrigerate 8 hours to overnight.\nPreheat oven to 425 degrees F (220 degrees C). Line baking sheets with parchment paper.\nTurn dough out onto a floured sheet of waxed paper on a flat work surface. Sprinkle flour on top of dough and put another sheet of waxed paper atop the dough. Roll dough out to 1/4- to 3/8-inch thick, using additional flour to keep dough from sticking and to get the best consistency for rolling. Cut rolled dough with cookie cutters into desired shapes and arrange onto prepared baking sheets.\nBake in preheated oven until set along the edges, about 8 minutes. Cool cookies on baking sheet for 10 minutes before moving to a wire rack to cool completely.",
    "pt": "15 m",
    "ct": "8 m",
    "tt": "8 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}