{
    "id": 241845,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 cups parboiled long-grain white rice",
        "1/2 cup butter, divided",
        "1/4 cup olive oil, divided",
        "1/2 cup orzo pasta",
        "4 cups water",
        "1 tablespoon salt",
        "1 tablespoon slivered almonds, or to taste",
        "1 tablespoon tahini"
    ],
    "nut": [
        "Calories > 203 kcal",
        "Carbs > 18 g",
        "Cholesterol > 20 mg",
        "Fat > 13.4 g",
        "Protein > 2.8 g",
        "Sodium > 641 mg"
    ],
    "n": "Lebanese Restaurant Rice Pilaf",
    "a": "NELLYDESIGN",
    "r": "0",
    "s": 12,
    "des": "\"Took me three tries but I finally nailed a restaurant style Lebanese rice pilaf. Nothing I tried online came close to this and I guess the secret is the right kind of rice, the right rice/water ratio and of course, plenty of butter and oil! Find yourself a good Lebanese yogurt marinade, grill some meats, and get a hold of some hummus. If you're from Southeast Michigan or anywhere else with a large Middle Eastern population, you will feel like you're eating at your favorite place! Trust me.\"",
    "ins": "Soak rice in a bowl of water for 10 minutes; drain and rinse until the water runs clear.\nHeat 1/4 cup butter and 2 tablespoons olive oil together in a skillet over medium heat; cook and stir orzo until lightly browned, about 5 minutes. Add drained rice and increase heat to medium-high. Cook and stir orzo-rice mixture until rice is coated in butter-oil mixture and starts to turn translucent, about 5 minutes.\nPour water over rice mixture and season with salt; stir and bring to a boil. Cover skillet, reduce heat to low, and simmer until rice is fluffy and tender yet firm, about 20 minutes.\nHeat remaining olive oil in a separate skillet over medium heat; cook and stir almonds until toasted and fragrant, about 5 minutes. Add remaining butter and stir in tahini until almonds are evenly coated. Mix almond mixture into rice mixture.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "2218278.jpg",
    "o": "",
    "st": "allrecipes"
}