{
    "id": 241849,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 cups water",
        "12 yellow onions, skins removed and reserved",
        "2 tablespoons white vinegar",
        "12 eggs",
        "olive oil"
    ],
    "nut": [
        "Calories > 172 kcal",
        "Carbs > 21.6 g",
        "Cholesterol > 186 mg",
        "Fat > 6.3 g",
        "Protein > 8.8 g",
        "Sodium > 82 mg"
    ],
    "n": "Greek Easter Eggs",
    "a": "smgormas",
    "r": "0",
    "s": 12,
    "des": "\"I found how to make this dye online, but I changed the technique because I did not get good results that way. The first Easter that I celebrated with my husband's family was wonderful. After Easter dinner, a tray of red-dyed hard-boiled eggs was placed on the table. (The deep red eggs remind us of the blood of Christ.) Everyone chose one egg and then paired up two-by-two. Taking the eggs and matching fat or pointed end to end, as they said 'Christos Anesti' they tapped the ends of the eggs together and whoever's egg remained unbroken 'won'. This continued (both ends of the egg can be used as long as matching ends tap each other) until the last person had at least one end of their egg in tact. This was a fun and joy-filled way to help celebrate.\"",
    "ins": "Combine water, onion skins, and vinegar in a pot; bring to a boil. Set aside onions for another use. Reduce heat, cover pot, and simmer, stirring occasionally to make sure skins are submerged, for 30 minutes. Remove pot from heat, remove cover, and cool dye to room temperature, at least 30 minutes.\nRemove skins from dye and discard skins. Place eggs in the dye and bring to a boil; cook for 15 minutes. Remove pot from heat and leave eggs in the dye until a deep red color is reached, about 30 minutes more.\nTransfer eggs to a wire rack to dry, about 15 minutes.\nRub olive oil onto each egg to make them shiny. Store eggs in the refrigerator.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "2 h ",
    "i": "2222425.jpg",
    "o": "",
    "st": "allrecipes"
}