{
    "id": 241991,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil, or as needed",
        "10 small red potatoes, or to taste",
        "4 small baby eggplants, cut into 1-inch pieces",
        "3 canned roasted red bell pepper slices, drained and chopped (optional)",
        "2 green bell peppers, cut into 1-inch pieces",
        "1 red onion, cut into large chunks",
        "2 cloves cloves garlic, quartered",
        "1 tablespoon olive oil, or to taste",
        "1/2 cup olive oil",
        "1 teaspoon garlic salt",
        "1 teaspoon dried oregano",
        "1/2 teaspoon dried basil",
        "1/2 tablespoon coarsely ground black pepper"
    ],
    "nut": [
        "Calories > 486 kcal",
        "Carbs > 64.9 g",
        "Cholesterol > 0 mg",
        "Fat > 23.7 g",
        "Protein > 9 g",
        "Sodium > 490 mg"
    ],
    "n": "Warm Italian Potato Salad",
    "a": "Kate Jackson Fierke",
    "r": "0",
    "s": 6,
    "des": "\"Adapted a recipe that I watched my uncle make. Delicious served either warm or at room temperature. Perfect for those people who don't like mayo.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nBrush 1 tablespoon olive oil over the red potatoes. Pierce potatoes with a fork and arrange onto a baking sheet. Spread baby eggplant pieces, red bell pepper slices, green bell pepper pieces, red onion, and garlic onto a separate baking sheet; drizzle 1 tablespoon olive oil over the vegetables. Stir 1/2 cup olive oil, garlic salt, oregano, basil, and black pepper together in a bowl.\nRoast potatoes in preheated oven for 20 minutes. Put baking sheet into the oven and continue roasting potatoes and the vegetables until the potatoes are tender, about 25 minutes more. Let everything cool for 10 minutes.\nCut potatoes into bite-size chunks and put into a bowl. Drizzle olive oil and seasoning mixture over the potatoes and stir to coat; add the roasted vegetables and stir.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "2220911.jpg",
    "o": "",
    "st": "allrecipes"
}