{
    "id": 241967,
    "old_rating": "4.86207",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (8 ounce) skinless, boneless chicken breast halves",
        "1 cup flour",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "3 large eggs",
        "1 cup Italian-style bread crumbs",
        "1 cup grated Parmesan cheese",
        "2 tablespoons extra-light olive oil, or as needed for browning",
        "1 (24 ounce) jar RaguÂ® Hearty Traditional Sauce",
        "8 ounces shredded mozzarella cheese",
        "Fresh parsley or basil for garnish (optional)"
    ],
    "nut": [
        "Calories > 484 kcal",
        "Carbs > 32.5 g",
        "Cholesterol > 166 mg",
        "Fat > 19.1 g",
        "Protein > 43.6 g",
        "Sodium > 1486 mg"
    ],
    "n": "Weeknight Baked Chicken Parmesan",
    "a": "RaguÂ®",
    "r": "0",
    "s": 8,
    "des": "\"This baked chicken Parmesan can be served with fresh salad or over hot spaghetti with extra marinara sauce.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Lightly oil a large baking dish or rimmed cookie sheet.\nTrim chicken breasts of fat and slice in half length-wise to make 8 equal-thickness chicken cutlets. Note: If the chicken breasts are very large, pound them between plastic wrap into 1/2-inch thick cutlets.\nStir together flour, salt and black pepper in a shallow bowl. Whisk eggs in another bowl. In a third bowl, stir together Italian bread crumbs with parmesan cheese.\nDip both sides of each chicken cutlet into the flour, then dip in beaten eggs, letting excess egg drip off. Dip into the breadcrumb mixture, pressing cutlets into breading to ensure a thick, even coating of crumbs. Set prepared cutlets aside for 10 minutes.\nHeat a large non-stick or cast iron pan over medium heat; add enough olive oil to coat the bottom of the pan. When oil is hot, add chicken in batches (don't crowd the pan), sauteing until golden brown, about 2 minutes per side.\nPlace chicken in prepared baking dish. Top each chicken breast with 2 tablespoons Ragu(R) Hearty Traditional Sauce. (Reserve remaining sauce to serve over pasta, if desired.) Then top with about 1/4 cup of shredded mozzarella.\nBake uncovered until cheese is melted and chicken is no longer pink in the center and the juices run clear, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2189557.jpg",
    "o": "4525470.jpg,4466502.jpg,4466501.jpg,4466496.jpg,4267995.jpg,4010280.jpg",
    "st": "allrecipes"
}