{
    "id": 241937,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 green bell peppers, halved lengthwise and seeded",
        "2 tablespoons olive oil, divided",
        "1 1/4 cups water, divided",
        "1/2 cup rice",
        "1 cube beef bouillon",
        "1 white onion, diced",
        "2 cloves garlic, minced",
        "1 pound ground beef",
        "1/4 teaspoon onion powder",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon dried oregano",
        "1 (14.5 ounce) can diced tomatoes",
        "1 (8 ounce) package shredded Cheddar cheese, divided",
        "1/4 cup grated Parmesan cheese",
        "1/2 cup ketchup",
        "1/2 cup Worcestershire sauce"
    ],
    "nut": [
        "Calories > 366 kcal",
        "Carbs > 23 g",
        "Cholesterol > 66 mg",
        "Fat > 21.8 g",
        "Protein > 19.3 g",
        "Sodium > 761 mg"
    ],
    "n": "Yummy Stuffed Peppers",
    "a": "Procrastigirl",
    "r": "0",
    "s": 8,
    "des": "\"This recipe is a combination of a recipe I found online, my sister's recipe, and my mother's recipe. They all had things I loved about them that I combined to make my favorite stuffed peppers ever.\"",
    "ins": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\nPlace pepper halves, skin-side up, on a baking sheet. Rub pepper halves all over with 1 tablespoon olive oil.\nBroil in the preheated oven until browned and tender, about 10 minutes. Remove from oven and reduce oven temperature to 350 degrees F (175 degrees C). Place peppers, skin-side down, in a baking dish.\nBring 1 cup water, rice, and beef bouillon cube to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and liquid has been absorbed, 15 to 25 minutes.\nHeat remaining olive oil in a large skillet over medium heat. Cook and stir onion and garlic in hot oil until onion is soft and translucent, about 10 minutes. Add ground beef, onion powder, garlic powder, and oregano to onion mixture; cook and stir until beef is browned and crumbly, 7 to 10 minutes.\nStir tomatoes, 1/2 of the Cheddar cheese, cooked rice, and Parmesan cheese into beef mixture until cheese is melted; remove from heat.\nWhisk ketchup, Worcestershire sauce, and remaining water together in a bowl. Place a spoonful of ketchup mixture into the bottom of each pepper, top with a layer of rice mixture, spoon another spoonful of ketchup mixture over rice, top with another layer of rice mixture, and sprinkle remaining Cheddar cheese over the tops.\nBake in the preheated oven until peppers are tender and stuffing is heated through, about 45 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "4478203.jpg",
    "o": "",
    "st": "allrecipes"
}