{
    "id": 241934,
    "old_rating": "4.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup packed brown sugar",
        "1 cup coconut sugar",
        "1/2 cup butter, softened",
        "1/2 cup coconut oil",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "2 teaspoons hot water",
        "1 teaspoon baking soda",
        "1/2 teaspoon cream of tartar",
        "3 cups all-purpose flour",
        "1 cup dark chocolate chips (such as GhirardelliÂ® 60% Cacao)",
        "1/2 cup chopped walnuts",
        "1/4 cup chia seeds",
        "1/4 cup ground flax seeds",
        "1/4 cup cocoa nibs",
        "1/2 teaspoon salt"
    ],
    "nut": [
        "Calories > 107 kcal",
        "Carbs > 13.5 g",
        "Cholesterol > 10 mg",
        "Fat > 5.6 g",
        "Protein > 1.2 g",
        "Sodium > 57 mg"
    ],
    "n": "Super Food Chocolate Chip Cookies",
    "a": "RainbowJewels",
    "r": "0",
    "s": 60,
    "des": "\"I took my basic chocolate chip cookie recipe and packed it with super foods. You get vitamins, minerals, and antioxidants with the cocoa nibs and walnuts. Fiber, protein, and omega-3 fatty acids with the flax and chia seeds, and healthy MCT fats in the coconut oil. These cookies are an easy way to treat your kids (or yourself!) with a great tasting dessert that provides nutrition and still satisfies your sweet tooth.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nBeat brown sugar, coconut sugar, butter, and coconut oil with an electric mixer in a large bowl until smooth. Beat the first egg into creamed butter mixture until completely blended; beat in vanilla extract with the last egg.\nStir hot water and baking soda together in a small bowl until baking soda is dissolved; stir into butter mixture. Add cream of tartar and mix well.\nMix flour into butter mixture until dough is smooth; fold in walnuts, chia seeds, flax seeds, cocoa nibs, and salt. Drop dough by rounded tablespoons onto prepared baking sheet.\nBake in the preheated oven until cookies are lightly browned around the edges, about 12 minutes. Transfer cookies to a wire rack to cool.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "3412030.jpg",
    "o": "",
    "st": "allrecipes"
}