{
    "id": 241965,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 pound sweet Italian turkey sausage, casings removed",
        "2 cloves garlic, minced",
        "8 ounces baby bell or regular bell peppers, sliced",
        "3 cups water",
        "1 (16 ounce) jar RaguÂ® Classic Alfredo Sauce",
        "12 uncooked lasagna noodles, broken into 2-inch pieces",
        "2 cups baby spinach",
        "3/4 cup part-skim ricotta cheese",
        "3/4 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 545 kcal",
        "Carbs > 42.3 g",
        "Cholesterol > 113 mg",
        "Fat > 28.2 g",
        "Protein > 29.3 g",
        "Sodium > 1202 mg"
    ],
    "n": "Alfredo Skillet Lasagna",
    "a": "RaguÂ®",
    "r": "0",
    "s": 6,
    "des": "\"With sausage, mushrooms, peppers, and cheese, this one-skillet dinner brings together the best flavors of a baked lasagna in an easy weeknight meal.\"",
    "ins": "Heat olive oil in a cast iron skillet over medium heat. Add sausage; cook and stir, breaking up the sausage until no longer pink. Use a slotted spoon to transfer sausage to a dish.\nCook garlic in the skillet for 30 seconds; add mushrooms and saute until tender. Transfer to the dish with the sausage.\nPour water and Ragu(R) Classic Alfredo sauce into the skillet; whisk to blend. Bring to a boil.\nAdd broken lasagna noodles to the skillet; reduce heat to medium. Simmer until the noodles are tender, about 12 to 15 minutes, stirring regularly to prevent pasta from sticking to bottom of the pan.\nReturn sausage and mushrooms to the pan; reduce heat to low. Stir in spinach; cook until just wilted. Add ricotta and mozzarella cheeses, stirring until the mozzarella is melted and the ricotta is well combined.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "2189551.jpg",
    "o": "",
    "st": "allrecipes"
}