{
    "id": 241970,
    "old_rating": "4.72727",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound potato gnocchi, uncooked",
        "1 egg",
        "3/4 cup Italian bread crumbs",
        "1/4 cup freshly grated Parmigiano-Reggiano cheese",
        "2 medium skinless, boneless chicken breast halves",
        "1 tablespoon vegetable oil for frying, or as needed",
        "2 cups shredded mozzarella cheese",
        "1 cup freshly grated Parmigiano-Reggiano cheese",
        "1 (24 ounce) jar RaguÂ® Chunky Tomato, Garlic & Onion Sauce",
        "6 ounces baby bella (crimini) mushrooms, thinly sliced",
        "Salt and pepper to taste"
    ],
    "nut": [
        "Calories > 493 kcal",
        "Carbs > 38 g",
        "Cholesterol > 107 mg",
        "Fat > 23.4 g",
        "Protein > 32.1 g",
        "Sodium > 1329 mg"
    ],
    "n": "Layered Chicken Parmesan Gnocchi Bake",
    "a": "RaguÂ®",
    "r": "0",
    "s": 6,
    "des": "\"Gnocchi, mushrooms, and chunks of chicken are baked with layers of chunky tomato sauce and lots of cheese for this hearty family pleaser.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 3-quart baking dish.\nCook gnocchi per package directions, but remove them from water before they are completely cooked. Drain well and set aside.\nWhisk egg with a pinch of salt and pepper in a shallow bowl. Mix together in a separate shallow bowl Italian bread crumbs, 1/4 cup grated Parmigiano-Reggiano cheese, salt and pepper.\nButterfly chicken breasts and bread them: dip each breast first into bread crumb mixture, then into egg, then into bread crumb mixture again.\nHeat oil in a large skillet over medium heat. Cook breaded chicken until golden brown and cooked through (internal temperature at least 165 degrees F), about 5 minutes on each side. Remove chicken from skillet.\nToss and quickly saute gnocchi in the same skillet for about 2 minutes.\nSpread a layer of Ragu(R) Sauce on the bottom of a 3-quart baking dish. Spread gnocchi evenly over the sauce. Sprinkle some mozzarella and Parmigiano cheese over gnocchi.\nLayer sliced mushrooms over the top. Spread half of the remaining sauce over the mushrooms and sprinkle some more mozzarella and Parmigiano over the top. Salt and pepper to taste.\nSlice chicken and place pieces on top of mushrooms and cheese. Spoon the remaining sauce evenly over the top. Sprinkle with the remaining cheeses. Season to taste with salt and pepper, if desired.\nBake until sauce is bubbly and cheese is melted, 15 to 20 minutes.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2189555.jpg",
    "o": "",
    "st": "allrecipes"
}