{
    "id": 241911,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "5 1/2 cups high-gluten flour, divided",
        "2 1/2 teaspoons active dry yeast",
        "1 cup milk",
        "1/2 cup butter",
        "1/2 cup white sugar",
        "1 teaspoon salt",
        "2 eggs",
        "3 tablespoons orange juice",
        "Icing:",
        "1 cup confectioners' sugar",
        "1 tablespoon orange juice"
    ],
    "nut": [
        "Calories > 312 kcal",
        "Carbs > 31.2 g",
        "Cholesterol > 40 mg",
        "Fat > 6.7 g",
        "Protein > 28.4 g",
        "Sodium > 202 mg"
    ],
    "n": "Greek Easter Bread",
    "a": "makokiller",
    "r": "0",
    "s": 16,
    "des": "\"This is a very nice bread to serve anytime of the year not just at Easter. My mother always made this at Easter time, and I was finally able to get the recipe out of her. Now I want to share it with you. This recipe makes 2 loaves.\"",
    "ins": "Mix 2 cups flour and yeast together in the bowl of a stand mixer.\nStir milk, butter, sugar, and salt together in a saucepan; heat and stir over medium-low heat until the mixture is smooth and the temperature is between 90 degrees F (32 degrees C) to 100 degrees F (37 degrees C).\nPour the milk mixture into the flour mixture, add eggs, and beat on low speed for 30 seconds. Increase speed to high and beat for 3 minutes more. Add 1 cup flour and 3 tablespoons orange juice to the mixture; mix on high for 3 minutes more.\nFit the mixer with a dough hook. Add remaining flour to the mixture; beat with dough hook until the flour is completely incorporated.\nGrease a glass bowl. Put dough into the bowl. Let dough rise until doubled in volume, 3 to 4 hours.\nPreheat oven to 350 degrees F (175 degrees C).\nPunch dough down. Divide the dough into two halves. Split each half into three even pieces, roll each piece into a cylinder, and braid into loaves. Put loaves onto a baking sheet.\nBake in preheated oven until the middle is baked, 25 to 30 minutes.\nStir confectioners' sugar and 1 tablespoon orange juice together in a bowl; brush onto the tops of the loaves.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "3 h ",
    "i": "2222049.jpg",
    "o": "",
    "st": "allrecipes"
}