{
    "id": 241983,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups walnut flour",
        "2 cups almond flour",
        "4 teaspoons baking powder",
        "1 tablespoon vanilla extract",
        "2 teaspoons ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon liquid stevia",
        "1/4 cup butter, melted",
        "1/4 cup unsweetened applesauce, or as needed",
        "6 egg whites"
    ],
    "nut": [
        "Calories > 274 kcal",
        "Carbs > 6.9 g",
        "Cholesterol > 20 mg",
        "Fat > 25.2 g",
        "Protein > 7.8 g",
        "Sodium > 436 mg"
    ],
    "n": "Nutty Waffles (Gluten-Free, Sugar-Free)",
    "a": "All4Fun",
    "r": "0",
    "s": 6,
    "des": "\"This is a modified version of Peter Reinhart and Denene Wallace's Waffle recipe. This sugar-free, gluten-free breakfast is tasty and filling. As written, it will yield three large waffles, each one easily serving two. \n\nDiabetic- and celiac-friendly.\"",
    "ins": "Preheat a waffle iron according to manufacturer's instructions.\nMix walnut flour, almond flour, baking powder, vanilla extract, cinnamon, nutmeg, and stevia together in a large bowl.\nMix melted butter and applesauce together in a measuring cup, adding only enough applesauce so mixture is 1/2 cup.\nBeat egg whites in the bowl of a stand mixer until fluffy and stiff peaks form. Remove 2/3 of the beaten egg whites and set aside in a bowl.\nPlace flour mixture and butter-applesauce mixture in the bowl of the stand mixer with the remaining egg whites; beat on low using the stirring paddle until batter is thoroughly combined. The mixture will be dry. Fold reserved egg whites into batter until incorporated.\nLadle 1 to 2 scoops batter into the preheated waffle iron; cook according to manufacturer's instructions. Repeat with remaining batter.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}