{
    "id": 242031,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "olive oil cooking spray",
        "7 roma tomatoes, halved and cored, or more to taste",
        "2 Anaheim chile peppers, halved lengthwise and seeded",
        "2 jalapeno peppers",
        "1 poblano chile pepper, halved lengthwise and seeded",
        "2 onions, quartered",
        "2 garlic cloves, peeled",
        "1 lime, juiced",
        "2 tablespoons chopped fresh cilantro, or more to taste",
        "2 tablespoons cider vinegar, or more to taste",
        "3/4 teaspoon dried oregano, or more to taste",
        "3/4 teaspoon ground cumin, or more to taste",
        "3/4 teaspoon kosher salt, or more to taste",
        "3/4 teaspoon ground black pepper, or more to taste",
        "1/2 teaspoon celery salt, or more to taste"
    ],
    "nut": [
        "Calories > 12 kcal",
        "Carbs > 2.6 g",
        "Cholesterol > 0 mg",
        "Fat > 0.1 g",
        "Protein > 0.4 g",
        "Sodium > 70 mg"
    ],
    "n": "Roasted Salsa",
    "a": "ChrisP",
    "r": "0",
    "s": 32,
    "des": "\"The charred tomatoes and peppers add a nice flavor to this salsa.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C). Line a roasting pan or baking sheet with aluminum foil and coat with cooking spray.\nArrange tomatoes, cut-side down, in the roasting pan; add Anaheim chile peppers, jalapeno peppers, and poblano peppers, all skin-side up. Add onions and garlic to roasting pan. Spray the vegetable mixture with cooking spray.\nRoast in the preheated oven until tomato and chile pepper skins are blistered and charred, 40 to 45 minutes. Remove from oven and cool for 10 to 15 minutes, keeping skins on tomatoes and chile peppers.\nBlend tomato-chile pepper mixture, lime juice, cilantro, cider vinegar, oregano, cumin, kosher salt, black pepper, and celery salt in a food processor using quick pulses until desired consistency is reached. Refrigerate salsa in an air-tight container.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "3182878.jpg",
    "o": "",
    "st": "allrecipes"
}