{
    "id": 242058,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup cooked brown rice",
        "1 cup cooked quinoa",
        "2 teaspoons tamari (gluten-free soy sauce) (optional)",
        "1 tablespoon water, or as needed (optional)",
        "1/4 cup chia seeds",
        "1/4 cup sesame seeds",
        "1/4 cup flax seeds",
        "salt to taste"
    ],
    "nut": [
        "Calories > 126 kcal",
        "Carbs > 14.8 g",
        "Cholesterol > 0 mg",
        "Fat > 6.1 g",
        "Protein > 4 g",
        "Sodium > 108 mg"
    ],
    "n": "Mary's Gone CrackersÂ® Copycat",
    "a": "Cazuela",
    "r": "0",
    "s": 8,
    "des": "\"These gluten-free crackers make a delicious snack on their own or with dips and cheeses. You can add other seeds such as caraway, cumin, or nigella for different flavor profiles. Or you can experiment with dried herbs or garlic powder depending on your individual preferences.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. Cut a small square out of a separate sheet of parchment paper and oil 1 side; set aside.\nBlend brown rice, quinoa, and tamari in a food processor, adding water if mixture is too dry, until a dough starts to form. Add chia seeds, sesame seeds, flax seeds, and salt; pulse until dough is a sticky ball.\nRoll small pieces of dough into 1/2-inch balls and arrange at least 2 1/2 inches apart on the prepared baking sheet. Place the oiled square of parchment paper, oil-side down, onto a dough ball. Flatten the dough ball into a very thin 2-inch-wide disk by pressing the top of a small jar onto the parchment square. Repeat with remaining dough balls.\nBake in the preheated oven until edges of crackers begin to brown, 10 to 12 minutes. Transfer crackers to a wire rack. Place the rack onto the baking sheet and return to oven.\nBake until crackers are dry and crisp, 2 to 3 minutes more.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "3530497.jpg",
    "o": "",
    "st": "allrecipes"
}