{
    "id": 24202,
    "old_rating": "4.45749",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 large potatoes, peeled and cubed",
        "1 tablespoon butter",
        "1 tablespoon finely chopped onion",
        "1/4 cup shredded Cheddar cheese",
        "salt and pepper to taste",
        "5 carrots, chopped",
        "1 tablespoon vegetable oil",
        "1 onion, chopped",
        "1 pound lean ground beef",
        "2 tablespoons all-purpose flour",
        "1 tablespoon ketchup",
        "3/4 cup beef broth",
        "1/4 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 452 kcal",
        "Carbs > 52.5 g",
        "Cholesterol > 65 mg",
        "Fat > 17 g",
        "Protein > 23.1 g",
        "Sodium > 295 mg"
    ],
    "n": "Shepherd's Pie VI",
    "a": "Jacquie",
    "r": "0",
    "s": 6,
    "des": "\"This Shepherd's Pie is a layered casserole of beef, carrots, and potato.\"",
    "ins": "Bring a large pot of salted water to a boil.  Add potatoes and cook until tender but still firm, about 15 minutes. Drain and mash. Mix in butter, finely chopped onion and 1/4 cup shredded cheese. Season with salt and pepper to taste; set aside.\nBring a large pot of salted water to a boil.  Add carrots and cook until tender but still firm, about 15 minutes. Drain, mash and set aside. Preheat oven to 375 degrees F (190 degrees C.)\nHeat oil in a large frying pan. Add onion and cook until clear. Add ground beef and cook until well browned. Pour off excess fat, then stir in flour and cook 1 minute. Add ketchup and beef broth. Bring to a boil, reduce heat and simmer for 5 minutes.\nSpread the ground beef in an even layer on the bottom of a 2 quart casserole dish. Next, spread a layer of mashed carrots. Top with the mashed potato mixture and sprinkle with remaining shredded cheese.\nBake in the preheated oven for 20 minutes, or until golden brown.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "4541492.jpg",
    "o": "4541492.jpg,4538067.jpg,4535089.jpg,4531031.jpg,4531027.jpg,4519367.jpg",
    "st": "allrecipes"
}