{
    "id": 242032,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 zucchinis, halved lengthwise and seeded",
        "1 pound ground turkey",
        "1 (1.25 ounce) package taco seasoning",
        "3/4 cup water, or as needed",
        "2 red sweet pepper, finely chopped",
        "1 (10 ounce) can diced tomatoes and green chiles (such as RO*TELÂ® Mexican Lime & Cilantro)",
        "1/2 white onion, finely chopped",
        "1/4 cup chopped fresh cilantro",
        "1 cup sour cream",
        "1 (1 ounce) packet sour cream seasoning mix (such as Old El PasoÂ® Zesty Sour Cream Seasoning Mix)",
        "1 bunch green onions, diced",
        "1/2 cup shredded Muenster cheese",
        "1/2 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 527 kcal",
        "Carbs > 31.8 g",
        "Cholesterol > 137 mg",
        "Fat > 30.1 g",
        "Protein > 35 g",
        "Sodium > 1570 mg"
    ],
    "n": "Taco-Stuffed Zucchini Boats",
    "a": "dzcarrera",
    "r": "0",
    "s": 4,
    "des": "\"This is a fairly simple to make dish that satisfies the low-carb lifestyle. When I'm feeling the need for a taco, this dish will suffice! It was so tasty that even my 5-year-old approved it! We will definitely be making this again. Guacamole and salsa also make great toppings for these.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease the bottom of a 13x9-inch baking dish.\nBring a large pot of water to a boil. Cook zucchini halves in boiling water to just soften slightly, about 1 minute. Remove zucchini halves from the water and arrange into the prepared baking dish with the cut sides facing upwards.\nHeat a large skillet over medium-high heat. Cook and stir ground turkey in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nReturn skillet to medium-high heat; pour water over the turkey and season with taco seasoning. Cook until the water thickens and coats the turkey, about 5 minutes. Add red peppers, diced tomatoes and green chiles, onion, and cilantro; cook and stir until the peppers are softened, about 5 minutes more.\nStir sour cream and sour cream seasoning mix together in a bowl.\nUsing a slotted spoon, spoon the turkey mixture into the hollows of each zucchini half and press firmly. Top the turkey mixture with about half the sour cream mixture. Sprinkle green onions, Muenster cheese, and Cheddar cheese over the sour cream mixture, respectively.\nBake in the preheated oven until the cheese is melted and the zucchini is cooked through, about 30 minutes. Top with remaining sour cream mixture.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "3983940.jpg",
    "o": "",
    "st": "allrecipes"
}