{
    "id": 242041,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 quart vegetable oil for frying",
        "Batter:",
        "1/2 cup water, or as needed",
        "1/2 cup all-purpose flour",
        "1 3/4 teaspoons Cajun seasoning",
        "1/2 teaspoon Italian seasoning",
        "1/4 teaspoon cayenne pepper",
        "1/2 teaspoon kosher salt",
        "Breading:",
        "1/2 cup French-fried onions",
        "1/2 cup panko bread crumbs",
        "1/2 pound Havarti cheese, cut into 1-inch cubes"
    ],
    "nut": [
        "Calories > 190 kcal",
        "Carbs > 9.1 g",
        "Cholesterol > 19 mg",
        "Fat > 15.7 g",
        "Protein > 4.1 g",
        "Sodium > 331 mg"
    ],
    "n": "Fried Havarti Cheese Bites",
    "a": "WEEBRIE",
    "r": "0",
    "s": 15,
    "des": "\"I made this up the other day when I had some hot oil ready to go. Who can argue with fried cheese, and Havarti is my favorite! Let me know your variations on it! Sauces can vary from horseradish based (with ketchup and mayo) to mustard sauces, or really anything you like.  Truly, these are divine all by themselves!\"",
    "ins": "Heat oil in a deep-fryer or large saucepan to 300 degrees F (168 degrees C).\nBeat water, flour, Cajun seasoning, Italian Seasoning, cayenne pepper, and salt with a whisk in a large bowl until smooth. If batter is too thick, thin with up to 1/4 cup water.\nGrind French-fried onions and panko crumbs in a food processor until fine; transfer to a bowl.\nStir about half the cubed cheese into the batter to coat; remove with a slotted spoon to the breading, and toss to coat.\nCarefully add a coated cheese cubes to the hot oil in small batches, and fry until golden brown, 1 to 2 minutes. Transfer fried cheese cubes to a paper towel-covered dish. Reheat oil to 300 degrees F (168 degrees C) and repeat process with remaining cheese cubes.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "2234965.jpg",
    "o": "",
    "st": "allrecipes"
}