{
    "id": 242196,
    "old_rating": "4.11667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package cream cheese, softened",
        "1 cup confectioners' sugar",
        "2 tablespoons milk",
        "1 tablespoon vanilla extract, divided",
        "2 cups blueberries, divided",
        "2 loaves French bread, cubed",
        "2 cups milk",
        "8 eggs",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg"
    ],
    "nut": [
        "Calories > 494 kcal",
        "Carbs > 71.7 g",
        "Cholesterol > 178 mg",
        "Fat > 14.6 g",
        "Protein > 19.3 g",
        "Sodium > 734 mg"
    ],
    "n": "Overnight Blueberry French Toast Casserole",
    "a": "Joshua Dunham",
    "r": "0",
    "s": 10,
    "des": "\"I made this for Christmas morning brunch, perfect to put in the oven and go open presents while it bakes. You can top with syrup or whipped cream or nothing at all. I found several different recipes similar to this one, but none had everything I wanted to do with it, so I thought I'd try to make my own. I think it is a very good start, but please, let me know what you think!\"",
    "ins": "Mix cream cheese, confectioners' sugar, 2 tablespoon milk, and 1 teaspoon vanilla extract in a bowl until smooth and creamy; fold in 1 cup blueberries.\nCover the bottom of a 10x14-inch baking dish with 1 layer bread cubes. Spread cream cheese mixture over bread layer; top with remaining bread cubes.\nWhisk 2 cups milk, eggs, 2 teaspoons vanilla extract, cinnamon, and nutmeg together in a large bowl; pour over bread mixture. Sprinkle 1 cup blueberries over bread-egg mixture. Cover dish tightly with aluminum foil and refrigerate, 8 hours to overnight. Remove from refrigerator 30 to 60 minutes before baking.\nPreheat oven to 375 degrees F (190 degrees C).\nBake in the preheated oven for 45 minutes. Remove foil and continue baking until center is set, about 30 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "9 h ",
    "i": "2291340.jpg",
    "o": "4478478.jpg,3777255.jpg,3777251.jpg,3766229.jpg,3763908.jpg,3744993.jpg",
    "st": "allrecipes"
}