{
    "id": 242187,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Pretzel Crust:",
        "2 cups crushed pretzels",
        "3/4 cup butter, melted",
        "3 tablespoons brown sugar",
        "Cream Cheese Layer:",
        "1 cup white sugar",
        "1 (8 ounce) package cream cheese, softened",
        "1/2 teaspoon vanilla extract",
        "1/2 lemon, juiced",
        "1 1/2 lemons, zested, or more to taste",
        "1 (8 ounce) container frozen whipped topping (such as Cool WhipÂ®), thawed",
        "Fruit Layer:",
        "1 1/2 cups boiling water",
        "2 (3 ounce) packages lemon-flavored gelatin mix (such as Jell-OÂ®)",
        "1/2 cup fresh lemon juice, strained",
        "1 mango, peeled and chopped",
        "1 kiwi, peeled and sliced"
    ],
    "nut": [
        "Calories > 423 kcal",
        "Carbs > 52 g",
        "Cholesterol > 51 mg",
        "Fat > 23.3 g",
        "Protein > 4.5 g",
        "Sodium > 461 mg"
    ],
    "n": "Lemon Pretzel Salad with Mango and Kiwi",
    "a": "Coastal Roots",
    "r": "0",
    "s": 12,
    "des": "\"Refreshingly satisfying! Fresh lemon, mango, and kiwi are fused with fluffy cool cream cheese, all sitting atop a yummy salty sweet pretzel crust...wow, what else can you say?! It always disappears with a quickness. Perfect for BBQs, holidays, pitch-ins, or just a tasty treat with a hot cup of tea. Enjoy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nMix crushed pretzels, butter, and brown sugar together in a bowl; press into a 9x13-inch baking dish.\nBake in the preheated oven for 10 minutes; set aside to cool completely. Crust will be soft when taken out of the oven and will harden as it cools.\nMix white sugar, cream cheese, and vanilla extract together in a large bowl until smooth. Stir juice from 1/2 lemon and lemon zest into cream cheese mixture and mix well; fold in whipped topping. Spread cream cheese mixture evenly over cooled crust; refrigerate until set, about 30 minutes.\nMix boiling water and lemon-flavored gelatin mix together in a bowl until dissolved. Add 1/2 cup strained lemon juice and mix well. Refrigerate gelatin mixture until slightly thickened, about 1 hour.\nLadle enough gelatin mixture over cream cheese layer to cover, setting remaining gelatin mixture aside. Arrange mango and kiwi onto gelatin mixture layer and pour remaining gelatin mixture over fruit layer. Refrigerate until completely chilled and set, about 2 hours.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "4 h",
    "i": "2270562.jpg",
    "o": "",
    "st": "allrecipes"
}