{
    "id": 242101,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup white sugar",
        "3/4 cup brown sugar",
        "1/4 cup seasoned salt",
        "2 tablespoons paprika",
        "2 tablespoons ground black pepper",
        "1 tablespoon garlic powder",
        "1 tablespoon onion powder",
        "1 teaspoon cayenne pepper",
        "4 racks pork spareribs"
    ],
    "nut": [
        "Calories > 1150 kcal",
        "Carbs > 24.8 g",
        "Cholesterol > 321 mg",
        "Fat > 80.6 g",
        "Protein > 77.6 g",
        "Sodium > 1168 mg"
    ],
    "n": "Rib Rub for Fall-Off-The-Bone Ribs",
    "a": "Annabelle",
    "r": "0",
    "s": 12,
    "des": "\"Generously season ribs with this flavorful dry rub and then slow cook on the grill for delicious, fall-off-the-bone ribs that won't heat up your house in the summer.\"",
    "ins": "Combine white sugar, brown sugar, salt, paprika, black pepper, garlic powder, onion powder, and cayenne pepper in a container with a lid; shake until rub is evenly combined.\nGenerously rub both sides of each rib rack with rub.\nPreheat grill for medium heat and lightly oil the grate.\nPlace 1 rack of ribs, meaty-side down, in the center of main grill rack; cook for 5 minutes; transfer to the far side of top grill rack, meaty-side up. Repeat process with remaining rib racks.\nAngle the rib racks on the top grill shelf so the meaty sides are facing out and they are stacked one in front of the other at an angle. Turn off heat directly below the ribs and turn other burner on low; close the grill lid and cook for 30 minutes.\nFlip ribs so the closest side to the flame is the furthest side and the meaty side is still facing forward and the rack that was in the front is now in the back. Continue to cook, flipping every 30 minutes, until outsides are crispy and meat is tender, about 5 hours. Slice into small chunks.",
    "pt": "10 m",
    "ct": "5 h ",
    "tt": "6 h",
    "i": "2661484.jpg",
    "o": "",
    "st": "allrecipes"
}