{
    "id": 242121,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 (8 ounce) package quinoa elbow pasta",
        "1 tablespoon olive oil",
        "1 (15 ounce) can chili with beans (such as Dennison'sÂ®)",
        "1 (6.5 ounce) can tomato sauce",
        "1 cup shredded mozzarella cheese",
        "1 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 554 kcal",
        "Carbs > 58.7 g",
        "Cholesterol > 66 mg",
        "Fat > 24.2 g",
        "Protein > 26.6 g",
        "Sodium > 1140 mg"
    ],
    "n": "Quinoa Chili Bake",
    "a": "Career Woman",
    "r": "0",
    "s": 4,
    "des": "\"I am trying to lose weight and start a healthier lifestyle, but honestly don't like health food; I like comfort foods. So, the goal here was to develop a comfort food using quinoa and a few simple ingredients for a quick dinner that has more nutrients than the average mac-n-cheese. I'm happy with my results on this one. It may not be the creme de la creme of yummy health foods, but it is easy. And when I say easy, I mean it.  As a career woman with a hungry husband, I need to keep things as basic and quick as possible, while catering to a picky husband-kid. Cut with spatula and serve in squares. Enjoy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Prepare a 9-inch baking dish with cooking spray.\nBring a large pot of lightly salted water to a boil. Add past and olive oil and cook at a boil, stirring occasionally until cooked through but firm to the bite, 6 to 9 minutes; drain.\nReturn pasta to the pot; add chili and tomato sauce and stir. Pour the pasta mixture into the prepared baking dish; top with layers of mozzarella cheese and Cheddar cheese, respectively.\nCook in preheated oven until cheese is completely melted, about 15 minutes.",
    "pt": "5 m",
    "ct": "25 m",
    "tt": "30 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}