{
    "id": 242158,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package farfalle (bow-tie) pasta",
        "1/4 cup butter",
        "1/4 cup olive oil",
        "2 tablespoons minced garlic",
        "1 cup sliced shiitake mushrooms",
        "1/2 cup sliced yellow onion",
        "1 pound cooked shrimp, peeled and deveined",
        "1 (14 ounce) can diced tomatoes",
        "1/2 cup sun-dried tomato pesto",
        "1/2 cup white wine",
        "2 tablespoons lemon juice",
        "1/2 cup half-and-half",
        "1/2 cup shredded Parmesan cheese, plus more for topping",
        "1/4 cup chopped flat-leaf parsley",
        "1 teaspoon red pepper flakes",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon sea salt"
    ],
    "nut": [
        "Calories > 959 kcal",
        "Carbs > 96.8 g",
        "Cholesterol > 272 mg",
        "Fat > 40.6 g",
        "Protein > 46.7 g",
        "Sodium > 1152 mg"
    ],
    "n": "Shiitake Mushroom, Sun-Dried Tomato Pesto, and Shrimp Pasta",
    "a": "Jennifer Abel Bandow",
    "r": "0",
    "s": 4,
    "des": "\"Sauteed shiitake mushrooms, sun-dried tomato pesto, and shrimp combined with all the best ingredients to make a succulent pasta that will stay at the front of your recipe box.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook bow-tie pasta at a boil, stirring occasionally, until cooked through yet firm to the bite, about 12 minutes; drain.\nHeat a skillet over medium heat; add butter and olive oil. Cook and stir garlic in the hot butter-oil until fragrant, about 1 minute. Add mushrooms and onion; cook and stir until tender, about 5 minutes.\nMix shrimp, diced tomatoes, pesto, wine, and lemon juice into mushroom-onion mixture; simmer for 10 minutes. Remove skillet from heat; add half-and-half, Parmesan cheese, parsley, red pepper flakes, black pepper, and salt and mix until sauce is well combined.\nPlace pasta in a serving bowl. Spoon sauce over pasta and top with extra Parmesan cheese.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "4484835.jpg",
    "o": "",
    "st": "allrecipes"
}