{
    "id": 242164,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 pound skinless, boneless chicken thighs",
        "3 onions, sliced",
        "8 ounces baby bella (crimini) mushrooms, sliced",
        "2 tablespoons cooking sherry",
        "2 zucchini, cut into chunks",
        "2 red bell peppers, sliced",
        "1 large yellow squash, cut into chunks",
        "4 cloves garlic, sliced",
        "3 sprigs fresh rosemary, leaves stripped",
        "1 teaspoon Italian seasoning",
        "1 teaspoon dried oregano",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1 pinch red pepper flakes, or to taste",
        "3 cups tomato sauce, or more to taste",
        "1/4 cup chicken stock, or more as desired",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 271 kcal",
        "Carbs > 26.7 g",
        "Cholesterol > 47 mg",
        "Fat > 10.7 g",
        "Protein > 19.1 g",
        "Sodium > 1186 mg"
    ],
    "n": "Carla's Veggie-Loaded Chicken Cacciatore",
    "a": "Italian-DeLish",
    "r": "0",
    "s": 6,
    "des": "\"This simple Italian dish is packed with chicken and loads of vegetables and herbs for a satisfying one pot meal.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a large Dutch oven or heavy pot over medium-high heat; cook chicken in hot oil until browned, 3 to 4 minutes per side. Transfer chicken and accumulated juices to a bowl.\nMix onions and mushrooms together in the same large Dutch oven; add sherry. Cook and stir until onions and mushrooms are soft, 5 to 6 minutes. Add zucchini, red bell peppers, yellow squash, garlic, rosemary, Italian seasoning, oregano, 1 teaspoon salt, 1 teaspoon black pepper, and red pepper flakes; cook and stir until heated through, 3 to 4 minutes. Mix tomato sauce and chicken stock into vegetable mixture.\nArrange chicken on top of vegetable mixture; pour in any accumulated juices left in the bowl. Season with salt and black pepper. Cover Dutch oven.\nBake in the preheated oven until chicken is no longer pink in the center, about 1 hour 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "2556038.jpg",
    "o": "",
    "st": "allrecipes"
}