{
    "id": 242157,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds green beans, trimmed, or more to taste",
        "1 tablespoon water, or as needed",
        "1 teaspoon peanut oil",
        "1 cup chopped onion",
        "6 slices bacon, or more to taste",
        "3/4 cup brown sugar",
        "3/4 cup apple cider vinegar",
        "1/4 teaspoon liquid smoke flavoring",
        "1/2 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 270 kcal",
        "Carbs > 43.3 g",
        "Cholesterol > 15 mg",
        "Fat > 7.5 g",
        "Protein > 8.7 g",
        "Sodium > 340 mg"
    ],
    "n": "Sweet and Sour Green Beans",
    "a": "dfwenigma",
    "r": "0",
    "s": 4,
    "des": "\"This green bean concoction is similar to others but not the same! This recipe offers optional 'speed cooking' to quickly get this fresh-tasting side dish to the table.\"",
    "ins": "Place green beans in a microwave-safe bowl and add enough water to make a layer in the bottom; heat in microwave until green beans are tender yet firm to the bite, 1 to 3 minutes. Drain.\nHeat peanut oil in a large wok or skillet over medium heat; cook and stir onion until tender, 5 to 10 minutes. Transfer onion to a bowl and discard any remaining oil.\nPlace the bacon in the wok or skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels and cut into bite-size pieces. Reserve 4 to 5 tablespoons bacon drippings in the wok.\nMix onion, brown sugar, vinegar, and liquid smoke in the reserved bacon drippings; cook and stir until sauce is bubbling and brown sugar is dissolved, about 5 minutes. Add green beans to sauce and stir to coat; cook until green beans are heated through, 2 to 3 minutes.\nTransfer green bean mixture to a microwave-safe casserole dish; season with black pepper. Serve immediately or warm in the microwave, if needed.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "4292026.jpg",
    "o": "",
    "st": "allrecipes"
}