{
    "id": 242231,
    "old_rating": "4.73077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 head garlic",
        "1 tablespoon olive oil",
        "1 1/3 cups dark brown sugar",
        "1 cup pineapple juice",
        "2/3 cup water",
        "1/4 cup teriyaki sauce",
        "1 tablespoon soy sauce",
        "3 tablespoons lemon juice",
        "3 tablespoons minced white onion",
        "1 tablespoon bourbon whiskey",
        "1 tablespoon crushed pineapple",
        "1/4 teaspoon cayenne pepper"
    ],
    "nut": [
        "Calories > 152 kcal",
        "Carbs > 32.8 g",
        "Cholesterol > 0 mg",
        "Fat > 1.8 g",
        "Protein > 1.3 g",
        "Sodium > 467 mg"
    ],
    "n": "T.G.I. Friday'sÂ® Jack DanielsÂ® Sauce",
    "a": "Michael DeLong",
    "r": "0",
    "s": 8,
    "des": "\"The Jack DanielsÂ® grill glaze is one of the most scrumptious sauces you will ever taste on just about any meat. Introduced in April of 1997, this glaze has become one of Friday's best-selling items. This versatile sweet-and-slightly-spicy sauce can be ordered on salmon, baby back ribs, steak, chicken, pork chops . . . even on chicken wings.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C).\nCut about 1/2-inch from the top of the garlic head. Trim the roots so the garlic sits flat. Remove some of the outer layers of papery skin from the garlic, leaving enough so that the cloves stay together. Put garlic into a small casserole dish or baking dish, drizzle olive oil over it, and cover with a lid or aluminum foil.\nRoast garlic in preheated oven until the cloves are soft, about 1 hour.\nStir brown sugar, pineapple juice, water, teriyaki sauce, and soy sauce together in a saucepan and bring to a boil; reduce heat to low and keep at simmer.\nSqueeze sides of the garlic until the pasty roasted garlic emerges. Measure 2 teaspoons roasted garlic into the saucepan and incorporate into the sauce with a whisk. Reserve remaining roasted garlic for another use.\nStir lemon juice, white onion, bourbon whiskey, pineapple, and cayenne pepper into the sauce; bring to a simmer and cook until the volume of the liquid reduces by half and is thick and syrup-like, 40 to 50 minutes.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4519144.jpg",
    "o": "",
    "st": "allrecipes"
}