{
    "id": 242279,
    "old_rating": "4.1",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Sauce:",
        "2 (15 ounce) cans tomato sauce",
        "1 cup water",
        "1/2 cup chipotle peppers in adobo sauce",
        "3 tablespoons chili powder",
        "1 teaspoon dried oregano",
        "1 teaspoon sea salt",
        "Wraps:",
        "2 tablespoons extra-virgin olive oil",
        "2 small onions, finely chopped",
        "2 green bell peppers, finely chopped",
        "1 pinch salt",
        "1 1/2 pounds ground beef",
        "4 cloves garlic, minced",
        "2 (15 ounce) cans kidney beans, rinsed and drained",
        "1 (15 ounce) can black beans, rinsed and drained",
        "16 romaine lettuce leaves"
    ],
    "nut": [
        "Calories > 408 kcal",
        "Carbs > 37.5 g",
        "Cholesterol > 52 mg",
        "Fat > 18.2 g",
        "Protein > 25.4 g",
        "Sodium > 1373 mg"
    ],
    "n": "Spicy Chipotle Lettuce Wraps",
    "a": "halfnotes",
    "r": "0",
    "s": 8,
    "des": "\"I had leftover canned chiles in adobo sauce and thought I would try it in a lettuce wrap recipe. It turned out great and my family loved it! It is pretty spicy, but that's how we like it. We topped our lettuce wraps with sliced olives and chopped tomatoes. This would also be great as a baked potato topper or on a taco salad.\"",
    "ins": "Blend tomato sauce, water, chipotle peppers in adobo sauce, chili powder, oregano, and 1 teaspoon sea salt together in a blender until sauce is smooth.\nHeat olive oil in a large Dutch oven or heavy pot over medium heat; cook and stir onions, green bell peppers, and a pinch salt until softened, 5 to 10 minutes. Add ground beef and increase heat to medium-high; cook and stir until beef is browned and crumbly, 5 to 10 minutes. Drain excess grease.\nMix garlic and sauce into ground beef mixture; cook and stir until heated through, 2 to 3 minutes. Stir kidney beans and black beans into into ground beef sauce and simmer, stirring occasionally, until filling flavors have blended, about 20 minutes.\nSpoon filling into lettuce leaves.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "45 m",
    "i": "3481781.jpg",
    "o": "",
    "st": "allrecipes"
}