{
    "id": 242276,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "16 ounces gluten-free elbow pasta",
        "2 cups heavy whipping cream",
        "salt and ground black pepper to taste",
        "8 ounces shredded Cheddar cheese",
        "8 ounces shredded fontina cheese",
        "8 ounces shredded Gouda cheese",
        "8 slices cooked bacon, chopped (optional)"
    ],
    "nut": [
        "Calories > 613 kcal",
        "Carbs > 38.2 g",
        "Cholesterol > 146 mg",
        "Fat > 41.2 g",
        "Protein > 23.1 g",
        "Sodium > 653 mg"
    ],
    "n": "Gluten-Free Macaroni and Three Cheeses with Bacon",
    "a": "TRH333",
    "r": "0",
    "s": 10,
    "des": "\"This is a very rich and flavorful macaroni and cheese dish that could be enjoyed as either a side dish or a main course! If the right gluten-free macaroni noodles are used (I recommend a quinoa-based elbow macaroni) this tastes as close to the real thing as you can get!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally, until cooked through but firm to the bite, 8 minutes. Drain.\nPour cream into a large saucepan over medium heat and season with salt and pepper.\nMeasure about 2 tablespoons Cheddar cheese, 2 tablespoons fontina cheese, and 2 tablespoons Gouda cheese; set aside. Stir remaining Cheddar cheese, fontina cheese, and Gouda cheese into cream; cook, stirring frequently, until cheeses are melted and cheese sauce is smooth, about 5 minutes. Remove saucepan from heat.\nMix pasta into cheese sauce until evenly coated; fold in bacon. Pour macaroni and cheese into the prepared baking dish and top with reserved cheese mixture.\nBake in the preheated oven until cheese is melted and bubbling, about 15 minutes.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "2285314.jpg",
    "o": "",
    "st": "allrecipes"
}