{
    "id": 242228,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (1/2-inch to 1-inch thick) quarter-slices watermelon",
        "2 eggs",
        "1 ounce shaved Parmesan cheese, or more to taste",
        "2 thin slices thinly sliced ham (optional)"
    ],
    "nut": [
        "Calories > 483 kcal",
        "Carbs > 46.2 g",
        "Cholesterol > 413 mg",
        "Fat > 21.3 g",
        "Protein > 31.7 g",
        "Sodium > 949 mg"
    ],
    "n": "Eggs Machiavellian (inspired by 'The SimsÂ® 3')",
    "a": "J.R.",
    "r": "0",
    "s": 1,
    "des": "\"Eggs over-easy and pan-grilled watermelon, flavored with fresh parmesan cheese. On its own, with the meat, Eggs Machiavellian is very good for brunch.\"",
    "ins": "Heat a large skillet over high heat. Once hot, lie the watermelon into the pan with the rind along the edge of the pan, leaving one half the the cooking surface free.\nCrack eggs into the free space in the skillet. Top the eggs with 1/4 of the Parmesan cheese. Cook until the egg white begins to solidify on the bottom, 1 to 2 minutes. Begin folding the solid egg white over the translucent egg white. Continue cooking until the egg can be tilted with the edge of a spatula without the top part of it sliding away from the cooked egg white and is lightly crisped on the bottom, about 2 minutes more.  Flip both the eggs and the watermelon pieces; sprinkle another 1/4 of the Parmesan cheese over the eggs and another 1/4 of the Parmesan over the watermelon pieces. Continue cooking until the egg whites are crisp on the underside, but the yolk remains soft when pressed lightly with the back of a spatula, 1 to 2 minutes. Remove eggs to a plate.\nContinue cooking watermelon until darkened on the underside, about 1 minute more. Flip watermelon pieces again, top with remaining Parmesan cheese, and remove to the plate with the eggs.\nSear ham slices in any remaining liquid in the skillet just until lightly browned and heated through, 1 to 2 minutes per side. Transfer to the plate next to the watermelon and eggs.",
    "pt": "5 m",
    "ct": "10 m",
    "tt": "15 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}