{
    "id": 242235,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/8 cups finely crushed graham cracker crumbs",
        "3 1/2 tablespoons unsalted butter, melted",
        "7 ounces cream cheese, at room temperature",
        "6 tablespoons white sugar",
        "1 teaspoon white sugar",
        "7 ounces mascarpone cheese",
        "3 tablespoons matcha green tea powder, plus more for dusting",
        "1 cup heavy whipping cream",
        "1 tablespoon unflavored gelatin",
        "3 tablespoons warm water",
        "1 teaspoon confectioners' sugar for dusting (optional)",
        "3 strawberries, sliced"
    ],
    "nut": [
        "Calories > 578 kcal",
        "Carbs > 29 g",
        "Cholesterol > 149 mg",
        "Fat > 49.8 g",
        "Protein > 7.3 g",
        "Sodium > 228 mg"
    ],
    "n": "Green Tea (Matcha) Tiramisu",
    "a": "Miho",
    "r": "0",
    "s": 6,
    "des": "\"I'd like to share Japanese desserts.\n This recipe is no bake; just mix all ingredients and sit it in refrigerator and so easy to make. Enjoy my favorite recipe!\"",
    "ins": "Stir graham cracker crumbs and melted butter together in a bowl until moistened; press crumb mixture evenly into the bottom of a 7-inch round springform pan. Place pan in refrigerator until cold, about 20 minutes.\nBeat cream cheese and 6 tablespoons plus 1 teaspoon sugar together in a bowl with an electric mixer until smooth; beat in mascarpone cheese. Stir 3 tablespoons green tea powder into cheese mixture.\nBeat cream in a chilled glass or metal bowl with an electric mixer until soft peaks form. Fold whipped cream into cream cheese mixture.\nStir gelatin into warm water in a small bowl until dissolved. Stir gelatin mixture into cream cheese mixture; pour mixture over refrigerated graham cracker crust. Chill in the refrigerator until firm, at least 4 hours.\nDust top of tiramisu with green tea powder and confectioners' sugar; decorate with sliced strawberries.",
    "pt": "15 m",
    "ct": "",
    "tt": "",
    "i": "3491106.jpg",
    "o": "",
    "st": "allrecipes"
}