{
    "id": 242274,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cooking spray (such as PamÂ®)",
        "2 tablespoons olive oil, divided",
        "2 large onions, cut into 1/2-inch dice",
        "4 cloves garlic, or more to taste, minced",
        "8 chicken thighs, or more to taste, trimmed",
        "2 cups dry white wine",
        "2 (6.5 ounce) cans tomato sauce",
        "1/2 teaspoon ground black pepper",
        "1 lemon, juiced",
        "1 drop hot pepper sauce (such as TabascoÂ®)",
        "1 pinch ground cinnamon"
    ],
    "nut": [
        "Calories > 383 kcal",
        "Carbs > 11.1 g",
        "Cholesterol > 86 mg",
        "Fat > 19.7 g",
        "Protein > 25.3 g",
        "Sodium > 402 mg"
    ],
    "n": "Greek Stew",
    "a": "Craig Chandler",
    "r": "0",
    "s": 6,
    "des": "\"I'm not sure how 'Greek' this is. However, my father made this, his parents came from Cephalonia, and he called it 'Greek stew.' \nAs with many such recipes, the leftovers are even better a day or two later.\"",
    "ins": "Prepare a Dutch oven or large pot with cooking spray. Heat 1 tablespoon olive oil in Dutch oven over medium heat. Cook and stir onion and garlic in hot oil until onion soft and translucent, about 5 minutes. Remove onion mixture to a bowl.\nHeat remaining olive oil in the pot again over medium heat. Cook chicken in hot oil, turning a few times, until browned, about 5 minutes.\nPour wine over the chicken; bring to a simmer and cook until chicken is no longer pink in the center, about 15 minutes.\nStir onion mixture, tomato sauce, black pepper, lemon juice, hot pepper sauce, and cinnamon with the simmering chicken; bring to a boil, reduce heat to low, place a cover on the pot, and cook at a simmer until the chicken is easily pulled apart, about 1 hour.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "2231607.jpg",
    "o": "",
    "st": "allrecipes"
}