{
    "id": 242239,
    "old_rating": "4.44444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 (12 ounce) package bacon",
        "1 teaspoon butter, or as desired",
        "1 (20 ounce) package frozen cubed hash brown potatoes",
        "salt and ground black pepper to taste",
        "1 (12 ounce) package sliced fresh mushrooms",
        "3 green onions, minced",
        "2 cups shredded Cheddar cheese, divided",
        "10 eggs",
        "2 cups milk",
        "1 teaspoon salt"
    ],
    "nut": [
        "Calories > 511 kcal",
        "Carbs > 24.4 g",
        "Cholesterol > 378 mg",
        "Fat > 31.7 g",
        "Protein > 33.3 g",
        "Sodium > 1258 mg"
    ],
    "n": "Cindy's Breakfast Casserole",
    "a": "Cindy in Pensacola",
    "r": "0",
    "s": 6,
    "des": "\"The best breakfast casserole I've ever made. I combine a few different recipes and this is my picky hubby's most favorite!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Spray a 9x13-inch baking dish with cooking spray. Arrange bacon slices in a single layer on a baking sheet.\nBake in the preheated oven until browned and crisp, 20 to 25 minutes. Drain bacon slices on paper towels and transfer 1 to 2 tablespoons bacon grease to a skillet, reserving the remaining bacon grease. Add butter to skillet.\nCook and stir potatoes in the hot bacon grease-butter until lightly browned, about 10 minutes; season with salt and black pepper. Transfer potatoes to the prepared baking dish.\nHeat about 1 tablespoon reserved bacon grease in the skillet over medium heat; cook and stir mushrooms until softened, 5 to 10 minutes. Layer mushrooms over potatoes.\nPlace green onions in the same skillet and remove from heat. Allow green onions to soften from the residual heat in skillet; layer over mushrooms. Crumble bacon over green onion layer; top with 1 cup Cheddar cheese.\nBlend eggs, milk, and 1 teaspoon salt in a blender until smooth; pour over Cheddar cheese layer. Top casserole with remaining 1 cup Cheddar cheese.\nBake in the preheated oven until casserole is set and a knife inserted in the middle comes out clean, 30 to 40 minutes.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "2346240.jpg",
    "o": "4517153.jpg,4461373.jpg,4149950.jpg,3692049.jpg,3589252.jpg,3589251.jpg",
    "st": "allrecipes"
}