{
    "id": 242268,
    "old_rating": "4.35714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 ounces gluten-free elbow pasta",
        "1/4 cup butter",
        "1 1/4 teaspoons salt",
        "3/4 teaspoon mustard powder",
        "4 cups milk",
        "1/4 cup cornstarch",
        "4 cups shredded Cheddar cheese, divided",
        "Topping:",
        "2 gluten-free bread slices, toasted and broken into crumbs (optional)",
        "1 teaspoon butter, softened (optional)",
        "1/2 teaspoon paprika (optional)"
    ],
    "nut": [
        "Calories > 521 kcal",
        "Carbs > 42.6 g",
        "Cholesterol > 86 mg",
        "Fat > 29.8 g",
        "Protein > 21 g",
        "Sodium > 809 mg"
    ],
    "n": "Easy Gluten-Free Macaroni and Cheese",
    "a": "kokodiablo",
    "r": "0",
    "s": 8,
    "des": "\"Cheesy gluten-free deliciousness that is super easy to make. Kid-approved!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain.\nMelt 1/4 cup butter in a saucepan over medium heat. Stir salt and mustard powder into melted butter and remove saucepan from heat.\nWhisk milk and cornstarch together in a bowl until smooth; stir into butter mixture until well blended. Return saucepan to stove; cook milk mixture, stirring constantly, over medium heat until sauce is thickened, about 5 minutes. Remove saucepan from heat.\nStir 3 cups Cheddar cheese into sauce until heat from sauce melts cheese. Add pasta to cheese sauce and stir well; pour into the prepared baking dish.\nCombine remaining 1 cup Cheddar cheese, gluten-free bread crumbs, 1 teaspoon butter, and paprika in a bowl; sprinkle over pasta mixture.\nBake in the preheated oven until top is crunchy, about 30 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "2285304.jpg",
    "o": "",
    "st": "allrecipes"
}