{
    "id": 242212,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cucumber Wasabi Dip:",
        "1/2 cup ranch dressing",
        "1/4 cup peeled, seeded, and minced cucumber",
        "1 tablespoon whole milk",
        "1 1/2 teaspoons prepared horseradish",
        "1 teaspoon white vinegar",
        "1 teaspoon Japanese wasabi powder",
        "1/8 teaspoon salt",
        "1 pinch cayenne pepper, or more to taste",
        "Green Bean Fries:",
        "2 cups water",
        "2 cups chicken broth",
        "8 ounces fresh green beans, trimmed",
        "1 egg, beaten",
        "1 tablespoon whole milk, or more as needed",
        "1/2 cup plain bread crumbs",
        "1/2 cup crushed French-fried onions",
        "3/4 teaspoon salt",
        "1/2 teaspoon onion powder",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon garlic powder",
        "1 cup all-purpose flour",
        "8 cups vegetable oil for frying"
    ],
    "nut": [
        "Calories > 468 kcal",
        "Carbs > 26.5 g",
        "Cholesterol > 29 mg",
        "Fat > 38.2 g",
        "Protein > 4.5 g",
        "Sodium > 825 mg"
    ],
    "n": "Green Bean Fries with Cucumber Wasabi Dip",
    "a": "KitchenWitch",
    "r": "0",
    "s": 8,
    "des": "\"This recipe has been tweaked many times over the years and is a great hit.  The cucumber wasabi dipping sauce is fantastic!  Even the kids love them and good luck getting them to eat plain green beans!\"",
    "ins": "Blend ranch dressing, cucumber, 1 tablespoon milk, horseradish, vinegar, wasabi powder, 1/8 teaspoon salt, and cayenne pepper together in a food processor until dip is smooth. Transfer dip to a bowl, cover, and refrigerate until chilled, at least 30 minutes.\nBring water and chicken broth to a boil; add green beans and cook until slightly tender, about 10 minutes. Drain.\nWhisk egg and 1 tablespoon milk together in a bowl. Combine bread crumbs, French-fried onions, 3/4 teaspoon salt, onion powder, black pepper, and garlic powder together in a separate bowl. Place flour in a third bowl.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nPress green beans in flour until evenly coated. Dip coated green beans in egg-milk mixture, allowing excess liquid to drip back into bowl. Transfer green beans to bread crumbs mixture and press to coat, shaking off excess. Arrange coated beans in 1 layer on a plate or in a colander.\nWorking in batches, fry coated green beans in the hot oil until crisp, about 1 minute 30 seconds. Transfer green bean fries to a paper towel-lined colander using a slotted spoon. Serve green bean fries with dip.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "1 h",
    "i": "2387774.jpg",
    "o": "",
    "st": "allrecipes"
}