{
    "id": 242344,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 cups water",
        "1 (16 ounce) package yellow rice",
        "5 tablespoons olive oil, divided (optional)",
        "1 pound boneless chicken, cut into 3/4-inch cubes",
        "1 (1 ounce) package chicken taco seasoning mix",
        "1 (16 ounce) can black beans, rinsed and drained",
        "1 1/2 cups shredded Mexican cheese blend",
        "1 (4 ounce) can sliced olives",
        "1 jalapeno pepper, seeded and minced",
        "12 corn tortillas",
        "1 tablespoon bacon grease"
    ],
    "nut": [
        "Calories > 403 kcal",
        "Carbs > 49.3 g",
        "Cholesterol > 39 mg",
        "Fat > 14.9 g",
        "Protein > 18.8 g",
        "Sodium > 1049 mg"
    ],
    "n": "Easy Tex-Mex Chicken Tacos",
    "a": "yummers",
    "r": "0",
    "s": 12,
    "des": "\"Quick and full of flavor, you can adjust heat by removing the seeds from jalapeno. Garnish tacos with chipotle ranch, salsa verde, and avocado. I make the chipotle ranch with fat free sour cream to save a bit of calories.\"",
    "ins": "Bring water to a boil in a saucepan; add rice and 1/4 cup olive oil. Bring liquid back to a boil, reduce heat to medium-low, cover saucepan, and simmer until rice is tender, 20 to 25 minutes.\nHeat 1 tablespoon olive oil in a skillet over medium heat; cook and stir chicken and taco seasoning mix until chicken is no longer pink in the center, 5 to 10 minutes. Mix rice, black beans, Mexican cheese blend, olives, and jalapeno pepper into chicken; cook and stir until heated through, about 5 minutes.\nHeat a separate skillet over medium-high heat; warm tortillas in skillet until pliable, 1 to 2 minutes per tortilla.\nFill each tortilla with about 1/2 cup chicken-rice mixture, folding tortilla over filling.\nHeat bacon grease in a skillet over medium heat; fry the filled tortillas until crispy, 2 to 3 minutes per side.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "2895992.jpg",
    "o": "",
    "st": "allrecipes"
}