{
    "id": 242372,
    "old_rating": "4.69231",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Dry Rub:",
        "1/4 cup dark brown sugar",
        "3 tablespoons paprika",
        "1 tablespoon dry mustard",
        "1 tablespoon sea salt",
        "1 1/2 teaspoons granulated garlic powder",
        "1 1/2 teaspoons onion powder",
        "1/2 teaspoon ground coriander",
        "2 racks SmithfieldÂ® Extra Tender St. Louis Pork Spareribs, membrane removed",
        "Vegetable oil",
        "Handful hickory or apple wood chips for smoking, soaked in water and drained (optional)",
        "3/4 cup apple juice, in a spray bottle (optional)"
    ],
    "nut": [
        "Calories > 1098 kcal",
        "Carbs > 23.8 g",
        "Cholesterol > 276 mg",
        "Fat > 85.2 g",
        "Protein > 56.6 g",
        "Sodium > 1583 mg"
    ],
    "n": "Traditional Rub for St. Louis Ribs",
    "a": "SmithfieldÂ®",
    "r": "0",
    "s": 4,
    "des": "\"A brown sugar, paprika, dry mustard, and coriander make a savory dry rub for these slowly grilled, tender St. Louis-style spareribs.\"",
    "ins": "About one hour before smoking, make the dry rub. Combine sugar, paprika, mustard, salt, garlic, onion powder and coriander in small bowl; mix well. Coat both sides of ribs with a little vegetable oil and sprinkle with seasoning rub. Set aside at room temperature for 1 hour.\nHeat charcoal or gas grill for indirect cooking at 230 to 250 degrees F. Add drained wood chips, if using.\nPlace the ribs, meaty side down, over a drip pan and cook for 2 hours. If desired, spray both sides of ribs with apple juice.  Add about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.\nRemove ribs from grill.  Double-wrap each rack in heavy-duty aluminum foil. Return wrapped ribs to the grill and cook for 1 1/2  to 3 hours more over indirect heat, until very tender. Add more coals as needed to maintain temperature for a charcoal grill.",
    "pt": "10 m",
    "ct": "3 h ",
    "tt": "4 h ",
    "i": "2267453.jpg",
    "o": "2386515.jpg,2386513.jpg,2360830.jpg,2348994.jpg,2335876.jpg,2331511.jpg",
    "st": "allrecipes"
}