{
    "id": 242390,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups grated yellow squash",
        "1/2 cup honey",
        "1/2 cup blueberry syrup (such as Stonewall KitchenÂ® Wild Maine)",
        "1/2 cup vegetable oil",
        "1 egg",
        "1/2 teaspoon vanilla extract",
        "1 cup all-purpose flour",
        "1/2 cup whole wheat flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/2 cup blueberries",
        "1/2 cup chopped walnuts"
    ],
    "nut": [
        "Calories > 242 kcal",
        "Carbs > 30.2 g",
        "Cholesterol > 16 mg",
        "Fat > 12.9 g",
        "Protein > 3.3 g",
        "Sodium > 231 mg"
    ],
    "n": "Blueberry Summer Squash Bread",
    "a": "HannahRose",
    "r": "0",
    "s": 12,
    "des": "\"I started this bread because I needed to bake something to bring as a gift to someone's house and quickly found that my ingredients were limited to a few summertime fruits and veggies and not much else. As such, I improvised and changed a few things around from a zucchini bread recipe and created this healthy, hearty, summertime bread. It has a slightly different flavor than zucchini bread but the same moist consistency and sweet, summery taste and smell. Note: it is not very sweet and does taste 'healthy', so it's probably not a big hit for kids unless chocolate chips are added.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5-inch bread pan.\nWhisk squash, honey, blueberry syrup, oil, egg, and vanilla extract together in a bowl. Mix all-purpose flour, whole wheat flour, baking soda, baking powder, and salt together in a separate bowl; add blueberries and walnuts. Stir flour mixture into squash mixture just until combined; pour into prepared bread pan.\nBake in the preheated oven until the top is brown and a toothpick inserted in the center comes out clean, about 1 hour.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "2446390.jpg",
    "o": "",
    "st": "allrecipes"
}