{
    "id": 242374,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Dry Rub:",
        "1/4 cup light brown sugar",
        "4 teaspoons garlic powder",
        "1 tablespoon chili powder",
        "2 teaspoons kosher salt",
        "2 teaspoons black pepper",
        "Sauce:",
        "1/2 cup honey",
        "1/2 cup light molasses",
        "1/2 cup balsamic vinegar",
        "2 tablespoons canola oil",
        "2 tablespoons whole grain Dijon mustard",
        "2 teaspoons black pepper",
        "2 teaspoons orange zest",
        "2 racks SmithfieldÂ® Extra Tender Pork Spareribs, membrane removed",
        "Handful hickory or apple wood chips for smoking, soaked in water and drained (optional)",
        "3/4 cup apple juice, in a spray bottle"
    ],
    "nut": [
        "Calories > 2932 kcal",
        "Carbs > 90.8 g",
        "Cholesterol > 727 mg",
        "Fat > 220.2 g",
        "Protein > 141.8 g",
        "Sodium > 1934 mg"
    ],
    "n": "Sticky Molasses Spareribs",
    "a": "SmithfieldÂ®",
    "r": "0",
    "s": 4,
    "des": "\"Make these delicious sticky honey-molasses spareribs as spicy as you like with more cayenne pepper in the dry rub.\"",
    "ins": "About one hour before smoking, make the dry rub.  Combine all ingredients in small bowl; mix well.   Pat ribs dry with paper towels; generously coat both sides of ribs with rub.  Set aside at room temperature for 1 hour.\nMeanwhile, make the sauce.  Combine all ingredients in medium saucepan; bring to a boil over medium-high heat.  Reduce heat and simmer 10 minutes until slightly thickened, stirring frequently.  Cool to room temperature; cover and refrigerate.\nHeat charcoal or gas grill for indirect cooking at 250 to 300 degrees F. Add drained wood chips, if using.\nPlace the ribs, meaty side up, over a drip pan and cook for 2 hours.  Add about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.\nContinue cooking ribs for 1 to 2 hours more over indirect heat, until very tender, spraying with apple juice every 20 to 30 minutes.  Add more coals as needed to maintain temperature for a charcoal grill.\nPlace ribs over direct heat on grill and brush with sauce.  Cook for about 5 minutes until the sauce is set. Turn ribs and repeat with more sauce.\nServe ribs with remaining sauce.",
    "pt": "10 m",
    "ct": "3 h",
    "tt": "4 h ",
    "i": "2254296.jpg",
    "o": "",
    "st": "allrecipes"
}