{
    "id": 242351,
    "old_rating": "4.84615",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 large leek (white part only), chopped",
        "1 teaspoon salt, divided, or as needed",
        "1 jalapeno pepper, seeded and diced",
        "1 1/2 cups (1/2-inch) sliced zucchini",
        "1 1/2 cups (1/2-inch) pieces asparagus",
        "1 cup baby spinach",
        "1 1/2 cups sliced cooked potatoes",
        "12 large eggs",
        "1 pinch cayenne pepper",
        "1/2 teaspoon freshly ground black pepper",
        "4 ounces crumbled goat-milk feta cheese, divided"
    ],
    "nut": [
        "Calories > 315 kcal",
        "Carbs > 19.2 g",
        "Cholesterol > 389 mg",
        "Fat > 18.7 g",
        "Protein > 18.3 g",
        "Sodium > 765 mg"
    ],
    "n": "Spring Vegetable Frittata for Mother",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"It always feels a little wrong making a frittata with freshly cooked vegetables, since the whole point of the dish is to use up leftovers, but seeing as we're making this for a Mother's Day brunch special, we'll make an exception. Make sure all your vegetables are tender, hot, and well seasoned before adding your eggs, and not a lot can go wrong.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat oil in heavy 10-inch skillet over medium heat. Cook leek with a pinch of salt, stirring occasionally, until leeks soften and start to turn translucent, 5 to 6 minutes. Add jalapeno and zucchini; season with pinch of salt. Cook until zucchini start to get tender and pale green, about 5 minutes. Add asparagus and cook until bright green, about 1 minute. Add spinach and another pinch of salt, cooking until wilted, 1 minute. Stir in cooked potatoes and heat through, about 5 minutes.\nCrack 12 large eggs into a bowl. Add cayenne, salt, and pepper. Whisk for at least 30 seconds. Pour eggs into over vegetables in skillet over medium heat. Add 3 ounces of crumbled goat cheese; stir lightly until evenly distributed. Top with remaining cheese. Remove from heat.\nBake in preheated oven until eggs are set, 12 to 15 minutes. When nearly set, turn on broiler. Broil frittata until top browns, 1 to 2 minutes. Cool slightly; serve warm.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "4518436.jpg",
    "o": "4518436.jpg,4518435.jpg,4514741.jpg,4514740.jpg,4508451.jpg,3607223.jpg",
    "st": "allrecipes"
}