{
    "id": 242368,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Dry Rub:",
        "1/2 cup light brown sugar, divided",
        "4 teaspoons granulated garlic powder",
        "1 tablespoon chili powder",
        "2 teaspoons kosher salt",
        "1 1/2 teaspoons black pepper, divided",
        "3/4 teaspoon ground cayenne pepper, divided",
        "1/4 teaspoon ground coriander seeds",
        "2 racks SmithfieldÂ® Extra Tender St. Louis Pork Spareribs, membrane removed",
        "1/2 cup apple cider vinegar",
        "1/2 cup honey",
        "6 tablespoons ketchup",
        "1 tablespoon paprika",
        "2 teaspoons fine sea salt",
        "Handful hickory or apple wood chips for smoking, soaked in water and drained (optional)",
        "3/4 cup apple juice, in a spray bottle"
    ],
    "nut": [
        "Calories > 820 kcal",
        "Carbs > 45.9 g",
        "Cholesterol > 184 mg",
        "Fat > 54 g",
        "Protein > 37.7 g",
        "Sodium > 1585 mg"
    ],
    "n": "\"515\" Southern-Style St. Louis Ribs",
    "a": "SmithfieldÂ®",
    "r": "0",
    "s": 6,
    "des": "\"Cayenne pepper supplies the heat; brown sugar and honey impart a sweet counterbalance in these tender, southern-style grilled ribs.\"",
    "ins": "About one hour before smoking, make the dry rub.  Combine 1/4 cup brown sugar, garlic, chili powder, kosher salt, 1 teaspoon black pepper, 1/2 teaspoon cayenne and coriander in a small bowl. Pat ribs dry with paper towels; sprinkle both sides of each rack with the rub. Set aside at room temperature for 1 hour.\nHeat charcoal or gas grill for indirect cooking at 250 degrees F. to 300 degrees F. Add drained wood chips, if using.\nPlace the ribs, meaty side up, over a drip pan and cook 2 hours.  Add about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.\nMeanwhile, to make the sauce, combine vinegar, honey, ketchup, remaining 1/4 cup brown sugar, paprika, sea salt, remaining 1/2 teaspoon pepper and 1/4 teaspoon cayenne in a medium saucepan over medium heat. Bring to a boil; reduce heat and simmer 15 minutes, stirring frequently, until lightly thickened. Set aside to cool to room temperature, then refrigerate.\nContinue cooking ribs 1 to 2 more hours until very tender, spraying on both sides with apple juice every 20 to 30 minutes.\nBrush ribs with sauce; continue cooking for about 5 minutes, until the sauce is set. Turn ribs and repeat with more sauce.\nCut the racks into 3- or 4-rib sections and serve. Pass any remaining sauce at the table.",
    "pt": "20 m",
    "ct": "4 h",
    "tt": "5 h ",
    "i": "2254293.jpg",
    "o": "",
    "st": "allrecipes"
}