{
    "id": 242455,
    "old_rating": "4.9",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons white sugar",
        "3/4 teaspoon active dry yeast",
        "1 cup warm water (105 to115 degrees F/40 to 45 degrees C)",
        "1 tablespoon warm water (105 to115 degrees F/40 to 45 degrees C)",
        "3 cups bread flour",
        "1 1/2 teaspoons salt",
        "2 tablespoons butter, melted",
        "2 tablespoons butter, melted",
        "1/2 teaspoon garlic salt"
    ],
    "nut": [
        "Calories > 250 kcal",
        "Carbs > 40.6 g",
        "Cholesterol > 15 mg",
        "Fat > 6.6 g",
        "Protein > 6.4 g",
        "Sodium > 592 mg"
    ],
    "n": "Super Fluffy Bread Sticks",
    "a": "luckoftheIrish",
    "r": "0",
    "s": 8,
    "des": "\"Just as good if not better than the Olive Garden'sÂ®! We absolutely love these! Fun to make and eat!\"",
    "ins": "Dissolve sugar and yeast in 1 cup plus 1 tablespoon warm water in a bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes.\nCombine flour and salt in the bowl of a stand mixer fitted with the paddle attachment. Mix 2 tablespoons butter into flour mixture until incorporated. Pour yeast mixture into flour mixture and knead dough using the dough hook attachment until smooth and elastic, about 10 minutes.\nPlace dough in a container and cover container with a towel or plastic wrap; let stand until doubled in size, 1 to 1 1/2 hours.\nLine a baking sheet with parchment paper.\nDivide dough into 2-ounce portions and roll into 7-inch long sticks. Arrange sticks on the prepared baking sheet; cover with plastic wrap and let stand until dough doubles in size, 1 to 1 1/2 hours.\nPreheat oven to 400 degrees F (200 degrees C). Remove plastic wrap from dough.\nBake in the preheated oven until breadsticks are golden brown, 10 to 12 minutes. Brush each breadstick using 2 tablespoons melted butter; top with garlic salt.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "2 h ",
    "i": "4459529.jpg",
    "o": "",
    "st": "allrecipes"
}