{
    "id": 242442,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Reynolds WrapÂ® Heavy Duty Aluminum Foil",
        "1 large orange",
        "1 3/4 cups crushed vanilla wafers",
        "1/4 cup finely chopped pecans (optional)",
        "1 tablespoon sugar",
        "1/2 cup butter, melted",
        "3 (8 ounce) packages cream cheese, softened",
        "3/4 cup sugar",
        "2 tablespoons all-purpose flour",
        "3 eggs, lightly beaten",
        "3 ounces white baking chocolate, chopped",
        "Cranberry Orange Sauce:",
        "1 cup fresh cranberries, coarsely chopped",
        "1/4 cup granulated sugar",
        "2 tablespoons orange juice"
    ],
    "nut": [
        "Calories > 544 kcal",
        "Carbs > 46.5 g",
        "Cholesterol > 130 mg",
        "Fat > 37.5 g",
        "Protein > 8 g",
        "Sodium > 325 mg"
    ],
    "n": "Orange Citrus Cheesecake",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 12,
    "des": "\"Creamy cheesecake flavored with bright orange zest is topped with a sauce made of fresh cranberries and orange juice.\"",
    "ins": "Preheat oven to 350 degrees F. Line the outside of a 9-inch springform pan with a double layer of 18-inch-wide Reynolds Wrap(R) Heavy Duty Aluminum Foil. Bring edges of the foil up and mold the foil around the sides of the springform pan to form a watertight seal outside of the pan.\nZest 1 teaspoon orange zest from the orange. Juice 1/4 cup orange juice from the orange set both aside.\nCombine vanilla wafers, pecans (if using), and 1 tablespoon granulated sugar in a medium bowl. Stir in melted butter. Press the mixture onto the bottom and about 1 1/2 inches up the sides of the prepared springform pan. Place in a roasting pan.\nBeat cream cheese, 3/4 cup granulated sugar, flour, and orange zest together in a large bowl using an electric mixer on low speed until combined. Add orange juice and beat until smooth. Beat in eggs and white chocolate.\nPour filling into crust-lined pan. Place roasting pan on the oven rack. Pour enough boiling water into roasting pan to reach halfway up the sides of the springform pan.\nBake 1 hour or until top is just set and edges jiggle slightly when pan is gently shaken. Turn oven off and allow cheesecake to stand in oven for 1 hour (it will continue to set up during standing time in oven).\nRemove springform pan from water bath and cool on a wire rack for 15 minutes. Using a small sharp knife, loosen the crust from sides of the springform pan cool for 30 minutes. Remove sides of springform pan cool cheesecake on wire rack for 2 hours.\nCover and chill for at least 4 hours before serving. Top with Cranberry Orange Sauce to serve.\nCranberry Orange Sauce: Combine 1 cup fresh cranberries, coarsely chopped 1/4 cup granulated sugar and 2 tablespoons orange juice in a small saucepan over medium heat. Bring to a simmer and cook, stirring frequently, until the sugar is dissolved and the cranberries start to break down. Remove from heat and cool completely before serving.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "9 h ",
    "i": "2285240.jpg",
    "o": "",
    "st": "allrecipes"
}