{
    "id": 242465,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 pounds ground chicken",
        "2 teaspoons salt, divided",
        "2 teaspoons ground black pepper, divided",
        "1/2 teaspoon dry mustard",
        "1/2 teaspoon paprika",
        "1/2 teaspoon dried oregano",
        "2 cups King Arthur Almond Flour",
        "1/4 cup cornstarch",
        "1/4 cup water",
        "2 tablespoons olive oil"
    ],
    "nut": [
        "Calories > 164 kcal",
        "Carbs > 5 g",
        "Cholesterol > 23 mg",
        "Fat > 11.1 g",
        "Protein > 11.8 g",
        "Sodium > 333 mg"
    ],
    "n": "Gluten-Free Almond Flour Chicken Nuggets",
    "a": "King Arthur Flour",
    "r": "0",
    "s": 15,
    "des": "\"Remake a not-so-healthy classic and give it a playful, nutritious twist! We use our almond flour as the coating and bake these chicken nuggets until crispy - you'll get that satisfying crunch, without the fryer.\"",
    "ins": "Preheat the oven to 375 degrees F. Place an oven-safe wire rack on top of a baking sheet and set aside.\nIn a large mixing bowl, combine the chicken, 1 teaspoon each salt and pepper, and the additional spices. Mix until fully combined, and set aside.\nIn a separate bowl, whisk together the almond flour and remaining salt and pepper. Set this bowl aside as well.\nIn a third bowl, whisk together the cornstarch and cold water to form a slurry.\nWith wet hands, take about 2 tablespoons of chicken and shape it into a small disk. Coat first in almond flour, then dip in the cornstarch slurry, then coat again in almond flour and transfer to the wire rack (which is on top of your baking sheet).\nRepeat this process until no chicken remains.\nHeat the 2 tablespoons olive oil in a non-stick skillet. When hot, add half the chicken nuggets to the pan. Cook for about 1 minute, until the bottoms begin to brown. Flip and cook for another minute to brown the other side. Transfer the nuggets back to the wire rack.\nRepeat this cooking process until all the nuggets are browned.\nPlace the entire baking sheet (with the wire rack on top) on the oven's center rack and bake for 10 minutes.\nRemove the nuggets from the oven, flip them over on the rack, and let them cool.\nServe with your favorite dipping sauce. Enjoy!",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "35 m",
    "i": "2277536.jpg",
    "o": "",
    "st": "allrecipes"
}