{
    "id": 242477,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 acorn squash - cut in half lengthwise, seeded and cut into 12 wedges",
        "1 large fennel bulb - trimmed, cored and cut into 8 pieces",
        "2 tablespoons extra-virgin olive oil",
        "2 tablespoons balsamic vinegar",
        "3 cloves garlic, minced",
        "1 tablespoon chopped fresh rosemary",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 (6 ounce) box UNCLE BEN'SÂ® Basmati Medley Savory Herb",
        "2 teaspoons chopped fresh parsley"
    ],
    "nut": [
        "Calories > 152 kcal",
        "Carbs > 27.7 g",
        "Cholesterol > 0 mg",
        "Fat > 3.8 g",
        "Protein > 3.2 g",
        "Sodium > 409 mg"
    ],
    "n": "Balsamic Roasted Fennel and Acorn Squash Rice Casserole",
    "a": "Kim's Cooking Now!",
    "r": "0",
    "s": 8,
    "des": "\"Roasting tones down the licorice flavor of the fennel, while enhancing the sweetness of the acorn squash. Combine those flavors with a hint of balsamic vinegar and UNCLE BEN'SÂ® Basmati Medley Savory Herb rice, and you have yourself a great side dish to any meal.\"",
    "ins": "Preheat oven to 400 degrees and line a baking sheet with parchment paper or non-stick foil.\nRemove the skin from the squash with a vegetable peeler (if desired). Cut each wedge in half and place in a large bowl along with the fennel pieces.\nWhisk the olive oil, balsamic vinegar, garlic, rosemary, salt, and pepper together in a small bowl. Drizzle mixture over the squash and fennel; toss to coat. Transfer squash and fennel mixture onto the prepared baking sheet and spread out to form a single layer.\nRoast until squash is tender, about 45 minutes, stirring every 15 minutes.\nMeanwhile, prepare the rice as directed on the box. Mix the roasted squash and fennel with the rice. Transfer to a greased casserole dish. Top with the chopped parsley and keep warm until ready to serve.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "2315869.jpg",
    "o": "",
    "st": "allrecipes"
}