{
    "id": 242440,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "10 large or jumbo raw shrimp, peeled and deveined (tails left on)",
        "1/4 cup finely chopped fresh cilantro",
        "2 tablespoons lime juice",
        "1 teaspoon ground black pepper, or more to taste",
        "1 teaspoon sea salt, or more to taste",
        "3 tablespoons barbeque sauce, or more as desired",
        "Reynolds WrapÂ® Heavy Duty Aluminum Foil",
        "Citrus Corn Salad:",
        "1 (16 ounce) package frozen corn",
        "1/2 cup chopped fresh cilantro",
        "1 cup thinly sliced celery",
        "1/2 cup diced red bell pepper",
        "1/4 cup diced red onion",
        "1 cup halved grape tomatoes",
        "4 tablespoons lime juice, or more to taste",
        "1 teaspoon apple cider vinegar, or more to taste",
        "1 teaspoon sea salt, or more to taste",
        "1 teaspoon ground black pepper, or more to taste"
    ],
    "nut": [
        "Calories > 152 kcal",
        "Carbs > 28.2 g",
        "Cholesterol > 64 mg",
        "Fat > 1.3 g",
        "Protein > 10.5 g",
        "Sodium > 912 mg"
    ],
    "n": "Grilled BBQ Shrimp with Citrus Corn Salad",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 5,
    "des": "\"Marinated shrimp grilled in foil packets with barbeque sauce are served with a colorful and refreshing citrus corn salad.\"",
    "ins": "Set grill to medium heat.\nClean and remove shell from shrimp (leaving tail on).\nIn plastic container or bag add shrimp, cilantro, lime juice, ground black pepper and sea salt, place in refrigerator and allow to marinate for minimum of 30 minutes (overnight will give the best flavor).\nPlace marinated shrimp on sheet of Reynolds Wrap(R) Heavy Duty Foil, pour BBQ sauce over shrimp, fold aluminum foil up and fold over twice; fold each end. Leave enough room for air to circulate in packet.\nPlace packet on grill and allow to cook 6 to 8 minutes.\nCitrus Corn Salad: In a large skillet over medium heat add corn and granulated sugar, allow to cook 8 to 10 minutes.\nAdd ice and water to large bowl to make ice bath and pour corn into ice bath, drain in colander, pour corn back into the bowl and add the cilantro, celery, red pepper, red onion, grape tomatoes, lime juice, apple cider vinegar, sea salt and ground black pepper and mix together to incorporate.",
    "pt": "5 m",
    "ct": "14 m",
    "tt": "45 m",
    "i": "2285244.jpg",
    "o": "",
    "st": "allrecipes"
}