{
    "id": 242467,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/4 cups King Arthur Almond Flour",
        "2 tablespoons King Arthur Coconut Flour",
        "1/2 teaspoon baking powder",
        "1 teaspoon dried Italian herbs (optional)",
        "1/2 teaspoon sea salt",
        "1/2 teaspoon ground black pepper",
        "3 large eggs",
        "2 tablespoons olive oil"
    ],
    "nut": [
        "Calories > 261 kcal",
        "Carbs > 7.9 g",
        "Cholesterol > 70 mg",
        "Fat > 22.8 g",
        "Protein > 9.6 g",
        "Sodium > 176 mg"
    ],
    "n": "Almond Flour Pizza Crust",
    "a": "King Arthur Flour",
    "r": "0",
    "s": 8,
    "des": "\"Making gluten-free pizza at home has never been easier. With this recipe we blend together our signature almond and coconuts flours for a thin, crisp crust that will hold up to all of your favorite toppings. Plus, the crust is also yeast-free, and comes together in less than 40 minutes.\"",
    "ins": "Preheat your oven to 350 degrees F. Get out a large rimmed baking sheet.\nWhisk together the dry ingredients in a large mixing bowl; set them aside.\nIn a separate bowl, beat together the eggs and oil until frothy.\nPour the wet ingredients into the dry ingredients and mix together to form a dough.\nShape the dough into a ball and transfer it to a parchment paper-lined work surface. Top with another piece of parchment paper and roll the dough about 1/4-inch thick. Remove the top piece of parchment paper and slide the crust, with its parchment, onto the prepared baking sheet.\nBake the crust for 15 to 20 minutes, until the edges have started to crisp and the crust has started to brown all over.\nTop the partially baked crust with your desired toppings, and return it to the oven. Bake for another 12 to 15 minutes, until any cheese has melted and the edges are golden brown.\nIf you like browned cheese, broil the pizza for 1 to 2 minutes after baking.\nRemove the pizza from the oven, and let it cool for a few minutes; 2 to 3 should work fine. Slice it with a pizza cutter, and top with a sprinkle of grated cheese before serving, if desired.",
    "pt": "14 m",
    "ct": "34 m",
    "tt": "50 m",
    "i": "2277537.jpg",
    "o": "",
    "st": "allrecipes"
}