{
    "id": 242482,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Coconut Lime Rice:",
        "1 teaspoon coconut oil",
        "1 1/2 cups UNCLE BEN'SÂ® Basmati Rice - cooks in 10 minutes",
        "2 (13.5 ounce) cans light coconut milk",
        "2 limes, zested and juiced",
        "salt to taste",
        "Roasted Corn, Jalapenos, & Chicken:",
        "4 corn or flour tortillas",
        "nonstick cooking spray",
        "2 jalapeno chile peppers",
        "1 (15.25 ounce) can whole kernel corn, well drained",
        "1 tablespoon canola oil, divided",
        "8 ounces skinless, boneless chicken breasts, cut into bite-size pieces",
        "2 tablespoons chili powder",
        "1 tablespoon ground cumin",
        "1 cup canned black beans, drained",
        "1 cup chopped fresh tomatoes",
        "1 avocado - peeled, pitted and diced (optional)",
        "4 tablespoons sour cream"
    ],
    "nut": [
        "Calories > 1054 kcal",
        "Carbs > 109.9 g",
        "Cholesterol > 39 mg",
        "Fat > 60.6 g",
        "Protein > 33.8 g",
        "Sodium > 718 mg"
    ],
    "n": "Coconut Lime Rice Bowl with Roasted Corn, Jalapenos, and Chicken",
    "a": "Uncle Ben's",
    "r": "0",
    "s": 4,
    "des": "\"This fusion dish takes flavors tortillas, roasted corn, and jalapenos from Mexico, coconut milk & lime from the Caribbean, and melds them into a delicious dish that will have you craving more.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Lightly spray a baking sheet with non-stick cooking spray.\nHeat coconut oil in a saucepan over medium heat. Cook and stir rice 1 minute. Add coconut milk and stir to combine. Increase heat and bring to a boil; reduce heat to low. Cover and cook 35 minutes. Cover; remove from heat. Let sit 10 minutes.\nFluff rice with a fork. Stir in the lime zest, lime juice, and salt to taste. Cover and keep warm.\nCut tortillas into 1/4-inch strips. Place strips on prepared baking sheet. Bake in preheated oven until crisp, about 30 minutes.\nTo char peppers, hold jalapeno pepper with tongs and hold over the flame of a gas stove or directly on the burner of an electric stove, turning about every 30 seconds. Continue until all sides are charred, about 5 minutes. Immediately place pepper in a small ziptop plastic bag and seal shut. Repeat with second pepper. Allow peppers to return to room temperature, 5 to 10 minutes. Remove the skin. Cut off stem, remove seeds (if desired), and dice.\nSpray nonstick skillet with cooking spray; place over medium-high heat. Cook and stir corn until it begins to brown, 1 to 3 minutes. Transfer corn to a bowl.\nHeat oil in the same skillet over medium-high heat. Add chicken, chili powder, and cumin. Cook and stir until chicken is no longer pink, 2 to 3 minutes. Stir in beans and corn and cook until heated through, about 5 minutes.\nPlace rice in the bottom of a bowl; top with chicken mixture, chopped tomatoes, and a dollop of sour cream. Serve with tortilla strips.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "2377865.jpg",
    "o": "",
    "st": "allrecipes"
}