{
    "id": 242500,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cupcakes:",
        "1 (18.25 ounce) box yellow cake mix (such as Betty CrockerÂ®)",
        "1 cup water",
        "3 eggs",
        "1/2 cup vegetable oil",
        "7 tablespoons strawberry jam",
        "Strawberry Topping:",
        "1 pound fresh strawberries, hulled and quartered",
        "3 tablespoons white sugar",
        "2 teaspoons lemon juice",
        "Whipped Cream:",
        "2 cups heavy whipping cream",
        "3 tablespoons confectioners' sugar",
        "1 tablespoon vanilla extract"
    ],
    "nut": [
        "Calories > 243 kcal",
        "Carbs > 25.3 g",
        "Cholesterol > 51 mg",
        "Fat > 15.1 g",
        "Protein > 2.3 g",
        "Sodium > 158 mg"
    ],
    "n": "Strawberry Shortcake Cupcakes",
    "a": "canmcg27",
    "r": "0",
    "s": 24,
    "des": "\"All the flavors of strawberry shortcake, in cupcake-form! Can be made even easier by prepping the day before a party. The final, assembled cupcakes can be stored in the fridge up to an hour before serving.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease 12 muffin cups or line with paper liners.\nBeat cake mix, water, eggs, and oil together in a bowl using an electric mixer on low speed for 30 seconds; increase speed to medium and beat until batter is smooth, about 2 minutes more. Spoon batter into the prepared muffin cups.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 12 to 17 minutes. Cool cupcakes in the tin for 5 minutes.\nStir strawberry jam in a bowl until it reaches a smooth and spreadable texture. Spread a thin layer of jam onto each cupcake. Refrigerate cupcakes until jam has set into the cake, 3 hours to overnight.\nMix strawberries, white sugar, and lemon juice together in a bowl until evenly combined; refrigerate until strawberries are slightly broken down, at least 3 hours.\nBeat cream, confectioners' sugar, and vanilla extract together in a bowl using an electric mixer until soft peaks form and whipped cream is light and fluffy.\nTop each cupcake with 3 or 4 slices strawberry and about 2 tablespoons whipped cream.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "3 h ",
    "i": "2505399.jpg",
    "o": "",
    "st": "allrecipes"
}