{
    "id": 244199,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 pounds lean ground beef",
        "1/4 pound ground pork",
        "4 teaspoons kosher salt",
        "1 tablespoon paprika",
        "2 teaspoons ground black pepper",
        "1 teaspoon granulated onion powder",
        "1 teaspoon granulated garlic",
        "1/2 teaspoon smoked paprika",
        "1/3 cup ice water",
        "4 hot dog buns, split and toasted"
    ],
    "nut": [
        "Calories > 461 kcal",
        "Carbs > 24 g",
        "Cholesterol > 111 mg",
        "Fat > 23.5 g",
        "Protein > 36.6 g",
        "Sodium > 2227 mg"
    ],
    "n": "Hot Dog Sausages",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"I wondered what would happen if I did a skewer-less kebab using the same ingredients that would typically go into a hotdog. This meaty mash-up came about thanks to some lamb kebab experiments. The firm texture of the kebab reminded me of a hot dog's 'snap.' The taste is actually closer to a bratwurst.\"",
    "ins": "Place ground beef, ground pork, salt, paprika, black pepper, granulated onion, granulated garlic, smoked paprika, and ice water in a bowl. Mix together with fingers until well blended and mixture is dense and solid, about 4 minutes. It's okay to overmix. Wrap dough in plastic; refrigerate at least 2 hours or overnight.\nPlace a sheet of plastic wrap on a work surface. Have a bowl of ice water nearby to keep your hands wet and cold. Place 1/4 of the mixture on the plastic wrap. Roughly shape meat into a thick roll and wrap with the plastic. Shape into a thinner roll about as long as a hot dog bun. You can unroll the plastic and \"fine tune\" the sausage shape after wetting your hands in ice water. Rewrap in plastic and place on a dish; repeat for the remaining sausages. Refrigerate until ready to cook.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nCarefully place sausages on grill and let them cook undisturbed for about 2 minutes to seal the bottom edge. Gently turn completely over to brown the opposite side; cook until brown, about 2 minutes. Brown all surfaces, turning carefully to avoid breaking the sausages, about 5 minutes more. Remove sausages from grill and serve on toasted hot dog buns.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}