{
    "id": 244188,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 ounce dried chipotle chile pepper",
        "1 ounce dried ancho chile pepper",
        "1/2 cup water",
        "1/2 red onion, cut into small chunks",
        "4 cloves garlic",
        "2 teaspoons sea salt",
        "1 teaspoon ground cumin",
        "1 teaspoon dried oregano",
        "1 teaspoon freshly ground black pepper",
        "2 tablespoons olive oil",
        "2 1/2 pounds skinless, boneless chicken thighs"
    ],
    "nut": [
        "Calories > 293 kcal",
        "Carbs > 5.8 g",
        "Cholesterol > 88 mg",
        "Fat > 18.7 g",
        "Protein > 24.9 g",
        "Sodium > 526 mg"
    ],
    "n": "Copycat ChipotleÂ® Chicken",
    "a": "RainbowJewels",
    "r": "0",
    "s": 8,
    "des": "\"Just a small amount of effort for this delicious and healthy meal. You can use this chicken for tacos, burritos, burrito bowls, or fajitas. Just add your favorite toppings such as lettuce, salsa, rice, beans, cheese, or sour cream. Enjoy!\"",
    "ins": "Place chipotle chile pepper and ancho chile pepper in a bowl; pour in water. Cover bowl and let sit until peppers are softened, at least 10 to 12 hours. Drain water and remove seeds from peppers.\nBlend chile peppers, red onion, garlic, sea salt, cumin, oregano, and black pepper in a blender until a coarse paste forms; add olive oil and blend until marinade is smooth.\nPound chicken thighs flat with a meat mallet and trim excess skin. Place chicken in a resealable plastic bag and add marinade. Turn chicken several times to coat. Seal bag and marinate at least 8 hours.\nPreheat an outdoor grill with top and bottom plates for medium-high heat. Remove chicken from bag and discard marinade.\nCook chicken on the preheated grill until no longer pink in the center and the juices run clear, 5 to 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Cut into strips.",
    "pt": "10 m",
    "ct": "5 m",
    "tt": "18 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}