{
    "id": 24419,
    "old_rating": "4.5101",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup warm water",
        "1/2 cup white sugar",
        "1 tablespoon honey",
        "1/2 cup vegetable oil",
        "2 1/2 teaspoons salt",
        "2 eggs, room temperature",
        "4 cups bread flour",
        "2 1/4 teaspoons bread machine yeast",
        "1 egg, beaten",
        "1 tablespoon water"
    ],
    "nut": [
        "Calories > 182 kcal",
        "Carbs > 26 g",
        "Cholesterol > 28 mg",
        "Fat > 6.7 g",
        "Protein > 4.4 g",
        "Sodium > 302 mg"
    ],
    "n": "Bread Machine Challah II",
    "a": "MARYLYN PISSERI",
    "r": "0",
    "s": 20,
    "des": "\"Absolutely delicious.  I have a two pound bread machine and use it to make the Challah dough.  It freezes well.\"",
    "ins": "Place warm water, sugar, honey, vegetable oil, salt, 2 eggs, flour and yeast in the pan of the bread machine in the order recommended by the manufacturer. Select Dough cycle; press Start.\nAfter the machine is done, take the dough out, and place it on a very lightly floured board, punch the dough down, and let rest for 5 minutes.\nDivide the dough in half.  Then divide into 3 equal pieces, roll into ropes about 12 to 14 inches, and braid into a loaf.  Do the same with the remaining other half.  Gently put the loaves on a greased cookie sheet, mist with water, cover loosely with plastic wrap, and let rise for 1  to 1 1/2 hours in a warm, draft free place, until double in size.\nPreheat oven to 350 degrees F (175 degrees C). In a small bowl, beat together 1 egg and 1 tablespoon water.\nBrush risen loaves with egg mixture. Bake in preheated oven for about 20 to 25 minutes.  If it begins to brown too soon, cover with foil.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "2257796.jpg",
    "o": "4539220.jpg,4527596.jpg,4504125.jpg,4483747.jpg,4481143.jpg,4474013.jpg",
    "st": "allrecipes"
}