{
    "id": 244166,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups almonds",
        "3/4 cup chopped hemp seeds",
        "1/2 cup chia seeds",
        "2 tablespoons dried rosemary",
        "4 packets stevia powder",
        "1 tablespoon garlic and dried vegetable seasoning",
        "Himalayan salt and cracked black pepper to taste",
        "1 cup coconut flour",
        "1 cup minced dried cranberries",
        "1 1/2 large bananas",
        "1 Gala apple, cored and chopped",
        "2 figs",
        "1/2 cup finely chopped cabbage",
        "1/2 cup finely chopped kale"
    ],
    "nut": [
        "Calories > 113 kcal",
        "Carbs > 12.8 g",
        "Cholesterol > 0 mg",
        "Fat > 5.9 g",
        "Protein > 3.9 g",
        "Sodium > 23 mg"
    ],
    "n": "Gluten-Free Dehydrated Rosemary and Cranberry Crisps",
    "a": "sweetpea48507",
    "r": "0",
    "s": 35,
    "des": "\"Trying to eat healthier and this is a new crisp-type cracker which maintains high nutritional values. It combines natural proteins fruits and vegetables. Kids won't notice the kale.\"",
    "ins": "Place almonds in a bowl and pour in enough water to cover; let soak, 8 hours to overnight. Drain and mince almonds.\nCombine almonds, hemp seeds, chia seeds, rosemary, stevia powder, garlic and vegetable seasoning, salt, and black pepper together in a large bowl.\nPulse coconut flour and dried cranberries together in a food processor until evenly combined; add to seed mixture. Pulse bananas, apple, figs, cabbage, and kale together in a food processor until pureed; add to seed mixture. Mix seed mixture together using your hands until dough is well mixed; let stand for 30 minutes.\nDivide dough in half and place each half onto a sheet of parchment paper. Top each roll with another sheet of parchment paper. Roll dough using a rolling pin until thin; cut into squares and transfer to a food dehydrator using a spatula.\nDehydrate crackers, rotating racks as needed, according to manufacturer's instructions until crisp, 8 to 10 hours. Store immediately in air-tight bags.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "2320799.jpg",
    "o": "",
    "st": "allrecipes"
}