{
    "id": 244180,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup sunflower seed oil",
        "1/2 cup chopped onion",
        "2 tablespoons minced garlic",
        "2 cups quinoa",
        "2 tablespoons chicken bouillon",
        "4 cups water",
        "1 1/2 teaspoons chopped fresh thyme",
        "1 1/2 teaspoons chopped fresh parsley",
        "2 (5 ounce) cans chicken chunks, drained",
        "2 cups Alfredo sauce",
        "1 (10.75 ounce) can cream of chicken soup",
        "1/4 cup butter, cut into small pieces",
        "3/4 cup shredded Italian cheese blend, divided",
        "1 1/2 cups crushed pita chips",
        "1/4 cup shredded Parmesan cheese"
    ],
    "nut": [
        "Calories > 679 kcal",
        "Carbs > 46.7 g",
        "Cholesterol > 76 mg",
        "Fat > 44.4 g",
        "Protein > 23.3 g",
        "Sodium > 1319 mg"
    ],
    "n": "Chicken Alfredo Quinoa Casserole",
    "a": "GeeDeth",
    "r": "0",
    "s": 8,
    "des": "\"My family has been on a quinoa fix for some time and this has been one of our favorite creations! A great alternative to pasta that you can feel great about. Also, this is a great use for leftover chicken! Leftovers hold well in the fridge....if any of it gets that far!\"",
    "ins": "Heat sunflower oil in a skillet over medium heat; cook and stir onion and garlic until onion is slightly tender, about 5 minutes. Add quinoa and chicken bouillon; cook, stirring frequently, until quinoa is toasted, 5 to 8 minutes.\nPour water over quinoa mixture and bring to a boil; cover, reduce heat to medium-low, and simmer for 10 minutes. Stir thyme and parsley into quinoa mixture and simmer until water is absorbed, about 5 minutes. Remove skillet from heat and fluff quinoa with a fork.\nPreheat oven to 350 degrees F (175 degrees C).\nSpread quinoa mixture into the bottom of a 9x13-inch baking dish. Sprinkle chicken over quinoa. Spoon Alfredo sauce and cream of chicken soup over chicken layer; top with butter pieces. Sprinkle 1/2 cup Italian cheese blend over entire mixture.\nBake in the preheated oven for 15 minutes. Stir mixture and flatten with the back of spoon or spatula; top with pita chips and remaining 1/4 cup Italian cheese blend. Bake until cheese is melted, about 15 minutes. Cool casserole for 5 minutes; top with Parmesan cheese.",
    "pt": "10 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4322703.jpg",
    "o": "",
    "st": "allrecipes"
}