{
    "id": 244234,
    "old_rating": "4.9375",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds ground beef",
        "1 small onion, finely chopped",
        "3/4 cup buttery round crackers, crushed",
        "2/3 cup milk",
        "1/2 cup finely shredded sharp Cheddar cheese",
        "2 eggs",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon seasoned salt (such as MortonÂ® Nature's SeasonsÂ® Seasoning Blend), or to taste",
        "1 hard-boiled egg, cut in half",
        "Sauce:",
        "1/2 cup ketchup",
        "1/4 cup brown sugar",
        "2 tablespoons barbeque sauce (such as Stubb'sÂ®)",
        "5 cloves garlic, cut into small pieces"
    ],
    "nut": [
        "Calories > 531 kcal",
        "Carbs > 36.7 g",
        "Cholesterol > 177 mg",
        "Fat > 30.5 g",
        "Protein > 26.7 g",
        "Sodium > 872 mg"
    ],
    "n": "Halloween Zombie Meatloaf",
    "a": "LSpivey",
    "r": "0",
    "s": 6,
    "des": "\"This is something I threw together for our family's special Halloween night. The boys absolutely loved it! I think this will be an annual tradition from now on in our household!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil and grease the foil.\nMix ground beef, onion, crackers, milk, Cheddar cheese, eggs, Worcestershire sauce, and seasoned salt together in a bowl. Transfer beef mixture to the prepared baking sheet and form into a skull-shape, leaving holes for \"eye sockets\" and a \"mouth\". Place hard boiled egg halves into the \"eye sockets\", shaping the beef mixture around them to hold in place.\nMix ketchup, brown sugar, and barbeque sauce together in a bowl until sauce is smooth. Spread 1/2 of the sauce onto the entire beef mixture, including the \"eyes\" and \"mouth\".\nBake in preheated oven until no longer pink in the center, about 50 to 60. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\nArrange the garlic pieces in the mouth for the \"teeth\". Brush the remaining sauce over the meatloaf or serve on the side.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "4121781.jpg",
    "o": "4121781.jpg,4094722.jpg,4074543.jpg,2746436.jpg,2734280.jpg,2729286.jpg",
    "st": "allrecipes"
}