{
    "id": 244203,
    "old_rating": "4.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon kosher salt",
        "1 teaspoon black pepper",
        "1 teaspoon paprika",
        "1/4 teaspoon cayenne pepper",
        "4 (10 ounce) lamb shoulder chops",
        "1 tablespoon olive oil",
        "1/3 cup sherry vinegar",
        "2 tablespoons white sugar",
        "4 oil-packed anchovy fillets",
        "1 1/2 cups low-sodium chicken broth",
        "2 teaspoons minced fresh rosemary",
        "1/4 teaspoon ground cinnamon",
        "2 bunches breakfast radishes, rinsed and trimmed",
        "5 fresh mint leaves, finely sliced",
        "1 tablespoon cold butter"
    ],
    "nut": [
        "Calories > 530 kcal",
        "Carbs > 9.1 g",
        "Cholesterol > 158 mg",
        "Fat > 36.2 g",
        "Protein > 39.4 g",
        "Sodium > 1759 mg"
    ],
    "n": "Braised Lamb with Radishes and Mint",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"In this Basque-inspired braised lamb shoulder, the radishes that are cooked with the lamb absorb the other flavors in the dish. I really hope you give this strange, but exciting braised lamb dish a try soon.\"",
    "ins": "Preheat oven to 275 degrees F (135 degrees C).\nMix together salt, pepper, paprika, and cayenne pepper. Place lamb chops on a work surface; press seasoning onto both sides of lamb chops.\nHeat oil in large oven-proof skillet over high heat. Brown lamb well on both sides, 3 or 4 minutes per side. Remove chops from pan; reduce heat to low. Add vinegar, sugar, and anchovies. Cook and stir, breaking up anchovies. Turn up heat to medium and continue stirring until mixture reduces to the consistency of syrup, about 3 minutes. Stir in chicken broth. Raise heat to high. Add rosemary and cinnamon; bring to a simmer. Transfer browned lamb chops to pan and place radishes among the chops. Cover.\nPlace skillet in preheated oven. Roast slowly for 1 1/2 hours; turn chops. Continue roasting until meat is just tender and is beginning to separate from the bone, about 1 1/2 additional hours. Turn chops again.\nRaise oven temperature to 425 degrees F (220 degrees C). Remove cover from skillet. Roast until meat is falling off the bone and fork tender, 15 to 20 minutes. Remove skillet from oven.\nTransfer lamb and radishes to serving platter. Place pan on stove over medium-high heat. Bring sauce to a simmer until it is slightly reduced and thickened, skimming off surface fat. Remove from heat. Add sliced mint and butter. Keep stirring until butter melts. Spoon sauce over lamb and radishes.",
    "pt": "10 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}