{
    "id": 244274,
    "old_rating": "4.77778",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 (6 ounce) chicken cutlets",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "16 large fresh sage leaves",
        "16 thin slices prosciutto",
        "3 tablespoons olive oil",
        "1 cup dry white wine",
        "1 cup low-sodium chicken broth",
        "1/2 stick butter"
    ],
    "nut": [
        "Calories > 350 kcal",
        "Carbs > 1.2 g",
        "Cholesterol > 116 mg",
        "Fat > 18.9 g",
        "Protein > 36.4 g",
        "Sodium > 694 mg"
    ],
    "n": "Sandy's Chicken Saltimbocca",
    "a": "SandyG",
    "r": "0",
    "s": 8,
    "des": "\"Try this and you'll know why they call it saltimbocca--Italian for 'jump in your mouth.' It's kind of like it jumps right off of your plate. Though it's traditionally made with veal, I made it with chicken. Quick, easy, and so delicious!\"",
    "ins": "If cutlets are thick, lay them between 2 sheets of wax paper and pound to 1/2-inch thickness with flat side of a meat mallet or bottom of a small, heavy skillet. Sprinkle with salt and pepper. Put 2 large (or 5 small) sage leaves on top of each cutlet, then wrap 2 slices of prosciutto crosswise around each cutlet, holding sage in place.\nHeat 1 1/2 tablespoons oil in a large skillet over medium heat. Add 4 cutlets and cook until no longer pink in the center and the juices run clear, about 2 minutes per side. Transfer to a platter; tent with foil to keep warm. Repeat with remaining 1 1/2 tablespoons oil and remaining 4 cutlets.\nAdd wine to skillet and simmer, scraping up any browned bits, 1 minute. Add broth and simmer until slightly reduced, 4 to 5 minutes. Remove from heat, add butter, and swirl skillet until butter has melted and sauce is creamy. Spoon 2 tablespoons sauce over each cutlet and serve.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "2338678.jpg",
    "o": "",
    "st": "allrecipes"
}