{
    "id": 244202,
    "old_rating": "4.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil, plus more for drizzling",
        "2 tablespoons sherry vinegar",
        "1 teaspoon smoked paprika, plus more for topping",
        "1 teaspoon kosher salt, plus more to taste",
        "1/2 cup sliced green onions",
        "1 red jalapeno pepper, sliced",
        "4 small potatoes, quartered",
        "2 (8 ounce) thick-cut boneless, skinless Chilean sea bass fillets"
    ],
    "nut": [
        "Calories > 561 kcal",
        "Carbs > 50.6 g",
        "Cholesterol > 94 mg",
        "Fat > 18.5 g",
        "Protein > 46.9 g",
        "Sodium > 1131 mg"
    ],
    "n": "Sea Bass a la Michele",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"Whenever I can't decide on what to do with a piece of fish, I usually opt for this easy and crowd-pleasing technique, which involves roasting seafood after it's been slathered in a highly seasoned vinaigrette. And by crowd, I mean wife. It's baked on top of a warm potato salad.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C). Oil a baking dish.\nMicrowave potatoes in a microwave dish on High until just softened, about 5 minutes.\nWhisk olive oil and sherry vinegar together in a bowl. Add smoked paprika and salt; whisk to blend. Stir in onions, red jalapeno, and cooked potatoes. Slide the fish fillets into the mixture, turning and coating them with the vinaigrette. Remove the fish from potato mixture.\nPlace potatoes in prepared baking dish. Nestle fish onto potatoes. Sprinkle with a pinch of salt, a dash of paprika, and a drizzle of olive oil.\nBake in center of preheated oven until just cooked through and fish flakes easily, about 15 minutes.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "25 m",
    "i": "4536415.jpg",
    "o": "4536415.jpg,4510753.jpg,4468472.jpg,3655426.jpg,3494239.jpg,3320980.jpg",
    "st": "allrecipes"
}