{
    "id": 244264,
    "old_rating": "4.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup cold water",
        "2 tablespoons cold water",
        "1/2 cup butter",
        "2 tablespoons white sugar",
        "1/4 teaspoon salt",
        "1/8 teaspoon freshly grated nutmeg",
        "1 cup all-purpose flour",
        "1/2 teaspoon vanilla extract",
        "4 large eggs",
        "12 strips bacon, sliced crosswise into 1/2-inch pieces",
        "vegetable oil for deep frying",
        "1/4 cup maple syrup, for serving",
        "1/4 teaspoon salt"
    ],
    "nut": [
        "Calories > 542 kcal",
        "Carbs > 29.5 g",
        "Cholesterol > 185 mg",
        "Fat > 41.4 g",
        "Protein > 13.4 g",
        "Sodium > 784 mg"
    ],
    "n": "Bacon and Egg Doughnuts",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"I've always wanted to try making some kind of sweet/savory bacon-studded fritter using pate a choux, also known as that stuff you make cream puffs with.Â I went full breakfast theme, and topped mine with a little maple syrup, but feel free to get your beignet on, and cover them with a pile of powdered sugar.\"",
    "ins": "Pour 1 cup plus 2 tablespoons cold water into a saucepan over medium-high heat. Add butter, sugar, salt and nutmeg. When mixture starts to simmer, reduce heat to medium and add flour. Cook, stirring constantly, until mixture comes together into a soft dough ball, about 2 minutes. Remove from heat and transfer to a mixing bowl. Pour in vanilla extract. Break up dough with a whisk or fork, and let cool for about 5 minutes.\nBreak an egg into the bowl with the dough and whisk until egg is incorporated and dough becomes smooth and sticky, 4 to 5 minutes. Dough will stick inside the whisk; clean out dough with a spatula before adding successive eggs, 1 at a time. Whisk in each egg until thoroughly incorporated into the dough. Clear dough from whisk; scrape down sides of bowl. Cover dough with plastic wrap and chill for about an hour.\nPlace bacon in cold skillet. Cook over medium heat, stirring occasionally, until bacon is browned and crisp and fat is rendered, 5 to 8 minutes. Transfer bacon pieces to a paper towel-lined plate to drain. When bacon is cool enough to handle, place it on a cutting board and chop into small pieces. Reserve some bacon bits for topping the doughnuts.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nRemove dough from refrigerator and stir in bacon pieces.\nDrop dough by scoopfuls (about 2 tablespoons) into hot oil. Fry in batches to avoid crowding. Fry until dough begins to puff and brown, turning occasionally. After doughnuts expand and crack, keep turning them until they are evenly browned, about 7 minutes. Transfer to paper toweled-lined plate to drain slightly.\nServe hot, drizzled with maple syrup and topped with bacon pieces.",
    "pt": "25 m",
    "ct": "7 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}