{
    "id": 244262,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 medium head green cabbage, finely shredded",
        "3 tablespoons finely chopped garlic",
        "1 1/2 teaspoons kosher salt",
        "1/3 cup grapeseed oil",
        "1/3 cup mayonnaise",
        "1/3 cup apple cider vinegar",
        "1/4 teaspoon ground paprika",
        "1/4 teaspoon ground white pepper",
        "1/8 teaspoon white sugar",
        "1/8 teaspoon celery seed"
    ],
    "nut": [
        "Calories > 182 kcal",
        "Carbs > 8.2 g",
        "Cholesterol > 3 mg",
        "Fat > 16.5 g",
        "Protein > 1.8 g",
        "Sodium > 434 mg"
    ],
    "n": "Vincent's Famous Garlic Coleslaw",
    "a": "crancherry",
    "r": "0",
    "s": 8,
    "des": "\"Tired of all the super sweet coleslaw dressings out there? Look no further! Caution - must LOVE garlic! \n\nThis is a copycat recipe for the famous garlic coleslaw served at Vincent's seafood restaurant, a Dallas legend since 1968. Growing up, we had an Easter tradition of dinner at Vincent's every year. The coleslaw was my dad's favorite and became mine too! We still go there for Easter but I love being able to recreate this unique recipe at home anytime. Goes great with barbecue ribs, burgers, seafood steam pot, or just as a cool crisp snack. The longer it cures, the better it gets!\"",
    "ins": "Place shredded cabbage into a large bowl.\nGather chopped garlic into a mound on a cutting board and pour salt over top. Using the flat side of a chef's knife, smash the garlic and salt together and transfer to a bowl. Whisk grapeseed oil, mayonnaise, apple cider vinegar, ground paprika, ground white pepper, sugar, and celery seed together with garlic mixture until dressing reaches a uniform consistency.\nPour dressing over shredded cabbage and toss to evenly coat. Press coleslaw down into the bowl using the back of a spoon or place another bowl on top. Cover and refrigerate for at least 1 hour. Stir before serving.",
    "pt": "15 m",
    "ct": "",
    "tt": "",
    "i": "2342990.jpg",
    "o": "",
    "st": "allrecipes"
}