{
    "id": 244241,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 large rainbow carrots, cut into 1/4-inch-thick strips, or more to taste",
        "1 tablespoon cornstarch",
        "2 teaspoons coconut sugar",
        "1 pinch cayenne pepper, or more to taste",
        "1 pinch paprika, or more to taste",
        "1 pinch garlic powder, or more to taste",
        "1 pinch onion powder, or more to taste",
        "1 pinch ground black pepper, or more to taste",
        "1 pinch dried oregano, or more to taste",
        "1 pinch dried thyme, or more to taste",
        "2 tablespoons olive oil"
    ],
    "nut": [
        "Calories > 221 kcal",
        "Carbs > 24 g",
        "Cholesterol > 0 mg",
        "Fat > 14 g",
        "Protein > 1.7 g",
        "Sodium > 102 mg"
    ],
    "n": "Cajun Rainbow Carrot Fries",
    "a": "giannabowen",
    "r": "0",
    "s": 2,
    "des": "\"The secret ingredient to crispy carrot (or sweet potato fries) is a little bit of organic corn starch! Too much and they will be pasty, too little and they won't get as crispy. My favorite way to eat these is with a little ketchup mixed with sriracha (a 4:1 ratio.) You can just buy a pre-made Cajun seasoning at the store (easy), or make your own by combining the spices listed.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Grease a baking sheet.\nPlace carrots in a large bowl; add cornstarch and toss, using your hands, until evenly coated. Sprinkle coconut sugar, cayenne pepper, paprika, garlic powder, onion powder, black pepper, oregano, and thyme over carrots. Drizzle olive oil over seasoned carrots and toss to coat. Spread carrots onto the prepared baking sheet.\nBake in the preheated oven for 15 minutes; flip and continue baking until lightly browned and crispy, 10 to 15 minutes more.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "2332957.jpg",
    "o": "",
    "st": "allrecipes"
}