{
    "id": 244345,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups creamy peanut butter, divided",
        "1/4 cup coconut sugar",
        "1 tablespoon coconut oil",
        "1 1/2 teaspoons milk",
        "1 cup miniature semisweet chocolate chips",
        "1 tablespoon butter",
        "2/3 cup white sugar",
        "3 cups heavy whipping cream",
        "1 teaspoon pure vanilla extract"
    ],
    "nut": [
        "Calories > 653 kcal",
        "Carbs > 39.3 g",
        "Cholesterol > 101 mg",
        "Fat > 53.6 g",
        "Protein > 11.9 g",
        "Sodium > 217 mg"
    ],
    "n": "Homemade Reese'sÂ® Peanut Butter Ice Cream",
    "a": "Francine Lizotte, Club Foody",
    "r": "0",
    "s": 10,
    "des": "\"This ice cream is delicious, creamy and full of flavor. It's a crowd favorite. . . give it a try!\"",
    "ins": "Beat 1/2 cup peanut butter, coconut sugar, coconut oil, and milk together in a bowl until smooth; cover and place in refrigerator.\nMelt chocolate chips in top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching; stir in butter until smooth. Set chocolate mixture aside to cool to room temperature, about 10 minutes.\nStir chocolate mixture into peanut butter mixture; cover and place in refrigerator.\nBeat remaining 1 cup peanut butter and white sugar together with an electric mixer until smooth; beat in cream until well combined. Stir vanilla extract into cream mixture; cover and refrigerate for 3 hours or up to overnight.\nPlace cream mixture into the bowl of an ice cream maker; churn until soft-set and creamy, about 15 minutes. Chop chocolate mixture into pieces; mix about 1 cup chocolate mixture into ice cream.\nSprinkle remaining pieces of chocolate mixture over ice cream to serve.",
    "pt": "30 m",
    "ct": "5 m",
    "tt": "3 h ",
    "i": "2750593.jpg",
    "o": "",
    "st": "allrecipes"
}