{
    "id": 244303,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups fresh raspberries",
        "1/4 cup white sugar",
        "1 1/2 cups whole milk",
        "6 large eggs",
        "1 1/4 cups white sugar",
        "1 cup all-purpose flour",
        "2 1/2 tablespoons unsalted butter, room temperature",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon kosher salt",
        "1/4 cup coarse sugar"
    ],
    "nut": [
        "Calories > 291 kcal",
        "Carbs > 50.7 g",
        "Cholesterol > 123 mg",
        "Fat > 7.4 g",
        "Protein > 6.6 g",
        "Sodium > 153 mg"
    ],
    "n": "Baked Raspberry Custard",
    "a": "Sweet Pickles Mom",
    "r": "0",
    "s": 10,
    "des": "\"This is a absolutely wonderful, yet easy-to-make dessert which can be simple or elegant. It consists of a 'no fail' baked custard filling with fresh raspberries. The custard is mildly sweet and the fresh raspberries add a fresh tartness to the flavor. This dessert will impress anyone and trust me, everyone will ask for the recipe. Serve plain as a 'simple' dessert or add to the elegance by adding a dollop of creme fresh with a fresh raspberry to really give a nice presentation. Add a little mint leaf on the side, this will impress everyone. Serve warm or allow to cool for a firmer consistency.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Butter a deep-dish pie pan.\nSpread raspberries into the prepared pan and top with 1/4 cup white sugar.\nBlend milk, eggs, 1 1/4 cups white sugar, flour, unsalted butter, vanilla extract, and salt together in a blender until smooth and creamy; slowly pour over raspberries. Sprinkle coarse sugar over the floating raspberries.\nBake in the preheated oven until custard is raised in the middle and top is lightly browned, 45 to 50 minutes.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "4126290.jpg",
    "o": "",
    "st": "allrecipes"
}