{
    "id": 244396,
    "old_rating": "1",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 large fresh fennel bulb (fronds reserved for garnish) halved lengthwise and cut into 8 wedges",
        "1 tablespoon olive oil",
        "3 (18 x 18-inch) sheets of Reynolds WrapÂ® Heavy Duty Aluminum Foil",
        "1 1/2 pounds mussels, scrubbed and debearded",
        "1 shallot, finely diced",
        "2 cloves garlic, minced",
        "1/2 cup dry white wine",
        "1/2 cup heavy cream",
        "1 teaspoon flake sea salt, plus more to finish",
        "1 lemon, halved"
    ],
    "nut": [
        "Calories > 356 kcal",
        "Carbs > 21.7 g",
        "Cholesterol > 88 mg",
        "Fat > 18.5 g",
        "Protein > 23 g",
        "Sodium > 1001 mg"
    ],
    "n": "Grilled Mussels with Smoked Paprika Cream",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 4,
    "des": "\"Make a perfect summer seafood meal right on the grill with this recipe from Ashley Rodriguez of Not Without Salt.\"",
    "ins": "Preheat an outdoor grill for high heat.\nBrush the fennel wedges with olive oil and sprinkle with salt. Place on prepared grill until cook until deeply charred and the fennel is just starting to soften, about 10 minutes. Cool slightly. Roughly chop 4 of the wedges.\nLine a wide shallow bowl with three layers of  Reynolds Wrap(R) Heavy Duty Aluminum Foil.\nPlace the cleaned mussels in the middle of the foil. Add the shallot, garlic, chopped fennel, white wine, cream and 1 teaspoon flake salt.\nSeal the foil, first in the center, rolling up the edges tightly and then drawing in the outside flaps.\nPlace packet on grill, and grill until the juices are bubbling and the mussels have opened, about 12 minutes.\nDuring the last 2 minutes of cooking, grill the lemon halves until charred and juicy.\nFinish with a squeeze of the grilled lemon, the reserved grilled fennel wedges, a sprinkling of fennel fronds and a pinch of flake salt.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2364513.jpg",
    "o": "",
    "st": "allrecipes"
}