{
    "id": 244309,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Southwest Sauce:",
        "1/2 cup sour cream",
        "1/4 cup ranch dressing",
        "1/4 cup taco sauce",
        "4 (4 ounce) hamburger patties",
        "1 dash Worcestershire sauce, or to taste",
        "8 flour tortillas",
        "2 cups shredded sharp Cheddar cheese",
        "2 cups shredded Colby-Jack cheese",
        "1/2 head lettuce, shredded, or to taste",
        "3 tablespoons picante sauce, or to taste"
    ],
    "nut": [
        "Calories > 1192 kcal",
        "Carbs > 63 g",
        "Cholesterol > 217 mg",
        "Fat > 77 g",
        "Protein > 61 g",
        "Sodium > 1810 mg"
    ],
    "n": "Quesadilla Burgers",
    "a": "KitchenWitch",
    "r": "0",
    "s": 4,
    "des": "\"This is a great twist on the hamburger that everyone is sure to love! It's a combination of southwest and the classic American hamburger. I have three kids who all eat very differently from one another and this was a hit for them as well as hubby! I like to serve these with either sweet potato fries or green bean fries!\"",
    "ins": "Mix sour cream, ranch dressing, and taco sauce together in a bowl until Southwest sauce is smooth. Cover bowl and refrigerate for flavors to blend.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nCook hamburger patties in the preheated grill for 5 minutes, seasoning with Worcestershire sauce. Flip patties. Arrange tortillas on the grill and lower heat to medium-low under tortillas. Add Cheddar cheese and Colby-Jack cheese to tortillas; cook until cheeses melt, 2 to 4 minutes. Continue cooking hamburger patties until cooked through, about 5 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\nSpread Southwest sauce onto 1/2 of the tortillas; top with lettuce and picante sauce. Place 1 hamburger patty on top of picante sauce layer and top patty with a tortilla, creating a sandwich.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "2350602.jpg",
    "o": "",
    "st": "allrecipes"
}