{
    "id": 244327,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups chopped cremini mushrooms",
        "1/4 cup minced shallots",
        "3 cloves garlic, minced",
        "3/4 tablespoon chopped fresh thyme",
        "1/2 teaspoon sea salt, or to taste",
        "1/2 teaspoon ground black pepper",
        "1 1/2 tablespoons olive oil",
        "1/4 cup full-bodied dry red wine, or as needed",
        "1 pound lean ground chuck",
        "1 3/4 tablespoons white truffle oil",
        "1 baguette, cut into 1-inch slices",
        "12 thin slices Parmesan cheese",
        "1 1/2 cups arugula"
    ],
    "nut": [
        "Calories > 632 kcal",
        "Carbs > 52.5 g",
        "Cholesterol > 85 mg",
        "Fat > 29 g",
        "Protein > 36.7 g",
        "Sodium > 992 mg"
    ],
    "n": "Juicy Gourmet Burger Sliders",
    "a": "CoachJen",
    "r": "0",
    "s": 4,
    "des": "\"If you want to kick up your regular burger a few notches and get more dinner-table approval grunts, this is a sure thing. Juicy, super-flavourful, and can be an appetizer (sliders) or full sized burgers. Pour a glass of wine and indulge!\nEnjoy!\"",
    "ins": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nStir mushrooms, shallots, garlic, thyme, salt, and pepper together in a bowl. Heat olive oil in a skillet over medium heat;cook and stir mushroom mixture until golden, about 8 minutes. Pour red wine into skillet; simmer until liquid evaporates, stirring slowly, about 2 minutes. Spread mushroom mixture onto a plate to cool to room temperature, about 5 minutes.\nCrumble ground chuck into a bowl; pour truffle oil over beef and massage oil gently into beef until evenly distributed. Fold mushroom mixture into beef mixture until combined; form 6 patties approximately the size of baguette slices.\nGrill patties until no longer pink in the center, about 3 minutes per side. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\nToast baguette slices until crisp and golden. Place each patty on a baguette slice, top with 2 shaved slices of Parmesan cheese, about 1/4 cup arugula, and a second baguette slice. Secure each slider with a toothpick.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "3354042.jpg",
    "o": "",
    "st": "allrecipes"
}