{
    "id": 244388,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (14 ounce) cans sweetened condensed milk",
        "2 cups whole milk",
        "1 (14 ounce) can evaporated milk",
        "1 cup heavy whipping cream",
        "1/4 cup white sugar",
        "3 tablespoons molasses",
        "4 teaspoons vanilla extract",
        "6 tablespoons butter",
        "1 teaspoon salt",
        "1 pound pecans"
    ],
    "nut": [
        "Calories > 520 kcal",
        "Carbs > 40.9 g",
        "Cholesterol > 59 mg",
        "Fat > 37.4 g",
        "Protein > 9.5 g",
        "Sodium > 284 mg"
    ],
    "n": "No-Cook, Homemade Butter Pecan Ice Cream",
    "a": "Jim79",
    "r": "0",
    "s": 16,
    "des": "\"My favorite homemade ice cream recipe. An easy no-cook ice cream recipe that will satisfy your sweet tooth without the hassle of an egg recipe.\"",
    "ins": "Combine sweetened condensed milk, whole milk, evaporated milk, cream, sugar, molasses, and vanilla extract together using a whisk in a large bowl, taking care to avoid creating bubbly foam. Refrigerate mixture for 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nMelt butter in a large saucepan over medium-low heat; stir in salt until dissolved. Mix pecans into melted butter until evenly coated. Spread coated pecans in a single layer onto a baking sheet.\nBake in the preheated oven for 6 minutes. Flip pecans and continue baking until toasted and fragrant, about 6 minutes more. Remove butter pecans from oven and coarsely chop. Measure 1 1/2 cups butter pecans and reserve the remaining for another use.\nPour cream mixture into an ice cream maker and follow manufacturer's instructions for ice cream. When ice cream is semi-solid (about 30 minutes), stop the machine. Pour ice cream into an air-tight container and fold in 1 1/2 cup butter pecans. Cover ice cream with plastic wrap and seal container with a lid. Freeze ice cream until solid, at least 2 hours.",
    "pt": "15 m",
    "ct": "12 m",
    "tt": "2 h ",
    "i": "2359118.jpg",
    "o": "",
    "st": "allrecipes"
}