{
    "id": 244411,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups cubed angel food cake",
        "1 (3 ounce) package raspberry-flavored gelatin mix (such as Jell-OÂ®)",
        "3 cups boiling water, divided",
        "3 cups cold water, divided",
        "2 cups fresh raspberries",
        "2 (3.5 ounce) packages instant vanilla pudding mix, divided",
        "4 cups milk, divided",
        "1 (3 ounce) package cherry-flavored gelatin mix (such as Jell-OÂ®)",
        "2 cups pitted and halved fresh cherries",
        "1 (3 ounce) package strawberry-flavored gelatin mix (such as Jell-OÂ®)",
        "2 cups halved fresh strawberries",
        "1 (12 ounce) container frozen whipped topping, thawed",
        "1/4 cup fresh raspberries, cherries, and strawberries for garnish"
    ],
    "nut": [
        "Calories > 382 kcal",
        "Carbs > 66.7 g",
        "Cholesterol > 8 mg",
        "Fat > 11.1 g",
        "Protein > 7.1 g",
        "Sodium > 491 mg"
    ],
    "n": "Canada Day Three Berry Trifle",
    "a": "Phoebe",
    "r": "0",
    "s": 10,
    "des": "\"Trifle is my favourite dessert and I have been making it for decades, probably not the same way twice! A good dessert to make when you are doing other things and can walk away and come back to it as you have time. Reserve a few pieces of each fruit for garnish.\"",
    "ins": "Place cake cubes in the bottom of a trifle bowl. Stir raspberry gelatin and 1 cup boiling water together in a large measuring cup until dissolved; stir in 1 cup cold water. Pour raspberry gelatin mixture over cake cubes; press down. Spread raspberries evenly over top of gelatin; place trifle in refrigerator to chill until set, about 45 minutes.\nWhisk 1 package pudding mix and 2 cups cold milk together in a bowl for 2 minutes. Spread pudding over raspberries in trifle bowl; return trifle to refrigerator to chill until pudding sets, about 45 minutes.\nStir cherry gelatin and 1 cup boiling water together in a large measuring cup until dissolved; stir in 1 cup cold water. Pour cherry gelatin over pudding in trifle bowl; spread cherries over gelatin. Return trifle to refrigerator to chill until gelatin sets, about 45 minutes.\nWhisk remaining package pudding mix and 2 cups cold milk together in a bowl for 2 minutes. Spread pudding over trifle; chill until pudding sets, about 45 minutes.\nStir strawberry gelatin and 1 cup boiling water together in a large measuring cup; stir in 1 cup cold water. Pour strawberry gelatin over pudding; spread strawberries over gelatin. Return trifle to refrigerator to chill until completely set, about 1 hour.\nSpread whipped topping over trifle; garnish the top with reserved berries.",
    "pt": "50 m",
    "ct": "",
    "tt": "",
    "i": "2387750.jpg",
    "o": "",
    "st": "allrecipes"
}