{
    "id": 244468,
    "old_rating": "3.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 pattypan squash",
        "2 tablespoons butter",
        "1 tablespoon olive oil",
        "1 clove garlic, minced",
        "1 bunch fresh spinach, finely chopped",
        "1 teaspoon Worcestershire sauce",
        "salt and ground black pepper to taste",
        "1 dash cayenne pepper (optional)",
        "1/4 cup shredded mozzarella cheese, divided",
        "1 large egg, lightly beaten",
        "hot water as needed"
    ],
    "nut": [
        "Calories > 144 kcal",
        "Carbs > 5.2 g",
        "Cholesterol > 66 mg",
        "Fat > 11.9 g",
        "Protein > 6.2 g",
        "Sodium > 224 mg"
    ],
    "n": "Stuffed Patty Pan Squash",
    "a": "jose v",
    "r": "0",
    "s": 4,
    "des": "\"A delicious and eye-catching way to prepare patty pan squash. Very easy to make.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nFill a large pot half-full with water; bring to a boil. Cook squash in the boiling water until tender, 5 to 10 minutes. Remove squash from water and allow to cool. Cut about 1/2 inch from the top of each squash and remove the insides to hollow the squash. Set squash insides aside.\nMelt butter and oil in a skillet over medium heat; cook and stir garlic until softened, 1 to 2 minutes. Add spinach and Worcestershire sauce; cook and stir until spinach is tender, 3 to 4 minutes. Transfer spinach mixture to a bowl to partially cool. Season with salt, black pepper, and cayenne pepper.\nStir 1/2 of the mozzarella cheese and egg into spinach mixture; spoon into the hollowed squash. Arrange stuffed squash in a single layer on a baking sheet; top with remaining cheese. Pour enough hot water into pan to fill about 1/2-inch.\nBake in the preheated oven until squash is tender, 25 to 30 minutes.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "3784923.jpg",
    "o": "",
    "st": "allrecipes"
}