{
    "id": 244404,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (6 ounce) New York strip steaks",
        "salt and ground black pepper to taste",
        "2 tablespoons olive oil",
        "1 tablespoon butter",
        "6 large button mushrooms, sliced",
        "1 bell pepper, cut into matchstick-size pieces",
        "2 sandwich buns, split",
        "1/2 cup shredded mozzarella cheese",
        "1/4 cup mayonnaise"
    ],
    "nut": [
        "Calories > 1132 kcal",
        "Carbs > 74.9 g",
        "Cholesterol > 130 mg",
        "Fat > 70.5 g",
        "Protein > 48.5 g",
        "Sodium > 1305 mg"
    ],
    "n": "Scrumptious Steak Sammy",
    "a": "weeble",
    "r": "0",
    "s": 2,
    "des": "\"This is our favourite sandwich to have for dinner on a lazy weekend. I like to serve it with sweet potato fries and a Caesar salad. Mmm . . . mmm . . . scrumptious!\"",
    "ins": "Season steaks with salt and pepper; allow steaks to come to room temperature, about 15 minutes.\nHeat oil in a skillet over medium heat until very hot; lay steaks in pan and cook until they are beginning to firm and are hot and slightly pink in the center, about 5 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Transfer steaks to a warm plate; cover and let rest, about 10 minutes.\nMelt butter in same pan over medium heat; stir in mushrooms and peppers. Season with salt and pepper; cook and stir until tender, about 5 minutes.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nToast buns under the broiler until golden, about 2 minutes. Divide mozzarella cheese over bottom halves of buns; return to broiler until cheese melts, about 2 minutes.\nSlice steak very thinly. Pile steak slices over cheese-topped bun halves; top with mushrooms and peppers. Spread mayonnaise on top halves of buns; place over sandwich.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "1 h",
    "i": "2438279.jpg",
    "o": "",
    "st": "allrecipes"
}