{
    "id": 244403,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter, room temperature",
        "3/4 cup sugar",
        "1 egg",
        "1/2 teaspoon vanilla extract",
        "1 1/3 cups all-purpose flour",
        "1 teaspoon cream of tartar",
        "1/2 teaspoon baking soda",
        "1 pinch salt",
        "1 tablespoon sugar",
        "1 teaspoon ground cinnamon",
        "4 sheets Reynolds WrapÂ® Heavy Duty Aluminum Foil",
        "1 pint strawberries, rinsed, hulled and sliced or halved",
        "Vanilla ice cream"
    ],
    "nut": [
        "Calories > 630 kcal",
        "Carbs > 88.2 g",
        "Cholesterol > 122 mg",
        "Fat > 28.6 g",
        "Protein > 7.9 g",
        "Sodium > 406 mg"
    ],
    "n": "Strawberry and Snickerdoodle Skillet Cookie Sundaes",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 4,
    "des": "\"Savor the perfect combination of fresh strawberries and sweet snickerdoodle with this delicious grilled skillet cookie from Stephanie Le of I am a Food Blog.\"",
    "ins": "Preheat the grill to 350 degrees F. Lightly butter four well-seasoned 5- to 6-inch cast iron skillets.\nIn a large bowl, cream together the butter and 3/4 cup sugar until light and fluffy. Beat in the egg and vanilla until smooth.\nIn another bowl, sift together the flour, cream of tartar, and baking soda. Stir the flour mix into the butter-sugar mixture until combined. Chill in the fridge for 10 to 15 minutes.\nCombine 1 tablespoon sugar and the cinnamon in a small bowl. Divide the dough into 4 and shape into balls. Roll in the cinnamon-sugar and press into 4 prepared cast iron pans.\nCover pans with Reynolds Wrap(R) Heavy Duty Aluminum Foil and place on the preheated grill. Close the lid. Grill for 10 minutes and remove the foil from the cookies. Grill for another 5 minutes. Remove cookies from the grill and let cool slightly.\nTop the cookies with vanilla ice cream and fresh strawberries.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2364525.jpg",
    "o": "",
    "st": "allrecipes"
}