{
    "id": 244472,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 large eggs",
        "2 tablespoons white sugar",
        "1 tablespoon coffee-flavored liqueur (such as KahluaÂ®)",
        "1 1/2 teaspoons instant coffee granules",
        "1 teaspoon unsweetened cocoa powder",
        "1/4 cup ice cold heavy whipping cream",
        "1 tablespoon white sugar",
        "1 teaspoon whipped cream for garnish (optional)",
        "1 pinch unsweetened cocoa powder for dusting (optional)"
    ],
    "nut": [
        "Calories > 279 kcal",
        "Carbs > 24.4 g",
        "Cholesterol > 227 mg",
        "Fat > 16.3 g",
        "Protein > 7.3 g",
        "Sodium > 83 mg"
    ],
    "n": "Mocha Semifreddo",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"A massively underrated summer dessert, semifreddo has a rich taste, and you get what's basically an airy, custard-style ice cream without having to use a machine. However, it all comes at a cost. The classic procedure is a little bothersome, since you need to make three separate components Â– a zabaione, a meringue, and whipped cream Â– so, I decided to simply use the eggs whole, and make a 'zabaringue.' I knew I wouldn't get as much volume, but I didn't care.\"",
    "ins": "Whisk eggs, sugar, coffee-flavored liqueur, instant coffee, and 1 teaspoon cocoa powder together in a metal bowl.\nPlace bowl over low heat on the stove (holding bowl with a dishtowel) and continue whisking until mixture thickens, 4 to 6 minutes. Whisk continually to prevent eggs from scrambling. Remove bowl from heat and let mixture cool completely. (You can set the bowl on ice water to speed this up.)\nWhisk ice-cold heavy cream and sugar together in a chilled bowl until stiff peaks form, 3 to 4 minutes. Add cooled egg-coffee mixture to the whipped cream. Stir with a spatula until just combined.\nTransfer mixture to serving cups. Wrap cups in plastic wrap and freeze until firm, 8 hours or overnight. Garnish with whipped cream and a dusting of cocoa powder.",
    "pt": "10 m",
    "ct": "4 m",
    "tt": "8 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}