{
    "id": 244474,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Vegetable Juice:",
        "2 pints sweet cherry tomatoes",
        "1/4 cup chopped celery",
        "1/4 cup chopped red bell pepper",
        "salt and ground black pepper to taste",
        "Michelada:",
        "1/2 teaspoon flake sea salt (such as MaldonÂ®)",
        "1 pinch freshly ground black pepper",
        "1 pinch dried red chile pepper",
        "1 lime, halved",
        "ice cubes",
        "1/2 teaspoon Worcestershire sauce",
        "1/2 teaspoon hot pepper sauce",
        "1/8 teaspoon soy sauce",
        "1/4 cup homemade vegetable juice",
        "1/2 (12 fluid ounce) bottle ice-cold Mexican lager"
    ],
    "nut": [
        "Calories > 244 kcal",
        "Carbs > 45.5 g",
        "Cholesterol > 0 mg",
        "Fat > 2.3 g",
        "Protein > 7.1 g",
        "Sodium > 1253 mg"
    ],
    "n": "Chef John's \"Sunset\" Michelada",
    "a": "Chef John",
    "r": "0",
    "s": 1,
    "des": "\"This spicy, savory, tangy, amazingly refreshing beer-based cocktail is considered one of the best hot-weather, adult beverages ever. I've heard it described as 'Bloody Mary meets Mimosa,' which makes me never want to go to brunch again, but it's also kind of accurate. You can use tomato juice or make your own using fresh cherry tomatoes.\"",
    "ins": "Place cherry tomatoes, celery, and red bell pepper into a blender. Pulse a few times to get mixture moving. Blend on high until mixture has liquefied, a few more seconds. Place strainer over a bowl and strain mixture to remove seeds and skins. Push mixture through strainer with a spatula to extract the liquid. Season with salt and pepper.\nSprinkle flake salt, black pepper, and chili pepper on a small plate. Rub rim of a glass with cut surface of a lime. Invert glass and dip rim into salt mixture.\nFill glass with ice and add Worcestershire sauce, hot sauce, and soy sauce. Pour in the vegetable juice and juice of 1/2 lime. Fill the glass 3/4 of the way with ice-cold beer. Stir. Top off with more beer. Garnish with lime slice.",
    "pt": "5 m",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}