{
    "id": 244553,
    "old_rating": "4.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 large Italian eggplants",
        "2 cloves crushed garlic",
        "2 teaspoons kosher salt, or to taste",
        "1 lemon, juiced, or more to taste",
        "3 tablespoons tahini, or more to taste",
        "3 tablespoons extra-virgin olive oil",
        "2 tablespoons plain Greek yogurt",
        "1 pinch cayenne pepper, or to taste",
        "1 leaf fresh mint, minced (optional)",
        "2 tablespoons chopped fresh Italian parsley"
    ],
    "nut": [
        "Calories > 111 kcal",
        "Carbs > 14.5 g",
        "Cholesterol > < 1 mg",
        "Fat > 5.9 g",
        "Protein > 3.1 g",
        "Sodium > 331 mg"
    ],
    "n": "Chef John's Baba Ghanoush",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"No matter what you're grilling this summer, chances are good you're going to have more hot coals than food to cook on it, which makes baba ghanoush the perfect post-barbecue recipe. This is a wonderfully savory yet refreshing vegetable dip.\"",
    "ins": "Preheat an outdoor grill for medium-high heat and lightly oil the grate. Prick the surface of the skin of eggplants several times with the tip of a knife.\nPlace eggplants directly on grill. Turn frequently with tongs while skin chars. Cook until eggplants have collapsed and are very soft, 25 to 30 minutes. Transfer to a bowl and cover tightly with aluminum foil and allow to cool, about 15 minutes.\nWhen eggplants are cool enough to handle, split them in half and scrape flesh into a colander placed over a bowl. Drain 5 or 10 minutes.\nTransfer eggplant to mixing bowl. Add crushed garlic and salt; mash until creamy but with a little texture, about 5 minutes. Whisk in lemon juice, tahini, olive oil, and cayenne pepper. Stir in yogurt.\nCover bowl with plastic wrap and refrigerate until completely chilled, 3 or 4 hours. Taste to adjust seasonings. Stir in mint and parsley.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}