{
    "id": 244516,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup olive oil",
        "1/4 cup unsalted light butter",
        "6 large cloves garlic, thinly sliced",
        "5 yellow onions, sliced 1/4-inch thick",
        "1 cup red cooking wine",
        "15 Italian plum tomatoes, coarsely chopped",
        "20 leaves fresh basil",
        "5 tablespoons double concentrated tomato paste",
        "1 tablespoon smoked paprika",
        "1 tablespoon white sugar (optional)",
        "2 teaspoons cayenne pepper",
        "2 teaspoons salt, or to taste"
    ],
    "nut": [
        "Calories > 391 kcal",
        "Carbs > 26.5 g",
        "Cholesterol > 10 mg",
        "Fat > 31.4 g",
        "Protein > 4 g",
        "Sodium > 829 mg"
    ],
    "n": "Patrick's Arrabiata Sauce",
    "a": "Patrick Lavigne",
    "r": "0",
    "s": 8,
    "des": "\"A low-cost spicy sauce with strong flavours and a silky texture. It does take a little time to make but the quantities yield 8 servings so that you can refrigerate or freeze the rest. Works great with dried pasta! It is the outcome of three years of trial and error, and I feel like I no longer need to experiment with the ingredients and method. If you're looking for a basic sauce which will allow for the taste of fresh pasta to be more up front, then this sauce might not be for you. To be served on a bed of your favourite pasta, topped with a few fresh basil leaves.\"",
    "ins": "Place olive oil, butter, and garlic in a large pot; turn heat to high until garlic begins to sizzle, about 2 minutes. Turn heat down to medium; stir in onions and cook and stir until onions are translucent, 2 to 3 minutes. Pour wine over onion mixture; simmer until wine is partially evaporated, about 10 minutes.\nPlace tomatoes and basil in the bowl of a food processor; pulse to blend until tomatoes are chunky. Pour tomatoes into onion mixture; cook, stirring about every 5 minutes, until sauce darkens to a deep red color, about 40 minutes. Turn off heat.\nWorking in batches, pour the sauce into a food processor and blend until smooth. Stir tomato paste, smoked paprika, sugar, and cayenne pepper into tomato mixture; season to taste with salt.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "2890292.jpg",
    "o": "",
    "st": "allrecipes"
}