{
    "id": 244564,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 small onion, peeled and cut into quarters",
        "1 tomato, cut into quarters",
        "1 small red bell pepper, seeded and cut into quarters",
        "4 serrano chili peppers, cut in half lengthwise and seeded",
        "2 tablespoons vegetable oil",
        "2 cloves garlic",
        "1 (14.5 ounce) can SwansonÂ® Vegetable Broth or SwansonÂ® Certified Organic Vegetable Broth",
        "1 tablespoon chopped fresh parsley",
        "1 (8 ounce) container refrigerated lump crabmeat, drained",
        "6 limes"
    ],
    "nut": [
        "Calories > 122 kcal",
        "Carbs > 11.7 g",
        "Cholesterol > 29 mg",
        "Fat > 5.3 g",
        "Protein > 9.5 g",
        "Sodium > 422 mg"
    ],
    "n": "Chilapachole (Spicy Tomato Crab Soup)",
    "a": "SwansonÂ®",
    "r": "0",
    "s": 6,
    "des": "\"Light and spicy, chilapachole is a seafood soup enjoyed along the Gulf of Mexico. The sweet crabmeat in a piquant tomato broth makes an elegant dinner party starter, or can be served with a few simple quesadillas for an easy dinner at home. Each coastal chef has a distinct interpretation of this dish, but the secret ingredient they all agree on is pan-roasted vegetables. Some time in a hot skillet makes all the difference- adding a deeper vegetable flavor to your chilapachole.\"",
    "ins": "Place the onion, tomato, red pepper and chili peppers into a large bowl. Add the oil and toss to coat.\nHeat a 10-inch nonstick skillet over medium heat. Add the vegetables and cook for 3 minutes, stirring occasionally.  Add the garlic and cook for 2 minutes or until the vegetables are well browned, stirring occasionally. Remove and reserve the chili peppers from the skillet.\nRemove the remaining vegetables to a blender. Add the broth and parsley. Cover and blend for 2 minutes or until the mixture is smooth. Pour the vegetable mixture into a 2-quart saucepan and cook over medium heat until the mixture is hot and bubbling. Stir in the crabmeat and cook for 2 minutes or until the mixture is hot. Season with kosher salt and ground black pepper.\nMince the reserved chili peppers. Sprinkle the soup with the chili peppers and serve with the lime wedges.",
    "pt": "25 m",
    "ct": "",
    "tt": "",
    "i": "2541956.jpg",
    "o": "",
    "st": "allrecipes"
}