{
    "id": 244557,
    "old_rating": "4.625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "24 ounces prepared pizza dough",
        "8 slices prosciutto",
        "2 cups ricotta cheese, drained",
        "1/2 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper to taste",
        "1/2 teaspoon cayenne pepper",
        "1 1/2 cups finely diced smoked ham",
        "4 ounces fresh mozzarella cheese, thinly sliced, drained on paper towels",
        "1 teaspoon extra-virgin olive oil",
        "1 tablespoon cornmeal",
        "1 egg",
        "1 teaspoon water",
        "1 tablespoon freshly grated Parmigiano-Reggiano cheese",
        "2 cups marinara sauce for dipping, heated (optional)"
    ],
    "nut": [
        "Calories > 1064 kcal",
        "Carbs > 106.1 g",
        "Cholesterol > 154 mg",
        "Fat > 44.7 g",
        "Protein > 54.9 g",
        "Sodium > 3494 mg"
    ],
    "n": "Chef John's Ham and Cheese Calzones",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Today calzones are most commonly stuffed with the exact same toppings that go on a pizza which, besides the crust issue, was one of my main problems with it. I mean, why not just fold a pizza in half, and call it a day? So, I decided to do what I hear is a more traditional filling featuring ricotta, fresh mozzarella, and ham. The result was as enjoyable as it was surprising.\"",
    "ins": "Preheat oven to 500 degrees F (260 degrees C). Line a baking sheet with parchment paper.\nDivide dough into 4 equal portions; shape each into a ball. On a lightly floured surface, flatten each dough ball into a flat circle and roll out into an 8- or 9-inch circle.\nPlace 2 prosciutto slices on one half of each circle of dough, leaving a 1-inch empty border. Spoon ricotta cheese on prosciutto. Season with a pinch of salt, pepper, and cayenne pepper. Top with chopped ham, mozzarella slices, and a drizzle of olive oil.\nMoisten edge of dough with a bit of water using your fingertip. Fold the empty half of the dough over the filling and lightly seal edges. Crimp the edges up to completely seal the calzone.\nSprinkle lined baking sheet with cornmeal. Transfer calzones to baking sheet. Cut several small slits in the top of the crust with the tip of a knife to allow for venting.\nBeat egg with water to make egg wash. Brush the calzones with egg wash. Dust with grated Parmigiano-Reggiano cheese. Remove excess cornmeal and grated cheese from around calzones to avoid smoke from the hot oven.\nBake in preheated oven until browned, about 15 minutes. Let cool 15 minutes before serving. Serve with heated marinara sauce for dipping.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "50 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}