{
    "id": 244580,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (5 ounce) salmon fillets, skin removed",
        "1/8 teaspoon salt",
        "1/8 teaspoon ground black pepper",
        "2 tablespoons olive oil",
        "1/4 cup minced shallot",
        "1 clove garlic, minced",
        "1/4 cup dry white wine",
        "1 cup SwansonÂ® Seafood Stock",
        "1/4 cup heavy cream",
        "1 tablespoon chopped fresh dill weed"
    ],
    "nut": [
        "Calories > 395 kcal",
        "Carbs > 3.1 g",
        "Cholesterol > 104 mg",
        "Fat > 27.7 g",
        "Protein > 29.2 g",
        "Sodium > 302 mg"
    ],
    "n": "Salmon with Creamy Dill Sauce from SwansonÂ®",
    "a": "SwansonÂ®",
    "r": "0",
    "s": 4,
    "des": "\"Want to impress your guests? Try this delectable one skillet dish featuring salmon fillets bathed in a creamy sauce flavored with garlic, shallots, white wine and fresh dill. Simple yet elegant, it's sure to be a hit!\"",
    "ins": "Season the fish with the salt and black pepper.\nHeat 1 tablespoon oil in a 10-inch skillet over medium-high heat. Add the fish and cook for 3 minutes. Turn the fish over and cook for 1 minute. Remove the fish from the skillet. Wipe the skillet clean with a paper towel.\nHeat the remaining oil in the skillet over medium-high heat. Add the shallots and garlic and cook and stir for 3 minutes or until tender.\nStir in the wine and cook for 3 minutes or until the wine is almost evaporated. Stir in the stock and heavy cream and heat to a boil.  Reduce heat to medium. Cook for 15 minutes or until the mixture is reduced to about 3/4 cup, stirring often. Stir in the dill.\nReturn the fish to the skillet.  Cover and cook for 5 minutes or until the fish flakes easily when tested with a fork.",
    "pt": "15 m",
    "ct": "",
    "tt": "",
    "i": "2417887.jpg",
    "o": "",
    "st": "allrecipes"
}