{
    "id": 244521,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Cake:",
        "2/3 cup sweetened flaked coconut",
        "1/2 cup butter, softened",
        "1/2 cup white sugar",
        "4 eggs, separated",
        "5 drops vanilla extract",
        "1 cup all-purpose flour",
        "1 tablespoon baking powder",
        "Topping:",
        "1/4 cup apricot jam, or as desired",
        "1 (16 ounce) can apricot halves, drained",
        "2 cups heavy whipping cream, or more to taste",
        "20 almond coconut candies (such as Raffaello)"
    ],
    "nut": [
        "Calories > 551 kcal",
        "Carbs > 42.8 g",
        "Cholesterol > 167 mg",
        "Fat > 39.7 g",
        "Protein > 7.4 g",
        "Sodium > 294 mg"
    ],
    "n": "Raffaello Cake",
    "a": "Jess2311",
    "r": "0",
    "s": 10,
    "des": "\"One of my favorite cakes ever!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch round cake pan.\nCook and stir flaked coconut in a skillet over medium-low heat until golden and toasted, about 5 minutes. Remove from heat and cool.\nMix butter, sugar, egg yolks, and vanilla extract together in a bowl until smooth; add flour, baking powder, and toasted coconut and mix well.\nBeat egg whites in a separate bowl until foamy; continue to beat until stiff peaks form. Lift your beater or whisk straight up: the egg whites will form sharp peaks. Carefully mix egg whites into flour mixture; pour into the prepared cake pan.\nBake in the preheated oven until a toothpick inserted in the center of the cake is clean, about 30 minutes. Remove cake from pan and completely on a wire rack.\nPlace apricot jam in a small microwave-safe bowl and heat until easily spreadable, 15 to 20 seconds. Spread jam onto the cooled cake and top with apricot halves.\nBeat cream in a chilled glass or metal bowl with an electric mixer until stiff peaks form.\nCrush 15 almond coconut candies in a bowl using a fork; fold into the whipped cream. Spread whipped cream mixture onto cake. Cut remaining 5 candies in half and arrange on the cake.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}