{
    "id": 244698,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon freshly ground black pepper",
        "1 tablespoon ground coriander",
        "1 tablespoon kosher salt",
        "1 teaspoon paprika",
        "1/2 teaspoon dry mustard",
        "2 teaspoons vegetable oil",
        "1 (1 1/2-pound) trimmed beef flank steak"
    ],
    "nut": [
        "Calories > 182 kcal",
        "Carbs > 2.3 g",
        "Cholesterol > 37 mg",
        "Fat > 9.6 g",
        "Protein > 20.8 g",
        "Sodium > 1480 mg"
    ],
    "n": "Grilled Flank Steak \"Pastrami\"",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"I'll do a proper pastrami one of these days. Maybe right after I get a smoker. But in the meantime, this pastrami-spiced beef flank steak should do nicely.Â You can't get the texture and color of a real pastrami without the curing step, where the meat is soaked in a brine, before being spiced/smoked, but you can get pretty close to the flavor, using the spice rub.\"",
    "ins": "Combine ground black pepper, coriander, kosher salt, paprika, and dry mustard in a bowl for the rub.\nDrizzle vegetable oil on flank steak and rub onto both sides. Use a fork to poke holes over each surface to help flavors absorb more deeply into the meat. Apply half of the spice mixture to each side and spread evenly over the surface. Wrap in butcher paper and refrigerate 2 hours or overnight. Allow steak to sit at room temperature for about 30 minutes before grilling.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nGrill steak to medium doneness or until internal temperature reaches 135 degrees F (57 degrees C), about 8 minutes per side. Remove meat from grill and allow it to rest at least 5 minutes or up to 15 minutes to allow juices to redistribute and temperature to rise to about 140 degrees F (60 degrees C). Slice thinly against the grain.",
    "pt": "10 m",
    "ct": "16 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}