{
    "id": 244673,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups white whole-wheat flour",
        "1 tablespoon white sugar",
        "1 teaspoon baking soda",
        "1/4 teaspoon salt",
        "2 tablespoons cold unsalted butter",
        "3/4 cup low-fat buttermilk",
        "2 tablespoons unsweetened applesauce",
        "12 (6 inch) bamboo skewers",
        "1 quart fresh strawberries, hulled and halved horizontally",
        "3/4 cup low-fat frozen whipped topping (such as Cool WhipÂ® Lite), thawed (optional)"
    ],
    "nut": [
        "Calories > 109 kcal",
        "Carbs > 19.4 g",
        "Cholesterol > 6 mg",
        "Fat > 2.9 g",
        "Protein > 2.9 g",
        "Sodium > 170 mg"
    ],
    "n": "Strawberry Shortcake Kabobs",
    "a": "skinnymom",
    "r": "0",
    "s": 12,
    "des": "\"We've found the most simple, easy, fun, and low-cal summertime dessert! This sweet treat is traditionally high in fat, but the skinny swaps ensure a healthier take. The kabobs make for a clean, easy presentation and double as super simple portion control!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line 2 baking sheets with parchment paper or spray with cooking spray.\nMix flour, sugar, baking soda, and salt together in a bowl; cut in cold butter using a pastry blender or your hands until crumbly.\nStir buttermilk and applesauce together in a separate bowl; pour into the flour mixture until dough comes together and is sticky. Using 2 spoons, drop dough into about 1/2 tablespoon-size mounds onto the prepared baking sheet, making 36 total mounds.\nBake in the preheated oven until the bottoms are slightly browned, 4 to 5 minutes. Cool biscuits.\nThread 3 biscuits onto each skewer, alternating with 3 strawberries halves, until all the ingredients are used. Top each skewer with whipped topping.",
    "pt": "20 m",
    "ct": "4 m",
    "tt": "39 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}