{
    "id": 244681,
    "old_rating": "4.41667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup firmly packed brown sugar, divided",
        "1/3 cup sliced almonds",
        "1/4 cup all-purpose flour",
        "3 tablespoons cold ParkayÂ® Original-stick",
        "PAMÂ® Baking Spray",
        "1 (15 ounce) package refrigerated pie crusts",
        "1 pound apples (such as Braeburn), cored, chopped",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon vanilla extract",
        "Reddi-wipÂ® Original Dairy Whipped Topping"
    ],
    "nut": [
        "Calories > 182 kcal",
        "Carbs > 21.3 g",
        "Cholesterol > < 1 mg",
        "Fat > 10.1 g",
        "Protein > 2.1 g",
        "Sodium > 136 mg"
    ],
    "n": "PAM's Mini Apple Pies with Almond Crumble",
    "a": "Pam Cooking Spray",
    "r": "0",
    "s": 18,
    "des": "\"Easy mini apple pie tart recipe with fresh apple, cinnamon and almond crumble tucked inside pastry cups.\"",
    "ins": "Stir together 6 tablespoons brown sugar, almonds and flour in small bowl. Cut in Parkay with pastry blender until mixture resembles coarse crumbs; refrigerate until ready to use.\nPreheat oven to 375 degrees F. Spray 18 medium nonstick muffin cups with baking spray. Roll each pie crust into a 13-inch circle on floured work surface. Trim and discard edges to make two 10-1/2-inch square crusts. Cut each crust into 9 square pieces. Carefully press pieces into muffin cups; set aside.\nCombine apples, remaining 2 tablespoons brown sugar, cinnamon and vanilla in large bowl. Spoon 1/4 cup apple mixture into each crust-lined muffin cup.\nBake 20 minutes. Top each with crumble mixture; bake 8 to 10 minutes more or until crumble browns. Cool in pan 5 minutes; carefully remove from muffin cups. Top each with Reddi-wip just before serving.",
    "pt": "25 m",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}