{
    "id": 244687,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 (3 pound) chicken, cut into 2 breasts, 2 wings, 2 thighs, and 2 drumsticks",
        "1/2 pound pearl onions",
        "3 cloves garlic, crushed",
        "1 1/2 tablespoons all-purpose flour",
        "1 1/2 cups red wine",
        "1/2 pound carrots, sliced diagonally",
        "1 (4.5 ounce) can sliced mushrooms",
        "1/2 cup chicken stock",
        "3 thick-cut bacon slices",
        "2 tablespoons chopped fresh parsley",
        "1 1/2 tablespoons tomato paste",
        "1/2 teaspoon thyme",
        "1 strip of orange peel",
        "1 bay leaf",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 965 kcal",
        "Carbs > 22.1 g",
        "Cholesterol > 131 mg",
        "Fat > 74.2 g",
        "Protein > 35.2 g",
        "Sodium > 682 mg"
    ],
    "n": "Coq Au Vin - The Quick and Easy Way",
    "a": "mj427",
    "r": "0",
    "s": 4,
    "des": "\"I've always wanted to make this but don't have a Dutch oven and always seemed pressed for time. It is just such a warm, heavy, and comforting dish on cold winter nights, so I thought I'd give it a try making it a quick and easy way.  Turned out delicious! I served it over mashed potatoes as the sauce is a perfect gravy.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a large skillet over medium-high heat. Fry chicken, turning often, in the hot oil until all sides are browned, 5 to 10 minutes. Remove chicken from skillet. Add onions to skillet; cook and stir over medium heat until softened, about 5 minutes. Add garlic and cook until fragrant, about 1 minute.\nStir flour into onion mixture until blended and dissolved. Add wine, stirring constantly until evenly mixed. Mix carrots, mushrooms, chicken stock, bacon, parsley, tomato paste, thyme, orange peel, bay leaf, salt, and pepper into onion mixture; return chicken. Bring liquid to a boil. Transfer mixture to a baking dish; cover.\nBake in the preheated oven until chicken is no longer pink in the center, about 45 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}