{
    "id": 244639,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds turban squash",
        "salt to taste",
        "1 pound bulk pork sausage",
        "1 cup chopped celery",
        "1/2 cup sliced fresh mushrooms",
        "1/4 cup chopped onion",
        "1/2 cup sour cream",
        "1/4 cup grated Parmesan cheese",
        "1 egg, slightly beaten",
        "1/4 teaspoon salt"
    ],
    "nut": [
        "Calories > 345 kcal",
        "Carbs > 22.5 g",
        "Cholesterol > 86 mg",
        "Fat > 22.4 g",
        "Protein > 15.8 g",
        "Sodium > 896 mg"
    ],
    "n": "Sausage-Stuffed Turban Squash",
    "a": "SaraShip",
    "r": "0",
    "s": 6,
    "des": "\"Turban squash is a winter squash that looks like a pumpkin wearing a striped green turban. The texture is similar to pumpkin and butternut squash. This recipe has been a long time favorite at Thanksgiving with my family.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with aluminum foil and lightly grease foil.\nCut the top off the squash using a serrated knife and scoop out seeds. Lightly salt the inside of squash. Place squash, cut-side down, onto the prepared baking sheet.\nBake in the preheated oven until tender, about 1 hour.\nCook and stir sausage, celery, mushrooms, and onion in a skillet over medium heat until sausage is browned and vegetables are tender, 10 to 15 minutes; drain excess grease.\nCombine sour cream, Parmesan cheese, egg, and 1/4 teaspoon salt in a bowl. Stir sausage mixture into sour cream mixture.\nScoop the meat from the inside of squash, being careful not to tear the skin. Mash squash meat in a bowl.\nSpoon some of the sausage mixture into the hollowed squash, making a ring. Spoon a ring of mashed squash over sausage mixture. Continue layering until all the sausage mixture and mashed squash are used.\nBake in the oven until heated through, 20 to 25 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "4087341.jpg",
    "o": "",
    "st": "allrecipes"
}