{
    "id": 244641,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 tablespoons extra-virgin olive oil",
        "2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 cup milk",
        "2 pounds skinless, boneless chicken breast halves",
        "1 (8 ounce) package button mushrooms, sliced",
        "2 cups halved baby carrots",
        "1 onion, chopped",
        "2 cups red wine",
        "2 cups low-sodium chicken broth, or as needed",
        "2 teaspoons Italian seasoning",
        "1/2 teaspoon dried rosemary",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 514 kcal",
        "Carbs > 44.9 g",
        "Cholesterol > 91 mg",
        "Fat > 12 g",
        "Protein > 40.1 g",
        "Sodium > 391 mg"
    ],
    "n": "Simple and Easy Coq au Vin",
    "a": "CRawson",
    "r": "0",
    "s": 6,
    "des": "\"I always make this meal for dinner parties - it looks and tastes like it takes all day to prepare, but it's actually quite simple. The best part is that all the work is done before your guests arrive! Serve over rice or mashed potatoes.\"",
    "ins": "Heat olive oil in a large pot over medium-high heat. Mix flour, 1/2 teaspoon salt, 1/2 teaspoon pepper together in a shallow bowl. Pour milk into a separate bowl. Dip chicken in the milk, allowing excess milk to drip back into bowl. Dredge chicken through flour mixture until evenly coated.\nCook 1/2 of the chicken in the hot oil until browned, 2 to 3 minutes per side. Remove chicken from pot and brown remaining chicken. Return all the chicken to the pot.\nMix mushrooms, carrots, and onion into chicken, stirring gently to distribute vegetables among the chicken. Pour wine over chicken and vegetables, stirring with a wooden spoon to scrape up any browned bits from bottom of pot. Add enough chicken broth to nearly cover the chicken and vegetables.\nStir Italian seasoning, rosemary, salt, and pepper into broth mixture; bring to a boil. Cover pot, reduce heat to low, and simmer, stirring occasionally, until chicken is cooked through, about 1 hour. Remove lid and turn heat up to medium-high; boil, stirring occasionally, until sauce is reduced and thickened, about 15 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "2636125.jpg",
    "o": "",
    "st": "allrecipes"
}