{
    "id": 244783,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cookies:",
        "1 1/2 cups white sugar",
        "1 cup butter, softened",
        "2 eggs",
        "1 1/2 teaspoons vanilla extract",
        "3 1/2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "Icing:",
        "1/2 cup confectioners' sugar, or as needed",
        "1 teaspoon lemon juice, or as needed",
        "assorted food coloring"
    ],
    "nut": [
        "Calories > 133 kcal",
        "Carbs > 19.4 g",
        "Cholesterol > 24 mg",
        "Fat > 5.5 g",
        "Protein > 1.7 g",
        "Sodium > 86 mg"
    ],
    "n": "Back-to-School Cookies",
    "a": "barbara",
    "r": "0",
    "s": 36,
    "des": "\"I made these cookies for the first time when my oldest daughter started kindergarten and now I have to bake them every year when it's time for 'back to school!'\"",
    "ins": "Beat white sugar and butter together in a bowl using an electric mixer until smooth and creamy. Add eggs and vanilla extract and beat until well mixed. Stir flour, baking powder, and salt into creamed butter mixture until dough is evenly mixed. Chill dough in refrigerator, 3 hours to overnight.\nPreheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nRoll cookie dough on a floured work surface. Cut dough into strips about 2 1/2 inches long and about as thick as a pencil, forming one end into a point. Arrange \"pencils\" on the prepared baking sheet.\nBake in the preheated oven until lightly browned, 8 to 10 minutes. Transfer parchment paper with cookies to a wire rack to cool completely.\nMix enough confectioners' sugar and lemon juice together in a bowl to form a thick icing. Divide icing among several small bowls and mix different colors of food coloring into each bowl.\nDecorate \"pencil\" cookies with colored icing so they look like colored pencils. Allow icing to dry completely.",
    "pt": "30 m",
    "ct": "8 m",
    "tt": "4 h ",
    "i": "2937944.jpg",
    "o": "",
    "st": "allrecipes"
}