{
    "id": 244776,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 ounces dried wild mushrooms (such as porcini or shiitake)",
        "1 cup hot water",
        "6 slices bacon",
        "8 bone-in chicken thighs",
        "1/4 cup quick-mixing flour (such as WondraÂ®), or as needed",
        "salt and ground black pepper to taste",
        "1 bunch carrots, cut into matchstick-size pieces",
        "2 cups fresh mushrooms",
        "1/2 pound shallots, chopped",
        "2 cloves garlic, chopped",
        "1 (750 milliliter) bottle Burgundy red wine, divided",
        "1 cup chicken broth",
        "2 teaspoons herbes de Provence, tied into a cheesecloth bag",
        "5 sprigs fresh thyme",
        "3 bay leaves",
        "1 tablespoon chopped fresh parsley, or as desired"
    ],
    "nut": [
        "Calories > 382 kcal",
        "Carbs > 21.7 g",
        "Cholesterol > 72 mg",
        "Fat > 14.7 g",
        "Protein > 24.2 g",
        "Sodium > 422 mg"
    ],
    "n": "Coq au Vin (Chicken with Wine)",
    "a": "Joyce S",
    "r": "0",
    "s": 8,
    "des": "\"Recipe that I've developed from various sources. Serve with mashed potatoes.\"",
    "ins": "Put dried mushrooms in a bowl and pour in hot water; set aside until mushrooms are rehydrated.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels, reserving bacon grease in the skillet.\nCoat chicken thighs with flour and season with salt and pepper. Working in batches, cook chicken in the bacon grease over medium heat until browned, 2 to 3 minutes per side. Remove chicken thighs as they brown and place on a paper towel-lined plate.\nDrain dried mushrooms through cheesecloth, reserving liquid. Add drained mushrooms, carrots, fresh mushrooms, shallots, and garlic to skillet over medium-high heat; saute for 2 minutes. Pour 1 cup wine into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon until liquid is reduced, about 10 minutes.\nReturn chicken to the skillet and mix in remaining wine, chicken broth, herbes de Provence, thyme, and bay leaves. Liquid should partially cover chicken; if more liquid is needed, add reserved water from mushrooms. Cover skillet and simmer over low heat until chicken is no longer pink in the center, at least 1 hour. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\nRemove cover from skillet and simmer until sauce is thickened, about 15 minutes more. Add more quick-mixing flour to sauce to thicken, if desired.\nCrumble bacon over chicken and vegetables and garnish with parsley.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "4476828.jpg",
    "o": "",
    "st": "allrecipes"
}