{
    "id": 244771,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package linguine (such as BarillaÂ®)",
        "3 tablespoons extra-virgin olive oil",
        "1 (2 ounce) can anchovy fillets, drained",
        "6 cloves garlic, minced",
        "1 shallot, minced",
        "1 teaspoon kosher salt",
        "1/2 teaspoon red pepper flakes",
        "1/2 teaspoon dried thyme",
        "1/4 teaspoon dried oregano",
        "1/4 teaspoon dried basil",
        "1 small onion, finely chopped",
        "1/2 cup dry red wine",
        "2 (14 ounce) cans baby clams, 1 can drained",
        "1 (28 ounce) can crushed tomatoes",
        "salt and ground black pepper to taste",
        "1/2 cup chopped fresh parsley",
        "1 teaspoon lemon zest"
    ],
    "nut": [
        "Calories > 446 kcal",
        "Carbs > 53.2 g",
        "Cholesterol > 70 mg",
        "Fat > 9 g",
        "Protein > 35.4 g",
        "Sodium > 723 mg"
    ],
    "n": "Linguine With Red Clam Sauce",
    "a": "Tony Sabo",
    "r": "0",
    "s": 8,
    "des": "\"This recipe is awesome and we love to throw it together when we're craving some seafood and pasta!\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes; drain.\nHeat a large skillet over medium heat and add olive oil. Place anchovies in the hot oil, pressing with the back of a wooden spoon until anchovies are melted in the oil, 2 to 3 minutes. Add garlic, shallot, kosher salt, red pepper flakes, thyme, oregano, and basil; cook for 1 minute. Increase heat to medium-high and cook, stirring frequently, until onion and garlic start to soften, 3 to 4 minutes.\nPour wine over onion mixture and cook 1 to 2 minutes. Mix clams and their juice into onion mixture; cook and stir for 2 to 3 minutes. Stir tomatoes into clam mixture and cook until sauce is heated through, 2 to 3 minutes; season with salt and black pepper. Add linguine and 1/2 of the parsley to sauce and mix. Garnish with remaining parsley and lemon zest.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "4139775.jpg",
    "o": "",
    "st": "allrecipes"
}