{
    "id": 244812,
    "old_rating": "4.85714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 ounces unsalted butter plus additional for greasing",
        "3 egg whites",
        "1/2 cup white sugar",
        "1/2 cup almond meal",
        "3 tablespoons all-purpose flour plus additional for dusting pan",
        "1/4 teaspoon vanilla extract",
        "1/8 teaspoon salt",
        "12 small pieces of peeled peach"
    ],
    "nut": [
        "Calories > 115 kcal",
        "Carbs > 11.7 g",
        "Cholesterol > 15 mg",
        "Fat > 6.6 g",
        "Protein > 3 g",
        "Sodium > 40 mg"
    ],
    "n": "Peach Financiers",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"There are many different techniques used for making financiers but, as usual, I've chosen the easiest one. This recipe works beautifully with pretty much any summer fruit like berries or other stone fruit. Remember, the fruit is really just a garnish so don't use too much. These little cakes are rich, buttery, and moist.\"",
    "ins": "Preheat oven to 400 degrees F. Generously butter a 12-muffin mini-muffin tin. Add a pinch of flour to each cup; shake to coat bottoms.\nMelt butter in a saucepan over medium heat. The melted butter will get foamy. Keep pan moving to prevent burning, but continue toasting butter until it turns golden brown, about 4 minutes. Remove from heat.\nWhisk egg whites and sugar together in a large bowl. Whisk until sugar dissolves and egg whites get thick and foamy, 2 or 3 minutes. Mix in almond meal, flour, vanilla, and salt. Whisk in browned butter.\nFill muffin cups almost to the cop. Tap pan to eliminate any air bubbles.\nBake 5 minutes. Remove pan from oven, and top financiers with small pieces of peach. Transfer pan back to oven. Continue baking until browned, 10 to 12 more minutes.\nLet cool at least 10 minutes before removing from the pan.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}