{
    "id": 244899,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds Brussels sprouts, cut in half lengthwise",
        "4 ounces pancetta, coarsely chopped",
        "3 tablespoons extra virgin olive oil",
        "1 1/2 teaspoons kosher salt, divided",
        "2 tablespoons dark brown sugar, divided",
        "1 tablespoon unsalted butter",
        "1 cup whole pecans",
        "Reynolds WrapÂ® Aluminum Foil"
    ],
    "nut": [
        "Calories > 317 kcal",
        "Carbs > 20.6 g",
        "Cholesterol > 12 mg",
        "Fat > 24.6 g",
        "Protein > 9 g",
        "Sodium > 658 mg"
    ],
    "n": "Pancetta Brussels Sprouts with Caramelized Pecans",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 6,
    "des": "\"Explore the flavors of fall with this savory side from Eva Kosmas Flores of Adventures in Cooking.\"",
    "ins": "Preheat the oven to 400 degrees F. Toss the Brussels sprouts with pancetta, olive oil, 1 teaspoon salt and 1 tablespoon of the brown sugar. Place in a casserole pan and cover the pan with a sheet of Reynolds Wrap(R) Aluminum Foil.\nRoast for 30 minutes, then remove the foil and continue roasting until the Brussels sprouts are lightly browned around the edges, about 10 to 15 minutes more. Remove from oven and set aside.\nMelt the butter and remaining tablespoon brown sugar in a medium-sized frying pan over medium heat, stirring every few minutes. Once the sugar has melted, add the pecans and stir to coat. Let them sit for a few minutes until they smell toasty, then stir. Continue to stir every few minutes until most of the pecans are lightly browned and very aromatic.\nRemove the pan from the heat and empty the mixture onto a large baking sheet lined with Reynolds(R) Parchment Paper. Smooth the pecans so they are in one layer, then sprinkle with 1/2 teaspoon salt. Place the pan in the freezer for 10 minutes to allow the nuts to harden, then remove the pan and separate the pecans by hand.\nToss the roasted Brussels sprouts with caramelized pecans before serving.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "2579539.jpg",
    "o": "",
    "st": "allrecipes"
}