{
    "id": 244872,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups water",
        "3/4 cup millet",
        "4 zucchini, ends trimmed",
        "3 tablespoons ghee (clarified butter)",
        "1 onion, chopped",
        "1 red bell pepper, chopped",
        "2 cloves garlic, minced",
        "1 teaspoon sea salt",
        "1/4 cup water"
    ],
    "nut": [
        "Calories > 279 kcal",
        "Carbs > 38.9 g",
        "Cholesterol > 25 mg",
        "Fat > 11.5 g",
        "Protein > 6.6 g",
        "Sodium > 461 mg"
    ],
    "n": "Millet Stuffed Zucchini",
    "a": "Travis Trein",
    "r": "0",
    "s": 4,
    "des": "\"Millet has a great thick consistency when cooked up (kind of like mashed potatoes) which makes everything work well for this. I am on a pretty strict diet since I have candida, so this recipe is perfect for early stage candida diet and provides doing something a little different with millet.\"",
    "ins": "Bring 1 1/2 cups water and millet to a boil in a saucepan; reduce heat, cover saucepan, and simmer until water is absorbed, 10 to 15 minutes. Fluff millet with a fork.\nBring a pot of water to a boil; cook zucchini until slightly tender, about 5 minutes. Drain water. Cut zucchini in half lengthwise. Spoon meat out of center, leaving a 1/8- to 1/4-inch border in zucchini. Reserve zucchini meat.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat ghee in a skillet over medium heat; cook and stir onion, red bell pepper, and garlic until slightly soft, about 5 minutes. Stir millet, zucchini meat, and salt into onion mixture. Slowly pour 1/4 cup water into mixture while constantly stirring; cook until desired consistency is reached, 3 to 5 minutes.\nSpoon millet mixture into hollowed zucchini and place in a baking dish.\nBake in the preheated oven until browned on top, 15 to 20 minutes.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "50 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}