{
    "id": 244802,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "olive oil cooking spray (such as PAMÂ®)",
        "2 (8 ounce) cans refrigerated reduced-fat crescent roll dough (such as PillsburyÂ®)",
        "1 cup finely shredded mozzarella cheese",
        "1 pinch finely grated Parmesan cheese, or more to taste (optional)",
        "1 pinch parsley flakes, or more to taste (optional)",
        "1 pinch garlic powder, or more to taste (optional)",
        "8 small button mushrooms, halved",
        "8 slices pepperoni, halved",
        "16 pitted black olives, cut into slivers"
    ],
    "nut": [
        "Calories > 132 kcal",
        "Carbs > 12.9 g",
        "Cholesterol > 6 mg",
        "Fat > 6.7 g",
        "Protein > 4.2 g",
        "Sodium > 339 mg"
    ],
    "n": "Witch Hat Dippers",
    "a": "NomNomDelicious",
    "r": "0",
    "s": 16,
    "des": "\"A great snack for Halloween parties! Very versatile and easy to personalize for your own tastes. Serve them nice and hot with some dipping sauce, like Andrea's Marinara Sauce II.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Spray 2 baking sheets with cooking spray.\nLay a sheet of waxed paper onto a work surface. Unroll crescent dough and separate into 16 individual triangles. Cut each triangle in half lengthwise creating 32 isosceles triangles. Arrange triangles on the waxed paper.\nSprinkle a pinch of mozzarella cheese in a thin line parallel to the shortest edge of each triangle, ensuring the cheese doesn't touch the edges. Top the mozzarella cheese with Parmesan cheese and parsley flakes.\nRoll the short end of each triangle halfway toward the top point, creating a rim, and sprinkle garlic powder over dough. Place a mushroom half on half of the triangles, midway between the rim and the top point, and a pepperoni half in the same place on the remaining triangles. Place 1 or 2 olive slivers against the rim to form a \"ribbon\" or \"belt\" on each \"hat\". Place the \"hats\" on the prepared baking sheets.\nBake in the preheated oven until golden brown, 5 to 7 minutes.",
    "pt": "30 m",
    "ct": "5 m",
    "tt": "35 m",
    "i": "2611798.jpg",
    "o": "",
    "st": "allrecipes"
}