{
    "id": 244896,
    "old_rating": "4.54839",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 pounds chicken wings, cut apart at joints, wing tips discarded",
        "3 tablespoons sesame oil",
        "1 teaspoon sea salt",
        "1/2 cup honey",
        "3 tablespoons soy sauce",
        "3 tablespoons fish sauce",
        "1 tablespoon grated lime zest",
        "1 tablespoon grated fresh ginger",
        "4 cloves garlic, minced",
        "3 tablespoons lime juice",
        "2 tablespoons sriracha hot sauce",
        "1/4 cup diced green onions",
        "2 tablespoons sesame seeds",
        "Reynolds WrapÂ® Aluminum Foil"
    ],
    "nut": [
        "Calories > 500 kcal",
        "Carbs > 40.9 g",
        "Cholesterol > 96 mg",
        "Fat > 21.7 g",
        "Protein > 37.2 g",
        "Sodium > 2363 mg"
    ],
    "n": "Crispy Honey Garlic Sriracha Wings",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 4,
    "des": "\"You won't have to choose between sweet and spicy with these finger-licking wings from Dennis Prescott of Dennistheprescott.\"",
    "ins": "Preheat oven to 425 degrees F. Place wings in a large bowl and drizzle with sesame oil. Season with sea salt, and toss so all of the wings are coated in the oil.\nIn a bowl, combine honey, soy sauce, fish sauce, lime, ginger, garlic and sriracha.\nCover bowl with foil and set aside.\nLine 2 baking sheets with Reynolds Wrap(R) Aluminum Foil. Place a baking rack on top of the foil. Lay out your wings in a single layer on the rack, leaving space between each piece of chicken. Bake, turning halfway through, for 50-55 minutes until the skin is nice and crispy.\nReserve 2 tablespoons of the sauce. Brush the remaining sauce over the top and bottom of your chicken wings  and bake for 10 minutes until they're golden brown and caramelized.\nRemove from oven and transfer wings to a serving platter. Brush the reserved sauce over the wings, and sprinkle with green onions and sesame seeds. Serve immediately.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "2579501.jpg",
    "o": "",
    "st": "allrecipes"
}