{
    "id": 244979,
    "old_rating": "4.80645",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Spice Blend:",
        "1 tablespoon kosher salt, plus more to taste",
        "2 teaspoons ground coriander",
        "2 teaspoons ground cumin",
        "1 teaspoon ground turmeric",
        "1 teaspoon paprika",
        "1/2 teaspoon cayenne pepper",
        "2 1/2 pounds skinless, boneless chicken thighs, cut into 2-inch pieces",
        "2 tablespoons vegetable oil",
        "1 large yellow onion, chopped",
        "6 cloves garlic, minced",
        "1 tablespoon finely grated fresh ginger",
        "3 1/2 cups chicken broth, or to taste",
        "3/4 cup unsweetened natural peanut butter",
        "1/2 cup ketchup",
        "1 tablespoon packed brown sugar",
        "1 pound zucchini, cut into chunks",
        "1 red bell pepper, cut into chunks",
        "1 green poblano pepper, diced",
        "2 cups hot cooked rice",
        "1 lime, for garnish",
        "1/2 cup roasted peanuts, plus more for garnish",
        "3 tablespoons chopped fresh cilantro, for garnish"
    ],
    "nut": [
        "Calories > 1138 kcal",
        "Carbs > 64.5 g",
        "Cholesterol > 164 mg",
        "Fat > 71.1 g",
        "Protein > 67.7 g",
        "Sodium > 3048 mg"
    ],
    "n": "Chef John's Peanut Curry Chicken",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"I decided to not follow any specific recipe from any particular country or culture, but instead I made a simple composite of every peanut curry I've ever come across.Â I didn't use coconut milk, as I feel that's a little too sweet and rich for the peanut butter. I loved how this came out, and I can't imagine it being any richer.\"",
    "ins": "Mix salt, coriander, cumin, turmeric, paprika, and cayenne pepper together in a small bowl.\nPlace chicken pieces in a separate bowl and add 1/2 of the spice blend. Mix together thoroughly to coat each surface with spice blend.\nHeat oil over high heat in a heavy pot. Brown half of the chicken pieces on all sides. Transfer to a bowl. Repeat with the rest of the chicken.\nReduce heat to medium and add onion to pot. Saute until onions start to turn translucent and golden, 1 or 2 minutes. Add garlic and ginger; cook about 1 minute. Stir in remaining spice blend; cook and stir one minute. Pour in chicken broth. Add browned chicken along with accumulated juices. Stir in peanut butter and ketchup; add brown sugar. Bring to a simmer and reduce heat to maintain a gentle, steady simmer. Simmer, stirring occasionally, about 30 minutes.\nTransfer zucchini, red bell pepper, poblano pepper, and peanuts to the pot. Stir to mix. Continue simmering until chicken and vegetables are fork tender, 30 to 40 minutes. Remove from heat.\nServe over rice with a squeeze of lime and a sprinkle of peanuts and chopped cilantro.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4540874.jpg",
    "o": "4540874.jpg,4526212.jpg,4525495.jpg,4513776.jpg,4509083.jpg,4508077.jpg",
    "st": "allrecipes"
}