{
    "id": 244900,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 baguettes",
        "8 ounces unsalted butter",
        "2 large cloves garlic, peeled and crushed",
        "1 cup packed finely grated Parmesan cheese",
        "1 small bunch Italian flat leaf parsley, larger stems removed",
        "1 tablespoon sea salt",
        "Reynolds WrapÂ® Aluminum Foil"
    ],
    "nut": [
        "Calories > 616 kcal",
        "Carbs > 73.2 g",
        "Cholesterol > 69 mg",
        "Fat > 28 g",
        "Protein > 19.3 g",
        "Sodium > 1648 mg"
    ],
    "n": "Parmesan Garlic Bread from Reynolds WrapÂ®",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 8,
    "des": "\"Find the perfect complement for any meal with this tasty side dish from April Bloomfield of A Girl and Her Pig.\"",
    "ins": "Position a rack in the center of the oven and preheat to 450 degrees F.\nCombine the butter, garlic cloves, Parmesan and parsley in a food processor and blend until the mixture is very finely textured and a bright green color (the brighter green, the better).\nWith a knife, cut slices into the tops of the baguettes roughly 1-1 1/2 inches between each slice. Do not go all the way down or the bread will fall apart or slice in half. Use a small spoon or spatula to swipe a generous dollop of the parsley-garlic mixture in each slice.\nTear off 2 sheets of Reynolds Wrap(R) Aluminum Foil per baguette, ensuring the foil is longer than the length of the baguette (12x18 inches); place the baguette on the sheets of foil. Bring up foil sides. Double fold top and ends to seal packet, leaving room for heat circulation inside. Close up the ends nice and tight.\nBake for 10-15 minutes. Open packets carefully by cutting along top fold with a sharp knife, allowing steam to escape; then open top of foil packet. The bottom and top should be crisp; if not, open up the foil and bake for a few more minutes. Sprinkle a bit more salt on the top and serve while still hot, crispy and steamy.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "2579537.jpg",
    "o": "",
    "st": "allrecipes"
}