{
    "id": 244909,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds pork shoulder",
        "1 cup clear carbonated beverage, like club soda or lemon-lime soda",
        "2 teaspoons minced garlic",
        "2 teaspoons chili powder",
        "1 teaspoon ground oregano",
        "2 tablespoons Worcestershire sauce",
        "1 cup balsamic vinaigrette salad dressing",
        "1 ReynoldsÂ® Slow Cooker Liner",
        "Reynolds WrapÂ® Aluminum Foil"
    ],
    "nut": [
        "Calories > 242 kcal",
        "Carbs > 4 g",
        "Cholesterol > 55 mg",
        "Fat > 17.2 g",
        "Protein > 17.4 g",
        "Sodium > 391 mg"
    ],
    "n": "Super Easy Slow Cooker Pork",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 9,
    "des": "\"Get cozy with this scrumptious slow-cooker meal from Lindsay Ostrom of Pinch of Yum.\"",
    "ins": "Line your slow cooker with a Reynolds(R) Slow Cooker Liner. Place the pork, soda, garlic, chili powder, oregano, and Worcestershire sauce in the slow cooker. Cover and cook on high for 4-5 hours or low for 6-8 hours.\nWhen the meat falls apart easily, remove the meat from the slow cooker liner and transfer to a cutting board. Shred it with two forks. Place meat back in the lined slow cooker and add the balsamic dressing and stir with the liquid in the slow cooker. The meat should be saucy and moist.\nPreheat the oven to 400 degrees F (or use the broil setting if you have that) transfer the mixture to a baking sheet lined with Reynolds Wrap(R) Aluminum Foil. Spread it in an even, thin layer and cook in the preheated oven until the juices are bubbling and the edges are crispy, 10-15 minutes (5-7 minutes if you have a broil setting).\nTransfer to a serving platter and enjoy on sandwiches, with a baked potato, or however else you want to enjoy it.",
    "pt": "15 m",
    "ct": "4 h",
    "tt": "4 h ",
    "i": "2579512.jpg",
    "o": "",
    "st": "allrecipes"
}