{
    "id": 244914,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (8 1/2-inch) rice paper wrappers",
        "1 cooked chicken breast half, cut into thin strips",
        "1 red bell pepper, cut into thin strips",
        "1 English cucumber, cut into thin strips",
        "1 carrot, cut into thin strips",
        "4 sprigs chopped fresh basil",
        "4 sprigs chopped fresh mint",
        "4 sprigs chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 146 kcal",
        "Carbs > 9.3 g",
        "Cholesterol > 41 mg",
        "Fat > 4.3 g",
        "Protein > 17 g",
        "Sodium > 49 mg"
    ],
    "n": "Chef John's Fresh Spring Rolls",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"I love the 'authentic\n' spring rolls I so often order at my friendly, neighborhood Vietnamese restaurant.Â But in this recipe, I'm showing a technique and you can fill the rolls with whatever you have on hand. You should be able to get rice paper wrappers at any large grocery store with an Asian food section but if not, they're easily found online.\"",
    "ins": "The strips of chicken and vegetables should be no longer than about 6 inches to leave an inch margin open on the sides of the wrappers for tucking.\nSoak a rice paper wrapper in cold water just until it becomes flexible, 1 minute or less. Place on slightly damp towel. Place some baby greens near the bottom of the round. Top with strips of chicken and pepper, leaving about an inch margin on the sides. Roll tightly just until the bottom edge meets the center of the paper and sticks there. Then continue to add more chicken strips and vegetable strips. Finish with torn pieces of herbs. Complete the roll, pressing the ingredients to keep roll tight and tucking in the sides.\nTransfer completed rolls to a plate lined with damp paper towels. Cover each roll with damp papers towels as you work to prevent them from drying out; don't let the rolls touch each other or they will stick together.",
    "pt": "15 m",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}