{
    "id": 244964,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (15.25 ounce) package yellow cake mix (such as Betty CrockerÂ®)",
        "1 cup water",
        "3 eggs",
        "1/2 cup vegetable oil",
        "1 (16 ounce) package prepared chocolate frosting",
        "18 lollipop sticks",
        "1 (14 ounce) bag chocolate candy melts",
        "1 (.75 ounce) tube decorating icing"
    ],
    "nut": [
        "Calories > 378 kcal",
        "Carbs > 46 g",
        "Cholesterol > 31 mg",
        "Fat > 22.8 g",
        "Protein > 4.1 g",
        "Sodium > 236 mg"
    ],
    "n": "Simple Cake Pops",
    "a": "Miss Amy",
    "r": "0",
    "s": 18,
    "des": "\"Everyone loves cake pops! They are simple to make, and you can create anything for any occasion. They are also nice small bites of dessert instead of large slices of cake or pie. Can be made up in partial batches and the remaining ingredients stored for a few weeks.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nBeat cake mix, water, eggs, and oil in a bowl using an electric mixer on low speed for 30 seconds. Increase speed to medium and beat for 2 minutes more. Pour batter into the prepared baking dish.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 28 to 33 minutes. Cool completely, at least 1 hour.\nCrumble cake into a large bowl. Stir frosting into cake crumbles until mixture is sticky but not too smooth. Chill in refrigerator, at least 30 minutes.\nRoll cake mixture into 1 1/2-inch balls and arrange on a baking sheet. Place 1 lollipop stick into each ball.\nMelt about 1/4 cup chocolate candy melts in a microwave-safe bowl in the microwave, about 20 seconds. Dip each cake pop in the melted chocolate. Repeat melting chocolate and dipping remaining cake pops. Decorate pops with decorating icing.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}