{
    "id": 244986,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large Pink Lady apple - peeled, cored and diced",
        "1 large Bartlett pear - peeled, cored and diced",
        "1/4 cup brown sugar",
        "1 tablespoon vanilla extract",
        "2 teaspoons cornstarch",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/4 teaspoon ground cloves",
        "1 pinch salt",
        "1 egg",
        "1 tablespoon water",
        "1 recipe pastry for a 9-inch double crust pie",
        "2 tablespoons coarse granulated sugar, or as needed (optional)",
        "1/2 cup dark chocolate chips (optional)"
    ],
    "nut": [
        "Calories > 125 kcal",
        "Carbs > 18.1 g",
        "Cholesterol > 12 mg",
        "Fat > 5.5 g",
        "Protein > 1.5 g",
        "Sodium > 75 mg"
    ],
    "n": "Autumn Spiced Apple and Pear Hand Pies",
    "a": "Chef V",
    "r": "0",
    "s": 16,
    "des": "\"Close your eyes when you take a bite of these and you can almost hear the crunch of leaves beneath your feet. These taste and smell like autumn, my favorite season. I like to add a drizzle of dark chocolate at the end; it makes them extra special!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nStir apple, pear, brown sugar, vanilla extract, cornstarch, cinnamon, nutmeg, cloves, and salt together in a bowl. Whisk egg and water together in a small bowl.\nRoll pastry out on a lightly floured surface; cut into circles with a 3- to 4-inch round cookie cutter. Spoon a small amount of apple mixture onto center of each pastry circle; fold circles in half and press firmly to seal edges. Crimp with a fork, if desired. Place pies on prepared baking sheet.\nCut 3 small slits in top of each hand pie with a sharp knife. Brush surface of pies with egg mixture; sprinkle with decorating sugar.\nBake in the preheated oven until lightly golden, about 25 minutes; allow pies to cool to room temperature, about 20 minutes.\nMelt chocolate chips in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, 1 to 2 minutes. Drizzle melted chocolate over pies.",
    "pt": "1 h",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "4138565.jpg",
    "o": "",
    "st": "allrecipes"
}