{
    "id": 244984,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/4 teaspoon baking soda",
        "1 1/2 cups white sugar",
        "3/4 cup butter, softened",
        "2 tablespoons grated orange zest",
        "3 large eggs",
        "1 cup heavy whipping cream",
        "1/2 cup fresh Cara Cara orange juice",
        "1 tablespoon vanilla extract"
    ],
    "nut": [
        "Calories > 204 kcal",
        "Carbs > 25.5 g",
        "Cholesterol > 52 mg",
        "Fat > 10.2 g",
        "Protein > 2.7 g",
        "Sodium > 126 mg"
    ],
    "n": "Cara Cara Cupcakes",
    "a": "cheesemite",
    "r": "0",
    "s": 24,
    "des": "\"Intense, deep pink Cara Cara oranges bring bright citrus flavor to vanilla butter cupcakes. If you feel they need dressing up, dust with confectioner's sugar, add a generous tablespoon of orange zest to a vanilla buttercream, or contrast with a milk chocolate or cream cheese icing.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line 24 standard muffin cups with papers.\nWhisk flour, baking powder, salt, and baking soda together in a large bowl.\nBeat white sugar, butter, and orange zest together in a bowl with an electric mixer at medium speed until light and fluffy, about 3 minutes; beat in eggs, one at a time, beating well after each addition.\nStir cream, orange juice, and vanilla extract together in a cup.\nBeat flour mixture into butter mixture on low speed in 3 batches, alternating with cream mixture and ending with flour mixture, just until fully combined. Fill prepared muffin cups 3/4 full with batter.\nBake in the preheated oven until a toothpick inserted near the center comes out clean, about 25 minutes. Allow to cool completely on a wire rack, about 30 minutes.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}