{
    "id": 244906,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 plums, halved and pitted",
        "4 pears, halved lengthwise and cored (stems removed)",
        "4 apples, halved lengthwise and cored (stems removed)",
        "12 fresh sage leaves",
        "4 tablespoons honey plus additional for drizzling, divided",
        "4 tablespoons butter, divided",
        "Sea salt to taste",
        "Creme fraiche for topping",
        "Reynolds WrapÂ® Aluminum Foil"
    ],
    "nut": [
        "Calories > 505 kcal",
        "Carbs > 93.2 g",
        "Cholesterol > 47 mg",
        "Fat > 18.1 g",
        "Protein > 2.4 g",
        "Sodium > 223 mg"
    ],
    "n": "Sage-Roasted Market Fruit",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 3,
    "des": "\"Delight in the tastes of your favorite seasonal fruits with this easy dessert from Karen Mordechai of Sunday Suppers.\"",
    "ins": "Preheat oven to 400 degrees F. Cut 8 (18x18-inch) squares of Reynolds Wrap(R) Aluminum Foil. Divide fruits evenly onto 4 of the squares and add one tablespoon of butter, 1 tablespoon of honey and 3 sage leaves to each. Center fruit on a sheet of foil.\nPlace remaining 4 foil squares on top of and around each collection of fruit to form a \"pouch.\" Double fold top and ends to seal packet, leaving room for heat circulation inside. Bake in oven for 20-25 minutes, until fruit is tender. Open packets carefully by cutting fold with a sharp knife, allowing steam to escape; then open foil packet.\nSet oven to broil. Once ready, return fruit, uncovered, to oven and broil for five minutes, until edges of fruit are beginning to caramelize. Remove from oven and allow to cool before serving.\nServe warm with a dollop of cold creme fraiche, a sprinkle of sea salt, and additional honey to taste.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "2579540.jpg",
    "o": "",
    "st": "allrecipes"
}