{
    "id": 244931,
    "old_rating": "3.90909",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound thinly sliced chicken breasts, cut into thin strips",
        "3 limes, juiced, divided",
        "2 teaspoons ground cumin, divided",
        "2 teaspoons garlic powder, divided",
        "2 teaspoons ground chipotle pepper, divided",
        "2 red bell peppers, cut into thin strips",
        "1 red onion, thinly sliced",
        "2 jalapeno peppers - stemmed, seeded, and thinly sliced",
        "4 multi-grain tortillas, or more to taste",
        "1 bunch cilantro, chopped"
    ],
    "nut": [
        "Calories > 272 kcal",
        "Carbs > 37.2 g",
        "Cholesterol > 65 mg",
        "Fat > 3.9 g",
        "Protein > 29.3 g",
        "Sodium > 294 mg"
    ],
    "n": "\"Skinny\" Chicken Tacos",
    "a": "Danielle B.",
    "r": "0",
    "s": 4,
    "des": "\"Zesty, easy, and quick way to make chicken tacos that are delicious and diet-friendly. Other options for toppings would be low-fat sour cream, 2% reduced-fat Mexican cheese blend, and salsa.\"",
    "ins": "Combine chicken, juice of 1 lime, 1 teaspoon cumin, 1 teaspoon garlic powder, and 1 teaspoon chipotle pepper in a bowl; allow to marinate for 10 minutes.\nSaute red bell peppers, onion, jalapeno peppers, juice of 1 lime, 1 teaspoon cumin, 1 teaspoon garlic powder, and 1 teaspoon chipotle pepper in a large non-stick skillet over medium-high heat until vegetables are tender yet crisp, about 5 minutes.\nTransfer chicken mixture to a separate non-stick skillet over medium-high heat; saute until chicken is no longer pink in the center, 5 to 10 minutes.\nLayer tortillas between paper towels on a microwave-safe plate; heat in microwave until warmed, 10 to 20 seconds.\nSpoon vegetables and chicken onto tortillas; top with cilantro and lime juice.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "35 m",
    "i": "2599563.jpg",
    "o": "",
    "st": "allrecipes"
}