{
    "id": 245099,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup reduced-sodium soy sauce",
        "1/4 cup dry sherry",
        "3 tablespoons honey",
        "2 tablespoons cornstarch",
        "3/4 pound boneless pork loin, thinly sliced",
        "3 cups SwansonÂ® Unsalted Chicken Broth",
        "2 tablespoons vegetable oil",
        "1 (2 inch) piece fresh ginger root, peeled and thinly sliced",
        "2 cloves garlic, thinly sliced",
        "1 tablespoon chili garlic sauce",
        "1 teaspoon sesame oil",
        "1 (10 ounce) package broccoli coleslaw mix",
        "1 (8 ounce) can sliced water chestnuts, drained",
        "1 (6 ounce) package snow peas",
        "2 cups hot steamed rice, or as needed",
        "1 teaspoon sesame seeds, for garnish (optional)"
    ],
    "nut": [
        "Calories > 469 kcal",
        "Carbs > 58.7 g",
        "Cholesterol > 40 mg",
        "Fat > 15.9 g",
        "Protein > 20.8 g",
        "Sodium > 887 mg"
    ],
    "n": "Ginger Pork and Vegetable Stir-fry",
    "a": "Bibi",
    "r": "0",
    "s": 4,
    "des": "\"This skillet meal comes together in a flash! Add egg rolls, some hot steamed rice, and fortune cookies for make-at-home Chinese instead of take-out!\"",
    "ins": "Whisk soy sauce, sherry, honey, and cornstarch together in a small bowl.  Add pork slices, coat evenly, and set aside.\nPour Swanson(R) Unsalted Chicken Broth into a small saucepan.  Bring to a boil, simmer until reduced to one and one half cups.  Set aside.\nHeat oil in a large, non-stick skillet over medium high heat. Add ginger and garlic; stir until ginger and garlic are lightly browned and fragrant, 1 or 2 minutes.  Remove with slotted spoon and discard.\nTransfer pork mixture to skillet over medium-high heat, constantly stirring and separating pork slices into a single layer, 3 or 4 minutes. Add reduced broth, stirring quickly to blend with the sauce, about 1 minute. Stir in chili garlic sauce and sesame oil. Add broccoli slaw, water chestnuts, and snow peas, stirring to coat with sauce. Cook to desired crispness, 1 or 2 more minutes.\nServe over hot steamed rice, and garnish with sesame seeds.",
    "pt": "10 m",
    "ct": "8 m",
    "tt": "18 m",
    "i": "2658994.jpg",
    "o": "",
    "st": "allrecipes"
}