{
    "id": 245090,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 tablespoons butter, divided",
        "1 1/2 pounds baby bella (crimini) mushrooms, sliced",
        "1/4 cup chopped sweet onion",
        "1/2 lemon, juiced",
        "1/2 teaspoon dried thyme",
        "5 tablespoons all-purpose flour",
        "1 1/4 cups SwansonÂ® Chicken Broth",
        "1/3 cup Marsala wine",
        "2 tablespoons half-and-half",
        "salt and pepper to taste",
        "1 (17.3 ounce) package frozen puff pastry, thawed",
        "1 egg, beaten"
    ],
    "nut": [
        "Calories > 496 kcal",
        "Carbs > 37.2 g",
        "Cholesterol > 48 mg",
        "Fat > 33.2 g",
        "Protein > 10 g",
        "Sodium > 428 mg"
    ],
    "n": "Elegant Mushroom Pie Recipe",
    "a": "lutzflcat",
    "r": "0",
    "s": 8,
    "des": "\"This is a savory and tasty main course with lovely presentation suitable for an elegant dinner, fancy brunch or any special occasion. It won't fail to impress.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Spray a 9-inch pie plate with non-fat cooking spray.\nMelt 3 tablespoons butter in a large skillet over medium heat. Add mushrooms, and onions, stirring occasionally, until liquid from the mushrooms has cooked down, about 10 minutes. Stir in lemon juice and thyme and simmer 2 minutes.\nMelt 3 tablespoons butter in a separate saucepan. Whisk in flour and stir constantly for about 1 minute. Gradually add the Swanson(R) Chicken Broth, Marsala, and half-and-half, whisking until sauce is smooth and thickened, about 3 minutes. The sauce should be very thick. Season to taste with salt and pepper.\nTransfer the mushroom mixture to the sauce broth/Marsala mixture; stir well.\nRoll out one sheet of puff pastry to fit the pie plate. Press evenly into the bottom and sides of the pie plate; trim the excess pastry. Spoon the mushroom mixture into the pastry shell.\nRoll out the second sheet of puff pastry, and place on top. Trim excess, and crimp the edge to seal. Cut a few slits in the top for steam to escape. Brush the top of the pie with the beaten egg.\nBake in the preheated oven until golden brown and mushroom mixture is bubbly, about 40 minutes. Allow the pie to cool slightly before serving.",
    "pt": "25 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "2658964.jpg",
    "o": "",
    "st": "allrecipes"
}