{
    "id": 245028,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 cups water",
        "1 lemon, zested and juiced",
        "4 Bosc pears - cored, peeled, stems left on",
        "1 vanilla bean",
        "3 cups sugar",
        "1 cup prepared hot fudge topping, or as needed",
        "1 cup vanilla ice cream, or as needed"
    ],
    "nut": [
        "Calories > 1060 kcal",
        "Carbs > 240.9 g",
        "Cholesterol > 15 mg",
        "Fat > 13.5 g",
        "Protein > 4.2 g",
        "Sodium > 252 mg"
    ],
    "n": "Poached Pears Belle Helene",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"They say Auguste Escoffier created this dish in honor of the opera, La Belle Helene, but we chefs know the real reason. How else are you going to use up bruised pears in such a delicious and beautiful way?\"",
    "ins": "Place water in a heavy pot. Stir in zest and juice of 1 lemon. Place pears in pot. Split the vanilla bean lengthwise and scrape out the seeds. Add the seeds and split pods to the poaching liquid. Pour in sugar.\nBring pot to a simmer over medium-high heat; stir gently to dissolve sugar with minimal jostling of the pears. Reduce heat so pears continue cooking over a steady, gentle simmer. Pears need to stay submerged, so place a small plate over them in the pot to keep them under the liquid. Simmer until pears are just tender, 20 to 25 minutes. (Remove plate to test the pears for doneness.) Remove pot from heat and let pears cool to room temperature in the poaching liquid.\nTransfer pears and vanilla beans to a storage container and cover with some of the poaching liquid. Cover and refrigerate until pears are thoroughly chilled, several hours or overnight. Reserve all of the poaching liquid (see footnote).\nHeat hot fudge sauce in a saucepan over medium heat until warm. Dip base of pear into the chocolate and spoon chocolate along the sides except for the top inch or so of the pear.\nPlace dipped pears in individual serving bowls with another generous spoonful of syrup and a small scoop of vanilla ice cream.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "3 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}