{
    "id": 245033,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Jam:",
        "1 (12 ounce) package fresh or frozen cranberries (not thawed if frozen)",
        "2/3 cup white sugar",
        "1/2 cup water",
        "Dough:",
        "1 1/2 cups all-purpose flour",
        "1 cup rolled oats (not quick-cooking)",
        "2/3 cup chopped pecans or walnuts",
        "3/4 cup packed light brown sugar",
        "3/4 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon nutmeg",
        "1/2 cup unsalted butter at room temperature - cut into 1-tablespoon chunks"
    ],
    "nut": [
        "Calories > 201 kcal",
        "Carbs > 30.4 g",
        "Cholesterol > 14 mg",
        "Fat > 8.5 g",
        "Protein > 2.2 g",
        "Sodium > 89 mg"
    ],
    "n": "Cranberry Jam Bars",
    "a": "RuthE",
    "r": "0",
    "s": 18,
    "des": "\"Cranberries are one of only three fruits native to North America, so what could be better to help celebrate an authentic Thanksgiving? The dough and jam can be made 3 days ahead and chilled separately.\"",
    "ins": "Bring cranberries, sugar, and water to a boil in a saucepan over medium heat, stirring frequently. Reduce heat and simmer, stirring and mashing cranberries, until mixture is very thick, about 15 minutes. Cool completely, about 30 minutes.\nPreheat oven to 350 degrees F. Line bottom and sides of an 8-inch square baking pan with foil and spray with cooking spray.\nPulse flour, rolled oats, pecans, brown sugar, baking powder, salt, cinnamon, and nutmeg in a food processor 3 times to mix. Add butter and pulse until mixture begins to clump. Firmly press half of dough evenly in bottom of prepared pan. Spread with jam, then sprinkle on remaining dough and gently press into an even layer.\nBake until golden brown, 45 to 50 minutes. Cool completely in pan on a rack. Lift foil to remove pastry from pan and cut into bars.",
    "pt": "25 m",
    "ct": "1 h",
    "tt": "2 h ",
    "i": "3128295.jpg",
    "o": "",
    "st": "allrecipes"
}