{
    "id": 245038,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Filling:",
        "1 (8 ounce) package cream cheese, softened",
        "1/2 cup confectioners' sugar",
        "1/2 cup sweetened flaked coconut (optional)",
        "1 egg",
        "1 teaspoon vanilla extract",
        "Cake:",
        "1 3/4 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon ground cloves",
        "1 cup brown sugar",
        "1/3 cup shortening",
        "3 eggs",
        "1 cup pumpkin puree",
        "1/2 cup raisins (optional)",
        "1/2 cup chopped pecans (optional)"
    ],
    "nut": [
        "Calories > 318 kcal",
        "Carbs > 40.6 g",
        "Cholesterol > 71 mg",
        "Fat > 15.7 g",
        "Protein > 5.5 g",
        "Sodium > 275 mg"
    ],
    "n": "Pumpkin BundtÂ® Cake",
    "a": "mamabird",
    "r": "0",
    "s": 14,
    "des": "\"I'm asked to bring this great cake to every family gathering. A cream cheese filling hides inside the cake. It's a hit!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Generously grease a fluted tube pan (such as Bundt(R)).\nBeat cream cheese and confectioners' sugar together in a bowl using an electric mixer until smooth; beat in coconut, 1 egg, and 1 teaspoon vanilla extract.\nCombine flour, baking powder, salt, ginger, and cloves together in a bowl. Beat brown sugar and shortening together in a separate bowl using an electric mixer until smooth and creamy. Add 3 eggs to creamed mixture, 1 at a time, beating well after each addition. Beat pumpkin into creamed mixture. Stir flour mixture into creamed mixture just until batter is moistened; fold in raisins and pecans.\nPour 1/3 of the batter into the prepared pan; top with cream cheese filling. Pour remaining batter over filling.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, about 1 hour. Cool completely before removing from pan.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}