{
    "id": 245148,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Chicken:",
        "3 skinless, boneless chicken breast halves, cut in half lengthwise to make thin cutlets",
        "salt and ground black pepper to taste",
        "1 tablespoon canola oil or other neutral-flavor cooking oil",
        "1/4 cup shallots, minced",
        "1 tablespoon apple cider vinegar",
        "2 cups sweet apple cider",
        "1 tart apple, such as Granny Smith - peeled, cored and thinly sliced",
        "1 sweet apple, such as Gala or Fuji - peeled, cored and thinly sliced",
        "1 cup chicken broth",
        "3 teaspoons cornstarch",
        "2 tablespoons fresh thyme leaves",
        "1 teaspoon Dijon mustard",
        "salt and pepper to taste",
        "Sides:",
        "3 cups cooked wild rice or brown rice, or combination of the two"
    ],
    "nut": [
        "Calories > 362 kcal",
        "Carbs > 56.2 g",
        "Cholesterol > 45 mg",
        "Fat > 5.9 g",
        "Protein > 22.2 g",
        "Sodium > 404 mg"
    ],
    "n": "Apple Cider Chicken with Wild Rice",
    "a": "NestleÂ® BenefulÂ®",
    "r": "0",
    "s": 4,
    "des": "\"Apple slices, cider, thyme and mustard bring incredible, rich flavors to this easy chicken dinner. Wild or brown rice makes a perfect side dish.\"",
    "ins": "Season chicken cutlets with salt and pepper.\nGet a skillet very hot. Once it is hot, add oil to it and brown the chicken on both sides. Cook for about 5 minutes on each side, until it's a nice, golden color. Remove from the pan and set aside on a plate. It's okay that it's undercooked, it will finished cooking in the sauce.\nOver high heat, brown the shallots.\nAdd cider vinegar and scrape the bottom of the pan, getting all the shallots and any leftover browned chicken bits.\nBefore the vinegar evaporates, add the cider and the apple slices. Let this reduce on high for about 3 minutes. The apples and shallots will get very tender.\nWhile they reduce, mix the chicken broth and the cornstarch until there are no lumps left, then slowly add it to the bubbling cider and apples, stirring all the time while the sauce thickens.\nMix in thyme, mustard, salt and pepper.\nReturn the chicken and its juices back into the sauce, turn down to medium-low and summer for at least 10 minutes, or until the chicken is cooked all the way through. Serve with hot cooked rice.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "2731461.jpg",
    "o": "",
    "st": "allrecipes"
}