{
    "id": 245109,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package dry spaghetti",
        "7 tablespoons butter, divided",
        "1 cup sliced mushrooms",
        "1/4 cup chopped onions",
        "1/2 teaspoon chopped garlic",
        "5 tablespoons all-purpose flour",
        "2 cups SwansonÂ® Chicken Broth",
        "1 cup half-and-half",
        "1 teaspoon salt",
        "1/2 teaspoon poultry seasoning",
        "1/4 teaspoon freshly ground black pepper",
        "3 cups diced cooked turkey",
        "1 cup frozen peas",
        "1/2 cup grated Parmesan cheese",
        "1/2 cup Italian-style panko bread crumbs",
        "2 tablespoons chopped fresh parsley, or to taste"
    ],
    "nut": [
        "Calories > 550 kcal",
        "Carbs > 45.9 g",
        "Cholesterol > 111 mg",
        "Fat > 25.9 g",
        "Protein > 32.8 g",
        "Sodium > 1146 mg"
    ],
    "n": "Top-Notch Turkey Tetrazzini",
    "a": "lutzflcat",
    "r": "0",
    "s": 6,
    "des": "\"Enjoy another delicious turkey dinner by using some of that leftover Holiday turkey. SwansonÂ® Chicken Broth brings rich flavor and moistness to this traditional casserole\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x13-inch casserole dish with non-stick cooking spray.\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until tender yet firm to the bite, about 10 minutes. Drain well. Keep warm.\nMelt 4 tablespoons butter in a skillet over medium heat. Cook and stir mushrooms and onions until onions begin to turn translucent and mushrooms release some liquid, about 5 minutes. Add garlic and stir until fragrant, about 1 minutes. Add flour, stirring constantly, until thoroughly incorporated in the butter and begins to bubble, about 2 minutes.\nMix the Swanson(R) Chicken Broth and half-and-half together; pour gradually into mushroom mixture, whisking until it is smooth. Season with salt, poultry seasoning, and pepper. Bring to a boil, stirring occasionally. Reduce and continue cooking until mixture begins to thicken, about 3 minutes. Mix in turkey and peas. Remove from heat.\nMelt 3 tablespoons butter in a small saucepan over low heat. Stir in the Parmesan cheese and panko bread crumbs, mixing until crumbly. Remove from heat.\nPlace 1/2 of the spaghetti in the bottom of prepared casserole dish. Spoon 1/2 of the sauce mixture over the spaghetti. Repeat the layer with the remaining spaghetti and sauce. Sprinkle the bread crumb mixture over the top.\nBake in preheated oven until bubbly and the top is golden brown, 20 to 25 minutes. Top with chopped fresh parsley.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "2659022.jpg",
    "o": "4505543.jpg,4411900.jpg,4379899.jpg,4231582.jpg,4225950.jpg,4219380.jpg",
    "st": "allrecipes"
}