{
    "id": 245127,
    "old_rating": "4.41379",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "4 sweet potatoes",
        "sea salt to taste",
        "1/4 cup unsalted butter",
        "1 (8 ounce) package cream cheese, softened",
        "1/2 teaspoon salt",
        "1 pinch cayenne pepper, or more to taste",
        "ground black pepper to taste",
        "1 cup mini marshmallows"
    ],
    "nut": [
        "Calories > 308 kcal",
        "Carbs > 34.5 g",
        "Cholesterol > 46 mg",
        "Fat > 17.3 g",
        "Protein > 4.4 g",
        "Sodium > 355 mg"
    ],
    "n": "Twice-Baked Sweet Potatoes with Browned Butter and Toasted Marshmallows",
    "a": "sonjagroset",
    "r": "0",
    "s": 8,
    "des": "\"These individual sweet potatoes are great for Thanksgiving, or any time of year. I browned the butter to add a nutty flavor, plus added some cayenne pepper for a kick.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nRub olive oil onto the outside of each sweet potato and sprinkle sea salt over each. Arrange sweet potatoes on the prepared baking sheet.\nBake in the preheated oven until a sharp knife easily pierces the potato, 50 to 60 minutes. Cool sweet potatoes until easily handled, 10 to 15 minutes.\nMelt butter in a saucepan over medium heat until solids begin to brown and smell nutty, 5 to 8 minutes.\nSlice potatoes in half lengthwise and scoop insides into a large bowl. Add browned butter, cream cheese, 1/2 teaspoon salt, cayenne pepper, and black pepper and mash using a potato masher until smooth. Spoon mixture back into the sweet potato skins and top each with 1/4 cup marshmallows. Place sweet potatoes back onto the baking sheet.\nBake in the oven until warmed through and marshmallows are toasted, about 10 minutes.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4206118.jpg",
    "o": "4206118.jpg,4177290.jpg,4145612.jpg,2879667.jpg,2879533.jpg,2879222.jpg",
    "st": "allrecipes"
}