{
    "id": 245138,
    "old_rating": "3.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 delicata squash, halved lengthwise and seeded",
        "2 teaspoons olive oil, divided, or as needed",
        "2 apples - peeled, cored and diced",
        "1/4 cup diced onion",
        "1 clove garlic, minced",
        "1/2 teaspoon finely chopped fresh rosemary",
        "1 pinch ground cinnamon, or to taste",
        "salt and ground black pepper to taste",
        "2 slices bacon",
        "2 tablespoons goat cheese"
    ],
    "nut": [
        "Calories > 282 kcal",
        "Carbs > 44.5 g",
        "Cholesterol > 15 mg",
        "Fat > 11.2 g",
        "Protein > 6.5 g",
        "Sodium > 309 mg"
    ],
    "n": "Stuffed Delicata Squash",
    "a": "Olivia",
    "r": "0",
    "s": 2,
    "des": "\"This delicious fall recipe combines the savory and sweet for a dish that warms the soul. I first made it after receiving some delicata squash from a friend's farm. I never knew squash could be so good!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nBrush inside surface of delicata squash halves with about 1 teaspoon olive oil; place on a baking sheet.\nBake in the preheated oven until tender when pierced with a fork, about 30 minutes.\nHeat remaining 1 teaspoon olive oil in a skillet over medium heat; cook and stir apples and onion until onion is translucent, about 5 minutes. Stir garlic, rosemary, and cinnamon into apple mixture; season with salt and pepper. Reduce heat to low; continue to cook, stirring occasionally, until apples are tender, about 5 minutes.\nPlace bacon in a skillet and cook over medium-high heat, turning occasionally, until crisp, about 8 minutes. Drain bacon slices on paper towels.\nFill delicata halves with apple mixture; crumble bacon and goat cheese over apple mixture.",
    "pt": "10 m",
    "ct": "50 m",
    "tt": "1 h",
    "i": "2740168.jpg",
    "o": "",
    "st": "allrecipes"
}