{
    "id": 245181,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon white sugar, or as needed",
        "1 butternut squash, halved and seeded",
        "1/4 cup all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/2 cup unsalted butter at room temperature",
        "1/4 cup white sugar",
        "1/4 cup brown sugar",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "3 eggs at room temperature, separated"
    ],
    "nut": [
        "Calories > 259 kcal",
        "Carbs > 32.9 g",
        "Cholesterol > 100 mg",
        "Fat > 13.6 g",
        "Protein > 4.2 g",
        "Sodium > 138 mg"
    ],
    "n": "Roasted Butternut Squash Souffle",
    "a": "KeeperoftheSweets",
    "r": "0",
    "s": 8,
    "des": "\"A great side dish to impress. Good for potlucks and holiday meals.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. Lightly butter a souffle or ceramic baking dish and sprinkle 1 tablespoon white sugar over butter, tapping excess sugar out of dish. Store buttered and sugared dish in the refrigerator.\nPlace butternut squash, cut-side down, onto the prepared baking sheet.\nBake in the preheated oven until very soft, 1 to 1 1/2 hours. Allow squash to cool to room temperature.\nSift flour, baking powder, and salt together in a bowl.\nScrape flesh from butternut squash into a in a food processor until smooth. Add flour mixture, 1/4 cup white sugar, brown sugar, vanilla extract, cinnamon, and nutmeg and process until smooth. Add egg yolks, 1 at a time, to squash mixture while continually processing.\nBeat egg whites in a bowl using an electric mixer until stiff peaks form; fold into squash mixture. Pour mixture into the chilled dish.\nBake in the preheated oven until browned and top springs back after pressing, about 1 hour.",
    "pt": "30 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}