{
    "id": 245173,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 roma tomatoes",
        "3 red bell peppers, chopped",
        "1 large sweet onion, halved",
        "3 tablespoons extra-virgin olive oil",
        "4 cloves garlic",
        "1 (28 ounce) can crushed tomatoes",
        "1 cup tightly packed fresh basil leaves, chopped",
        "salt and ground black pepper to taste",
        "2 yellow summer squash, cut into spirals using a spiral slicer",
        "2 zucchini, cut into spirals using a spiral slicer",
        "2 cooked chicken breast halves, cubed",
        "1 tablespoon grated Parmesan cheese, or to taste"
    ],
    "nut": [
        "Calories > 352 kcal",
        "Carbs > 33.4 g",
        "Cholesterol > 42 mg",
        "Fat > 16 g",
        "Protein > 23.3 g",
        "Sodium > 369 mg"
    ],
    "n": "Zucchini Pasta with Roasted Red Pepper Sauce and Chicken",
    "a": "Volleyballmom",
    "r": "0",
    "s": 4,
    "des": "\"Zucchini subs in for traditional pasta in this great veggie-rich dish.\"",
    "ins": "Preheat grill for medium heat and lightly oil the grate.\nGrill tomatoes, bell peppers, and onion halves on the preheated grill until well charred, about 15 minutes. When peppers are cool enough to handle, split with a knife and remove seeds.\nHeat olive oil in a large skillet; cook and stir garlic until fragrant, about 1 minute. Stir canned crushed tomatoes, basil, grilled tomatoes, bell peppers, and onion into skillet; bring to a boil, reduce heat, and simmer until vegetables are tender, about 10 minutes. Puree vegetable mixture with a stick blender; season with salt and pepper and keep at a simmer.\nBring a large pot of water to a boil; drop in summer squash and zucchini spirals and cook until tender, about 3 minutes. Drain water from pot; lay spirals on paper towels to drain completely.\nPlace squash spirals on individual plates; top with a portion of cooked chicken, a generous amount of red pepper sauce, and Parmesan cheese.",
    "pt": "1 h",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "3540288.jpg",
    "o": "",
    "st": "allrecipes"
}