{
    "id": 245143,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup white sugar",
        "1/4 cup softened butter",
        "3 eggs",
        "1 egg yolk",
        "1 1/2 teaspoons vanilla extract",
        "2 1/2 cups all-purpose flour",
        "2 teaspoons baking powder"
    ],
    "nut": [
        "Calories > 65 kcal",
        "Carbs > 11.1 g",
        "Cholesterol > 22 mg",
        "Fat > 1.7 g",
        "Protein > 1.4 g",
        "Sodium > 38 mg"
    ],
    "n": "Mrs. P's Biscotti",
    "a": "weeble",
    "r": "0",
    "s": 40,
    "des": "\"This was given to me by my very best friend; it's her mother's recipe, and a wonderful basic biscotti recipe. Very rarely do I make them the same way twice. You can add dried cherries, cranberries, walnuts, toasted almonds, chocolate, white chocolate or cinnamon chips, or nothing at all -- It's good enough to stand on its own. I also change the flavorings and use almond or vanilla extracts. These will keep for a couple of weeks (if you're lucky) in your cookie jar!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment.\nBeat sugar and butter together in a large bowl with an electric mixer until light and fluffy; beat in eggs, egg yolk, and vanilla extract. Whisk flour and baking powder together in a bowl. Stir flour mixture into butter mixture to form a fairly sticky dough.\nDivide dough in half; with wet hands, shape dough into two loaves, about 1-inch high at the center, on the prepared baking sheet.\nBake in the preheated oven until lightly browned, about 20 minutes; remove to cool completely on a wire rack, about 30 minutes.\nSlice loaves into 1/2-inch slices with a serrated knife. Place cookie slices back onto lined baking sheet, cut sides up.\nIncrease oven temperature to 450 degrees F (230 degrees C).\nBake in the preheated oven until golden brown, turning once, 3 to 4 minutes per side.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "4332736.jpg",
    "o": "",
    "st": "allrecipes"
}