{
    "id": 245120,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon oil",
        "2 fresh green chile peppers, chopped",
        "1/2 teaspoon jeera (cumin seeds)",
        "1 pinch hing (asafoetida powder)",
        "2 cups fresh peas",
        "1 teaspoon white sugar",
        "salt to taste",
        "2 cups maida (refined white flour)",
        "1 tablespoon oil",
        "2 tablespoons water, or more as needed",
        "1 tablespoon chopped fresh coriander (cilantro), or to taste",
        "1 teaspoon lemon juice",
        "vegetable oil for frying"
    ],
    "nut": [
        "Calories > 382 kcal",
        "Carbs > 59.9 g",
        "Cholesterol > 0 mg",
        "Fat > 13.7 g",
        "Protein > 10.4 g",
        "Sodium > 45 mg"
    ],
    "n": "Kachori With Fresh Peas",
    "a": "cstopre",
    "r": "0",
    "s": 4,
    "des": "\"It is a snack item with tomato sauce or tamarind chutney or can be served as main course in dinner with any potato gravy.\"",
    "ins": "Heat 1 tablespoon oil in a skillet over medium heat; add green chile peppers, jeera, and hing. Cook and stir for 1 minute. Add peas, sugar, and salt; cook and stir over low heat until peas are soft, about 5 minutes. Remove skillet from heat and cool pea mixture.\nMix maida, 1 tablespoon oil, and salt together in a bowl; add enough water until a dough forms. Allow to rest for 2 to 3 minutes.\nGrind pea mixture into a coarse paste using a mortar and pestle; add coriander and lemon juice and mix well.\nForm dough into small balls and roll each into a flat circle using a rolling pin. Spoon pea mixture into the center of each circle. Roll dough around filling so it is completely enclosed.\nHeat oil for frying in a deep-fryer or large saucepan. Working in batches, fry filled dough balls until crisp, 3 to 5 minutes per batch. Transfer to a paper towel-lined plate to drain.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}