{
    "id": 245197,
    "old_rating": "4.7",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 large sweet potatoes",
        "2 teaspoons olive oil",
        "salt to taste",
        "6 ounces ground chorizo",
        "1/2 cup diced onion",
        "1 poblano pepper, diced",
        "1 clove garlic, minced",
        "2 tablespoons chopped cilantro",
        "2 eggs",
        "1/4 cup shredded pepperjack cheese"
    ],
    "nut": [
        "Calories > 987 kcal",
        "Carbs > 100.7 g",
        "Cholesterol > 279 mg",
        "Fat > 48.1 g",
        "Protein > 38.8 g",
        "Sodium > 1557 mg"
    ],
    "n": "Cheesy Chorizo and Egg Sweet Potato Boats",
    "a": "Snacking in the Kitchen",
    "r": "0",
    "s": 2,
    "des": "\"These twice-baked sweet potatoes are savory and perfect for a weekend breakfast or weeknight dinner. For a vegetarian version, skip chorizo and add mushroom or zucchini. Enjoy these boats with Mexican crema, lime juice, and extra cilantro.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nCoat sweet potatoes with olive oil and season with salt; place on the prepared baking sheet.\nBake in the preheated oven until sweet potatoes are tender, about 1 hour. Cool until easily handled.\nCook and stir chorizo, onion, poblano pepper, and garlic in a skillet over medium-high heat until chorizo is cooked through, about 10 minutes. Remove skillet from heat and stir cilantro into chorizo mixture.\nSlice tops of cooled sweet potatoes horizontally and scoop out some of the flesh, creating \"boats\" with the peels and remaining flesh. Spoon chorizo mixture into \"boats\", forming a well in the middle. Crack 1 egg into each well and top with pepperjack cheese. Place boats on the baking sheet.\nBake in the oven until egg whites are set and cheese is melted, about 15 minutes.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4511444.jpg",
    "o": "4511444.jpg,3721452.jpg,3501101.jpg,3474071.jpg,3338380.jpg,3332126.jpg",
    "st": "allrecipes"
}