{
    "id": 245119,
    "old_rating": "4.51394",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (10 ounce) can refrigerated biscuit dough (such as Pillsbury Grands!Â®)",
        "1 (1 pound) bulk pork sausage",
        "1 1/2 cups shredded Cheddar cheese, divided",
        "6 eggs",
        "1/2 cup milk",
        "salt and ground black pepper to taste",
        "1 1/2 cups cold water, or more as needed",
        "1 (1.5 ounce) package pork gravy mix"
    ],
    "nut": [
        "Calories > 688 kcal",
        "Carbs > 27.3 g",
        "Cholesterol > 270 mg",
        "Fat > 52.2 g",
        "Protein > 26.6 g",
        "Sodium > 1645 mg"
    ],
    "n": "Biscuits and Gravy Casserole",
    "a": "Angela",
    "r": "0",
    "s": 6,
    "des": "\"I got this recipe at a church potluck. All the flavors blend really well. I've made it for breakfast, lunch, and dinner. So far every time I've served it, I haven't had any leftovers. Enjoy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nLine the bottom of the prepared baking dish with biscuits.\nHeat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Scatter sausage over biscuit layer and top with 1 cup Cheddar cheese.\nWhisk eggs, milk, salt, and pepper together in a bowl and pour over cheese layer.\nMix water and gravy mix together in a saucepan; bring to a boil. Reduce heat and simmer until gravy is thickened, 1 to 2 minutes, adding more water for a thinner gravy. Pour gravy over egg layer. Sprinkle remaining 1/2 cup Cheddar cheese over casserole.\nBake in the preheated oven until egg is fluffy and cheese is bubbling, about 30 minutes.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "45 m",
    "i": "3228938.jpg",
    "o": "4537530.jpg,4536553.jpg,4532989.jpg,4531098.jpg,4530736.jpg,4527973.jpg",
    "st": "allrecipes"
}