{
    "id": 245236,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 artichokes (3 to 4 inches wide)",
        "1 tablespoon olive oil",
        "1 tablespoon butter, melted",
        "1 tablespoon lemon juice",
        "1 cup mayonnaise",
        "2 cloves garlic, minced",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon ground dried chipotle pepper",
        "1/2 cup freshly grated Romano, Asiago and/or Parmesan cheese blend",
        "Reynolds WrapÂ® Aluminum Foil"
    ],
    "nut": [
        "Calories > 381 kcal",
        "Carbs > 11.1 g",
        "Cholesterol > 29 mg",
        "Fat > 36.1 g",
        "Protein > 6.4 g",
        "Sodium > 421 mg"
    ],
    "n": "Oven Roasted Artichokes",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 6,
    "des": "\"These fork-tender artichokes from Russ Crandall of The Domestic Man are a delicious addition to any feast.\"",
    "ins": "Preheat oven to 375 degrees F. To prepare the artichokes, trim each stem to less than 2 inches in length. Slice off the tips of the artichoke and snip the thorny tips with some kitchen shears. Slice the artichoke in half lengthwise and then remove and discard the \"choke\" (white fibrous hairs and inner purple leaves) with a small knife.\nLay out 8 squares of Reynolds WrapÂ® Aluminum Foil. Place 1 artichoke half in the center of each foil square. In a bowl, combine the olive oil, butter and lemon juice. Drizzle over the face-up artichoke halves, taking care to get the mixture in between the leaves. Flip the artichoke so it's cut side down on the foil. Bring up foil sides. Double fold top and ends to seal packet snugly around the artichoke. Roast on a baking sheet until the stems are fork-tender, about 40 minutes.\nAs the artichokes roast, combine the mayonnaise, garlic, black pepper, chipotle powder and cheese; set aside.\nOpen foil surrounding artichokes carefully by cutting along top with a sharp knife, allowing steam to escape. Using tongs, flip the artichoke face up. Scoop the mayo mixture into the divot made by removing the \"choke\" and spread with a spoon to extend beyond the divot. Turn oven temperature to broil. Leaving the foil open, broil until the mayo mixture is browned, 4-5 minutes.\nTo eat, remove the leaves from the outer part of the artichoke, dip in the mayo mixture and scrape the soft artichoke meat from the leaf with your teeth. Continue working your way through the artichoke until the leaves and dip disappear!",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "2683085.jpg",
    "o": "",
    "st": "allrecipes"
}