{
    "id": 245246,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 red onions, thinly sliced",
        "2 lemons, thinly sliced",
        "4 (8 ounce) lobster tails, split in half lengthwise",
        "2 ears corn on the cob, cut into 4 or 5 pieces",
        "1/2 cup melted unsalted butter",
        "5 tablespoons dry white wine",
        "4 garlic cloves, minced",
        "2 tablespoons minced fresh tarragon leaves",
        "4 sprigs fresh thyme",
        "Salt and pepper to taste",
        "Reynolds WrapÂ® Aluminum Foil"
    ],
    "nut": [
        "Calories > 501 kcal",
        "Carbs > 23.4 g",
        "Cholesterol > 195 mg",
        "Fat > 29.1 g",
        "Protein > 38.1 g",
        "Sodium > 742 mg"
    ],
    "n": "Tarragon and Lemon Lobster Scampi",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 4,
    "des": "\"Be fancy without the fuss with this delightful shellfish dish from Teri Lyn Fisher and Jenny Park of Spoon Fork Bacon.\"",
    "ins": "Preheat oven to 350 degrees F. Place 2 large sheets of Reynolds WrapÂ® Aluminum Foil onto a clean surface.\nDivide ingredients. In the center of each piece of foil, place an even, single layer of onion and lemon slices. Top the onion and lemon with lobster tails, cut-side up (2 per foil sheet), and corn. In a small mixing bowl, whisk together butter, wine, garlic and tarragon.\nGently fold up the edges of the foil around the food to create a shallow bowl. Pour butter mixture over the tails and corn and top with thyme sprigs. Season with salt and pepper. Double fold top and ends to seal packet, leaving room for heat circulation inside.\nBake for 20-25 minutes or until tails just cook through. Open packets carefully by cutting along top fold with a sharp knife, allowing steam to escape; then open top of foil packet. Serve with drawn butter and lemon wedges.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "2683102.jpg",
    "o": "",
    "st": "allrecipes"
}