{
    "id": 245230,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Reynolds WrapÂ® Aluminum Foil",
        "Brownies:",
        "1 cup unsalted butter, cut into cubes",
        "2 cups granulated sugar",
        "1 cup cocoa powder",
        "1 teaspoon instant espresso powder",
        "1 teaspoon salt",
        "5 large eggs",
        "2 teaspoons vanilla extract",
        "3/4 cup all-purpose flour",
        "1 cup chopped semisweet chocolate (not chips)",
        "Caramel Sauce:",
        "1/2 cup granulated sugar",
        "2 tablespoons unsalted butter",
        "1/4 teaspoon salt",
        "1/4 cup heavy cream",
        "1/2 teaspoon instant espresso powder",
        "1/2 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 359 kcal",
        "Carbs > 45 g",
        "Cholesterol > 98 mg",
        "Fat > 20 g",
        "Protein > 4.6 g",
        "Sodium > 208 mg"
    ],
    "n": "Double Chocolate Caramel Brownies",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 16,
    "des": "\"These decadent brownies from Yossy Arefi of Apartment 2B Baking Co. will be the star of any dessert table.\"",
    "ins": "Preheat oven to 350 degrees F. Line the bottom and sides of a 9x13-inch baking pan with Reynolds WrapÂ® Aluminum Foil, making sure there is a bit of overhang on all sides. Lightly butter the foil.\nCombine butter, sugar, cocoa powder, espresso powder and salt in a large bowl set over a double boiler. Stir the mixture occasionally until the butter is completely melted and the mixture is warm to the touch. Remove from the heat and let cool slightly. Whisk in the eggs, one at a time, and then add in the vanilla. Fold in the flour until just combined and then fold in the chopped chocolate.\nBake the brownies 25-30 minutes or until a toothpick inserted into the center comes out clean. Cool the brownies in the pan and then use the foil as handles to lift the brownies out of the pan.\nTo make the caramel sauce, combine the sugar with 2 tablespoons of water, along with the butter and salt, in a saucepan. Cook over medium heat, swirling the pan occasionally, until the sugar melts and turns deep amber in color. Remove the pan from the heat and then whisk in the cream, instant espresso and vanilla extract. Let the sauce cool to room temperature and then drizzle over the brownies just before serving.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "2683068.jpg",
    "o": "",
    "st": "allrecipes"
}