{
    "id": 245253,
    "old_rating": "4.23529",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/3 head red cabbage, sliced and chopped",
        "4 small carrots, peeled and grated",
        "1/4 cup coleslaw dressing",
        "1/4 cup red wine vinegar",
        "2 tablespoons soy sauce",
        "2 tablespoons teriyaki sauce",
        "2 tablespoons sesame oil",
        "1 pound ground chicken",
        "1/4 cup stir-fry sauce",
        "14 wonton wrappers"
    ],
    "nut": [
        "Calories > 244 kcal",
        "Carbs > 21.1 g",
        "Cholesterol > 44 mg",
        "Fat > 9.7 g",
        "Protein > 17.7 g",
        "Sodium > 755 mg"
    ],
    "n": "Chicken Wonton Tacos",
    "a": "OdaMae",
    "r": "0",
    "s": 7,
    "des": "\"Light and tasty, these make a great appetizer or a quick and easy main dish! Kids love them! Finally a dish that makes use of ground chicken but not so far-fetched. I bake the wonton wrappers to save time and it eliminates most of the fat. Although time-consuming, you can fry wrappers in sesame or olive oil for the extra flaky shells, folded in a triangle for about 1 minute on each side. I loved the ones at Applebee'sÂ® and decided to attempt a home version. I was extremely pleased with the healthier version! Top tacos with cilantro, red onion, or sweet onion, if desired. Serve lime wedges on the side.\"",
    "ins": "Mix cabbage, carrots, coleslaw dressing, vinegar, soy sauce, and teriyaki together in a bowl; refrigerate until flavors blend, 1 hour to overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat sesame oil in a skillet over medium heat. Cook and stir ground chicken in the hot skillet until browned and crumbly, 5 to 7 minutes. Add stir-fry sauce, cover skillet, reduce heat to low, and simmer.\nForm wonton wrappers into taco shapes and arrange between the cups of an inverted muffin tin.\nBake in the preheated oven until firm and lightly browned, 4 to 5 minutes. Spoon 2 to 3 tablespoons chicken mixture into each wonton taco shell and top with slaw.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}