{
    "id": 245270,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon fine salt",
        "1/2 teaspoon ground cinnamon",
        "1/8 teaspoon freshly grated nutmeg",
        "8 ounces fresh ricotta cheese, well drained",
        "1/2 cup pumpkin puree",
        "2 tablespoons pumpkin puree",
        "1/4 cup white sugar",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "Canola oil, for frying"
    ],
    "nut": [
        "Calories > 274 kcal",
        "Carbs > 27.9 g",
        "Cholesterol > 55 mg",
        "Fat > 14.8 g",
        "Protein > 7.5 g",
        "Sodium > 344 mg"
    ],
    "n": "Pumpkin Zeppole",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"As in virtually every other pumpkin dessert, I think using pure canned pumpkin will give you the best results--it has more concentrated flavor than freshly roasted pumpkin. These light, not-too-sweet Italian doughnuts were adapted from a recipe by my old friend, Jennifer Perillo. I usually toss these in cinnamon sugar when they're still slightly warm.\"",
    "ins": "Whisk flour, baking powder, salt, cinnamon, and nutmeg together in a bowl.\nWhisk ricotta, 1/2 cup plus 2 tablespoons pumpkin puree, sugar, eggs, and vanilla together in a separate mixing bowl until smooth. Pour mixture into dry ingredients. Mix together until mixture becomes a loose batter.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nUse one spoon to scoop out a heaping tablespoon of dough and a second spoon to carefully push dough into hot oil. Fry in batches for about 1 minute. If zeppole don't turn over by themselves after 1 minute, gently turn each with a strainer to brown on the other side, about 1 more minute. Remove with a strainer and drain on cooling rack.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}