{
    "id": 245238,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 cup pecans",
        "1 (8 ounce) package cream cheese, at room temperature",
        "1 clove garlic, minced",
        "1 small dill pickle, minced",
        "1 cup shredded Cheddar cheese",
        "1/2 cup shredded Monterey Jack cheese",
        "1 (4 ounce) jar pimientos, drained and diced",
        "Fresh ground black pepper to taste",
        "2 teaspoons hot sauce",
        "1/4 teaspoon ground cayenne pepper",
        "Reynolds WrapÂ® Aluminum Foil",
        "For serving:",
        "Crackers",
        "Vegetables such as radishes, celery, or carrots"
    ],
    "nut": [
        "Calories > 546 kcal",
        "Carbs > 27.4 g",
        "Cholesterol > 69 mg",
        "Fat > 43.4 g",
        "Protein > 13.8 g",
        "Sodium > 748 mg"
    ],
    "n": "Classic Pimento Cheese Ball",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 6,
    "des": "\"This classic app is the perfect party treat made simple from Adrianna Adarme of A Cozy Kitchen.\"",
    "ins": "Preheat oven to 350 degrees F. Line a baking sheet with Reynolds WrapÂ® Aluminum Foil. Spread the pecans on the foil-lined sheet and toast in the oven for 7-10 minutes. Remove and allow to cool completely. When cooled, give the pecans a rough chop and return to the foil-lined baking sheet.\nIn a stand mixer fitted with a paddle attachment, mix the cream cheese, garlic, pickle, cheddar cheese, Monterey Jack, pimentos, black pepper, hot sauce and pinch of cayenne pepper. Turn the mixer to medium speed and mix for about a minute. Transfer to a small bowl, cover with plastic wrap and chill for at least 2 hours or up to 3 days.\nForm chilled mixture into a ball, and smooth out by hand. Roll the ball in the toasted chopped pecans. Keep in the fridge until you're ready to serve.\nServe on a plate or board with an array of crackers or veggies like carrots, celery or radishes.",
    "pt": "10 m",
    "ct": "7 m",
    "tt": "2 h ",
    "i": "2683088.jpg",
    "o": "",
    "st": "allrecipes"
}