{
    "id": 245286,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 boneless chicken thighs",
        "1 quart eggnog",
        "2 cups panko bread crumbs",
        "2 cups all-purpose flour",
        "1 clove garlic, minced",
        "1 teaspoon chicken bouillon",
        "1 teaspoon baking soda",
        "1 teaspoon garlic salt",
        "1 teaspoon Italian seasoning",
        "1/2 teaspoon dried thyme",
        "1/2 teaspoon ground smoked paprika",
        "1/4 teaspoon ground cinnamon",
        "1/8 teaspoon ground nutmeg",
        "oil for frying"
    ],
    "nut": [
        "Calories > 535 kcal",
        "Carbs > 55.2 g",
        "Cholesterol > 131 mg",
        "Fat > 25.6 g",
        "Protein > 25.3 g",
        "Sodium > 691 mg"
    ],
    "n": "Eggnog Fried Chicken",
    "a": "Megan",
    "r": "0",
    "s": 10,
    "des": "\"I had some extra eggnog and was trying to figure out what to do with it. I decided to use it for chicken and everyone was a little skeptical, but after tasting it they all thought it was amazing. You can taste the eggnog, but it's subtle. I was cooking for some people who disliked eggnog and they still loved this recipe!\"",
    "ins": "Place chicken in resealable plastic bag, coat with eggnog, and refrigerate, 1 to 3 hours.\nMix together panko, flour, garlic, chicken bouillon, baking soda, garlic salt, Italian seasoning, dried thyme, paprika, ground cinnamon, and ground nutmeg in a bowl for the breading mixture.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nRemove chicken from eggnog mixture and gently press each piece into breading mixture to coat, shaking off excess. Discard the eggnog.\nFry chicken until golden brown, about 3 to 5 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nPlace fried chicken on cooling racks to drain over a baking sheet.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "4478085.jpg",
    "o": "",
    "st": "allrecipes"
}