{
    "id": 245239,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Glaze:",
        "3/4 cup honey",
        "1/2 cup white wine",
        "1/2 cup unsalted butter",
        "1/2 cup cranberry juice",
        "1/2 cup pomegranate juice",
        "Turkey:",
        "1 (10 pound) whole turkey, neck and giblets removed",
        "1/2 cup unsalted butter, melted",
        "1/2 cup extra virgin olive oil",
        "1 tablespoon dried crushed rosemary leaves",
        "1 teaspoon kosher salt",
        "1 teaspoon dried thyme leaves",
        "1/4 teaspoon black pepper",
        "2 cups fresh whole cranberries",
        "1 diced sweet onion",
        "4 cups turkey or chicken stock",
        "8 sprigs chopped fresh rosemary",
        "3 bay leaves",
        "Reynolds WrapÂ® Aluminum Foil"
    ],
    "nut": [
        "Calories > 1338 kcal",
        "Carbs > 37.1 g",
        "Cholesterol > 399 mg",
        "Fat > 77.3 g",
        "Protein > 116.2 g",
        "Sodium > 1096 mg"
    ],
    "n": "Roast Turkey with Cranberry and Pomegranate Glaze",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 8,
    "des": "\"No feast is complete without a turkey! Try this herb- and fruit-flavored bird from Eva Kosmas Flores of Adventures in Cooking.\"",
    "ins": "In a medium-sized pot over medium-high heat, bring the honey, white wine, butter, cranberry juice and pomegranate juice to a boil. Reduce heat to low and allow the mixture to simmer for 10 minutes. Remove from heat and set aside to cool.\nPreheat the oven to 450 degrees F. Rinse the turkey and pat dry. Vigorously whisk together melted butter, olive oil, rosemary, salt, thyme and black pepper until smooth. Rub the mixture all over the entire outside and inside of the turkey, as well as underneath the breast skin of the bird, taking care not to tear the skin.\nEvenly distribute the cranberries and onion on the bottom of a roasting pan. Place the turkey in the roasting pan, breast facing up. Stuff (if desired) and tie the turkey's legs together with cooking twine. Whisk together the turkey stock with 2/3 cup of the glaze and pour the mixture into the roasting pan, around but not over the turkey. Arrange 4 sprigs of rosemary around the bird in the stock and add the bay leaves to the stock in the pan.\nTent Reynolds WrapÂ® Aluminum Foil over the entire roasting pan, leaving 1 inch between the foil and the skin. Leave a small opening in the tent to allow for basting the bird as it cooks.\nRoast for 30 minutes and then lower the heat to 350 degrees F and continue cooking for 15-20 minutes per pound of turkey. Baste the bird every 20 minutes with the pan drippings and baste the bird with the glaze once per hour. Rotate the roasting pan once every hour to help the bird cook evenly.\nWhen the skin of the bird begins to look lightly golden, take the temperature of the turkey, and once it reaches 165 degrees F in the breast, stuffing cavity and thigh, it is safe to eat. If you want to brown the bird a bit more, remove the foil and roast another 10-15 minutes. It will brown very quickly due to the glaze's sugar content, so keep a close eye on it.\nOnce removed, place the remaining 4 sprigs of fresh rosemary around the turkey for garnish. Allow the bird to rest for 30 minutes before carving and serving.",
    "pt": "20 m",
    "ct": "4 h",
    "tt": "4 h ",
    "i": "2822084.jpg",
    "o": "",
    "st": "allrecipes"
}