{
    "id": 245217,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "4 ounces white country bread, cut into 1/2-inch cubes",
        "1/4 cup extra-virgin olive oil, divided",
        "freshly ground black pepper to taste",
        "kosher salt to taste",
        "2 tablespoons unsalted butter",
        "2/3 cup minced onion",
        "2/3 cup minced celery",
        "1/2 pound sweet Italian pork sausage, casings removed",
        "6 cloves garlic, minced",
        "3/4 teaspoon dried sage",
        "4 eggs, beaten",
        "1 small Granny Smith apple - peeled, cored, and finely chopped",
        "2 tablespoons chicken broth"
    ],
    "nut": [
        "Calories > 164 kcal",
        "Carbs > 8.2 g",
        "Cholesterol > 75 mg",
        "Fat > 12.1 g",
        "Protein > 5.6 g",
        "Sodium > 295 mg"
    ],
    "n": "Sausage-and-Apple Stuffing Bites",
    "a": "CARMOMOF4",
    "r": "0",
    "s": 12,
    "des": "\"This is a delicious twist on traditional Thanksgiving stuffing that works great as a warm appetizer. Enjoy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease two 12-cup mini muffin tins with cooking spray.\nToss bread cubes with 2 tablespoons olive oil on a baking sheet; season with salt and pepper.\nBake bread cubes in the preheated oven until toasted, about 10 minutes. Transfer to a large bowl.\nMelt butter and 2 tablespoons olive oil in a large skillet over medium-high heat. Add onion and celery; cook and stir until golden, about 5 minutes. Stir sausage, garlic, and sage into onion mixture and cook, breaking up the meat until no trace of pink remains, about 5 minutes.\nMix sausage mixture, eggs, apple, and chicken broth into bowl of toasted bread cubes. Season with salt and pepper. Let stand until flavors absorb, about 5 minutes.\nScoop stuffing mixture into muffin cups and bake in the preheated oven until golden, 20 to 25 minutes.\nTransfer muffin tins to a rack to cool, about 5 minutes. Loosen the muffins with a sharp paring knife to lift them out.",
    "pt": "25 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}