{
    "id": 245249,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (10 ounce) packages frozen spinach, thawed",
        "2 cloves garlic, minced",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 (14 ounce) can hearts of palm, drained and sliced",
        "1 (8 ounce) package cream cheese, softened",
        "1 (8 ounce) carton sour cream",
        "1 (5 ounce) can water chestnuts, rinsed and chopped",
        "1 1/2 cups shredded mozzarella cheese (such as SargentoÂ® Traditional Cut)",
        "1/4 cup shredded Parmesan cheese (such as SargentoÂ® Artisan Blends)"
    ],
    "nut": [
        "Calories > 107 kcal",
        "Carbs > 4.2 g",
        "Cholesterol > 23 mg",
        "Fat > 8.2 g",
        "Protein > 5.3 g",
        "Sodium > 331 mg"
    ],
    "n": "Crunchy Spinach Dip with Hearts of Palm",
    "a": "Jamie Justice Yost",
    "r": "0",
    "s": 20,
    "des": "\"Necessity is the mother of invention - and this recipe! After discovering that we didn't have the ingredients for our original Thanksgiving appetizer, we created this out of the ingredients we did have. Now we have a new holiday favorite and a great dip to take to parties and tailgates! Serve with pita chips.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nCombine spinach, garlic, salt, and pepper in skillet; cook and stir until garlic is fragrant and spinach is warmed through, about 5 minutes.\nCombine hearts of palm, cream cheese, sour cream, water chestnuts, and half of the mozzarella cheese together in a separate bowl. Add spinach mixture and stir to distribute ingredients evenly. Pour mixture into prepared baking dish; top with remaining mozzarella cheese and Parmesan cheese.\nBake in preheated oven until golden and bubbly, 20 to 25 minutes.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}