{
    "id": 245370,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 pounds sweet potatoes, scrubbed",
        "1 (8 ounce) can crushed pineapple in juice, undrained",
        "1 tablespoon finely chopped candied ginger",
        "1 (15 ounce) can unsweetened coconut milk",
        "1/4 cup white sugar",
        "2 tablespoons honey",
        "2 tablespoons butter",
        "1/4 teaspoon ground ginger",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 217 kcal",
        "Carbs > 37.1 g",
        "Cholesterol > 4 mg",
        "Fat > 7.2 g",
        "Protein > 2.8 g",
        "Sodium > 102 mg"
    ],
    "n": "Sweet Potatoes, Pina-Colada Style",
    "a": "Dcookiebaker",
    "r": "0",
    "s": 16,
    "des": "\"Tender sweet potatoes topped with coconut milk and candied ginger make for a flavorful but not-too-sweet side dish. This is a great make-ahead dish to go with a holiday turkey or chicken dinner.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Generously butter a 9x13-inch baking dish.\nPlace sweet potatoes in a large pot and cover with 2 to 3 inches of water; cover and bring to a boil. Reduce heat to medium-low and simmer until tender but still slightly firm in the center, about 12 minutes. Drain and cool.\nPeel the sweet potatoes and cut into 3-inch chunks or thick slices; arrange in the buttered baking dish. Top with crushed pineapple (in its juice) and candied ginger.\nCombine coconut milk, sugar, honey, butter, ground ginger, salt, and black pepper in a saucepan. Bring to a boil; reduce heat and simmer until slightly thickened, 5 to 10 minutes. Pour coconut milk mixture over sweet potatoes. Cover baking dish with aluminum foil.\nBake in the preheated oven until very tender, about 45 minutes. Remove foil, baste sweet potatoes with cooking liquid and continue baking until liquid is slightly thickened, 10 to 15 minutes.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}