{
    "id": 24539,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons dry sherry",
        "2 slices fresh ginger root",
        "1 tablespoon oyster sauce",
        "1/2 teaspoon Chinese five-spice powder",
        "4 1/2 teaspoons soy sauce",
        "1 tablespoon white sugar",
        "2 tablespoons hoisin sauce",
        "2 tablespoons ketchup",
        "1/2 teaspoon ground cinnamon",
        "1 1/2 pounds pork shoulder roast",
        "1 tablespoon honey"
    ],
    "nut": [
        "Calories > 158 kcal",
        "Carbs > 10.2 g",
        "Cholesterol > 45 mg",
        "Fat > 6.9 g",
        "Protein > 13.1 g",
        "Sodium > 451 mg"
    ],
    "n": "Cantonese Barbecued Pork",
    "a": "SHERRY_G",
    "r": "0",
    "s": 6,
    "des": "\"This tastes like the pork served in my favorite Chinese restaurant. Serve at room temperature arranged in overlapping layers on a platter. Garnish with cucumber slices, if desired.\"",
    "ins": "In bowl, stir together sherry, ginger root, oyster sauce, five-spice powder, soy sauce, white sugar, sugar, hoisin sauce, ketchup and cinnamon.\nCut pork into 5x2 inch strips. Place strips flat in a shallow baking dish. Pour marinade over pork strips. Let pork marinate at least 6 hours in refrigerator.\nDrain, reserving marinade. Mix honey and 3 tablespoon reserved marinade in a small bowl; set aside. Preheat oven to 350 degrees F (175 degrees C).\nFill a shallow roasting pan with water and place in bottom of oven. Carefully place pork strips on a roasting rack above roasting pan so all sides are exposed to heat. If you don't have a roasting rack, insert the curved end of an S-shaped hook, paper clip, or drapery hook in pork strips and hang them from the top shelf.\nRoast for 30 minutes. Baste pork strips with honey mixture. Roast 15 minutes and baste again. Roast 10 minutes longer or until pork strips are crisp and golden brown. Remove from oven and let cool.",
    "pt": "6 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "164920.jpg",
    "o": "",
    "st": "allrecipes"
}