{
    "id": 245333,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds whole skinless, boneless chicken breasts",
        "salt and ground black pepper to taste",
        "1 1/2 pounds butternut squash, quartered and seeded",
        "2 teaspoons olive oil",
        "1 onion, minced",
        "4 cloves garlic, crushed",
        "3 1/2 cups chicken broth",
        "1 (14 ounce) can canned diced tomatoes",
        "2/3 cup quinoa",
        "1 1/2 teaspoons dried oregano",
        "1/2 teaspoon salt"
    ],
    "nut": [
        "Calories > 224 kcal",
        "Carbs > 24.8 g",
        "Cholesterol > 51 mg",
        "Fat > 4.5 g",
        "Protein > 21.8 g",
        "Sodium > 703 mg"
    ],
    "n": "Butternut Squash, Chicken, and Quinoa Soup",
    "a": "Debbie Wind Bailey",
    "r": "0",
    "s": 8,
    "des": "\"This tasty, healthy, and filling soup is the perfect comfort food. Serve with crusty rolls or bread.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nSprinkle chicken with salt and ground black pepper. Wrap in aluminum foil and place on a baking sheet.\nPlace butternut squash pieces cut-side down in a 9x13-inch baking dish. Add about 1/2-inch water to the dish and cover with aluminum foil.\nBake chicken and squash in the preheated oven until butternut squash is tender and chicken breasts are no longer pink in the center, about 30 minutes. An instant-read thermometer inserted into the center of the chicken should read at least 165 degrees F (74 degrees C).\nHeat oil in a skillet over medium heat. Add onion and garlic; cook and stir until softened, about 5 minutes.\nScoop cooked squash flesh into a large pot. Pour in chicken broth and mash together until smooth using an immersion blender or potato masher.\nCube cooked chicken and add to the pot. Stir in onion, garlic, canned tomatoes, quinoa, oregano, and 1/2 teaspoon salt. Bring soup to a gentle boil; reduce heat and simmer until quinoa is tender and flavors are well-blended, about 1 hour.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "2758337.jpg",
    "o": "",
    "st": "allrecipes"
}