{
    "id": 245381,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup soft butter",
        "1 cup confectioners' sugar",
        "1 egg",
        "1 teaspoon vanilla extract",
        "3 cups all-purpose flour",
        "1 pinch salt",
        "Frosting:",
        "1 (10 ounce) package GhirardelliÂ® 60% Cacao Bittersweet Chocolate Baking Chips",
        "1 1/2 cups crushed GhirardelliÂ® Peppermint Bark",
        "Sprinkles to decorate"
    ],
    "nut": [
        "Calories > 273 kcal",
        "Carbs > 28.7 g",
        "Cholesterol > 28 mg",
        "Fat > 16.7 g",
        "Protein > 3.6 g",
        "Sodium > 69 mg"
    ],
    "n": "Christmas Tree Ghirardelli Peppermint Bark Cookies",
    "a": "Ghirardelli",
    "r": "0",
    "s": 24,
    "des": "\"A delicious and festive holiday cookie.\"",
    "ins": "Preheat oven to 375 degrees .\nUsing a food processor, pulse all butter, confectioners' sugar, egg, vanilla, flour, and salt together until big lumps start to form. Bring dough together with your hands and form into a large ball. (If you don't have a food processor you can do this by rubbing the flour and butter together with your fingertips, add the rest of ingredients, and bring it all together with your hands).\nWrap ball in plastic wrap and refrigerate for 1 hour.\nLightly flour a work surface and rolling pin, cut chilled dough in half and place the other half back in the fridge while you roll out the first batch. Roll out dough until about 1/2 cm (1/8 inch) thick. Cut out with Christmas shapes.\nIf you want to hang the cookies on the tree, make sure to poke a hole in the top with a chopstick.\nPlace cookies carefully on a non-stick baking tray and bake in the oven for 7 to 8 minutes.\nAllow to cool on the trays for 2 minutes then transfer onto a wire rack to cool completely.\nFor the frosting, melt the chocolate baking chips and coat the cooled cookies on one side.\nWhile the chocolate is still wet, sprinkle with the crushed Peppermint Bark and sparkles.\nAllow to set somewhere cool completely. Tie a ribbon or piece of string through each cookie and hang on your Christmas Tree.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2773106.jpg",
    "o": "",
    "st": "allrecipes"
}