{
    "id": 245359,
    "old_rating": "4.89655",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons vegetable oil",
        "2 pounds boneless pork shoulder, cut into 2-inch pieces",
        "1 yellow onion, diced",
        "2 teaspoons kosher salt, or to taste, divided",
        "2 teaspoons dried oregano",
        "2 teaspoons ground cumin",
        "1/2 teaspoon ground coriander",
        "1/4 teaspoon cayenne pepper",
        "10 fresh tomatillos",
        "3 jalapeno chile peppers, seeded",
        "1 poblano chile pepper, seeded",
        "6 cloves peeled garlic",
        "1/2 cup packed cilantro leaves",
        "1 bay leaf",
        "2 1/2 cups chicken stock, or as needed",
        "1 1/2 pounds Yukon Gold potatoes, quartered",
        "freshly ground black pepper",
        "1/4 cup sour cream",
        "pickled red onions (optional)",
        "1 tablespoon chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 569 kcal",
        "Carbs > 42 g",
        "Cholesterol > 96 mg",
        "Fat > 32.2 g",
        "Protein > 29.3 g",
        "Sodium > 1485 mg"
    ],
    "n": "Pork Chili Verde (Green Pork Chili)",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"This chili verde was one of the first recipes I ever learned. It comes out great even if you don't brown the meat, but I think doing so always adds extra flavor so I usually do it.\"",
    "ins": "Heat vegetable oil in a pot over high heat until it's nearly smoking. Add pork shoulder cubes in a single layer. Let sear until brown on one side, 4 to 5 minutes. Mix and turn pieces over and brown on the other side, 4 to 5 minutes. Add onion, 1/2 teaspoon salt. Cook, stirring until onions turn translucent, about 4 minutes.  Add oregano, cumin, coriander, and cayenne. Stir and cook until seasonings get fragrant, about 2 minutes. Reduce heat to low.\nRemove paper husk from tomatillos and rinse. Cut into quarters. Place in blender with garlic, jalapeno pepper, poblano, cilantro, and chicken broth. Pulse on and off until pieces start to break down. Then blend until mixture has liquefied, about 30 seconds. Stir sauce into the meat mixture. Add 1 teaspoon salt and bay leaf. Increase heat to high and bring to a boil. Reduce heat to low to maintain a slow but steady simmer for about 1 hour. Add potatoes, 1/2 teaspoon salt, black pepper. If mixture has reduced to where potatoes are not immersed, add more broth to cover. Simmer until meat and potatoes are tender, 45 minutes to 1 hour.\nGarnish individual servings with a dollop of sour cream, some pickled red onions (if desired), and cilantro leaves.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}