{
    "id": 245362,
    "old_rating": "4.65714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons olive oil",
        "1 large onion, diced",
        "1/2 cup sliced fresh mushrooms",
        "1 teaspoon salt, or more to taste",
        "1 cup diced red bell pepper",
        "1 jalapeno pepper, seeded and sliced",
        "1 teaspoon cumin",
        "1/2 teaspoon paprika",
        "1/2 teaspoon ground turmeric",
        "1/2 teaspoon freshly ground black pepper, plus more to taste",
        "1/4 teaspoon cayenne pepper",
        "1 (28 ounce) can crushed San Marzano tomatoes, or other high-quality plum tomatoes",
        "1/2 cup water, or more as needed",
        "6 large eggs",
        "2 tablespoons crumbled feta cheese",
        "2 tablespoons chopped fresh parsley"
    ],
    "nut": [
        "Calories > 185 kcal",
        "Carbs > 14.9 g",
        "Cholesterol > 189 mg",
        "Fat > 10.8 g",
        "Protein > 9.9 g",
        "Sodium > 670 mg"
    ],
    "n": "Chef John's Shakshuka",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"This North African one-dish-meal is so fast, easy, and delicious. Be sure to cook your sauce until the veggies are nice and soft and sweet.Â Once the eggs go in, you can finish covered on the stove, or just pop the pan into a hot oven until they cook to your liking.\"",
    "ins": "Heat olive oil in a large, heavy skillet over medium-high heat. Add onions and mushrooms. Sprinkle with salt. Cook and stir until mushrooms release all of their liquid and start to brown, about 10 minutes. Stir in bell peppers and jalapeno pepper. Cook and stir until peppers begin to soften up, about 5 minutes. Season with cumin, paprika, turmeric, black pepper, and cayenne. Stir and cook to \"wake up\" the flavors, about 1 minute. Pour in crushed tomatoes and water. Adjust heat to medium and simmer uncovered until veggies are softened and sweet, stirring occasionally, 15 to 20 minutes. Add more water if sauce becomes too thick.\nMake a depression in the sauce for each egg with a large spoon. Crack egg into a small ramekin and slide gently into each indentation; repeat with the rest of the eggs. Season with salt and pepper. Cover and cook until eggs are to your desired doneness.\nTop with feta cheese and parsley.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "4540525.jpg",
    "o": "4540525.jpg,4532343.jpg,4504182.jpg,4502265.jpg,4501323.jpg,4473081.jpg",
    "st": "allrecipes"
}