{
    "id": 245372,
    "old_rating": "4.48276",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 cups low-sodium chicken broth",
        "2 cups quinoa, rinsed and drained",
        "1 tablespoon coconut oil, divided",
        "1 large boneless, skinless chicken breast, cut into thin strips",
        "3/4 cup shredded cabbage",
        "1/2 cup edamame",
        "1/4 cup diced broccoli stems",
        "2 carrots, cut into matchsticks",
        "2 green onions, chopped",
        "3 eggs",
        "1 teaspoon sesame oil",
        "Thai peanut sauce:",
        "1/4 cup natural peanut butter",
        "1/4 cup reduced-sodium soy sauce",
        "3 tablespoons rice vinegar",
        "2 tablespoons chili garlic sauce",
        "2 tablespoons chopped fresh ginger",
        "3 cloves garlic, minced",
        "1 teaspoon sesame oil",
        "1/2 cup salted peanuts, chopped",
        "3 tablespoons chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 393 kcal",
        "Carbs > 37.3 g",
        "Cholesterol > 88 mg",
        "Fat > 17.9 g",
        "Protein > 23 g",
        "Sodium > 651 mg"
    ],
    "n": "Pad Thai Quinoa Bowl",
    "a": "Lisa",
    "r": "0",
    "s": 8,
    "des": "\"This recipe uses quinoa which is gluten-free, high in protein and fiber, and has a nice nutty flavor. But you can always substitute for either rice or noodles.\n Take out the chicken and add extra edamame and you have a great vegetarian meal instead. Or add shrimp if you like. A seriously good, versatile recipe!\"",
    "ins": "Bring chicken broth and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender, 15 to 20 minutes. Set aside.\nHeat 1 1/2 teaspoons coconut oil in a wok or large skillet over medium-high heat. Add chicken; stir until cooked through; about 5 minutes. Remove chicken from wok. Heat remaining 1 1/2 teaspoons coconut oil. Add cabbage, edamame, broccoli, carrot, and green onions and saute until vegetables soften slightly, 2 to 3 minutes.\nWhisk eggs with sesame oil in a small bowl. Push vegetables to the sides of the wok to make a well in the center; pour eggs in and stir to scramble, about 3 minutes.\nCombine peanut butter, soy sauce, rice vinegar, chili garlic sauce, ginger, garlic, and sesame oil together in a small bowl. Pour Thai peanut sauce over vegetable and egg mixture in the wok.\nReturn chicken to the wok and add quinoa; mix well to combine. Stir in chopped peanuts and cilantro and serve.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "3162185.jpg",
    "o": "",
    "st": "allrecipes"
}