{
    "id": 245469,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon butter",
        "1 small Yukon Gold potato, finely diced",
        "1/4 cup fresh corn kernels",
        "4 large shrimp, deveined with shell and head left on",
        "2 teaspoons olive oil",
        "1 clove garlic, cut into small chunks",
        "1 lemon",
        "1 pinch salt",
        "4 slices tangy cured Spanish chorizo",
        "1 teaspoon chopped fresh cilantro",
        "ReynoldsÂ® Parchment Paper",
        "Reynolds WrapÂ® Aluminum Foil"
    ],
    "nut": [
        "Calories > 160 kcal",
        "Carbs > 9.4 g",
        "Cholesterol > 52 mg",
        "Fat > 11.1 g",
        "Protein > 8 g",
        "Sodium > 275 mg"
    ],
    "n": "Shell on Shrimp with Corn, Potatoes and Chorizo",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 4,
    "des": "\"Get a taste of land, sea, and everything in between with this light and flavorful dish from April Bloomfield from the Spotted Pig NYC.\"",
    "ins": "Preheat oven to 375 degrees F. Place a large sheet of Reynolds Wrap(R) Aluminum Foil on a clean surface. Place a similarly sized sheet of Reynolds(R) Parchment Paper on top of the foil.\nCenter the butter on the parchment. Add potatoes and then corn. Gently place the shrimp on top of corn and drizzle with olive oil and garlic. Top with a squeeze of lemon juice and a good pinch of salt. Add the chorizo slices on top of the seasoned shrimp.\nBring up sides of the parchment/foil. Double fold top and ends to seal packet, leaving room for heat circulation inside. Cook for 8-9 minutes. Remove packet from the oven, carefully cut open the top of the foil packet using a pair of scissors to let steam out. Set aside.\nMix the corn, potatoes and chorizo together in the foil. Remove to a serving platter and add the shrimp. Top with cilantro. Drizzle over any cooking liquid left in the packet. Serve with a fresh cut lemon wedge.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "25 m",
    "i": "2817769.jpg",
    "o": "",
    "st": "allrecipes"
}