{
    "id": 245424,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "14 ounces dry brown lentils",
        "2 carrots, grated",
        "3 tablespoons olive oil",
        "2 onions, thinly sliced",
        "3 cloves garlic, crushed, or more to taste",
        "2 tablespoons water, or more as needed",
        "1 1/2 teaspoons ground cumin",
        "1/4 teaspoon ground cayenne pepper (optional)",
        "1/4 teaspoon yellow curry powder (optional)",
        "4 cups cooked brown rice, or as needed"
    ],
    "nut": [
        "Calories > 350 kcal",
        "Carbs > 57.2 g",
        "Cholesterol > 0 mg",
        "Fat > 6.6 g",
        "Protein > 16 g",
        "Sodium > 22 mg"
    ],
    "n": "Mujadarra (Lentils with Rice)",
    "a": "Deena K Boyd",
    "r": "0",
    "s": 8,
    "des": "\"I was introduced to this Middle Eastern dish by one of my best friends, who is Palestinian. His mother made this once a week at her deli and after trying it once I had a standing order to save me a plate every week. This is so healthy and delicious, and it's so simple to make. After she retired and closed her deli I had to search through several recipes and make my adjustments to get it to my liking. It has become a staple in my home.\"",
    "ins": "Fill a large pot with lightly salted water; add lentils and bring to a rolling boil. Cook until slightly tender, about 10 minutes. Add grated carrots; cook until slightly softened, about 10 minutes. Drain lentils and carrots.\nHeat olive oil in the same pot over medium heat; add onions and garlic. Cook and stir until onions wilt and become transparent, 5 to 7 minutes. Stir in lentils and carrots and reduce heat to medium-low. Add enough water to the pot to keep the lentil mixture from drying out.\nSprinkle cumin, cayenne, curry powder, salt, and pepper over lentils; stir until heated through and fragrant, about 5 minutes. Serve over rice.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "4462539.jpg",
    "o": "",
    "st": "allrecipes"
}