{
    "id": 245459,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (1 1/2) pound butternut squash",
        "Extra virgin olive oil",
        "Sea salt to taste",
        "Ground black pepper to taste",
        "1/4 cup creme fraiche",
        "1/4 teaspoon smoked paprika",
        "1 French baguette",
        "1 medium head radicchio",
        "2 tablespoons balsamic glaze (reduced balsamic vinegar)",
        "1/2 cup crumbled blue cheese, plus more for garnish",
        "Reynolds WrapÂ® Aluminum Foil"
    ],
    "nut": [
        "Calories > 377 kcal",
        "Carbs > 62.5 g",
        "Cholesterol > 22 mg",
        "Fat > 10.6 g",
        "Protein > 12.3 g",
        "Sodium > 600 mg"
    ],
    "n": "Butternut Crostini with Radicchio and Blue Cheese",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 6,
    "des": "\"Need a fancy, modern appetizer for your holiday table? Try this flavorful, flaky treat from Sara Forte of A Sprouted Kitchen.\"",
    "ins": "Preheat the oven to 425 degrees F. Line 2 baking sheets with Reynolds Wrap(R) Aluminum Foil. Set aside.\nCut the squash in half lengthwise and remove the seeds. Brush the flesh with a thin coat of olive oil. Set the squash cut side up on the prepared tray. Sprinkle with salt and pepper and roast for 40 minutes until the squash is fork tender. Remove to cool completely.\nOnce cool, scoop the flesh into a bowl. Add the creme fraiche, paprika, and a pinch each of salt and pepper. Mash with a fork until completely smooth. This much can be done up to three days in advance.\nCut the baguette into 1/2-inch slices on a diagonal. Spread them on the second foil-lined baking sheet. Brush the tops with a thin coat of olive oil. Bake on the middle rack for 6 minutes until the edges are just browned.\nCut the radicchio into thin ribbons. Toss with olive oil, balsamic glaze and a pinch of salt and pepper. Adjust seasoning and dressing to taste. Spread a couple tablespoons of the squash mash on top of each crostini. Top with the radicchio slaw and a sprinkle of blue cheese for garnish.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "2817734.jpg",
    "o": "",
    "st": "allrecipes"
}