{
    "id": 245441,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups water",
        "1 cup farro, not rinsed",
        "1 tablespoon kosher salt",
        "2 sprigs fresh thyme",
        "1/2 cup finely diced onion",
        "3 cloves garlic, minced",
        "1/4 cup finely diced red bell pepper",
        "1/2 teaspoon freshly ground black pepper",
        "1 ounce freshly grated Parmigiano-Reggiano cheese",
        "1 large egg",
        "1 pinch cayenne pepper",
        "1/4 cup olive oil for frying"
    ],
    "nut": [
        "Calories > 149 kcal",
        "Carbs > 25.1 g",
        "Cholesterol > 35 mg",
        "Fat > 3.9 g",
        "Protein > 6.6 g",
        "Sodium > 1049 mg"
    ],
    "n": "Crispy Farro Cakes",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"By using a little egg and a touch of finely grated Parmigiano Reggiano cheese instead of a breadcrumb binder, I was able to make farro cakes that didn't fall apart in the skillet. The key is letting the first side cook until a well-browned, crispy surface forms, then you can flip them.\"",
    "ins": "Place water, farro, and salt in a large pot. Stir in thyme, onion, and garlic. Bring to a boil over high heat. Reduce heat to low, cover, and simmer until farro is very tender, 40 to 45 minutes. Drain well for about 10 minutes (do not rinse). Remove sprigs of thyme.\nTransfer farro to a large bowl. While farro is still hot, add bell pepper, black pepper, grated cheese, egg, and cayenne pepper. Mix thoroughly; lightly tamp down. Allow mixture to come to room temperature. Cover with plastic wrap; refrigerate until thoroughly chilled, about 1 hour.\nHeat oil in skillet over medium-high heat. Pack an ice cream scoop with farro mixture and turn out onto hot skillet. (Because there are no binders like flour or breadcrumbs, the cakes are almost impossible to form with your hands.) Gently press down farro cakes to slightly flatten them. After a minute or so when cakes are frying nicely, reduce heat to medium. Continue cooking the first side until you can see the bottom turning brown and a thick crust forming, 4 to 5 minutes. Do not flip until a crisp brown crust has formed.\nFlip cakes and continue frying over medium heat until second side forms a crispy crust, 4 or 5 minutes.",
    "pt": "15 m",
    "ct": "53 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}