{
    "id": 245464,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cake:",
        "2 cups cake flour",
        "2 cups sugar",
        "3/4 cup cocoa powder",
        "2 teaspoons baking powder",
        "1 1/2 teaspoons baking soda",
        "1/2 teaspoon sea salt",
        "2 eggs",
        "1 cup whole milk",
        "1/2 cup vegetable oil",
        "2 teaspoons vanilla extract",
        "Reynolds WrapÂ® Aluminum Foil",
        "Ganache:",
        "10 1/2 ounces dark chocolate (at least 70%), broken into small chunks",
        "1/2 cup butter, softened",
        "2 tablespoons whipping cream",
        "Garnish:",
        "2 1/2 cups fresh raspberries",
        "1/4 cup pistachios, shelled and crushed",
        "1/2 cup shaved white chocolate"
    ],
    "nut": [
        "Calories > 736 kcal",
        "Carbs > 94.9 g",
        "Cholesterol > 70 mg",
        "Fat > 38.1 g",
        "Protein > 8.7 g",
        "Sodium > 490 mg"
    ],
    "n": "Double Chocolate Raspberry Cake from Reynolds WrapÂ®",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 10,
    "des": "\"Your willpower doesn't stand a chance with this tempting dessert from Dennis Prescott of Dennis The Prescott.\"",
    "ins": "Preheat oven to 350 degrees F. Grease 2 cake pans with butter and a dusting of flour. Set aside.\nFor the cake: In a bowl, combine flour, sugar, cocoa powder, baking powder, baking soda, and salt. Add eggs and beat with an electric mixer on low. Add milk, oil and vanilla extract and on medium speed beat until smooth, about 2 minutes.\nDivide the cake batter between the 2 prepared pans. Cover the pans with Reynolds Wrap(R) Aluminum Foil. Bake for 30-35 minutes, until toothpick inserted in the middle comes out clean. Cool the cakes on a rack for 40 minutes.\nFor the ganache: Fit a large heatproof bowl over a saucepan filled with 1 inch of water, and bring to a simmer. Place chocolate chunks, butter and cream in the bowl. Stir the chocolate frequently until everything has melted and completely combined, 7-8 minutes.\nOnce the cakes have cooled, place one half on a serving tray or cake stand. Spoon 4 tablespoons of ganache over the top of the cake. Place the second cake on top of the first. Spoon the rest of your ganache over the top, letting it drip over the sides.\nGarnish the cake with the raspberries, pistachios and shaved white chocolate pieces. Allow the chocolate to set for at least 30 minutes and serve.",
    "pt": "40 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "2817762.jpg",
    "o": "",
    "st": "allrecipes"
}