{
    "id": 245534,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (10 pound) whole turkey",
        "1/2 cup olive oil",
        "1 tablespoon salt",
        "1 tablespoon chopped fresh sage",
        "1 tablespoon fresh thyme leaves",
        "1 tablespoon finely chopped fresh rosemary",
        "1 teaspoon crushed black pepper"
    ],
    "nut": [
        "Calories > 777 kcal",
        "Carbs > 0.3 g",
        "Cholesterol > 268 mg",
        "Fat > 42.7 g",
        "Protein > 92 g",
        "Sodium > 920 mg"
    ],
    "n": "Roast Spatchcock Turkey",
    "a": "foodelicious",
    "r": "0",
    "s": 10,
    "des": "\"This roasting method results in the juiciest, crispiest turkey cooked in a fraction of the time it usually takes. The secret is to remove the backbone and flatten out the bird. Carving is a whole lot easier, too. Once you try it, you might never go back.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Place a roasting rack on a baking sheet.\nTurn the turkey over, breast-side down. Using a pair of sharp heavy-duty kitchen shears, cut along one side of the backbone. Repeat on the other side of the backbone. Reserve the backbone for making turkey stock for gravy. Press firmly down onto both sides of turkey to flatten.\nTuck the wing tips under the turkey and place on the roasting rack. Pat skin dry and rub olive oil over the entire turkey; season with salt, sage, thyme, rosemary, and black pepper.\nBake in the preheated oven for 1 hour 30 minutes, rotating baking sheet every 30 minutes. Increase temperature to 400 degrees F (200 degrees C) and roast until skin is crisp, about 15 minutes more. An instant-read thermometer inserted into the thickest part of the thigh should read 165 degrees F (74 degrees C). Remove turkey from the oven, cover loosely with a doubled sheet of aluminum foil, and allow to rest for 10 to 15 minutes before slicing.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "4221146.jpg",
    "o": "",
    "st": "allrecipes"
}