{
    "id": 245593,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Pizza Dough:",
        "2 1/4 teaspoons active dry yeast",
        "2 teaspoons white sugar",
        "1 cup warm water",
        "3 cups all-purpose flour",
        "1 teaspoon salt",
        "1/4 cup olive oil",
        "Toppings:",
        "6 potatoes, thinly sliced",
        "2 tablespoons olive oil",
        "8 ounces sour cream",
        "2 tablespoons garlic powder",
        "1 (8 ounce) package marbled Colby-Monterey Jack cheese, shredded",
        "1 bunch green onions, chopped",
        "1/4 cup bacon bits, or to taste"
    ],
    "nut": [
        "Calories > 470 kcal",
        "Carbs > 56.7 g",
        "Cholesterol > 34 mg",
        "Fat > 21.3 g",
        "Protein > 14.5 g",
        "Sodium > 520 mg"
    ],
    "n": "Pierogi Pizza",
    "a": "liz",
    "r": "0",
    "s": 10,
    "des": "\"Two of my favorite things blended together; tastes like pierogis on a pizza. Tasty potatoes are spread on a pizza crust and covered in all the traditional pierogi fixings - bacon, cheese, and green onions. Slice and serve with plain sour cream for dipping.\"",
    "ins": "Dissolve yeast and sugar in warm water in a small bowl. Let stand until yeast softens and begins to bubble, about 5 minutes.\nCombine flour and salt together in a large bowl. Pour yeast mixture and 1/4 cup olive oil over flour. Mix and knead until a sticky dough forms, about 5 minutes. Place dough in a large, lightly-oiled bowl and turn to coat. Cover with a towel and let rise in a warm place until doubled in volume, about 1 hour.\nPlace potatoes in a large pot and pour in enough water to cover. Bring to a boil; cook until potatoes are just tender, about 10 minutes. Drain.\nHeat 2 tablespoons olive oil in a large skillet over medium-high heat; add potatoes and cook until lightly golden, about 5 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nWhisk sour cream and garlic powder together in a small bowl to make pizza \"sauce\".\nGently pat and stretch pizza dough out to a 12-inch circle on a pizza stone. Spread sauce evenly over dough. Layer potatoes on top to cover dough completely. Sprinkle Cheddar cheese, green onions, and bacon bits on top.\nBake pizza in the preheated oven until crust is golden brown, 15 to 20 minutes.",
    "pt": "35 m",
    "ct": "35 m",
    "tt": "2 h ",
    "i": "4515051.jpg",
    "o": "",
    "st": "allrecipes"
}