{
    "id": 245527,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "2 tablespoons anise seeds, crushed, or as needed",
        "4 1/2 cups confectioners' sugar, plus more for dusting",
        "1 1/2 teaspoons baking powder",
        "6 egg whites",
        "1 tablespoon vanilla extract",
        "1 teaspoon anise oil",
        "3 1/2 cups all-purpose flour, plus more for dusting"
    ],
    "nut": [
        "Calories > 111 kcal",
        "Carbs > 25.2 g",
        "Cholesterol > 0 mg",
        "Fat > 0.3 g",
        "Protein > 1.9 g",
        "Sodium > 30 mg"
    ],
    "n": "Meringue Springerle Cookies",
    "a": "Heide F",
    "r": "0",
    "s": 36,
    "des": "\"A lighter, crisper version of springerle, made with egg whites. Store in airtight containers in the freezer. They will keep for months and improve with age.\"",
    "ins": "Place cookie molds in the freezer. Line baking sheets with parchment paper and spray lightly with cooking spray. Sprinkle crushed anise seeds lightly over parchment paper.\nSift confectioners' sugar and baking powder together into a large bowl and set aside.\nBeat egg whites in the bowl of a stand mixer fitted with the paddle attachment on medium speed until stiff peaks form, 5 to 10 minutes. Carefully fold in sifted sugar, vanilla extract, and anise oil. Add flour gradually while mixing until dough is stiff.\nTurn dough out onto work surface. Divide into 3 pieces, shape into discs, and wrap with plastic wrap. Chill until firm, 3 hours to overnight.\nRemove discs of dough from the fridge and divide into smaller pieces based on the size of your molds. Coat each piece with confectioners' sugar and keep in the refrigerator as you roll out one piece at a time.\nDust work surface or pastry cloth lightly with flour. Roll out piece of dough to a circle 1/4-inch thick. Dust the top of the circle lightly with confectioners' sugar. Dust the cookie mold heavily with confectioners' sugar before pressing down firmly to make clear, deep impressions. Use a toothpick or moistened brush, not a knife, to pry dough out of the mold if it sticks.\nUse a pastry cutter or knife to cut the molded cookies apart. Transfer cookies to prepared baking sheets. Repeat with remaining pieces of dough, dusting the molds with confectioners' sugar each time before using. Leave cookies out to air dry, uncovered, 8 hours to overnight.\nPreheat oven to 300 degrees F (150 degrees C).\nBake cookies in the preheated oven until firm and dry but still pale, 10 to 15 minutes. Transfer cookies to cooling racks to cool completely.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}