{
    "id": 245544,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/4 cups sorghum flour",
        "1 cup white rice flour",
        "1 teaspoon baking soda",
        "1 teaspoon xanthan gum",
        "1/2 teaspoon salt",
        "1 cup unsalted butter, softened",
        "3/4 cup white sugar",
        "3/4 cup brown sugar",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "2 cups milk chocolate chips",
        "1 cup hemp seed hearts"
    ],
    "nut": [
        "Calories > 144 kcal",
        "Carbs > 16.5 g",
        "Cholesterol > 20 mg",
        "Fat > 7.9 g",
        "Protein > 2.5 g",
        "Sodium > 69 mg"
    ],
    "n": "Gluten-Free Chocolate Chip Hemp Seed Cookies",
    "a": "Christine",
    "r": "0",
    "s": 48,
    "des": "\"I created this recipe about 3 years ago and I have made it over 5 times. It turns out perfectly every time. I do not publish any gluten-free recipes that I have not made 5 or more times with perfect results.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nCombine sorghum flour, rice flour, baking soda, xanthan gum, and salt together in a large bowl.\nBeat butter, white sugar, and brown sugar together in a large bowl with an electric mixer until light and fluffy, about 2 minutes. Beat eggs one at a time into the butter mixture; add vanilla extract. Pour butter mixture over flour mixture. Beat together until combined, about 2 minutes. Fold chocolate chips and hemp seeds into the cookie dough.\nPlace cookie dough in the refrigerator to firm up, at least 20 minutes.\nDrop heaping tablespoons of dough 2 inches apart on baking sheets; press down with the back of the spoon to flatten slightly.\nBake in the preheated oven until cookie edges are lightly golden, 8 to 11 minutes. Remove from the oven and let cool before taking off the parchment paper, about 10 minutes. Cool baking sheet before re-using for another batch.",
    "pt": "25 m",
    "ct": "8 m",
    "tt": "1 h ",
    "i": "3989596.jpg",
    "o": "",
    "st": "allrecipes"
}