{
    "id": 245513,
    "old_rating": "4.85714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (5 pound) whole chicken",
        "salt to taste",
        "3 tablespoons olive oil",
        "1 small onion, thickly sliced",
        "1 cup light beer",
        "1 1/2 cups chicken broth, or more as needed",
        "6 carrots, cut into long pieces",
        "1 lemon, sliced",
        "2 teaspoons dried rosemary",
        "1 teaspoon dried thyme"
    ],
    "nut": [
        "Calories > 736 kcal",
        "Carbs > 13.6 g",
        "Cholesterol > 275 mg",
        "Fat > 42.5 g",
        "Protein > 70.1 g",
        "Sodium > 584 mg"
    ],
    "n": "Braise-Roasted Chicken with Lemon and Carrots",
    "a": "hello angie",
    "r": "0",
    "s": 5,
    "des": "\"A spatchcock chicken sits atop a simple broth with carrots, onion, and lemon, creating a delicious gravy while roasting.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nPat chicken dry with paper towels. Cut backbone from chicken using kitchen shears and save backbone for another use. Flip chicken, breast-side up, and forcefully press chicken down to flatten; season generously with salt.\nHeat olive oil in a large oven-safe cast iron skillet over medium-high heat; pan-fry chicken, skin-side down, until golden, 6 to 7 minutes. Transfer chicken to a plate, skin-side up.\nCook and stir onion in oil in the same skillet until softened, 2 to 3 minutes. Add beer, scraping up any browned bits from the bottom of the skillet. Continue cooking until most of the beer is reduced, 2 to 4 minutes more. Stir chicken broth, carrots, lemon, rosemary, and thyme into beer mixture. Arrange chicken, skin-side up, over vegetables.\nRoast in the preheated oven until chicken is golden brown and crispy, about 50 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C). Transfer chicken and vegetables to a large platter and let rest, uncovered.\nBring remaining broth and juices in the skillet to a boil and cook until sauce is thickened, about 10 minutes. Season sauce with salt.\nSlice chicken and serve with sauce.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}