{
    "id": 245542,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (32 ounce) package frozen bite-size potato nuggets (such as Tater TotsÂ®)",
        "4 slices bacon",
        "Cheese Sauce:",
        "2 tablespoons butter",
        "1 shallot, minced",
        "2 tablespoons all-purpose flour",
        "1 1/2 cups whole milk",
        "2 tablespoons sour cream",
        "1 pinch ground black pepper",
        "1 pinch nutmeg",
        "1 1/2 cups shredded sharp Cheddar cheese, divided",
        "3 green onions, sliced",
        "2 tablespoons sour cream, or to taste (optional)"
    ],
    "nut": [
        "Calories > 257 kcal",
        "Carbs > 22.5 g",
        "Cholesterol > 28 mg",
        "Fat > 17 g",
        "Protein > 7.9 g",
        "Sodium > 489 mg"
    ],
    "n": "Loaded Tater TotsÂ®",
    "a": "Tyson",
    "r": "0",
    "s": 12,
    "des": "\"Brought this to a football-watching party, and it was a great crowd-pleaser.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Arrange potato nuggets in a single layer on a baking sheet.\nBake in the preheated oven until lightly golden, 20 to 25 minutes.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels and chop coarsely.\nMelt butter in a saucepan over medium heat; add shallot and cook until fragrant. Stir in flour and cook until light golden, about 2 minutes. Whisk in milk and 2 tablespoons sour cream; stir until smooth and thick, about 5 minutes. Season with black pepper and nutmeg. Stir in 1 cup Cheddar cheese until fully melted.\nTransfer potatoes to a 9x13-inch baking dish. Sprinkle bacon on top. Pour cheese sauce over the potatoes. Sprinkle remaining 1/2 cup Cheddar cheese on top.\nBake in the preheated oven just until cheese melts, about 7 minutes. Remove from the oven; top with green onions and 2 tablespoons sour cream.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "3928553.jpg",
    "o": "",
    "st": "allrecipes"
}