{
    "id": 245553,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons coconut oil, melted, or as needed",
        "8 fresh peaches",
        "1/4 cup coconut sugar",
        "2 teaspoons arrowroot powder",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon freshly grated nutmeg",
        "Crumble Topping:",
        "1 cup almond flour",
        "1/2 cup chopped pecans",
        "1/2 cup unsweetened shredded coconut",
        "1/4 cup coconut sugar",
        "1 teaspoon sea salt",
        "1 teaspoon ground cinnamon",
        "1/4 cup unsalted butter, chilled and cut into small cubes"
    ],
    "nut": [
        "Calories > 319 kcal",
        "Carbs > 26.2 g",
        "Cholesterol > 15 mg",
        "Fat > 23.3 g",
        "Protein > 4.5 g",
        "Sodium > 231 mg"
    ],
    "n": "Paleo Peach Crumble",
    "a": "Cindy Anschutz Barbieri",
    "r": "0",
    "s": 8,
    "des": "\"I am loving all of the peaches this season! I can't stop eating them but today I am going to do some baking and make a paleo peach crumble. This is how I created this amazing paleo dessert!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with coconut oil.\nFill a large pot a third of the way with water; bring to a boil. Remove from heat. Slice each peach in half, keeping pit intact. Place peach halves in the boiling water to soften, about 10 minutes. Take out of the water and let cool until easily handled, about 10 minutes.\nCombine 1/4 cup coconut sugar, arrowroot powder, cinnamon, and nutmeg in a small bowl and mix with a fork.\nMix almond flour, pecans, coconut, 1/4 cup coconut sugar, sea salt, and cinnamon together in a large bowl. Rub in cold butter using your fingers until topping mixture is crumbly, about 2 minutes.\nRemove pit from peach halves; peel and slice flesh. Arrange slices in the baking dish. Sprinkle coconut sugar mixture on top. Scatter topping mixture evenly over the peaches.\nBake in the preheated oven until topping is golden and juices are bubbly, 35 to 40 minutes.",
    "pt": "35 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}