{
    "id": 24557,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup warm milk",
        "1 (.25 ounce) package active dry yeast",
        "1/2 cup bread flour",
        "6 cups bread flour",
        "1/2 teaspoon salt",
        "1/2 cup white sugar",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "3/4 cup butter, melted",
        "3 eggs, room temperature",
        "2 cups warm milk",
        "2 tablespoons butter, melted",
        "1 egg, beaten",
        "1 tablespoon water",
        "1/2 cup chopped almonds"
    ],
    "nut": [
        "Calories > 740 kcal",
        "Carbs > 98.7 g",
        "Cholesterol > 152 mg",
        "Fat > 29.1 g",
        "Protein > 20.8 g",
        "Sodium > 357 mg"
    ],
    "n": "Vasilopita",
    "a": "ANNAV",
    "r": "0",
    "s": 8,
    "des": "\"The Vasilopita is a Greek New Year's Bread. It is made in honor of a beautiful act of charity by St. Basil to the poor and needy of his flock. In order to ensure that the needy would have money for life's necessities, and knowing that they were also proud people, St. Basil had the ladies of his church bake sweet bread with coins baked into them. In this way he could give them money without demeaning them at all. It is therefore traditional to bake a coin into the Vasilopita (St. Basil's Bread). The one who receives the coin is considered to be especially blessed for the year.\"",
    "ins": "In a small bowl, stir together 1/2 cup milk, yeast and 1/2 cup flour. Cover and let the sponge rise in a warm place until nearly doubled in size, about 45 minutes.\nPlace 6 cups flour in a large bowl. Make a well in the center and add the sponge, salt, sugar, cinnamon, nutmeg, 3/4 cup melted butter, 3 eggs and 2 cups milk. Mix thoroughly to make a stiff dough.\nTransfer the dough into a greased springform pan. Brush dough with melted butter, cover with greased plastic wrap, and let rise in a warm place until doubled in size, about 60 to 90 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Beat egg with 1 tablespoon water to make an egg wash.\nWhen dough has risen, insert a clean silver coin into the loaf. Brush dough egg wash and sprinkle with chopped almonds. Bake in preheated oven until deep golden brown, about 40 minutes.",
    "pt": "2 h ",
    "ct": "40 m",
    "tt": "3 h ",
    "i": "1899033.jpg",
    "o": "",
    "st": "allrecipes"
}