{
    "id": 245547,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 tablespoons butter, divided",
        "6 eggs",
        "1/4 cup heavy whipping cream",
        "1/4 cup shredded mild Cheddar cheese",
        "1/4 cup chopped onion",
        "1/4 cup chopped green bell pepper",
        "3 slices bacon",
        "2 sausage links, sliced into 1/2-inch pieces",
        "1/3 cup tomato puree",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon onion powder",
        "1/8 teaspoon dried oregano",
        "1/8 teaspoon dried basil",
        "salt and ground black pepper to taste",
        "3/4 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 431 kcal",
        "Carbs > 6.5 g",
        "Cholesterol > 356 mg",
        "Fat > 33.9 g",
        "Protein > 25.4 g",
        "Sodium > 948 mg"
    ],
    "n": "Low-Carb Deep-Dish Breakfast Pizza",
    "a": "MrsGluck",
    "r": "0",
    "s": 4,
    "des": "\"Gluten-free and low-carb breakfast pizza.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Place 1 tablespoon butter in a glass or ceramic pie pan and heat briefly in the oven until butter is melted.\nWhisk eggs, cream, and Cheddar cheese in a large bowl. Pour into warmed pie pan.\nBake in the preheated oven until eggs are set and golden, 15 to 20 minutes. Remove egg \"crust\" from the oven.\nMelt remaining 1/2 tablespoon butter in a skillet over medium heat. Add onion and green bell pepper; cook and stir until softened, about 5 minutes.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Cook sausage in the same skillet until browned, about 5 minutes. Drain on paper towels.\nCombine tomato puree, garlic powder, onion power, oregano, basil, salt, and black pepper in small bowl to make pizza sauce.\nTop egg crust with pizza sauce, mozzarella cheese, onion and green pepper mixture, bacon, and sausage.\nBake the pizza in the preheated oven until cheese is melted, about 10 minutes.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "2960619.jpg",
    "o": "",
    "st": "allrecipes"
}