{
    "id": 245503,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "2 teaspoons baking soda",
        "2 teaspoons baking powder",
        "2 teaspoons ground cinnamon",
        "2 teaspoons ground nutmeg",
        "1/2 teaspoon salt",
        "1 1/2 cups butter",
        "1 1/2 cups white sugar",
        "3 eggs",
        "1/2 cup molasses",
        "1 tablespoon vanilla extract",
        "3 cups cooked mashed sweet potatoes",
        "1 1/2 cups sweetened dried cranberries (such as CraisinsÂ®)",
        "1 cup chopped walnuts"
    ],
    "nut": [
        "Calories > 493 kcal",
        "Carbs > 66.5 g",
        "Cholesterol > 81 mg",
        "Fat > 23.6 g",
        "Protein > 5.9 g",
        "Sodium > 467 mg"
    ],
    "n": "Cranberry Sweet Potato Spice Cake",
    "a": "Pamela J Hagen-French",
    "r": "0",
    "s": 16,
    "des": "\"There is more to sweet potatoes than toasted marshmallows! This cake has amazing flavor and options are endless to change up the recipe. For frosting, use your favorite, such as cream cheese, butter cream, or maple cream.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch round baking pans.\nSift flour, baking soda, baking powder, cinnamon, nutmeg, and salt together in a bowl.\nBeat butter and sugar together in a separate large bowl with an electric mixer until light and fluffy. Beat one egg at a time into the butter mixture; add molasses and vanilla extract with last egg. Add sweet potatoes, cranberries, and walnuts; mix until batter is thoroughly combined. Gradually beat flour mixture into batter until thoroughly combined. Pour batter into prepared baking pans.\nBake in preheated oven until a toothpick inserted into the center comes out clean, about 1 hour 10 minutes. Cool in the pans for 10 minutes before turning out onto wire rack to cool completely.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}