{
    "id": 245562,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 butternut squash, halved lengthwise and seeded",
        "1/4 cup olive oil, or more as needed, divided",
        "1/2 teaspoon ground Saigon cinnamon",
        "1/4 teaspoon ground nutmeg",
        "kosher salt and freshly ground black pepper to taste",
        "2 ounces dark chocolate, finely chopped",
        "2 cloves garlic, crushed",
        "1 small red chile pepper, halved lengthwise",
        "2 tablespoons pure maple syrup, divided",
        "1 small yellow onion, chopped",
        "4 cups chicken stock"
    ],
    "nut": [
        "Calories > 385 kcal",
        "Carbs > 55.6 g",
        "Cholesterol > 1 mg",
        "Fat > 19.2 g",
        "Protein > 4.9 g",
        "Sodium > 802 mg"
    ],
    "n": "Roasted Butternut Squash Soup Infused With Chocolate",
    "a": "HisAnomaly",
    "r": "0",
    "s": 4,
    "des": "\"Butternut squash roasted with chocolate, chili peppers, and other goodness pureed down to a soup. Even my squash-hating sweetie enjoyed it. Garnish with chocolate chips, chocolate shavings, sourdough crostini, a drizzle of maple syrup, or even a bit of light cream.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nRub each half of squash with 1 1/2 tablespoons olive oil and place cut-side up on baking sheet. Sprinkle cinnamon, nutmeg, salt, and pepper on each half. Place chocolate, garlic, chile, and maple syrup into the cavities of each half.\nBake in the preheated oven until flesh is soft and tender, 45 to 55 minutes. Remove from oven to cool.\nHeat 1 tablespoon olive oil in a stock pot over medium heat. Cook and stir onion until translucent, about 5 minutes.\nScoop flesh out of 1 butternut squash half, along with cavity contents, into a blender. Add onion and 2 cups chicken stock; puree until smooth. Pour into stock pot. Scoop flesh out of remaining butternut squash half, along with cavity contents, into blender. Add remaining chicken stock; puree until smooth. Pour into stock pot.\nHeat soup in stock pot over medium heat to desired temperature; add salt and ground black pepper to taste.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "4298222.jpg",
    "o": "",
    "st": "allrecipes"
}