{
    "id": 245570,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 ounces whole grain teff",
        "4 ounces shredded coconut",
        "2 ounces chia seeds",
        "2 ounces milled flax seed",
        "1 pound raw walnuts",
        "12 ounces raw almonds",
        "12 ounces semisweet chocolate chips",
        "8 ounces chopped dates",
        "5 ounces dried cranberries",
        "4 ounces roasted pumpkin seeds (pepitas)",
        "1 (16 ounce) jar natural peanut butter, melted",
        "6 ounces honey"
    ],
    "nut": [
        "Calories > 107 kcal",
        "Carbs > 8.7 g",
        "Cholesterol > 0 mg",
        "Fat > 7.7 g",
        "Protein > 2.8 g",
        "Sodium > 13 mg"
    ],
    "n": "Chocolate Cranberry Nut Balls",
    "a": "chefboy1969",
    "r": "0",
    "s": 120,
    "des": "\"I'm gravitating towards the Paleo Diet so I created this high-protein and energy snack recipe out of a desire to eliminate those expensive and so-called nutritious protein bars. I don't want all of the processed carbs that are hidden in them because, quite honestly, they aren't that healthy. \n\nThese are really tasty and my whole family loves them. I recommend making them fairly small and bite-sized, as they can crumble a little as you're biting into them. Freezing or refrigerating them keeps the messiness down, but they won't spoil if left at room temperature. I eat 4 or 5 with a big glass of water and feel full!\"",
    "ins": "Place teff in a large skillet over medium heat and toast until fragrant, 3 to 5 minutes. Transfer to a large bowl. Stir in coconut, chia seeds, and milled flax seed.\nChop walnuts, almonds, chocolate chips, dates, cranberries, and pumpkin seeds in a food processor, in batches if necessary, until finely chopped and the consistency of coarse breadcrumbs. Add nut mixture to teff mixture and mix thoroughly. Pour peanut butter and honey over nut and teff mixture; mix until evenly distributed.\nLine 2 baking sheets with parchment paper. Roll the teff mixture into bite-size balls and arrange on baking sheets. Wrap sheets well with plastic wrap. Freeze until balls are firm, 8 hours to overnight.",
    "pt": "30 m",
    "ct": "3 m",
    "tt": "8 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}