{
    "id": 245581,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Pie Crust:",
        "1 1/2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "2 egg yolks",
        "1/4 cup cold butter, cubed",
        "3/8 cup water",
        "Filling:",
        "6 apples - peeled, cored, and chopped",
        "3/4 cup white sugar",
        "2 tablespoons all-purpose flour",
        "1 teaspoon ground mulling spices",
        "1 pinch salt",
        "Topping:",
        "1/2 cup butter, softened",
        "1/2 cup white sugar",
        "3/4 cup all-purpose flour",
        "3/4 cup rolled oats",
        "1 teaspoon ground cinnamon",
        "1 pinch salt"
    ],
    "nut": [
        "Calories > 404 kcal",
        "Carbs > 63.5 g",
        "Cholesterol > 78 mg",
        "Fat > 15.5 g",
        "Protein > 4.8 g",
        "Sodium > 249 mg"
    ],
    "n": "Deep-Dish Apple Pie with Crumble Topping",
    "a": "tami slate",
    "r": "0",
    "s": 10,
    "des": "\"I got this recipe from lots of different sources. I couldn't find one I liked. So took what I liked and added my own spin and this is what came out. I love this recipe, because it has all the flavors of fall. A little trick I learned from my grandmother: use different types of apples for the best flavor. I use Granny Smith, Braeburn, and Golden Delicious, but you can use whatever you like. I serve it as is, but encourage the use of ice cream, whipped cream, or whatever addition the occasion calls for.\"",
    "ins": "Mix 1 1/2 cup flour and 1/2 teaspoon salt together in a large bowl. Rub egg yolks and cold butter into the flour mixture until it forms fine crumbs. Add water a little at a time just until dough starts to form and stick together. Wrap dough with plastic wrap and allow to rest in the refrigerator, about 30 minutes.\nRoll pie dough out on a well-floured surface and place in 9-inch deep-dish pie plate.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine apples, 3/4 cup sugar, 2 tablespoons flour, mulling spices, and pinch of salt in a large bowl; mix well to combine. Place apple mixture in prepared pie shell.\nCream 1/2 cup softened butter and 1/2 cup sugar together in a bowl with an electric mixer. Stir in 3/4 cup flour, oats, cinnamon, and pinch of salt. Sprinkle the topping mixture over the apples.\nBake pie in the preheated oven until crust and topping are golden brown and filling begins to bubble, about 1 hour.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "2 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}