{
    "id": 245530,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups pecan halves, broken into coarse pieces",
        "1 cup white sugar",
        "3/4 cup light corn syrup",
        "3/4 cup dark corn syrup",
        "4 eggs",
        "1/4 cup butter, melted",
        "1 1/2 teaspoons vanilla extract",
        "1 pinch salt",
        "8 half pint canning jars with lids and rings",
        "cooking spray",
        "2 unbaked 9-inch pie crusts"
    ],
    "nut": [
        "Calories > 794 kcal",
        "Carbs > 97.4 g",
        "Cholesterol > 108 mg",
        "Fat > 44.6 g",
        "Protein > 8.7 g",
        "Sodium > 396 mg"
    ],
    "n": "Traditional Pecan Pie in a Jar",
    "a": "Culinary Envy",
    "r": "0",
    "s": 8,
    "des": "\"Traditional Pecan Pie in a Jar has a deeply toasted, sweet, luxurious flavor. Just break through the caramelized, crispy pecan topping to expose the amber-colored rich filling and flaky crust inside. Serve with sweetened whipped cream or vanilla ice cream, if desired.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spread pecans on a baking sheet.\nBake pecans in the preheated oven until lightly toasted, 6 to 8 minutes. Cool to room temperature.\nBring sugar, light corn syrup, and dark corn syrup to a boil in a saucepan; boil for 2 minutes. Remove from heat and cool slightly, about 10 minutes.\nWhisk eggs in a large bowl until frothy. Add syrup mixture slowly, whisking constantly to prevent eggs from curdling. Whisk in butter, vanilla extract, and salt until batter is smooth.\nSpray 8 small jars with cooking spray. Press pieces of pie crust dough into bottom and sides of jars. Add a layer of toasted pecans to each jar. Spoon in batter, leaving 1/4 inch rim at top.\nBake in preheated oven until darkened on the top, about 40 minutes. Cool to room temperature before serving.",
    "pt": "25 m",
    "ct": "48 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}