{
    "id": 245510,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 1/2 cups unbleached all-purpose flour",
        "1 teaspoon kosher salt",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1 cup unsalted butter, softened",
        "1 cup light brown sugar, packed",
        "1/2 cup granulated sugar",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "1 cup dark chocolate chips",
        "1 cup dark chocolate chips, melted",
        "1 cup caramel-filled chocolate candies",
        "1 teaspoon sea salt",
        "ReynoldsÂ® Parchment Paper"
    ],
    "nut": [
        "Calories > 207 kcal",
        "Carbs > 28.1 g",
        "Cholesterol > 29 mg",
        "Fat > 10.4 g",
        "Protein > 1.4 g",
        "Sodium > 151 mg"
    ],
    "n": "Salted Caramel Chocolate Chip Cookies from ReynoldsÂ® Parchment Paper",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 33,
    "des": "\"A delightful twist on a family favorite. These cookies incorporate sweet caramel-filled chocolate candies, dark chocolate and a finishing sprinkle of sea salt for a fabulous sweet and salty combination.\"",
    "ins": "Preheat oven to 350 degrees F. Line a baking sheet with Reynolds(R) Parchment Paper and set aside.\nWhisk together flour, kosher salt, baking powder and baking soda; set aside. Mix butter, light brown sugar and granulated sugar together with an electric mixer until light and fluffy.\nBeat in eggs, one at a time. Add vanilla and beat. Slowly add flour mixture, mixing gently until incorporated. Fold in caramel filled chocolate candies and chocolate chips.\nRoll 2 tablespoons of dough into a ball, covering any candies with dough so they are not exposed.\nPlace dough balls on parchment lined baking sheets. Bake cookies for 10-12 minutes. Cool cookies on baking sheet for 5 minutes and transfer parchment paper with cookies onto wire racks to cool completely.\nDrizzle cooled cookies with melted chocolate and sprinkle with sea salt. Chill cookies until chocolate sets.",
    "pt": "20 m",
    "ct": "11 m",
    "tt": "31 m",
    "i": "2822075.jpg",
    "o": "",
    "st": "allrecipes"
}