{
    "id": 245660,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 Cornish game hens",
        "6 tablespoons Greek yogurt",
        "1 teaspoon lemon juice",
        "1 teaspoon ground paprika",
        "1/2 teaspoon olive oil",
        "1/2 teaspoon garlic salt",
        "1/4 teaspoon ground thyme",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon dried oregano",
        "1/4 teaspoon dried rosemary",
        "1/4 teaspoon dried savory"
    ],
    "nut": [
        "Calories > 366 kcal",
        "Carbs > 3.1 g",
        "Cholesterol > 159 mg",
        "Fat > 26.1 g",
        "Protein > 28.2 g",
        "Sodium > 552 mg"
    ],
    "n": "Greek Yogurt Cornish Game Hens",
    "a": "Shyla Lane",
    "r": "0",
    "s": 2,
    "des": "\"Perfect for a nice summertime meal on the patio. Serve with extra Greek yogurt or some chile sauce for dipping.\"",
    "ins": "Place Cornish game hens in a large resealable plastic bag.\nMix Greek yogurt, lemon juice, paprika, olive oil, garlic salt, thyme, black pepper, oregano, rosemary, and savory together in a small bowl. Pour yogurt mixture over game hens, turning to coating them completely and get some of the mixture into their cavities. Seal bag, removing as much air as possible, and refrigerate, 2 hours to overnight.\nPreheat grill for low heat and lightly oil the grate.\nRemove game hens from bags and pat dry. Discard yogurt mixture. Grill until skins starts to brown, about 3 minutes per side. Cover grill and cook game hens, rotating if needed, until an instant-read thermometer inserted into the thickest parts of the thigh, near the bone, reads 165 degrees F (74 degrees C), 15 to 20 minutes.\nRemove game hens from the grill and slice open on the breast side, flattening them out like open books. Return to the grill, cut-side down, cover grill, and cook until browned, about 4 minutes.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}