{
    "id": 245625,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Prune Filling:",
        "1/4 cup honey",
        "2 tablespoons lemon juice",
        "20 pitted prunes",
        "water to cover",
        "Cookie Dough:",
        "2 1/2 cups all-purpose flour",
        "2 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 1/4 cups white sugar",
        "1/2 cup butter, softened",
        "1/2 cup shortening",
        "3 eggs",
        "1/4 cup orange juice",
        "1 1/2 teaspoons vanilla extract"
    ],
    "nut": [
        "Calories > 95 kcal",
        "Carbs > 13.6 g",
        "Cholesterol > 16 mg",
        "Fat > 4.3 g",
        "Protein > 1.1 g",
        "Sodium > 65 mg"
    ],
    "n": "Purim Hamantaschen with Prune Filling",
    "a": "RIELLA",
    "r": "0",
    "s": 50,
    "des": "\"Traditional, sweet hamantaschen for the Jewish holiday of Purim. If you don't have enough prune filling, use raspberry jam, apricot preserves or a chocolate-hazelnut spread (such as NutellaÂ®).\"",
    "ins": "Combine honey, lemon juice, and prunes in a small saucepan. Add enough water to cover. Bring to a boil; reduce heat and simmer until prunes are softened, about 10 minutes. Remove prune filling from heat and let cool.\nPreheat oven to 350 degrees F (175 degrees C). Line 3 baking sheets with parchment paper.\nCombine flour, baking powder, and salt together in a bowl.\nBeat sugar, butter, and shortening together with a wooden spoon until creamy. Add eggs; stir until smooth. Stir in orange juice and vanilla extract. Gently fold in flour mixture, mixing until a dough forms. Divide dough into 3 balls.\nRoll out 1 ball of dough on a floured work surface to 1/4-inch thickness, using a piece of parchment paper under the rolling pin to prevent sticking. Use the rim of a glass to cut dough into circles.\nPlace 1/2 teaspoon prune filling in the center of each circle of dough. Pinch edges together to secure filling and form triangular pockets. Transfer cookies to baking sheet. Repeat rolling, cutting, and filling remaining balls of dough.\nBake cookies in the preheated oven until lightly golden, about 18 minutes.",
    "pt": "25 m",
    "ct": "33 m",
    "tt": "58 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}