{
    "id": 245619,
    "old_rating": "4.60714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon bacon grease",
        "1 (1 pound) loaf day-old bread, cubed",
        "12 large eggs",
        "2 teaspoons kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 pinch cayenne pepper",
        "1 pinch freshly grated nutmeg",
        "2 1/2 cups heavy cream",
        "1 pound sliced bacon, cut crosswise into 1/2-inch strips",
        "1 pound fresh spinach, wilted, squeezed dry",
        "12 ounces shredded extra-sharp Cheddar cheese, divided"
    ],
    "nut": [
        "Calories > 546 kcal",
        "Carbs > 23.5 g",
        "Cholesterol > 269 mg",
        "Fat > 41 g",
        "Protein > 21.8 g",
        "Sodium > 1170 mg"
    ],
    "n": "Bacon, Cheddar and Spinach Strata",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"Even with just one layer of filling in the middle of this strata, you'll be looking at a gorgeous casserole which should thoroughly impress your brunch guests . . . bottomless Mimosas or no.\"",
    "ins": "Oil bottom and sides of a 9x13-inch baking dish with about a tablespoon of bacon fat.\nPlace bread cubes in a large mixing bowl.\nCrack eggs into a separate mixing bowl. Season with salt, pepper, cayenne, and nutmeg. Add cream and whisk mixture thoroughly.\nPour egg/cream mixture over the bread cubes and mix to distribute ingredients evenly. Allow bread mixture to sit about 15 minutes to absorb the liquid.\nTransfer half of the bread mixture to the baking pan; spread evenly over the bottom and press mixture down a bit. Top with half of the grated Cheddar cheese. Add cooked bacon pieces in an even layer over the cheese. Place the cooked spinach over the bacon; top with half of the remaining cheese. Finish with the rest of the soaked bread cubes, spread evenly and pressed down slightly. Sprinkle with the rest of the grated cheese. Cover and let strata sit at room temperature for 1 hour before baking.\nPreheat oven to 350 degrees F (175 degrees C).\nBake strata in preheated oven until set, about 45 minutes. Optionally, you can broil the strata for a minute or two to brown the top.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}