{
    "id": 245636,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 12x12-inch squares aluminum foil",
        "20 fresh asparagus, trimmed",
        "2 pounds fresh green beans, trimmed",
        "2 cups carrot sticks",
        "1 (14 ounce) can artichoke hearts, drained",
        "4 tilapia fillets",
        "2 tablespoons chopped fresh basil, or more to taste",
        "1 tablespoon Italian seasoning, or more to taste",
        "1 teaspoon garlic salt, or more to taste",
        "salt and ground black pepper to taste",
        "1/4 cup butter",
        "1/4 cup olive oil, or more to taste",
        "1 (15 ounce) can Italian stewed tomatoes, sliced",
        "8 lemon slices",
        "4 squeezes lemon juice"
    ],
    "nut": [
        "Calories > 520 kcal",
        "Carbs > 43.2 g",
        "Cholesterol > 72 mg",
        "Fat > 27.2 g",
        "Protein > 33.1 g",
        "Sodium > 1274 mg"
    ],
    "n": "Red LobsterÂ® Oven-Roasted Tilapia with Vegetables",
    "a": "Cyndy",
    "r": "0",
    "s": 4,
    "des": "\"My husband really likes the Wood-fired Grilled Tilapia with Vegetables at Red LobsterÂ® and challenged me to come up with a home version. He thinks this is just as good as the Red LobsterÂ® version. Serve over hot rice.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nLay aluminum foil squares on a work surface. Place 5 spears of asparagus in the center of each square; distribute equal amounts of the green beans, carrots, and artichoke hearts among the squares. Lay tilapia fillets over vegetables.\nTop each fillet with basil, Italian seasoning, garlic salt, salt, and pepper. Place 1 tablespoon butter and a drizzle of olive oil on each fillet. Top with tomato slices, lemon slices, and a squeeze of lemon juice. Fold aluminum foil edges together over each fillet to create a tightly sealed packet.\nPlace packets on a baking sheet and bake in preheated oven until fish flakes easily with a fork, 20 to 30 minutes.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "4497300.jpg",
    "o": "",
    "st": "allrecipes"
}