{
    "id": 245723,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 (.25 ounce) packages active dry yeast",
        "3/4 cup granulated sugar, divided",
        "1 cup warm milk",
        "4 cups all-purpose flour, divided",
        "3 large whole eggs, separated",
        "2 egg yolks",
        "1/2 tablespoon brandy",
        "1/2 teaspoon salt",
        "10 tablespoons butter, melted and cooled",
        "1/2 cup slivered blanched almonds, coarsely ground",
        "1/4 cup raisins",
        "1 tablespoon water",
        "Glaze:",
        "3/4 cup confectioners' sugar",
        "1 tablespoon lemon juice"
    ],
    "nut": [
        "Calories > 587 kcal",
        "Carbs > 85.4 g",
        "Cholesterol > 153 mg",
        "Fat > 21.9 g",
        "Protein > 12.4 g",
        "Sodium > 289 mg"
    ],
    "n": "Russian Kulich",
    "a": "Tatjanasok",
    "r": "0",
    "s": 8,
    "des": "\"A tall, sweet bread with sugar glaze on top is a traditional Easter treat in Russia.\"",
    "ins": "Stir together yeast, 1/4 teaspoon sugar, and warm milk in a large bowl and let stand until foamy, about 10 minutes. Stir in 1 1/2 cups flour and cover bowl tightly with plastic wrap. Let stand in a warm place until doubled, about 1 hour.\nBeat 4 yolks with remaining sugar in a bowl with an electric mixer at TK speed until mixture is thick and pale, 2 to 3 minutes. Beat in brandy and salt.\nStir yeast dough to deflate. Add yolk mixture and butter and stir until well blended. Beat 3 egg whites in a bowl with cleaned beaters until they hold soft peaks. Fold whites into batter, then stir in remaining 2 1/2 cups flour. Cover bowl and let rise in a warm place until doubled, about 1 hour 10 minutes.\nStir dough to deflate, then stir in almonds and raisins.\nButter 4 clean (10 1/2-ounce) coffee cans. Line bottom of each with a round of parchment or wax paper. Dust insides with flour, knocking out excess. Divide dough evenly among cans. Let dough rise in cans, covered with a towel, until about 1/2 inch from rim, about 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nWhisk together remaining yolk and water, and lightly brush over tops of dough. Bake loaves in cans until tops are golden brown, 35 to 40 minutes. Turn loaves out onto a rack, turn right side up, and let cool completely, about 1 1/2 hours.\nSift powdered sugar into a bowl, then stir in lemon juice. Spread glaze over tops of loaves, letting it drip down the sides. Let loaves stand until icing is set, about 15 minutes.",
    "pt": "50 m",
    "ct": "35 m",
    "tt": "4 h ",
    "i": "3544045.jpg",
    "o": "",
    "st": "allrecipes"
}