{
    "id": 245710,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon coconut oil",
        "1 onion, diced",
        "1 sweet potato, peeled and diced",
        "1 russet potato, peeled and diced",
        "1 parsnip, peeled and cubed",
        "1 carrot, peeled and diced",
        "1 small turnip, peeled and diced",
        "salt and ground black pepper to taste",
        "6 small bratwurst sausages, casings removed",
        "10 ounces deli pastrami, diced",
        "6 ounces cooked chorizo sausage, diced",
        "1/2 large head savoy cabbage, thinly sliced",
        "1 tablespoon freeze-dried chives",
        "1 bunch fresh parsley, minced",
        "1 teaspoon red pepper flakes",
        "1 bunch green onions, diced",
        "1/2 cup sour cream"
    ],
    "nut": [
        "Calories > 509 kcal",
        "Carbs > 30.5 g",
        "Cholesterol > 86 mg",
        "Fat > 32.9 g",
        "Protein > 24.2 g",
        "Sodium > 1333 mg"
    ],
    "n": "Sweet Potato and Pastrami Hash",
    "a": "rquill67",
    "r": "0",
    "s": 8,
    "des": "\"Hash is a perfect winter meal, great for those cold days in front of the fireplace. You won't need a side dish with this meal - it includes all of my favorite root veggies. Keep for up to 5 days in the fridge - if it lasts that long!\"",
    "ins": "Heat coconut oil in a large, deep nonstick skillet over medium heat. Add onion, sweet potato, potato, parsnip, carrot, and turnip. Season with salt and black pepper. Cook, covered, stirring occasionally, until vegetables start to soften, about 15 minutes.\nHeat a second nonstick skillet over medium-high heat. Add bratwurst sausage and cook, stirring occasionally, until browned, about 5 minutes. Add pastrami and chorizo and cook until heated through and flavors combine, about 10 minutes. Drain grease from the skillet.\nMix sausage mixture into the vegetables; season with salt and black pepper. Stir in sliced cabbage and chives; cook until cabbage starts to wilt, about 5 minutes. Add parsley and red pepper flakes; cook and stir until cabbage is soft and hash flavors are combined, about 5 minutes.\nStir green onions into hash. Top each serving with 1 tablespoon sour cream.",
    "pt": "50 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "3082189.jpg",
    "o": "",
    "st": "allrecipes"
}