{
    "id": 245762,
    "old_rating": "4.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 large baking potatoes",
        "1 tablespoon vegetable oil",
        "4 boneless, skinless chicken breasts, cut in bite-sized pieces",
        "1/2 cup butter",
        "salt and ground black pepper to taste",
        "3 cups shredded Cheddar cheese, divided",
        "1 1/2 cups Buffalo hot sauce (such as Texas PeteÂ®)"
    ],
    "nut": [
        "Calories > 575 kcal",
        "Carbs > 40.4 g",
        "Cholesterol > 117 mg",
        "Fat > 33.4 g",
        "Protein > 30 g",
        "Sodium > 1707 mg"
    ],
    "n": "Buffalo Chicken Twice-Baked Potatoes",
    "a": "Karencuts",
    "r": "0",
    "s": 8,
    "des": "\"This is a recipe I thought of on a cold Saturday night! I wanted baked potatoes and had a craving for Buffalo chicken too. I just combined the two. These are great! My whole family loves them! We really enjoy these reheated the next day too! Great for a game day party or any cold day! Serve topped with sour cream and extra Buffalo sauce.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Place potatoes on a baking sheet.\nBake in the preheated oven until tender when pierced with a fork, checking for doneness after 1 hour and then every 15 minutes, 1 1/2 to 2 hours total.\nHeat oil in a large skillet over medium heat. Add chicken; cook and stir until chicken is no longer pink in the center and the juices run clear, about 5 minutes.\nCut potatoes in half horizontally. Scoop out potato flesh into a large bowl. Add butter; mix until melted and well-combined. Season with salt and black pepper. Stir in chicken, 2 cups Cheddar cheese and buffalo sauce; mix well to combine. Spoon potato filling back into empty skins. Sprinkle remaining 1 cup Cheddar cheese on top.\nBake in the preheated oven until filling is hot and cheese is melted, about 20 minutes.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "3108465.jpg",
    "o": "",
    "st": "allrecipes"
}