{
    "id": 245714,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 red potatoes, thinly sliced, or more to taste",
        "4 strips bacon, or more to taste",
        "Sauce:",
        "1/2 cup heavy whipping cream",
        "2 tablespoons butter",
        "1 teaspoon minced garlic, or to taste",
        "3/4 cup grated Parmesan cheese",
        "Crust:",
        "1 cup warm water (125 degrees F, 52 degrees C)",
        "2 tablespoons honey",
        "1 tablespoon active dry yeast",
        "1 tablespoon vegetable oil",
        "2 cups all-purpose flour, or more as needed",
        "1 1/2 cups shredded mozzarella cheese, or more to taste"
    ],
    "nut": [
        "Calories > 163 kcal",
        "Carbs > 16.5 g",
        "Cholesterol > 22 mg",
        "Fat > 7.6 g",
        "Protein > 7.1 g",
        "Sodium > 190 mg"
    ],
    "n": "Potato Bacon Pizza",
    "a": "cookingmama",
    "r": "0",
    "s": 16,
    "des": "\"This is an Idaho favorite, and especially my family's. We make it every time we have company (and I always receive compliments!). This is a recipe I created after eating the same style of pizza at one of the college pizza shops here in town.\"",
    "ins": "Place potato slices in a deep skillet and cover with 1 inch of water. Bring to a boil; reduce heat and simmer until just tender, about 5 minutes. Drain; set aside to cool.\nPlace bacon slices in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels; set aside to cool.\nHeat cream, butter, and garlic together in a small saucepan over medium heat, stirring occasionally, until butter is melted, about 5 minutes. Add Parmesan cheese; stir until melted. Reduce heat to low and simmer sauce, uncovered, until thick, about 5 minutes.\nPreheat oven to 425 degrees F (220 degrees C). Grease 2 pizza pans.\nCombine warm water, honey, and yeast in a large bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes.\nStir oil into yeast mixture. Mix in flour, 1 cup at a time, until dough starts to come together. Turn out dough onto a well-floured surface. Knead, adding more flour as you work, until dough is no longer sticky. Divide dough into 2 pieces and roll out to the size of your pizza pans; transfer to greased pans.\nBake in the preheated oven until crusts are lightly golden, about 5 minutes. Remove from oven and spread sauce over both crusts. Cover sauce with potato slices. Crumble bacon slices over potatoes and cover with mozzarella cheese.\nBake pizzas in the preheated oven until crusts are golden brown and cheese is bubbly, about 10 minutes.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "3806117.jpg",
    "o": "",
    "st": "allrecipes"
}