{
    "id": 245711,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup white sugar",
        "3 large eggs",
        "1/2 cup unsalted butter, softened",
        "1/4 cup bourbon whiskey",
        "1 teaspoon vanilla extract",
        "3 cups all-purpose flour, plus more for dusting",
        "1 tablespoon baking powder",
        "1 cup coarsely chopped butterscotch chips",
        "3/4 cup coarsely chopped pecans",
        "1 egg, beaten (for egg wash)"
    ],
    "nut": [
        "Calories > 208 kcal",
        "Carbs > 25.5 g",
        "Cholesterol > 41 mg",
        "Fat > 9.5 g",
        "Protein > 3 g",
        "Sodium > 62 mg"
    ],
    "n": "Marietta's Butterscotch Bourbon Biscotti",
    "a": "Marietta Higgins-Spillone",
    "r": "0",
    "s": 24,
    "des": "\"These biscotti are not too sweet and easy to make. You do not have to use the bourbon but it does give it a little something extra. You can also drizzle melted butterscotch on them, but remember that will make them sweeter.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nWhisk sugar and 3 eggs together in a large bowl until light and fluffy. Mix in butter, bourbon, and vanilla extract.\nSift flour and baking powder together in a small bowl; add to egg mixture and stir until smooth dough forms. Fold in butterscotch chips and pecans.\nTurn dough out onto a lightly floured work surface; divide into 4 equal pieces. Roll each piece into 2-inch wide by 9-inch long log; place on baking sheet. Brush logs with beaten egg.\nBake in preheated oven until pale golden, about 25 minutes. Cool until firm, about 15 minutes.\nCut each log diagonally into 1-inch thick slices on a work surface; place slices, cut-side down, on baking sheet.\nBake in oven until tops are golden, about 10 minutes. Invert slices and bake until tops are golden, about 10 minutes more.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}