{
    "id": 245782,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package linguine pasta",
        "cooking spray",
        "1 teaspoon seasoned salt, or to taste",
        "3 skinless, boneless chicken breasts",
        "1/4 cup butter",
        "1 cup chopped fresh spinach",
        "1/4 cup chopped fresh basil",
        "3 sprigs fresh thyme, leaves removed",
        "1/2 cup grated Mizithra cheese",
        "1/4 cup pine nuts",
        "freshly ground black pepper to taste"
    ],
    "nut": [
        "Calories > 701 kcal",
        "Carbs > 100.9 g",
        "Cholesterol > 90 mg",
        "Fat > 23.1 g",
        "Protein > 37.2 g",
        "Sodium > 720 mg"
    ],
    "n": "Browned Butter and Mizithra Cheese Pasta with Chicken, Spinach and Herbs",
    "a": "wynter",
    "r": "0",
    "s": 4,
    "des": "\"It's so hard to find recipes with Mizithra cheese other than the typical browned butter, so here is a new twist on an old favorite! Great for summer evenings! I like to use a George ForemanÂ® grill to cook the chicken.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes; drain.\nSpray a grill pan lightly with cooking spray; heat over medium heat. Sprinkle seasoned salt on both sides of chicken and cook until no longer pink in the center and the juices run clear, about 5 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Let cool slightly.\nMelt butter in a small saucepan over medium heat; bring to a low simmer and cook until butter has a caramel fragrance and is almost done foaming, 5 to 10 minutes.\nCombine linguine, chicken, spinach, basil, and thyme in a large bowl. Pour browned butter on top. Toss well to combine. Add Mizithra cheese and pine nuts; toss again. Garnish with freshly ground black pepper.",
    "pt": "15 m",
    "ct": "26 m",
    "tt": "41 m",
    "i": "4144780.jpg",
    "o": "",
    "st": "allrecipes"
}