{
    "id": 245715,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "7 strips thick-cut bacon",
        "1 onion, chopped",
        "1 (8 ounce) package baby bella mushrooms, sliced",
        "3 tablespoons red wine",
        "8 bakery-style hamburger buns, split",
        "2 pounds ground beef",
        "1 tablespoon sea salt",
        "1 tablespoon garlic powder",
        "1 tablespoon ground black pepper",
        "8 slices pepper jack cheese"
    ],
    "nut": [
        "Calories > 528 kcal",
        "Carbs > 27.4 g",
        "Cholesterol > 107 mg",
        "Fat > 30.9 g",
        "Protein > 32.6 g",
        "Sodium > 1276 mg"
    ],
    "n": "Gourmet Bacon, Onion, and Mushroom Burgers",
    "a": "souchefdozer",
    "r": "0",
    "s": 8,
    "des": "\"This is an unforgettable burger topped with sauteed mushrooms, onions, pepper jack cheese, and bacon.\"",
    "ins": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon strips on paper towels, reserving 1 tablespoon of grease in the skillet. Chop bacon into large chunks.\nSaute onion and mushrooms over medium-high heat in the same skillet until golden brown, about 8 minutes. Add wine and reduce heat to medium, stirring frequently, until wine reduces by half, about 5 minutes. Remove onion mixture from heat.\nPreheat an outdoor grill for medium heat and lightly oil the grate. Place hamburger buns on grill until lightly toasted, 2 to 3 minutes.\nShape ground beef into 8 patties. Sprinkle salt, garlic powder, and ground black pepper over patties.\nCook patties on the preheated grill until browned on one side, about 6 minutes. Flip patties, top each with one slice of cheese and continue grilling until no longer pink in the center, about 6 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (71 degrees C).\nTransfer burgers to toasted buns. Place some of the onion mixture on top using a slotted spoon. Add chunks of bacon.",
    "pt": "20 m",
    "ct": "37 m",
    "tt": "57 m",
    "i": "4478668.jpg",
    "o": "",
    "st": "allrecipes"
}