{
    "id": 245764,
    "old_rating": "4.64198",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package elbow macaroni",
        "1 rotisserie-roasted chicken",
        "6 tablespoons butter",
        "6 tablespoons all-purpose flour",
        "3 cups milk",
        "1 pinch ground black pepper",
        "2 cups shredded Cheddar cheese",
        "2 cups shredded Monterey Jack cheese",
        "1/2 cup hot sauce (such as Frank'sÂ® RedhotÂ®), or more to taste",
        "1/2 cup crumbled gorgonzola cheese"
    ],
    "nut": [
        "Calories > 781 kcal",
        "Carbs > 51.7 g",
        "Cholesterol > 157 mg",
        "Fat > 41.9 g",
        "Protein > 47.3 g",
        "Sodium > 978 mg"
    ],
    "n": "Buffalo Chicken Mac and Cheese",
    "a": "Matt R",
    "r": "0",
    "s": 8,
    "des": "\"I saw my local ballpark was introducing Buffalo chicken mac and cheese and thought it was a great idea! This is what I whipped up. Serve with celery sticks and beer. Let me know what you think.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook macaroni in the boiling water, stirring occasionally until tender yet firm to the bite, 8 minutes. Drain.\nCut wings and legs off rotisserie chicken. Skin and bone wings and legs; chop or shred dark meat into bite-size pieces.\nMelt butter in a large Dutch oven over medium heat. Whisk in flour gradually until a thick paste forms. Cook until golden, about 1 minute. Pour in milk, whisking constantly, until thickened and bubbling, about 5 minutes. Continue to cook until sauce is smooth, about 1 minute more. Reduce heat and season sauce with black pepper.\nStir Cheddar and Monterey Jack cheese into the sauce until melted and combined. Stir in hot sauce, adjusting to reach desired level of spiciness. Add blue cheese, chicken, and macaroni; mix well to combine.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "3200291.jpg",
    "o": "4541214.jpg,4540851.jpg,4540100.jpg,4509220.jpg,4479224.jpg,4471941.jpg",
    "st": "allrecipes"
}