{
    "id": 245760,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Meatloaf:",
        "cooking spray",
        "1 (20 ounce) package ground turkey",
        "1 small onion, grated",
        "salt and ground black pepper to taste",
        "Buffalo Sauce:",
        "1/4 cup butter",
        "1/2 cup hot pepper sauce (such as Frank's RedHotÂ®)",
        "1 teaspoon garlic powder, or to taste",
        "1 teaspoon onion powder, or to taste",
        "Blue Cheese Dressing:",
        "1 cup sour cream",
        "1/2 cup mayonnaise",
        "1/2 cup blue cheese crumbles",
        "1/2 teaspoon garlic powder, or to taste",
        "1/2 teaspoon onion powder, or to taste",
        "1 pinch black pepper, or to taste"
    ],
    "nut": [
        "Calories > 707 kcal",
        "Carbs > 7.4 g",
        "Cholesterol > 183 mg",
        "Fat > 61.1 g",
        "Protein > 34.5 g",
        "Sodium > 1363 mg"
    ],
    "n": "Buffalo Turkey Meatloaf",
    "a": "MOBILITY61",
    "r": "0",
    "s": 4,
    "des": "\"Combining two favorite dishes to make one great meal, this baked meatloaf topped with homemade or your favorite bottled Buffalo wing sauce and served with an easy blue cheese dressing is sure to be a hit. Serve with home-fried potatoes or french fries and a salad!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x13-inch baking pan with aluminum foil; spray lightly with cooking spray.\nCombine ground turkey, grated onion, salt, and black pepper in a large bowl; mix to combine. Transfer turkey mixture to baking pan and shape into a loaf.\nBake meatloaf in the preheated oven until light golden, about 40 minutes.\nMelt butter in a small saucepan over low heat. Stir in hot pepper sauce, 1 teaspoon garlic powder, and 1 teaspoon onion powder. Pour evenly over meatloaf.\nReturn meatloaf to the oven and cook until flavors are absorbed, about 5 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nCombine sour cream, mayonnaise, and blue cheese crumbs in a bowl to make blue cheese dressing. Season with 1/2 teaspoon garlic powder, 1/2 teaspoon onion powder, and black pepper. Serve alongside meatloaf.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}