{
    "id": 245769,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package elbow macaroni",
        "1 (12 ounce) package soft silken tofu",
        "8 ounces shredded Swiss cheese",
        "1/2 cup Greek yogurt",
        "1 teaspoon Dijon mustard",
        "1 tablespoon olive oil",
        "8 ounces portobello mushrooms, stemmed and sliced",
        "1 cup frozen spinach, thawed",
        "1 green bell pepper, chopped",
        "1 onion, diced",
        "2 cloves garlic, minced",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 524 kcal",
        "Carbs > 66.2 g",
        "Cholesterol > 39 mg",
        "Fat > 17.3 g",
        "Protein > 25.9 g",
        "Sodium > 160 mg"
    ],
    "n": "Mushroom Spinach Mac and Cheese",
    "a": "Jamie",
    "r": "0",
    "s": 6,
    "des": "\"Tofu adds a creamy texture to this healthy spin on Macaroni and Cheese! Great for a side dish or as a meal by itself. Top with bread crumbs, crushed crackers, or cereal before baking if desired.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until tender yet firm to the bite, 8 minutes. Drain and transfer to a 9x13-inch casserole dish.\nPreheat oven to 350 degrees F (175 degrees C).\nBlend tofu in a food processor until smooth, about 2 minutes. Add Swiss cheese, Greek yogurt, and Dijon mustard; mix well to combine.\nHeat oil in a large skillet over medium-high heat. Add mushrooms, spinach, green bell pepper, onion, and garlic; saute until tender, about 5 minutes. Stir tofu mixture into the skillet. Cook until flavors combine, 2 to 3 minutes. Season with salt and ground black pepper.\nSpoon tofu and mushroom mixture over macaroni in the casserole dish; mix to combine. Cover with aluminum foil.\nBake in the preheated oven until bubbly and golden, about 30 minutes.",
    "pt": "25 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}