{
    "id": 245775,
    "old_rating": "4.72727",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 teaspoons olive oil",
        "1 pound guanciale (cured pork cheek), diced",
        "1 (16 ounce) package spaghetti",
        "3 eggs",
        "10 tablespoons grated pecorino Romano cheese, divided",
        "salt to taste",
        "ground black pepper to taste"
    ],
    "nut": [
        "Calories > 764 kcal",
        "Carbs > 85.3 g",
        "Cholesterol > 200 mg",
        "Fat > 28.4 g",
        "Protein > 39.1 g",
        "Sodium > 1182 mg"
    ],
    "n": "Spaghetti alla Carbonara: the Traditional Italian Recipe",
    "a": "ivan zeta",
    "r": "0",
    "s": 4,
    "des": "\"This dish was created in the Lazio region (the area around Rome) in the middle of the 20th century, after World War Two. \nWe don't use cream, milk, garlic, onions or other strange ingredients; we use only guanciale, eggs, pecorino cheese, and lots of black pepper (carbonaro is the Italian for coal miner). This isn't the Italian-American version, it's the real, creamy carbonara and it comes right from Italy, where I live. Buon appetito.\"",
    "ins": "Heat olive oil in a large skillet over medium heat; add guanciale (see Cook's Note). Cook, turning occasionally, until evenly browned and crispy, 5 to 10 minutes. Remove from heat and drain on paper towels.\nBring a large pot of salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until tender yet firm to the bite, about 9 minutes. Drain and return to the pot. Let cool, stirring occasionally, about 5 minutes.\nWhisk eggs, 5 tablespoons pecorino Romano cheese, and some black pepper in a bowl until smooth and creamy. Pour egg mixture over pasta, stirring quickly, until creamy and slightly cooled. Stir in guanciale. Top with remaining 5 tablespoons pecorino Romano cheese and more ground black pepper.",
    "pt": "10 m",
    "ct": "14 m",
    "tt": "29 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}