{
    "id": 245747,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 (17.5 ounce) package double chocolate-chunk cookie mix",
        "1/4 cup vegetable oil",
        "1 egg, at room temperature",
        "1 (21 ounce) can cherry pie filling, divided",
        "2 (8 ounce) packages cream cheese, softened",
        "1/2 cup white sugar",
        "1 (8 ounce) container frozen whipped topping (such as Cool WhipÂ®), thawed"
    ],
    "nut": [
        "Calories > 314 kcal",
        "Carbs > 32.8 g",
        "Cholesterol > 34 mg",
        "Fat > 18.9 g",
        "Protein > 3.3 g",
        "Sodium > 147 mg"
    ],
    "n": "Black Forest Cake Bars",
    "a": "TerryWilson",
    "r": "0",
    "s": 20,
    "des": "\"Yummy! Store covered in the refrigerator.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly spray bottom and sides of a 9x13-inch baking pan with cooking spray.\nStir cookie mix, oil, and egg together in a large bowl until a soft dough forms. Drop 3 heaping tablespoons of dough on an ungreased baking sheet 2 inches apart to make 3 cookies.\nBake cookies in the preheated oven until set, 12 to 13 minutes. Cool on the baking sheet, 2 minutes. Transfer to a wire rack to cool completely, about 15 minutes.\nPress remaining dough evenly into the bottom of the baking pan.\nMeasure 1 cup cherry pie filling into a small bowl and reserve for the topping; cover with plastic wrap and store in the refrigerator.\nBeat cream cheese, remaining cherry pie filling, and white sugar together in a large bowl with an electric mixer on medium speed until well-blended, about 2 minutes. Spread cream cheese mixture over dough.\nBake in the preheated oven until set, 35 to 40 minutes. Let cool, about 30 minutes. Refrigerate until chilled, about 1 hour.\nSpread whipped topping over cream cheese layer. Top with spoonfuls of the reserved pie filling. Crumble cookies into coarse crumbs and sprinkle on top. Chill until flavors blend, at least 1 hour. Cut into 20 bars.",
    "pt": "20 m",
    "ct": "47 m",
    "tt": "3 h ",
    "i": "3281745.jpg",
    "o": "",
    "st": "allrecipes"
}