{
    "id": 245798,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup Thai black sticky rice",
        "2 1/4 cups water",
        "1 tablespoon olive oil",
        "1 red onion, chopped",
        "2 cloves garlic, chopped",
        "1 (14 ounce) can kidney beans, drained",
        "1 teaspoon chile powder",
        "1 teaspoon ground paprika",
        "1 teaspoon ground turmeric",
        "2 tablespoons ketchup",
        "1/2 cup nutritional yeast",
        "1 cup bread crumbs",
        "3/4 cup vital wheat gluten"
    ],
    "nut": [
        "Calories > 281 kcal",
        "Carbs > 44.8 g",
        "Cholesterol > 0 mg",
        "Fat > 3.5 g",
        "Protein > 17.6 g",
        "Sodium > 257 mg"
    ],
    "n": "Kidney Bean and Black Thai Rice Burgers",
    "a": "Spiderwoman77",
    "r": "0",
    "s": 8,
    "des": "\"A meaty veggie burger that actually keeps its shape.\"",
    "ins": "Combine black rice and water in a large saucepan. Bring to a boil. Cover, reduce heat, and simmer until rice is tender, 45 to 50 minutes. Remove from heat. Let stand, covered, 10 minutes. Stir gently and measure out 3 cups; set aside.\nHeat oil in a large skillet over medium heat. Add onion; cook and stir until translucent, about 5 minutes. Add garlic; cook and stir until golden, about 1 minute. Remove from heat.\nPreheat oven to 375 degrees F (190 degrees C). Grease a baking sheet.\nMash kidney beans in a large bowl until smooth. Add 3 cups cooked black rice, onion and garlic mixture, chile powder, paprika, turmeric, ketchup, nutritional yeast, bread crumbs, and vital wheat gluten, stirring well after each addition with a spoon or your hands until mixture is the consistency of soft dough. Shape into 8 patties and arrange on baking sheet.\nBake patties in the preheated oven until browned, about 20 minutes. Flip patties and continue to cook until second side is browned, about 20 minutes more.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "3329748.jpg",
    "o": "",
    "st": "allrecipes"
}