{
    "id": 245844,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "Crumb Topping:",
        "1 cup gluten-free rolled oats",
        "1/2 cup ghee",
        "1 cup chopped walnuts",
        "2/3 cup coconut sugar",
        "1 tablespoon coconut flour",
        "2 teaspoons ground cinnamon, or more to taste",
        "1 pinch sea salt, or more to taste",
        "Cake:",
        "3 cups gluten-free all-purpose baking flour",
        "1 cup almond flour",
        "1 cup coconut sugar",
        "2 tablespoons flax seed meal",
        "2 tablespoons ground cinnamon",
        "2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon xanthan gum",
        "1 teaspoon ground ginger",
        "1 teaspoon pumpkin pie spice",
        "1 teaspoon sea salt",
        "1/2 teaspoon ground cloves",
        "3 cups unsweetened applesauce",
        "1/2 cup olive oil",
        "4 eggs, or more if needed",
        "1/4 cup raw honey",
        "1 tablespoon bourbon vanilla extract"
    ],
    "nut": [
        "Calories > 295 kcal",
        "Carbs > 34.6 g",
        "Cholesterol > 42 mg",
        "Fat > 16.6 g",
        "Protein > 5.4 g",
        "Sodium > 201 mg"
    ],
    "n": "Gluten-Free Applesauce Crumbcake",
    "a": "gem bee",
    "r": "0",
    "s": 24,
    "des": "\"So sensational no one knows it is gluten-free, let alone pretty healthy. The richness of coconut sugar shines through into caramel caution! Too good to be true. The sweet crunchy topping is pure sin, to enjoy as do all my friends and family. This is a keeper. Delicious served warm with a non-dairy topping or more applesauce and a sprinkle of nutmeg.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a 10x15-inch baking dish with cooking spray.\nPlace oats in the bowl of a food processor; pulse until finely ground. Place ghee in a microwave-safe bowl; cook in the microwave until melted, 15 to 30 seconds. Add ground oats, walnuts, 2/3 cup coconut sugar, 1 tablespoon coconut flour, 2 teaspoons cinnamon, and pinch salt to melted ghee; toss until coarse crumb mixture forms.\nCombine gluten-free all-purpose flour, almond flour, 1 cup coconut sugar, flax seed meal, 2 tablespoons cinnamon, baking powder, baking soda, xanthan gum, ginger, pumpkin pie spice, 1 teaspoon sea salt, and cloves together in a large bowl.\nWhisk applesauce, olive oil, eggs, honey, and vanilla extract together in a separate bowl. Add to flour mixture; mix well until thick batter forms. Pour batter into prepared baking dish. Top evenly with crumb mixture, pressing gently into batter.\nBake in preheated oven until a knife inserted into the center comes out clean, about 45 minutes. Cool in the pans for 10 minutes before transferring to a wire rack.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}