{
    "id": 245861,
    "old_rating": "4.28571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 boneless, skinless chicken breasts",
        "2 tablespoons olive oil",
        "2 teaspoons mango lime seasoning blend",
        "1 large avocado - peeled, pitted, and diced",
        "2 tablespoons lime juice, or more to taste",
        "2 tablespoons hot salsa (optional)",
        "1 tablespoon chopped fresh cilantro, or more to taste",
        "1 tablespoon garlic powder",
        "salt and ground black pepper to taste",
        "1 head romaine lettuce, leaves separated"
    ],
    "nut": [
        "Calories > 264 kcal",
        "Carbs > 11.5 g",
        "Cholesterol > 34 mg",
        "Fat > 18.9 g",
        "Protein > 15.2 g",
        "Sodium > 381 mg"
    ],
    "n": "Avocado Chicken Lettuce Wraps",
    "a": "jenncooks4u",
    "r": "0",
    "s": 4,
    "des": "\"This is one of my favorite family recipes now. Quick, easy, and super yummy! We even did a night of making a large batch of the avocado chicken and then divided it up into 4 separate bowls and added a different flavor or ingredient to each bowl and then had a buffet-style dinner. So fun and kid-friendly!\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C).\nCoat chicken breasts with olive oil and sprinkle mango and lime seasoning on both sides. Place in a shallow baking dish and cover with aluminum foil.\nBake chicken in the preheated oven until no longer pink in the center and an instant-read thermometer inserted into the center reads at least 165 degrees F (74 degrees C), 40 to 45 minutes. Remove from oven and cool until easily handled, about 10 minutes.\nChop chicken into small pieces and place in a large bowl. Add avocado, lime juice, salsa, cilantro, garlic powder, salt, and black pepper; mix well to combine. Serve on top of lettuce leaves to make wraps.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "3112695.jpg",
    "o": "",
    "st": "allrecipes"
}