{
    "id": 245889,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound pork tenderloin, cut into thin strips",
        "1/2 pound prawns, peeled and deveined",
        "1/4 pound rice vermicelli noodles",
        "1 (12 ounce) package rice wrappers (such as Blue DragonÂ®)",
        "1 bunch fresh cilantro, leaves picked from stems",
        "5 spring onions, cut in half",
        "1/4 cup fresh mint leaves, or more to taste",
        "1/4 head romaine lettuce, cut into bite-size pieces"
    ],
    "nut": [
        "Calories > 328 kcal",
        "Carbs > 56.6 g",
        "Cholesterol > 74 mg",
        "Fat > 2 g",
        "Protein > 19.6 g",
        "Sodium > 88 mg"
    ],
    "n": "Goi Cuon (Vietnamese Spring Roll with Pork and Prawns)",
    "a": "vietlove",
    "r": "0",
    "s": 6,
    "des": "\"This classic snack is known by many names, spring roll, salad roll, fresh roll, Vietnamese roll. Whatever you want to call it, it's delicious, healthy, and one of my favorite things to eat. Serve with nuoc cham (Vietnamese dipping sauce) or hoisin dipping sauce.\"",
    "ins": "Heat a skillet over medium heat; cook and stir pork in the hot skillet until cooked through, 5 to 7 minutes.\nBring a pot of water to a boil; add prawns and cook until meat is pink. Drain water and slice prawns in half lengthwise.\nFill a large pot with lightly salted water and bring to a rolling boil; stir in vermicelli and return to a boil. Cook until vermicelli is tender yet firm to the bite, 2 to 4 minutes. Drain.\nFill a large shallow bowl with warm water.\nDip a rice wrapper into the warm water until softened, 3 to 5 seconds. Place rice wrapper on a work surface. Let the rice paper soften for about 30 seconds. Arrange pork, a prawn half, vermicelli noodles, cilantro, spring onions, mint leaves, and romaine lettuce on the bottom third of the wrapper; roll it up halfway, tuck in the sides, and finish rolling the rest of the way. Repeat with the remaining ingredients.",
    "pt": "45 m",
    "ct": "10 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}