{
    "id": 245824,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Curry Paste:",
        "8 shallots, roughly chopped",
        "6 hot chile peppers, roughly chopped",
        "8 stalks lemongrass, smashed and cut into 1-inch pieces",
        "1/2 cup chopped almonds, or to taste",
        "1 small bunch fresh cilantro, roughly chopped",
        "8 cloves garlic, roughly chopped",
        "1 (1 inch) piece ginger, peeled and roughly chopped",
        "2 tablespoons peanut oil",
        "Chicken Curry:",
        "3 pounds boneless, skinless chicken thighs, cut into 1-inch pieces",
        "1 tablespoon peanut oil, or more as needed",
        "1 onion, cut into 1-inch chunks",
        "1 red bell pepper, cut into 1-inch chunks",
        "1 yellow bell pepper, cut into 1-inch chunks",
        "1 orange bell pepper, cut into 1-inch chunks",
        "1 cup halved snow peas",
        "1 large carrot, cut into matchsticks",
        "2 (14 ounce) cans coconut milk",
        "1 teaspoon white sugar",
        "1 teaspoon salt"
    ],
    "nut": [
        "Calories > 617 kcal",
        "Carbs > 29.2 g",
        "Cholesterol > 103 mg",
        "Fat > 42 g",
        "Protein > 36 g",
        "Sodium > 410 mg"
    ],
    "n": "Malaysian Chicken Curry",
    "a": "christinereichard",
    "r": "0",
    "s": 8,
    "des": "\"This spicy and delicious recipe is absolutely incredible. It is so tasty but not recommended for youngsters. I recommend this recipe to impress visitors or your family. Serve with JasmatiÂ® rice topped with cilantro.\"",
    "ins": "Combine shallots, chile peppers, lemongrass, almonds, cilantro, garlic, ginger, and 2 tablespoons peanut oil in a food processor; pulse into a smooth paste. Measure out 1 cup of paste into a large bowl. Add chicken thighs and mix until thoroughly coated.\nHeat 1 tablespoon peanut oil in a large, deep skillet over medium heat. Pan-fry chicken in batches until cooked through and no longer pink in the center, about 5 minutes. Transfer to a large plate using a slotted spoon; set aside.\nPlace onion, red bell pepper, yellow bell pepper, orange bell pepper, and carrot in the same skillet. Cook and stir until softened, about 5 minutes. Add snow peas; cook and stir until slightly softened but still crisp, about 1 minute.\nReturn chicken to the skillet. Stir in coconut milk, sugar, and salt. Simmer until flavors combine, 10 to 15 minutes.",
    "pt": "1 h",
    "ct": "26 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}