{
    "id": 245808,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Poppy Seed Paste:",
        "2 1/2 cups white poppy seeds",
        "2 1/2 cups black poppy seeds",
        "1 1/2 cups coconut water",
        "2 tablespoons butter, softened, or to taste",
        "2 tablespoons honey, or to taste",
        "Dessert Hummus:",
        "2 1/2 cups macadamia nuts",
        "1/4 cup coconut water",
        "2 tablespoons lemon juice",
        "2 tablespoons orange juice",
        "1 1/2 tablespoons grated fresh ginger",
        "1 tablespoon lime juice",
        "1 tablespoon olive oil",
        "1 tablespoon raw sugar, or to taste",
        "1 sprig mint, leaves removed and stem discarded, or to taste",
        "2 teaspoons poppyseed oil",
        "1 teaspoon grated orange zest, or to taste",
        "1 pinch sea salt (optional)",
        "Spice Topping:",
        "2 tablespoons ground cinnamon",
        "2 tablespoons ground cloves",
        "2 pinches ground cardamom",
        "2 pinches ground nutmeg"
    ],
    "nut": [
        "Calories > 678 kcal",
        "Carbs > 29.8 g",
        "Cholesterol > 6 mg",
        "Fat > 60.5 g",
        "Protein > 15.3 g",
        "Sodium > 113 mg"
    ],
    "n": "Dessert Hummus",
    "a": "MyStyleRecipes",
    "r": "0",
    "s": 10,
    "des": "\"My style of cooking is totally out of the box. This recipe is the sweet culinary equivalent of regular hummus. I'm a perfectionist with fibromyalgia and did everything from scratch. If you don't have a blender you can use a mortar and pestle to make the poppy seed paste, which takes the place of tahini.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spread white and black poppy seeds on a rimmed baking sheet.\nBake in the preheated oven until lightly roasted and fragrant, 5 to 8 minutes.\nTransfer poppy seeds to a blender or mortar and pestle and grind into a fine flour. Add 1 1/2 cup coconut water and butter; blend until paste is creamy and has a pourable consistency. Add enough honey to make paste moderately sweet.\nPlace macadamia nuts, 1/4 cup coconut water, lemon juice, orange juice, ginger, lime juice, olive oil, sugar, mint, poppyseed oil, orange zest, and salt in a food processor or blender. Add 1 1/2 cup poppy seed paste; blend until hummus is smooth. Transfer hummus to a serving bowl.\nMix cinnamon, cloves, cardamom, and nutmeg together in a small bowl to make spice topping. Sprinkle over hummus.",
    "pt": "35 m",
    "ct": "5 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}