{
    "id": 245850,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 skinless, boneless chicken breast halves",
        "1 tablespoon olive oil",
        "1 tablespoon butter",
        "1/2 onion, diced",
        "1 rib celery, diced",
        "1 teaspoon Cajon seasoning, divided, or to taste",
        "3/4 cup shredded mozzarella cheese",
        "4 ounces sliced mushrooms",
        "1 egg, beaten",
        "2 tablespoons fine dry bread crumbs",
        "1 tablespoon chopped fresh parsley",
        "2 teaspoons grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 292 kcal",
        "Carbs > 7.5 g",
        "Cholesterol > 133 mg",
        "Fat > 14.2 g",
        "Protein > 32.5 g",
        "Sodium > 400 mg"
    ],
    "n": "Mozzarella and Herb-Stuffed Chicken Breast Sous-Vide Style",
    "a": "Jesse Cody",
    "r": "0",
    "s": 4,
    "des": "\"This is a recipe for moist and tender chicken breast stuffed with a mixture of cheeses and herbs. Serve with side dishes of your choice.\"",
    "ins": "Heat water in a sous-vide water bath to 141 degrees F (60.5 degrees C).\nPlace each chicken breast between 2 sheets of heavy plastic wrap on a work surface. Flatten chicken with smooth side of a meat mallet to 1/4-inch thickness.\nHeat olive oil and butter in a skillet over medium heat. Add onion, celery, and Cajon seasoning; cook and stir until onion is softened and translucent, about 5 minutes.\nPlace mozzarella cheese, mushrooms, egg, bread crumbs, parsley, and Parmesan cheese together with onion mixture in bowl of a food processor; blend into paste.\nSpread paste onto one side of chicken breasts; roll breasts and secure with toothpicks. Spread remaining paste and sprinkle Cajun seasoning onto rolled breasts; place in individual sealable plastic bags. Seal bags (on low pressure if using a vacuum sealer), removing as much air as possible. Cook chicken in the preheated water bath for 2 hours. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "4478805.jpg",
    "o": "",
    "st": "allrecipes"
}