{
    "id": 245898,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Mock Buttermilk:",
        "1/2 teaspoon lemon juice",
        "1/2 cup soy milk",
        "Scones:",
        "2 cups all-purpose flour",
        "5 tablespoons lemon juice, divided",
        "1 tablespoon white sugar",
        "2 1/2 teaspoons baking powder",
        "2 teaspoons dried dill",
        "3/4 teaspoon salt",
        "1/2 cup chilled unsalted butter, cut into pieces",
        "1 egg",
        "Topping:",
        "1 egg, beaten",
        "1/4 cup grated Parmesan cheese",
        "1 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 263 kcal",
        "Carbs > 28.1 g",
        "Cholesterol > 79 mg",
        "Fat > 14.1 g",
        "Protein > 6.5 g",
        "Sodium > 437 mg"
    ],
    "n": "Savory Lemon Dill Parmesan Scones",
    "a": "vadener",
    "r": "0",
    "s": 8,
    "des": "\"This is a savory, but not super-rich, scone recipe. I like the fact that I was able to whip these up with ingredients that I always have around the house. These are a nice addition to breakfast/brunch/lunch, as a side with dinner (poultry or fish would be a good companion), or for a snack. They're pretty good for entertaining if you want to make more than one batch at a time.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nStir 1/2 teaspoon lemon juice into soy milk in a small bowl to make mock buttermilk. Let sit until curdled, 5 to 10 minutes.\nMix flour, 3 tablespoons lemon juice, sugar, baking powder, dill, and salt together in a large bowl using a fork. Mix in butter with a pastry blender until dough starts to clump together.\nWhisk mock buttermilk, remaining 2 tablespoons lemon juice, and egg together in a bowl. Pour over dough and mix gently with a fork just until incorporated.\nDust work surface lightly with flour. Turn out dough and pat into an 8-inch disc. Fold in half and gently flatten back out into a disc. Repeat folding and flattening the dough 3 more times, to build fluffy layers in the dough.\nTransfer disc of dough to the baking sheet and brush with beaten egg. Cut into 8 wedges and pull wedges apart so they are not touching.\nBake in the preheated oven until lightly golden, about 10 minutes.\nRemove scones from oven. Combine Parmesan cheese and black pepper together in a small bowl; sprinkle on top of the scones.\nReturn to the oven and bake until golden brown and edges look dry, about 10 minutes more.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}