{
    "id": 245864,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Curry:",
        "1 (14 ounce) can coconut milk",
        "1/2 large avocado - peeled, pitted, and diced",
        "1/2 cup water, or as needed",
        "3 tablespoons seasoning sauce (such as Golden MountainÂ®)",
        "2 tablespoons green curry paste, or more to taste",
        "1/2 lime, juiced",
        "Stir Fry:",
        "2 cups green beans",
        "8 ounces tempeh, cubed",
        "1 carrot, cut into matchstick-size pieces",
        "1/2 large avocado - peeled, pitted, and diced",
        "1 zucchini, cubed",
        "1 cup basil leaves"
    ],
    "nut": [
        "Calories > 464 kcal",
        "Carbs > 24.3 g",
        "Cholesterol > 0 mg",
        "Fat > 42 g",
        "Protein > 19.4 g",
        "Sodium > 865 mg"
    ],
    "n": "Avocado Curry",
    "a": "Jsmaster",
    "r": "0",
    "s": 4,
    "des": "\"The first thing I do when I visit my favorite Thai restaurant is ponder the specials board. On my one of my recent visits, they had avocado curry. I had never thought of mixing a decadent coconut curry with a delicious avocado. After all, delicious fat plus more delicious fat is always a win. So I ordered it, made mental notes along the way and whipped up a batch the very next day. One tweaking batch later, and I've arrived at this. Serve over rice or noodles.\"",
    "ins": "Blend coconut milk, 1/2 avocado, 1/2 cup water, seasoning sauce, curry paste, and lime juice in a blender until smooth, adding more water if curry is too thick. Pour curry into a large saucepan and bring to a boil.\nStir green beans, tempeh, and carrot into curry; reduce heat to medium. Cover saucepan and cook until beans and carrots are soft, about 15 minutes. Remove cover and add remaining 1/2 avocado, zucchini, and basil; cook and stir until basil is wilted, about 2 minutes more.",
    "pt": "10 m",
    "ct": "17 m",
    "tt": "27 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}