{
    "id": 245903,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Pastry Shells:",
        "1 cup water",
        "1/2 cup unsalted butter",
        "2 tablespoons white sugar",
        "1/2 teaspoon salt",
        "1 cup all-purpose flour",
        "4 eggs",
        "Filling:",
        "10 1/2 ounces goat cheese",
        "1 tablespoon dried dill weed",
        "salt to taste"
    ],
    "nut": [
        "Calories > 171 kcal",
        "Carbs > 8.2 g",
        "Cholesterol > 76 mg",
        "Fat > 12.6 g",
        "Protein > 6.5 g",
        "Sodium > 197 mg"
    ],
    "n": "Savory Vegetarian Cream Puffs",
    "a": "Vegetarianrecipecenter.com",
    "r": "0",
    "s": 16,
    "des": "\"Savory not sweet. Cream puffs! It's what's for dinner.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet or baking stone with a silicone liner or parchment paper.\nPlace water, butter, sugar, and salt in a saucepan over medium-high heat. Cook, stirring occasionally, until mixture is melted and dissolved, about 5 minutes. Reduce heat to medium. Add flour all at once and cook, stirring vigorously, until a ball of dough forms and pulls away from the sides of the pan, 15 to 30 seconds.\nTransfer dough to the bowl of a stand mixer fitted with a paddle attachment. Let cool, about 5 minutes. Add eggs one at a time, beating on medium-low speed after each addition, until batter is smooth and shiny, about 5 minutes.\nTransfer batter to a pastry bag fitted with a large round tip. Pipe the batter into 2-inch mounds by squeezing close to the sheet and slowly pulling up.\nIncrease oven temperature to 450 degrees F (230 degrees C).\nBake in the preheated oven until puffy, about 10 minutes. Reduce oven temperature to 350 degrees F (175 degrees C) and continue baking until shells are crispy and set, 13 to 15 minutes more.\nPlace goat cheese, dill, and salt in a stand mixer fitted with a whisk attachment. Mix until filling is creamy and smooth, 2 to 3 minutes. Transfer to a pastry bag fitted with a small round tip. Pipe filling into the bottom of each shell until filled.",
    "pt": "20 m",
    "ct": "29 m",
    "tt": "54 m",
    "i": "3129479.jpg",
    "o": "",
    "st": "allrecipes"
}