{
    "id": 245951,
    "old_rating": "4.72727",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound bacon",
        "2 cups milk",
        "8 eggs",
        "1 teaspoon seasoned salt",
        "1 teaspoon ground black pepper",
        "2 cups shredded Cheddar cheese",
        "1 onion, chopped",
        "1 green bell pepper, chopped",
        "3 red potatoes, thinly sliced",
        "5 mushrooms, sliced"
    ],
    "nut": [
        "Calories > 276 kcal",
        "Carbs > 8.1 g",
        "Cholesterol > 193 mg",
        "Fat > 18.8 g",
        "Protein > 18.7 g",
        "Sodium > 655 mg"
    ],
    "n": "Bacon Breakfast Casserole (Gluten Free)",
    "a": "Naomi",
    "r": "0",
    "s": 10,
    "des": "\"This is a simple recipe, easy to make. Really nice when you have company over in the morning. Get it ready, pop it in the oven and you have time to socialize while it's cooking! I cut this recipe in half and place it in a pie plate and bake uncovered for 45 minutes for breakfast for a smaller family; it tastes very much like a crustless quiche and my husband loves it! That is how it is shown in the picture.\"",
    "ins": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels, reserving 1 tablespoon bacon grease. Crumble bacon into pieces.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch casserole dish with reserved bacon grease.\nPlace milk, eggs, seasoned salt, and black pepper in the bowl of a stand mixer fitted with a paddle attachment. Beat on medium speed until smooth and pale, about 5 minutes. Add bacon pieces, Cheddar cheese, onion, and green bell pepper; beat until combined, about 1 1/2 minutes more.\nLayer potato slices in the bottom of the casserole dish. Pour egg mixture over potatoes. Arrange sliced mushrooms on top. Cover casserole with aluminum foil.\nBake in the preheated oven, about 35 minutes. Remove aluminum foil and bake until eggs are set, about 30 minutes more.",
    "pt": "35 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "3185077.jpg",
    "o": "4532199.jpg,4508764.jpg,4498618.jpg,3405626.jpg,3348081.jpg,3348080.jpg",
    "st": "allrecipes"
}