{
    "id": 245942,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds coarsely ground pork (about 25% fat)",
        "2 teaspoons kosher salt",
        "1 teaspoon black pepper",
        "1 pinch cayenne pepper",
        "1 pinch dried sage",
        "1 teaspoon very finely sliced fresh sage leaves",
        "1/4 cup chopped pistachio nuts",
        "2 tablespoons diced dried apricots",
        "1/2 pound caul fat"
    ],
    "nut": [
        "Calories > 866 kcal",
        "Carbs > 5.3 g",
        "Cholesterol > 143 mg",
        "Fat > 78.4 g",
        "Protein > 33.7 g",
        "Sodium > 1087 mg"
    ],
    "n": "Crepinettes (Pork Sausage Patties) with Apricots and Pistachios",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Crepinettes are probably my favorite type of sausage, both to make and eat, and that's all thanks to caul fat--one of the culinary world's most interesting and useful ingredients. Unfortunately, it's also one of the most bizarre looking ingredients, and that does scare some people off. But these sausage patties are so moist and flavorful, I do hope you give them a try.\"",
    "ins": "Mix sausage, salt, pepper, cayenne pepper, dried sage, fresh sage, pistachios, and apricots together in a mixing bowl with a fork until just combined. Divide into 4 portions and shape into patties about 3/4 inch thick.\nCut caul fat into pieces about 2 or 3 inches larger than the crepinette patty. Wrap patty in the caul fat with ends tucked on the bottom. Patties need to be completely covered. If your caul fat pieces are small, you can overlap to completely cover each patty. Trim any excess caul fat, if desired. Place patties on a plate and cover with plastic wrap; refrigerate overnight.\nHeat 1 tablespoon oil in a skillet over medium heat. Place crepinettes smooth side down in pan. Let brown 3 or 4 minutes on each side. Blot some of the rendered fat with a wadded up paper towel. Pour in a splash of white wine; cover. Cook covered until interior of patties reaches a temperature of 145 degrees F (63 degrees C), or another 5 minutes. Uncover and turn crepinettes to coat with the pan brownings and to reduce some of the wine.",
    "pt": "20 m",
    "ct": "12 m",
    "tt": "8 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}