{
    "id": 245904,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup butter",
        "1 onion, chopped",
        "5 cloves garlic, minced",
        "1 pound thick-cut bacon",
        "2 pears - peeled, cored, and thinly sliced",
        "5 eggs",
        "5 egg yolks",
        "3 cups heavy whipping cream",
        "2 tablespoons ground black pepper",
        "1 tablespoon salt",
        "1 tablespoon Italian seasoning",
        "20 ounces cubed French bread",
        "1 pound crumbled Gorgonzola cheese"
    ],
    "nut": [
        "Calories > 659 kcal",
        "Carbs > 36.3 g",
        "Cholesterol > 309 mg",
        "Fat > 46.8 g",
        "Protein > 23.8 g",
        "Sodium > 1638 mg"
    ],
    "n": "Savory Pear, Gorgonzola, and Bacon Bread Pudding",
    "a": "TechBoyBen",
    "r": "0",
    "s": 12,
    "des": "\"This bread pudding isn't a typical dessert bread pudding. Instead it's a savory dish that makes a great side or a flavorful main dish. Use it anytime an adult macaroni and cheese would fit the meal, and you won't be disappointed.\n\n As a side note, this tastes even better as rewarmed leftovers than it does fresh out of the oven, so make enough to take for lunch tomorrow!\"",
    "ins": "Melt butter in a large skillet over medium-low heat. Add onion and garlic; cook, stirring occasionally, until golden brown, about 20 minutes.\nPlace bacon in another large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels, reserving grease in the skillet.\nCook pear slices in reserved bacon grease over medium-low heat until golden, 2 to 3 minutes per side. Drain pear slices on paper towels.\nBeat eggs and egg yolks in a large bowl until smooth. Add heavy cream, black pepper, salt, and Italian seasoning; mix until well-blended.\nPlace half the bread cubes in a 9x13-inch glass baking pan. Sprinkle half the Gorgonzola cheese on top. Pour onion mixture over cheese. Spread half the bacon and pears on top. Repeat layering remaining bread, Gorgonzola cheese, and pears, ending with bacon. Pour egg mixture slowly and evenly over layers. Press down with a spatula or a gloved hand to prevent bread from overflowing.\nPlace baking pan in the refrigerator until bread soaks up egg mixture, at least 1 hour and up to overnight.\nPreheat oven to 375 degrees F (190 degrees C).\nBake bread pudding in the preheated oven until top is golden brown, covering with aluminum foil if needed, 40 to 55 minutes. Remove from oven and let dish set before serving, about 15 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "3 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}