{
    "id": 245985,
    "old_rating": "3.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Meatballs:",
        "cooking spray",
        "1 teaspoon olive oil",
        "1/2 cup minced onion",
        "2 cloves garlic, minced",
        "1 pound lean ground turkey",
        "1/2 cup dry bread crumbs",
        "1 egg",
        "1 tablespoon Worcestershire sauce",
        "1 1/2 teaspoons dried parsley",
        "1 teaspoon ground allspice",
        "1/4 teaspoon ground nutmeg",
        "Sauce:",
        "1 (14.25 ounce) can low-sodium beef broth",
        "3 tablespoons all-purpose flour",
        "1 tablespoon Worcestershire sauce",
        "1 1/2 teaspoons dried parsley",
        "1/4 teaspoon ground black pepper",
        "salt to taste (optional)",
        "1/4 cup light sour cream"
    ],
    "nut": [
        "Calories > 327 kcal",
        "Carbs > 20 g",
        "Cholesterol > 136 mg",
        "Fat > 14.4 g",
        "Protein > 29.3 g",
        "Sodium > 342 mg"
    ],
    "n": "Turkey Swedish Meatballs",
    "a": "FoodieGeek",
    "r": "0",
    "s": 4,
    "des": "\"I came up with this recipe as a way to lighten up the original dish. Nobody in my family even realized they were eating turkey! Serve over egg noodles if desired.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish lightly with cooking spray.\nHeat olive oil in a small skillet over medium heat. Add onion and garlic; cook and stir until softened, about 5 minutes. Let cool briefly, about 5 minutes.\nCombine onion mixture, turkey, bread crumbs, egg, 1 tablespoon Worcestershire sauce, 1 1/2 teaspoon parsley, allspice, and nutmeg in a large bowl; mix well to combine. Form mixture into 1-inch meatballs. Transfer to baking dish.\nBake in the preheated oven until meatballs are cooked through, 25 to 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nPour beef broth into a jar with a tight-fitting lid. Add flour; seal and shake vigorously until flour is dissolved.\nPour beef broth mixture into a large skillet over medium-high heat. Add 1 tablespoon Worcestershire sauce, 1 1/2 teaspoon parsley, black pepper, and salt. Bring to a boil, stirring frequently. Reduce heat to medium and simmer, stirring occasionally, until thickened, 2 to 3 minutes. Reduce heat to medium-low; stir in sour cream and meatballs. Cover and simmer, stirring occasionally, until flavors combine, 10 to 15 minutes.",
    "pt": "25 m",
    "ct": "47 m",
    "tt": "1 h ",
    "i": "3211570.jpg",
    "o": "",
    "st": "allrecipes"
}