{
    "id": 245953,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (.25 ounce) packages active dry yeast",
        "2 teaspoons white sugar",
        "1 3/4 cups warm water (110 degrees F (43 degrees C)), divided",
        "3 1/2 cups all-purpose flour",
        "1 1/2 cups bread flour",
        "1 tablespoon vital wheat gluten (optional)",
        "2 1/2 teaspoons kosher salt",
        "1/4 cup onion juice",
        "Filling:",
        "1 tablespoon vegetable oil",
        "1/2 cup minced onion",
        "1 1/2 teaspoons poppy seeds",
        "1/2 teaspoon kosher salt",
        "2 tablespoons cornmeal, or as needed"
    ],
    "nut": [
        "Calories > 168 kcal",
        "Carbs > 32.8 g",
        "Cholesterol > 0 mg",
        "Fat > 1.5 g",
        "Protein > 5.2 g",
        "Sodium > 362 mg"
    ],
    "n": "Ana's NY Bialys",
    "a": "Gomer",
    "r": "0",
    "s": 16,
    "des": "\"Growing up in NYC, my family adored bagels and bialys. Once you have them in NYC, they just aren't the same anywhere else. While just about everyone knows what a bagel is, most have never heard of a bialy. I've always described them as a cross between an onion bagel and an English muffin. They aren't chewy like bagels but they have the nooks and crannies of an English muffin. My children, who dislike onions, love bialys even though the tops are loaded with them Â– go figure.\n\n How to eat a bialy? Toasted with butter or cream cheese. Toast and use for just about any sandwich or burger.\"",
    "ins": "Preheat oven to 200 degrees F (95 degrees C). Turn off and keep door closed to retain warmth.\nDissolve yeast and sugar in 1/2 cup warm water in a large bowl. Let stand until yeast softens and begins to form a creamy foam, 7 to 12 minutes.\nMix all-purpose flour, bread flour, vital wheat gluten, and 2 1/2 teaspoons salt in another bowl; add to yeast mixture. Combine remaining 1 1/4 cup warm water with onion juice; pour over flour and yeast mixture. Stir together until a dough forms.\nKnead dough on a floured work surface until soft and smooth, 8 to 10 minutes. Form dough into a ball and place it in a lightly-oiled glass or ceramic bowl, turning to oil all sides. Cover with a towel. Place dough in warm oven until it triples in bulk, about 1 1/2 hours.\nPunch dough down and turn it over. Cover with plastic wrap and let rise in the oven again until doubled in bulk, about 45 minutes more.\nPunch dough down again and transfer to a floured work surface. Divide into 2 equal cylinders. Slice each cylinder into 8 rounds. Lay them flat and let rest, covered with a towel, about 10 minutes.\nHeat oil in large skillet over medium-high heat. Add onion and cook, stirring often, until golden, about 5 minutes. Remove from heat; stir in poppy seeds and 1/2 teaspoon salt. Let filling cool to room temperature.\nFlatten the dough into rounds about 3 1/2-inches in diameter with a raised middle and thinner edge. Sprinkle cornmeal lightly over 2 baking sheets. Arrange dough rounds on baking sheets. Cover with plastic wrap and let rise until increased by half, about 30 minutes.\nCenter oven rack and preheat oven to 425 degrees F (220 degrees C).\nPress the bottom of a greased shot glass in the center of each round to make a deep indentation. Place 1 to 2 teaspoons of filling in each indentation. Cover with plastic wrap and let bialys rise until puffy but not doubled, about 15 minutes.\nBake bialys in the preheated oven until lightly browned, rotating the baking sheets so they brown evenly, about 15 minutes.",
    "pt": "35 m",
    "ct": "20 m",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}