{
    "id": 246009,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (11 ounce) package refrigerated French bread dough (such as PillsburyÂ®)",
        "1/4 cup melted butter, divided",
        "1 tablespoon cornmeal",
        "1 cup shredded mozzarella cheese",
        "1 cup shredded Mexican cheese blend",
        "1 cup shredded Cheddar cheese",
        "1 tablespoon freshly grated Parmesan cheese",
        "1 tablespoon shredded Cheddar cheese",
        "1 pinch dried parsley",
        "1 pinch garlic powder",
        "1 pinch onion powder"
    ],
    "nut": [
        "Calories > 420 kcal",
        "Carbs > 25.7 g",
        "Cholesterol > 76 mg",
        "Fat > 26.5 g",
        "Protein > 19.4 g",
        "Sodium > 810 mg"
    ],
    "n": "Easy, Breezy, Cheesy Stuffed Bread (Domino'sÂ® Copycat Recipe)",
    "a": "Shannon Stone",
    "r": "0",
    "s": 6,
    "des": "\"This cheesy stuffed bread is crispy on top, chewy inside and very cheesy, but beware... it's very dangerous. You can get addicted! I fell in love with this particular side from Domino'sÂ® and have been searching for a comparable recipe. After some trial and error I figured out one that is pretty darn close and won't cost me $12 for food, delivery fee, and tip when the craving is overwhelming late at night and my toddler is fast asleep. Serve with marinara sauce.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a large baking sheet.\nRoll dough out into a large rectangle on a flat work surface. Brush with 3 tablespoons melted butter and sprinkle with cornmeal. Flip dough over and scatter mozzarella cheese, Mexican cheese blend, and 1 cup Cheddar cheese on top. Fold the dough in half and press edges together with your fingers to seal.\nBrush remaining 1 tablespoon butter over dough and lightly sprinkle with Parmesan cheese, 1 tablespoon Cheddar cheese, dried parsley, garlic powder, and onion powder. Make shallow cuts 1 inch apart across the top with a knife, so that you can easily pull the bread apart after baking.\nBake in the preheated oven until bread is golden brown and cheese is bubbly about 25 minutes. Cool 5 minutes before pulling strips apart.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "3233880.jpg",
    "o": "",
    "st": "allrecipes"
}