{
    "id": 246047,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Cream Sauce:",
        "1 tablespoon butter",
        "3 tablespoons all-purpose flour",
        "2 cups milk",
        "3 1/2 ounces processed cheese food, grated",
        "3/8 cup heavy whipping cream",
        "1/4 teaspoon salt",
        "1/4 teaspoon Italian seasoning",
        "Vegetable Base:",
        "1 small head cauliflower, stalk removed",
        "2 tablespoons butter",
        "1/2 cup minced onion",
        "2 cups diced potato",
        "1/2 cup chopped carrot",
        "1/2 cup diced red bell pepper",
        "1/2 cup green peas",
        "1/2 cup chopped green beans",
        "1 tablespoon crushed black peppercorns, divided",
        "salt to taste",
        "2 tablespoons bread crumbs (optional)",
        "3 1/2 ounces grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 371 kcal",
        "Carbs > 28.3 g",
        "Cholesterol > 67 mg",
        "Fat > 22.1 g",
        "Protein > 16.6 g",
        "Sodium > 658 mg"
    ],
    "n": "Baked Cauliflower Volcano (Vegetables Au Gratin)",
    "a": "Rashmi",
    "r": "0",
    "s": 6,
    "des": "\"This is one of my favorite recipes. It earned me the 1st Prize and my first prize when I was still in my teens. This dish is most comforting to me. Serve hot with dinner rolls and pasta, or enjoy it with anything - rice, naan, tortillas, etc.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nMelt 1 tablespoon butter in a saucepan over medium heat. Whisk in flour and cook, stirring, until lightly browned, 1 to 2 minutes. Slowly pour in milk, stirring constantly to avoid lumps. Simmer until sauce is thickened, 2 to 3 minutes. Remove from heat. Stir in processed cheese, heavy cream, 1/4 teaspoon salt, and Italian seasoning.\nPrick whole cauliflower in several places with a fork. Bring a large pot of lightly salted water to a boil. Add cauliflower and cook, uncovered, until slightly tender, about 3 minutes. Drain.\nMelt 2 tablespoons butter in a large skillet over medium-low heat. Add onion; cook and stir until translucent, about 5 minutes. Add potato, carrot, red bell peppers, peas, and green beans. Season with salt. Increase heat to high and cook, stirring frequently, until vegetables start to release their moisture, 5 to 10 minutes. Stir in 1 teaspoon crushed black peppercorns.\nTransfer vegetables to prepared baking dish. Place whole cauliflower in the center. Pour some sauce over cauliflower; fold remaining sauce in with vegetables. Sprinkle bread crumbs on top. Scatter Parmesan cheese on top. Sprinkle remaining 2 teaspoons peppercorns over cheese.\nBake in the preheated oven until golden brown on top, about 20 minutes.",
    "pt": "35 m",
    "ct": "41 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}