{
    "id": 246052,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons butter",
        "2 heads cauliflower",
        "2 heads broccoli",
        "1/2 cup butter",
        "1/2 cup all-purpose flour",
        "4 cups milk",
        "1 tablespoon mustard powder",
        "1 tablespoon Worcestershire sauce",
        "1/2 teaspoon ground black pepper",
        "2 cups grated Cheddar cheese",
        "1 cup Italian seasoned bread crumbs",
        "1/4 cup extra-virgin olive oil",
        "1 pinch paprika, or to taste"
    ],
    "nut": [
        "Calories > 527 kcal",
        "Carbs > 35.5 g",
        "Cholesterol > 79 mg",
        "Fat > 35 g",
        "Protein > 20.9 g",
        "Sodium > 657 mg"
    ],
    "n": "Broccoli and Cauliflower Gratin",
    "a": "foodfanatic",
    "r": "0",
    "s": 8,
    "des": "\"This is a great way to dress up broccoli and cauliflower with cheese. You can even make your vegetables the night before and then finish in the oven the next day. Tastes great the first day and as leftovers too!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease a baking dish with 2 teaspoons butter.\nCore and cut cauliflower into large florets. Cut broccoli into large florets; peel and quarter broccoli stalks.\nBring a large stockpot of water to a boil; add cauliflower and boil until tender but still firm, 8 to 10 minutes. Transfer cauliflower to strainer using a slotted spoon; run under cold water to stop cooking. Add broccoli stalks to stockpot and boil 3 minutes; add broccoli florets to stockpot and boil until stalks and florets are tender but still firm, about 5 minutes more. Transfer broccoli to strainer and run under cold water to stop cooking. Dry cauliflower and broccoli with paper towels and place in prepared baking dish.\nMelt 1/2 cup butter in saucepan over medium heat. Whisk in flour to form a thick paste. Continue whisking constantly until flour begins to brown, about 4 minutes. Add milk and bring to a boil, whisking constantly, until sauce thickens, 2 to 4 minutes more. Remove sauce from heat; whisk in mustard, Worcestershire sauce, and pepper. Whisk in Cheddar cheese until melted and fully incorporated. Pour cheese sauce over cauliflower and broccoli. Rap baking dish on counter a few times to remove air bubbles.\nMix bread crumbs and olive oil together in a small bowl. Top vegetable and sauce mixture with bread crumb mixture. Sprinkle paprika over bread crumb mixture.\nBake in preheated oven until bubbly and golden brown, about 30 minutes.",
    "pt": "30 m",
    "ct": "52 m",
    "tt": "1 h ",
    "i": "3238996.jpg",
    "o": "",
    "st": "allrecipes"
}