{
    "id": 246054,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 heads cauliflower, cored and cut into florets",
        "2 tablespoons butter, or as needed",
        "1 tablespoon all-purpose flour",
        "1/2 cup chicken stock",
        "1/4 cup half-and-half",
        "1/4 cup shredded Parmesan cheese, divided",
        "1/4 cup shredded mozzarella cheese, divided",
        "1/4 cup snipped fresh chives",
        "1/2 teaspoon salt, or to taste",
        "1/4 teaspoon ground black pepper, or to taste",
        "1 pinch ground nutmeg (optional)",
        "1 pinch red pepper flakes (optional)"
    ],
    "nut": [
        "Calories > 195 kcal",
        "Carbs > 18.3 g",
        "Cholesterol > 30 mg",
        "Fat > 10.6 g",
        "Protein > 10.6 g",
        "Sodium > 559 mg"
    ],
    "n": "Creamy Cauliflower (Fauxtato) au Gratin",
    "a": "Katie",
    "r": "0",
    "s": 4,
    "des": "\"Perfect replacement to mashed potatoes when carb-cutting or just want a delicious alternative. Serve with main dishes that include gravy--roast chicken, pot roast, or turkey. Don't expect leftovers!\"",
    "ins": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower florets, cover, and steam until very tender, about 15 minutes. Transfer cauliflower to a plate.\nPreheat oven to 425 degrees F (220 degrees C). Butter a baking dish.\nMelt 2 tablespoons butter in a saucepan over low heat. Whisk in flour until paste forms, about 1 minute. Whisk in chicken stock and cook until thickened, about 1 minute more. Add steamed cauliflower; whip with hand mixer or immersion blender until smooth, 1 to 2 minutes. Remove from heat; stir in half-and-half, all but 1 tablespoon of the Parmesan cheese, all but 1 tablespoon of the mozzarella cheese, chives, salt, and pepper.\nPour cauliflower mixture into prepared baking dish. Top with remaining Parmesan cheese, remaining mozzarella cheese, nutmeg, and red pepper flakes.\nBake in preheated oven until golden brown, about 12 minutes.",
    "pt": "15 m",
    "ct": "22 m",
    "tt": "37 m",
    "i": "3565154.jpg",
    "o": "",
    "st": "allrecipes"
}