{
    "id": 246091,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup water",
        "1 cup short-grain sushi rice",
        "1 tablespoon rice vinegar",
        "1 all-beef hot dog",
        "1 sheet nori (dry seaweed)",
        "1 tablespoon diced red onion",
        "1/4 cup barbeque sauce, divided",
        "1/4 cup shredded Cheddar cheese, divided",
        "2 tablespoons French-fried onions"
    ],
    "nut": [
        "Calories > 629 kcal",
        "Carbs > 98.1 g",
        "Cholesterol > 27 mg",
        "Fat > 19 g",
        "Protein > 12.7 g",
        "Sodium > 819 mg"
    ],
    "n": "Barbeque Hot Dog Sushi Roll",
    "a": "STA12S",
    "r": "0",
    "s": 2,
    "des": "\"Weird name, great flavors. No fish were harmed during the creation of this recipe! Also, a quick warning - you must love barbeque and sushi to truly appreciate the fusion of this recipe.\"",
    "ins": "Bring 1 cup water and rice to a boil in a saucepan. Reduce heat to low, cover, and simmer until rice is tender, about 15 minutes. Remove from heat and let stand, covered, until water is absorbed, about 10 minutes. Stir vinegar into rice. Measure out 1/3 cup for sushi roll and refrigerate until cool, about 30 minutes.\nBring a small pot of water to a boil. Reduce heat; add hot dog. Simmer until heated through, about 5 minutes.\nLay a large piece of plastic wrap on a flat work surface. Place a cup of warm water nearby. Place nori 2 inches from the edge closest to you. With wet fingers, spread cold rice in an even layer over the nori. Place hot dog 1 inch from the bottom edge of rice and nori. Lay onion in a row beside the hot dog. Spread 2 tablespoons barbeque sauce on top of the hot dog. Sprinkle 2 tablespoons Cheddar cheese on top.\nGrab the edge of the plastic wrap closest to you and lift the nori gently. Fold over, enclosing the filling, and tightly roll the sushi into a thick cylinder by pulling on the plastic wrap. Remove plastic wrap. Dip your fingers in warm water and lightly pat the edge of the nori to seal shut.\nCut sushi roll into 6 equal slices with a sharp knife. Transfer slices to a serving dish. Top with remaining 2 tablespoons barbeque sauce and 2 tablespoons Cheddar cheese. Sprinkle with French-fried onions.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "3792001.jpg",
    "o": "",
    "st": "allrecipes"
}