{
    "id": 246075,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 whole nutmeg, smashed open",
        "4 whole cloves",
        "2 onions, coarsely chopped",
        "10 Thai chile peppers, stemmed and coarsely chopped, or to taste",
        "7 macadamia nuts",
        "4 cloves garlic, coarsely chopped",
        "1 (2 inch) piece ginger, peeled and thinly sliced across the grain",
        "1 (2 inch) piece galangal, peeled and sliced thinly across the grain",
        "1 (2 inch) piece turmeric root, peeled and sliced thinly across the grain",
        "1 tablespoon water, or as needed (optional)",
        "2 1/2 pounds beef rump, cut into bite-size pieces",
        "2 1/2 cups unsweetened light coconut milk",
        "4 stalks lemongrass - trimmed, flattened, and tied into knots",
        "1 (4 inch) cinnamon stick",
        "8 kaffir lime leaves",
        "4 cardamom pods",
        "1 whole star anise"
    ],
    "nut": [
        "Calories > 351 kcal",
        "Carbs > 18.7 g",
        "Cholesterol > 63 mg",
        "Fat > 18.5 g",
        "Protein > 27.7 g",
        "Sodium > 70 mg"
    ],
    "n": "Sumatran-Style Beef Rendang",
    "a": "Linda Watkins",
    "r": "0",
    "s": 8,
    "des": "\"Rendang is a spicy, time-consuming dish to prepare with a huge number of ingredients but it is well worth the effort. It is served with rice or bread and a vegetable dish and is an event in itself. It is a widely popular dish in Indonesia, Malaysia, Singapore, and the surrounding area. The next day it will be even better than the day it is made. You may have to look for some ingredients in a South East Asian or Indian store.\"",
    "ins": "Grind nutmeg and cloves into a fine powder in a blender, 2 to 3 minutes. Add onions, chile peppers, macadamia nuts, garlic, ginger, galangal, and turmeric; blend into a smooth paste, thinning slightly with water if needed.\nPlace beef in a 12-inch skillet or wok. Mix in paste and coat beef thoroughly. Add coconut milk, lemongrass knots, cinnamon, lime leaves, cardamom, and star anise to form a sauce.\nBring to a gentle boil over medium-high heat. Reduce heat to medium-low and simmer uncovered, stirring with a spatula every 15 minutes, until sauce has reduced and thickened, about 1 hour. Continue cooking, stirring frequently to prevent sticking and scorching, until sauce turns a dark caramel color and coats the beef, about 2 hours.\nRemove from heat, cover, and let stand, about 30 minutes. Discard lemongrass, cinnamon stick, lime leaves, cardamom, and star anise before serving.",
    "pt": "45 m",
    "ct": "3 h ",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}