{
    "id": 246096,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup canola oil",
        "3 cups quick-cooking oats",
        "3 cups rolled spelt flakes",
        "1 cup honey",
        "1/2 cup canola oil",
        "1/2 teaspoon salt",
        "1/4 cup water",
        "1 cup raisins",
        "1/2 cup chopped almonds",
        "1/2 cup flax seed meal",
        "1/2 cup hemp seed hearts",
        "1/4 cup hemp seeds",
        "1/4 cup sunflower seeds"
    ],
    "nut": [
        "Calories > 254 kcal",
        "Carbs > 32.2 g",
        "Cholesterol > 0 mg",
        "Fat > 13 g",
        "Protein > 5.6 g",
        "Sodium > 51 mg"
    ],
    "n": "Super Power Stovetop Granola",
    "a": "cafelola",
    "r": "0",
    "s": 24,
    "des": "\"A large batch of granola made on the stovetop with spelt flakes, quick oats, honey, hemp hearts, hemp seeds, ground flax seed, sunflower seeds, raisins, and almonds.\"",
    "ins": "Heat 1/4 cup canola oil in large skillet over medium-high heat; add oats and spelt flakes. Cook, stirring frequently, until toasted, 5 to 7 minutes. Transfer oats mixture to a bowl and remove skillet from heat.\nMix honey, 1/2 cup canola oil, and salt together in the skillet; return to heat. Gently pour water into honey mixture and stir; cook until mixture is bubbling, 2 to 3 minutes. Stir oats mixture into honey mixture and cook, stirring frequently, until heated through, about 5 minutes. Remove skillet from heat.\nPreheat oven to 350 degrees F (175 degrees C).\nMix raisins, almonds, flax meal, hemp hearts, hemp seeds, and sunflower seeds into oats mixture; spread onto a baking sheet.\nBake in the preheated oven for 5 minutes. Turn off heat and leave granola in the oven 5 minutes more. Remove baking sheet from oven and cool granola completely before transferring to an airtight container.",
    "pt": "15 m",
    "ct": "22 m",
    "tt": "57 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}