{
    "id": 246111,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups water",
        "1 cup red lentils",
        "2 cups peeled and cubed sweet potato",
        "1 head broccoli, broken into small florets",
        "1 tablespoon olive oil",
        "1/2 yellow onion, chopped",
        "5 ounces spinach",
        "3 ounces shredded Colby-Monterey Jack cheese",
        "5 cloves garlic, minced",
        "2 eggs",
        "1/3 cup all-purpose flour",
        "1 1/2 tablespoons vegetable seasoning (such as La GrilleÂ®)",
        "1 teaspoon ground black pepper",
        "1/2 cup oil for frying, divided"
    ],
    "nut": [
        "Calories > 493 kcal",
        "Carbs > 62.4 g",
        "Cholesterol > 113 mg",
        "Fat > 16.5 g",
        "Protein > 28.2 g",
        "Sodium > 564 mg"
    ],
    "n": "Sweet Potato and Lentil Patties",
    "a": "J9",
    "r": "0",
    "s": 4,
    "des": "\"Really tasty patties that are somewhat healthier.\"",
    "ins": "Combine 1 1/2 cup water and lentils in a small saucepan; bring to a boil. Reduce heat, cover, and simmer until lentils are soft, about 20 minutes. Drain any excess water.\nPlace sweet potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add broccoli, cover, and steam until soft, about 10 minutes. Drain.\nHeat 1 tablespoon olive oil in a skillet over medium heat. Add onion; cook and stir until translucent, about 5 minutes. Add spinach; cook and stir until wilted, about 5 minutes more. Pour off any excess cooking liquid from the skillet.\nCombine lentils, sweet potatoes, broccoli, onion and spinach mixture, Colby-Monterey Jack cheese, and garlic in a large bowl. Mix well to combine.\nWhisk eggs, flour, vegetable seasoning, and black pepper into a smooth paste in another bowl. Mix paste into sweet potato mixture. Shape into patties.\nHeat 2 tablespoons oil in a nonstick skillet over medium heat. Pan-fry patties, working in batches, until golden, about 3 minutes per side. Repeat with remaining oil and patties.",
    "pt": "40 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "4462550.jpg",
    "o": "",
    "st": "allrecipes"
}