{
    "id": 246109,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups all-purpose flour",
        "1 teaspoon salt",
        "3 tablespoons olive oil",
        "honey (optional)",
        "1 1/2 cups lukewarm water",
        "2 tablespoons canola oil, divided, or more as needed (optional)"
    ],
    "nut": [
        "Calories > 255 kcal",
        "Carbs > 41.6 g",
        "Cholesterol > 0 mg",
        "Fat > 7.3 g",
        "Protein > 5.2 g",
        "Sodium > 235 mg"
    ],
    "n": "Sabaayad (Somali Flatbread)",
    "a": "MyHalwad",
    "r": "0",
    "s": 10,
    "des": "\"Sabaayad is a Somali flatbread made from flour. It is golden brown, crispy and flaky on the outside and soft on the inside. You can eat it with almost anything: honey, cinnamon sugar and a cup of tea, stew, sauce or by itself. My husband and I love to eat it with honey while it is still hot. My kids love to cut them into small pieces, put them in a bowl, add little bit of sugar and shah (Somali tea), and eat them like that.\"",
    "ins": "Combine flour and salt in a large bowl. Stir in olive oil and honey. Mix in water gradually until dough comes together and is the consistency of pizza dough. Knead by hand until soft and very smooth, about 10 minutes.\nBrush top of dough with a little bit of canola oil. Cover with plastic wrap and set aside to rest, at least 30 minutes and up to 2 hours.\nDivide dough into 10 equal pieces. Roll out 1 piece into a circle on a lightly floured work surface. Brush the top of the dough evenly with canola oil. Fold sides in to meet in the center. Fold top and bottom edges to meet in the center to make a square shape. Repeat with remaining pieces.\nPreheat a large skillet over medium heat.\nRoll 1 square of dough into a circle again on a lightly floured work surface. Place in the skillet and cook until slightly puffed, 1 to 2 minutes. Drizzle a little bit of oil on top and flip; continue cooking until golden brown and crispy, 1 to 2 minutes more. Transfer to a plate and cover with a clean kitchen towel to keep sabaayad warm and soft. Repeat with remaining pieces.",
    "pt": "35 m",
    "ct": "2 m",
    "tt": "1 h ",
    "i": "4252337.jpg",
    "o": "",
    "st": "allrecipes"
}