{
    "id": 246182,
    "old_rating": "4.9",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 zucchini, cut into spirals using a spiral slicer",
        "1 teaspoon salt",
        "1 tablespoon Italian seasoning",
        "4 skinless, boneless chicken breast halves",
        "salt and ground black pepper to taste",
        "1 cup marinara sauce",
        "cooking spray",
        "4 slices mozzarella cheese",
        "1/4 cup freshly grated Parmesan cheese, or to taste"
    ],
    "nut": [
        "Calories > 277 kcal",
        "Carbs > 10 g",
        "Cholesterol > 88 mg",
        "Fat > 9.5 g",
        "Protein > 37.2 g",
        "Sodium > 1190 mg"
    ],
    "n": "Chicken Parmesan with Zucchini Pasta",
    "a": "Dale Tadlock",
    "r": "0",
    "s": 4,
    "des": "\"Using a spiralizer, zucchini is turned into a tasty stand-in for pasta in this non-breaded take on chicken Parmesan.\"",
    "ins": "Line a baking sheet with parchment paper.\nPlace zucchini spirals in a colander and sprinkle 1 teaspoon salt and Italian seasoning over zucchini; toss to coat. Set colander over a bowl to allow water from zucchini to drain.\nWrap chicken in plastic wrap and place on a work surface; pound into 1/4- to 1/2-inch thickness. Remove plastic wrap and season chicken with salt and pepper.\nHeat marinara sauce in a saucepan over low heat.\nCoat a nonstick skillet with cooking spray and place over medium-high heat. Cook chicken in the hot skillet until browned and no longer pink in the center, 4 to 5 minutes per side. Transfer chicken to the prepared baking sheet.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nPlace zucchini in the same nonstick skillet over medium-high heat; cook and stir until tender yet firm to the bite, 3 to 4 minutes.\nSpoon marinara sauce over each chicken breast and top with mozzarella cheese.\nBroil chicken in the preheated oven until cheese is melted, 1 to 2 minutes.\nTransfer zucchini to each serving plate and add chicken. Spoon warm marinara over each piece of chicken and top with Parmesan cheese.",
    "pt": "20 m",
    "ct": "12 m",
    "tt": "32 m",
    "i": "3319332.jpg",
    "o": "",
    "st": "allrecipes"
}