{
    "id": 246179,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup dried black chickpeas (garbanzo beans)",
        "1 1/2 teaspoons salt, divided",
        "1/2 teaspoon baking soda",
        "1 quart water",
        "1 onion, chopped",
        "1 clove garlic, chopped, or more to taste",
        "1 (1 inch) piece chopped fresh ginger",
        "3 tablespoons water",
        "3 tablespoons vegetable oil",
        "1/4 teaspoon cumin seeds",
        "2 pinches asafoetida powder",
        "4 potatoes, peeled and quartered",
        "1 teaspoon ground coriander",
        "1 teaspoon garam masala",
        "1/4 teaspoon ground turmeric",
        "1/4 teaspoon cayenne pepper",
        "2 cups water",
        "3 tablespoons tamarind paste, or more to taste"
    ],
    "nut": [
        "Calories > 320 kcal",
        "Carbs > 52.2 g",
        "Cholesterol > 0 mg",
        "Fat > 9.2 g",
        "Protein > 9.8 g",
        "Sodium > 714 mg"
    ],
    "n": "Black Chana with Potato",
    "a": "hgadhia",
    "r": "0",
    "s": 6,
    "des": "\"Classic Indian Kala Chana recipe. A bit tart, but very wholesome. Great source of protein for a vegans. Can be served with either chapati/roti or basmati rice.\"",
    "ins": "Sort and clean chickpeas and wash them under cold water; drain. Combine chickpeas, 1/2 teaspoon salt, and baking soda in a large bowl; add 1 quart water. Soak chickpeas for 24 hours; drain.\nCombine onion, garlic, and ginger in a blender; add 3 tablespoons water. Blend mixture at high speed until a smooth paste forms.\nHeat vegetable oil in a 4-quart pot over medium-high heat. Add cumin seeds and asafoetida; cook and stir until asafoetida expands and cumin seeds darken, about 1 minute. Stir onion paste into cumin mixture, taking great care to avoid splattering. Cook and stir mixture until well mixed and fragrant, about 5 minutes.\nStir chickpeas, potatoes, 1 teaspoon salt, coriander, garam masala, turmeric, and cayenne pepper into onion-cumin mixture; add 2 cups water. Bring liquid to a boil and cover pot; reduce heat and gently simmer for 1 hour. Stir tamarind paste into chickpea mixture; cook, stirring occasionally, for 10 minutes more.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 d ",
    "i": "3652766.jpg",
    "o": "",
    "st": "allrecipes"
}