{
    "id": 246145,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound beef oxtail, cut into pieces",
        "1 teaspoon seasoned salt, or to taste",
        "2 (14 ounce) cans beef broth, or as needed",
        "1/2 head cabbage, sliced",
        "4 Yukon Gold potatoes, thickly sliced",
        "4 Roma tomatoes, thickly sliced",
        "3 carrots, peeled and chopped",
        "1 large onion, sliced",
        "1 orange, juiced",
        "1/4 cup lime juice",
        "3 cloves garlic, crushed",
        "2 cubes tomato-flavored bouillon (such as KnorrÂ®)",
        "1 1/2 teaspoons ground cumin",
        "1/4 teaspoon red pepper flakes",
        "3 bay leaves, broken in half",
        "salt and ground black pepper to taste",
        "water to cover",
        "1/3 cup chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 119 kcal",
        "Carbs > 15.6 g",
        "Cholesterol > 21 mg",
        "Fat > 3 g",
        "Protein > 8.7 g",
        "Sodium > 372 mg"
    ],
    "n": "Oxtail Soup Melody",
    "a": "Sheri",
    "r": "0",
    "s": 12,
    "des": "\"If you like a great broth-based soup this is it. The juices from the oxtail make it different from any other meat soups. You can use different vegetables in it or the the ones in the recipe to your taste. Very easy to make if you have the time to spare. Perfect for a winter-time meal. \nServe with corn tortillas or bread.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nPlace oxtail in a baking dish and sprinkle seasoned salt over oxtail.\nRoast oxtail in a baking dish until well-browned, about 40 minutes. Remove from oven, reserving any drippings in baking dish.\nHeat beef broth, cabbage, potatoes, tomatoes, carrots, onion, orange juice, lime juice, garlic, bouillon, cumin, red pepper, bay leaves, salt, and black pepper together over medium heat in a large stockpot. Add oxtail and reserved drippings to soup; pour in water to fill stockpot halfway.\nSimmer soup, stirring occasionally, until vegetables are easily pierced with a fork, 30 to 40 minutes. Garnish with cilantro.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}