{
    "id": 246140,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "7 ounces 1/4-inch thick rice stick noodles",
        "2 tablespoons vegetable oil",
        "2 tablespoons raw peanuts, or more to taste",
        "6 Thai chile peppers, seeded and minced, or more to taste",
        "1 shallot, minced, or more to taste",
        "3 cloves garlic, minced, or more to taste",
        "1 pound boneless chicken, cut into 1/4-inch strips",
        "1/3 cup extra-firm tofu, cut into matchsticks",
        "2 1/2 tablespoons white sugar",
        "2 tablespoons tamarind paste",
        "1 1/2 tablespoons fish sauce",
        "1/2 teaspoon ground white pepper, or to taste",
        "1 egg",
        "1/4 pound large shrimp - peeled, deveined, and tails removed (optional)",
        "1 cup bean sprouts (optional)",
        "1 cup chopped fresh chives (optional)",
        "1 lime, juiced"
    ],
    "nut": [
        "Calories > 536 kcal",
        "Carbs > 66.4 g",
        "Cholesterol > 148 mg",
        "Fat > 14.5 g",
        "Protein > 36 g",
        "Sodium > 626 mg"
    ],
    "n": "Pad Thai Noodles",
    "a": "Bud W",
    "r": "0",
    "s": 4,
    "des": "\"This popular Thai noodle dish has a delicate balance of spicy, sweet, salty, and sour flavors. This recipe is based on a traditional Bangkok-style version of the dish. It is not swimming in sauce like many Western versions found in restaurants. The dish is full of flavor with a light coating of delicious sauce in every bite. Serve with lime wedges, fish sauce, sugar, white pepper or pepper flakes, and vinegar on the table so guests can individually adjust tastes.\"",
    "ins": "Place noodles in a large bowl and cover with hot water. Set aside until noodles are flexible but still firm, about 10 minutes. Drain.\nHeat a wok or large skillet over medium-high heat until it starts to smoke. Add oil; heat until it shimmers. Add peanuts; cook and stir until roasted, 1 to 2 minutes. Remove from wok.\nStir chile peppers, shallot, and garlic into the oil; cook and stir until garlic just begins to brown, about 30 seconds. Add chicken and tofu; cook until no longer pink in the center and the juices run clear, 4 to 5 minutes. Add noodles, stirring quickly to mix in and prevent them from sticking. Add sugar, tamarind paste, fish sauce, and white pepper together; cook, stirring constantly, until sauce thickens, about 2 minutes.\nPush noodle mixture to one side of the wok; crack egg into the empty space. Stir until scrambled, 1 to 2 minutes; fold into noodles. Stir in shrimp; cook until opaque, 2 to 3 minutes. Add roasted peanuts, bean sprouts, chives, and lime juice; cook and stir until flavors combine, 1 to 2 minutes more.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "55 m",
    "i": "4388004.jpg",
    "o": "",
    "st": "allrecipes"
}