{
    "id": 246296,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon vegetable oil, or as needed",
        "2 hanger steaks",
        "2 tablespoons minced shallot",
        "1/4 cup dry white wine",
        "1/4 cup beef broth",
        "2 anchovy fillets, chopped, or more to taste",
        "3 tablespoons butter",
        "1 tablespoon minced fresh parsley",
        "1 tablespoon minced fresh chervil",
        "1 teaspoon minced fresh thyme"
    ],
    "nut": [
        "Calories > 370 kcal",
        "Carbs > 1.5 g",
        "Cholesterol > 96 mg",
        "Fat > 26.4 g",
        "Protein > 27.8 g",
        "Sodium > 255 mg"
    ],
    "n": "Parisian-Style Steak Frites",
    "a": "gremlinhill",
    "r": "0",
    "s": 4,
    "des": "\"When we lived in Geneva, there was a famous restaurant that only served one thing: entrecote. Also known as steak-frites, it's thin-sliced hanger steak cooked to order, covered in the most addictive herb butter sauce I've ever had. People literally line up out the door every night to get in--and this is why. \n\nAfter playing with several bloggers' guesses about the sauce ingredients, including some that involved chicken livers, this combination came pretty darn close to our memory of the experience. Serve with shoestring fries.\"",
    "ins": "Heat vegetable oil in a heavy skillet over medium-high heat. Cook steaks to desired doneness, about 5 minutes per side for medium; an instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Transfer steaks to a plate to rest.\nPlace shallots in the skillet and cook until beginning to soften, about 2 minutes. Pour wine into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add broth and anchovy; cook until thickened to sauce consistency, 2 to 3 minutes. Remove skillet from heat; whisk butter in gradually. Stir parsley, chervil, and thyme into the sauce. Puree sauce in the skillet with an immersion blender until smooth.\nCut steaks into thin slices across the grain; spoon sauce over slices.",
    "pt": "20 m",
    "ct": "14 m",
    "tt": "34 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}