{
    "id": 246228,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (12 ounce) 1 1/2-inch thick rib eye steak, thawed",
        "1/4 cup unsalted butter, melted",
        "2 tablespoons steak sauce (such as A1Â®)",
        "1 tablespoon grated garlic",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 441 kcal",
        "Carbs > 3.8 g",
        "Cholesterol > 122 mg",
        "Fat > 38.8 g",
        "Protein > 19.4 g",
        "Sodium > 353 mg"
    ],
    "n": "Reverse Sear Skillet-Grilled Steak Done Right!",
    "a": "vinnx",
    "r": "0",
    "s": 2,
    "des": "\"This a recipe and combination of cooking methods I've developed over a few years. This is the recipe I use to make the most flavorful, tender, and juicy piece of steak. \n\nJust make sure you get a nice thick cut with the best marbling you can find. No recipe in the world can fix a bad cut of beef... this just helps make that cut of beef be the best it can be.\"",
    "ins": "Place steak, butter, steak sauce, garlic, salt, and black pepper in a large resealable plastic bag; shake until marinade is well-mixed. Seal the plastic bag most of the way but keep one small corner open on one end.\nFill a deep baking pan with warm water. Submerge plastic bag in the water slowly, allowing the pressure of the water to push all the air out and mold the bag around the steak. Seal the bag completely and let sit in the water, about 2 hours.\nPreheat oven to 235 degrees F (112 degrees C).\nPour water out of the baking pan. Line pan with aluminum foil. Remove steak from the bag and place it on the pan. Pour marinade around steak. Gather sides of the aluminum foil into a tight ball around the steak.\nBake in the preheated oven until an instant-read thermometer inserted into the center reads 130 degrees F (54 degrees C) for medium, about 20 minutes.\nRemove steak from oven. Uncover and season both sides generously with salt and black pepper. Allow steak to rest.\nPreheat an outdoor grill for high heat. Place a cast iron skillet on the grill and heat to 500 degrees F (260 degrees C).\nCook steak in the hot skillet until it forms a crust and an instant-read thermometer inserted into the center reads 140 degrees F (60 degrees C) for medium, about 1 minute per side.",
    "pt": "10 m",
    "ct": "22 m",
    "tt": "2 h ",
    "i": "4374287.jpg",
    "o": "",
    "st": "allrecipes"
}