{
    "id": 246289,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons salt, divided",
        "8 small Yukon Gold potatoes, cut in half",
        "2 cups cauliflower florets, or more to taste",
        "3 tablespoons water, or as needed",
        "2 tablespoons curry powder",
        "1 teaspoon ground coriander",
        "1/4 teaspoon cayenne pepper, or to taste",
        "1 pinch saffron (optional)",
        "2 tablespoons ghee (clarified butter)",
        "1 teaspoon whole cumin seeds",
        "1 small onion, diced",
        "1 lemon, juiced",
        "1 (15 ounce) can garbanzo beans, drained",
        "1 cup frozen peas (optional)",
        "1 cup unsweetened coconut milk",
        "3 tablespoons chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 230 kcal",
        "Carbs > 31.3 g",
        "Cholesterol > 8 mg",
        "Fat > 10.1 g",
        "Protein > 6.1 g",
        "Sodium > 726 mg"
    ],
    "n": "Vegetarian Potato and Cauliflower Curry",
    "a": "Jamie",
    "r": "0",
    "s": 8,
    "des": "\"I took my favorite parts of several different recipes to come up with this rich and flavorful vegetarian curry. I usually serve it with steamed rice, which can cook as the curry comes together. Sometimes I throw a few cardamom pods in when I steam the rice. It adds a great flavor. Don't forget to remove the pods before you serve the rice!\"",
    "ins": "Bring a large pot of water to a boil with 1 teaspoon salt. Add potatoes; boil until easily pierced with a fork, about 10 minutes. Transfer potatoes to a strainer using a slotted spoon; rinse with cold water. Add cauliflower to boiling water; cook until easily pierced with a fork, 3 to 5 minutes. Transfer cauliflower to strainer using slotted spoon; rinse with cold water. Reserve 1/2 cup cooking liquid.\nCombine 3 tablespoons water, curry powder, coriander, cayenne, and saffron in a small bowl until paste forms. Let curry paste stand until flavors blend, about 10 minutes.\nHeat ghee in a stockpot over medium heat. Add cumin seeds; cook and stir until seeds begin to pop. Add onion and remaining 1 teaspoon salt; cook and stir until onions begin to soften, about 3 minutes. Add curry paste; cook and stir until fragrant, about 2 minutes more. Add lemon juice, reserved cooking liquid, potatoes, cauliflower, and garbanzo beans; stir well to combine.\nStir green peas, coconut milk, and cilantro into potato-cauliflower mixture; simmer until vegetables are heated through and mixture has thickened slightly, about 10 minutes.",
    "pt": "15 m",
    "ct": "28 m",
    "tt": "53 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}