{
    "id": 246253,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Samosa Quesadillas:",
        "1/2 (10 ounce) package frozen peas",
        "5 red potatoes, scrubbed and cubed",
        "1/4 cup soy milk, or more as needed",
        "2 tablespoons thinly sliced green onion",
        "2 tablespoons curry powder",
        "1 tablespoon vegan margarine",
        "2 teaspoons ground turmeric",
        "1 1/2 teaspoons ground cumin",
        "1 teaspoon salt",
        "1/2 teaspoon garlic powder",
        "1/8 teaspoon ground coriander",
        "freshly ground black pepper to taste",
        "1/4 cup chopped fresh cilantro",
        "8 (10 inch) flour tortillas",
        "Curried Cabbage and Chickpeas:",
        "1 tablespoon olive oil",
        "1 small head cabbage, outer leaves discarded - quartered, cored, and thinly sliced",
        "1 (15 ounce) can chickpeas, drained and rinsed",
        "2 teaspoons dehydrated onion flakes",
        "2 teaspoons curry powder, or more to taste",
        "1 teaspoon bottled minced ginger",
        "1 teaspoon ground turmeric",
        "1 teaspoon salt",
        "1/2 teaspoon garlic powder",
        "1/8 teaspoon garam masala",
        "1/8 teaspoon ground coriander"
    ],
    "nut": [
        "Calories > 361 kcal",
        "Carbs > 58.9 g",
        "Cholesterol > 0 mg",
        "Fat > 9.7 g",
        "Protein > 10.9 g",
        "Sodium > 1190 mg"
    ],
    "n": "Mal's Samosa Quesadillas with Curried Cabbage and Chickpeas",
    "a": "Malina Bleeding Heart Morris",
    "r": "0",
    "s": 8,
    "des": "\"This may sound like a lot of ingredients, but I usually have these spices on hand. The main ingredients make this a cheap dish. Who wants to make samosas by hand when you can make these? Serve hot or warm with your favorite chutney, if you like.\"",
    "ins": "Place peas in a small saucepan and pour in enough water to cover. Bring to a boil; reduce heat and cook until tender, 4 to 6 minutes. Drain.\nPlace cubed potatoes in a large pot and pour in enough water to cover. Bring to a boil and cook, stirring occasionally, until tender, about 10 minutes. Drain potatoes; return to the pot. Cook over medium-high heat until dry, 2 to 3 minutes. Remove from heat.\nMash potatoes with a potato masher or whisk until mostly smooth. Mix in soy milk, green onion, 2 tablespoons curry powder, vegan margarine, 2 teaspoons turmeric, cumin, 1 teaspoon salt, 1/2 teaspoon garlic powder, 1/8 teaspoon coriander, and black pepper. Stir in cilantro. Gently fold peas into filling mixture.\nPlace 1 tortilla on a flat work surface; spoon potato filling over one half. Fold over into a half-moon shape. Repeat with remaining tortillas and filling.\nHeat a nonstick skillet over medium-high heat. Toast quesadillas one at a time until golden brown, 2 to 3 minutes per side.\nHeat a large, deep skillet over medium-high heat. Add olive oil and turn the skillet to coat. Add cabbage, chickpeas, and onion flakes; cook, stirring occasionally, until cabbage starts to wilt, about 4 minutes.\nStir 2 teaspoons curry powder, ginger, 1 teaspoon turmeric, 1 teaspoon salt, 1/2 teaspoon garlic powder, garam masala, and 1/8 teaspoon coriander into the cabbage mixture. Reduce heat to medium and continue cooking, stirring occasionally, until chickpeas are cooked through, about 5 minutes more. Serve alongside quesadillas.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}