{
    "id": 246277,
    "old_rating": "4.07692",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 cup whole milk, room temperature, divided",
        "2 teaspoons vanilla",
        "6 large eggs, separated, room temperature",
        "1 1/4 cups sugar",
        "1 (14 ounce) can sweetened condensed milk",
        "1 (5 ounce) can evaporated milk",
        "1 1/2 cups heavy cream"
    ],
    "nut": [
        "Calories > 261 kcal",
        "Carbs > 33.2 g",
        "Cholesterol > 100 mg",
        "Fat > 12 g",
        "Protein > 5.9 g",
        "Sodium > 164 mg"
    ],
    "n": "Tres Leches Cake",
    "a": "RuthE",
    "r": "0",
    "s": 18,
    "des": "\"The English have their trifle, Italians have tiramisu, and Latinos have pastel de tres leches, or three milk cake. This scrumptious sponge cake absorbs its bath of sweetened condensed, evaporated and whole milk before being topped with whipped cream. Served with fresh fruit or as is, it's the perfect party dessert.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking pan.\nMix together flour, baking powder, and salt in a bowl. Stir together 1/2 cup milk with 1 teaspoon vanilla in a glass measuring cup.\nBeat egg whites with an electric mixer on medium-high speed until soft peaks form. With mixer running, add 1 cup sugar, 1 tablespoon at a time, and beat until whites are very stiff but still glossy, about 8 minutes. With mixer on low, add yolks, 1 egg at a time, beating until combined. Add flour mixture, 2 tablespoons at a time, alternating with milk mixture just until batter is smooth (be careful not to beat so much it deflates).\nPour batter into prepared pan and bake in middle of oven until a toothpick inserted into center comes out clean, 27 to 30 minutes.\nCool cake 30 minutes in pan on a rack (it will shrink), then invert onto rack to cool completely. When cooled, return cake to baking pan. Poke holes all over cake with fork.\nStir together condensed milk, evaporated milk, and remaining 1/2 cup whole milk, and pour over cake. When cake absorbs milk mixture, 5 to 10 minutes, cover pan with plastic wrap and chill at least 2 hours or up to 8 hours.\nWhip heavy cream with remaining 1/4 cup sugar and remaining teaspoon vanilla with electric mixer on medium speed until stiff, then spread evenly over cake. Serve as is or top with fresh fruit.",
    "pt": "30 m",
    "ct": "27 m",
    "tt": "4 h",
    "i": "3464470.jpg",
    "o": "",
    "st": "allrecipes"
}