{
    "id": 246317,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "1/2 pound seashell pasta",
        "1 (10.75 ounce) can cream of onion soup",
        "1 slice shredded reduced-fat Cheddar cheese",
        "1 cup milk",
        "1/2 cup reduced-fat mayonnaise",
        "6 tablespoons butter, divided",
        "4 cups chopped fresh broccoli",
        "1 pound imitation crabmeat, cut into bite-sized pieces",
        "2 tomatoes, chopped",
        "1/2 cup fine dry bread crumbs",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 264 kcal",
        "Carbs > 30.2 g",
        "Cholesterol > 33 mg",
        "Fat > 12.2 g",
        "Protein > 9.7 g",
        "Sodium > 713 mg"
    ],
    "n": "Imitation Crab Casserole",
    "a": "Katherine Duweck",
    "r": "0",
    "s": 12,
    "des": "\"This is a terrific, tasty casserole for family brunches or for you! We had this for several Easter brunches when I was a kid and I loved it! When I started cooking I asked my mom for the recipe and as an adult it tastes just as good to me now as it did then! My fiance is not fond of pasta, but likes this!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nFill a large pot with lightly salted water and bring to a rolling boil. Stir in pasta and return to a boil. Cook pasta uncovered, stirring occasionally, until tender yet firm to the bite, 9 to 11 minutes. Drain.\nCombine cream of onion soup, Cheddar cheese, milk, and mayonnaise in a large bowl.\nHeat 1/4 cup butter in a large skillet over medium heat. Add broccoli; cook and stir until just tender, 5 to 7 minutes.\nTransfer broccoli to onion soup mixture; stir in pasta, imitation crabmeat, and tomatoes. Spread mixture into prepared baking dish. Mix bread crumbs, Parmesan cheese, and remaining butter together in a small bowl; sprinkle over crabmeat mixture.\nBake in the preheated oven until brown and bubbly, 35 to 45 minutes.",
    "pt": "15 m",
    "ct": "54 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}