{
    "id": 246325,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 plum tomatoes, sliced",
        "1 cup olive oil, divided",
        "10 (6 inch) flour tortillas",
        "1 (8 ounce) jar basil pesto (such as ClassicoÂ® Traditional)",
        "1 (8 ounce) fresh mozzarella ball, sliced thinly",
        "1 bunch fresh basil leaves"
    ],
    "nut": [
        "Calories > 466 kcal",
        "Carbs > 17.1 g",
        "Cholesterol > 26 mg",
        "Fat > 39.7 g",
        "Protein > 11.2 g",
        "Sodium > 386 mg"
    ],
    "n": "Crispy Tomato Basil Pesto Flatbread Pizzas",
    "a": "Tricia L",
    "r": "0",
    "s": 10,
    "des": "\"Basil pesto, fresh mozzarella, roasted tomatoes and fresh basil leaves top a crispy flatbread for individual pizzas. Don't worry if you don't have time for the dough to rise to make the flatbread - this uses store-bought flour tortillas as an alternate base. Quick, easy and delicious!\"",
    "ins": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.\nSpread tomato slices out on baking sheet. Drizzle some olive oil over slices.\nBroil in the preheated oven until tender, about 6 minutes. Remove from oven and cool until easily handled, about 5 minutes. Peel skin off slices; discard.\nPreheat oven to 375 degrees F (190 degrees C). Line another baking sheet with aluminum foil.\nBrush both sides of each tortilla with olive oil and arrange on baking sheet.\nBake in the preheated oven until lightly browned and crispy, about 8 minutes. Remove from oven and let cool, about 5 minutes.\nSpread 2 to 3 tablespoons of pesto in a thin layer over each tortilla. Top with mozzarella cheese slices, 8 basil leaves, and some roasted tomato slices.\nBake in the preheated oven until mozzarella cheese is melted, 6 to 8 minutes. Cool slightly, about 2 minutes, before slicing with a pizza cutter.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "57 m",
    "i": "4539670.jpg",
    "o": "",
    "st": "allrecipes"
}