{
    "id": 246361,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 spaghetti squash",
        "2 tablespoons olive oil, divided",
        "1 1/2 pounds skinless, boneless chicken breast",
        "salt and ground black pepper to taste",
        "1 pinch dried oregano",
        "1 pinch garlic powder",
        "1 cup pesto",
        "1 cup ricotta cheese",
        "1 egg yolk",
        "1 tablespoon Italian seasoning",
        "1 cup marinara sauce",
        "1 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 412 kcal",
        "Carbs > 12.8 g",
        "Cholesterol > 103 mg",
        "Fat > 26.3 g",
        "Protein > 31.6 g",
        "Sodium > 559 mg"
    ],
    "n": "Pesto Chicken Spaghetti Squash Bake",
    "a": "Love Sweat Mangia!",
    "r": "0",
    "s": 8,
    "des": "\"A creative and healthy alternative to baked ziti or lasagna! Enjoy all the flavors of Italian night without the guilt.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace spaghetti squash on a microwave-safe plate and cut small slits in it with a knife. Cook in the microwave on high, about 5 minutes. Cut squash in half lengthwise and scoop out seeds. Place cut-side down on a microwave-safe plate and cook until slightly softened, about 5 minutes more.\nDrizzle 1 tablespoon olive oil over squash and place cut-side down on a baking sheet.\nBake in the preheated oven until easily pierced with a fork, about 20 minutes. Use a fork to scrape insides of squash into spaghetti strands. Spread evenly in a casserole dish.\nSeason chicken breasts with salt, black pepper, oregano, and garlic powder.\nHeat remaining 1 tablespoon olive oil in a large skillet over medium heat. Add chicken; cook until browned and an instant-read thermometer inserted into the center reads at least 165 degrees F (74 degrees C), about 6 minutes per side.\nCut cooked chicken into 1/2-inch cubes and toss with pesto in a bowl.\nCombine ricotta cheese, egg yolk, and Italian seasoning in a small bowl.\nLayer half the marinara sauce, ricotta mixture, and pesto chicken on top of squash in the casserole dish. Repeat layers once more. Sprinkle mozzarella cheese on top. Cover with aluminum foil.\nBake in the preheated oven until bubbly and cheese is melted, about 30 minutes. Remove aluminum foil and broil until golden brown, about 5 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}