{
    "id": 246351,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound boneless, skinless chicken breasts, cut into thin strips",
        "1 tablespoon Mexican-style seasoning blend (sodium free)",
        "2 tablespoons olive oil, divided",
        "1 medium onion, diced",
        "2 red and/or green bell peppers, chopped",
        "1 (32 ounce) carton low-sodium chicken broth, divided",
        "1 (5.6 ounce) package KnorrÂ® Fiesta Sidesâ„¢ - Spanish Rice",
        "4 cups low-sodium pinto beans and/or black beans, drained and rinsed",
        "Optional Toppings:",
        "Sour cream, shredded cheese, chopped cilantro, lime wedges, tortilla strips"
    ],
    "nut": [
        "Calories > 377 kcal",
        "Carbs > 35.3 g",
        "Cholesterol > 42 mg",
        "Fat > 7.2 g",
        "Protein > 27.7 g",
        "Sodium > 227 mg"
    ],
    "n": "Fajita Chili with Knorr Rice Sides",
    "a": "Lil' Luna",
    "r": "0",
    "s": 6,
    "des": "\"Our weeknights are always hectic, how about yours? I'm all about easy, balanced, one-pot meals like this fajita chili made with KnorrÂ®Â Rice Sidesâ„¢. You need just 8 ingredients and 30 minutes to whip up this bold & flavorful dish. Simple, right?!\"",
    "ins": "Season the chicken with Mexican blend. In a large saucepan or Dutch-oven set over medium-high heat, add 1 tablespoon of olive oil. When the oil is hot, add the chicken and stir occasionally, until the chicken is cooked, about 5 minutes. Add the bell pepper and onions, cook for 3 minutes. Remove and set aside.\nHeat the remaining 1 tablespoon of olive oil in same pan, add 2 cups of the chicken broth and bring to a boil. Add the Knorr(R) Fiesta Sides(TM) - Spanish Rice and prepare according to package directions (cover and simmer for 7 minutes).\nStir in the chicken/onion and pepper mix, along with the beans and remaining chicken broth. Bring to a low boil and simmer for 10 minutes. Serve, if desired, with sour cream, shredded cheese, chopped cilantro, lime wedges and tortilla strips.",
    "pt": "5 m",
    "ct": "25 m",
    "tt": "30 m",
    "i": "3281934.jpg",
    "o": "",
    "st": "allrecipes"
}