{
    "id": 246397,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "1/2 bell pepper, chopped",
        "6 mushrooms, sliced, or more to taste",
        "2 cloves garlic, minced, or more to taste",
        "1 tablespoon oregano, or more to taste",
        "1 tablespoon basil, or more to taste",
        "1 teaspoon paprika, or more to taste",
        "1 teaspoon ground black pepper, or more to taste",
        "salt to taste",
        "1 (16 ounce) can black beans, rinsed and drained",
        "1 cup uncooked rice",
        "4 skinless, boneless chicken breast halves",
        "1 (28 ounce) can crushed tomatoes",
        "2 cups water, divided, or as needed"
    ],
    "nut": [
        "Calories > 538 kcal",
        "Carbs > 72.7 g",
        "Cholesterol > 67 mg",
        "Fat > 10.9 g",
        "Protein > 38.3 g",
        "Sodium > 825 mg"
    ],
    "n": "Cary's Cast Iron Skillet Chicken Recipe",
    "a": "Cary",
    "r": "0",
    "s": 4,
    "des": "\"One-pot baked chicken with rice, beans, and veggies. Easy prep and cleanup!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat oil in a cast iron skillet over medium heat; stir in onion. Cook and stir until the onion is softened and lightly browned, about 8 minutes. Lower heat and add bell pepper, mushrooms, and garlic; cook and stir until soft, 3 to 5 minutes more.\nMix oregano, basil, paprika, black pepper, and salt together in a bowl. Stir 1/2 of the herb mixture into vegetable mixture. Stir black beans and rice into vegetable mixture. Arrange chicken breasts over beans and rice mixture, sprinkle remaining herb mixture on top. Pour in tomatoes and 1 cup water. Cover skillet with aluminum foil.\nBake until chicken is no longer pink in the center and the juices run clear, adding more water as needed to keep mixture moist, about 25 minutes. Remove aluminum foil and cook until rice is soft, adding more water as needed to keep mixture moist, 10 to 15 minutes more. Remove skillet from oven and set aside to cool slightly, 5 to 10 minutes.",
    "pt": "15 m",
    "ct": "46 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}