{
    "id": 246315,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "10 ounces sirloin steak tips",
        "10 ounces beef brisket, trimmed of fat, cut into small chunks",
        "1/4 cup mayonnaise",
        "1 shallot, minced",
        "1/4 cup wild game rub (see footnote)",
        "4 whole wheat hot dog buns",
        "4 slices white Cheddar cheese",
        "Salt and pepper to taste",
        "Condiments:",
        "Lettuce leaves",
        "Sliced tomatoes",
        "Chopped onion",
        "Relish"
    ],
    "nut": [
        "Calories > 580 kcal",
        "Carbs > 27.6 g",
        "Cholesterol > 130 mg",
        "Fat > 34.1 g",
        "Protein > 39.3 g",
        "Sodium > 2173 mg"
    ],
    "n": "Tim Love's Burger Dog",
    "a": "NASCARÂ®",
    "r": "0",
    "s": 4,
    "des": "\"This delicious recipe gives a delicious twist to two old favorites Â– a burger and a dog. On race day, give your hot dog bun something to brag about with this winning combination of sirloin, brisket, and white Cheddar.\"",
    "ins": "Preheat an outdoor grill for high heat and lightly oil the grate.\nCombine the sirloin and brisket in a food processor and pulse until ground.\nTransfer the meat into a large bowl. Add the mayonnaise, shallot, and wild game rub; gently mix.\nDivide the meat  into 4 equal portions; shape the \"burgers\" into hotdog shapes.\nPlace on preheated grill and close the lid. Cook for 4 minutes. Lift lid; flip burger dogs and close lid.\nLightly toast hot dog buns, then set aside.\nSear the burger dogs on all four sides for extra char flavor, about 2 1/2 minutes per side for medium, or until internal temperature reaches 140 degrees F. During the final minute of grilling, top each burger dog with a slice of cheese.\nTransfer burger dogs from the grill to a grill bun. Salt and pepper to taste; serve with your favorite condiments.",
    "pt": "20 m",
    "ct": "",
    "tt": "",
    "i": "3271592.jpg",
    "o": "",
    "st": "allrecipes"
}