{
    "id": 246369,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Scrambled Eggs:",
        "12 eggs",
        "salt and ground black pepper to taste",
        "2 tablespoons butter",
        "1 (12 count) package Hawaiian bread rolls (such as King'sÂ®)",
        "18 slices provolone cheese, or as needed",
        "12 slices deli ham, or as needed",
        "1/4 cup butter",
        "1 1/2 tablespoons brown sugar",
        "1 tablespoon prepared yellow mustard"
    ],
    "nut": [
        "Calories > 595 kcal",
        "Carbs > 46.1 g",
        "Cholesterol > 287 mg",
        "Fat > 24.5 g",
        "Protein > 35.9 g",
        "Sodium > 1087 mg"
    ],
    "n": "Game Day Breakfast Sliders",
    "a": "Robin Wells",
    "r": "0",
    "s": 12,
    "des": "\"A different twist on a breakfast egg and cheese biscuit! Great tailgate breakfast serving offered at a UVA tailgate by Krisanna Hudson. Gobbled up by the crowd!\"",
    "ins": "Whisk eggs, salt, and pepper together in a bowl until frothy. Melt 2 tablespoons butter in a large skillet over medium-low heat. Pour eggs into skillet; cook and stir with spatula until set, 3 to 6 minutes. Remove from heat.\nCut rolls in half horizontally; lay bottoms in a single layer in a 9x13-inch baking dish. Add a layer of provolone cheese, then scrambled eggs, then a layer of ham, then provolone cheese, then ham, then provolone cheese again. Cover with roll tops. Cut through ham and provolone cheese layers to make individual sandwiches.\nMelt 1/4 cup butter, brown sugar, and mustard together in a small saucepan over medium heat; cook and stir until sugar is dissolved. Spread mixture over roll tops. Cover baking dish with aluminum foil and let stand, about 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Remove aluminum foil from baking dish.\nBake in preheated oven until tops are golden brown and cheese has melted, 15 to 20 minutes.",
    "pt": "10 m",
    "ct": "18 m",
    "tt": "58 m",
    "i": "4463696.jpg",
    "o": "",
    "st": "allrecipes"
}