{
    "id": 246434,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 butternut squash - peeled, seeded, and cut into 1-inch pieces",
        "1 onion, coarsely chopped",
        "1/2 cup chopped carrots",
        "1 head garlic, cloves separated and peeled",
        "2 tablespoons coconut oil",
        "1 pinch Chinese five-spice powder",
        "salt to taste",
        "2 dashes soy sauce",
        "8 ounces tofu-based sour cream",
        "2 (12 ounce) packages wonton wrappers",
        "2 cups sesame oil, or as needed"
    ],
    "nut": [
        "Calories > 154 kcal",
        "Carbs > 23.7 g",
        "Cholesterol > 3 mg",
        "Fat > 5.1 g",
        "Protein > 3.6 g",
        "Sodium > 228 mg"
    ],
    "n": "Butternut Squash Wontons (Vegan Version of Crab Rangoon)",
    "a": "Jennifer Cheuvront",
    "r": "0",
    "s": 24,
    "des": "\"Chinese-inspired vegan wontons/rangoons. The butternut squash replaces the sweet savory flavor of the crab in traditional crab rangoons.\"",
    "ins": "Combine squash, onion, carrots, and garlic in a high-powered blender; pulse until vegetables are minced.\nTransfer vegetables to a skillet and add coconut oil, Chinese five-spice powder, salt, and soy sauce. Saute vegetable mixture over high heat until tender, 10 to 15 minutes. Spoon tofu-based sour cream into vegetable mixture and mash until filling is smooth. Remove skillet from heat and cool filling.\nSpoon about 1 teaspoon filling onto 1 half of each wonton wrapper. Wet the border of the wrapper and fold in half over the filling, sealing the edges together. Take 2 opposite corners, wet with water, and press together to seal.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nWorking in batches, fry wontons until golden brown, 5 to 10 minutes. Transfer cooked wontons to a paper towel-lined plate; cool slightly.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}