{
    "id": 246417,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (2 pound) beef chuck roast",
        "1 onion, cut into 8 pieces, layers separated",
        "2 large carrots, cut into 1-inch pieces",
        "2 ribs celery, cut into 1-inch pieces",
        "10 whole black peppercorns",
        "5 whole cloves",
        "1 clove garlic, crushed",
        "1 cinnamon stick",
        "1 sprig rosemary",
        "2 bay leaves",
        "1 (750 milliliter) bottle Barolo (dry Italian) red wine",
        "3 tablespoons olive oil, or more to taste",
        "1 teaspoon salt"
    ],
    "nut": [
        "Calories > 517 kcal",
        "Carbs > 14.1 g",
        "Cholesterol > 83 mg",
        "Fat > 28.8 g",
        "Protein > 22.5 g",
        "Sodium > 568 mg"
    ],
    "n": "Brasato al Barolo - Braised Chuck Roast in Red Wine",
    "a": "Buckwheat Queen",
    "r": "0",
    "s": 5,
    "des": "\"Chuck roast is marinated overnight then braised in hearty red wine for hours to render a flavorful and succulent meat. This is a traditional dish from Northern Italy typically served on Sundays. Serve with creamy polenta or mashed potatoes. Don't forget to buy two bottles of the wine so you can enjoy one with the meal!\"",
    "ins": "Place chuck roast, onion, carrots, celery, peppercorns, cloves, garlic, cinnamon stick, rosemary, and bay leaves together in a stockpot. Pour wine over meat and vegetable mixture to cover entirely. Cover stockpot and marinate for 6 hours in the refrigerator. Turn meat in marinade to make sure it is completely covered; return to refrigerator to finish marinating, about 6 hours more.\nTransfer chuck roast from marinade to a plate to rest; pat dry thoroughly with paper towels. Pour marinade through a strainer and into a bowl to separate vegetable mixture from wine, reserving both vegetable mixture and wine.\nHeat olive oil in the stockpot over medium-high heat. Brown chuck roast on all sides, 4 to 6 minutes per side. Reduce heat to medium. Add strained vegetable mixture to stockpot; cook with the chuck roast until fragrant, adding more oil as necessary to prevent burning, about 8 minutes.\nPour reserved wine back into stockpot; add salt. Reduce heat to medium-low, cover, and simmer without removing cover for 2 hours. Remove cover, stir, and cook until meat easily shreds with a fork, 10 minutes to 1 hour longer. Transfer meat from cooking liquid to serving platter; tent with foil to keep warm.\nReturn cooking liquid to a boil over medium-high heat; simmer until reduced to sauce consistency, 20 to 30  minutes. Discard cinnamon stick, rosemary, and bay leaves. Season with salt; puree mixture with a handheld immersion blender until smooth. Pour sauce over meat to serve.",
    "pt": "30 m",
    "ct": "2 h ",
    "tt": "15 h ",
    "i": "3469960.jpg",
    "o": "",
    "st": "allrecipes"
}