{
    "id": 246481,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds pork belly, cut into bite-size pieces",
        "1/4 cup vegetable oil",
        "3 tablespoons brown sugar",
        "1/4 cup dark soy sauce",
        "1/4 cup Shaoxing rice wine",
        "1/4 cup light soy sauce",
        "4 scallions, halved",
        "4 slices fresh ginger",
        "4 star anise pods",
        "water to cover",
        "1/2 (8 ounce) package vegetarian chicken substitute, diced (optional)",
        "6 hard-boiled eggs, peeled (optional)"
    ],
    "nut": [
        "Calories > 680 kcal",
        "Carbs > 16.2 g",
        "Cholesterol > 380 mg",
        "Fat > 48.8 g",
        "Protein > 38.3 g",
        "Sodium > 3036 mg"
    ],
    "n": "Slow-Cooked Red Braised Pork Belly",
    "a": "Ray Sheen",
    "r": "0",
    "s": 4,
    "des": "\"This is one of the most common Chinese household dishes. You almost never find this dish in restaurants because it takes a long time to cook and because it is gloriously fatty. Serve with steamed rice and your choice of vegetable.\"",
    "ins": "Fill a large pot with water and bring to a boil. Add pork belly; cook until starting to soften, about 5 minutes. Drain.\nHeat vegetable oil and brown sugar in a wok or large skillet over medium heat until sugar is melted. Add pork; cook until browned on all sides, about 2 minutes. Add dark soy sauce; cook and stir until flavors combine, about 5 minutes.\nTransfer pork mixture to a slow cooker. Add rice wine, light soy sauce, scallions, ginger, and star anise. Pour in enough water to just cover the pork.\nCook on Low until pork is tender, about 6 hours. Add diced chicken substitute, hard-boiled eggs, and more water to cover.\nCook on Low until eggs absorb cooking liquid, rotating halfway through, about 1 hour more.",
    "pt": "20 m",
    "ct": "7 h ",
    "tt": "7 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}