{
    "id": 246420,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon olive oil, divided",
        "1/2 Vidalia onion, thinly sliced",
        "1/2 cup diced baby bella mushrooms",
        "1 (1.41 ounce) package sazon seasoning with saffron (such as GoyaÂ® Azafran)",
        "1/2 cup ground beef",
        "2 tablespoons tomato puree",
        "1 large sweet potato, peeled",
        "1/2 cup crumbled feta cheese",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 508 kcal",
        "Carbs > 55.5 g",
        "Cholesterol > 75 mg",
        "Fat > 24 g",
        "Protein > 19 g",
        "Sodium > 3989 mg"
    ],
    "n": "Saffron Bolognese with Feta Cheese and Sweet Potato \"Noodles\"",
    "a": "LittleCreature",
    "r": "0",
    "s": 2,
    "des": "\"Saffron bolognese on top of feta cheese and super thin strips of sweet potato (aka noodles).\"",
    "ins": "Heat 2 teaspoons olive oil in a small saucepan over medium heat. Add onion; cook and stir until slightly translucent, about 3 minutes. Add mushrooms; cook until slightly tender, about 3 minutes. Stir in sazon seasoning. Reduce heat to low and and simmer until flavors combine, about 3 minutes.\nStir ground beef into the saucepan; cook over medium heat, stirring frequently, until crumbly and no longer pink, about 5 minutes. Add tomato puree; reduce heat, cover, and simmer sauce, about 10 minutes.\nSlice sweet potato into noodles using the thin julienne blade on a mandoline.\nFill a pot with water; add 1 teaspoon olive oil and a pinch of salt. Bring to a gentle boil. Add sweet potato noodles and cook, 1 to 2 minutes. Remove from water and drain.\nTransfer sweet potato noodles to serving plates. Sprinkle feta cheese on top. Cover with sauce. Season with salt and black pepper.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}