{
    "id": 246484,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "6 tablespoons mayonnaise",
        "18 slices white bread",
        "6 slices sharp Cheddar cheese",
        "2 cups shredded sharp Cheddar cheese, divided",
        "12 slices deli ham",
        "12 slices cooked bacon",
        "8 eggs",
        "1 cup milk",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 403 kcal",
        "Carbs > 21.9 g",
        "Cholesterol > 180 mg",
        "Fat > 24.9 g",
        "Protein > 23.2 g",
        "Sodium > 946 mg"
    ],
    "n": "Grilled Cheese Brunch Bake",
    "a": "themoodyfoodie",
    "r": "0",
    "s": 12,
    "des": "\"Grilled cheese + bacon + eggs!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch casserole dish with cooking spray.\nSpread an even layer of mayonnaise on one side of each slice of bread. Place 6 slices of bread mayonnaise-side down in a single layer at the bottom of the casserole dish.\nBake in the preheated oven until lightly toasted, about 5 minutes. Remove from oven and top each slice of bread with 1 slice of Cheddar cheese. Cover with 6 more slices of bread, mayonnaise-side up.\nBake in the preheated oven until bread is lightly toasted, about 5 minutes.\nSprinkle 1/4 of the shredded Cheddar cheese on top. Arrange slices of ham on top; cover with another 1/4 of the shredded Cheddar cheese. Repeat with bacon slices, covering with another 1/4 of the shredded Cheddar cheese. Arrange last 6 slices of bread, mayonnaise-side up, on top.\nWhisk eggs, milk, salt, and black pepper together in a large bowl. Pour evenly over bread in the casserole dish. Sprinkle remaining 1/4 cup shredded Cheddar cheese on top. Cover with aluminum foil.\nBake in the preheated oven until set, about 30 minutes.\nRemove aluminum foil and continue baking until cheese is bubbly and golden, 5 to 10 minutes more.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}