{
    "id": 246478,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/3 cups gluten-free baking mix (such as Arrowhead MillsÂ®)",
        "1 scoop vanilla protein powder (optional)",
        "1 1/4 teaspoons baking soda",
        "1 teaspoon cacao powder (optional)",
        "1/2 teaspoon coarse salt",
        "3 overripe bananas, mashed",
        "1/2 cup turbinado sugar (such as Sugar in the RawÂ®)",
        "6 tablespoons unsalted butter, melted",
        "1 1/2 egg",
        "3/4 cup semisweet chocolate chips",
        "1/2 cup sliced almonds"
    ],
    "nut": [
        "Calories > 257 kcal",
        "Carbs > 34.6 g",
        "Cholesterol > 40 mg",
        "Fat > 11.8 g",
        "Protein > 6.3 g",
        "Sodium > 341 mg"
    ],
    "n": "Banana Almond Chocolate Chip Muffins",
    "a": "SherriM",
    "r": "0",
    "s": 12,
    "des": "\"A great use for overripe bananas! These muffins take only minutes to put together but come out light and savory. If you're a fan of doing a little extra for your weekend breakfasts, this recipe will fill that need and satisfy some bellies.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a muffin tin with liners.\nMix gluten-free flour, protein powder, baking soda, cacao powder, and salt in a large bowl.\nPlace mashed bananas, turbinado sugar, melted butter, and egg in the bowl of an electric mixer fitted with a paddle attachment; beat on medium speed until well-blended and airy. Add flour mixture; mix until batter is evenly moistened. Stir in chocolate chips and sliced almonds.\nScoop the batter into the muffin tin, filling each liner 2/3 of the way full.\nBake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, 25 to 30 minutes. Let muffins cool on wire rack before serving, about 10 minutes.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "3341444.jpg",
    "o": "",
    "st": "allrecipes"
}