{
    "id": 246426,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Dough:",
        "1 cup red lentils",
        "2 teaspoons oil",
        "1 onion, quartered",
        "3 cloves garlic, peeled",
        "1/2 bunch fresh parsley",
        "1/2 bunch fresh cilantro",
        "1/4 cup chopped green onions",
        "1/3 cup oil",
        "1 egg",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon chile powder",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon ground coriander",
        "salt to taste",
        "Sauce:",
        "1 cup yogurt",
        "4 teaspoons lemon juice",
        "1 tablespoon tahini",
        "salt to taste",
        "Toppings:",
        "3/4 cup shredded Cheddar cheese",
        "1 tomato, cubed",
        "1/4 cup sliced olives",
        "1 tablespoon minced fresh parsley",
        "2 teaspoons minced green onion"
    ],
    "nut": [
        "Calories > 556 kcal",
        "Carbs > 41.9 g",
        "Cholesterol > 72 mg",
        "Fat > 33.4 g",
        "Protein > 24.6 g",
        "Sodium > 428 mg"
    ],
    "n": "Falafel Dough Pizza",
    "a": "Shemoo Seif",
    "r": "0",
    "s": 4,
    "des": "\"Falafel is one of the most popular foods in Egypt. It's made out of peeled beans and always served fried. It's also made in the Levant area (mainly Syria and Lebanon) using chickpeas. \nIn my recipe, I used red lentils and replaced the traditional cooking method (frying) with baking. Using lentils instead of beans to create an innovative recipe has been quite satisfying.\"",
    "ins": "Place red lentils in a bowl and cover with water. Let soak until softened, about 2 hours. Drain.\nPreheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper and grease with 2 teaspoons oil.\nPlace lentils in a food processor with onion, garlic, 1/2 bunch parsley, cilantro, and 1/4 cup green onions; pulse until finely ground.\nTransfer lentil mixture to a large bowl. Add 1/3 cup oil, egg, baking powder, black pepper, chile powder, cumin, coriander, and salt; mix until well-blended. Spread dough to 1/4-inch thickness onto prepared baking sheet.\nBake in the preheated oven until golden and firm, about 15 minutes. Remove from oven.\nCombine yogurt, lemon juice, tahini, and salt in a small bowl; mix well until sauce is smooth.\nLayer sauce, Cheddar cheese, tomato, olives, 1 tablespoon parsley, and 2 teaspoons green onion on top of baked dough.\nReturn to the oven and bake until cheese is melted, about 5 minutes.",
    "pt": "35 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}