{
    "id": 246497,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups sunflower seeds",
        "2 cups filberts (hazelnuts)",
        "8 cups rolled oats",
        "2 cups whole wheat flour",
        "1 1/2 tablespoons ground cinnamon",
        "1 1/2 teaspoons salt",
        "3/4 cup honey",
        "1/2 cup butter",
        "1/4 cup sorghum syrup",
        "1 tablespoon vanilla extract"
    ],
    "nut": [
        "Calories > 148 kcal",
        "Carbs > 17.7 g",
        "Cholesterol > 4 mg",
        "Fat > 7.6 g",
        "Protein > 3.8 g",
        "Sodium > 76 mg"
    ],
    "n": "Elaine's Special No-Sugar Granola",
    "a": "Lila Pattison",
    "r": "0",
    "s": 56,
    "des": "\"My mom created this recipe because she went on a no-sugar diet. It's amazingly yummy served warm with milk! It's my breakfast every morning. Use all the cinnamon. In the end, you will be glad you did.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Line 2 rimmed baking sheets with parchment paper.\nSpread sunflower seeds on 1 baking sheet. Spread hazelnuts on the another baking sheet.\nToast sunflower seeds and hazelnuts in the preheated oven until they start to turn golden brown and become fragrant, 10 to 15 minutes. Chop hazelnuts into smaller pieces.\nCombine sunflower seeds, hazelnuts, oats, flour, cinnamon, and salt in a large bowl.\nStir honey, butter, sorghum syrup, and vanilla extract together in a saucepan. Cook over medium heat until butter is melted and mixture is bubbling, 3 to 5 minutes. Pour over oat mixture and mix well to combine. Spread granola evenly on the baking sheets.\nBake 1 baking sheet at a time in the preheated oven until granola is golden, about 9 minutes. Remove from oven, stir, and continue baking, about 9 minutes more. Repeat with second baking sheet.",
    "pt": "20 m",
    "ct": "49 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}