{
    "id": 246553,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Dough:",
        "1 1/4 cups warm water",
        "1 teaspoon active dry yeast",
        "3 cups bread flour",
        "1 1/2 teaspoons fine salt",
        "1/4 cup olive oil, divided",
        "Sauce:",
        "1 (28 ounce) can plain crushed tomatoes",
        "1 (14 ounce) can pizza sauce (such as Don PeppinoÂ®)",
        "Cheese:",
        "8 ounces low-moisture whole-milk mozzarella, very thinly sliced",
        "1/4 cup grated Pecorino Romano cheese"
    ],
    "nut": [
        "Calories > 271 kcal",
        "Carbs > 33.4 g",
        "Cholesterol > 19 mg",
        "Fat > 10.6 g",
        "Protein > 10.7 g",
        "Sodium > 663 mg"
    ],
    "n": "Bakery-Style Pizza",
    "a": "CDM68",
    "r": "0",
    "s": 12,
    "des": "\"Now found exclusively at one well-known pizza garden in Gravesend, Brooklyn, this style of pizza was once found in neighborhood bakeries. This pizza is deceivingly light, crisp, and slightly spicy. Enjoy with a can of soda.\"",
    "ins": "Combine water and yeast in a small bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes.\nCombine flour and salt together in the bowl of a stand mixer fitted with a dough hook attachment. Pour in yeast mixture. Knead dough until smooth, about 7 minutes.\nGrease a large bowl lightly with olive oil. Form dough into a tight ball and lightly grease the top. Place in the bowl; cover loosely with plastic wrap. Let rise until doubled in volume, about 30 minutes.\nMix crushed tomatoes and pizza sauce together in a bowl to make sauce.\nGrease a heavy-gauge rimmed 12x17-inch baking sheet generously with olive oil. Press dough into the bottom. Prick dough all over with a fork. Arrange mozzarella cheese slices over dough; cover with 1 cup sauce. Sprinkle Pecorino Romano cheese on top. Drizzle remaining olive oil over pizza.\nLet pizza rise in a warm area until puffy, about 1 hour.\nPreheat oven to 450 degrees F (230 degrees C).\nBake pizza on the center rack of the preheated oven until edges are very dark brown but top is not burnt, 15 to 20 minutes. Cool in the pan for 5 minutes before slicing into squares.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "2 h ",
    "i": "3474658.jpg",
    "o": "",
    "st": "allrecipes"
}