{
    "id": 246579,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Filling:",
        "1 3/4 pounds boneless chicken breasts",
        "1 tablespoon vegetable oil",
        "1 onion, chopped",
        "salt and ground black pepper to taste",
        "Dough:",
        "8 cups all-purpose flour",
        "1 cup hot milk",
        "1 egg yolk",
        "1 tablespoon butter, melted, or as needed"
    ],
    "nut": [
        "Calories > 488 kcal",
        "Carbs > 78.5 g",
        "Cholesterol > 66 mg",
        "Fat > 6 g",
        "Protein > 26.9 g",
        "Sodium > 70 mg"
    ],
    "n": "Uszka z Miesem (Chicken Dumpling Parcels)",
    "a": "olenka",
    "r": "0",
    "s": 10,
    "des": "\"These chicken dumpling parcels are tasty and fun and great served with borscht or some other vegetable dish.\"",
    "ins": "Bring a saucepan of lightly salted water to a boil. Add chicken breasts; cook until no longer pink and an instant-read thermometer inserted into the center reads at least 165 degrees F (74 degrees C), about 20 minutes. Drain and cool until easily handled, about 5 minutes. Chop finely.\nHeat oil in a large skillet over medium heat; add onion. Cook and stir until translucent, about 5 minutes. Remove from heat; stir in chicken. Season with salt and black pepper.\nCombine flour, hot milk, and egg yolk in a large bowl, stirring quickly with a fork until a soft and smooth dough forms.\nRoll dough out on a lightly-floured surface. Cut into 1 1/2-inch squares. Place a teaspoon of chicken mixture in the center of each square. Fold the dough over the filling to form a triangle and pinch edges to seal. Bring the bottom corners together and pinch together.\nBring a large pot of lightly salted water to a boil. Cook dumplings in batches until they float to the surface of the water, about 10 minutes. Transfer to a serving plate with a slotted spoon. Pour melted butter over cooked dumplings so they do not stick together.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4537437.jpg",
    "o": "",
    "st": "allrecipes"
}