{
    "id": 246521,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups light rye flour (such as Bob's Red MillÂ®)",
        "2 cups bread flour",
        "1/4 cup buttermilk",
        "2 tablespoons caraway seeds",
        "1 1/2 tablespoons vital wheat gluten (optional)",
        "2 teaspoons flaked kosher salt, crushed",
        "1 3/4 cups warm water",
        "2 teaspoons white sugar",
        "3/8 teaspoon active dry yeast"
    ],
    "nut": [
        "Calories > 1867 kcal",
        "Carbs > 379.6 g",
        "Cholesterol > 2 mg",
        "Fat > 10.7 g",
        "Protein > 64.4 g",
        "Sodium > 3931 mg"
    ],
    "n": "Dutch Oven Caraway Rye Bread",
    "a": "chalkie",
    "r": "0",
    "s": 1,
    "des": "\"No-fail and easy to make, no kneading, no double-rise. Caraway rye bread the way you like it! Perfect every time.\"",
    "ins": "Mix rye flour, bread flour, buttermilk, caraway seeds, vital wheat gluten, and kosher salt together in a very large bowl.\nCombine water, sugar, and yeast in a bowl until yeast softens and begins to form a creamy foam, about 5 minutes. Stir yeast mixture into flour mixture until well mixed and caraway seeds are evenly distributed. Cover bowl with plastic wrap and let sit for 18 hours.\nTransfer dough to a heavily floured work surface. It will be somewhat elongated, so take the right and left sides and fold them into the middle. Turn dough over and gently use a spatula to tuck corners under; cover with plastic wrap for 15 minutes. Remove plastic wrap, dust dough with flour, and make shallow cuts in the top for full bloom.\nPlace a Dutch oven in the oven and preheat oven to 500 degrees F (260 degrees C).\nCarefully place dough in the Dutch oven, cover immediately, reduce oven temperature to 460 degrees F (238 degrees C), and bake until bread is cooked through, 30 to 35 minutes. Carefully transfer bread from the Dutch oven to the oven rack and bake for 5 minutes more.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "19 h ",
    "i": "3528717.jpg",
    "o": "",
    "st": "allrecipes"
}