{
    "id": 246544,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 cups chicken stock, divided",
        "1 1/2 pounds asparagus, trimmed and chopped",
        "1/4 cup butter",
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "2 ribs celery, chopped",
        "2 cloves garlic, chopped",
        "6 tablespoons all-purpose flour",
        "1 cup half-and-half, or more to taste",
        "1 pound processed American cheese (such as VelveetaÂ®), cubed",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 484 kcal",
        "Carbs > 21.8 g",
        "Cholesterol > 97 mg",
        "Fat > 36.7 g",
        "Protein > 19.5 g",
        "Sodium > 1760 mg"
    ],
    "n": "Cheesy Asparagus Soup",
    "a": "folsomfats",
    "r": "0",
    "s": 6,
    "des": "\"This is one of our favorites. It's quick to make and freezes well. Add cooked asparagus tips as garnish.\"",
    "ins": "Bring 4 cups chicken stock to a boil in a saucepan. Add asparagus and cook until tender, 3 to 5 minutes. Drain asparagus, reserving the stock. Set a few asparagus tips aside for garnish.\nHeat butter and olive oil in a stockpot over medium heat. Add onion and celery and cook until tender, 6 to 8 minutes. Add garlic; cook and stir until fragrant, about 3 minutes more.\nStir flour into onion mixture until combined, about 2 minutes. Add remaining 2 cups chicken stock; cook and stir until thickened, about 5 minutes more. Add cooked asparagus stalks and remaining reserved asparagus-chicken stock; bring soup to a boil.\nHeat half-and-half in a small saucepan over medium heat until warmed slightly, 1 to 2 minutes. Add warmed half-and-half to soup, reduce heat, and simmer until flavors have blended, about 10 minutes.\nPour soup into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth. Return pureed soup to stockpot. Add American cheese and stir until melted; season with salt and pepper. Garnish with asparagus tips.",
    "pt": "20 m",
    "ct": "33 m",
    "tt": "53 m",
    "i": "4508145.jpg",
    "o": "",
    "st": "allrecipes"
}