{
    "id": 246501,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 red chile pepper, seeded and minced (optional)",
        "1 green chile pepper, seeded and minced (optional)",
        "2 tablespoons cooking wine",
        "2 tablespoons gochugaru (Korean red pepper flakes)",
        "1 tablespoon gochujang (Korean chile paste)",
        "2 tablespoons soy sauce",
        "1 tablespoon brown sugar",
        "5 cloves garlic, minced",
        "1/2 teaspoon minced fresh ginger",
        "2 cups water",
        "1 daikon radish, halved lengthwise and sliced into 1/2-inch thick pieces",
        "2 whole mackerel - gutted, cleaned, and cut into 3-inch pieces",
        "2 green onions, sliced on the bias into 1/2-inch pieces"
    ],
    "nut": [
        "Calories > 178 kcal",
        "Carbs > 13.9 g",
        "Cholesterol > 32 mg",
        "Fat > 7.7 g",
        "Protein > 13.4 g",
        "Sodium > 776 mg"
    ],
    "n": "Godeungeo Jorim (Korean Braised Mackerel with Radish)",
    "a": "mykoreaneats",
    "r": "0",
    "s": 4,
    "des": "\"Godeungeo (mackerel) has a very special place in my heart, having eaten it every which way imaginable - pan-fried, grilled, braised, canned, and smoked during my days in Seoul. Serve with rice and other side dishes.\"",
    "ins": "Combine red chile pepper, green chile pepper, cooking wine, gochugaru, gochujang, soy sauce, brown sugar, garlic, and ginger in a small bowl; mix well to make sauce.\nPlace water and daikon radish in a large pot. Bring to a boil; cook until radish is tender, about 5 minutes.\nStir mackerel pieces into the pot. Pour sauce over the mackerel. Cook over high heat, occasionally spooning sauce over mackerel but not stirring the mixture, until cooking liquid has reduced by half, about 10 minutes. Reduce heat and simmer, partially covered, until sauce thickens, about 15 minutes.\nGarnish mackerel with green onions.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}