{
    "id": 246526,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Spice Rub:",
        "1 tablespoon sea salt",
        "1 tablespoon garlic salt",
        "1 1/2 teaspoons freshly ground black pepper",
        "1 1/2 teaspoons brown sugar",
        "1 1/2 teaspoons powdered honey",
        "1 teaspoon ground cayenne pepper",
        "1 teaspoon red pepper flakes",
        "Steak:",
        "2 pounds beef chuck steak",
        "2 tablespoons olive oil",
        "2 onions, diced",
        "2 yellow bell peppers, diced",
        "1 cup sliced mushrooms",
        "1/2 cup water"
    ],
    "nut": [
        "Calories > 461 kcal",
        "Carbs > 16 g",
        "Cholesterol > 103 mg",
        "Fat > 32 g",
        "Protein > 28.6 g",
        "Sodium > 3175 mg"
    ],
    "n": "Grace Love's Smothered Steak",
    "a": "Leslie Kelly",
    "r": "0",
    "s": 4,
    "des": "\"Seattle-based soul singer Grace Love was born in the South, and learned to cook watching her parents in the kitchen. This satisfying dish was created using pantry staples. She calls it smothered because it's covered and finished in the oven. She calls it simple, but it's definitely comfort food at its Southern finest. Serve over steamed white rice.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nCombine sea salt, garlic salt, black pepper, brown sugar, powdered honey, cayenne pepper, and red pepper flakes in a small bowl to make spice rub.\nMeasure out 2 tablespoons of the spice rub and use to season steak on all sides.\nHeat oil in a large oven-safe skillet over medium-high heat. Add onions; cook and stir until they start to become translucent, about 3 minutes. Add bell peppers and mushrooms; saute until tender, about 3 minutes.\nClear a space in the center of the skillet; add seasoned steak. Cook until surface of the steak starts to brown, 3 to 4 minutes. Flip steak. Pour water into the skillet and cover with aluminum foil.\nTransfer skillet to the preheated oven and cook until steak pulls apart when pierced with a fork, 45 minutes to 1 hour.",
    "pt": "30 m",
    "ct": "54 m",
    "tt": "1 h ",
    "i": "3777825.jpg",
    "o": "",
    "st": "allrecipes"
}