{
    "id": 246644,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 dried shiitake mushrooms",
        "2 pounds beef short ribs",
        "2 cups water",
        "1 onion, sliced",
        "2 tablespoons soy sauce",
        "7 cloves garlic, minced",
        "1 1/2 tablespoons brown sugar",
        "1 tablespoon rice wine",
        "1 Korean radish, peeled and cut into chunks",
        "2 carrots, cut into chunks",
        "6 roasted and peeled chestnuts (optional)",
        "6 hard-boiled eggs, peeled (optional)",
        "2 tablespoons corn syrup (mulyeot)",
        "1 tablespoon sesame oil",
        "1 teaspoon ground black pepper",
        "1 green onion, chopped"
    ],
    "nut": [
        "Calories > 782 kcal",
        "Carbs > 40.3 g",
        "Cholesterol > 411 mg",
        "Fat > 53.5 g",
        "Protein > 34.2 g",
        "Sodium > 652 mg"
    ],
    "n": "Korean Short Ribs (Kalbi Jjim)",
    "a": "dleewla",
    "r": "0",
    "s": 4,
    "des": "\"Kalbi Jjim is a classic Korean beef dish. It uses the same meat as Kalbi Barbeque but the way it's cut is a little different. The meat is cut into squares instead of thin slices. It's a sweet beef dish that can be served a main dish for any occasion. Kids usually love this.\"",
    "ins": "Soak shiitake mushrooms in a bowl of very warm water until softened, about 3 hours. Drain and slice into strips.\nSoak short ribs in a bowl of cold water for 20 minutes, changing the water a few times. Drain and bring ribs to room temperature, about 30 minutes.\nBring a large pot of water to a boil. Add short ribs; cook until no longer pink, about 10 minutes. Drain and rinse with cold water. Remove any loose particles and excess fat; transfer to a large pot.\nMix 2 cups water, sliced onion, soy sauce, garlic, brown sugar, and rice wine in a bowl; pour over ribs in the pot. Bring to a boil; cook for 20 to 25 minutes. Stir in shiitake mushrooms, radish, and carrot. Reduce heat to low and simmer, stirring occasionally, until short ribs are tender, about 1 hour.\nStir eggs, corn syrup, sesame oil, and black pepper into the pot. Increase heat to medium-high; cook, stirring frequently, until most of the cooking liquid has evaporated, about 15 minutes. Transfer short ribs to a serving platter and top with chopped green onion.",
    "pt": "35 m",
    "ct": "2 h",
    "tt": "6 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}