{
    "id": 246648,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds beef short ribs, or more to taste",
        "1 onion, quartered",
        "1 (1 inch) piece fresh ginger, sliced",
        "2 cloves garlic",
        "5 tablespoons soy sauce",
        "1/4 cup brown sugar",
        "2 tablespoons Korean red pepper flakes (gochugaru)",
        "4 cloves garlic, minced",
        "1 tablespoon rice vinegar",
        "1 tablespoon sesame oil",
        "2 potatoes, peeled and cut into 2-inch pieces",
        "2 carrots, peeled and cut into 2-inch pieces",
        "1/2 cup Japanese beech mushrooms",
        "7 chestnuts (bam), or more to taste",
        "7 dried Korean dates (daechu)",
        "1 tablespoon corn syrup (mulyeot)",
        "2 green onions, sliced"
    ],
    "nut": [
        "Calories > 547 kcal",
        "Carbs > 50.2 g",
        "Cholesterol > 62 mg",
        "Fat > 31 g",
        "Protein > 18.7 g",
        "Sodium > 841 mg"
    ],
    "n": "Korean Kalbi Jjim (Braised Beef Short Ribs)",
    "a": "mykoreaneats",
    "r": "0",
    "s": 6,
    "des": "\"This is a traditional meat dish eaten on special occasions like holidays and large gatherings. Enjoy with rice and side dishes (banchan).\"",
    "ins": "Soak beef short ribs in a large bowl of cold water to remove residual blood, about 30 minutes.\nPlace short ribs, onion, ginger, and 2 cloves garlic in a large pot and cover with water. Bring to a boil, skimming any foam that floats to the top, 20 to 30 minutes. Measure out 2 cups of broth and reserve. Drain short ribs and rinse under cold water; discard onion, ginger, and garlic. Cool until easily handled.\nMake slits in each short rib to remove or cut away excess fat.\nReturn short ribs to the pot. Add reserved broth, soy sauce, brown sugar, red pepper flakes, 4 minced garlic cloves, rice vinegar, and sesame oil. Simmer over low heat until flavors combine, about 45 minutes. Add potatoes, carrots, mushrooms, chestnuts, and dates. Continue simmering until potatoes are tender and sauce thickens, about 10 minutes.\nStir corn syrup into the sauce. Simmer until sauce has a slightly syrupy consistency, about 5 minutes more. Garnish with green onion slices and serve.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}