{
    "id": 246669,
    "old_rating": "4.55556",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 1/2 pounds beef oxtail, cut into 2-inch sections",
        "1 tablespoon olive oil",
        "Salt and freshly ground black pepper",
        "1 large yellow onion, diced",
        "6 cloves garlic, roughly chopped",
        "1/4 cup sherry vinegar",
        "4 cups tomato sauce or puree, or more if desired",
        "2 cups chicken broth, or enough to cover the oxtails",
        "1 sprig fresh rosemary",
        "2 sprigs fresh thyme",
        "2 sprigs fresh oregano",
        "1 teaspoon kosher salt, plus more to taste",
        "1/4 teaspoon red chili flakes"
    ],
    "nut": [
        "Calories > 605 kcal",
        "Carbs > 19.1 g",
        "Cholesterol > 221 mg",
        "Fat > 30.8 g",
        "Protein > 65 g",
        "Sodium > 3206 mg"
    ],
    "n": "Oxtail Ragu",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Richly browned oxtail sections are simmered low and slow in a rich tomato sauce until the meat comes off the bones-- this oxtail ragu is almost foolproof. The only way to screw up this incredibly succulent cut of beef is to not cook it long enough.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Lightly oil a baking pan large enough to hold the oxtails in a single layer.\nPlace chopped onions and garlic in prepared pan. Rub oxtail sections with olive oil; season with salt and freshly ground black pepper. Arrange on top of onions. Roast in preheated oven for 25 minutes. Turn oxtails and continue roasting until well browned, another 20 to 35 minutes. Remove pan from oven.\nPour in wine vinegar, tomato sauce, chicken stock or water, rosemary, thyme, oregano, salt, and red chili flakes to the baking pan; stir. Pour the entire mixture into a large pot. Place over medium-high heat until sauce begins to simmer. Cover; reduce heat, and simmer over low heat until meat easily separates from the bone and is very tender, about 4 to 5 hours. Skim off fat before serving.",
    "pt": "10 m",
    "ct": "4 h ",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}