{
    "id": 246607,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Glaze:",
        "2 cups confectioners' sugar",
        "1/4 cup multicolored candy sprinkles",
        "3 tablespoons whole milk",
        "1 tablespoon lemon juice",
        "1 teaspoon vanilla extract",
        "1 pinch salt",
        "Donut Holes:",
        "2 cups all-purpose flour",
        "2 tablespoons brown sugar, or more to taste",
        "1 1/2 tablespoons baking powder",
        "3/4 teaspoon kosher salt",
        "1 cup milk",
        "1 egg",
        "1 teaspoon vanilla extract",
        "1/4 cup unsalted butter, melted",
        "1/4 cup multicolored candy sprinkles",
        "vegetable oil for frying"
    ],
    "nut": [
        "Calories > 107 kcal",
        "Carbs > 15.3 g",
        "Cholesterol > 9 mg",
        "Fat > 4.7 g",
        "Protein > 1.2 g",
        "Sodium > 111 mg"
    ],
    "n": "FunfettiÂ® Donut Holes",
    "a": "Ashley Baron Rodriguez",
    "r": "0",
    "s": 36,
    "des": "\"A favorite, classic cake flavor turned into a donut. Serve while warm.\"",
    "ins": "Whisk confectioners' sugar, 1/4 cup sprinkles, 3 tablespoons milk, lemon juice, 1 teaspoon vanilla extract, and 1 pinch salt together in a bowl to make a smooth glaze.\nWhisk flour, brown sugar, baking powder, and 3/4 teaspoon salt together in a large bowl.\nCombine 1 cup milk, egg, and 1 teaspoon vanilla extract in a small bowl. Stir into the flour mixture. Add melted butter and 1/4 cup sprinkles; mix until a soft dough forms.\nHeat at least 2 inches of oil in a large pot to 350 degrees F (175 degrees C). Line a baking sheet or wire rack with paper towels.\nScoop a few tablespoons of dough into the hot oil using a small ice cream scoop. Fry donut holes until golden brown, about 1 minute per side. Transfer donut holes to the paper towels using a slotted spoon; let drain and cool slightly. Repeat with remaining dough.\nPlace a wire rack on a baking sheet. Dip one donut hole at a time into the glaze and place on the wire rack; allow excess glaze to drip off before serving.",
    "pt": "25 m",
    "ct": "2 m",
    "tt": "27 m",
    "i": "3356160.jpg",
    "o": "",
    "st": "allrecipes"
}