{
    "id": 246661,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds ricotta cavatelli",
        "1 pound broccoli rabe, chopped",
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "1 pound Italian sausage, removing from casings and cut into bite-size pieces",
        "1 large onion, diced",
        "10 ounces roasted red peppers, cut into 1-inch strips",
        "1 tablespoon chopped garlic",
        "2 tablespoons concentrated chicken stock (such as KnorrÂ®)",
        "1/2 cup dry white wine",
        "1/2 cup water",
        "1 1/2 teaspoons cornstarch",
        "1 pinch salt and ground black pepper to taste",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 656 kcal",
        "Carbs > 94.6 g",
        "Cholesterol > 31 mg",
        "Fat > 17.4 g",
        "Protein > 28.2 g",
        "Sodium > 1270 mg"
    ],
    "n": "Jan's Cavatelli with Broccoli Rabe",
    "a": "What's for dinner, mom?",
    "r": "0",
    "s": 8,
    "des": "\"Quick, easy and definitely delicious. Spicy sausage and creamy cavatelli is tossed with tangy broccoli rabe in a delicate chicken and wine sauce. I also use gnocchi in place of the cavatelli on occasion.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook cavatelli in the boiling water, stirring occasionally until tender yet firm to the bite, 9 to 11 minutes. Drain.\nFill the same pot with salted water and bring to a boil. Add broccoli rabe; cook until tender, 7 to 10 minutes. Drain.\nHeat butter and olive oil in a large skillet over medium heat. Add sausage and onion; cook and stir until sausage is no longer pink, 5 to 7 minutes. Stir in broccoli rabe, roasted red peppers, and garlic. Cook until flavors combine, about 5 minutes.\nDissolve chicken stock with white wine and water in a small bowl. Whisk in cornstarch. Pour chicken stock mixture into the skillet. Season with salt and pepper. Bring sauce to a simmer until slightly thickened, 3 to 5 minutes. Remove from heat.\nPour sauce over cooked cavatelli and top with Parmesan cheese. Toss lightly and serve.",
    "pt": "25 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "4479920.jpg",
    "o": "",
    "st": "allrecipes"
}