{
    "id": 246655,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 heads radicchio, halved lengthwise",
        "2 heads Belgian endive, halved lengthwise",
        "1 head chicory (curly endive), halved lengthwise",
        "1 head romaine lettuce, halved lengthwise",
        "3 tablespoons olive oil, divided",
        "3/4 cup pitted Greek olives",
        "1/2 cup capers",
        "1 tablespoon dried oregano",
        "1 1/2 teaspoons ground thyme",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1 teaspoon ground dried chile pepper (optional)",
        "2 tablespoons grated Romano cheese (optional)"
    ],
    "nut": [
        "Calories > 192 kcal",
        "Carbs > 16.7 g",
        "Cholesterol > 3 mg",
        "Fat > 12.9 g",
        "Protein > 6.3 g",
        "Sodium > 1109 mg"
    ],
    "n": "Roasted Lettuce, Radicchio, and Endive",
    "a": "Buckwheat Queen",
    "r": "0",
    "s": 6,
    "des": "\"A Sicilian grandmother taught me to make roasted lettuces this way. I like it for a change from serving cold salad. It is healthy and delicious! Most people like it served with crunchy bread. This also works very well with omelets in the morning or for brunch. Leftovers can be easily re-heated in the microwave.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line a baking dish with parchment paper.\nPlace radicchio, Belgian endive, chicory, and romaine lettuce halves in a single layer on the baking sheet. Drizzle 2 tablespoons of the olive oil on top.\nCombine olives and capers in a small bowl. Mix oregano, thyme, salt, black pepper, and chile pepper in a small bowl to make spice mixture.\nStuff inner leaves with olives, capers, and spice mixture using your fingers. Wrap halves together with kitchen string to prevent stuffing from falling out. Drizzle remaining 1 tablespoon olive oil on top.\nBake in the preheated oven until crispy and beginning to wilt, 10 to 15 minutes. Cut off kitchen string and sprinkle Romano cheese on top before serving.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "3466561.jpg",
    "o": "",
    "st": "allrecipes"
}