{
    "id": 246787,
    "old_rating": "4.9",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package jumbo pasta shells",
        "3 teaspoons vegetable oil, divided",
        "1 pound bulk Italian sausage",
        "1 (16 ounce) package finely shredded mozzarella cheese, divided",
        "1 teaspoon dried Italian seasoning, plus more for garnish if desired",
        "1 (24 ounce) jar prepared marinara sauce"
    ],
    "nut": [
        "Calories > 578 kcal",
        "Carbs > 57.3 g",
        "Cholesterol > 60 mg",
        "Fat > 24.6 g",
        "Protein > 30.2 g",
        "Sodium > 1171 mg"
    ],
    "n": "Italian Sausage Stuffed Shells",
    "a": "RainbowJewels",
    "r": "0",
    "s": 8,
    "des": "\"Believe it or not, I'm not a fan of cheese and try to avoid it whenever possible. So dishes that are stuffed with things like ricotta turn me off. I created this dish as a compromise to my cheese avoidance and my husband's love of Italian food. \nServe this with garlic bread and a salad for a wonderful family dinner.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x13 baking dish.\nBring a large pot of lightly salted water to a boil. Cook shells in the boiling water, stirring occasionally until tender yet firm to the bite, about 10 to 12 minutes. Drain. Lightly oil a rimmed baking sheet; place drained pasta on baking sheet to cool.\nHeat 2 teaspoons vegetable oil over medium-high heat in a heavy skillet. Cook and crumble sausage until it has lost its pink color and begins to brown. Remove from heat; drain off grease.\nStir half of the shredded cheese and the Italian seasoning into the browned sausage. Spoon mixture into the pasta shells (1 to 2 tablespoons per shell). Arrange stuffed shells in prepared baking dish. Pour marinara sauce evenly over the shells. Top with remaining shredded cheese. Cover tightly with aluminum foil.\nBake in preheated oven until heated through and bubbly, about 30 minutes. Remove foil; bake until browned, 5 to 10 more minutes. Sprinkle with a pinch of Italian seasoning, if desired.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "4536013.jpg",
    "o": "4341193.jpg,4122657.jpg,4066004.jpg,3956977.jpg,3908213.jpg,3609769.jpg",
    "st": "allrecipes"
}