{
    "id": 246739,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups water",
        "2 cups white sugar",
        "1/2 teaspoon ground cardamom",
        "2 drops rose water (optional)",
        "1 pinch saffron (optional)",
        "1/2 cup instant dry milk powder (such as CarnationÂ®)",
        "2 tablespoons all-purpose flour",
        "1/4 teaspoon baking soda",
        "1 tablespoon unsalted butter (such as Land O'LakesÂ®)",
        "2 tablespoons plain yogurt",
        "2 cups vegetable oil for frying"
    ],
    "nut": [
        "Calories > 187 kcal",
        "Carbs > 36.1 g",
        "Cholesterol > 3 mg",
        "Fat > 4.7 g",
        "Protein > 1.3 g",
        "Sodium > 45 mg"
    ],
    "n": "Gulab Jamun or Kala Jam (Waffle Balls)",
    "a": "Kristin Rhea Hernbrode",
    "r": "0",
    "s": 12,
    "des": "\"These are like little waffle balls that sit in and absorb a sugary rosewater syrup. It was first made on the Indian subcontinent, around South Asia. Gulab Juman originated from Luqmat Al-Qadi, an Arabic dessert. This dessert is popular at weddings, Diwali, Eid Al-Fitr and Eid Al-Adha. There a several different types of jamun with different looks and taste. Serve hot or cold.\"",
    "ins": "Combine water, sugar, cardamom, rose water, and saffron in a saucepan; bring to a boil. Reduce heat and simmer until consistency is syrupy, 5 to 10 minutes.\nMix milk powder, flour, and baking soda in a bowl until well-combined. Slowly mix in butter and yogurt until dough comes together. Let gulab dough rest for 5 minutes. Shape into smooth balls the size of pennies.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Test the temperature of the oil by dropping in a small piece of dough. When it sits at the bottom of the pan for 1 minute before coming to the surface, the oil is ready.\nFry 4 gulab balls at a time, stirring carefully, until dark golden brown on all sides, about 2 minutes. Drain on a paper-towel lined plate. Repeat with remaining gulab.\nBring syrup back up to a boil and drop in fried gulab. Remove from heat and let them soak in the syrup, covered, 45 minutes to 1 hour.",
    "pt": "10 m",
    "ct": "17 m",
    "tt": "1 h ",
    "i": "4481937.jpg",
    "o": "",
    "st": "allrecipes"
}