{
    "id": 246719,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups lentils",
        "2 tablespoons ground cinnamon",
        "1 tablespoon chile powder",
        "1 tablespoon ground coriander",
        "1 tablespoon ground cumin",
        "1 tablespoon ground turmeric",
        "1 teaspoon nutmeg",
        "1 teaspoon paprika",
        "1 teaspoon ground black pepper",
        "1 teaspoon ground cayenne pepper",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon ground allspice",
        "2 bay leaves",
        "2 tablespoons olive oil",
        "5 tomatoes, pureed",
        "2 tablespoons ginger paste",
        "3 cloves garlic, minced",
        "2 tablespoons white sugar",
        "salt to taste",
        "1 cup heavy whipping cream",
        "6 tablespoons butter",
        "1 lime, cut into wedges"
    ],
    "nut": [
        "Calories > 540 kcal",
        "Carbs > 49.4 g",
        "Cholesterol > 85 mg",
        "Fat > 32.9 g",
        "Protein > 15.9 g",
        "Sodium > 138 mg"
    ],
    "n": "Dal Makhani (Butter Lentils)",
    "a": "Matthieu Duquette",
    "r": "0",
    "s": 6,
    "des": "\"This is my adaptation of Dal Makhani. This is a slightly sweet and savory version compared to the tomato-based versions out there - it reminds me more of what you would get in a restaurant. I use sugar, cinnamon, and more butter than other offerings in my version. I always make my version of Coconut Chicken Curry when I make this recipe. This dish pairs well with a rice side; I prefer basmati rice, particularly as a pilaf. It also pairs well with naan bread.\"",
    "ins": "Soak lentils in a saucepan of water for 1 hour. Bring to a boil for 5 minutes. Drain.\nHeat cinnamon, chile powder, coriander, cumin, turmeric, nutmeg, paprika, black pepper, cayenne, cloves, allspice, and bay leaves in a large skillet over medium heat, stirring occasionally, until fragrant, about 5 minutes.\nStir olive oil into the skillet. Add tomatoes, ginger paste, and garlic; simmer until flavors combine, about 10 minutes. Stir in sugar and salt. Cook until mixture thickens into a pulpy sauce, about 5 minutes. Add lentils and simmer until tender, about 5 minutes.\nStir cream and butter into sauce. Cook until sauce thickens and lentils are very soft, about 30 minutes. Squeeze some lime juice over each serving.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "2 h ",
    "i": "4471990.jpg",
    "o": "",
    "st": "allrecipes"
}