{
    "id": 246784,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (12 ounce) cod fillet",
        "3 tablespoons sugar",
        "3 tablespoons water",
        "1/4 cup yellow miso paste",
        "2 tablespoons mirin or sake or combination of both",
        "2 tablespoons extra virgin olive oil",
        "1 pound slender asparagus spears, trimmed",
        "1/2 pound shiitake mushrooms, sliced",
        "1/2 teaspoon kosher salt and freshly ground black pepper",
        "Reynolds WrapÂ® Aluminum Foil"
    ],
    "nut": [
        "Calories > 262 kcal",
        "Carbs > 23.8 g",
        "Cholesterol > 36 mg",
        "Fat > 8.5 g",
        "Protein > 20.9 g",
        "Sodium > 948 mg"
    ],
    "n": "Miso Glazed Cod",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 4,
    "des": "\"Asparagus and shiitake mushrooms round out this delicious meal of sustainable fresh cod fillets marinated in an Asian miso blend from Heidi Larsen of Foodie Crush.\"",
    "ins": "Cut the cod into 4 equal pieces, rinse and pat dry.\nIn a small saucepan, combine the water and sugar and bring to a boil. Stir in the miso and mirin or sake. Place the pan back over medium-high heat and stir until the sugar has dissolved. Remove from the heat and cool.\nPlace the cod in a ceramic dish and coat with the miso glaze. Marinate the fish overnight or for at least four hours.\nPreheat the oven to 450 degrees F. Line a sheet pan with Reynolds Wrap(R) Aluminum Foil. Wipe off the excess marinade from the fish (but do not rinse with water) and place skin-side down on the foil-lined pan.\nDrizzle the asparagus spears and sliced mushrooms with olive oil and season with kosher salt and black pepper. Toss to coat. Scatter the vegetables around the fish fillets.\nBroil the fish and vegetables for 10 to 15 minutes depending on the thickness of the cod, or until the fish has cooked through but is still flaky and the vegetables are fork tender.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "5 h",
    "i": "3457361.jpg",
    "o": "",
    "st": "allrecipes"
}