{
    "id": 24673,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds veal scallops, pounded to 1/4 inch thickness",
        "salt and pepper to taste",
        "3/4 cup all-purpose flour for coating",
        "2 tablespoons butter",
        "3 tablespoons olive oil",
        "1/2 cup dry Marsala wine",
        "1/2 cup chicken stock, divided",
        "2 tablespoons butter, softened"
    ],
    "nut": [
        "Calories > 495 kcal",
        "Carbs > 22.2 g",
        "Cholesterol > 144 mg",
        "Fat > 29.5 g",
        "Protein > 25.9 g",
        "Sodium > 244 mg"
    ],
    "n": "Terri's Veal Marsala",
    "a": "TLYONS",
    "r": "0",
    "s": 4,
    "des": "\"The Marsala sauce, when made with DRY Marsala wine,  is not too sweet. This recipe can be used with veal, pork or chicken. I prepare this dish on a regular basis as it is quick, simple and delicious. This recipe can be made ahead of time. Simply reduce the amount of time to 5 minutes that the meat is simmered in step 4 to 5 minutes. Place meat in a covered casserole dish, finish off sauce according to directions above, pour sauce over meat and refrigerate. Reheat the dish in either an oven preheated to 350 degrees F (175 degrees C) for 15 minutes OR simmer in a pan on top of the stove just until hot.\"",
    "ins": "Season veal with salt and pepper to taste; dredge in flour to coat. Shake off excess flour. Melt 2 tablespoons  butter and olive oil over medium heat in a large skillet. When foam subsides, add veal 3 to 4 pieces at a time and saute for 2 to 3 minutes each side, until browned. Transfer meat to a plate.\nPour most of the fat off from the skillet; add wine and 1/4 cup of the stock and bring to a boil over high heat for 1 or 2 minutes, scraping the bottom and sides of the skillet.\nReturn meat to skillet; cover, reduce heat to low, and simmer for 10 to 15 minutes, basting meat with pan juices occasionally. Transfer meat to a platter.\nAdd remaining 1/4 cup stock to skillet and bring to a boil, scraping bottom and sides of skillet. When sauce has reduces to a thick, syrupy consistency, remove from heat and season with salt and pepper to taste. Stir in 2 tablespoons softened butter and pour sauce over meat.",
    "pt": "5 m",
    "ct": "20 m",
    "tt": "25 m",
    "i": "912933.jpg",
    "o": "",
    "st": "allrecipes"
}