{
    "id": 246755,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Dressing:",
        "1 cup grapes",
        "1/2 cup fish sauce",
        "2 tablespoons lime juice, or more to taste",
        "1 1/2 tablespoons minced garlic",
        "1 tablespoon sweet chile sauce",
        "1/2 teaspoon salt, or more to taste",
        "Salad:",
        "1 teaspoon canola oil",
        "1 pound jumbo shrimp, peeled and deveined",
        "1 eggplant, diced",
        "cooking spray",
        "5 cups thinly sliced bok choy",
        "1 1/2 cups pea shoots",
        "1 cup shredded carrots",
        "1/2 cup thinly sliced cucumbers",
        "1/4 cup chopped fresh mint",
        "1/4 cup chopped cilantro",
        "1/4 cup chopped roasted peanuts",
        "1/4 cup chopped green onions"
    ],
    "nut": [
        "Calories > 276 kcal",
        "Carbs > 29.4 g",
        "Cholesterol > 173 mg",
        "Fat > 7.6 g",
        "Protein > 27.1 g",
        "Sodium > 2879 mg"
    ],
    "n": "Grilled Shrimp, Pea Shoot, and Bok Choy Salad with Asian Reduced Fat Dressing",
    "a": "Karen Barris Calabro",
    "r": "0",
    "s": 4,
    "des": "\"This is the tastiest shrimp salad without any guilt: only a trace of oil makes it perfect for serving any dieter. If you want to feel healthy, but enjoy your food, this is the salad for you. You may want to garnish with additional green onions and chopped peanuts, but I find that placing the shrimp on the top is garnish enough.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPlace grapes in a food processor or blender; process until pureed. Whisk pureed grapes, fish sauce, lime juice, garlic, chile sauce, and salt together in a bowl until dressing is well combined.\nSpoon about 2 tablespoons dressing and oil into a bowl; add shrimp. Reserve remaining dressing for the salad. Refrigerate shrimp until chilled and marinated, 15 to 20 minutes.\nPlace eggplant in a roasting pan and spray with enough cooking spray to coat.\nRoast eggplant in the preheated oven until browned, about 15 minutes. Transfer eggplant to the reserved dressing.\nPreheat an outdoor grill for high heat and lightly oil the grate. Remove shrimp from marinade and discard marinade.\nCook shrimp on the hot grill until visibly pink on the bottom, about 3 minutes. Flip shrimp and cook until cooked through but not dry, 4 to 5 minutes. Remove shrimp from grill and allow to rest.\nCombine bok choy, pea shoots, carrots, cucumbers, mint, cilantro, peanuts, and green onions in a large bowl; add eggplant with dressing and shrimp and toss well.",
    "pt": "20 m",
    "ct": "22 m",
    "tt": "57 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}