{
    "id": 246762,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) box dry fettuccine pasta",
        "1 pint heavy whipping cream",
        "1 1/4 cups butter, divided",
        "3/4 cup grated Romano cheese",
        "1/2 cup grated Parmesan cheese",
        "3 cloves garlic, crushed, divided",
        "salt and ground black pepper to taste",
        "2 tablespoons olive oil",
        "1 large onion, chopped",
        "8 ounces diced mushrooms",
        "1 (8 ounce) package frozen shrimp, deveined and tails removed, thawed"
    ],
    "nut": [
        "Calories > 1060 kcal",
        "Carbs > 62.2 g",
        "Cholesterol > 289 mg",
        "Fat > 80.3 g",
        "Protein > 27.1 g",
        "Sodium > 682 mg"
    ],
    "n": "Mushroom Shrimp Alfredo Pasta",
    "a": "wishgirl10",
    "r": "0",
    "s": 6,
    "des": "\"I combined several different recipes to create this one - it's definitely a winner. Serve sprinkled with chopped parsley.\"",
    "ins": "Fill a large pot with lightly salted water and bring to a rolling boil. Stir in fettuccine, bring back to a boil, and cook over medium heat until tender yet firm to the bite, about 8 minutes. Drain.\nHeat heavy cream and 1 cup butter together in a large saucepan over medium heat until butter is melted. Add Romano cheese, Parmesan cheese, 1 clove garlic, salt, and black pepper; cook and stir until cheese is melted and sauce thickens, about 5 minutes. Remove from heat.\nHeat remaining 1/4 cup butter and olive oil in another saucepan over medium heat. Add onion; cook and stir until softened and translucent, about 2 minutes. Stir in remaining 2 cloves garlic and mushrooms. Increase heat to medium-high and cook until soft, about 2 minutes. Add shrimp; cook and stir until firm and light pink in color, 1 to 2 minutes.\nFold shrimp mixture into sauce. Add drained fettuccine; toss to coat with sauce.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "3881788.jpg",
    "o": "4539228.jpg,4511430.jpg,4498655.jpg,4482217.jpg,3927063.jpg,3874603.jpg",
    "st": "allrecipes"
}