{
    "id": 246785,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 ounces shiitake mushrooms, sliced",
        "1 tablespoon olive oil, divided",
        "2 teaspoons sea salt, divided",
        "6 ounces green beans, cut into thirds",
        "4 cups vegetable broth",
        "1 1/2 teaspoons soy sauce",
        "1 teaspoon sesame oil",
        "1 1/2 teaspoons rice vinegar",
        "1 Thai chile, scored",
        "3 tablespoons yellow miso paste",
        "2 tablespoons hot water",
        "1 (8 ounce) package dried rice noodles",
        "1 large egg",
        "2 green onions, thinly sliced",
        "Reynolds WrapÂ® Aluminum Foil",
        "ReynoldsÂ® Parchment Paper"
    ],
    "nut": [
        "Calories > 702 kcal",
        "Carbs > 122.5 g",
        "Cholesterol > 93 mg",
        "Fat > 15 g",
        "Protein > 16 g",
        "Sodium > 4139 mg"
    ],
    "n": "Spicy Miso Soup with Roasted Shiitake Mushrooms and Green Beans",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 2,
    "des": "\"A vegetarian miso broth flavored with sesame oil, chili pepper and rice vinegar poured over rice noodles, roasted shiitake mushrooms and green beans from Dan Seidman of The Chef Dan.\"",
    "ins": "Preheat oven to 400 degrees F and line a baking sheet with Reynolds(R) Parchment Paper. Place mushrooms on baking sheet and drizzle with half the olive oil and half the salt. Set aside momentarily.\nCenter green beans on a sheet of Reynolds Wrap(R) Aluminum Foil and drizzle with remaining olive oil and salt. Fold over edges of foil to create a packet. Ensure it is tightly sealed.\nPlace the mushrooms and the foil pack of green beans in the oven and roast for 10 minutes, stirring the mushrooms halfway through.\nHeat vegetable broth to a low simmer in a medium pot. Pour in the soy sauce, sesame oil, and rice vinegar. Add the whole Thai chili to simmering broth (this will be removed later).\nWhisk the miso paste with hot water in small bowl until smooth then add to the broth. Continue to simmer for an additional 10 minutes.\nCook noodles according to package directions while the broth is simmering. When the noodles are done, evenly divide them into two serving bowls.\nBring a small pot of water to a boil and carefully drop in the egg to cook for 6 minutes. Remove from water and peel.\nDivide the mushrooms and green beans between the two bowls and then pour the broth evenly between the bowls.\nSlice the egg in half and place 1 half in each bowl. Garnish with sliced green onion.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "45 m",
    "i": "3457364.jpg",
    "o": "",
    "st": "allrecipes"
}