{
    "id": 246797,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Thai Mango Dipping Sauce:",
        "1 ripe mango, diced",
        "1 (1 inch) piece fresh ginger, grated",
        "2 tablespoons sweet Thai chili sauce",
        "2 tablespoons rice vinegar",
        "1 lime, juiced",
        "1/2 cup fresh Thai basil and/or cilantro, chopped",
        "Veggie Spring Rolls:",
        "1 large avocado - peeled, pitted, and thinly sliced",
        "2 cups fresh vegetables such as cucumbers, lettuce, microgreens, carrots and bell peppers, thinly sliced, diced or cut into matchsticks",
        "Salt and pepper to taste",
        "1/2 cup cilantro leaves",
        "1/2 cup fresh mint leaves",
        "8 rice paper wrappers",
        "Chopped peanuts, for topping (optional)",
        "Reynolds WrapÂ® Aluminum Foil"
    ],
    "nut": [
        "Calories > 109 kcal",
        "Carbs > 14.3 g",
        "Cholesterol > < 1 mg",
        "Fat > 5.7 g",
        "Protein > 2.1 g",
        "Sodium > 116 mg"
    ],
    "n": "Veggie Spring Rolls with Thai Mango Dipping Sauce",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 8,
    "des": "\"Try these fresh and light spring rolls filled with spring vegetables and served with a simple mango dipping sauce from Tieghan of Half Baked Harvest.\"",
    "ins": "In a blender, combine all the dipping sauce ingredients except the basil and cilantro. Blend until smooth, add the basil and cilantro and pulse until chopped. Pour into a bowl, cover and place in the fridge until serving.\nSqueeze a little lime juice over the sliced avocado. Create an assembly line of vegetables and herbs, so that they are all ready to go.\nFill a shallow dish with warm water. Add a rice paper sheet, one at a time for 5 to 10 seconds. Remove and place on a flat surface. Toward one end of the rice wrapper, begin layering with 1 to 2 slices of avocado, small handfuls of fresh cilantro and mint, and a handful of veggies. Sprinkle the veggies with salt and pepper. Fold both ends to the center and roll the sheet as tightly as you can without ripping. Place each prepared spring roll on a serving platter and cover with Reynolds Wrap(R) Aluminum Foil to keep the spring rolls from drying out.\nContinue with remaining ingredients, adding them to the platter as you work. Keep the spring rolls covered with foil at all times.\nServe the spring rolls with the mango dipping sauce and chopped peanuts (if desired).",
    "pt": "20 m",
    "ct": "",
    "tt": "",
    "i": "3457399.jpg",
    "o": "",
    "st": "allrecipes"
}