{
    "id": 246836,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons vegetable oil",
        "1 (2 pound) beef chuck roast, trimmed and cut into 4 to 6 pieces",
        "1/3 cup apple cider",
        "4 chipotle peppers in adobo sauce",
        "3 tablespoons lime juice",
        "4 cloves garlic, peeled, or more to taste",
        "4 teaspoons cumin",
        "1 serrano chile pepper, chopped (optional)",
        "1 tablespoon ground cayenne pepper, or more to taste (optional)",
        "2 1/2 teaspoons dried oregano",
        "1 teaspoon ground black pepper",
        "1 teaspoon garlic powder",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground cloves",
        "1 cup chicken broth",
        "1 small onion, finely chopped",
        "3 bay leaves"
    ],
    "nut": [
        "Calories > 244 kcal",
        "Carbs > 7.3 g",
        "Cholesterol > 71 mg",
        "Fat > 14.1 g",
        "Protein > 21.6 g",
        "Sodium > 449 mg"
    ],
    "n": "Chipotle Barbacoa",
    "a": "Dani_Dizzle",
    "r": "0",
    "s": 6,
    "des": "\"This is as close to a certain big chain's barbacoa meat I have ever made! It is full of intense flavors such as garlic, cayenne, and sweet, smoky chipotle. Make sure you scale down the cayenne and serrano if you can't handle heat because this recipe is packin' lots of it! Serve on corn or flour tortillas garnished with cilantro and topped with lime cilantro rice (from this website), black beans, pico de gallo, guacamole, cheese, lettuce, and sour cream.\"",
    "ins": "Heat oil in a large skillet over low heat, gradually increasing heat to medium-high. Add beef chuck pieces; cook until browned, about 10 seconds per side. Transfer beef to a slow cooker.\nCombine apple cider, chipotle peppers, lime juice, garlic, cumin, serrano pepper, cayenne pepper, oregano, black pepper, garlic powder, salt, and ground cloves in a blender or food processor; blend until smooth. Pour over beef in the slow cooker.\nStir chicken broth, onion, and bay leaves into the slow cooker.\nCook on Low until beef is fork-tender, 6 to 8 hours. Shred beef using 2 forks.",
    "pt": "25 m",
    "ct": "6 h ",
    "tt": "6 h ",
    "i": "3514952.jpg",
    "o": "",
    "st": "allrecipes"
}