{
    "id": 246899,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Base Cake Layer:",
        "1 (18.25 ounce) package dark chocolate cake mix (such as Betty CrockerÂ® Super MoistÂ®)",
        "1 1/3 cups water",
        "3 eggs",
        "1/2 cup butter, melted",
        "Top Cake Layer:",
        "1 (18.25 ounce) package dark chocolate cake mix (such as Betty CrockerÂ® Super MoistÂ®)",
        "1 1/3 cups water",
        "3 eggs",
        "1/2 cup butter, melted",
        "Frosting:",
        "4 cups confectioners' sugar",
        "1 1/4 cups unsweetened cocoa powder",
        "1 cup butter, softened",
        "1/2 teaspoon vanilla extract",
        "2/3 cup heavy whipping cream",
        "Candy Lava:",
        "1 cup white sugar",
        "1/2 cup light corn syrup",
        "1/4 cup warm water",
        "red food coloring",
        "1 drop cinnamon flavoring (optional)",
        "Marshmallow Cream Lava:",
        "1/4 (13 ounce) jar marshmallow cream (such as Marshmallow FluffÂ®)",
        "1/2 cup water, divided",
        "1 drop red food coloring",
        "1 drop yellow food coloring",
        "dry ice",
        "1 tall glass or mason jar"
    ],
    "nut": [
        "Calories > 620 kcal",
        "Carbs > 85.9 g",
        "Cholesterol > 115 mg",
        "Fat > 31.7 g",
        "Protein > 6.4 g",
        "Sodium > 593 mg"
    ],
    "n": "Erupting Volcano Cake",
    "a": "buffet1",
    "r": "0",
    "s": 20,
    "des": "\"Chocolate volcano cake with hard candy lava and erupting marshmallow fluffÂ®. You can do almost anything to decorate this cake. Be creative according to your time and energy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease 1 angel food cake pan for the base cake layer and 1 fluted tube pan (such as Bundt(R)) for the top cake layer.\nCombine 1 cake mix, 1 1/3 cup water, 3 eggs, and 1/2 cup melted butter in a large bowl to make base cake layer. Beat with an electric mixer on low speed, about 30 seconds. Increase speed to medium and continue to beat, scraping bowl occasionally, until batter is smooth, about 2 minutes. Pour into prepared angel food cake pan.\nCombine 1 cake mix, 1 1/3 cup water, 3 eggs, and 1/2 cup melted butter in a large bowl to make top cake layer. Beat with an electric mixer on low speed, about 30 seconds. Increase speed to medium and continue to beat, scraping bowl occasionally, until batter is smooth, about 2 minutes. Pour into prepared fluted tube pan.\nBake cakes in the preheated oven until toothpicks inserted into the centers come out clean, 40 to 45 minutes. Cool in pans, about 5 minutes. Invert onto wire racks.\nSift confectioners' sugar and cocoa powder together in a large bowl.\nCombine 1 cup softened butter and vanilla extract together in another large bowl; beat with an electric mixer on low speed until creamy. Gradually beat in sifted sugar mixture until well-blended. Add heavy cream; beat until frosting is well-blended and spreading consistency.\nPlace base cake layer on a large serving platter. Spread a thin layer of frosting on top. Position top cake layer over the base so that holes are aligned. Trim hole at the center of the cakes with a knife so that it is large enough to fit a tall glass or mason jar. Cut off the top with a serrated knife to create a volcano \"rim\".\nSpread frosting all over stacked cake. Arrange cake trimmings as \"lava rocks\" around the base. Refrigerate until frosting sets.\nLine a baking sheet with aluminum foil.\nCombine white sugar, light corn syrup, and 1/4 cup water in a small saucepan. Bring to a boil; cook until syrup reaches 310 degrees F (155 degrees C) or until a small amount of syrup dropped into cold water forms hard, brittle threads. Remove from heat and stir in 2 drops red food coloring and cinnamon flavoring.\nPour streams of red syrup carefully onto the lined baking sheet to create candy \"lava\". Cool until set, about 5 minutes. Peel off the baking sheet and place around the sides and top of the frosted cake.\nPlace marshmallow cream, 1/4 cup water, 1 drop red food coloring, and yellow food coloring in a small saucepan over low heat; cook and stir until marshmallow lava is melted and even in color, 3 to 5 minutes.\nPlace glass or mason jar inside the frosted cake. Add a small amount of dry ice, marshmallow lava, and remaining 1/4 cup water. Dry ice will create a \"smoke\" effect and cause marshmallow lava to bubble over cake rim.",
    "pt": "50 m",
    "ct": "48 m",
    "tt": "1 h ",
    "i": "4537928.jpg",
    "o": "",
    "st": "allrecipes"
}