{
    "id": 246807,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 shallots, peeled",
        "4 red chile peppers",
        "4 whole crabs, cleaned and quartered",
        "2 tablespoons vegetable oil",
        "3 cloves garlic, chopped",
        "1 (1/2 inch) piece fresh ginger, chopped",
        "3 tablespoons ketchup",
        "2 tablespoons vinegar",
        "2 tablespoons white sugar",
        "2 eggs, beaten",
        "salt and ground black pepper to taste",
        "1 tablespoon water, or as needed (optional)",
        "1 small bunch fresh cilantro, stems removed and leaves chopped"
    ],
    "nut": [
        "Calories > 226 kcal",
        "Carbs > 21.1 g",
        "Cholesterol > 124 mg",
        "Fat > 10.1 g",
        "Protein > 14.5 g",
        "Sodium > 365 mg"
    ],
    "n": "Chile Crab",
    "a": "Suhara",
    "r": "0",
    "s": 4,
    "des": "\"This finger-licking dish is very messy but delicious to eat. Forget the utensils and just use your hands to eat this. Get the crackers ready and have some toasted bread on the side to sop up the sauce.\"",
    "ins": "Combine shallots and red chile peppers in a food processor; pulse until a very fine paste forms.\nCrack the crab claws and the big legs slightly.\nHeat oil in a wok or large skillet over medium-high heat until very hot; add crabs and cook until shells change color and meat is cooked through, about 10 minutes. Transfer crabs to a plate, reserving oil in the wok.\nReduce heat under wok to medium-low and add chile pepper paste; cook and stir until fragrant, 1 to 2 minutes. Add garlic and ginger. Whisk ketchup, vinegar, and sugar together in a bowl; pour over garlic-ginger mixture and stir until sauce is well mixed.\nReturn crab to sauce in the wok; cook and stir for 3 minutes more, seasoning with salt and pepper. Pour eggs into wok while continuously stirring to create strands in the sauce. Add water if sauce gets too dry. Remove wok from heat and garnish crabs with cilantro.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "4497309.jpg",
    "o": "",
    "st": "allrecipes"
}