{
    "id": 246845,
    "old_rating": "4.64444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Salsa:",
        "3 ripe mangoes - peeled, pitted, and diced",
        "1 avocado - peeled, pitted, and diced",
        "1 orange bell pepper, diced",
        "1 jalapeno pepper, seeded and diced",
        "1 lime, juiced",
        "2 tablespoons chopped fresh cilantro",
        "1 pinch salt",
        "1 tablespoon sweet and spicy seafood rub, or to taste",
        "1/2 teaspoon chili powder, or to taste",
        "salt and ground black pepper to taste",
        "2 skin-on salmon fillets",
        "2 tablespoons olive oil, or as needed, divided",
        "6 corn tortillas",
        "3 large limes, cut into wedges"
    ],
    "nut": [
        "Calories > 283 kcal",
        "Carbs > 34.5 g",
        "Cholesterol > 19 mg",
        "Fat > 14.2 g",
        "Protein > 9.8 g",
        "Sodium > 341 mg"
    ],
    "n": "Blackened Salmon Tacos with Chunky Mango Avocado Salsa",
    "a": "Leah Smart",
    "r": "0",
    "s": 6,
    "des": "\"This is a quick and easy recipe that you are sure to enjoy. Healthy and delish!\"",
    "ins": "Combine mangoes, avocado, orange bell pepper, and jalapeno in a large bowl to make salsa. Add lime juice, cilantro, and salt; mix to combine. Cover with plastic wrap and refrigerate.\nSprinkle seafood rub, chili powder, salt, and black pepper over 1 side of each salmon steak; rub in with your fingers until evenly distributed.\nCoat the bottom of a large skillet with olive oil and heat over medium-high heat. Add salmon skin-side down and cook until skin is crisp, 4 to 5 minutes. Flip salmon and carefully peel off skin. Season top with seafood rub, chili powder, salt and black pepper. Continue cooking until lightly browned on the second side and salmon flakes easily with a fork, 4 to 5 minutes.\nSlice each salmon fillet lengthwise to create 6 pieces.\nLightly oil another skillet over medium heat. Pan-fry corn tortillas, one at a time, until heated through and pliable, about 30 seconds per side.\nPlace 1 piece of salmon on each tortilla. Top with salsa. Squeeze a wedge of lime on top.",
    "pt": "40 m",
    "ct": "9 m",
    "tt": "49 m",
    "i": "4539795.jpg",
    "o": "4540527.jpg,4526168.jpg,4501946.jpg,3799235.jpg,3781129.jpg,3503566.jpg",
    "st": "allrecipes"
}