{
    "id": 246892,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound tamarind pods",
        "hot water to cover",
        "1 (14 ounce) package firm tofu",
        "3 tablespoons peanut oil, divided",
        "1/4 cup dry-roasted peanuts",
        "1/4 cup sesame seeds",
        "1 cup thinly sliced cucumber",
        "1 cup grated carrots",
        "1 cup diagonally sliced green onions",
        "1 cup thinly sliced red bell pepper",
        "4 cloves crushed garlic",
        "1 orange, juiced",
        "2 tablespoons rice vinegar",
        "2 tablespoons soy sauce",
        "1 tablespoon grated ginger",
        "1 tablespoon white sugar, or to taste",
        "1 teaspoon red pepper flakes, or to taste",
        "5 ounces light soba noodles",
        "5 ounces dark soba noodles"
    ],
    "nut": [
        "Calories > 836 kcal",
        "Carbs > 144 g",
        "Cholesterol > 0 mg",
        "Fat > 24.1 g",
        "Protein > 28.2 g",
        "Sodium > 1099 mg"
    ],
    "n": "Tamarind Tofu with Vegetables and Soba",
    "a": "Jocelyn Helling",
    "r": "0",
    "s": 4,
    "des": "\"Brightly colored vegetables with a tamarind, ginger, and garlic sauce are tossed with baked tofu triangles and served over bi-colored soba noodles with sesame and peanut crunch. Garnish as desired. Orange or pineapple slices are pretty on this dish.\"",
    "ins": "Break open tamarind pods and scoop out flesh into a large bowl. Cover with hot water and let soften, about 1 hour. Push softened tamarind through a sieve with the back of a spoon to extract pulp, discarding seeds and tough fibers. Measure out a 1/2 cup of tamarind pulp; set aside.\nSlice tofu crosswise into 6 rectangles. Cut rectangles in half into 12 squares. Cut squares in half diagonally to make 24 triangles. Layer tofu on paper towels, pressing to extract excess liquid, about 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nToss tofu triangles with 2 tablespoons peanut oil; arrange on baking sheet.\nBake in the preheated oven until golden brown, 45 to 60 minutes.\nCombine peanuts and sesame seeds in a large skillet or wok over medium heat; toast until fragrant, about 1 minute. Transfer to a bowl.\nHeat 1 1/2 teaspoon peanut oil in the same skillet over medium-high heat. Add cucumber, carrots, green onions, and red bell pepper; saute just until crisp-tender, about 2 minutes. Transfer to a bowl.\nHeat remaining 1 1/2 teaspoon peanut oil in the same skillet over medium heat. Add garlic; cook and stir until fragrant, about 30 seconds. Add tamarind pulp, orange juice, rice vinegar, soy sauce, ginger, sugar, and red pepper flakes; simmer until sauce is combined, about 3 minutes.\nStir baked tofu triangles, peanuts, and sesame seeds into the sauce. Fold in cucumber mixture.\nFill a large pot with water and bring to a boil. Add light and dark soba noodles; cook, stirring occasionally, under tender, about 3 minutes. Drain. Transfer to a large bowl. Top with tofu and cucumber mixture.",
    "pt": "35 m",
    "ct": "1 h",
    "tt": "3 h ",
    "i": "4465827.jpg",
    "o": "",
    "st": "allrecipes"
}