{
    "id": 246856,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "36 jumbo pasta shells",
        "1 pound lean ground beef",
        "1 cup water",
        "1 (1.25 ounce) package taco seasoning mix",
        "1 (16 ounce) can refried beans",
        "1 cup shredded Cheddar cheese",
        "1 (4 ounce) can chopped green chiles",
        "1 (8 ounce) can tomato sauce",
        "3/4 cup picante sauce"
    ],
    "nut": [
        "Calories > 657 kcal",
        "Carbs > 75.8 g",
        "Cholesterol > 86 mg",
        "Fat > 22.2 g",
        "Protein > 36.6 g",
        "Sodium > 1712 mg"
    ],
    "n": "Mexican Stuffed Shells",
    "a": "AIMEE.HOWE",
    "r": "0",
    "s": 5,
    "des": "\"This is a great alternative to Italian-style stuffed shells. Serve this with sour cream and chips and salsa.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until tender yet firm to the bite, 8 to 10 minutes. Drain well.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add water and taco seasoning mix and simmer until thickened, about 5 minutes.\nStir refried beans, Cheddar cheese, and green chiles into ground beef; cook and stir until cheese is melted and mixture is smooth, about 5 minutes. Fill shells with beef mixture.\nCombine tomato sauce and picante sauce in a saucepan over medium-low heat; cook and stir until heated through, 5 to 7 minutes. Spread 1/2 cup sauce in the bottom of a 9x13-inch baking dish.\nArrange stuffed shells side-by-side in the baking dish and top with remaining sauce. Cover dish with aluminum foil.\nBake in the preheated oven for 40 minutes. Let stand for 5 minutes before serving.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "3635746.jpg",
    "o": "",
    "st": "allrecipes"
}