{
    "id": 246875,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Lamb Korma:",
        "1/2 cup whole milk yogurt",
        "1/2 cup almonds",
        "1/4 cup ghee (clarified butter)",
        "3 yellow onions, thinly sliced",
        "1 pound boneless lamb shoulder, cut into 1-inch pieces",
        "1/2 teaspoon cayenne pepper",
        "1 pinch salt to taste",
        "1 cup water",
        "1/2 teaspoon garam masala",
        "1/2 teaspoon ground cardamom",
        "1/4 teaspoon ground mace",
        "Onion Cilantro Salad:",
        "2 red onions, thinly sliced",
        "2 tablespoons chopped fresh cilantro",
        "1 tablespoon lemon juice, or more to taste",
        "salt to taste"
    ],
    "nut": [
        "Calories > 330 kcal",
        "Carbs > 17.9 g",
        "Cholesterol > 63 mg",
        "Fat > 23.2 g",
        "Protein > 14.7 g",
        "Sodium > 94 mg"
    ],
    "n": "Punjabi Lamb Korma with Onion Cilantro Salad",
    "a": "CreatCook",
    "r": "0",
    "s": 6,
    "des": "\"Korma means creamy and fragrant stew in Punjabi and this dish obtains it from the fresh yogurt and wonderful spices used. It is an extremely authentic and exotic recipe, originating from the palaces of north Indian rulers. Serve with hot roti.\"",
    "ins": "Blend yogurt and almonds together in a food processor or blender until a smooth, creamy paste forms.\nHeat a large, wide-bottomed pan over medium heat; add ghee and allow to melt. Cook and stir yellow onions in the hot ghee until evenly browned, 10 to 15 minutes. Add lamb; cook, stirring occasionally, until slightly browned, about 6 minutes. Mix cayenne pepper and salt into lamb mixture; cook for 2 minutes.\nStir yogurt-almond paste into lamb mixture; add water. Bring mixture to a boil; reduce heat and simmer until meat is very tender, 2 to 3 hours. Stir garam masala, cardamom, and mace into lamb korma and simmer for 10 minutes more.\nMix red onions and cilantro together in a bowl; add lemon juice and salt and mix well. Serve salad alongside lamb korma.",
    "pt": "30 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}