{
    "id": 24686,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 quart milk",
        "2 tablespoons lemon zest",
        "1 tablespoon cold water",
        "1 teaspoon fresh lemon juice",
        "2 teaspoons unflavored gelatin",
        "8 egg yolks",
        "1 cup white sugar",
        "1 pinch salt",
        "1 quart heavy cream",
        "1/2 cup confectioners' sugar"
    ],
    "nut": [
        "Calories > 261 kcal",
        "Carbs > 17 g",
        "Cholesterol > 151 mg",
        "Fat > 20.3 g",
        "Protein > 3.8 g",
        "Sodium > 42 mg"
    ],
    "n": "Portuguese Lemon Bavarois",
    "a": "John Pacheco",
    "r": "0",
    "s": 20,
    "des": "\"This is a delicious pudding-custard-like dessert from Sintra, Portugal. Fill the center with fresh fruit.\"",
    "ins": "In a large saucepan over medium heat, combine milk and lemon zest. Bring to a simmer, then remove from heat and strain zest from milk. Set milk aside.\nIn a small bowl, combine water and lemon juice. Sprinkle gelatin over top and set aside until liquid is absorbed.\nIn a large bowl beat egg yolks, sugar, and salt until mixture is light yellow and forms a slowly dissolving ribbon when beaters are lifted.\nReturn milk to saucepan and bring it to a simmer over medium-high heat. Slowly pour the hot milk into yolk mixture, whisking constantly. Return it to the saucepan. Place mixture over medium heat and cook, stirring, until mixture coats the back of a metal spoon. Do not boil. Remove from heat and stir in gelatin mixture. Let cool to room temperature.\nOil a 3-quart ring mold. In a large bowl, combine cream and confectioners' sugar and whip until fluffy. Fold mixture into cooled custard. Spread in prepared mold, smoothing top. Cover tightly with plastic wrap and refrigerate until set, at least 2 hours, preferably overnight. To serve, briefly dip mold in warm water to loosen. Pat dry, then invert on a serving platter.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}