{
    "id": 246843,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "1 3/4 cups all-purpose flour",
        "2 tablespoons white sugar",
        "1 teaspoon salt",
        "3/4 cup chilled unsalted butter, cut into small pieces",
        "2 tablespoons ice water, or more if needed",
        "Filling:",
        "1 lemon, halved",
        "6 small Gala apples, peeled and thinly sliced",
        "1/2 cup white sugar",
        "1/2 teaspoon ground cinnamon",
        "2 teaspoons white sugar"
    ],
    "nut": [
        "Calories > 480 kcal",
        "Carbs > 65.5 g",
        "Cholesterol > 61 mg",
        "Fat > 23.6 g",
        "Protein > 4.3 g",
        "Sodium > 393 mg"
    ],
    "n": "Amazing Apple Crostata",
    "a": "ANGELSTAR",
    "r": "0",
    "s": 6,
    "des": "\"There's an Italian restaurant famous for their family-style eating. You'd think something as simple as apple pie wouldn't be as decadent or exotic as this, but you would be very, very wrong. I'm not a dessert lover but I took one of these home and ate it even after it was all soggy from melted ice cream and savored every morsel. There are no words for how good this is. This crust is to die for!\"",
    "ins": "Mix flour, 2 tablespoons sugar, and salt together with an electric mixer until combined. Mix in butter until mixture resembles coarse meal. Add ice water, 2 teaspoons at a time, while the mixer is running until dough just holds together. Test dough by pinching a small amount between your fingers; if it is crumbly, add a 1 teaspoon more ice water at a time.\nWrap dough in plastic wrap and chill until slightly firm, 20 to 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nSqueeze 1/2 the lemon over the apple slices to keep from browning.\nPlace a large piece of parchment paper on a flat work surface. Roll dough into a round 12 to 16 inches in diameter, 1/4 to 1/2-inch thick. Arrange apple slices in 2 layers on the dough, leaving a 1 1/2 to 2-inch border all around. Fold up the border, pleating the edge to make it fit; leave most of the apples uncovered.\nCombine 1/2 cup sugar and cinnamon in a small bowl. Sprinkle over apples. Squeeze remaining 1/2 lemon over apples. Sprinkle 2 teaspoons sugar over crust. Transfer parchment paper to a baking sheet.\nBake in the preheated oven until crust is golden brown, 50 to 60 minutes.",
    "pt": "25 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "4460331.jpg",
    "o": "",
    "st": "allrecipes"
}