{
    "id": 246997,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon cornstarch, or more to taste",
        "1 tablespoon water",
        "1 1/2 teaspoons light soy sauce",
        "1 1/2 teaspoons white sugar",
        "1 teaspoon salt",
        "2 skinless chicken thighs, cut into small chunks",
        "oil for deep frying",
        "1 taro, peeled and cut into small chunks",
        "1 tablespoon vegetable oil",
        "2 shallots, chopped",
        "2 slices fresh ginger",
        "water to cover",
        "1 (14 ounce) can coconut milk",
        "4 leaves basil",
        "salt to taste",
        "1 pinch white sugar, or to taste"
    ],
    "nut": [
        "Calories > 766 kcal",
        "Carbs > 22.7 g",
        "Cholesterol > 68 mg",
        "Fat > 67.2 g",
        "Protein > 24.9 g",
        "Sodium > 1471 mg"
    ],
    "n": "Coconut Chicken and Taro Root",
    "a": "tonytsang",
    "r": "0",
    "s": 2,
    "des": "\"This Chinese dish has taken a new dimension - it's made with coconut milk! Chicken is simmered with taro, shallots, ginger, and coconut milk. It's delicious with steamed rice.\"",
    "ins": "Mix cornstarch and water together in a large bowl until dissolved. Add soy sauce, 1 1/2 teaspoon sugar, and salt. Mix in chicken; cover with plastic wrap and let marinate in the refrigerator, about 15 minutes.\nHeat oil in a large saucepan or deep-fat fryer. Fry taro until golden brown, 3 to 5 minutes. Drain on paper towels.\nHeat remaining 1 tablespoon oil in a large skillet over high heat. Add shallots and ginger; cook and stir until fragrant, 2 to 3 minutes. Add chicken; cook and stir until no longer pink, 3 to 4 minutes.\nTransfer chicken mixture to a large saucepan. Add fried taro. Pour in enough water to cover 3/4 of the mixture. Bring to a boil; reduce heat to medium, cover, and simmer until an instant-read thermometer inserted into the chicken reads at least 165 degrees F (74 degrees C), about 15 minutes. Stir in coconut milk and basil. Season with salt and sugar.",
    "pt": "15 m",
    "ct": "28 m",
    "tt": "58 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}