{
    "id": 246989,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "For the Ribs:",
        "2 tablespoons coriander seeds",
        "2 tablespoons Szechuan peppercorns",
        "1 pound baby back pork ribs",
        "1/4 cup salt",
        "For the Glaze:",
        "3/4 cup palm sugar",
        "1/4 cup water",
        "1 cup sweet soy sauce (Indonesian kecap manis)",
        "1/2 cup lime juice",
        "2 shallots, thinly sliced",
        "2 tablespoons fish sauce",
        "5 cloves garlic, thinly sliced",
        "1/2 cup water to cover",
        "1 small bunch fresh cilantro, chopped"
    ],
    "nut": [
        "Calories > 369 kcal",
        "Carbs > 43.1 g",
        "Cholesterol > 58 mg",
        "Fat > 15.3 g",
        "Protein > 18.1 g",
        "Sodium > 11186 mg"
    ],
    "n": "Soy Sauce and Coriander-Glazed Pork Ribs",
    "a": "Wiley",
    "r": "0",
    "s": 4,
    "des": "\"The pork ribs are slowly cooked until tender and then tossed in a sweet and spiced sauce that will have everyone raving.\"",
    "ins": "Heat a small skillet over medium heat. Add coriander seeds and peppercorns; toast until fragrant, 1 to 2 minutes. Transfer to a spice grinder; pulse until finely ground.\nPlace pork ribs in a shallow baking dish. Rub ground coriander, peppercorns, and salt over the pork. Cover with plastic wrap and let marinate in the refrigerator, 3 hours to overnight.\nCombine palm sugar and 1/4 cup water in a small saucepan over medium heat; cook until sugar dissolves and turns golden brown, 8 to 10 minutes. Immediately stir in sweet soy sauce, lime juice, shallots, fish sauce, and garlic. Simmer until sauce thickens enough to coat the back of a spoon, 5 to 10 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nUncover pork ribs and pour in enough water to almost cover them.\nBake in the preheated even until ribs are tender, 1 to 2 hours. Cut between the bones to separate the individual ribs. Gently toss with glaze and garnish with fresh cilantro.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}