{
    "id": 246950,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds potatoes, peeled and cubed",
        "2 tablespoons kosher salt",
        "2 Hatch chile peppers, halved and seeded, or more to taste",
        "1 teaspoon vegetable oil",
        "1 cup mayonnaise",
        "1/4 cup chopped flat-leaf parsley",
        "2 peperoncini peppers, minced",
        "2 tablespoons prepared mustard",
        "1 tablespoon lemon juice",
        "1 tablespoon pickle relish",
        "1 teaspoon kosher salt",
        "2 ribs celery with leaves, chopped",
        "1/2 red onion, finely chopped",
        "ground black pepper to taste"
    ],
    "nut": [
        "Calories > 413 kcal",
        "Carbs > 33 g",
        "Cholesterol > 14 mg",
        "Fat > 30.3 g",
        "Protein > 4.5 g",
        "Sodium > 2753 mg"
    ],
    "n": "American Hatch Potato Salad",
    "a": "WUSTHOF",
    "r": "0",
    "s": 6,
    "des": "\"An American-style potato salad, with a twist - roasted Hatch chiles!\"",
    "ins": "Place potatoes and 2 tablespoons salt in a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until fork-tender, 6 to 8 minutes. Drain. Transfer to a large bowl and set aside to cool.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.\nPlace chile peppers cut-side down on baking sheet and lightly brush skin with oil.\nBroil in the preheated oven until skin is heavily blistered and turning black, 12 to 15 minutes. Transfer to a bowl and cover tightly with plastic wrap. Allow peppers to steam as they cool, about 15 minutes. Peel and chop the chile peppers.\nWhisk mayonnaise, parsley, peperoncini peppers, mustard, lemon juice, pickle relish, and remaining 1 teaspoon salt in a small bowl to make dressing.\nPour dressing over cooled potatoes. Add chile peppers, celery, and onion; mix to combine. Season salad with black pepper. Chill in the refrigerator before serving, about 30 minutes.",
    "pt": "40 m",
    "ct": "23 m",
    "tt": "1 h ",
    "i": "4526170.jpg",
    "o": "",
    "st": "allrecipes"
}