{
    "id": 246915,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 large potato, cut into 1/2-inch pieces",
        "1 cup frozen peas",
        "2 tablespoons butter",
        "1 pound ground beef sirloin",
        "salt and ground black pepper to taste",
        "1 onion, diced small",
        "2 1/2 cups water, or as needed",
        "3 cubes Japanese curry roux, or more to taste",
        "oil for frying",
        "1 (11 ounce) can refrigerated French bread dough",
        "1 egg",
        "panko bread crumbs"
    ],
    "nut": [
        "Calories > 296 kcal",
        "Carbs > 27.1 g",
        "Cholesterol > 45 mg",
        "Fat > 15.9 g",
        "Protein > 12.1 g",
        "Sodium > 273 mg"
    ],
    "n": "Semi-Homemade Japanese Kare Pan (Curry Bread)",
    "a": "veithk",
    "r": "0",
    "s": 12,
    "des": "\"This is my interpretation of a kind of street food I had when I visited Japan. They are crunchy balls of bread filled with Japanese brown curry. I couldn't get enough of them and neither will you.\"",
    "ins": "Bring a large pot of water to a boil. Add potatoes; cook until mostly tender, about 5 minutes. Add peas; continue cooking until potatoes are soft, 5 to 10 minutes. Drain.\nMelt butter in a large skillet over medium heat. Season ground beef with salt and pepper and add to the skillet with onion; cook and stir until beef is browned and onion is translucent, about 5 minutes.\nPour 2 1/2 cups water over beef mixture; bring to a boil. Reduce heat to medium and stir in potatoes and peas. Simmer, skimming scum off the surface, until flavors combine, about 15 minutes. Remove from heat and let cool, about 5 minutes. Add curry roux cubes; stir until dissolved.\nLet curry mixture cool, about 20 minutes. Cover with plastic wrap and refrigerate until thickened, 8 hours to overnight.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nCut dough into 1/2-inch slices and roll out each slice to a 3-inch circle. Place a teaspoon of chilled curry into the center of each circle. Pull up sides of the circle over curry and pinch edges together to form a round ball.\nBeat egg in a small bowl. Place panko bread crumbs in a shallow dish. Dip each ball of dough into the beaten egg. Press into bread crumbs to coat, shaking off excess.\nFry in the hot oil until evenly browned on all sides, 3 to 5 minutes.",
    "pt": "25 m",
    "ct": "43 m",
    "tt": "9 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}