{
    "id": 246955,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds boneless pork loin",
        "1 onion, finely chopped",
        "1 (12 fluid ounce) can dark ale",
        "1 (8 ounce) can tomato sauce",
        "2 tablespoons chili powder",
        "1 tablespoon ground cumin",
        "6 cups water",
        "2 pounds pumpkin, cut into chunks",
        "1 tablespoon chicken-flavored bouillon powder",
        "1 tablespoon finely chopped pickled jalapeno pepper",
        "1 tablespoon onion powder",
        "1 tablespoon garlic powder",
        "1 cup corn",
        "3/4 cup cooked Great Northern beans",
        "2 tablespoons chopped cilantro, or to taste",
        "ground black pepper to taste"
    ],
    "nut": [
        "Calories > 204 kcal",
        "Carbs > 17.7 g",
        "Cholesterol > 43 mg",
        "Fat > 5.8 g",
        "Protein > 19.1 g",
        "Sodium > 290 mg"
    ],
    "n": "Pumpkin-Pulled Pork Chili",
    "a": "lk2015",
    "r": "0",
    "s": 10,
    "des": "\"A different twist on chili with pureed pumpkin in place of tomato.\"",
    "ins": "Place pork loin and onion in a small pot. Pour dark ale over pork and coat with tomato sauce. Cover with plastic wrap and let marinate in the refrigerator, 8 hours to overnight.\nTransfer pork mixture to a slow cooker. Cook on Low until an instant-read thermometer inserted into the center reads at least 145 degrees F (63 degrees C), about 8 hours.\nTransfer pork from the slow cooker to a cutting board, reserving cooking liquid. Shred the pork using 1 fork to hold the pork and another to shred the meat.\nPlace chili powder and cumin in a large pot over medium heat; toast until fragrant, 1 to 2 minutes. Add water, pumpkin, chicken bouillon, jalapeno pepper, onion powder, and garlic powder. Bring to a simmer and cook until pumpkin softens, about 20 minutes. Puree with an immersion blender until sauce is smooth.\nStir corn, beans, cilantro, and black pepper into the sauce. Add shredded pork and reserved cooking liquid; mix to combine. Cook until flavors are blended and chili reaches desired thickness, about 30 minutes.",
    "pt": "30 m",
    "ct": "8 h ",
    "tt": "17 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}