{
    "id": 247008,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup RiceSelectÂ® Original Couscous",
        "1 cup water",
        "2 teaspoons kosher salt, divided",
        "1 large garlic clove, peeled",
        "1/4 cup packed fresh mint",
        "1/2 cup canned chickpeas, rinsed and drained",
        "2 large eggs, lightly beaten",
        "1 1/2 teaspoons lemon zest",
        "3 tablespoons extra-virgin olive oil, divided"
    ],
    "nut": [
        "Calories > 287 kcal",
        "Carbs > 32.7 g",
        "Cholesterol > 93 mg",
        "Fat > 13.2 g",
        "Protein > 8.9 g",
        "Sodium > 1090 mg"
    ],
    "n": "Garlic Lemon Couscous Cakes",
    "a": "Rice Select",
    "r": "0",
    "s": 4,
    "des": "\"A versatile and delicious side dish, these couscous cakes with mint, lemon, and garlic will surely impress your family and guests.\"",
    "ins": "Combine water and salt in saucepan; bring to a boil. Add couscous; cover and remove from heat. Allow to stand for 5 minutes.\nCoarsely chop the garlic in a food processor. Add the mint and pulse until finely chopped. Add the chickpeas and remaining teaspoon salt and pulse until coarsely chopped.\nUncover the couscous and fluff with a fork.\nIn a large bowl, combine couscous, chickpea mixture, eggs, and lemon zest, mixing until well combined. Press the couscous mixture into a 1/4 measuring cup, smooth the top, and invert the measuring cup to release the cake onto a tray. Repeat with the remaining couscous mixture to make 8-9 cakes.\nRefrigerate for 10-15 minutes to allow the mixture to set.\nHeat 1 1/2 tablespoons oil in a large skillet over medium heat until simmering.\nAdd about 5 of the couscous cakes to the skillet; use a spatula to lightly flatten to about 3/4-inch thickness.\nCook, flipping once, until the patties are crisp and golden brown on both sides, about 3-5 minutes per side. Transfer the cooked patties to a paper and keep warm. Add the remaining 1 1/2 tablespoons olive oil to the skillet and cook the remaining cakes the same way.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "3507106.jpg",
    "o": "",
    "st": "allrecipes"
}