{
    "id": 247050,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon butter, softened",
        "Cake:",
        "1 pound cooked carrots, cut into 1/2-inch pieces",
        "3 cups all-purpose flour",
        "2 1/2 cups white sugar",
        "1 1/2 cups coarsely chopped walnuts",
        "1 (8 ounce) can unsweetened pineapple, drained",
        "1 cup corn oil",
        "4 eggs",
        "1 tablespoon ground cinnamon",
        "1 tablespoon baking soda",
        "1 tablespoon vanilla extract",
        "1 teaspoon salt",
        "Lemon Buttercream:",
        "1 pound cream cheese, at room temperature",
        "1 1/4 cups butter, at room temperature",
        "1 tablespoon lemon juice",
        "2 teaspoons vanilla extract",
        "5 2/3 cups confectioners' sugar"
    ],
    "nut": [
        "Calories > 844 kcal",
        "Carbs > 99.9 g",
        "Cholesterol > 118 mg",
        "Fat > 47.7 g",
        "Protein > 8.3 g",
        "Sodium > 492 mg"
    ],
    "n": "3-Layer Carrot Cake with Lemon Buttercream Frosting",
    "a": "Roland",
    "r": "0",
    "s": 16,
    "des": "\"This is one of my all-time favorite carrot cake recipes. I inherited this recipe from a close friend about 12 years ago and it's still a favorite!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Butter three 9-inch round cake pans. Line bottoms with wax paper; grease wax paper with butter.\nCombine cooked carrots, flour, white sugar, walnuts, pineapple, corn oil, eggs, cinnamon, baking soda, 1 tablespoon vanilla extract, and salt in a large bowl.\nPour carrot mixture into a food processor, and blend, working in batches if necessary, until smooth. Divide batter among prepared cake pans.\nBake cakes in the preheated oven until a toothpick inserted into the centers comes out clean, about 35 minutes. Cool in the pans for 5 minutes before inverting onto wire racks to cool completely, about 1 hour.\nBeat cream cheese, 1 1/4 cup butter, lemon juice, and 2 teaspoons vanilla extract together in a large bowl until smooth. Gradually beat in confectioners' sugar until frosting is smooth.\nPlace 1 cake layer on a serving plate and spread with 1/4 of the frosting. Place a second cake layer on top of the first; spread 1/4 of the frosting on top. Place third cake layer on top; frost top and sides with remaining 1/2 of the frosting.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "2 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}