{
    "id": 247012,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 cups cooked RiceSelectÂ® JasmatiÂ® Rice",
        "2 cups cream",
        "1/2 cup milk",
        "1 (3 inch) piece vanilla bean",
        "1 pinch salt",
        "3 large eggs",
        "3 large egg yolks",
        "3/4 cup sugar, divided",
        "1/2 teaspoon ground cinnamon",
        "Hot water"
    ],
    "nut": [
        "Calories > 575 kcal",
        "Carbs > 59 g",
        "Cholesterol > 306 mg",
        "Fat > 34.4 g",
        "Protein > 9.3 g",
        "Sodium > 105 mg"
    ],
    "n": "Creme Brulee Rice Pudding",
    "a": "Rice Select",
    "r": "0",
    "s": 6,
    "des": "\"Creme brulee meets rice pudding for a dessert combining the best of both worlds.\"",
    "ins": "Preheat oven to 325 degrees F. Grease 6 (4 oz.) ramekins.\nIn saucepan, combine milk and whipping cream. Cut vanilla bean lengthwise and scrape vanilla bean seeds into saucepan; add vanilla beans and salt. Bring to a low boil.\nIn bowl, whisk together eggs, egg yolks, cinnamon, rice, and 1/2 cup sugar.\nRemove vanilla beans from cream mixture. Slowly pour hot cream mixture in a thin stream into the egg/rice mixture, whisking constantly.\nPour or ladle into prepared ramekins; place ramekins on a large baking sheet and place on oven rack; carefully pour enough hot water to reach halfway up the sides of the ramekins. Bake until edges are set and centers are still slightly jiggly when shaken, approximately 25 minutes.\nRemove ramekins from water bath and place on rack to cool for at least 10 minutes.\nCover; chill at least 3 hours. When ready to serve, remove from refrigerator and sprinkle remaining sugar evenly over tops. Broil 5-6 inches from heat until sugar evenly melts and becomes a caramel color.\nRemove from oven and serve immediately. (Sugar may also be browned using a professional culinary torch.)",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "3507119.jpg",
    "o": "",
    "st": "allrecipes"
}