{
    "id": 247054,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crepe Batter:",
        "1 cup rice flour",
        "1/2 teaspoon white sugar",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground turmeric",
        "1 cup coconut milk",
        "1/2 cup water",
        "Filling:",
        "2 tablespoons vegetable oil, divided, or as needed",
        "2 tablespoons minced shallot",
        "2 cloves garlic, minced, or more to taste",
        "3/4 pound fresh shrimp, peeled and deveined",
        "2 tablespoons fish sauce, or more to taste",
        "salt to taste",
        "1 pound mung bean sprouts",
        "4 lettuce leaves, or as needed"
    ],
    "nut": [
        "Calories > 788 kcal",
        "Carbs > 107 g",
        "Cholesterol > 129 mg",
        "Fat > 21.5 g",
        "Protein > 45.2 g",
        "Sodium > 1053 mg"
    ],
    "n": "Banh Xeo (Vietnamese Crepes)",
    "a": "foxyamf",
    "r": "0",
    "s": 4,
    "des": "\"Banh xeo (bahn SAY-oh) is a popular street snack in Vietnam, especially in the south. The name means sound crepe, and refers to the sound the batter makes when it hits the hot skillet. Serve with fresh herbs. The shrimp-studded crepe is rolled up in a leaf of lettuce and dipped in nuoc cham dipping sauce before it gets popped in your mouth.\"",
    "ins": "Mix rice flour, sugar, 1/2 teaspoon salt, and turmeric together in a large bowl. Beat in coconut milk to make a thick batter. Slowly beat in water until batter is the consistency of a thin crepe batter.\nHeat 1 1/2 tablespoon oil in a large skillet over medium-high heat. Add shallot and garlic; cook and stir until fragrant but not browning, 1 to 2 minutes. Add shrimp; saute until cooked through and opaque, 3 to 4 minutes. Season with fish sauce and salt. Transfer filling to a bowl.\nPreheat oven to 200 degrees F (95 degrees C).\nWipe out skillet and reheat over medium heat. Add remaining 1 1/2 teaspoon oil. Stir crepe batter and pour 1/2 cup into the hot skillet, swirling to coat the bottom. Lay 3 or 4 of the cooked shrimp on the bottom half of the crepe. Top with a small handful of bean sprouts. Cook until batter looks set and edges start to brown, about 1 minute. Fold crepe over and slide onto an oven-safe plate.\nPlace crepe in the preheated oven to keep warm. Repeat with remaining batter and filling.\nServe lettuce leaves alongside filled crepes. Break off pieces of crepe and roll up in lettuce leaves to eat.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "25 m",
    "i": "4514531.jpg",
    "o": "",
    "st": "allrecipes"
}