{
    "id": 247098,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 poblano chile pepper, halved lengthwise and seeded",
        "1 serrano chile pepper, halved lengthwise and seeded",
        "1 pound small bay scallops",
        "1/2 cup fresh lime juice",
        "4 tomatoes, diced, or more to taste",
        "1 red onion, chopped",
        "1/2 bunch fresh cilantro, chopped",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 134 kcal",
        "Carbs > 11.8 g",
        "Cholesterol > 46 mg",
        "Fat > 1 g",
        "Protein > 20.5 g",
        "Sodium > 254 mg"
    ],
    "n": "Scallop Ceviche de Gallo",
    "a": "Genevieve Johns Seivert",
    "r": "0",
    "s": 6,
    "des": "\"Delicious and easy ceviche. Always a crowd-pleaser! You can also serve it with tortilla chips as a dip. The action of the acid in the lime juice cooks the scallops, firming the flesh and turning it opaque.\"",
    "ins": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.\nPlace poblano and serrano chile peppers cut-side down on the lined baking sheet.\nRoast under the preheated broiler until the skin of the peppers has blackened and blistered, 5 to 8 minutes. Place blackened peppers into a bowl and tightly seal with plastic wrap. Allow peppers to steam as they cool, about 20 minutes. Remove and discard skins. Finely chop the flesh.\nBring a large pot of water to a boil. Add scallops; cook for 1 minute. Drain and transfer to a glass or ceramic bowl.\nPour lime juice over the scallops. Stir in roasted peppers, tomatoes, onion, cilantro, salt, and black pepper. Cover with plastic wrap and refrigerate ceviche until flavors combine and scallops are opaque, about 2 hours.\nSpoon equal amounts of ceviche into 6 martini or margarita glasses to serve.",
    "pt": "25 m",
    "ct": "16 m",
    "tt": "3 h ",
    "i": "3944122.jpg",
    "o": "",
    "st": "allrecipes"
}