{
    "id": 247074,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package cremini mushrooms",
        "3 tablespoons olive oil, divided",
        "1 teaspoon sea salt",
        "2 cups chopped kale",
        "1 pound bulk Italian sausage",
        "1 teaspoon harissa (optional)",
        "4 slices smoked mozzarella cheese",
        "4 hamburger buns, split and toasted",
        "1/2 cup marinara sauce, warmed"
    ],
    "nut": [
        "Calories > 599 kcal",
        "Carbs > 35.3 g",
        "Cholesterol > 56 mg",
        "Fat > 39.5 g",
        "Protein > 25.8 g",
        "Sodium > 1856 mg"
    ],
    "n": "Spicy Italian Sausage Blended Burger",
    "a": "Leslie Kelly",
    "r": "0",
    "s": 4,
    "des": "\"This crazy flavorful burger gets some good-for-you brownie points for including roasted mushrooms and sauteed kale, a tribute to the Blended Burger Projectâ„¢. This initiative is part of a nationwide effort, spearheaded by the James Beard Foundation, to lighten up burgers without sacrificing juiciness or taste.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace mushrooms in a food processor; pulse until finely chopped. Transfer to a roasting pan. Drizzle 2 tablespoons olive oil on top and mix. Sprinkle with salt.\nBake in the preheated oven until tender, about 10 minutes. Cool to room temperature, about 15 minutes.\nHeat remaining 1 tablespoon olive oil in a large skillet over medium heat. Add kale; cook and stir until just wilted, 2 to 4 minutes. Let cool slightly, about 5 minutes.\nTransfer kale to the food processor; pulse until finely chopped.\nCombine mushrooms, kale, Italian sausage, and harissa in a bowl; mix together by hand. Form into 4 patties, taking care not to pack them too firmly.\nHeat an oven-safe grill pan or cast iron skillet over medium-high heat. Add patties; cook until browned, about 5 minutes. Flip.\nTransfer grill pan to the oven and continue cooking until second side is browned, about 8 minutes. Place a slice of mozzarella cheese on top of each patty and broil until cheese melts, about 1 minute.\nServe patties on toasted buns with marinara sauce.",
    "pt": "20 m",
    "ct": "26 m",
    "tt": "1 h ",
    "i": "3531791.jpg",
    "o": "",
    "st": "allrecipes"
}