{
    "id": 247019,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Tuna:",
        "1 teaspoon finely chopped red onion",
        "1 teaspoon minced red bell pepper",
        "1 tablespoon frozen green peas, thawed",
        "1 teaspoon minced fresh ginger",
        "1 teaspoon grated carrot",
        "Salt and pepper to taste",
        "1 (5 ounce) can Bumble BeeÂ® Solid White Albacore Tuna in Water, drained and chunked",
        "Dressing:",
        "1/2 teaspoon sesame oil",
        "1 tablespoon seasoned rice vinegar",
        "1 teaspoon freshly squeezed lime juice",
        "1/4 teaspoon sriracha chili garlic sauce",
        "1 tablespoon white vinegar",
        "2 large fresh eggs",
        "1 English muffin, split and toasted",
        "Garnish:",
        "Chopped cilantro",
        "Black sesame seeds (optional)"
    ],
    "nut": [
        "Calories > 241 kcal",
        "Carbs > 15.5 g",
        "Cholesterol > 218 mg",
        "Fat > 7.5 g",
        "Protein > 25.8 g",
        "Sodium > 462 mg"
    ],
    "n": "Asian Tuna with Poached Egg",
    "a": "lutzflcat",
    "r": "0",
    "s": 2,
    "des": "\"Who knew that a humble staple like a can of tuna could be transformed into such a snazzy lunch or brunch?  The Asian flavor is subtle, making the fresh albacore tuna the star!\"",
    "ins": "Place the red onion, red bell pepper, peas, ginger, carrots, salt, and pepper in a medium bowl.  Stir together, and then fold in the tuna.\nIn a small bowl, whisk the sesame oil, rice vinegar, lime juice, and Sriracha(R).  Pour over the tuna mixture and toss gently, trying not to break up the tuna.\nAdd a tablespoon of vinegar to a pan of lightly-salted water and bring it to a gentle simmer, not a hard boil (you'll see little bubbles in the pan).  Crack each egg into a ramekin.  Stir the water in a wide circle (like a whirlpool), and then slide in the egg; repeat for the second egg.  Poach the eggs at a simmer for 4-5 minutes for soft yolks.  Remove the poached eggs with a slotted spoon to a paper towel and allow to drain.\nTo serve, top half of an English muffin with half of the tuna mixture, place a poached egg on top, and then sprinkle with the chopped cilantro and black sesame seeds.",
    "pt": "15 m",
    "ct": "5 m",
    "tt": "20 m",
    "i": "3511815.jpg",
    "o": "",
    "st": "allrecipes"
}