{
    "id": 247107,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup black lentils (kaali daal)",
        "1/4 cup split chickpeas (channa daal)",
        "1/4 cup red kidney beans (rajma)",
        "2 teaspoons vegetable oil",
        "1 onion, finely chopped",
        "1 (2 inch) piece ginger, minced",
        "2 cloves garlic, minced",
        "1 teaspoon cumin seeds",
        "2 tomatoes, finely chopped",
        "2 teaspoons ground coriander",
        "1 teaspoon garam masala",
        "1/2 teaspoon red chile powder",
        "1/2 teaspoon ground turmeric",
        "salt to taste",
        "2 teaspoons butter",
        "2 teaspoons yogurt",
        "3 sprigs cilantro leaves"
    ],
    "nut": [
        "Calories > 333 kcal",
        "Carbs > 51.7 g",
        "Cholesterol > 6 mg",
        "Fat > 6.4 g",
        "Protein > 19 g",
        "Sodium > 71 mg"
    ],
    "n": "Makhani Daal (Buttery Lentils)",
    "a": "SavitaJ",
    "r": "0",
    "s": 4,
    "des": "\"This is a typical daal that Punjabis make for their parties! My kids love it! I enjoy it as a soup or with with fresh rotis! You can also serve it with rice. Garnish with fresh cilantro leaves.\"",
    "ins": "Place black lentils, chickpeas, and red kidney beans in a large container and cover with several inches of cool water; let soak, 6 hours to overnight.\nPour lentil mixture and soaking liquid into a pressure cooker. Bring to high pressure according to manufacturer's instructions and cook until soft, about 20 minutes. Remove from heat and release pressure through natural release method according to manufacturer's instructions.\nHeat oil in a large skillet over medium heat. Add onion, ginger, garlic, and cumin seeds; cook and stir until golden brown, about 3 minutes. Add tomatoes; cook and stir until softened, about 2 minutes. Stir in ground coriander, garam masala, red chile powder, turmeric, and salt.\nFold onion mixture into cooked lentil mixture. Add butter, yogurt, and cilantro leaves; stir to incorporate.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "6 h ",
    "i": "3668908.jpg",
    "o": "",
    "st": "allrecipes"
}