{
    "id": 247162,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Marinade:",
        "1/4 cup mirin (Japanese sweet wine)",
        "3 tablespoons soy sauce",
        "3 tablespoons fish sauce",
        "1 tablespoon sriracha sauce, or more to taste",
        "1 tablespoon brown sugar",
        "1 tablespoon minced garlic",
        "1 pound thin-cut boneless pork chops, sliced very thinly",
        "1 tablespoon vegetable oil",
        "Salad:",
        "1 (8 ounce) package rice vermicelli noodles",
        "1 pound cooked and peeled shrimp",
        "1 bunch scallions, thinly sliced",
        "1 head red leaf lettuce, coarsely shredded",
        "1 1/2 cups matchstick-cut carrots",
        "1 cucumber - peeled, seeded, and cut into 1-inch matchsticks",
        "1/2 red bell pepper, cut into 1-inch matchsticks",
        "1 bunch cilantro, stems discarded",
        "Dressing:",
        "1/2 cup bottled Asian sesame dressing",
        "1/3 cup mirin (Japanese sweet wine)",
        "1/4 cup fish sauce",
        "1 tablespoon sriracha sauce, or more to taste",
        "Topping:",
        "3/4 cup salted peanuts"
    ],
    "nut": [
        "Calories > 478 kcal",
        "Carbs > 39.6 g",
        "Cholesterol > 130 mg",
        "Fat > 21.6 g",
        "Protein > 28.1 g",
        "Sodium > 1926 mg"
    ],
    "n": "Craving-Vietnamese Salad",
    "a": "Kathie Carr",
    "r": "0",
    "s": 8,
    "des": "\"I live in rural West Virginia, and when I crave Vietnamese food there is no restaurant to satiate that craving, so I came up with this close simulation of a noodle bowl entree to cure the craving! The spiciness can be varied to suit your diners, but nearly everyone loves this salad. It makes a lot, so is suitable for cookouts or group suppers. Lots of ingredients, but well worth the bother! Folks will rave, so it is worth it.\"",
    "ins": "Combine 1/4 cup mirin, soy sauce, 3 tablespoons fish sauce, 1 tablespoon sriracha sauce, brown sugar, and garlic in a bowl. Stir in pork. Let marinate in the refrigerator, 1 to 4 hours.\nHeat vegetable oil in a large skillet over medium heat. Add pork, discarding marinade; cook and stir until lightly browned, 5 to 10 minutes. Drain excess juices and allow to cool to room temperature, about 15 minutes.\nPlace noodles in a large bowl and cover with boiling water. Let soak until softened, about 5 minutes. Drain and cut into short lengths.\nCombine drained noodles, shrimp, scallions, lettuce, carrots, cucumber, red bell pepper, and cilantro in a large bowl to make salad. Stir in pork.\nMix sesame dressing, 1/3 cup mirin, 1/4 cup fish sauce, and 1 tablespoon sriracha sauce in a bowl to make dressing. Pour over salad and toss until well-mixed.\nGrind peanuts coarsely in a food processor. Sprinkle on top of the salad.",
    "pt": "45 m",
    "ct": "5 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}