{
    "id": 247181,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 medium zucchini, cut lengthwise into 1/2-inch slices",
        "1 medium summer squash, cut lengthwise into 1/2-inch slices",
        "1 sweet onion, sliced",
        "1 red bell pepper, cored and cut into quarters",
        "1 orange or yellow bell pepper, cored and cut into quarters",
        "2 tablespoons vegetable oil",
        "1 medium lime, halved",
        "1 teaspoon ground cumin",
        "1/2 teaspoon chili powder",
        "1/4 teaspoon salt",
        "1/4 teaspoon cayenne pepper",
        "1 ripe avocado, halved and pitted",
        "8 (6 inch) corn or flour tortillas, warmed",
        "1/2 cup crumbled cotija or feta cheese",
        "1 teaspoon Fresh cilantro"
    ],
    "nut": [
        "Calories > 360 kcal",
        "Carbs > 38.2 g",
        "Cholesterol > 17 mg",
        "Fat > 21.1 g",
        "Protein > 9.6 g",
        "Sodium > 372 mg"
    ],
    "n": "Grilled Avocado and Veggie Tacos",
    "a": "Target Test Kitchen",
    "r": "0",
    "s": 4,
    "des": "\"Season fresh veggies with a squeeze of lime and flavorful spices. Then cook them over a fired-up grill to make this delicious, meatless meal-in-one.\"",
    "ins": "Arrange cut vegetables on large rimmed baking pan. Brush both sides with olive oil and squeeze juice of 1/2 lime over vegetables. Combine cumin, chili powder, salt, cayenne and black pepper to taste in small bowl. Sprinkle on veggies.\nHeat grill. Arrange vegetables on oiled grate or in grill pan. Grill 8 to 10 minutes, turning as necessary, until warm and tender, adding avocado halves halfway through, cut-side down.\nChop veggies and slice avocados. Season with salt and pepper, if desired. Serve in warm tortillas with wedges of remaining lime. Top with cheese and garnish with cilantro.\nTIP: To warm tortillas on grill, arrange tortillas in single layer on hot grate. Heat 2 to 3 minutes until warm through and small brown spots appear, turning once or twice.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "3566081.jpg",
    "o": "",
    "st": "allrecipes"
}