{
    "id": 247163,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 slices bacon",
        "Filling:",
        "1/2 (8 ounce) package cream cheese, softened",
        "2 tablespoons butter, at room temperature",
        "2 tablespoons white sugar",
        "4 strawberries, diced, or more to taste",
        "1/2 teaspoon lemon juice",
        "4 slices bread",
        "Egg Wash:",
        "3 eggs",
        "1/2 cup coconut milk",
        "1/2 teaspoon vanilla extract",
        "1 dash ground nutmeg",
        "1 dash salt",
        "2 tablespoons butter",
        "1 sprig mint leaves, slivered"
    ],
    "nut": [
        "Calories > 914 kcal",
        "Carbs > 45.1 g",
        "Cholesterol > 421 mg",
        "Fat > 71.5 g",
        "Protein > 25.9 g",
        "Sodium > 1392 mg"
    ],
    "n": "Bacon-Crusted Fruit-Stuffed French Toast",
    "a": "Kathryn",
    "r": "0",
    "s": 2,
    "des": "\"This tastes like a strawberry croissant. It's crunchy, sweet, and a little salty. I never really cared for French toast until I started playing around and invented this. Serve with your favorite syrup.\"",
    "ins": "Place bacon slices in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Transfer bacon slices to paper towels; dice. Reserve bacon grease.\nBlend cream cheese, 2 tablespoons butter, and sugar in a separate bowl. Fold strawberries and lemon juice into the filling.\nDivide filling between 2 slices of bread, spreading it out to the edges. Cover with remaining 2 slices of bread. Press sandwiches lightly together.\nMix eggs, coconut milk, vanilla extract, ground nutmeg, and salt in a shallow bowl to make egg wash.\nMelt 1 1/2 teaspoon reserved bacon grease and 1 1/2 teaspoon butter in a nonstick skillet over medium heat. Sprinkle half the diced bacon evenly in the skillet. Dip 1 side of each sandwich in the egg wash. Place on top of the bacon in the skillet; cook until eggs are set and slightly browned, about 2 minutes. Transfer to a plate.\nMelt remaining 1 1/2 teaspoon bacon grease and 1 1/2 teaspoon butter in the skillet. Sprinkle remaining diced bacon in the skillet. Dip the second side of each sandwich in egg wash and return to the skillet; cook until lightly browned, 2 to 3 minutes.\nCut sandwiches in half and garnish with mint.",
    "pt": "25 m",
    "ct": "14 m",
    "tt": "39 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}