{
    "id": 247213,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package firm tofu, cut into 3 slices",
        "1 cup low-sodium soy sauce, divided",
        "1 (1 inch) piece ginger, finely grated",
        "1 tablespoon canola oil",
        "1 yellow onion, sliced",
        "1 large green bell pepper, cut into chunks",
        "2 small zucchini, chopped",
        "6 small mushrooms, chopped",
        "3 tablespoons rice wine vinegar",
        "1 tablespoon Asian hot-chile sauce",
        "2 tablespoons crushed roasted peanuts"
    ],
    "nut": [
        "Calories > 213 kcal",
        "Carbs > 18.3 g",
        "Cholesterol > 0 mg",
        "Fat > 10.6 g",
        "Protein > 15.7 g",
        "Sodium > 2184 mg"
    ],
    "n": "Kung Pao Tofu Stir-Fry",
    "a": "SlimCookins",
    "r": "0",
    "s": 4,
    "des": "\"Heard of Kung Pao Chicken? This is its healthier tofu cousin. We enjoyed this over brown rice.\"",
    "ins": "Lay tofu slices on a paper towel-lined plate and cover with more paper towels. Put a heavy object on top to press out excess water, about 15 minutes; drain and discard the accumulated liquid.\nMix 1/2 cup soy sauce and ginger in a large dish. Add tofu slices and let marinate, about 15 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nFlip tofu slices and let marinate on second side, about 15 minutes more. Remove tofu from marinade and place on prepared baking sheet.\nBake in the preheated oven until dry, flipping once halfway through, about 40 minutes. Cut into smaller pieces.\nHeat oil in a wok or large skillet over medium-high heat. Add onion and green bell pepper; cook until onion is slightly translucent, 3 to 5 minutes. Add zucchini and mushrooms; cook and stir until lightly browned, 2 to 3 minutes. Stir in baked tofu.\nMix remaining 1/2 cup soy sauce, rice wine vinegar, and chile sauce in a small bowl. Pour into the wok and stir until onion and tofu mixture is well-coated, about 1 minute. Garnish with roasted peanuts.",
    "pt": "35 m",
    "ct": "46 m",
    "tt": "2 h ",
    "i": "4482056.jpg",
    "o": "",
    "st": "allrecipes"
}