{
    "id": 24722,
    "old_rating": "3.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 jalapeno peppers, seeded and halved",
        "1/2 (8 ounce) package cream cheese, softened",
        "2 eggs, beaten",
        "3/4 teaspoon salt, divided",
        "1 teaspoon vegetable oil",
        "2/3 cup self-rising flour",
        "1/8 teaspoon garlic powder",
        "1/8 teaspoon paprika",
        "onion powder to taste",
        "1/2 cup cornflakes cereal crumbs",
        "1 quart oil for frying"
    ],
    "nut": [
        "Calories > 422 kcal",
        "Carbs > 19.6 g",
        "Cholesterol > 124 mg",
        "Fat > 35.5 g",
        "Protein > 7.7 g",
        "Sodium > 819 mg"
    ],
    "n": "Stuffed Jalapenos II",
    "a": "Jackie Smith",
    "r": "0",
    "s": 4,
    "des": "\"Jalapeno peppers stuffed with cream cheese and coated with a spicy breadcrumb mixture are always a treat. Serve them hot with pepper jelly and sour cream.\"",
    "ins": "Bring a half filled medium saucepan of water to boil. Place jalapeno peppers in the water 10 to 15 minutes, until tender. Drain and cool.\nBlot dry interiors of the jalapeno peppers with a paper towel. Fill each jalapeno pepper half with approximately 1/2 ounce cream cheese. In a small bowl, whisk together eggs, 1/4 teaspoon salt and vegetable oil. In another small bowl, mix remaining salt, flour, garlic powder, paprika and onion powder. Place cornflakes cereal crumbs in a third small bowl. One at a time, dip the jalapeno pepper halves into the egg mixture, the flour mixture, the egg mixture again, and finally the cornflakes cereal crumbs. Place coated peppers in a medium dish. Freeze approximately 2 hours.\nHeat oil in a large, deep skillet over medium high heat. Fry the frozen peppers 3 to 4 minutes each, until dark golden brown. Drain on paper towels and serve.",
    "pt": "30 m",
    "ct": "4 m",
    "tt": "2 h ",
    "i": "3580085.jpg",
    "o": "",
    "st": "allrecipes"
}