{
    "id": 247237,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Chipotle Aioli:",
        "1/2 cup mayonnaise",
        "1 large garlic clove, minced",
        "1 teaspoon chipotle chile powder",
        "1 pinch salt",
        "Burgers:",
        "1 pound ground beef",
        "5 eggs, divided",
        "1/4 cup Italian seasoned bread crumbs",
        "2 garlic cloves, minced",
        "1 teaspoon ground coriander",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon salt",
        "4 slices sharp Cheddar cheese",
        "cooking spray",
        "4 hamburger buns, split",
        "4 lettuce leaves",
        "4 slices red onion, separated into rings",
        "4 tomato slices"
    ],
    "nut": [
        "Calories > 776 kcal",
        "Carbs > 32.1 g",
        "Cholesterol > 344 mg",
        "Fat > 54 g",
        "Protein > 39.7 g",
        "Sodium > 1046 mg"
    ],
    "n": "Sunnyside Burger with Chipotle Aioli",
    "a": "Chef V",
    "r": "0",
    "s": 4,
    "des": "\"The combination of the egg and the aioli makes this burger special. Grab a few napkins, it can get deliciously messy!\n\nWhen assembling the burger I recommend you spread the aioli on the bottom bun so the top bun is available for the egg.\"",
    "ins": "Whisk mayonnaise, 1 large garlic clove, chipotle powder, and pinch of salt together in a small bowl; cover and refrigerate.\nPlace ground beef, 1 egg, seasoned bread crumbs, 2 garlic cloves, coriander, black pepper, and 1/4 teaspoon salt in a bowl; mix with your hands until just combined. Shape beef mixture into 4 patties.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nCook patties on preheated grill until browned on one side, about 6 minutes. Flip patties; continue grilling until no longer pink in the center, about 6 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (71 degrees C). Transfer burgers to a plate; top each burger with a slice of Cheddar cheese and cover plate tightly with foil.\nHeat a nonstick skillet over medium heat; spray with cooking spray. Crack remaining eggs into skillet and immediately reduce the heat to low; season eggs with salt and pepper. Cook eggs until whites are set, about 2 minutes; add 1 tablespoon water to skillet, cover, and cook 1 to 2 minutes more.\nSpread about 1 tablespoon chipotle aioli on bottom of each hamburger bun; top each bun with 1 lettuce leaf, 1 onion slice, 1 tomato slice, and 1 burger. Add one egg to top of each burger; place top of hamburger bun over egg.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "3708420.jpg",
    "o": "",
    "st": "allrecipes"
}