{
    "id": 247254,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons LAND O LAKESÂ® Butter",
        "2 apples - peeled, cored and diced",
        "1/4 cup white sugar, divided",
        "1 pinch salt",
        "Browned Butter:",
        "1/2 cup LAND O LAKESÂ® Butter",
        "Dip:",
        "1/2 cup white sugar",
        "3/4 cup powdered sugar",
        "1 (8 ounce) package cream cheese, softened",
        "2 teaspoons vanilla extract",
        "1/2 teaspoon ground nutmeg",
        "3/4 teaspoon ground cinnamon",
        "Chips:",
        "1 (15 ounce) package pie dough for a double-crust pie"
    ],
    "nut": [
        "Calories > 272 kcal",
        "Carbs > 26 g",
        "Cholesterol > 31 mg",
        "Fat > 18 g",
        "Protein > 2.4 g",
        "Sodium > 223 mg"
    ],
    "n": "Browned Butter Apple Pie Dip",
    "a": "Amy Lawler",
    "r": "0",
    "s": 18,
    "des": "\"This recipes blends the richness of browned butter and fried apples in a rich, dessert dip that captures the tastes of an American favorite. An easy-to-eat finger food that will have your guests coming back for more.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nMelt 2 tablespoons butter in skillet over medium heat. Saute apples until medium-firm, 2 to 3 minutes. Add 1/4 cup white sugar and pinch of salt. Cook until apples begin to brown, 3 to 5 minutes longer. Remove apples from the skillet and allow to cool. Wipe out skillet with a paper towel.\nPlace 1/2 cup of butter in skillet over medium heat. Constantly swirl the butter in the pan, watching carefully so butter does not burn. The butter is \"browned\" when it is a tan color and smells nutty. This can take 3 to 10 minutes. When butter is ready, promptly pour it into a bowl to prevent it from burning.\nAdd 1/2 cup white sugar to the apples and stir until sugar is well incorporated.\nIn a mixing bowl, combine browned butter, powdered sugar, cream cheese, vanilla, nutmeg and cinnamon until well combined. Add apple mixture and stir until well-blended.\nUnroll the pie crust on a silicone mat. Using a small cookie cutter, press out the pie crust \"chips.\" Lift the pie crust up, leaving the \"chips\" on the mat. Place the mat on a baking sheet. The remaining dough may be rolled out to 1/4\" thick and the process repeated to use up all the dough and make more \"chips\" using separate silicone mats (or parchment).\nBake in preheated oven, bake 6-7 minutes, watching carefully to ensure the chips to not burn. Allow the chips to cool. Place on serving plate.\nSpoon the dip into a serving bowl; serve with chips for dipping.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "3586779.jpg",
    "o": "",
    "st": "allrecipes"
}