{
    "id": 247248,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups broccoli",
        "1 tablespoon olive oil",
        "4 skinless, boneless chicken breasts, cut into bite-size pieces",
        "1 onion, thinly sliced",
        "1 (10.75 ounce) can cream of mushroom soup",
        "1 (4.5 ounce) can sliced mushrooms, drained",
        "1 cup milk",
        "2 tablespoons soy sauce"
    ],
    "nut": [
        "Calories > 301 kcal",
        "Carbs > 18.5 g",
        "Cholesterol > 69 mg",
        "Fat > 12.1 g",
        "Protein > 29.8 g",
        "Sodium > 1175 mg"
    ],
    "n": "Woppy Chicken",
    "a": "Allyson",
    "r": "0",
    "s": 4,
    "des": "\"This was a recipe my Dad found for his meal of the month. He cooked it for my mum, my 3- year-old daughter and myself. For some reason, my daughter called my Dad Woppy. We were never sure why. He was s'posed to be Grampy. I didn't think my daughter would touch the meal as she was going though such a fussy eating phase. She surprised us all, especially my Dad, by devouring it, loving it, and naming it Woppy Chicken. 20 years later, Woppy Chicken frequents our table and my Dad is close at heart. Serve over rice or buttered noodles.\"",
    "ins": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add broccoli, cover, and steam until tender, 2 to 6 minutes. Drain.\nHeat olive oil in a large saucepan over medium heat. Cook and stir chicken until no longer pink in the center, about 5 minutes. Add onion; cook and stir until translucent, about 5 minutes. Reduce heat to medium.\nStir broccoli, cream of mushroom soup, and mushrooms into the saucepan. Cook until heated through, about 5 minutes. Add milk and soy sauce; cook until flavors combine, 8 to 10 minutes.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}