{
    "id": 247380,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust and Crumble:",
        "1 1/2 cups all-purpose flour",
        "7 tablespoons vegan butter",
        "1 tablespoon white sugar",
        "1 teaspoon vanilla extract",
        "1 teaspoon cold water",
        "1 teaspoon baking powder",
        "Filling:",
        "3 apples - peeled, cored and chopped",
        "1 pinch ground cinnamon",
        "Foam:",
        "3 1/2 tablespoons aquafaba (chickpea water)",
        "1/2 teaspoon cream of tartar",
        "2 1/2 tablespoons confectioners' sugar"
    ],
    "nut": [
        "Calories > 202 kcal",
        "Carbs > 29.3 g",
        "Cholesterol > 0 mg",
        "Fat > 8.2 g",
        "Protein > 2.6 g",
        "Sodium > 141 mg"
    ],
    "n": "Vegan Apple Pie with Foam",
    "a": "likeatcake",
    "r": "0",
    "s": 8,
    "des": "\"Delicious vegan apple pie with foam. The egg whites are replaced with aquafaba (chickpea water). Serve as a lovely dessert after a nice meal.\"",
    "ins": "Sift flour into a large bowl. Rub in butter with your fingers until mixture resembles fine crumbs. Stir in sugar, vanilla, cold water, and baking powder until a firm dough forms.\nKnead dough gently and briefly on a floured work surface. Wrap in plastic wrap and let chill, about 30 minutes.\nPlace apples in a pot and cover with water. Bring to a boil; reduce heat and simmer gently until soft, 15 to 20 minutes. Drain. Mash with a hand blender or potato masher into a thick puree; let cool.\nPreheat oven to 400 degrees F (200 degrees C). Grease a 9-inch pie plate.\nPress 2/3 of the dough into the pie plate evenly with your fingers to make the crust. Prick crust all over with a fork.\nBake crust in the preheated oven until golden, about 20 minutes.\nGrate remaining 1/3 of the dough onto a baking sheet to make crumbles.\nBake crumbles in the preheated oven until golden, about 10 minutes. Reduce oven temperature to 200 degrees F (95 degrees C).\nPlace aquafaba and cream of tartar in the bowl of a stand mixer fitted with a whisk attachment. Beat on high, gradually adding confectioners' sugar, until meringue is stiff and glossy, 10 to 15 minutes.\nMeasure out 1 1/4 cup apple puree into a bowl. Stir in cinnamon. Spread apple-cinnamon puree over cooled pie crust. Spread meringue over the puree.\nBake pie in the preheated oven until golden, 60 to 90 minutes. Turn off oven; keep pie inside until cooled, 45 minutes to 1 hour.\nScatter baked crumbles on top.",
    "pt": "40 m",
    "ct": "1 h",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}