{
    "id": 247338,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "kosher salt to taste",
        "2 eggplants, cut lengthwise into 1/4-inch slices",
        "1 pinch ground black pepper",
        "4 cups fresh spinach",
        "1/2 onion, chopped",
        "1 clove garlic, minced, or more to taste",
        "1 teaspoon Italian seasoning, or to taste",
        "1 cup grated Parmigiano-Reggiano cheese",
        "1/2 cup ricotta cheese",
        "1 1/2 cups marinara sauce",
        "1 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 369 kcal",
        "Carbs > 36.1 g",
        "Cholesterol > 47 mg",
        "Fat > 15.9 g",
        "Protein > 23.8 g",
        "Sodium > 1034 mg"
    ],
    "n": "Cheesy Eggplant Rollatini",
    "a": "Greg Feldman",
    "r": "0",
    "s": 4,
    "des": "\"Awesome recipe to impress that vegetarian friend or to simply enjoy yourself.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nSprinkle kosher salt over eggplant slices. Let excess moisture drain from eggplant, 10 to 15 minutes. Pat dry with paper towels and transfer to baking sheet.\nBake in the preheated oven until softened, 8 to 10 minutes. Remove from oven and sprinkle with black pepper.\nCombine spinach, onion, and garlic in a saucepan over medium-low heat; cook and stir until spinach is wilted, 3 to 5 minutes. Season with Italian seasoning.\nMix Parmigiano-Reggiano cheese and ricotta cheese together in a bowl. Stir in spinach mixture until well-combined.\nSpread 2 spoonfuls of spinach mixture evenly over each eggplant slice. Roll up eggplant.\nSpread 1/4 cup marinara sauce in the bottom of a 9x13-inch baking dish. Arrange eggplant rolls seam-side down in the dish. Pour remaining marinara sauce over rolls. Cover with mozzarella cheese.\nBake in the preheated oven until bubbly and golden, about 1 hour. Cool for 5 to 10 minutes before serving.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4457840.jpg",
    "o": "",
    "st": "allrecipes"
}