{
    "id": 247363,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds lamb loin chops",
        "2 tablespoons olive oil",
        "3 cloves garlic, minced",
        "1 tablespoon cumin",
        "1 teaspoon mixed herbs - Italian, Greek, or French blend",
        "1/2 teaspoon black pepper",
        "1/2 teaspoon ground coriander",
        "1/4 teaspoon cinnamon",
        "1 pinch cayenne pepper",
        "salt as needed",
        "Sauce:",
        "1/4 cup orange marmalade",
        "1 pinch hot chili flakes",
        "1/2 tablespoon rice vinegar",
        "1 tablespoon chopped fresh mint"
    ],
    "nut": [
        "Calories > 438 kcal",
        "Carbs > 12.4 g",
        "Cholesterol > 108 mg",
        "Fat > 30.6 g",
        "Protein > 27.6 g",
        "Sodium > 126 mg"
    ],
    "n": "Chef John's Grilled Lamb with Mint Orange Sauce",
    "a": "Chef John",
    "r": "0",
    "s": 5,
    "des": "\"Using a blend of Mediterranean herbs and spices and a touch of cinnamon, these tender grilled lamb chops are served with orange and fresh mint sauce.\"",
    "ins": "Place lamb chops in a large bowl. Season with olive oil, garlic, cumin, mixed herbs, pepper, coriander, cinnamon, cayenne, and salt. Toss until well coated with oil and seasonings. Cover and refrigerate. Allow to marinate at least 4 hours.\nPreheat an outdoor grill for high heat and lightly oil the grate. Place lamb chops on grill. Sprinkle the chops with a bit of salt. Grill until seared on the first side, 4 to 7 minutes depending on the size of the chops. Rotate chops a half turn on the grill about a minute before turning them. Turn and grill the other side to desired doneness, another 4 to 7 minutes. For medium rare, an instant-read thermometer inserted into the center should bead 125 to 130 degrees F (54 degrees C). Transfer to a serving dish and tent loosely with foil.\nPlace marmalade in bowl. Add chili flakes, mint, and rice vinegar. Stir together thoroughly.\nBrush the sauce over the chops and serve.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}