{
    "id": 247422,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup coarsely chopped raw pumpkin seeds",
        "1 cup coarsely chopped raw walnuts",
        "1 cup coarsely chopped raw almonds",
        "2/3 cup rolled oats",
        "1/4 cup shredded coconut (optional)",
        "2 tablespoons cacao nibs, or more to taste (optional)",
        "1 tablespoon flaxseed meal, or more to taste (optional)",
        "cooking spray",
        "1 cup chopped dried fruit",
        "1/4 cup mini bittersweet chocolate chips, or to taste (optional)",
        "2 teaspoons cinnamon",
        "2/3 cup brown rice syrup"
    ],
    "nut": [
        "Calories > 250 kcal",
        "Carbs > 26.7 g",
        "Cholesterol > 0 mg",
        "Fat > 14.5 g",
        "Protein > 6.5 g",
        "Sodium > 12 mg"
    ],
    "n": "Chewy Vegan Granola Bars",
    "a": "Alex",
    "r": "0",
    "s": 16,
    "des": "\"I started experimenting with making my own granola bars because the store-bought bars were too sugary. I wanted a mildly sweet, vegan, chewy granola bar that doesn't crumble and this is it! As you can see, the ingredients are flexible to adapt to your taste, and as long as you don't exceed the amounts and press the mixture well into the pan, you'll have a yummy snack that doesn't fall apart! The sweetness comes from the dried fruit and brown rice syrup, which makes this recipe unique among others that use additional brown or white sugar and butter.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nSpread pumpkin seeds, walnuts, almonds, oats, coconut, cacao nibs, and flaxseed meal in a single layer on the baking sheet.\nBake pumpkin seed mixture in the preheated oven until toasted and fragrant, 10 to 12 minutes. Let cool completely, about 15 minutes.\nLower oven temperature 325 degrees F (165 degrees C). Spray a 9x12-inch baking dish with cooking spray and line with parchment paper, leaving an overhang on 2 sides. Spray parchment paper with cooking spray.\nMix cooled pumpkin seed mixture, dried fruit, mini chocolate chips, and cinnamon together in a large bowl. Pour in brown rice syrup; mix well to combine. Pour into the prepared pan and press into an even layer with the back of a spoon or a small piece of parchment paper.\nBake in the preheated oven until lightly browned on the edges, 17 to 20 minutes. Cool on a baking rack for 20 minutes. Slice into bars.",
    "pt": "20 m",
    "ct": "27 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}