{
    "id": 247441,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound small new potatoes, cut into quarters",
        "2 pounds uncooked shrimp, peeled and deveined",
        "1 pound kielbasa sausage, sliced",
        "2 ears corn, cut in half",
        "4 tablespoons unsalted butter",
        "4 tablespoons olive oil",
        "2 tablespoons Worcestershire sauce",
        "2 tablespoons Creole seasoning (such as Tony Chachere'sÂ®)",
        "1 teaspoon fresh cracked black pepper",
        "1 lemon, cut into 4 wedges",
        "Crusty bread",
        "Hot sauce",
        "Reynolds WrapÂ® Heavy Duty Aluminum Foil"
    ],
    "nut": [
        "Calories > 1052 kcal",
        "Carbs > 66.8 g",
        "Cholesterol > 451 mg",
        "Fat > 60.9 g",
        "Protein > 60.6 g",
        "Sodium > 2935 mg"
    ],
    "n": "Grilled Cajun Seafood Boil",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 4,
    "des": "\"Nothing says summertime better than a good old-fashioned seafood boil from Joy Wilson of Joy the Baker. This version removes the boil and takes it straight to the grill, creating personal pouches loaded with shrimp, potatoes, sausage and corn. It's simple and fun for backyard gatherings, and Reynolds WrapÂ® Heavy Duty Foil makes cleanup a breeze!\"",
    "ins": "Heat a grill to about 375 degrees F.\nAdd potato pieces to a large pot of water and bring to a boil. Simmer for 10 minutes, just to jump-start the cooking process. Drain.\nArrange 4 (12x18-inch) sheets of Reynolds Wrap(R) Heavy Duty Aluminum Foil on a clean work surface.\nDivide the shrimp, slightly cooked potatoes, kielbasa and corn atop the 4 pieces of foil, piling in the center. Add 1 tablespoon butter to each pile. Drizzle each with 1 tablespoon olive oil, sprinkle with Worcestershire sauce and sprinkle generously with Creole seasoning. Squeeze a lemon wedge over each pile and add the rind to the mixture. Sprinkle with black pepper.\nWrap each piece of foil into a tightly sealed pouch. Place on the grill. Cover. Allow to cook and steam for 15 to 18 minutes until the shrimp and potatoes are cooked through.\nServe by carefully unwrapping the foil and serving with slices of bread and hot sauce.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "4509492.jpg",
    "o": "",
    "st": "allrecipes"
}