{
    "id": 247453,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound salmon, skinned and deboned",
        "2 lemons, sliced into thin coins",
        "6 wooden skewers (or more as needed), soaked in water",
        "1/4 cup Dijon mustard",
        "2 tablespoons apple cider vinegar",
        "1 tablespoon honey",
        "2 teaspoons Worcestershire sauce",
        "1 teaspoon hot pepper sauce (such as TabascoÂ®)",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 tablespoon extra virgin olive oil",
        "1/2 cup chopped fresh parsley",
        "Reynolds WrapÂ® Non Stick Aluminum Foil"
    ],
    "nut": [
        "Calories > 232 kcal",
        "Carbs > 8.7 g",
        "Cholesterol > 50 mg",
        "Fat > 10.1 g",
        "Protein > 24.5 g",
        "Sodium > 1067 mg"
    ],
    "n": "Hickory Smoked Salmon Skewers",
    "a": "Reynolds Kitchens",
    "r": "0",
    "s": 4,
    "des": "\"These juicy salmon skewers from Lindsey S. Love of Dolly and Oatmeal are marinated in a mustard-based Carolina BBQ glaze and then grilled over hickory wood chips to give the salmon a smoky, full-depth flavor.\"",
    "ins": "Cut the salmon into 2-inch chunks. Fold the lemon coins in half and thread the salmon and lemon onto the soaked skewers, alternating between the salmon and lemon. Place the salmon skewers in a shallow dish and set aside.\nIn a large bowl, whisk together the mustard, vinegar, honey, Worcestershire sauce, hot sauce, salt and pepper to taste. Pour marinade over the skewers, turning to coat, and marinate for 15 to 30 minutes.\nWhile the skewers are marinating, prepare your grill. Cut a large piece of Reynolds Wrap(R) Non-Stick Foil and firmly fit it over the grill grate. Preheat the grill to medium heat. For a charcoal grill, place 4 to 5 hickory wood chunks on top of hot coals and close the grill cover to let the smoke accumulate. For a gas grill, place wood chunks in a smoker box or in a large piece of foil; fold up side to make a packet. Poke holes with a fork and place on the grill. Close the cover to let smoke accumulate.\nOpen the grill and lightly oil the foil.\nCook the salmon skewers for 4 to 5 minutes per side, until fish is opaque in color. Plate the salmon skewers and sprinkle with parsley. Serve hot.",
    "pt": "15 m",
    "ct": "8 m",
    "tt": "23 m",
    "i": "3643445.jpg",
    "o": "",
    "st": "allrecipes"
}