{
    "id": 247462,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups fresh basil leaves",
        "1 cup reduced fat cream of mushroom soup",
        "1 tablespoon grated Parmesan cheese",
        "1 teaspoon olive oil",
        "1/4 teaspoon garlic powder",
        "1 pinch salt and ground black pepper to taste",
        "2 cups fresh spinach",
        "6 sun-dried tomatoes, chopped",
        "2 tablespoons butter",
        "1 cup reduced fat cottage cheese",
        "olive oil cooking spray",
        "1 cup chopped oyster mushrooms",
        "1/2 cup chopped white mushrooms",
        "9 dry lasagna noodles, uncooked",
        "3 cups frozen king prawns",
        "1/2 cup fresh mozzarella cheese, torn into pieces"
    ],
    "nut": [
        "Calories > 395 kcal",
        "Carbs > 48.8 g",
        "Cholesterol > 121 mg",
        "Fat > 10.8 g",
        "Protein > 28.6 g",
        "Sodium > 1110 mg"
    ],
    "n": "Pesto and Prawn Lasagna",
    "a": "Natalie Ercolini",
    "r": "0",
    "s": 6,
    "des": "\"Love prawns and pesto? This lasagna is so easy to make and so tasty! I made it for my boyfriend who wasn't hungry and he had seconds and thirds!\"",
    "ins": "Combine basil, cream of mushroom soup, Parmesan cheese, olive oil, garlic powder, salt, and pepper. Puree with an immersion blender until smooth.\nCombine spinach, sun-dried tomatoes, and butter in a large microwave-safe bowl. Microwave until spinach is wilted, 1 to 2 minutes. Mix in cottage cheese, salt, and pepper.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat a large skillet over high heat. Spray with cooking spray. Add oyster mushrooms and white mushrooms; cook and stir until soft, 5 to 8 minutes.\nSpread about 3 tablespoons basil puree on the bottom of an 8-inch square baking pan. Lay 3 lasagna noodles on top. Spread 1/2 the spinach mixture evenly over the noodles. Arrange 1/2 the prawns on top. Cover with 3 lasagna noodles. Pour 1/2 the basil puree on top and cover with mushroom mixture. Cover with remaining 3 lasagna noodles.\nTop lasagna noodles evenly with remaining spinach mixture and prawns. Pour remaining basil puree on top. Sprinkle mozzarella cheese on top. Cover with aluminum foil.\nBake in the preheated oven until noodles are soft and sauce is bubbly, about 90 minutes. Remove aluminum foil and continue baking until mozzarella is browned, about 30 minutes.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}