{
    "id": 247472,
    "old_rating": "3.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 sheet frozen puff pastry, thawed",
        "1 1/2 cups ricotta cheese",
        "1 1/2 tablespoons ricotta cheese",
        "1/2 cup cubed fresh mozzarella cheese",
        "1 egg",
        "1/4 cup grated Parmesan cheese",
        "1 pinch ground nutmeg",
        "1 sprig fresh thyme, leaves stripped",
        "salt to taste",
        "6 carrots, assorted colors",
        "2 zucchini (courgettes)",
        "2 tablespoons olive oil"
    ],
    "nut": [
        "Calories > 329 kcal",
        "Carbs > 21.9 g",
        "Cholesterol > 47 mg",
        "Fat > 21.9 g",
        "Protein > 11.7 g",
        "Sodium > 248 mg"
    ],
    "n": "Veggie Rose Tart",
    "a": "Magda",
    "r": "0",
    "s": 8,
    "des": "\"This beautiful vegetable tart is elegant, delicious, and easy to make! Fresh carrots and courgettes are rolled into rose shapes and placed in a lovely cheese filling to bake to perfection, all lovingly encased in tasty puff pastry. Serve warm or allow to cool before slicing and serving.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPress puff pastry gently into the bottom and sides of a 9-inch tart tin. Trim off excess pastry and discard. Line pastry with parchment paper and fill with ceramic pie weights or dried beans.\nBake pastry crust in the preheated oven until light golden in color, about 15 minutes. Remove from oven; remove parchment paper and pie weights.\nIncrease oven temperature to 400 degrees F (200 degrees C).\nMix 1 1/2 cup plus 1 1/2 tablespoon ricotta cheese, mozzarella cheese, egg, Parmesan cheese, nutmeg, thyme, and salt together in a bowl. Spoon filling into crust and smooth out the top.\nSlice carrots and zucchini lengthwise into thin strips using a mandoline or vegetable peeler.\nSpread carrots and zucchini strips on a microwave-safe plate; cook in the microwave until slightly soft, 1 to 2 minutes.\nRoll 1 vegetable strip tightly into a rosebud shape. Wrap another strip of the same vegetable around to make a full rose shape. Repeat with remaining strips. Arrange carrot and zucchini roses over the filling in a decorative pattern, alternating colors; brush with olive oil.\nBake tart in the preheated oven until pastry is golden brown, filling is firm, and carrot and zucchini roses are tender, about 40 minutes.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}