{
    "id": 24752,
    "old_rating": "3.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup uncooked long-grain rice",
        "6 large Spanish onions, peeled",
        "1/2 pound spicy ground pork sausage",
        "1/4 cup chopped green bell pepper",
        "1 egg, beaten",
        "1/2 cup soft bread crumbs",
        "1/2 teaspoon dried oregano",
        "2 tablespoons chopped fresh parsley",
        "2 tablespoons butter, melted",
        "1/2 teaspoon paprika"
    ],
    "nut": [
        "Calories > 365 kcal",
        "Carbs > 35 g",
        "Cholesterol > 67 mg",
        "Fat > 20.9 g",
        "Protein > 10.1 g",
        "Sodium > 717 mg"
    ],
    "n": "Baked Stuffed Onions",
    "a": "Kimber",
    "r": "0",
    "s": 6,
    "des": "\"You'll never look at onions the same way again!  This wonderful side dish goes well with beef, pork or chicken, or it can be a geat little meal in itself!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).  Lightly grease a shallow baking dish.\nIn a saucepan bring 1 cup water to a boil.  Add rice and stir. Reduce heat, cover and simmer for 20 minutes.\nSlice tops off of onions.  Bring a large pot of salted water to a boil.  Add onions and cook until tender but still firm, about 15 minutes. Drain, cool and remove centers of onions, leaving shell intact.  Chop centers and reserve 1/2 cup of the chopped flesh.\nPlace sausage in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, reserving drippings, crumble and set aside.\nIn the reserved drippings saute green pepper and reserved 1/2 cup chopped onion until tender.  Combine with sausage, egg, cooked rice, bread crumbs, oregano and parsley.  Spoon mixture into onion shells and place in prepared dish.\nCombine melted butter and paprika; brush or spoon over onions.\nBake in preheated oven, covered, for 15 minutes.  Uncover and bake an additional 5 minutes.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "3536379.jpg",
    "o": "",
    "st": "allrecipes"
}