{
    "id": 247697,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 sheet frozen puff pastry, thawed",
        "2 tablespoons grated Pecorino cheese, divided",
        "3 1/2 ounces Brie cheese, cubed",
        "1 head Romanesco cauliflower, broken into florets",
        "9 ounces mascarpone cheese",
        "3 eggs",
        "1/3 cup milk",
        "1 1/2 tablespoons milk",
        "1 clove garlic, smashed",
        "salt and ground black pepper to taste",
        "1 pinch dried sweet chile pepper (optional)"
    ],
    "nut": [
        "Calories > 397 kcal",
        "Carbs > 18.3 g",
        "Cholesterol > 123 mg",
        "Fat > 31.9 g",
        "Protein > 11.5 g",
        "Sodium > 254 mg"
    ],
    "n": "Torta Salata di Broccolo Romanesco e Mascarpone (Romanesco and Mascarpone Quiche)",
    "a": "ViolaBuitoni",
    "r": "0",
    "s": 8,
    "des": "\"Romanesco, sometimes also known as Romanesco cauliflower or Romanesco broccoli is a beautiful vegetable, bright green in color with a striking pattern. It has also a delicate and nutty taste that you can truly appreciate in this Italian quiche. Serve warm or at room temperature.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour a 9-inch quiche pan.\nLine the bottom and sides of the quiche pan with puff pastry; prick it all over with a fork. Sprinkle 1 tablespoon Pecorino cheese over the pastry and scatter Brie cheese cubes on top. Place in the refrigerator.\nPlace 6 Romanesco florets in a small bowl; reserve. Coarsely chop remaining florets.\nCombine chopped florets, remaining 1 tablespoon Pecorino cheese, mascarpone cheese, eggs, 1/3 cup plus 1 1/2 tablespoon milk, and garlic in a food processor; pulse until grainy. Season with salt, pepper, and chile pepper. Spread over the cheese and pastry.\nBake in the preheated oven until edges are set, about 25 minutes. Remove from oven and arrange reserved Romanesco florets on top, pressing them in lightly into place. Return to the oven and continue baking until center is set, about 25 minutes more. Let cool slightly before serving, about 10 minutes.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}