{
    "id": 24778,
    "old_rating": "4.36717",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 skinless, boneless chicken breast halves",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "1 egg",
        "seasoning salt to taste",
        "1/2 cup all-purpose flour",
        "1/2 cup cornstarch",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon paprika",
        "salt and pepper to taste",
        "oil for frying"
    ],
    "nut": [
        "Calories > 531 kcal",
        "Carbs > 32.5 g",
        "Cholesterol > 121 mg",
        "Fat > 29.3 g",
        "Protein > 32.4 g",
        "Sodium > 596 mg"
    ],
    "n": "Better Than Best Fried Chicken",
    "a": "CANDY WOO LI",
    "r": "0",
    "s": 4,
    "des": "\"Simply delicious fried chicken using, of all things, cream of chicken soup! The other key ingredient is cornstarch. The end result will surprise you. It will be perfect--crispy on the outside, juicy on the inside, and loaded with mouthwatering flavor. This chicken will definitely be requested on a regular basis by family and friends!\"",
    "ins": "In a shallow dish or bowl combine the soup, egg and seasoning salt (be careful, as soup is already salted); mix together. Dip chicken in mixture and turn to coat completely. Set aside.\nIn a resealable plastic bag mix together the flour, cornstarch, garlic powder, paprika, salt and pepper. One at a time, place chicken pieces in bag, seal and shake to coat. Add more flour and/or cornstarch as necessary, but add them in equal parts (there should be an equal amount of each in the mixture).\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). Be sure to use enough oil to cover chicken pieces.\nPlace coated chicken on a platter and allow to sit until it becomes doughy (this is critical, to ensure crispiness when fried). Once chicken is doughy, test oil by dropping a piece of the \"dough\" into it; the oil is ready when it starts to fry immediately.\nFry chicken pieces in oil for about 7 to 10 minutes each, or until cooked through and juices run clear. Drain on paper towels and serve.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "4524270.jpg",
    "o": "4524270.jpg,4486065.jpg,3529480.jpg,3503594.jpg,3087070.jpg,3077596.jpg",
    "st": "allrecipes"
}