{
    "id": 24781,
    "old_rating": "4.25714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "CREPES",
        "1 1/2 cups all-purpose flour",
        "2 1/2 cups milk",
        "3 eggs, beaten",
        "2 tablespoons vegetable oil",
        "1/2 teaspoon salt",
        "FILLING",
        "1/4 cup butter",
        "1 1/4 cups diced celery",
        "1 cup diced onion",
        "2 tablespoons all-purpose flour",
        "1 teaspoon salt",
        "3/4 teaspoon curry powder",
        "1 cup milk",
        "2 cubes chicken bouillon",
        "1/2 cup warm water",
        "3/4 cup sliced black olives",
        "2 1/2 cups cooked, diced chicken breast meat",
        "1/4 cup freshly grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 430 kcal",
        "Carbs > 32 g",
        "Cholesterol > 155 mg",
        "Fat > 21.2 g",
        "Protein > 27.1 g",
        "Sodium > 1185 mg"
    ],
    "n": "Olive and Chicken Curry Crepes",
    "a": "LEAH DRISCOLL",
    "r": "0",
    "s": 7,
    "des": "\"This is in my top five favorite meals of all time. This is the meal I would serve if a French chef was coming to dinner. A very flavorful main dish that your taste buds will be amazed at!\"",
    "ins": "To Make Crepes: In a medium bowl combine the flour, milk, eggs, oil and salt and beat together for 1 minute, until you have a smooth, thin batter.\nHeat a lightly greased medium skillet over medium heat, pouring in a thin layer of crepe batter that covers bottom of pan. Brown on one side only, repeating until all of the batter is used. Set crepes aside.\nTo Make Filling: Melt butter in a large skillet over medium heat and saute celery and onion until just barely tender. Stir in flour, salt and curry, blending well. Dissolve bouillon in water, then pour milk and bouillon mixture into skillet, stirring until well mixed and thickened. Add olives and chicken and mix all together.\nPreheat oven to 400 degrees F (200 degrees C).\nSpoon some of the filling mixture onto the center of each crepe, leaving enough room to fold edges burrito-style. Fold up crepes and place in a lightly greased 9x13 inch baking dish. Sprinkle with cheese.\nBake in preheated oven for about 12 minutes, or until cheese is melted.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "775356.jpg",
    "o": "",
    "st": "allrecipes"
}