{
    "id": 24793,
    "old_rating": "4.22839",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 skinless, boneless chicken breast halves",
        "2 cups fresh lemon juice",
        "1 cup all-purpose flour",
        "1 1/2 teaspoons salt",
        "2 teaspoons paprika",
        "1 teaspoon ground black pepper",
        "1/2 cup vegetable oil",
        "1/3 cup light brown sugar",
        "1/4 cup chicken broth",
        "6 slices lemon",
        "1/2 cup finely minced fresh parsley"
    ],
    "nut": [
        "Calories > 441 kcal",
        "Carbs > 37.3 g",
        "Cholesterol > 68 mg",
        "Fat > 20 g",
        "Protein > 30.2 g",
        "Sodium > 666 mg"
    ],
    "n": "Lemon Chicken III",
    "a": "Megan Henry",
    "r": "0",
    "s": 6,
    "des": "\"Chicken breasts marinated in lemon juice, then coated in seasoned flour and fried, and finally baked in chicken broth with brown sugar, fresh parsley and lemon slices. This is the best lemon chicken you will ever taste! It is very good for making for a family dinner.\"",
    "ins": "To Marinate: Combine chicken and lemon juice in a large resealable plastic bag. Squeeze out air and seal bag. Refrigerate to marinate overnight, turning once.\nRemove chicken from marinade, reserving 2 tablespoons marinade and disposing of the remainder. Mix together flour, salt, paprika and pepper in a large resealable plastic bag. Add chicken breasts one at a time, seal bag and shake to coat evenly.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat oil in a large skillet over medium high heat. Fry coated chicken until well browned, about 10 to 15 minutes. Arrange browned chicken in a 9x13 inch baking dish and sprinkle with brown sugar. Mix broth with reserved marinade and pour mixture over chicken. Top each breast with a lemon slice and sprinkle all with parsley.\nBake in the preheated oven for about 20 to 30 minutes, or until cooked through (juices run clear) and tender.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "12 h",
    "i": "1098080.jpg",
    "o": "1081708.jpg,1068881.jpg,226709.jpg,180376.jpg,37371.jpg,31066.jpg",
    "st": "allrecipes"
}