{
    "id": 24871,
    "old_rating": "4.50224",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 large potatoes, peeled",
        "1 cup frozen peas, thawed",
        "2 tablespoons vegetable oil",
        "1/2 teaspoon cumin seeds",
        "1 bay leaf, crushed",
        "2 large onions, finely chopped",
        "1 pound ground beef",
        "4 cloves garlic, crushed",
        "1 tablespoon minced fresh ginger root",
        "1/2 teaspoon ground black pepper",
        "1 1/2 teaspoons salt",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander",
        "1 teaspoon ground turmeric",
        "1 teaspoon chili powder",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground cardamom",
        "2 tablespoons chopped fresh cilantro",
        "2 tablespoons chopped green chile peppers",
        "1 quart oil for deep frying",
        "1 (16 ounce) package phyllo dough"
    ],
    "nut": [
        "Calories > 258 kcal",
        "Carbs > 23.8 g",
        "Cholesterol > 21 mg",
        "Fat > 14.8 g",
        "Protein > 7.6 g",
        "Sodium > 346 mg"
    ],
    "n": "Beef Samosas",
    "a": "sassyangelkiwi Donna-Maree Aus",
    "r": "0",
    "s": 18,
    "des": "\"Beef and potatoes are the main ingredients folded inside these wonderful deep fried samosas. Chicken livers may be substituted for beef, if you choose. My friend from Bangladesh gave me this savory, spicy recipe. You just can't buy better in the shops.\"",
    "ins": "Bring a medium saucepan of lightly salted water to a boil.  Stir in potatoes and peas. Cook until potatoes are tender but still firm, about 15 minutes. Drain, mash together and set aside.\nIn a large saucepan over medium high heat, heat the oil. Brown cumin seeds and bay leaf. Mix in onions and ground beef. Cook until beef is evenly brown and onions are soft, about 5 minutes. Mix in garlic, fresh ginger root. Season with black pepper, salt, cumin, coriander, turmeric, chili powder, cinnamon and cardamom. Stir in the mashed potato mixture. Remove from heat and chill in the refrigerator for 1 hour, or until cool.\nHeat oil in a large, heavy saucepan over high heat.\nMix cilantro and green chile peppers into the potato and beef mixture. Place approximately 1 tablespoon of the mixture onto each phyllo sheet. Fold sheets into triangles, pressing edges together with moistened fingers.\nIn small batches, fry until golden brown, about 3 minutes. Drain on paper towels and serve warm.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "609167.jpg",
    "o": "4521987.jpg,4471304.jpg,2422678.jpg,2117007.jpg,1473261.jpg,1375377.jpg",
    "st": "allrecipes"
}