{
    "id": 24884,
    "old_rating": "4.38028",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups fresh orange juice",
        "2 tablespoons red wine vinegar",
        "2 tablespoons finely chopped red onion",
        "1 tablespoon white sugar",
        "1 tablespoon white wine",
        "salt and pepper to taste",
        "3/4 cup extra virgin olive oil",
        "1 tablespoon butter",
        "2 pears - peeled, cored and cut into wedges",
        "1 cup walnut halves",
        "1/2 cup white sugar",
        "1/4 cup water",
        "1/4 pound prosciutto, cut into thin strips",
        "2 romaine hearts, rinsed and torn"
    ],
    "nut": [
        "Calories > 600 kcal",
        "Carbs > 39.9 g",
        "Cholesterol > 22 mg",
        "Fat > 47.1 g",
        "Protein > 7.4 g",
        "Sodium > 384 mg"
    ],
    "n": "Salad with Prosciutto and Caramelized Pears and Walnuts",
    "a": "Megs",
    "r": "0",
    "s": 6,
    "des": "\"An amazing salad that blends different flavors to impress your guests. The salad dressing is an orange vinaigrette. Try to use Asian pears in this salad, as they are best for flavor. But if you can't find Asian pears in your area, you can substitute Bosc or Anjou.\"",
    "ins": "In a medium saucepan, heat orange juice over medium-high heat, whisking often, until it is reduced by 1/4.\nAdd to a blender, along with the vinegar, onion, sugar, wine, salt and pepper, and process until smooth.  Then, while blending on a low speed, remove cap and slowly drizzle in the olive oil to emulsify (thicken) the dressing.  Chill until ready to use.\nMelt butter in a non-stick skillet over medium heat.  Saute pears and nuts in butter for 3 minutes.  Add sugar and water and cook, stirring constantly, until golden brown and caramelized.  Remove from heat and set aside to cool.\nIn a large bowl, combine prosciutto, lettuce and the pear and walnut mixture.  Add vinaigrette and toss to coat.  Serve on a large Italian platter.  Enjoy!",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "40 m",
    "i": "122436.jpg",
    "o": "",
    "st": "allrecipes"
}