{
    "id": 24898,
    "old_rating": "4.41379",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups grated Parmesan cheese",
        "3 eggs, beaten",
        "1 1/2 cups Italian-style seasoned bread crumbs",
        "3 tablespoons vegetable oil",
        "4 skinless, boneless chicken breast halves",
        "2 cups white Zinfandel wine",
        "2 cups sliced fresh mushrooms",
        "3 cups shredded Monterey Jack cheese"
    ],
    "nut": [
        "Calories > 977 kcal",
        "Carbs > 34.6 g",
        "Cholesterol > 310 mg",
        "Fat > 52 g",
        "Protein > 71 g",
        "Sodium > 1695 mg"
    ],
    "n": "Chicken Supreme IV",
    "a": "CHRSTIE",
    "r": "0",
    "s": 4,
    "des": "\"Breaded chicken breasts are sauteed until golden, then baked with Jack cheese, mushrooms, and a white wine sauce. This delicious chicken dish was taught to me by my mother. It calls for white Zinfandel wine, and has an amazing flavor. It is guaranteed to be one of your favorites, too. This dish goes well with asparagus, and some kind of pasta side (we like to make angel hair pasta with garlic herb butter). Enjoy!!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a medium baking dish.\nPlace Parmesan cheese, eggs, and bread crumbs in three separate small bowls. Heat the oil in a large skillet over medium-high heat. Dip each piece of chicken into the Parmesan cheese, then into the egg, then into the bread crumbs. Brown the chicken on both sides in the hot skillet, and then transfer them to the prepared baking dish.\nPour wine into skillet, and scrape up the browned bits. Add mushrooms and cook for 5 minutes, or until tender. Top each chicken breast with even amounts of Monterey Jack cheese, then spoon mushrooms over the cheese. Pour the remaining wine from the skillet over all. Cover dish with aluminum foil.\nBake 30 to 35 minutes in the preheated oven, or until chicken is no longer pink and juices run clear.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "796547.jpg",
    "o": "",
    "st": "allrecipes"
}