{
    "id": 24904,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound spicy ground pork sausage",
        "1 onion, diced",
        "1 (2 ounce) package dried beef, shredded",
        "1 (16 ounce) can sauerkraut, drained and minced",
        "1 teaspoon prepared mustard",
        "1 tablespoon dried parsley",
        "1 (8 ounce) package cream cheese, softened",
        "1 teaspoon garlic salt",
        "2 quarts oil for frying",
        "1 1/2 cups all-purpose flour",
        "1 1/4 cups milk",
        "1 egg, lightly beaten",
        "2 cups seasoned bread crumbs"
    ],
    "nut": [
        "Calories > 419 kcal",
        "Carbs > 24.3 g",
        "Cholesterol > 55 mg",
        "Fat > 31 g",
        "Protein > 11 g",
        "Sodium > 977 mg"
    ],
    "n": "Sauerkraut Sausage Balls",
    "a": "GEORGE SONTAG",
    "r": "0",
    "s": 15,
    "des": "\"This is a delightful appetizer that can be made ahead of time and heated when guests arrive. Spicy pork sausage and beef will never know what hit them when you blend them with sauerkraut and a cream cheese mixture, then deep fry them to mouthwatering golden perfection.\"",
    "ins": "Place spicy ground pork sausage, onion and dried beef in a large, deep skillet. Cook over medium high heat until sausage is evenly brown and onions are soft, about 10 minutes. Drain and transfer to a large bowl.\nMix sauerkraut, prepared mustard, parsley, cream cheese and garlic salt with the sausage mixture. Cover and chill in the refrigerator approximately 2 hours.\nHeat oil in deep-fryer to 375 degrees F (190 degrees C).\nPlace flour in a small bowl. Blend milk and egg together in another small bowl. Place seasoned bread crumbs in a medium bowl.\nRoll the chilled sausage mixture into 1 inch balls. Dredge sausage balls one at a time in flour, the egg and milk mixture and the bread crumbs.\nIn small batches deep fry sausage balls in the preheated oil until golden brown, about 3 minutes. Drain on paper towels and serve warm, or freeze for later use.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "1973243.jpg",
    "o": "",
    "st": "allrecipes"
}