{
    "id": 24911,
    "old_rating": "3.91667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 quart oil for frying",
        "2 tablespoons vegetable oil",
        "1/3 cup shredded cabbage",
        "1/4 cup shredded carrots",
        "1/4 cup shredded cucumber",
        "2 tablespoons diced onion",
        "1/4 cup diced green onion",
        "2 tablespoons finely chopped shiitake mushrooms",
        "1/3 cup sun-dried tomatoes, chopped",
        "salt and pepper to taste",
        "2 ounces boneless chicken breast halves, cooked and diced",
        "1 ounce cooked crabmeat, diced",
        "1 teaspoon Chinese five-spice powder",
        "1 avocado - peeled, pitted and diced",
        "1 teaspoon lemon juice",
        "8 spring roll wrappers"
    ],
    "nut": [
        "Calories > 208 kcal",
        "Carbs > 7.3 g",
        "Cholesterol > 8 mg",
        "Fat > 18.8 g",
        "Protein > 4 g",
        "Sodium > 71 mg"
    ],
    "n": "Avocado and Sun-Dried Tomato Spring Rolls",
    "a": "S. F. Ong",
    "r": "0",
    "s": 8,
    "des": "\"Avocado and sun-dried tomatoes are like secret treasures sealed inside these marvelous spring rolls along with other vegetables, crabmeat and chicken. This recipe is particularly exciting, because the ingredients may be adjusted or altered to taste. You may want to prepare several batches of spring rolls -- they'll go fast.\"",
    "ins": "Heat 1 quart oil in a wok over medium high heat.\nHeat 2 tablespoons oil in a medium saucepan over medium heat. Stir in cabbage, carrots, cucumber, onion, green onion, shiitake mushrooms, sun-dried tomatoes, salt and pepper. Slowly cook and stir until all vegetables are tender, about 10 minutes.\nStir chicken, crabmeat and Chinese five-spice powder into the cabbage mixture. Sprinkle avocado with lemon juice, then stir it into the mixture. Remove from heat.\nPlace approximately 1 teaspoon of the cabbage and chicken mixture in the center of spring roll wrappers. Fold wrappers, and seal the edges with moistened fingers.\nCarefully lower spring rolls into the heated quart of oil. Deep fry approximately 3 minutes, or until golden brown. Drain on paper towels. Cut in half to serve.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "3710640.jpg",
    "o": "",
    "st": "allrecipes"
}