{
    "id": 24955,
    "old_rating": "4.73333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 cups white sugar, divided",
        "2 cups heavy cream",
        "1/2 teaspoon baking soda",
        "1/2 cup butter",
        "1 teaspoon vanilla extract",
        "2 pounds pecan halves or pieces"
    ],
    "nut": [
        "Calories > 114 kcal",
        "Carbs > 11.4 g",
        "Cholesterol > 8 mg",
        "Fat > 7.9 g",
        "Protein > 0.8 g",
        "Sodium > 13 mg"
    ],
    "n": "Aunt Bill's Brown Candy",
    "a": "Karen Rodgers",
    "r": "0",
    "s": 117,
    "des": "\"Very rich candy, but it's a great keeper.  Can be a family candy-making event!  You many need a helper to take turns with beating. \"",
    "ins": "Butter a 9x13 inch dish and a medium, heavy saucepan.\nIn the buttered saucepan, combine 4 cups sugar and the cream.  Have ready.\nIn a large heavy skillet over medium heat, pour the remaining 2 cups sugar.  Cook, stirring constantly, until sugar begins to melt.  Place the saucepan over low heat, stirring occasionally.  Continue to cook and stir the sugar in the skillet until it is completely melted and light brown.  Pour the melted sugar very slowly, in a thin stream, into the lightly simmering cream, stirring constantly (This step may take five minutes, and works best if someone strong pours the melted sugar v-e-r-y s-l-o-w-l-y.)\nHeat now, without stirring, to 242 to 248 degrees F (116 to 120 degrees C), or until a small amount of syrup dropped into cold water forms a firm but pliable ball.  Remove from heat and stir in baking soda (mixture will foam).  Drop the butter into the foaming mixture and let rest without stirring 30 minutes.\nStir in the vanilla with a wooden spoon and continue to stir vigorously until mixture loses its gloss, 10 to 15 minutes.  Then fold in pecans and quickly turn candy into the prepared 9x13 inch dish.  Let cool until just warm and cut in 1 inch pieces.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "2 h",
    "i": "4261519.jpg",
    "o": "",
    "st": "allrecipes"
}