{
    "id": 24989,
    "old_rating": "3.93617",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 (1 ounce) squares white chocolate, chopped",
        "2 1/4 cups all-purpose flour",
        "1 1/2 cups white sugar",
        "2 1/4 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 2/3 cups heavy cream",
        "3 eggs",
        "1 teaspoon almond extract",
        "3 (1 ounce) squares white chocolate, chopped",
        "3 1/2 cups confectioners' sugar",
        "1/4 cup butter, softened",
        "4 tablespoons water",
        "1/2 teaspoon almond extract"
    ],
    "nut": [
        "Calories > 851 kcal",
        "Carbs > 133.2 g",
        "Cholesterol > 157 mg",
        "Fat > 33.1 g",
        "Protein > 8.3 g",
        "Sodium > 353 mg"
    ],
    "n": "White Chocolate Cream Cake",
    "a": "MCLISA",
    "r": "0",
    "s": 8,
    "des": "\"The cake layers are made with white chocolate and whipped cream and flavored with almond extract. The frosting is a white chocolate buttercream. For an exquisite change of pace, substitute raspberry wine cooler for the water in the frosting.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 - (8 or 9 inch) round pans.\nIn a double boiler, over lightly simmering water, melt 3 ounces white chocolate, stirring occasionally, until melted; set aside and cool to lukewarm. In a small bowl, mix flour, sugar, baking powder and salt; set aside. In a large chilled bowl, whip heavy cream until stiff peaks form; set aside.\nIn a large bowl, beat eggs or about 5 minutes, or until light and lemon colored. Beat in 1 teaspoon almond flavoring and melted white chocolate. Fold in whipped cream. Fold in flour mixture, about 1/2 cup at a time. Pour batter into prepared pans.\nBake in the preheated oven for 35 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\nTo make White Chocolate Frosting:  In a large bowl, heat 3 ounces white baking chocolate over low heat, stirring occasionally, until melted; cool to lukewarm. In a medium bowl on medium speed, combine melted white chocolate, confectioners' sugar, butter, water and 1/2 teaspoon almond extract. Beat until smooth and of spreading consistency.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "949064.jpg",
    "o": "3626357.jpg,809769.jpg,809744.jpg,775708.jpg,631677.jpg,148810.jpg",
    "st": "allrecipes"
}