{
    "id": 25001,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups graham cracker crumbs",
        "1 1/2 teaspoons ground cinnamon",
        "3/4 cup butter, melted",
        "1/2 cup all-purpose flour",
        "7 cups small curd cottage cheese",
        "6 eggs",
        "1 1/2 cups white sugar",
        "1/4 teaspoon salt",
        "1 tablespoon grated lemon zest",
        "3 tablespoons lemon juice",
        "1 teaspoon vanilla extract",
        "3 cups whipped heavy cream"
    ],
    "nut": [
        "Calories > 415 kcal",
        "Carbs > 33.7 g",
        "Cholesterol > 138 mg",
        "Fat > 24.3 g",
        "Protein > 16.4 g",
        "Sodium > 595 mg"
    ],
    "n": "Old Fashioned German Cheesecake",
    "a": "LINDASLUSCIOUSPIES",
    "r": "0",
    "s": 16,
    "des": "\"My husband is a Chef and his father before him and they're from Germany and that's where this recipe came from. I hope it is to your husband's satisfaction. Great Baking!\"",
    "ins": "In a large bowl, mix graham cracker crumbs, cinnamon and butter until smooth. Measure 1 cup crumb mixture and set aside. Press remaining mixture on bottom and sides of a 12 inch springform pan. Chill for 1 hour in refrigerator or 1/2 hour in freezer. Preheat oven to 350 degrees F (175 degrees C).\nMix together cottage cheese and flour. Push through a sieve into a large bowl and set aside. In a medium bowl, beat eggs until frothy. Add sugar, gradually to eggs, beat until light and fluffy. Add salt, lemon juice, lemon peel and vanilla until smooth. Fold in whipped cream. Fold into cheese mixture until no streaks remain. Fill shell with cheese mixture. Sprinkle remaining crumbs evenly over top of cheese cake.\nBake in preheated oven for 60 minutes. Turn off oven and let cheese cake sit in oven for 1/2 hour or longer, until it is cooled. Chill in refrigerator.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}