{
    "id": 25065,
    "old_rating": "4.49194",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup butter flavored shortening",
        "1 cup white sugar",
        "2 eggs",
        "1 tablespoon milk",
        "1 teaspoon vanilla extract",
        "2 1/2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon salt",
        "1 tablespoon butter",
        "1 teaspoon vanilla extract",
        "2 1/2 cups confectioners' sugar",
        "3 tablespoons milk",
        "2 drops any color food coloring"
    ],
    "nut": [
        "Calories > 133 kcal",
        "Carbs > 20.6 g",
        "Cholesterol > 11 mg",
        "Fat > 5.2 g",
        "Protein > 1.3 g",
        "Sodium > 82 mg"
    ],
    "n": "Delilah's Frosted Cut-Out Sugar Cookies",
    "a": "Delilah Lopez",
    "r": "0",
    "s": 36,
    "des": "\"My Family just loves this sugar cookie recipe. The hardened frosting adds a special touch!\"",
    "ins": "In a large bowl, cream together the shortening and white sugar until smooth. Beat in the eggs one at a time, then stir in the milk and 1 teaspoon vanilla. Combine the flour, baking powder, and salt; stir into the creamed mixture. Cover dough, and chill for at least one hour.\nPreheat the oven to 400 degrees F (200 degrees C). Lightly grease cookie sheets, or line with parchment paper. On a lightly floured surface, roll out the dough to 1/4 inch in thickness. Cut into desired shapes with cookie cutters. Place cookies 1 1/2 inches apart onto cookie sheets.\nBake for 6 to 8 minutes in the preheated oven. Remove cookies from baking sheets to cool on wire racks. Cool completely before frosting.\nIn a small bowl, beat the butter, 1 teaspoon vanilla and confectioners' sugar until smooth. Mix in the milk one tablespoon at a time until a good spreading consistency is reached. Stir in food coloring to desired shade. Decorate cooled cookies, and set on waxed paper to harden.",
    "pt": "10 m",
    "ct": "8 m",
    "tt": "18 m",
    "i": "4115144.jpg",
    "o": "4304339.jpg,3407386.jpg,2959159.jpg,2932824.jpg,2803085.jpg,2192600.jpg",
    "st": "allrecipes"
}