{
    "id": 25095,
    "old_rating": "4.61265",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter, softened",
        "1/4 cup white sugar",
        "5 tablespoons unsweetened cocoa powder",
        "1 egg, beaten",
        "1 3/4 cups graham cracker crumbs",
        "1 cup flaked coconut",
        "1/2 cup finely chopped almonds (optional)",
        "1/2 cup butter, softened",
        "3 tablespoons heavy cream",
        "2 tablespoons custard powder",
        "2 cups confectioners' sugar",
        "4 (1 ounce) squares semisweet baking chocolate",
        "2 teaspoons butter"
    ],
    "nut": [
        "Calories > 311 kcal",
        "Carbs > 34.1 g",
        "Cholesterol > 47 mg",
        "Fat > 19.6 g",
        "Protein > 2.8 g",
        "Sodium > 160 mg"
    ],
    "n": "Nanaimo Bars III",
    "a": "MARTHA J PAUL",
    "r": "0",
    "s": 16,
    "des": "\"Because it's three layers, this sounds hard but it's worth it.  My son is famous for making and taking these in to work.  I've heard other names but here in the Northwest everyone knows them as Nanaimo bars. They are sold on British Columbia Ferries and at coffee stands. If you can't find custard powder, I've used instant pudding mix with good results.\"",
    "ins": "In the top of a double boiler, combine 1/2 cup butter, white sugar and cocoa powder. Stir occasionally until melted and smooth. Beat in the egg, stirring until thick, 2 to 3 minutes. Remove from heat and mix in the graham cracker crumbs, coconut and almonds (if you like). Press into the bottom of an ungreased 8x8 inch pan.\nFor the middle layer, cream together 1/2 cup butter, heavy cream and custard powder until light and fluffy. Mix in the confectioners' sugar until smooth. Spread over the bottom layer in the pan. Chill to set.\nWhile the second layer is chilling, melt the semisweet chocolate and 2 teaspoons butter together in the microwave or over low heat. Spread over the chilled bars. Let the chocolate set before cutting into squares.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "4460593.jpg",
    "o": "4460593.jpg,4366830.jpg,4326035.jpg,4197115.jpg,3874560.jpg,3872993.jpg",
    "st": "allrecipes"
}