{
    "id": 25106,
    "old_rating": "4.32",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "1 cup white sugar",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground mace",
        "1 cup butter, softened",
        "1 egg, beaten",
        "1 teaspoon vanilla extract",
        "3 tablespoons heavy cream",
        "1 cup confectioners' sugar",
        "1/2 teaspoon vanilla extract",
        "1 1/2 tablespoons heavy cream",
        "1 pinch salt"
    ],
    "nut": [
        "Calories > 54 kcal",
        "Carbs > 7.3 g",
        "Cholesterol > 9 mg",
        "Fat > 2.6 g",
        "Protein > 0.6 g",
        "Sodium > 37 mg"
    ],
    "n": "Old Fashioned Sugar Cookies II",
    "a": "M.FLORES",
    "r": "0",
    "s": 84,
    "des": "\"My friend, Gloria gave me this recipe...she makes these cookies every year for her Christmas family get-togethers.  I wanted to save this recipe to my Recipe Box. Nutmeg can be used in place of mace.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, stir together the flour, sugar, baking powder, salt and mace. Cut in the butter using a pastry blender or rub between your fingers. When butter pieces are no larger than pea size, stir in the egg, vanilla and heavy cream. Blend thoroughly. On a lightly floured surface, roll the dough out to 1/8 inch in thickness. Cut into desired shapes with cookie cutters. Place cookies 1 1/2 inches apart onto cookie sheets.\nBake for 5 to 8 minutes in the preheated oven, until the edges begin to brown. Remove from baking sheets to cool on wire racks. Cool completely before frosting.\nTo make the frosting: In a medium bowl, beat the confectioners' sugar, 1/2 teaspoon vanilla, 1 1/2 tablespoons of cream and salt until smooth and creamy. Spread on top of cooled cookies. Let the frosting dry before storing or serving.",
    "pt": "15 m",
    "ct": "5 m",
    "tt": "45 m",
    "i": "692677.jpg",
    "o": "",
    "st": "allrecipes"
}