{
    "id": 25111,
    "old_rating": "4.35821",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups white sugar",
        "3 eggs",
        "1 cup butter, melted",
        "2 1/2 teaspoons vanilla extract",
        "1 1/4 cups all-purpose flour",
        "3/4 cup unsweetened cocoa powder",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1 cup milk chocolate chips",
        "2 (8 ounce) packages cream cheese, softened",
        "3/4 cup creamy peanut butter",
        "1/4 cup white sugar",
        "1 egg",
        "2 tablespoons milk"
    ],
    "nut": [
        "Calories > 223 kcal",
        "Carbs > 21.1 g",
        "Cholesterol > 50 mg",
        "Fat > 14.6 g",
        "Protein > 4.2 g",
        "Sodium > 135 mg"
    ],
    "n": "Peanut Butter Brownies II",
    "a": "Tara",
    "r": "0",
    "s": 36,
    "des": "\"These brownies bake up gooey, and are a BIG hit with my family and friends! Has been a family recipe for years.  I undercook them just a little, and cutting with a plastic knife works well.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\nIn a large bowl, beat 2 cups sugar and 3 eggs together until foamy. Stir in the butter and vanilla. Combine the flour, cocoa, baking powder and salt; stir into the egg mixture. Stir in the chocolate chips. Reserve one cup of the batter, and spread the rest into the bottom of the prepared pan.\nIn a medium bowl, beat the cream cheese, peanut butter, 1/4 cup of sugar 1 egg and milk until smooth and creamy. Carefully spread the peanut butter batter over the layer of chocolate batter. Drop reserved chocolate batter, by tablespoonfuls onto the peanut butter layer. Cut through the batter with a knife to swirl.\nBake for 35 to 40 minutes in the preheated oven, or until brownies are set when shaken gently. Cool completely before cutting into bars. Refrigerate until serving.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "121908.jpg",
    "o": "",
    "st": "allrecipes"
}