{
    "id": 25195,
    "old_rating": "4.32558",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 large green bell peppers",
        "6 tablespoons butter",
        "1 large yellow onion, diced",
        "1 1/2 pounds ground round",
        "salt to taste",
        "ground black pepper to taste",
        "1 cup uncooked white rice",
        "1 gallon tomato juice"
    ],
    "nut": [
        "Calories > 467 kcal",
        "Carbs > 52.9 g",
        "Cholesterol > 82 mg",
        "Fat > 19.8 g",
        "Protein > 24 g",
        "Sodium > 1418 mg"
    ],
    "n": "Saucy Stuffed Peppers",
    "a": "MOELIZ",
    "r": "0",
    "s": 8,
    "des": "\"My Slovakian grandmother always made huge pots of this during the winter time.  I'm a vegetarian now, and can safely say that this is the one dish that I really miss eating.\"",
    "ins": "Wash the peppers thoroughly. Make a circular incision around the stem to remove it. Once stem has been removed, remove seeds, and rinse the inside of the pepper. Discard seeds and stems and set peppers aside.\nIn a skillet over medium heat, melt the butter and saute onion until translucent.\nIn a large mixing bowl, combine the onion and butter mixture with the ground beef and mix well by hand. Sprinkle in salt and pepper to taste. Slowly pour in the rice, while mixing by hand. Mix thoroughly.\nStuff the meat and rice mixture into the peppers. Coat the bottom of 1 or 2 large pots with oil. Place the stuffed peppers into the pot(s) leaving a 2 inch space at the top of the pot. Pour in tomato juice until peppers are covered. If there is leftover meat mixture, form into balls and add to the tomato juice.\nHeat on low for 2 to 3 hours. Stir every 20 to 45 minutes. Juice will reduce to a thick sauce. You can tell that the peppers are done when they are splitting at the sides.",
    "pt": "30 m",
    "ct": "2 h ",
    "tt": "3 h",
    "i": "3113284.jpg",
    "o": "",
    "st": "allrecipes"
}