{
    "id": 25215,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup bite size frosted wheat cereal",
        "1 cup brown sugar",
        "1/2 cup shortening",
        "1 teaspoon salt",
        "1 cup boiling water",
        "2 (.25 ounce) packages active dry yeast",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "2 eggs",
        "6 cups bread flour"
    ],
    "nut": [
        "Calories > 200 kcal",
        "Carbs > 32.8 g",
        "Cholesterol > 16 mg",
        "Fat > 5.3 g",
        "Protein > 5 g",
        "Sodium > 106 mg"
    ],
    "n": "Cereal Bread",
    "a": "kimmah",
    "r": "0",
    "s": 24,
    "des": "\"I modified my grandmother's bran bread recipe and got this one. I was out of bran, so tried frosted wheat cereal. The results were great!\"",
    "ins": "In a large bowl, combine cereal, brown sugar, shortening and salt. Pour boiling mixture over mixture. Let cool to room temperature.\nIn a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nCombine cereal and yeast mixtures. Add eggs and two cups flour; mix well. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.\nLightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nDeflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into two lightly greased 9x5 inch loaf pans. Cover the loaves with a damp cloth and let rise until doubled in volume, about 40 minutes. Preheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven until brown, about 30 minutes. Remove from pans and let cool on a wire rack.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "251826.jpg",
    "o": "",
    "st": "allrecipes"
}