{
    "id": 25210,
    "old_rating": "4.46751",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (.25 ounce) packages active dry yeast",
        "2 1/2 cups warm water (110 degrees F/45 degrees C)",
        "2 teaspoons salt",
        "2 tablespoons vegetable oil",
        "7 cups all-purpose flour",
        "1 tablespoon cornmeal",
        "1 egg white",
        "1 tablespoon water"
    ],
    "nut": [
        "Calories > 439 kcal",
        "Carbs > 85 g",
        "Cholesterol > 0 mg",
        "Fat > 4.6 g",
        "Protein > 12.5 g",
        "Sodium > 594 mg"
    ],
    "n": "Italian Bread Bowls",
    "a": "Kerri Skrudland",
    "r": "0",
    "s": 8,
    "des": "\"These cute little bread bowls are a great way to serve soup in the wintertime. I usually serve a hearty potato soup when I have the time to bake them. They freeze for up to 1 month, if desired.\"",
    "ins": "In a large bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nAdd salt, oil and 4 cups flour to the yeast mixture; beat well. Stir in the remaining flour, 1/2 cup at a time, beating well with an electric mixer at medium speed after each addition.\nWhen the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 6 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 40 minutes.\nPunch dough down, and divide into 8 equal portions. Shape each portion into a 4 inch round loaf. Place loaves on lightly greased baking sheets sprinkled with cornmeal. Cover and let rise in a warm place, free from drafts, until doubled in bulk, about 35 minutes.\nPreheat oven to 400 degrees F (200 degrees C). In a small bowl, beat together egg white and 1 tablespoon water; lightly brush the loaves with half of this egg wash.\nBake in preheated oven for 15 minutes. Brush with remaining egg mixture, and bake 10 to 15 more minutes or until golden. Cool on wire racks.\nTo make bowls: Cut a 1/2 inch thick slice from top of each loaf; scoop out centers, leaving 3/4-inch-thick shells. Fill bread bowls with hot soup and serve immediately.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "4534142.jpg",
    "o": "4534142.jpg,4534141.jpg,4477859.jpg,4477455.jpg,4428766.jpg,4404055.jpg",
    "st": "allrecipes"
}