{
    "id": 253150,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) loaf French bread, cut into 1-inch cubes",
        "1 cup raisins",
        "8 large eggs",
        "3 cups LACTAIDÂ® Whole Milk",
        "1 teaspoon cinnamon",
        "3 tablespoons white sugar",
        "1 1/2 teaspoons vanilla extract",
        "Glaze:",
        "1 cup powdered sugar",
        "1/4 teaspoon ground cinnamon",
        "3 tablespoons maple syrup",
        "2 tablespoons LACTAIDÂ® Whole Milk"
    ],
    "nut": [
        "Calories > 450 kcal",
        "Carbs > 77.2 g",
        "Cholesterol > 200 mg",
        "Fat > 9.2 g",
        "Protein > 16.6 g",
        "Sodium > 490 mg"
    ],
    "n": "Maple Glazed French Toast Casserole",
    "a": "Lactaid",
    "r": "0",
    "s": 8,
    "des": "\"A rich, fluffy French toast casserole that you can make the night before. Perfect for a crowd and easy to adapt to your own flavors.\"",
    "ins": "Spray a 9 X 13-inch pan with cooking spray.\nSpread half of the French bread cubes onto the bottom of the 9x 13 pan. Sprinkle with half of the raisins. Cover with remaining bread cubes. Sprinkle remaining raisins on top.\nMix eggs, 3 cups Lactaid(R) whole milk, 1 teaspoon cinnamon, white sugar, and vanilla together in a large bowl with an electric mixer until ingredients are well blended, 2 to 3 minutes. Pour over bread mixture in pan.\nGently press down bread so it is slightly covered by the liquid. Cover with plastic wrap and put in the refrigerator overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nRemove plastic from casserole and place in the oven. Bake uncovered until set and top is golden brown, about 45 minutes.\nWhisk powdered sugar, 1/4 teaspoon cinnamon, maple syrup, and 1 tablespoon Lactaid(R) milk together in a bowl. If too think, add a bit more milk. Glaze should be thick but liquid enough to drizzle.\nDrizzle glaze over warm casserole. Allow glaze to thicken and set before serving, about 10 minutes.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "9 h ",
    "i": "3648472.jpg",
    "o": "3908179.jpg,3799666.jpg,3791416.jpg,3790201.jpg,3782371.jpg,3752877.jpg",
    "st": "allrecipes"
}