{
    "id": 254184,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 pounds fresh peaches, peeled and chopped",
        "2 pounds cane sugar",
        "1 large apple with peel and core, cut into 8 wedges",
        "2 lemons, juiced",
        "1/4 cup water"
    ],
    "nut": [
        "Calories > 127 kcal",
        "Carbs > 31.5 g",
        "Cholesterol > 0 mg",
        "Fat > 0 g",
        "Protein > 0 g",
        "Sodium > 2 mg"
    ],
    "n": "The Best Natural Peach Jam or Filling",
    "a": "TexasJG",
    "r": "0",
    "s": 32,
    "des": "\"This peach jam uses only real ingredients, no store-bought pectin. The apple provides natural pectin (especially the seeds and peel) and gives the jam a nice, firm consistency. The color is beautiful, too. Feel free to exchange the peaches with other stone fruits or berries. This makes great gifts, too. Of course, the best jam is made from Texas peaches, but I'm sure any sweet, fresh peaches will be just dandy.\"",
    "ins": "Heat four 8-ounce jars in simmering water until ready for use. Wash lids and rings in warm soapy water.\nCombine peaches, sugar, apple, lemon juice, and water in a large pot over high heat. Bring to a boil, stirring constantly. Cook until peaches soften and mixture thickens, about 20 minutes. Mash peaches with a potato masher. Continue cooking until a small amount of jam dropped on a plate stays in place and doesn't run, 5 to 10 minutes more.\nRemove apple wedges and seeds with a slotted spoon.\nPack jam into hot jars, filling to within 1/4 inch of the top. Wipe rims with a clean, damp cloth. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower in jars using a holder, placing them 2 inches apart. Pour in more boiling water to cover the jars by at least 1 inch. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool, about 12 hours. Press the top of each lid with a finger, ensuring that lid does not move up or down and seal is tight.",
    "pt": "25 m",
    "ct": "50 m",
    "tt": "13 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}