{
    "id": 254186,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 oysters, scrubbed and shucked",
        "1 teaspoon butter",
        "1/4 cup chopped fresh mushrooms",
        "1/4 cup chopped green onion",
        "1 cup Japanese mayonnaise (such as KewpieÂ®)",
        "1 tablespoon red miso paste",
        "1 teaspoon ground cayenne pepper",
        "1 teaspoon ground black pepper",
        "1 tablespoon capelin roe (masago)",
        "1 lemon, cut into 6 wedges"
    ],
    "nut": [
        "Calories > 348 kcal",
        "Carbs > 8.4 g",
        "Cholesterol > 63 mg",
        "Fat > 32 g",
        "Protein > 9 g",
        "Sodium > 423 mg"
    ],
    "n": "Big John's Oyster Motoyaki",
    "a": "Big John",
    "r": "0",
    "s": 6,
    "des": "\"Anyone who's tried this dish seems to want to make it themselves. I've created this recipe to give those looking for real Motoyaki (not with some fake cheese sauce) something to make at home that tastes like the one from a restaurant. I hope you enjoy it.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nRemove oyster meat from shells and rinse in cold water, being sure to remove any shell fragments or the beginnings of a pearl. Pat dry with paper towels. Cut each piece into 5 smaller pieces. Rinse lower shell halves well. Discard flat tops.\nMelt butter in a small skillet over medium heat. Add mushrooms and green onion; cook and stir until softened, about 5 minutes.\nWhisk mayonnaise, red miso, cayenne, and black pepper together in a small bowl. Spread a thin layer in the bottom of each shell.\nDivide oyster meat among shells. Top with mushroom mixture. Cover thickly with remaining mayonnaise mixture. Arrange shells on a baking sheet.\nBake on the top rack of the preheated oven until tops are dark brown, 20 to 25 minutes.\nGarnish baked oysters with roe and serve with lemon wedges.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}