{
    "id": 254287,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup reduced fat (2%) milk",
        "1/4 cup Egg BeatersÂ® Original",
        "1 tablespoon Fleischmann'sÂ® Original-stick, melted",
        "1/2 cup gluten-free all-purpose flour (with rice flour)",
        "1 tablespoon granulated sugar",
        "1 dash salt",
        "PAMÂ® Original No-Stick Cooking Spray",
        "2 tablespoons chocolate-flavored hazelnut spread",
        "3 medium bananas, peeled, thinly sliced",
        "Reddi-wipÂ® Original Dairy Whipped Topping"
    ],
    "nut": [
        "Calories > 177 kcal",
        "Carbs > 29.5 g",
        "Cholesterol > 7 mg",
        "Fat > 5.5 g",
        "Protein > 4.2 g",
        "Sodium > 119 mg"
    ],
    "n": "Gluten Free Peanut Butter and Banana Crepe Stack",
    "a": "Reddi-wip",
    "r": "0",
    "s": 6,
    "des": "\"Crepe recipe layered with creamy peanut butter, chocolate-flavored hazelnut spread and sliced bananas.\"",
    "ins": "Place milk, Egg Beaters, Fleischmann's, flour, sugar and salt in blender container. Blend until smooth to make crepe batter.\nSpray 10-inch nonstick skillet generously with cooking spray. Heat over medium heat. Pour about 1/4 cup batter in skillet; immediately tilt skillet to evenly cover bottom of skillet with batter. Cook 2 to 3 minutes on each side or until lightly browned, turning once. Remove crepe from skillet and place on flat work surface. Repeat with remaining batter to make 4 additional crepes.\nMeanwhile, spread warm crepe with 1/3 of the peanut butter. Place peanut butter-side up on large plate. Top with 1/4 of the banana slices. Spread second crepe with 1 tablespoon hazelnut spread; place spread-side up on top of bananas. Top with another 1/4 of banana slices. Repeat layers with 2 more crepes, another 1/3 of the peanut butter and remaining hazelnut spread and bananas. Spread remaining 1/3 of the peanut butter on the last crepe and place peanut butter-side down on top.\nCut into 6 slices with serrated knife. Serve with Reddi-wip.",
    "pt": "40 m",
    "ct": "",
    "tt": "",
    "i": "3686967.jpg",
    "o": "",
    "st": "allrecipes"
}