{
    "id": 254269,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup whole grain sorghum, uncooked",
        "3 cups low-sodium chicken broth",
        "1 tablespoon extra virgin olive oil",
        "2 large cloves garlic, finely chopped",
        "1 small-medium onion, chopped",
        "1/4 teaspoon kosher salt",
        "1/4 teaspoon black pepper",
        "12 ounces kale, thick stems removed, leaves chopped into 1-2-inch pieces",
        "1 teaspoon sriracha or other hot sauce",
        "2 (15 ounce) cans white cannellini beans or white kidney beans, drained and rinsed",
        "1 (14.5 ounce) can diced tomatoes in juice",
        "4 cups low-sodium chicken broth",
        "Grated Pecorino Romano or Parmesan cheese for topping"
    ],
    "nut": [
        "Calories > 108 kcal",
        "Carbs > 15.3 g",
        "Cholesterol > 5 mg",
        "Fat > 2.8 g",
        "Protein > 5.7 g",
        "Sodium > 271 mg"
    ],
    "n": "Sorghum, Kale and White Bean Tomato Soup",
    "a": "The Sorghum Checkoff",
    "r": "0",
    "s": 10,
    "des": "\"This hearty sorghum soup is the perfect meal to warm you up on a chilly fall or winter day. Packed with veggies and topped with Italian cheese, this soup is sure to be a new lunch or dinner time favorite.\"",
    "ins": "Bring 3 cups of broth to a boil, add 1/2 cup of sorghum and allow to boil gently for approximately 20-25 minutes (liquid will remain, that's fine).\nMeanwhile, heat a large saucepan with lid over medium to medium/high heat. Add olive oil and saute garlic, onion, salt and pepper until the onion softens (approximately 6-8 minutes).\nAdd kale and sriracha, cook until wilted (about 4 minutes).\nTake 1/2 cup of white beans and either blend in a blender/small food processor or mash well with the back of a spoon or fork.\nAdd blended beans, remaining whole beans, canned tomatoes, sorghum/broth mixture and additional 4 cups low sodium chicken broth to kale mixture.\nBring to a boil, cover and reduce heat to simmer for approximately 20 minutes.\nTop with grated Pecorino Romano or Parmesan cheese (approximately 1 teaspoon per bowl) and serve.",
    "pt": "10 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "3679879.jpg",
    "o": "",
    "st": "allrecipes"
}