{
    "id": 254229,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 zucchini blossoms, divided",
        "8 ounces extra-firm tofu, drained and cut into very small cubes",
        "2 ounces herbed feta cheese, or more to taste",
        "4 green cocktail olives, minced",
        "1 tablespoon bottled minced garlic",
        "1 1/2 teaspoons chopped fresh thyme",
        "1 1/2 teaspoons chopped fresh oregano",
        "1 pinch seasoned salt, or to taste",
        "2 cups whole wheat pastry flour",
        "1 cup egg substitute (such as Egg BeatersÂ®)",
        "2 cups bread crumbs",
        "cooking spray"
    ],
    "nut": [
        "Calories > 708 kcal",
        "Carbs > 102.9 g",
        "Cholesterol > 15 mg",
        "Fat > 16.6 g",
        "Protein > 39.4 g",
        "Sodium > 1080 mg"
    ],
    "n": "Lighter Stuffed Zucchini Blossoms",
    "a": "lyllyth",
    "r": "0",
    "s": 3,
    "des": "\"I was looking for a different way to cook zucchini blossoms that didn't involve gobs of cheese or deep-frying. So I made this up as I went along, and lo! Henceforth comes this recipe. You will need a food processor for this one.\"",
    "ins": "Chop 2 zucchini blossoms finely. Transfer to a bowl.\nStir tofu, feta cheese, olives, garlic, thyme, oregano, and seasoned salt into the bowl. Pour filling into a food processor; pulse until very crumbly. Increase speed blend until smooth and golden, about 3 minutes.\nPipe filling into remaining 6 blossoms using a pastry bag or a resealable plastic bag with the corner snipped off. Twist blossom ends carefully to seal in filling. Arrange on a plate; transfer to the freezer.\nMix whole wheat flour and egg substitute together in a bowl until batter is the consistency of pudding.\nSpread bread crumbs in a shallow dish.\nDip a stuffed blossom in batter and roll in bread crumbs. Repeat with remaining blossoms.\nSpray a large nonstick skillet with cooking spray; heat over medium-high heat. Cook blossoms until golden brown on both sides, about 5 minutes.",
    "pt": "40 m",
    "ct": "5 m",
    "tt": "45 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}