{
    "id": 254221,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Custard:",
        "1 (14 ounce) can fat-free sweetened condensed milk",
        "1/2 cup low-fat sour cream",
        "1/2 lemon, juiced, divided",
        "2 teaspoons vanilla extract",
        "1 (9 inch) prepared graham cracker crust",
        "Fruit Topping:",
        "1/2 cup blueberry preserves",
        "2 tablespoons dry white wine",
        "1 cup fresh blueberries",
        "1 cup fresh mulberries"
    ],
    "nut": [
        "Calories > 376 kcal",
        "Carbs > 58.2 g",
        "Cholesterol > 23 mg",
        "Fat > 13.6 g",
        "Protein > 6 g",
        "Sodium > 244 mg"
    ],
    "n": "Blueberry Mulberry Custard Tart",
    "a": "Cheryl Jones",
    "r": "0",
    "s": 8,
    "des": "\"Blueberries and mulberries are everywhere in Eastern PA during the early- to mid-summer, so I created this quick and simple vanilla custard tart to accentuate the natural sweetness of the hand-picked berries. You can sift confectioners' sugar over the tart before serving. Enjoy!\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C).\nCombine condensed milk, sour cream, half of the lemon juice, and vanilla extract in a saucepan over medium heat. Simmer and stir over medium heat until custard thickens slightly, about 5 minutes. Remove from heat and let cool, about 5 minutes. Pour into graham cracker crust.\nCombine blueberry preserves, wine, and remaining lemon juice in another saucepan over medium heat; simmer and stir over medium heat until the preserves have liquefied, 3 to 5 minutes. Stir in blueberries and mulberries until coated with preserves and warmed through, about 5 minutes. Remove from heat and let cool, about 5 minutes. Pour over custard.\nBake in preheated oven until the edges of the crust are golden, about 10 minutes. Let cool on a wire rack, about 15 minutes.\nChill in the refrigerator until custard sets before serving, at least 1 hour.",
    "pt": "10 m",
    "ct": "23 m",
    "tt": "58 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}