{
    "id": 254225,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 zucchini blossoms, or more to taste",
        "1/3 cup soft goat cheese, at room temperature",
        "1 egg yolk",
        "1 scallion, diced",
        "1/4 teaspoon freshly ground black pepper",
        "1/4 teaspoon ground cayenne pepper",
        "3/4 cup tapioca flour",
        "1/2 cup arrowroot powder",
        "1/2 cup coconut oil, melted, or as needed",
        "sea salt to taste"
    ],
    "nut": [
        "Calories > 465 kcal",
        "Carbs > 37.2 g",
        "Cholesterol > 66 mg",
        "Fat > 34.1 g",
        "Protein > 5.1 g",
        "Sodium > 181 mg"
    ],
    "n": "Fried Zucchini Squash Blossoms",
    "a": "Cindy Anschutz Barbieri",
    "r": "0",
    "s": 4,
    "des": "\"I have been making and eating zucchini blossoms for as long as I can remember. My nana would make sure my grandfather picked them as soon as they were perfect! As a little girl we would fill them with ricotta and mozzarella cheese, but I am going to share a delicious paleo recipe for you to enjoy.\"",
    "ins": "Fill a large bowl with cold water and ice.\nBring a large pot of lightly salted water to a boil. Add zucchini blossoms and cook until slightly wilted, about 20 seconds. Drain in a colander and immediately immerse in ice water for several minutes to stop the cooking process. Drain on a plate lined with paper towels.\nMix goat cheese, egg yolk, scallion, pepper, and cayenne in a bowl until smooth.\nSpoon filling into a resealable plastic bag and seal, squeezing out as much air as possible. Cut a small corner off the bag. Pipe about 1 tablespoon of the filling into each zucchini blossom. Fold petals over to cover filling. Arrange on a plate.\nRefrigerate filled zucchini blossoms until cheese is set and firm, at least 45 minutes.\nMix tapioca flour and arrowroot powder together in a shallow dish.\nPour coconut oil into a cast iron skillet to a depth of 1 inch. Heat until a thermometer inserted into the oil reads 350 degrees F (175 degrees C).\nDredge cold zucchini blossoms lightly in tapioca flour mixture, shaking off excess. Fry in hot oil until golden, about 1 minute. Flip with tongs and fry until golden on second side, about 1 minute more. Remove zucchini blossoms to drain on a plate lined with paper towels. Season with sea salt.",
    "pt": "20 m",
    "ct": "8 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}