{
    "id": 254212,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups water",
        "1/8 teaspoon salt",
        "1 cup buckwheat groats, rinsed",
        "10 mint leaves",
        "10 basil leaves",
        "1/4 cup raw cashews",
        "1 1/2 cups cooked black chickpeas or regular chickpeas",
        "1/4 cup extra-virgin olive oil, or more as needed",
        "2 Thai chiles, chopped",
        "1/4 cup chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 322 kcal",
        "Carbs > 31.8 g",
        "Cholesterol > 0 mg",
        "Fat > 19.3 g",
        "Protein > 7.3 g",
        "Sodium > 403 mg"
    ],
    "n": "Buckwheat & Chickpea Pesto Salad",
    "a": "got milk?Â®",
    "r": "0",
    "s": 4,
    "des": "\"Buckwheat groats and Italian black chickpeas are tossed with a light basil and mint pesto, before being topped with spicy Thai chiles for a nice and spicy vegetarian meal. The basil and mint along with the spicy chiles has a flavor that I find blends very well with cold milk. The texture of the salad also is a great mix with milk.\"",
    "ins": "Bring the water to boil in a medium saucepan. Add the salt and rinsed buckwheat groats. Bring to a boil; reduce heat and simmer until the groats have almost tripled in size, about 12 minutes. Remove from heat and let sit, covered, for 5 minutes.\nLightly pound mint leaves, basil leaves, and raw cashews with a pestle in a mortar until they begin to release their own oils. Churn the pestle to create a chunky paste. Add a bit of oil if necessary. The texture should be chunky, not too smooth.\nFluff the groats with a fork. Drain off any excess water. Transfer the buckwheat to a large salad bowl. Add the chickpeas and drizzle with a bit of oil, mixing well. Add pesto and mix well, drizzling more oil if necessary. Add the chiles and coriander. Mix well. Serve warm or cold. Best served with ice-cold milk.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "25 m",
    "i": "3658833.jpg",
    "o": "",
    "st": "allrecipes"
}