{
    "id": 254264,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 egg yolks",
        "3 tablespoons honey",
        "1 teaspoon honey",
        "1 cup heavy whipping cream",
        "8 ounces fresh raspberries",
        "2 1/2 tablespoons chopped pistachio nuts"
    ],
    "nut": [
        "Calories > 262 kcal",
        "Carbs > 16.6 g",
        "Cholesterol > 259 mg",
        "Fat > 20.8 g",
        "Protein > 4.5 g",
        "Sodium > 38 mg"
    ],
    "n": "Raspberry and Pistachio Semifreddo",
    "a": "Cindy Anschutz Barbieri",
    "r": "0",
    "s": 6,
    "des": "\"I love this dessert because it is super easy to prepare! I serve this in the summer at our lake house and everyone gets so excited. I remember the first time I made it our friends the Zacharys were over for dinner and their eyes opened so wide when I walked out with this dessert. All I can say is that the semifreddo platter and everyone's plates were empty. Give this recipe a try if you want to impress your friends. It's gluten-free. Serve garnished with extra raspberries or puree some of the raspberries with a teaspoon of honey and drizzle on top.\"",
    "ins": "Combine egg yolks with 3 tablespoons plus 1 teaspoon honey in the large bowl of an electric mixer fitted with a paddle attachment; beat until volume doubles and mixture is pale and creamy, about 10 minutes.\nBeat heavy cream in a bowl with an electric mixer until firm peaks form, 3 to 4 minutes. Gently fold cream into egg yolk mixture.\nLine a loaf pan with parchment paper, leaving an overhang on both sides. Pour mixture into the pan, smoothing the top. Cover with plastic wrap.\nFreeze until semifreddo is chilled, about 1 1/2 hour. Remove from freezer and stir in raspberries and pistachio nuts. Freeze until firm, at least 4 hours.\nLet semifreddo soften in the refrigerator before serving, about 15 minutes. Turn out of the pan and cut into slices.",
    "pt": "20 m",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}