{
    "id": 254213,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 eggs",
        "1/4 cup finely grated Parmigiano-Reggiano cheese",
        "1 cup packed spinach leaves, coarsely chopped",
        "2 tablespoons olive oil",
        "1/4 cup diced leek",
        "1/4 cup minced carrot",
        "1 fresh cayenne peppers, chopped",
        "1 cup cooked garbanzo beans, drained, thoroughly dried",
        "2/3 cup diced tomatoes",
        "1/2 teaspoon red pepper flakes (optional)"
    ],
    "nut": [
        "Calories > 186 kcal",
        "Carbs > 12.4 g",
        "Cholesterol > 189 mg",
        "Fat > 11 g",
        "Protein > 10.1 g",
        "Sodium > 251 mg"
    ],
    "n": "Brunchtime Spicy Chickpea Frittata",
    "a": "Buckwheat Queen",
    "r": "0",
    "s": 6,
    "des": "\"Brunch is for savory eggs, in my opinion. Serve this spicy Italian open-faced omelet with a cold glass of milk at your next brunch!\"",
    "ins": "Whisk together eggs and cheese until creamy. Fold in spinach and set aside.\nHeat oil over medium heat in an oven-proof skillet. Saute leek, carrot, and cayenne peppers until the leek is translucent, 4 to 5 minutes. Add chickpeas and tomatoes. Saute until warmed through, about 3 minutes. Add egg mixture to the skillet and cover.\nCook the mixture undisturbed until the edges of the frittata have firmed and slightly browned, 4 to 5 minutes. Reduce heat to medium-low. Replace the cover but watch every so often until the whole frittata has firmed except the very middle. Take care to keep the heat source on medium-low to avoid burning bottom of frittata.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nPlace the frittata under the broiler to firm and brown the top, 1 to 3 minutes.\nAllow to cool before serving. Top with red pepper flakes if desired.\nServe warm or at room temperature with an ice cold glass of milk!",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "3658834.jpg",
    "o": "",
    "st": "allrecipes"
}