{
    "id": 254329,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound ground beef",
        "1 pound ground Italian sausage",
        "1 (8 ounce) package manicotti shells",
        "1 (24 ounce) carton cottage cheese, drained",
        "2 (16 ounce) jars pizza sauce, divided",
        "1 (8 ounce) package shredded mozzarella cheese",
        "vegetable oil for frying",
        "1/2 cup all-purpose flour",
        "3 eggs",
        "2 cups bread crumbs"
    ],
    "nut": [
        "Calories > 498 kcal",
        "Carbs > 37.7 g",
        "Cholesterol > 97 mg",
        "Fat > 25.1 g",
        "Protein > 28.8 g",
        "Sodium > 1141 mg"
    ],
    "n": "Deep-Fried Lasagna Pieces",
    "a": "sunnyshine80",
    "r": "0",
    "s": 13,
    "des": "\"A twist on an old classic. This is kind of messy but soooo good. Looks like an appetizer but eats like a meal. The whole family loves it and the stuffed noodles can be frozen and used at a later point.\"",
    "ins": "Heat a large skillet over medium heat. Add beef and Italian sausage; cook and stir until browned, about 8 minutes. Drain excess grease. Let cool slightly.\nBring a large pot of lightly salted water to a boil. Cook manicotti shells in the boiling water, stirring occasionally until tender yet firm to the bite, about 7 minutes. Drain.\nMix cooled beef and sausage, cottage cheese, 1 jar pizza sauce, and mozzarella cheese together in a large bowl. Stuff shells generously with mixture.\nArrange stuffed shells on a baking sheet and freeze until firm, 15 to 20 minutes. Cut each shell into 2 or 3 lasagna pieces.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nPlace flour in a bowl. Beat eggs in another bowl. Pour bread crumbs onto a shallow plate.\nDredge stuffed lasagna pieces in flour. Dip in beaten eggs. Roll in bread crumbs until coated.\nFry 4 breaded lasagna pieces at a time in the hot oil until golden brown, 3 to 5 minutes. Repeat with remaining pieces.\nPour remaining jar of pizza sauce into a bowl for dipping.",
    "pt": "30 m",
    "ct": "23 m",
    "tt": "1 h ",
    "i": "3691658.jpg",
    "o": "",
    "st": "allrecipes"
}