{
    "id": 25433,
    "old_rating": "4.07692",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 pounds pork shoulder roast",
        "1 tablespoon ground black pepper",
        "1 teaspoon ground cayenne pepper",
        "1 (18 ounce) bottle barbeque sauce",
        "2 yellow onions, quartered",
        "1/4 cup Worcestershire sauce",
        "8 cloves garlic, halved",
        "2 cups Burgundy wine",
        "1/4 teaspoon ground black pepper",
        "1/8 teaspoon ground cayenne pepper"
    ],
    "nut": [
        "Calories > 394 kcal",
        "Carbs > 13.2 g",
        "Cholesterol > 99 mg",
        "Fat > 23.7 g",
        "Protein > 26 g",
        "Sodium > 428 mg"
    ],
    "n": "Andy's Barbeque Pork",
    "a": "Andy",
    "r": "0",
    "s": 18,
    "des": "\"Smoked pork is an all-time outdoor cooking favorite. Be sure to keep the smoker closed as much as possible, and use a few water-soaked hickory chips while smoking. Check every hour or so to be sure the temperature of the meat remains consistent, and to add more coals and water as necessary. The finished pork is great on sandwiches with your favorite barbeque sauce.\"",
    "ins": "Thoroughly rub pork shoulder roast with black pepper, cayenne pepper and barbeque sauce. Place on a medium baking sheet. Chill uncovered in the refrigerator 8 hours, or overnight.\nPreheat an outdoor smoker to a temperature of 225 degrees F (110 degrees C) to 300 degrees F (150 degrees C).\nPlace onions, Worcestershire sauce, garlic, burgundy wine, black pepper and cayenne pepper in the water pan of the smoker. Cover with enough water to make approximately a gallon of liquid in the pan. Place pan in the smoker.\nCenter pork over water pan in the prepared smoker. Smoke 6 hours, or until the internal temperature of the pork has reached 145 degrees F (63 degrees C).",
    "pt": "1 h",
    "ct": "6 h",
    "tt": "15 h",
    "i": "2884231.jpg",
    "o": "",
    "st": "allrecipes"
}