{
    "id": 254371,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1 cup cricket flour",
        "1/2 cup brown sugar",
        "2 tablespoons nutritional yeast",
        "1 pinch salt",
        "2 tablespoons water",
        "1 tablespoon flaxseed meal",
        "2 cups soy milk",
        "1 1/2 cups almond milk",
        "1/2 cup coconut butter, softened",
        "1/4 cup maple syrup",
        "2 teaspoons vanilla extract"
    ],
    "nut": [
        "Calories > 272 kcal",
        "Carbs > 36.7 g",
        "Cholesterol > 47 mg",
        "Fat > 8.8 g",
        "Protein > 12.3 g",
        "Sodium > 87 mg"
    ],
    "n": "Power Cricket Crepes",
    "a": "coolbeans",
    "r": "0",
    "s": 12,
    "des": "\"These dairy and egg-free crepes are packed with bioavailable nutrients, protein, and good fats from the cricket flour. If you're concerned about environmental impact, raising crickets is way less harmful than raising livestock. These crepes are the equivalent of protein bars but with warm delicious flavor and texture. Top with maple syrup, chopped dates, chocolate chips, or apples and cinnamon.\"",
    "ins": "Mix all-purpose flour, cricket flour, brown sugar, nutritional yeast, and salt together in a large bowl.\nStir water and flaxseed meal together in another bowl. Let stand until thickened, about 5 minutes. Mix in soy milk, almond milk, coconut butter, maple syrup, and vanilla extract. Pour over flour mixture; blend with an electric mixer until batter is smooth.\nLet batter rest until thickened, at least 1 hour.\nHeat a nonstick skillet over medium heat. Pour 1/4 cup batter into the skillet; swirl skillet to spread batter out in a thin layer. Cook until the top of the crepe looks dry and the bottom is light brown, 1 to 2 minutes. Run a spatula around the edge to loosen crepe; flip crepe and cook until the other side is light brown, about 1 minute more. Repeat with remaining batter.",
    "pt": "15 m",
    "ct": "2 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}