{
    "id": 254339,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "12 graham crackers",
        "2 tablespoons white sugar",
        "6 tablespoons unsalted butter, melted",
        "6 half pint canning jars",
        "1 (14 ounce) can sweetened condensed milk",
        "4 egg yolks",
        "1/2 cup fresh lime juice",
        "1 tablespoon grated lime zest, divided",
        "1/2 cup heavy whipping cream",
        "1 teaspoon white sugar",
        "1 cup fresh raspberries"
    ],
    "nut": [
        "Calories > 509 kcal",
        "Carbs > 56.4 g",
        "Cholesterol > 216 mg",
        "Fat > 29 g",
        "Protein > 8.7 g",
        "Sodium > 183 mg"
    ],
    "n": "Key Lime and Raspberry Pies in Jars",
    "a": "Culinary Envy",
    "r": "0",
    "s": 6,
    "des": "\"Key lime and raspberry pies in jars are pretty pastel portable pies in a jar. It is so refreshing; it will quickly become your spring and summertime favorite dessert!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line a small pie pan with parchment paper.\nPulse graham crackers and 2 tablespoons white sugar in a food processor until fine crumbs form; add melted butter and pulse until combined.\nSpoon 2 tablespoons of the graham cracker crumbles into each of the 6 half pint jars; gently press crumbles into the bottom. Place the jars onto a large, rimmed baking sheet. Press the remaining graham mixture into the bottom of the prepared pie pan.\nBake jars and pie pan in the preheated oven until the graham cracker mixture is golden brown, 12 to 15 minutes. Remove from oven and place on a wire rack to cool.\nReduce oven temperature to 350 degrees F (175 degrees C).\nWhisk condensed milk and egg yolks together in a large bowl until smooth; add lime juice and 1 1/2 teaspoons lime zest and whisk until combined. Pour lime mixture into cooled jars.\nBake jars until lime mixture has just set, 10 to 12 minutes. Transfer to wire rack and let cool. Refrigerate jars until ready to assemble.\nBeat heavy cream and 1 teaspoon white sugar with an electric mixer in a bowl until the whipped cream forms stiff peaks.\nTop jars with fresh raspberries, whipped cream, and remaining graham cracker crust and lime zest.",
    "pt": "20 m",
    "ct": "22 m",
    "tt": "42 m",
    "i": "3857649.jpg",
    "o": "",
    "st": "allrecipes"
}