{
    "id": 254427,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) can peaches, drained and syrup reserved",
        "1 (.25 ounce) envelope unflavored gelatin",
        "4 eggs, separated",
        "1/4 cup cold water",
        "1 tablespoon lemon juice",
        "1/8 teaspoon almond extract",
        "1/8 teaspoon salt",
        "1/2 cup white sugar",
        "2 cups heavy whipping cream"
    ],
    "nut": [
        "Calories > 318 kcal",
        "Carbs > 21 g",
        "Cholesterol > 175 mg",
        "Fat > 24.5 g",
        "Protein > 5.5 g",
        "Sodium > 98 mg"
    ],
    "n": "Momma Alice's Cold Peach Souffle",
    "a": "Risa B",
    "r": "0",
    "s": 8,
    "des": "\"This cold souffle is like eating a cloud. So light, fluffy, and absolutely delicious! If peaches aren't your thing, this dish can also be made with crushed pineapple, canned pears, 4 bananas, or any other kind of fruit!\"",
    "ins": "Pour reserved peach syrup into a measuring cup. Add enough cold water to make 1 cup. Pour into the top of a double boiler. Sprinkle in gelatin; let stand, about 5 minutes.\nBeat egg yolks and 1/4 cup cold water together in a bowl. Stir into gelatin mixture. Cook, stirring constantly, over simmering water, until gelatin dissolves and sauce thickens, 3 to 5 minutes. Remove from heat.\nStir lemon juice, almond extract, and salt into the sauce. Refrigerate until cooled.\nPlace drained peaches in a blender; blend until smooth. Stir into the gelatin mixture and refrigerate until mixture mounds up slightly.\nBeat egg whites in a glass, metal, or ceramic bowl until foamy. Gradually add sugar, continuing to beat until stiff, glossy peaks form. Fold into peach mixture.\nBeat heavy cream in a chilled glass or metal bowl with a chilled whisk until stiff peaks form. Fold into peach mixture. Pour into a large dish and chill until set, 2 1/2 to 3 hours.",
    "pt": "25 m",
    "ct": "3 m",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}