{
    "id": 254478,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup cool water, divided",
        "liquid rennet",
        "1 1/2 teaspoons citric acid",
        "1 gallon whole milk",
        "1 teaspoon salt (optional)"
    ],
    "nut": [
        "Calories > 195 kcal",
        "Carbs > 15 g",
        "Cholesterol > 33 mg",
        "Fat > 10.6 g",
        "Protein > 10.5 g",
        "Sodium > 324 mg"
    ],
    "n": "Homemade Mozzarella Cheese",
    "a": "Jackie",
    "r": "0",
    "s": 12,
    "des": "\"Think homemade mozzarella cheese is impossible to make? Think again! This recipe shows you how to make delicious mozzarella cheese from scratch. You can create any shape you desire - try larger balls, small balls, or twists and knots. Store in the refrigerator.\"",
    "ins": "Combine 1/4 cup water and rennet in a small bowl; mix well.\nCombine remaining 1/2 cup water and citric acid in another small bowl; mix until dissolved.\nPour milk into a large pot set over medium heat. Heat milk, stirring occasionally, until it registers 90 degrees F (32 degrees C) on an instant-read thermometer, about 5 minutes.\nRemove milk from heat and stir in rennet mixture in a figure-8 motion for 30 seconds. Stir counterclockwise for 30 seconds to still the milk. Let stand, covered, until milk sets into curd, 5 to 10 minutes. Press edge of the curd gently with a palette knife or the back of a spoon to check for firmness.\nSlice vertically into the pot to cut curd into 3/4-inch cubes with a palette knife. Stir curds gently, but leave cubes mostly intact.\nReturn pot to the heat; cook over medium heat, stirring curds gently, until temperature reaches 109 degrees F (43 degrees C), about 5 minutes. Remove from heat.\nLadle curds into a colander set over a large bowl using a slotted spoon. Press curds gently to extract liquid whey. Pour drained whey back into the pot.\nHeat whey to 185 degrees F (85 degrees C), about 5 minutes. Wearing gloves, tear off a piece of curd and place on a slotted spoon. Dip curd in hot whey for 5 to 10 seconds. Stretch, fold, and knead the curd. Repeat until mozzarella is smooth and elastic. Knead in salt and form curd into a ball. Repeat dipping and kneading process with remaining curd.\nAllow mozzarella to cool. Wrap tightly in plastic wrap and transfer to the refrigerator.",
    "pt": "45 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}