{
    "id": 254409,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "27 prickly pears (cactus fruit)",
        "1/4 cup lemon juice",
        "1 (1.75 ounce) package fruit pectin (such as Sure-JellÂ®)",
        "4 1/2 cups white sugar"
    ],
    "nut": [
        "Calories > 193 kcal",
        "Carbs > 48.8 g",
        "Cholesterol > 0 mg",
        "Fat > 0.6 g",
        "Protein > 0.9 g",
        "Sodium > 6 mg"
    ],
    "n": "Prickly Pear Jelly",
    "a": "Jennifer Simons",
    "r": "0",
    "s": 24,
    "des": "\"This is my grandmother's recipe. It is good on anything grape jelly is good on! Handle prickly pears carefully, wearing gloves. Store jelly in a cool, dark area.\"",
    "ins": "Simmer 3 pint-size jars in a large pot of water until ready for use. Wash lids and rings in warm soapy water.\nSlice ends off each prickly pear. Make 1 long vertical slit down each one. Use the slit to hold the skin and peel off. Discard peel.\nPlace peeled pears in a blender; puree in batches until liquefied. Press puree through a fine-mesh sieve set over a bowl. Discard pulp and seeds.\nMeasure out 3 cups prickly pear juice, lemon juice, and pectin into a large pot. Bring to a boil, stirring constantly. Add sugar and return to a boil, stirring constantly. Let cook, about 3 minutes. Remove from heat.\nPour prickly pear mixture into hot jars, filling to within 1/4 inch of the top. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.\nPlace a rack in the bottom of a stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the stockpot, and process for 15 minutes.\nRemove the jars from the pot and place onto a cloth-covered or wood surface, several inches apart, and let cool, at least 24 hours.",
    "pt": "20 m",
    "ct": "38 m",
    "tt": "1 d ",
    "i": "4498674.jpg",
    "o": "",
    "st": "allrecipes"
}