{
    "id": 254418,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Granita:",
        "2/3 cup water",
        "2/3 cup white sugar",
        "1 teaspoon vanilla extract",
        "5 leaves fresh mint",
        "1 lime, juiced",
        "1 pinch kosher salt",
        "10 cups cubed seeded watermelon",
        "Lemon Cream:",
        "8 ounces labneh (thick Middle Eastern-style yogurt)",
        "1 tablespoon honey, or to taste",
        "1 teaspoon lemon juice, or to taste",
        "1/2 lemon, zested",
        "3 tablespoons water, or as needed"
    ],
    "nut": [
        "Calories > 107 kcal",
        "Carbs > 15.7 g",
        "Cholesterol > 13 mg",
        "Fat > 3.2 g",
        "Protein > 1.4 g",
        "Sodium > 50 mg"
    ],
    "n": "Watermelon Granita with Sweet Lemon Cream",
    "a": "Leah Hadad/Tribes-A-Dozen",
    "r": "0",
    "s": 12,
    "des": "\"A perfect, light ending to a summer meal, this watermelon granita with lemon cream is a marriage of two cuisines--Italian and Middle Eastern. It is sure to surprise the palate with its blend of sweet and tart, crunchy and creamy. The granita can be stored in the freezer and prepared days or weeks ahead. A simple dish to prepare, the granita can be served with or without the cream. Serve granita and labneh cream with a drizzle of honey and a sprig of mint.\"",
    "ins": "Combine water, sugar, vanilla extract, and fresh mint in a heavy bottomed saucepan; bring to boil. Remove from heat; mix in lime juice and salt.\nPlace watermelon in batches in a blender. Cover and blend until smooth. Strain through a sieve into a large bowl, using a spoon to press out as much juice as possible; stir in sugar mixture.\nPour watermelon mixture into a 10x14-inch glass pan. Freeze, scraping the surface every 30 minutes with a fork until ice crystals form throughout, 1 1/2 to 2 1/2 hours.\nMix labneh, honey, lemon juice, and lemon zest together in a small bowl. Whisk in water 1 teaspoon at a time until consistency is light and creamy. Top granita with cream.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}