{
    "id": 254542,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Balsamic Drizzle:",
        "1/2 cup balsamic vinegar",
        "1 teaspoon brown sugar (optional)",
        "Toast:",
        "1 loaf crusty sourdough or ciabatta bread, sliced",
        "Olive oil, to drizzle over bread slices and avocados",
        "1 clove garlic",
        "salt and pepper to taste",
        "2 avocados - peeled, pitted and sliced",
        "1 (8 ounce) package StellaÂ® fresh mozzarella, sliced",
        "Fresh basil leaves",
        "4 heirloom tomatoes, sliced"
    ],
    "nut": [
        "Calories > 630 kcal",
        "Carbs > 79.1 g",
        "Cholesterol > 27 mg",
        "Fat > 26 g",
        "Protein > 23.7 g",
        "Sodium > 1046 mg"
    ],
    "n": "Open-Face Toasted Caprese",
    "a": "Stella Cheese",
    "r": "0",
    "s": 6,
    "des": "\"Toasted crusty bread topped with sliced mozzarella cheese, fresh basil, and grilled avocado slices makes a delicious summertime lunch.\"",
    "ins": "Add vinegar and brown sugar, if using, to a small saucepan and bring to a boil.\nReduce to a very low simmer and cook for 10-15 minutes, until liquid reduces by about half and is slightly syrupy. Remove from heat, pour vinegar in a bowl or glass to be used later, and set aside to cool and thicken.\nPreheat oven to 450 degrees  F (230 degrees  C) or grill to high heat.\nPlace the slices of bread on a baking sheet and drizzle with olive oil on both sides. Rub each side of bread with the halved garlic clove. Sprinkle with salt and pepper to taste.\nDrizzle avocado with olive oil, salt and pepper to taste.\nPlace bread slices and avocado slices in oven or grill both until lightly charred, about 2 to 3 minutes per side. Remove from the oven or grill.\nSlice Stella fresh mozzarella and divide equally among the sandwiches. Place on top toast, then add fresh basil to taste. Add grilled avocado slices and tomato slices. Drizzle everything with olive oil, balsamic drizzle and salt and pepper to taste.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "20 m",
    "i": "4543734.jpg",
    "o": "",
    "st": "allrecipes"
}