{
    "id": 254535,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "Waffles:",
        "1 cup milk",
        "1/2 cup whole milk ricotta cheese",
        "1 large egg",
        "2 cups gluten-free pancake mix",
        "2 tablespoons coconut oil",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon pure vanilla extract",
        "Blueberry Sauce:",
        "1 cup fresh blueberries",
        "1 cup white sugar",
        "2 teaspoons fresh lemon juice"
    ],
    "nut": [
        "Calories > 304 kcal",
        "Carbs > 57.3 g",
        "Cholesterol > 34 mg",
        "Fat > 6.7 g",
        "Protein > 5.2 g",
        "Sodium > 255 mg"
    ],
    "n": "Gluten-Free Ricotta and Lemon Waffles",
    "a": "Cindy Anschutz Barbieri",
    "r": "0",
    "s": 8,
    "des": "\"I have been enjoying Moon Rabbit FoodsÂ® products and used their pancake and waffle mix to create this amazing breakfast.\n \nThese gluten-free ricotta and lemon waffles are the perfect Sunday breakfast. I just love adding ricotta to my pancakes or waffles. You can make these gluten-free or use your favorite pancake mix to create these light and delicious waffles. \nThe blueberry sauce makes these delicious waffles extra special!\"",
    "ins": "Preheat a waffle iron according to manufacturer's instructions. Coat heated waffle iron with cooking spray or butter.\nWhisk milk, ricotta cheese, and egg together in a large bowl until smooth; stir in pancake mix, coconut oil, 1 tablespoon lemon juice, and vanilla extract. Mix batter until well combined.\nCombine blueberries, sugar, and 2 teaspoons lemon juice in a small saucepan; bring to a boil. Stir and reduce the heat to low, allowing blueberry sauce to simmer.\nPour 1/4 cup batter on the center of the waffle iron and close. Cook until golden brown, about 3 minutes. Pour blueberry sauce over the waffle. Repeat with remaining batter and sauce.",
    "pt": "15 m",
    "ct": "5 m",
    "tt": "20 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}