{
    "id": 254519,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (8 ounce) beef Strip Steaks, boneless, 3/4-inch thick",
        "2 ounces goat cheese, crumbled",
        "Pomegranate seeds (optional)",
        "Marinade & Sauce:",
        "1 cup pomegranate juice",
        "1/4 cup balsamic vinegar",
        "2 tablespoons minced fresh rosemary",
        "2 tablespoons minced fresh thyme",
        "2 tablespoons olive oil",
        "3 cloves garlic, minced",
        "2 teaspoons Dijon-style mustard",
        "1/2 teaspoon ground black pepper",
        "Quinoa:",
        "1 cup uncooked quinoa",
        "2 cups vegetable or beef broth",
        "1 cup thinly sliced fresh baby spinach",
        "1/2 cup pomegranate seeds or sweetened dried cranberries",
        "1/4 cup chopped toasted walnuts (optional)"
    ],
    "nut": [
        "Calories > 626 kcal",
        "Carbs > 71.4 g",
        "Cholesterol > 60 mg",
        "Fat > 25.4 g",
        "Protein > 31.2 g",
        "Sodium > 420 mg"
    ],
    "n": "Pomegranate Steak with Quinoa",
    "a": "Beef. It's What's for Dinner.",
    "r": "0",
    "s": 4,
    "des": "\"Strip steak is marinated in pomegranate juice, balsamic vinegar and herbs and served with quinoa and more pomegranates for garnish. This is one colorful dish.\"",
    "ins": "Combine Marinade & Sauce ingredients in medium bowl. Reserve 3/4 cup for basting sauce. Place beef steaks and remaining marinade in food-safe plastic bag; turn steaks to coat. Close bag securely and marinate in refrigerator 15 minutes to 2 hours.\nMeanwhile, prepare basting sauce. Pour reserved 3/4 cup marinade into small saucepan; bring to a boil. Reduce heat; cook 15 to 20 minutes or until reduced by half and slightly thickened, stirring occasionally. Set aside.\nCook quinoa in broth in medium saucepan according to package directions. Stir in spinach, pomegranate seeds and walnuts. Keep warm.\nRemove steaks from marinade; discard marinade. Place steaks on grid over medium, ash-covered coals. Grill, covered, 7 to 10 minutes (over medium heat on preheated gas grill, times remain the same) for medium rare (145 degrees F) to medium (160 degrees F) doneness, turning occasionally and basting with sauce.\nCarve steaks into slices; season with salt, as desired. Place quinoa on serving platter; top with cheese. Arrange beef around quinoa. Garnish with pomegranate seeds, if desired.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "3731444.jpg",
    "o": "",
    "st": "allrecipes"
}