{
    "id": 254548,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup heavy whipping cream",
        "2 cups half-and-half, divided",
        "1 cup milk",
        "1/4 cup powdered Thai tea mix, or to taste",
        "1 egg, beaten",
        "1 (14 ounce) can sweetened condensed milk",
        "1/8 teaspoon vanilla extract",
        "12 chocolate sandwich cookies (such as OreoÂ®), crushed"
    ],
    "nut": [
        "Calories > 289 kcal",
        "Carbs > 28.2 g",
        "Cholesterol > 70 mg",
        "Fat > 17.5 g",
        "Protein > 5.9 g",
        "Sodium > 128 mg"
    ],
    "n": "Thai Tea OreoÂ® Ice Cream",
    "a": "William Henderson",
    "r": "0",
    "s": 12,
    "des": "\"It may sound like a shocker, but these two flavors meld together to make a sweet, yet subtle, frozen version of the well-known treat!\"",
    "ins": "Heat heavy cream, 1 cup half-and-half, and milk in a saucepan over medium heat until it begins to simmer, about 10 minutes; stir in Thai tea mix and bring to a boil. Reduce heat to low; simmer 5 minutes, or up to 10 minutes for more tea flavor.\nWhisk about 1/4 cup cream mixture, a teaspoon at a time, into beaten egg; whisk beaten egg mixture into cream mixture in saucepan and cook until slightly thickened, about 1 minute. Strain cream mixture through a cheesecloth-lined sieve; discard tea leaves.\nBeat remaining 1 cup half-and-half, sweetened condensed milk, and vanilla extract into cream mixture until well blended; cover and chill for at least 6 hours or overnight.\nFreeze cream mixture in ice cream maker according to manufacturer's instructions. When ice cream is semi-solid, churn in 3/4 of the crushed chocolate sandwich cookies; continue to churn until ice cream is desired consistency, then fold in remaining cookies. Serve immediately or freeze for several hours for a harder ice cream.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "6 h ",
    "i": "3857667.jpg",
    "o": "",
    "st": "allrecipes"
}