{
    "id": 254525,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 Asian bitter melon (goya)",
        "kosher salt as needed",
        "2 tablespoons sesame oil",
        "1 (1 pound) pork loin, cut into pieces",
        "1 pinch garlic salt, or to taste",
        "1 pinch garlic pepper, or to taste",
        "2 eggs",
        "1 tablespoon soy sauce, or to taste"
    ],
    "nut": [
        "Calories > 259 kcal",
        "Carbs > 4.5 g",
        "Cholesterol > 147 mg",
        "Fat > 15.8 g",
        "Protein > 24 g",
        "Sodium > 539 mg"
    ],
    "n": "Goya Champuru (Bitter Melon Stir Fry)",
    "a": "Travis",
    "r": "0",
    "s": 4,
    "des": "\"This is a traditional Okinawan dish with Asian bitter melon. I was introduced to it during my time there. I've combined a few different recipes into this one here. You can also add SpamÂ®; it's pretty popular on Okinawa. \n\nPlease note that the bitter melon has a very different taste, but its very good once you get used to it. It's also ridiculously healthy.\"",
    "ins": "Cut tips off melons with a sharp knife; cut in half lengthwise. Scoop out white interior and seeds with a spoon; rinse the melon. Cut into very small pieces. Place in a bowl and generously add kosher salt, mixing until melon is completely covered. Cover and refrigerate until flavors combine, about 5 minutes.\nRinse melon to remove excess salt. Place into a pot filled with water; cover and bring to a boil. Cook until melon has softened slightly, about 1 minute. Remove from heat; drain the melon.\nHeat sesame oil in a skillet over medium-high heat. Add pork; season with garlic salt and garlic pepper. Cook and stir until pork is no longer pink, 7 to 10 minutes. Add melon; cook until soft, about 5 minutes.\nReduce heat to medium. Push pork mixture to the edges of the skillet with a spatula. Crack eggs into the center of the skillet; scramble until firm, 3 to 5 minutes. Stir contents of the skillet together until combined. Season with soy sauce.",
    "pt": "10 m",
    "ct": "21 m",
    "tt": "36 m",
    "i": "4501589.jpg",
    "o": "",
    "st": "allrecipes"
}