{
    "id": 254543,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (8 ounce) cans refrigerated crescent rolls",
        "Cooking spray",
        "1/2 cup pizza sauce",
        "1 teaspoon dried oregano",
        "1/2 cup shredded StellaÂ® mozzarella cheese",
        "1/4 cup grated StellaÂ® Asiago cheese",
        "1/4 cup grated StellaÂ® Parmesan cheese",
        "3 ounces sliced pepperoni, quartered",
        "1 cup marinara sauce, warmed"
    ],
    "nut": [
        "Calories > 339 kcal",
        "Carbs > 26.1 g",
        "Cholesterol > 20 mg",
        "Fat > 20.7 g",
        "Protein > 9.9 g",
        "Sodium > 927 mg"
    ],
    "n": "Big Game Pizza Ring",
    "a": "Stella Cheese",
    "r": "0",
    "s": 8,
    "des": "\"Refrigerated crescent roll dough rectangles are arranged to form a circle, filled with pizza sauce, lots of cheese, and pepperoni and rolled up and baked for a new twist on your favorite pizza.\"",
    "ins": "Preheat oven to 350 degrees  F (177 degrees  C).\nRemove crescent rolls from tube, roll out, and keep two rolls together to create 8 rectangles. On baking sheet or pizza pan coated with cooking spray, create a ring shape by placing the short rectangle ends pointed inwards with the long pieces pointing out; creating an open circle in the center (about 5 inches in diameter). Overlap corners of short ends to prevent ingredients from leaking.\nSpread pizza sauce around the entire ring closest to the center. Sprinkle oregano on top of the sauce for extra flavor. Add cheeses and pepperoni on top of the sauce and fold the outer edges of the crescent rolls toward the middle. Be sure to overlap everything to keep the ingredients inside.\nSprinkle additional oregano and Stella Parmesan cheese on top of crust to taste. Bake at 350 degrees  F (177 degrees  C) for about 15 minutes or until golden brown.\nSlice into pieces and serve with marinara sauce for dipping.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "3732823.jpg",
    "o": "",
    "st": "allrecipes"
}