{
    "id": 254665,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 potatoes, peeled and cut into small cubes, or more to taste",
        "4 poblano peppers, halved and seeded, or more to taste",
        "2 tablespoons olive oil, divided",
        "3 ears fresh corn, shucked, or more to taste",
        "salt to taste",
        "1/2 onion, chopped",
        "2 cloves garlic, minced",
        "1 (14.75 ounce) can creamed corn",
        "1 (14.5 ounce) can chicken broth",
        "1/4 cup finely chopped cilantro",
        "1 teaspoon ground cumin",
        "1 cup milk"
    ],
    "nut": [
        "Calories > 392 kcal",
        "Carbs > 70.8 g",
        "Cholesterol > 7 mg",
        "Fat > 10.1 g",
        "Protein > 11.6 g",
        "Sodium > 828 mg"
    ],
    "n": "Roasted Poblano Corn Chowder",
    "a": "SMercer",
    "r": "0",
    "s": 4,
    "des": "\"This spicy corn chowder is perfect on a chilly day! Serve garnished with sour cream and shredded cheese.\"",
    "ins": "Place potatoes in a saucepan; cover with water. Bring to a boil; reduce heat and simmer until tender, 15 to 20 minutes. Drain.\nPreheat oven to 375 degrees F (190 degrees C).\nPlace poblano peppers cut-side down in a baking dish. Drizzle 1 tablespoon olive oil on top.\nBake poblano peppers until skin starts to blacken and blister, about 15 minutes. Allow peppers to cool until easily handled, about 10 minutes. Remove and discard skins; coarsely chop peppers.\nCut corn kernels off the cobs. Spread on a greased baking sheet; sprinkle with salt.\nBake corn kernels in the preheated oven, stirring every 5 minutes, until tender, about 15 minutes.\nHeat remaining 1 tablespoon olive oil in a saucepan over medium heat. Add onion and garlic; cook, stirring frequently, until onion is translucent, about 5 minutes. Stir in chopped poblano peppers, creamed corn, chicken broth, cilantro, and cumin. Blend soup with an immersion blender until smooth.\nBring soup to a gentle boil. Stir in potatoes, baked corn kernels, and milk. Season with salt. Simmer until flavors combine, 5 to 10 minutes.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4470058.jpg",
    "o": "",
    "st": "allrecipes"
}