{
    "id": 254719,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 large sweet potatoes, halved lengthwise",
        "1 tablespoon vegetable oil, divided",
        "1 pinch salt",
        "1 small yellow onion, diced",
        "1/2 cup canned tomatoes, drained",
        "4 large cloves garlic, minced",
        "1 tablespoon red curry paste",
        "1 tablespoon grated ginger",
        "1 lemon, zested and juiced",
        "1 (15 ounce) can chickpeas, drained and rinsed",
        "1 (14 ounce) can coconut milk",
        "1 teaspoon salt, or to taste",
        "1 pound kale, chopped"
    ],
    "nut": [
        "Calories > 587 kcal",
        "Carbs > 84 g",
        "Cholesterol > 0 mg",
        "Fat > 28.3 g",
        "Protein > 15.2 g",
        "Sodium > 1133 mg"
    ],
    "n": "Braised Chickpeas in Coconut Milk with Sweet Potatoes",
    "a": "AR Cally",
    "r": "0",
    "s": 4,
    "des": "\"One of our consistent favorites. This dish has a perfect balance of flavors and can be altered with whatever veggies you have on hand. Garnish with feta cheese and cilantro leaves.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPlace sweet potatoes cut-side down on a baking sheet. Coat with 1 teaspoon oil and 1 pinch salt.\nRoast potatoes in the preheated oven until tender, turning halfway through, about 25 minutes.\nHeat remaining 2 teaspoons oil in a heavy pot over medium-high heat. Add onion; cook and stir until starting to brown, about 5 minutes. Add tomatoes, garlic, red curry paste, ginger, and lemon zest. Cook, stirring frequently, until fragrant, about 3 minutes.\nStir chickpeas into the pot. Increase heat to high; cook until chickpeas start to turn golden and are coated with the onion mixture. Pour in lemon juice, coconut milk, and 1 teaspoon salt. Bring to a simmer; reduce heat and cook until flavors combine, about 10 minutes. Stir in kale, 1 handful at a time, until wilted, about 5 minutes.\nServe chickpea mixture over roasted sweet potatoes.",
    "pt": "25 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}