{
    "id": 254750,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "1 clove garlic, minced",
        "2 tomatoes - peeled, seeded, and chopped",
        "1 green bell pepper, chopped",
        "2 tablespoons chopped parsley, or to taste",
        "2 green onions, chopped, or to taste",
        "1 pound lump crabmeat, picked over for pieces of shell",
        "1 1/2 cups coconut milk",
        "1 tablespoon palm oil (optional)",
        "2 tablespoons bread crumbs",
        "1 dash hot pepper sauce, or to taste",
        "salt and ground black pepper to taste",
        "clean scallop shells",
        "1/4 cup grated Parmesan cheese, or to taste"
    ],
    "nut": [
        "Calories > 119 kcal",
        "Carbs > 4.3 g",
        "Cholesterol > 9 mg",
        "Fat > 10.1 g",
        "Protein > 3.9 g",
        "Sodium > 90 mg"
    ],
    "n": "Brazilian Crab Cakes (Casquinha de Siri)",
    "a": "Ronnie Mason",
    "r": "0",
    "s": 12,
    "des": "\"This recipe is a Brazilian-style crab cake, usually served on the beach.\n Very rich in flavor and slightly spicy. Serve piping hot with lime wedges.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nHeat olive oil in a skillet over medium heat. Add onion and garlic; cook and stir until soft, about 5 minutes. Stir in tomatoes, green bell pepper, parsley, and green onions; cook until slightly softened, 3 to 5 minutes. Add crabmeat; cook until flavors combine, about 20 minutes.\nPour coconut milk and palm oil into the skillet. Cook until slightly reduced, 3 to 5 minutes. Stir in bread crumbs to give mixture a paste-like consistency. Season with hot pepper sauce, salt, and black pepper.\nStuff scallops shells with the crab mixture. Sprinkle Parmesan cheese on top. Arrange on a baking sheet.\nBake in the preheated oven until golden brown, about 12 minutes.",
    "pt": "30 m",
    "ct": "43 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}