{
    "id": 254718,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound lean ground beef",
        "2 tablespoons olive oil",
        "1 onion, diced",
        "1 cup halved cherry tomatoes",
        "1 cup (1-inch) sliced green onions",
        "1/4 cup light soy sauce, divided",
        "1 lemon, juiced, divided",
        "3 cloves garlic, minced",
        "1 cube beef bouillon (optional)",
        "1/2 teaspoon ground black pepper",
        "1 (8 ounce) can sliced water chestnuts, halved",
        "1 cup 1-inch cut green beans",
        "1 (13.5 ounce) can coconut milk",
        "1 hot red chile pepper (donne'sali), chopped (optional)"
    ],
    "nut": [
        "Calories > 562 kcal",
        "Carbs > 24.3 g",
        "Cholesterol > 74 mg",
        "Fat > 41.5 g",
        "Protein > 27.4 g",
        "Sodium > 852 mg"
    ],
    "n": "Beef Tinaktak",
    "a": "Sheila Baker Shedd",
    "r": "0",
    "s": 4,
    "des": "\"Tinaktak (pronounced tee-nack-tack) may have originated from the sound of chopping meat: tak! tak! tak!  It is one of Guam's favorite comfort foods and definitely a favorite of mine since it is so simple to make yet yields a tasty dish! Serve over hot steamed rice (white or brown).\"",
    "ins": "Place beef in a large skillet over medium heat; cook and stir until browned, about 8 minutes. Transfer to a plate lined with paper towels to drain excess grease.\nHeat oil in a large skillet over medium-high heat. Add onion, tomatoes, green onions, 3 tablespoons soy sauce, 1/2 the lemon juice, garlic, beef bouillon, and black pepper. Cook and stir until flavors combine, 2 to 3 minutes. Stir in water chestnuts and green beans; cook and stir until tender, 8 to 10 minutes.\nStir drained ground beef, remaining 1 tablespoon soy sauce, and lemon juice into the skillet. Pour in coconut milk slowly; add chile pepper. Reduce heat to low and simmer until coconut milk is heated through, 2 to 3 minutes. Remove from heat.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}