{
    "id": 254702,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/4 cups warm water",
        "2 tablespoons white sugar",
        "2 teaspoons active dry yeast",
        "3 cups bread flour",
        "1 (6 ounce) can sliced black olives, drained",
        "3 tablespoons olive oil",
        "1 tablespoon minced garlic",
        "1 teaspoon salt",
        "1 tablespoon Italian seasoning",
        "1 tablespoon butter, divided",
        "1 tablespoon cornmeal"
    ],
    "nut": [
        "Calories > 232 kcal",
        "Carbs > 34.9 g",
        "Cholesterol > 3 mg",
        "Fat > 7.8 g",
        "Protein > 5.6 g",
        "Sodium > 392 mg"
    ],
    "n": "Black Olive and Mediterranean Spice Bread",
    "a": "Terry J Trainor",
    "r": "0",
    "s": 10,
    "des": "\"I developed this recipe over a long period of time. It is the favorite bread recipe in our house.\"",
    "ins": "Combine water, sugar, and yeast in a large bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes. Add flour, black olives, olive oil, garlic, salt, and Italian seasoning to the bowl; mix well to form a dough.\nTurn dough out onto a floured work surface and knead until smooth, 5 to 10 minutes. Let stand until doubled in volume, about 1 hour.\nPunch dough down gently and knead, 5 to 10 minutes more. Let rise until doubled in volume again, about 45 minutes.\nLine a bowl with a well-floured cloth. Form dough into a ball and place upside down in the bowl. Let rise until doubled in volume again, about 45 minutes.\nPreheat oven to 400 degrees F (200 degrees C). Fill a baking dish with water and place it in the bottom of your oven.\nGrease a baking sheet with 1 teaspoon butter and sprinkle cornmeal on top. Turn dough out gently onto the baking sheet.\nBake in the preheated oven until puffy, about 15 minutes. Reduce oven temperature to 350 degrees F (175 degrees C). Continue baking until bread is golden brown, 30 to 40 minutes. Brush remaining 2 teaspoons butter over the surface. Let cool slightly before slicing, about 15 minutes.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "4 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}