{
    "id": 254740,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 tablespoons vegetable oil, divided",
        "4 eggs, beaten",
        "1 red onion, chopped",
        "3 cloves garlic, minced",
        "1 tablespoon minced ginger",
        "5 small carrots, cut into matchstick-size pieces",
        "1 cup chopped cabbage",
        "4 scallions, sliced into 1/2-inch pieces",
        "2 teaspoons soy sauce, divided",
        "1/4 cup curry powder, divided",
        "2 tablespoons chili powder, divided",
        "3 cups chopped paratha (Indian flatbread)",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 419 kcal",
        "Carbs > 51.3 g",
        "Cholesterol > 171 mg",
        "Fat > 18.6 g",
        "Protein > 16.1 g",
        "Sodium > 577 mg"
    ],
    "n": "Vegetable Kottu Roti",
    "a": "Minnie",
    "r": "0",
    "s": 4,
    "des": "\"A spicy one-dish vegetarian dinner with curry flavors. Vegetable kottu roti is traditional Sri Lankan street food.\"",
    "ins": "Heat 1 tablespoon vegetable oil in a non-stick skillet over medium heat. Add eggs; cook and stir until scrambled and dry, about 5 minutes. Remove from heat.\nHeat remaining 2 tablespoons vegetable oil in a deep skillet over medium heat. Stir in onion, garlic, and ginger; cook and stir frequently until onions are nearly translucent, about 5 minutes. Add carrots; cook and stir until carrots are nearly tender but still crunchy, 7 to 8 minutes.\nStir cabbage and scallions into the skillet; add 1 teaspoon soy sauce. Sprinkle 2 tablespoons curry powder and 1 tablespoon chili powder over the vegetable mixture; stir until coated. Turn stove top temperature to low.\nMix eggs and paratha into the vegetable mixture. Stir in remaining soy sauce, curry powder, and chili powder; stir until coated. Cook until flavors combine, about 3 minutes. Season with salt and pepper.",
    "pt": "45 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}