{
    "id": 254859,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "1 cup all-purpose flour",
        "1/2 cup whole wheat flour",
        "1 1/2 teaspoons white sugar",
        "1/2 teaspoon kosher salt",
        "3/4 cup chilled unsalted butter, cut into cubes",
        "1 egg",
        "1 tablespoon whole milk",
        "Filling:",
        "1 tablespoon olive oil",
        "2 shallots, thinly sliced",
        "2 tablespoons Dijon mustard",
        "3/4 cup ricotta cheese",
        "1 egg",
        "1/2 lemon, zested and juiced",
        "1/4 cup grated Parmesan cheese",
        "salt and ground black pepper to taste",
        "1 pinch red pepper flakes",
        "8 spears asparagus, or more to taste",
        "1/4 cup corn",
        "1/4 cup peas",
        "1 tablespoon heavy whipping cream, or more as needed"
    ],
    "nut": [
        "Calories > 347 kcal",
        "Carbs > 25.6 g",
        "Cholesterol > 104 mg",
        "Fat > 23.9 g",
        "Protein > 9.2 g",
        "Sodium > 340 mg"
    ],
    "n": "Spring Veggie Galette",
    "a": "Matt Wencl",
    "r": "0",
    "s": 8,
    "des": "\"The beautiful thing about galettes is that they don't need to look perfect--they adapt to every skill level and they're receptive to whatever ingredients you have on hand. So, who wants pie for dinner? Wrap up fresh flavors of the season in an easy butter crust and welcome Spring!\"",
    "ins": "Mix all-purpose flour, whole wheat flour, sugar, and 1/2 teaspoon kosher salt together in a food processor. Add cubed butter; pulse until mixture is the size of peas.\nWhisk 1 egg and milk together in a small bowl. Add to the food processor; pulse until dough clumps together.\nTurn dough out onto a sheet of plastic wrap. Bring together into a ball; flatten into a disk and chill until firm, at least 1 1/2 hour and up to overnight.\nRemove dough from the refrigerator. Let come to room temperature, about 1 hour.\nPreheat oven to 425 degrees F (220 degrees C).\nHeat oil in a large skillet over medium heat. Add shallots; cook and stir until translucent and edges are browned, about 3 minutes. Remove from heat; let cool.\nUnwrap dough and place on a work surface lined with parchment paper. Roll out into an 11-inch circle. Slide dough and parchment paper onto a baking sheet. Spread mustard over dough, leaving a 1-inch border.\nMix ricotta cheese, 1 egg, lemon zest, lemon juice, Parmesan cheese, salt, pepper, and red pepper flakes together in a bowl. Spread over mustard. Scatter shallots, asparagus, corn, and peas on top.\nLift corners of the parchment paper up to help fold the edges of the dough around the filling; gently pleat to seal. Brush heavy cream over edges of the dough.\nBake in the preheated oven until golden, about 35 minutes.",
    "pt": "35 m",
    "ct": "38 m",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}