{
    "id": 254853,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 teaspoons olive oil",
        "1 large onion, sliced",
        "6 cloves garlic, chopped",
        "1 red bell pepper, sliced",
        "1 green bell pepper, sliced",
        "11 fluid ounces beef broth",
        "1 1/2 tablespoons ground cumin",
        "1 tablespoon curry powder",
        "1 tablespoon seasoning salt",
        "1 1/2 teaspoons garlic powder",
        "1 1/2 teaspoons ground turmeric",
        "1 1/2 teaspoons pimenton (paprika)",
        "1 1/2 teaspoons dried oregano",
        "1 1/2 teaspoons ground black pepper",
        "6 chicken thighs",
        "4 potatoes, peeled and quartered"
    ],
    "nut": [
        "Calories > 357 kcal",
        "Carbs > 33.8 g",
        "Cholesterol > 71 mg",
        "Fat > 14.1 g",
        "Protein > 24.2 g",
        "Sodium > 716 mg"
    ],
    "n": "Aunt Dora's Colombian Chicken with Potatoes",
    "a": "Tasty",
    "r": "0",
    "s": 6,
    "des": "\"I learned this recipe when visiting my Colombian family members in Houston, Texas. The sauce that the chicken cooks in is chock full of flavor. Cumin, curry, black pepper, turmeric, pimenton (paprika), and seasoning salt make the chicken's sauce tasty enough to lick your plate! Serve with rice.\"",
    "ins": "Heat olive oil in a deep skillet over high heat. Add onions and garlic; cook and stir until onions are softened, about 5 minutes. Stir in red and green bell peppers; cook and stir until peppers are firm but tender, 5 to 7 minutes. Mix in beef broth, cumin, curry powder, seasoning salt, garlic powder, turmeric, pimenton, oregano, and pepper.\nSubmerge chicken thighs, skin side down, half way into broth mixture; stir to coat chicken. Bring to a boil; cover and reduce heat to low. Simmer until chicken is no longer pink, about 40 minutes.\nStir potatoes into the chicken mixture until mostly submerged; check that chicken thighs are still skin side down. Bring to a boil; cover. Reduce heat; simmer until potatoes are soft and chicken is cooked through, about 1 hour.",
    "pt": "20 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}