{
    "id": 254822,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 head cauliflower, broken into florets",
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "1 onion, minced",
        "1 cup sliced fresh mushrooms",
        "2 tablespoons minced fresh parsley",
        "1 tablespoon minced garlic, or more to taste",
        "1 teaspoon poultry seasoning",
        "2 cups shredded cooked chicken",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1/2 cup mozzarella cheese",
        "1/2 cup whole milk",
        "salt and ground black pepper to taste",
        "4 large bell peppers, stemmed and seeded",
        "1 pinch cayenne pepper, or to taste (optional)"
    ],
    "nut": [
        "Calories > 405 kcal",
        "Carbs > 29.3 g",
        "Cholesterol > 72 mg",
        "Fat > 19.8 g",
        "Protein > 30.7 g",
        "Sodium > 747 mg"
    ],
    "n": "Stuffed Cauliflower Rice Peppers with Chicken and Mushrooms",
    "a": "Phoebe",
    "r": "0",
    "s": 4,
    "des": "\"Different than a traditional stuffed pepper that usually utilizes regular rice and a tomato-based sauce.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nPlace cauliflower florets in a food processor; pulse into rice-sized pieces.\nHeat butter and oil in a large skillet over medium heat. Add onion; cook and stir for 2 minutes. Add cauliflower \"rice\" and mushrooms; cook, stirring frequently, until softened, about 5 minutes. Stir in parsley, garlic, and poultry seasoning. Cook until fragrant, about 1 minute. Remove from heat.\nStir chicken, cream of mushroom soup, mozzarella cheese, milk, salt, and pepper into the \"rice\" mixture.\nStand bell peppers cut-side up in a baking dish. Stuff bell peppers with chicken mixture, pushing it down to fill them completely. Sprinkle with cayenne pepper. Cover baking dish with aluminum foil.\nBake in the preheated oven until heated through, about 30 minutes. Uncover and continue baking until golden brown, about 15 minutes more.",
    "pt": "35 m",
    "ct": "53 m",
    "tt": "1 h ",
    "i": "3817444.jpg",
    "o": "",
    "st": "allrecipes"
}