{
    "id": 254866,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil",
        "3 boneless, skinless chicken breast halves",
        "1/2 cup chopped onion",
        "1 clove garlic, minced",
        "1 poblano pepper - roasted, seeded, chopped",
        "1/2 cup corn (frozen, canned, or fresh)",
        "1 3/4 cups water",
        "1 tablespoon buttery spread (optional)",
        "1 (5.4 ounce) package KnorrÂ® Fiesta Sidesâ„¢ - Yellow Rice",
        "Lime wedges, for serving (optional)"
    ],
    "nut": [
        "Calories > 229 kcal",
        "Carbs > 25.2 g",
        "Cholesterol > 33 mg",
        "Fat > 5 g",
        "Protein > 16.3 g",
        "Sodium > 320 mg"
    ],
    "n": "Arroz Poblano (Poblano Rice)",
    "a": "Courtney Woods",
    "r": "0",
    "s": 6,
    "des": "\"Browned chicken, poblano pepper, onion and corn blend with KnorrÂ® Fiesta Sidesâ„¢ - Yellow Rice in this quick and tasty dish.\"",
    "ins": "Preheat a large skillet over medium-high heat. Add oil and heat until shimmering. Add chicken breast, cook until completely cooked through and browned on both sides. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove chicken from skillet, tent loosely with foil to keep warm and set aside.\nReturn skillet to heat. Add onion and cook for 3-4 minutes, stirring occasionally. Add garlic and cook one more minute. Stir in roasted and chopped poblano pepper. Remove from skillet and set aside.\nIn same skillet, place corn, water, buttery spread (if using) and contents of rice package. Bring to a boil, cover and reduce heat. Simmer for 7 minutes or until water has been absorbed and rice is tender.  Add onion mixture back to skillet and toss together.\nPlace rice mixture on a serving platter. Slice chicken and place on top of rice (or chop into bite-sized pieces and stir into rice, then plate). Serve immediately.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "25 m",
    "i": "3807335.jpg",
    "o": "",
    "st": "allrecipes"
}