{
    "id": 254895,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 ounces spinach",
        "2 eggs",
        "1 1/2 teaspoons extra-virgin olive oil",
        "1/2 teaspoon kosher salt",
        "2 cups all-purpose flour, or as needed"
    ],
    "nut": [
        "Calories > 568 kcal",
        "Carbs > 97.3 g",
        "Cholesterol > 186 mg",
        "Fat > 9.9 g",
        "Protein > 20.4 g",
        "Sodium > 586 mg"
    ],
    "n": "Homemade Spinach Pasta",
    "a": "The Late Night Gourmet",
    "r": "0",
    "s": 2,
    "des": "\"Spinach adds a beautiful color and flavor to pasta when introduced to the mix. Getting the blend right can be tricky, but this recipe will show you how.\"",
    "ins": "Combine water and ice in a bowl. Preheat a skillet over medium heat; add spinach. Cook, stirring continuously, until spinach turns bright green, about 30 seconds. Plunge into ice water bath; remove when spinach is lukewarm. Squeeze out excess moisture with cheese cloth.\nCombine spinach, eggs, olive oil, and salt in a food processor; blend until smooth. Add flour; blend until dough no longer sticks to the blades, adding flour as needed.\nRoll dough into a ball; wrap in plastic wrap. Rest at room temperature for 20 minutes.\nRemove plastic wrap from dough. Transfer to a work surface generously dusted with flour; cut dough into 4 pieces with a sharp knife. Roll out dough with a rolling pin to 1/4-inch thickness; shape into rectangles.\nDust pasta maker rollers with flour. Run the dough rectangles through a pasta maker on the widest setting. Repeat rolling dough through rollers, gradually reducing the setting to desired thickness. Change pasta maker's attachment to preferred noodle shape; cut pasta with pasta maker.\nBring a large pot of water to a boil. Lower pasta gently into water; use a spoon to keep noodles from sticking together. Cook until pasta is firm but soft, 3 to 6 minutes. Remove from the water with tongs; transfer to a bowl.",
    "pt": "45 m",
    "ct": "9 m",
    "tt": "1 h ",
    "i": "4462053.jpg",
    "o": "",
    "st": "allrecipes"
}