{
    "id": 254800,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 cups dried porcini mushrooms",
        "3 cups low-sodium chicken broth, or more if needed",
        "1 large head cauliflower, chopped",
        "3 tablespoons unsalted butter",
        "1 shallot, minced",
        "2 teaspoons sea salt",
        "1 teaspoon freshly ground black pepper",
        "1 1/2 cups frozen petite peas, thawed",
        "1 tablespoon balsamic vinegar",
        "1 teaspoon chopped fresh thyme"
    ],
    "nut": [
        "Calories > 263 kcal",
        "Carbs > 29.5 g",
        "Cholesterol > 26 mg",
        "Fat > 10.3 g",
        "Protein > 16.3 g",
        "Sodium > 1043 mg"
    ],
    "n": "Cauliflower \"Risotto\" with Porcini Mushrooms and Peas",
    "a": "Cindy Anschutz Barbieri",
    "r": "0",
    "s": 4,
    "des": "\"Risotto is a Northern Italian rice dish that is cooked for a long time, stirring often. A traditional risotto is cooked with a warm broth, added slowly, to create a creamy consistency. \n\nI remember my Nana would make a cup of coffee and grab her stool and sit at a stove for an hour while preparing risotto!\n\n As a paleo dish, it takes less time to prepare and the cauliflower gives it a perfect risotto feel.\"",
    "ins": "Pour 2 cups boiling water into a large bowl. Add dried mushrooms; let stand until rehydrated, about 20 minutes. Remove mushrooms with a slotted spoon and pat dry; chop into smaller pieces. Reserve soaking liquid.\nPour chicken broth into a saucepan over medium-low heat. Cover and keep warm.\nProcess cauliflower in a food processor fitted with a shredding disc into grains the size of rice.\nMelt butter in a large pot over medium heat. Add shallot; cook until softened, about 2 minutes. Add cauliflower rice, salt, and pepper. Cook, stirring occasionally, until flavors combine, about 5 minutes.\nStir 1 cup of warm chicken broth into the pot; simmer until absorbed, about 5 minutes. Add remaining broth, 1 cup at a time, simmering until it is absorbed and cauliflower rice is tender, about 10 minutes.\nStir chopped mushrooms, peas, balsamic vinegar, and thyme into the pot. Cook and stir until mushrooms and peas are heated through, about 5 minutes.",
    "pt": "20 m",
    "ct": "27 m",
    "tt": "1 h ",
    "i": "4374227.jpg",
    "o": "",
    "st": "allrecipes"
}