{
    "id": 254875,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound skinless, boneless chicken breasts",
        "1/2 cup Italian-style salad dressing, or to taste",
        "3 ounces Brie cheese, sliced",
        "1 tablespoon olive oil, divided",
        "2 cups cherry tomatoes, halved",
        "1/4 teaspoon kosher salt, divided",
        "3 tablespoons balsamic vinegar, divided",
        "1 tablespoon chopped fresh basil",
        "2 cups fresh spinach leaves",
        "1/4 cup mayonnaise",
        "1 tablespoon Dijon mustard",
        "2 cloves garlic, minced",
        "1/8 teaspoon ground black pepper",
        "1 loaf French bread, halved lengthwise"
    ],
    "nut": [
        "Calories > 771 kcal",
        "Carbs > 74.7 g",
        "Cholesterol > 91 mg",
        "Fat > 33.6 g",
        "Protein > 42.8 g",
        "Sodium > 1727 mg"
    ],
    "n": "Chicken and Brie Sandwiches with Roasted Cherry Tomatoes",
    "a": "MICHELEBARGER",
    "r": "0",
    "s": 4,
    "des": "\"This is the most amazing chicken sandwich that will pass your lips. My friends say that I could market this recipe.\"",
    "ins": "Place chicken breasts in a shallow dish. Coat with Italian dressing. Cover with plastic wrap and let marinate in the refrigerator, 8 hours to overnight.\nHeat a grill pan over medium-high heat. Remove chicken breasts from marinade and place in the skillet; cook until no longer pink in the center and the juices run clear, about 6 minutes per side.\nSlice chicken breasts; lay Brie cheese on top to melt.\nPreheat oven to 300 degrees F (150 degrees C).\nHeat 1 teaspoon olive oil in an oven-safe skillet over medium heat. Add tomatoes and 1/8 teaspoon salt; cook, stirring once, until tomatoes release their juices, about 4 minutes. Remove from heat and stir in 2 tablespoons balsamic vinegar and basil.\nTransfer skillet to the preheated oven; bake tomatoes until softened, about 15 minutes.\nCombine remaining 2 teaspoons olive oil, 1 tablespoon balsamic vinegar, and 1/8 teaspoon salt in a bowl. Add spinach; toss to coat.\nMix mayonnaise, Dijon mustard, garlic, and pepper together in a bowl.\nPlace bottom half of the loaf on a baking sheet. Spread mayonnaise mixture on top. Cover with spinach and tomatoes. Place chicken with Brie cheese on top. Cover with top half of the loaf.\nBake in the preheated oven until heated through, 5 to 10 minutes. Cut into 4 sections.",
    "pt": "30 m",
    "ct": "36 m",
    "tt": "9 h ",
    "i": "4537730.jpg",
    "o": "",
    "st": "allrecipes"
}