{
    "id": 254982,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups gluten-free bread crumbs (such as Hodgson MillÂ®)",
        "1 eggplant, peeled into long strips 1/4-inch thick",
        "2 eggs, beaten",
        "3/4 cup grated Parmesan cheese, divided",
        "2 tablespoons olive oil",
        "1 (16 ounce) jar spaghetti sauce, divided",
        "1 (8 ounce) package shredded mozzarella cheese, divided",
        "1 pinch dried basil"
    ],
    "nut": [
        "Calories > 292 kcal",
        "Carbs > 24 g",
        "Cholesterol > 64 mg",
        "Fat > 15.7 g",
        "Protein > 13.7 g",
        "Sodium > 578 mg"
    ],
    "n": "Eggplant Parmesan - Gluten-Free",
    "a": "karkar the cooker",
    "r": "0",
    "s": 8,
    "des": "\"After becoming gluten-free I could no longer order eggplant Parmesan from one of my favorite restaurants. This is the best GF replica I have made yet--absolutely delicious and everyone will enjoy.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper. Pour bread crumbs in a shallow bowl.\nDip eggplant into eggs; coat with gluten-free bread crumbs. Place in a single layer on prepared baking sheet; lightly sprinkle with Parmesan cheese.\nBake in the preheated oven for 6 minutes; remove from oven. Flip eggplant with a spatula; brush with olive oil. Bake until golden brown, about 6 minutes. Remove from oven; reduce heat to 350 degrees F (175 degrees C).\nSpread enough spaghetti sauce into a 7x11-inch baking pan to cover the bottom; layer on some of the eggplant slices. Sprinkle mozzarella cheese over eggplant; top with Parmesan cheese. Repeat layering sauce, eggplant, mozzarella cheese, and Parmesan cheese in this order; top with basil.\nBake in the preheated oven until cheese is bubbly and lightly golden, about 25 minutes.",
    "pt": "30 m",
    "ct": "37 m",
    "tt": "1 h ",
    "i": "4457679.jpg",
    "o": "",
    "st": "allrecipes"
}