{
    "id": 254908,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 sheets frozen puff pastry, thawed",
        "1 tablespoon butter",
        "2 tablespoons minced onion",
        "1/2 teaspoon sugar",
        "1 tablespoon all-purpose flour",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/2 cup sour cream",
        "1 (14.5 ounce) can Libby'sÂ® Cut Green Beans",
        "1 cup shredded sharp Cheddar cheese, divided",
        "1/2 cup canned French fried onions"
    ],
    "nut": [
        "Calories > 147 kcal",
        "Carbs > 9.9 g",
        "Cholesterol > 8 mg",
        "Fat > 10.7 g",
        "Protein > 2.5 g",
        "Sodium > 160 mg"
    ],
    "n": "Green Bean Casserole Tartlets",
    "a": "The Two Bite Club",
    "r": "0",
    "s": 30,
    "des": "\"A delicious miniature puff pastry appetizer.\"",
    "ins": "Preheat the oven to 400 degrees F.\nOn lightly floured surface, gently roll out each pastry sheet to 10-by-12 inches.\nCut each sheet into 30 2-inch squares, ending with a total of 60 squares (a pizza cutter works great for this).\nLightly score each square about 1/8 inch around the edges and prick liberally with a fork. This will keep the pastry from puffing up too much during cooking.\nTransfer pastry squares to 2 parchment-lined baking sheets and put into the refrigerator.\nMelt butter in large skillet over medium heat.\nAdd onions to pan and cook for 2 minutes, or until onions are translucent.\nStir in sugar, flour, salt, and pepper and cook, stirring constantly, for 1 minute.\nAdd sour cream, green beans, and half of cheese to onion mixture and stir until well combined and heated through. Remove from heat and set aside.\nTake pastry squares out of refrigerator and top each one with a small spoonful of the green bean mixture and shredded cheese.\nBake in the preheated oven for 7 minutes, remove from the oven. Top each square with a few French fried onions.  Return to the oven and continue cooking for an additional 6-8 minutes, until the pastry is puffed and golden.  Let sit 5 minutes before serving.",
    "pt": "10 m",
    "ct": "12 m",
    "tt": "25 m",
    "i": "3894447.jpg",
    "o": "",
    "st": "allrecipes"
}