{
    "id": 254990,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 butternut squash, halved lengthwise and seeded",
        "3 tablespoons brown sugar",
        "2 tablespoons soy sauce",
        "2 scallions, white and pale green parts only, thinly sliced",
        "1 teaspoon ginger",
        "20 wonton wrappers",
        "1/4 cup vegetable oil, divided",
        "1 cup water, divided",
        "Dipping Sauce:",
        "1/2 cup soy sauce",
        "1/4 cup water",
        "1/4 teaspoon sesame seeds"
    ],
    "nut": [
        "Calories > 415 kcal",
        "Carbs > 66.7 g",
        "Cholesterol > 4 mg",
        "Fat > 14.6 g",
        "Protein > 9.2 g",
        "Sodium > 2500 mg"
    ],
    "n": "Butternut Squash Potstickers",
    "a": "sara",
    "r": "0",
    "s": 4,
    "des": "\"Wonton wrappers stuffed with squash and served with sesame soy sauce. Steamed green beans make an excellent accompaniment.\"",
    "ins": "Place butternut squash cut-side down in a shallow dish; cover with plastic wrap.\nMicrowave squash until flesh is easily pierced with a fork, about 12 minutes. Cool until easily handled, about 5 to 10 minutes.\nScoop squash flesh into a large bowl, discarding skin. Mix brown sugar and 2 tablespoons soy sauce into the squash. Stir in scallions and ginger.\nSpoon 1 tablespoon squash mixture into the center of a wonton wrapper. Moisten edges with water and fold into a triangle. Repeat with remaining wonton wrappers. Arrange filled potstickers on a baking sheet.\nFreeze potstickers until almost solid, about 15 minutes.\nHeat 2 tablespoons oil in a large skillet over medium heat. Add a layer of potstickers; cook, shaking skillet occasionally, until bottoms are golden, about 2 minutes. Flip and add 1/2 cup water. Cover and let steam until cooked through, about 3 minutes. Transfer to a serving dish. Repeat with remaining oil and potstickers.\nMix 1/2 cup soy sauce, water, and sesame seeds together in a small bowl to make dipping sauce. Serve alongside potstickers.",
    "pt": "30 m",
    "ct": "17 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}