{
    "id": 254988,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds lamb shanks, on the bone",
        "2/3 cup water",
        "1 jalapeno, cut in half width-wise",
        "8 ciabatta bread dinner rolls",
        "2 tablespoons extra-virgin olive oil",
        "2 green bell pepper, sliced",
        "1 onion, sliced",
        "salt and ground black pepper to taste",
        "1 cup mayonnaise",
        "3 tablespoons Sriracha sauce",
        "5 ounces fresh spinach",
        "1 jalapeno, seeded and sliced"
    ],
    "nut": [
        "Calories > 1646 kcal",
        "Carbs > 233.5 g",
        "Cholesterol > 77 mg",
        "Fat > 49.8 g",
        "Protein > 61.2 g",
        "Sodium > 3132 mg"
    ],
    "n": "Pulled Lamb Sizzlin' Sliders",
    "a": "thegotee",
    "r": "0",
    "s": 8,
    "des": "\"I was at the store looking for something tasty for dinner and came across some lamb shanks. Reading the cooking instructions gave me an idea for some awesome sliders. I grabbed some ingredients and threw this together. The result was a mouth-watering, spicy surprise! Add spices of your own to suit your taste. When you're done, take a bite and wipe your face with a paper towel.\"",
    "ins": "Place lamb shanks into a slow cooker; add water. Stir stem side of the halved jalapeno to the slow cooker, reserving the other end.\nSet slow cooker to High; cook until lamb is tender and can be easily pulled apart with a fork, 1 to 2 hours. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\nPreheat oven to 375 degrees F (190 degrees C). Place ciabatta rolls onto a baking sheet.\nBake in the preheated oven until crisp and browned, 10 to 15 minutes.\nRemove jalapeno half from the slow cooker; dice, along with the reserved half.\nHeat oil in a skillet over medium-high heat. Stir in bell peppers, onion, diced jalapeno, salt, and pepper; cook and stir until bell peppers are tender and onion is translucent, 7 to 10 minutes.\nCombine mayonnaise and chile-garlic sauce in a small bowl; stir until sauce is mixed.\nRemove lamb from the slow cooker. Separate lamb meat from the bone; discard bones. Shred lamb with a fork; divide into 8 equal portions.\nSpread sauce onto the top half of the ciabatta; cover with spinach leaves. Spoon lamb and vegetable mixture onto the bottom half of the ciabatta; top with sliced jalapeno.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}