{
    "id": 254968,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon olive oil",
        "1/4 large onion, diced",
        "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TELÂ®)",
        "2 green tomatoes, diced",
        "1 tablespoon capers",
        "1 pinch dried basil",
        "salt and ground black pepper to taste",
        "1 1/2 pounds tilapia fillets",
        "1 tablespoon olive oil",
        "1 tablespoon lemon juice"
    ],
    "nut": [
        "Calories > 241 kcal",
        "Carbs > 7.1 g",
        "Cholesterol > 63 mg",
        "Fat > 7.1 g",
        "Protein > 36.4 g",
        "Sodium > 468 mg"
    ],
    "n": "Tilapia with Green Tomato Tapenade",
    "a": "mommy gourmet",
    "r": "0",
    "s": 4,
    "des": "\"The tapenade is great in pasta, served as an appetizer on bread rounds, or over another mild fish or thin chicken breast. It's a great way to use up your green tomatoes at the end of the season. You can also make a big batch and freeze it. It is a nice taste of late summer when it's cold out. I do have to say, I think this is good enough; I am looking forward to summer's first tomatoes that might just not get a chance to ripen!\"",
    "ins": "Heat 1 teaspoon olive oil in a skillet over medium heat. Add onion; cook and stir until translucent, about 5 minutes. Stir in diced tomatoes, green tomatoes, capers, basil, salt, and pepper. Cook, stirring occasionally, until flavors combine, about 5 minutes.\nSeason tilapia fillets with salt and pepper.\nHeat 1 tablespoon olive oil in a large skillet over medium heat. Add tilapia fillets; cook until flesh flakes easily with a fork, about 3 minutes per side. Transfer to a serving platter.\nPour lemon juice into the skillet; swirl to pick up browned bits off the bottom of the skillet, 30 seconds to 1 minute. Pour over fillets.\nSpoon tomato mixture over fillets before serving.",
    "pt": "15 m",
    "ct": "17 m",
    "tt": "32 m",
    "i": "4351861.jpg",
    "o": "",
    "st": "allrecipes"
}