{
    "id": 254971,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 cups ricotta cheese",
        "1 cup chopped spinach",
        "1 egg, lightly beaten",
        "1 teaspoon ground black pepper",
        "1 cup basil leaves, torn",
        "2 tablespoons extra-virgin olive oil, or more to taste",
        "1/2 clove garlic (optional)",
        "2 tablespoons pine nuts",
        "1 extra large zucchini",
        "9 toothpicks, soaked in water",
        "1/4 cup pasta sauce",
        "2 tablespoons grated Parmigiano-Reggiano cheese"
    ],
    "nut": [
        "Calories > 267 kcal",
        "Carbs > 13.6 g",
        "Cholesterol > 73 mg",
        "Fat > 17.8 g",
        "Protein > 15.3 g",
        "Sodium > 240 mg"
    ],
    "n": "Zavioli with Spinach and Ricotta",
    "a": "Buckwheat Queen",
    "r": "0",
    "s": 4,
    "des": "\"A low-carb take on ravioli. Thin strips of zucchini are stuffed with a classic magro (lean) filling and pesto, topped with tomato sauce and cheese, then baked. Top with fresh hot chile peppers or pepper flakes and more Parmesan cheese.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nMix ricotta cheese, spinach, egg, and pepper together in a bowl.\nGrind basil, oil, and garlic together into a chunky paste using a mortar and pestle. Add pine nuts to the pesto; grind to the size of small peddles.\nSlice zucchini lengthwise into strips using a mandoline.\nArrange 2 zucchini strips in the shape of a cross. Spoon some of the ricotta cheese mixture in the middle of the cross. Top with a dollop of pesto. Fold ends into the center to create a parcel, starting from the bottom end and moving clockwise. Secure with a toothpick. Repeat with remaining zucchini strips, ricotta cheese mixture, and pesto.\nSpread some of the pasta sauce in the bottom of a shallow baking dish. Arrange zucchini parcels on top, spacing them 1/2 inch apart. Spoon a bit of pasta sauce on top of each parcel. Sprinkle Parmiggiano-Reggiano cheese on top.\nBake in the preheated oven until sauce and zucchini begin to brown, about 20 minutes.",
    "pt": "35 m",
    "ct": "20 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}