{
    "id": 254902,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups dates, pitted, divided",
        "1/2 cup almonds, rinsed and dried in a paper towel",
        "1/2 teaspoon vanilla extract",
        "1 pinch salt",
        "1/4 cup salted peanuts, roughly chopped, or more to taste",
        "1/4 cup dark chocolate chips"
    ],
    "nut": [
        "Calories > 317 kcal",
        "Carbs > 50.3 g",
        "Cholesterol > 0 mg",
        "Fat > 13.3 g",
        "Protein > 6.5 g",
        "Sodium > 94 mg"
    ],
    "n": "Almost Like SnickersÂ®",
    "a": "AngelasHeaven.com",
    "r": "0",
    "s": 5,
    "des": "\"I found this recipe a while ago on a Swedish blog, and I have made it many times since then. I made some moderations to make it even better, and now it's the whole family's favorite snack. \nIt tastes just like SnickersÂ® but instead of artificial flavorings and white sugar you get healthy ingredients like almonds, dates, and dark chocolate. Try it--you won't be disappointed!\"",
    "ins": "Combine 1/2 cup dates, almonds, vanilla extract, and salt in a high-speed blender; blend until smooth. Transfer to a plate. Spread almond mixture into a square approximately 4x6-inches in size. Place in the freezer until hardened, about 10 minutes.\nBlend remaining 1 cup dates in the blender until smooth.\nRemove almond mixture from freezer; spread blended dates evenly on top with oiled hands. Sprinkle peanuts onto fudge; push down gently with hands until peanuts stick to blended dates. Freeze in the freezer until bars are set, about 15 minutes.\nMelt chocolate chips in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, 1 to 3 minutes.\nRemove bars from the freezer; cut into 5 pieces with a sharp knife. Dip bars in melted chocolate; place onto a plate to cool until hardened. Place into an airtight container; store in refrigerator.",
    "pt": "25 m",
    "ct": "1 m",
    "tt": "51 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}