{
    "id": 25498,
    "old_rating": "4.62185",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "5 slices bacon",
        "1 (10 ounce) package frozen chopped spinach",
        "12 large mushrooms",
        "3 tablespoons butter",
        "2 tablespoons finely chopped onion",
        "2 cloves garlic, peeled and minced",
        "3/8 cup heavy cream",
        "1/4 cup grated Parmesan cheese",
        "salt and pepper to taste",
        "2 tablespoons butter, melted"
    ],
    "nut": [
        "Calories > 163 kcal",
        "Carbs > 2.5 g",
        "Cholesterol > 38 mg",
        "Fat > 15.7 g",
        "Protein > 4 g",
        "Sodium > 199 mg"
    ],
    "n": "Stuffed Mushrooms with Spinach",
    "a": "MOLSON7",
    "r": "0",
    "s": 12,
    "des": "\"Stuff large mushrooms with spinach, bacon and Parmesan cheese, and you have the perfect appetizer!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Butter a 9x13 inch baking dish with 2 tablespoons butter.\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nPlace frozen spinach in a medium saucepan with 1/4 cup water. Bring water to a boil, then reduce heat to medium and cook spinach covered 10 minutes. Uncover and stir. Remove from heat and drain.\nRemove stems from mushrooms. Arrange caps in the baking dish. Finely chop stems.\nMelt 3 tablespoons butter in a medium saucepan over medium heat, and mix in onion and garlic. Cook 5 minutes, or until tender, then mix in bacon, spinach, chopped mushroom stems and heavy cream. Bring cream to a boil. Remove from heat and mix in Parmesan cheese, salt and pepper.\nStuff mushroom caps generously with the mixture. Drizzle with 2 tablespoons melted butter. Bake in the preheated oven 30 minutes until lightly browned.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "238546.jpg",
    "o": "4528472.jpg,2502695.jpg,2397904.jpg,1961429.jpg,1796810.jpg,1484705.jpg",
    "st": "allrecipes"
}