{
    "id": 254987,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Stuffed Jalapenos:",
        "1 tablespoon olive oil",
        "1/2 small onion, diced",
        "1/4 pound extra-lean ground beef",
        "2 tablespoons water",
        "1 1/2 teaspoons taco seasoning",
        "1/2 cup grated Chihuahua cheese",
        "5 large jalapeno peppers",
        "Tiny Burger Buns:",
        "1/4 cup lukewarm water",
        "2 tablespoons white sugar",
        "2 teaspoons active dry yeast",
        "1 1/2 cups all-purpose flour",
        "2 small eggs, beaten, divided",
        "2 tablespoons milk",
        "1 tablespoon unsalted butter, melted",
        "40 toothpicks"
    ],
    "nut": [
        "Calories > 41 kcal",
        "Carbs > 4.7 g",
        "Cholesterol > 11 mg",
        "Fat > 1.7 g",
        "Protein > 1.8 g",
        "Sodium > 22 mg"
    ],
    "n": "Stuffed Jalapeno Sliders",
    "a": "Scott Winburn",
    "r": "0",
    "s": 40,
    "des": "\"Bold and adorable, these stuffed jalapenos get sliced into rings to become mini sliders!\"",
    "ins": "Heat oil in a skillet over medium heat. Add onion; cook and stir until soft, about 5 minutes. Add beef; cook, stirring to break into very small pieces, until browned, about 5 minutes. Drain any excess grease. Stir in 2 tablespoons water and taco seasoning; cook until water evaporates, about 5 minutes.\nLet beef mixture cool completely, about 10 minutes. Stir in Chihuahua cheese.\nPreheat oven to 350 degrees F (175 degrees C).\nCut tops off jalapeno peppers and scoop out seeds and ribs. Stuff with beef mixture, using the thick end of a chopstick to pack in mixture. Stack upright against the edge of a casserole dish.\nBake in the preheated oven until jalapeno peppers are soft, about 45 minutes.\nRefrigerate jalapeno peppers until stuffing firms up, 1 to 2 hours.\nCombine 1/4 cup water, sugar, and yeast in a small bowl. Let stand until foamy, about 5 minutes.\nCombine flour, 1 egg, milk, and butter in a large bowl. Pour in yeast mixture; mix until well combined. Turn dough onto a lightly floured surface and knead until mostly smooth but slightly sticky, about 5 minutes.\nForm dough into a ball and place in a lightly greased bowl. Cover with a towel and let rise, about 20 minutes.\nLine a baking sheet with parchment paper. Turn dough out onto a floured surface; push down to knock out air. Form into 1-inch buns and arrange 1 inch apart on the baking sheet. Cover with the towel and let rise until puffy, about 1 hour.\nPreheat oven to 375 degrees F (190 degrees C). Brush tops of buns with beaten egg.\nBake buns in the preheated oven until tops are golden brown, 6 to 7 minutes. Transfer to a cooling rack and let cool, about 10 minutes.\nReduce oven temperature to 200 degrees F (95 degrees C).\nSlice cold jalapeno peppers into 1/4-inch thick rings. Cut buns in half. Sandwich jalapeno pepper rings in the buns and secure with a toothpick. Arrange sliders in a casserole dish. Cover with aluminum foil.\nBake sliders in the preheated oven until warmed through, about 10 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "4 h ",
    "i": "3933759.jpg",
    "o": "",
    "st": "allrecipes"
}