{
    "id": 255076,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound beef sirloin steak",
        "1/2 teaspoon garlic salt",
        "1/2 teaspoon freshly ground black pepper",
        "3 tablespoons olive oil, divided",
        "2 Mexican squash",
        "1/3 large carrot",
        "2 radishes",
        "1/2 avocado, diced",
        "1/2 cup grape tomatoes, halved",
        "1/4 cup chopped cilantro",
        "1/2 cup sour cream (optional)",
        "1 tablespoon sriracha sauce (optional)"
    ],
    "nut": [
        "Calories > 589 kcal",
        "Carbs > 15.3 g",
        "Cholesterol > 86 mg",
        "Fat > 49.6 g",
        "Protein > 23.8 g",
        "Sodium > 877 mg"
    ],
    "n": "California Bounty Beef and Vegetable Noodles",
    "a": "bd.weld",
    "r": "0",
    "s": 2,
    "des": "\"Living in California one can get fresh vegetables year-round. Spiralized vegetables are fun and creative for that special main or side spiced up with some California-made sriracha sauce. This recipe is easily adapted with other vegetables.\"",
    "ins": "Season steak with garlic salt and black pepper.\nHeat 1 tablespoon olive oil in a large skillet over medium-high heat. Add steak; cook until browned, 4 to 5 minutes per side. Transfer steak to a cutting board and let rest, about 5 minutes. Slice into thin strips.\nCut Mexican squash, carrot, and radishes into noodles using a spiralizer.\nHeat remaining 2 tablespoons oil in the skillet over medium heat. Add carrot noodles; cook and stir until lightly browned, about 3 minutes. Add squash noodles; cook, stirring constantly, until tender, about 5 minutes.\nDivide carrot and squash noodle mixture between 2 serving plates. Top with sliced steak. Garnish with radish noodles, avocado, grape tomatoes, and cilantro.\nWhisk sour cream and sriracha sauce together in a small bowl. Drizzle over serving plates.",
    "pt": "30 m",
    "ct": "16 m",
    "tt": "51 m",
    "i": "3895024.jpg",
    "o": "",
    "st": "allrecipes"
}