{
    "id": 255083,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 prickly pear, peeled and chopped",
        "2 teaspoons vegetable oil",
        "2 skinless, boneless chicken breasts, cut into small pieces",
        "6 (8 inch) flour tortillas",
        "1 cup shredded mozzarella cheese, or to taste",
        "1 tablespoon butter",
        "1/2 onion, chopped",
        "1/2 bell pepper, chopped",
        "2 cloves garlic, chopped",
        "1 pinch salt",
        "1/2 cup water",
        "2 tablespoons lemon juice",
        "1 cube chicken bouillon",
        "1 teaspoon cornstarch",
        "1 dash pepper sauce",
        "1/2 cup sour cream",
        "2 tablespoons chopped fresh parsley"
    ],
    "nut": [
        "Calories > 303 kcal",
        "Carbs > 33.9 g",
        "Cholesterol > 34 mg",
        "Fat > 12.6 g",
        "Protein > 13.4 g",
        "Sodium > 610 mg"
    ],
    "n": "Prickly Pear Enchilada Sauce",
    "a": "sobachatina",
    "r": "0",
    "s": 6,
    "des": "\"This is a Tex-Mex-like enchilada sauce that I made up to take advantage of the prickly pear fruit that is so plentiful in the fall. The sauce has a tangy, barely sweet flavor with surprising depth. The red juice makes the sauce a pleasant pink color that my kids love. Serve with rice and refried beans.\"",
    "ins": "Place prickly pear in a fine-mesh strainer set over a bowl. Mash with a potato masher to extract juice. Discard seeds and pulp.\nPreheat oven to 400 degrees F (200 degrees C).\nHeat oil in a large skillet over medium heat. Add chicken; cook and stir until juices run clear, 5 to 8 minutes.\nDivide cooked chicken among 6 tortillas. Top with mozzarella cheese. Fold in opposing ends and roll up tortillas. Place seam-side down in a casserole dish.\nBake in the preheated oven until cheese is melted and tortilla edges are crisp, about 15 minutes.\nMelt butter in a saucepan over medium-low heat. Add onion, bell pepper, garlic, and salt; cook and stir until very tender, about 5 minutes. Pour in prickly pear juice, water, lemon juice, bouillon cube, cornstarch, and pepper sauce; whisk until cornstarch dissolves into the sauce.\nBring sauce to a simmer over medium heat. Stir in sour cream. Simmer until flavors combine, about 3 minutes. Remove from heat; stir in parsley. Spoon sauce over tortillas.",
    "pt": "25 m",
    "ct": "32 m",
    "tt": "57 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}