{
    "id": 255004,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "cooking spray",
        "9 graham crackers, crushed",
        "1/3 cup butter, melted",
        "1/3 cup white sugar",
        "2 teaspoons shortening, softened",
        "1/2 teaspoon ground cinnamon",
        "Filling:",
        "1 1/2 cups heavy whipping cream",
        "6 tablespoons confectioners' sugar",
        "1 tablespoon vanilla extract",
        "1 pound fresh strawberries, sliced",
        "2 tablespoons strawberry syrup, or to taste"
    ],
    "nut": [
        "Calories > 315 kcal",
        "Carbs > 25.8 g",
        "Cholesterol > 72 mg",
        "Fat > 23.4 g",
        "Protein > 1.7 g",
        "Sodium > 110 mg"
    ],
    "n": "Scrumptious Strawberry Pie Bars",
    "a": "Dawson",
    "r": "0",
    "s": 9,
    "des": "\"Delicious whipped cream and ripe strawberries on a golden graham cracker crust. YUM! My mom can't get enough. Eat within 4 days.\"",
    "ins": "Place a large metal bowl and beaters from an electric mixer in the freezer.\nPreheat oven to 375 degrees F (190 degrees C). Grease an 8-inch square pan with cooking spray.\nMix crushed graham crackers, butter, white sugar, shortening, and cinnamon in a bowl until well blended. Press into the prepared pan to make crust.\nBake crust in the preheated oven until set, about 7 minutes. Let cool, about 5 minutes. Refrigerate for 10 minutes. Transfer to the freezer and chill until cool to the touch.\nBeat heavy cream in chilled bowl with an electric mixer on high speed until soft peaks form. Beat in confectioners' sugar 1 tablespoon at a time. Add vanilla extract; continue to beat until stiff peaks form.\nArrange 1 layer of strawberries over chilled crust. Add 1 layer of whipped cream. Repeat with a second layer of strawberries and whipped cream. Top with remaining strawberries. Drizzle strawberry syrup on top.\nRefrigerate pie until set, about 1 hour. Cut into 9 pieces before serving.",
    "pt": "25 m",
    "ct": "7 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}