{
    "id": 255009,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "5 cups all-purpose flour",
        "1 3/4 cups white sugar",
        "1/2 teaspoon ground cinnamon",
        "1 1/2 cups butter, at room temperature",
        "Filling:",
        "3/4 cup white sugar",
        "2/3 cup lemon juice",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "7 cups peeled, seeded, and sliced zucchini"
    ],
    "nut": [
        "Calories > 285 kcal",
        "Carbs > 42.5 g",
        "Cholesterol > 31 mg",
        "Fat > 11.8 g",
        "Protein > 3.2 g",
        "Sodium > 86 mg"
    ],
    "n": "Zucchini Pie Bars",
    "a": "nrgizrbune41",
    "r": "0",
    "s": 24,
    "des": "\"Amazing apple-tasting pie bars. The lemon juice adds tartness. Spices and sugar give it the apple pie taste. I used a large zucchini that friends let get too big. As long as the seeds are removed, no one can tell it's not apples! Little bars of mock apple pie! Can be served warm with ice cream.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease sides of a 10x15-inch jelly roll pan.\nMix flour, 1 3/4 cup sugar, and 1/2 teaspoon cinnamon together in a large bowl. Cut in butter with a fork to make a crumbly dough. Measure out 1/2 cup of the dough and reserve.\nPress 1/2 dough firmly into the bottom of the jelly roll pan to form a crust.\nBake in the preheated oven until golden, about 10 minutes.\nCombine 3/4 cup sugar, lemon juice, 1/2 teaspoon cinnamon, and nutmeg in a large saucepan. Add sliced zucchini. Bring to a boil, stirring constantly, until zucchini begins to soften. Stir in reserved 1/2 cup dough. Cook and stir until mixture thickens, 3 to 5 minutes.\nSpread zucchini mixture over the crust. Press remaining dough lightly on top.\nReturn to the preheated oven and bake until top is lightly browned, 35 to 45 minutes. Let cool before slicing into 24 bars, about 20 minutes.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4476783.jpg",
    "o": "",
    "st": "allrecipes"
}