{
    "id": 255013,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 acorn squash, halved and seeded",
        "8 ounces merguez (spicy lamb) sausage, casings removed",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground cumin",
        "1/4 teaspoon freshly ground black pepper",
        "1/4 teaspoon ground cinnamon",
        "1/2 red bell pepper, diced",
        "3 tablespoons buttermilk or plain yogurt",
        "1 tablespoon chopped fresh mint",
        "1 egg",
        "1 cup cooked rice",
        "1 tablespoon plain breadcrumbs",
        "1 tablespoon freshly grated Parmigiano-Reggiano cheese",
        "2 teaspoons olive oil"
    ],
    "nut": [
        "Calories > 324 kcal",
        "Carbs > 40.3 g",
        "Cholesterol > 86 mg",
        "Fat > 12.3 g",
        "Protein > 15.6 g",
        "Sodium > 392 mg"
    ],
    "n": "Sausage and Rice Stuffed Acorn Squash",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"This dish will work with just about any sausage, but you may want to adjust the seasonings according to type. I love the way the flavors seep deep into the soft, sweet flesh of the squash-a great cold-weather meal!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly oil a baking dish large enough to hold the 4 squash halves in one layer.\nCrumble sausage into a bowl. Add salt, cumin, black pepper, cinnamon, diced pepper, buttermilk or yogurt, chopped mint, and egg. Mix well, breaking mixture down to a paste-like consistency, 3 or 4 minutes. Mix in cooked rice.\nDivide mixture among the squash halves. Sprinkle stuffing with a pinch or 2 of breadcrumbs and some grated cheese. Drizzle lightly with olive oil.\nCover dish loosely with aluminum foil, more tented than wrapped; foil shouldn't touch the tops of the stuffed squash.\nBake in preheated oven for 1 hour. Remove foil and bake until top is golden brown and squash is soft and tender, 30 to 45 minutes.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}