{
    "id": 255047,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "Casserole:",
        "1 pound extra-lean ground turkey breast",
        "1/4 cup chopped onion",
        "1 tablespoon minced garlic",
        "1 (15 ounce) can petite diced tomatoes, drained",
        "1 (8 ounce) can tomato paste",
        "1 sweet potato, peeled and cut into noodle shapes",
        "1 eggplant, sliced into 1/2-inch pieces",
        "1 teaspoon tarragon flakes, divided",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon chili powder",
        "1/4 teaspoon ground cumin",
        "1/8 teaspoon oregano",
        "1/8 teaspoon ground cardamom",
        "Sauce:",
        "1 1/2 tablespoons extra-virgin olive oil",
        "1 tablespoon almond flour",
        "1 tablespoon coconut flour",
        "1 cup unsweetened almond milk"
    ],
    "nut": [
        "Calories > 277 kcal",
        "Carbs > 27.1 g",
        "Cholesterol > 56 mg",
        "Fat > 10.9 g",
        "Protein > 19.8 g",
        "Sodium > 697 mg"
    ],
    "n": "Paleo Turkey Sweet Potato Casserole With Eggplant and Tomato",
    "a": "Megan Olson",
    "r": "0",
    "s": 6,
    "des": "\"A Paleo turkey sweet potato casserole layered with eggplant, tomato, bright herbs, and a nutty sauce. A protein-packed dinner that's super easy to make!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray an 8-inch square pan with cooking spray.\nHeat a large skillet over medium heat. Add ground turkey, onion, and garlic; cook and stir until turkey is browned, 5 to 10 minutes. Stir in diced tomatoes and tomato paste. Add sweet potatoes; cook and stir until slightly softened, about 5 minutes.\nCombine eggplant, 1/2 teaspoon tarragon flakes, salt, pepper, chili powder, cumin, oregano, and cardamom in a bowl; toss until eggplant is coated.\nLayer coated eggplant on the bottom of the prepared pan; top with turkey mixture.\nBake casserole in the preheated oven until sweet potatoes are lightly browned, about 15 minutes.\nHeat a saucepan over high heat. Add olive oil, almond flour, and coconut flour; cook and stir until mixture thickens, about 1 minute. Reduce heat to medium-high. Whisk in almond milk slowly until combined. Cook, continuing to whisk, until sauce is reduced by half, about 10 minutes.\nRemove casserole from the oven; cover with sauce.\nBake in the preheated oven until the top of the casserole has browned, 40 to 45 minutes. Top with remaining 1/2 teaspoon tarragon. Slice into 6 pieces with a sharp knife.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4528999.jpg",
    "o": "",
    "st": "allrecipes"
}