{
    "id": 255100,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "5 medium russet potatoes",
        "2 cups all-purpose flour",
        "1 teaspoon kosher salt",
        "2 eggs, beaten",
        "6 tablespoons unsalted butter, divided",
        "1 shallot, minced",
        "3 cloves garlic, thinly sliced",
        "4 tablespoons seasonal pesto such as arugula",
        "1 cup seasonal vegetables (wild mushrooms, sweet peas, broccoli florets, bell peppers), steamed, roasted or grilled",
        "4 fried or poached eggs, or more depending on servings"
    ],
    "nut": [
        "Calories > 416 kcal",
        "Carbs > 52.7 g",
        "Cholesterol > 159 mg",
        "Fat > 17.3 g",
        "Protein > 13.3 g",
        "Sodium > 373 mg"
    ],
    "n": "Golden Potato Gnocchi",
    "a": "Potato Goodness",
    "r": "0",
    "s": 8,
    "des": "\"Rich, savory, earthy, creamy - this Golden Potato Gnocchi with Arugula Pesto hits all the right spots. Thanks to Blackbelly Market for the recipe.\"",
    "ins": "Boil russet potatoes until tender (about 35 minutes): start with cold water, bring to a boil, and then reduce heat to maintain boil for 30-35 minutes. Cool and then peel.\nMill potatoes in food mill while mixing in flour, salt, and egg. Ingredients can also be mixed together on a pastry board or in a bowl.\nKnead gently for about 4 minutes until ball is dry to touch. It may be sticky; apply additional flour to the dough as needed.\nRoll ropes out at 3/4\" to 1\" thickness. Chop into 1-inch rectangles.\nBring a pot of salted water to a boil. Boil gnocchi in 3-4 batches and cook until they float (1-2 minutes).\nOnce floating, remove with a slotted spoon and shock them in a bath of ice water.\nSautee shallots and garlic in 1 tablespoon of butter in a pan until translucent. Remove with a slotted spoon and reserve.\nSaute the gnocchi in the pan with remaining butter until they're golden brown.\nStir in reserved shallots, garlic, pesto and seasoned cooked seasonal vegetables.\nPortion into 4-6 bowls and top with a fried egg. Lightly season with salt and pepper.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "2 h",
    "i": "3859425.jpg",
    "o": "",
    "st": "allrecipes"
}