{
    "id": 255299,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 cups bread flour, divided, or as needed",
        "1 (12 fluid ounce) can or bottle warm beer",
        "1/4 cup warm water",
        "3 tablespoons shortening",
        "1 tablespoon instant yeast",
        "1 tablespoon brown sugar",
        "2 teaspoons salt",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "1 tablespoon olive oil, or to taste, divided",
        "2 tablespoons cornmeal, or as needed",
        "16 sticks string cheese"
    ],
    "nut": [
        "Calories > 190 kcal",
        "Carbs > 23 g",
        "Cholesterol > 14 mg",
        "Fat > 6.7 g",
        "Protein > 8.5 g",
        "Sodium > 358 mg"
    ],
    "n": "Jan's Copycat Version of Pizza HutÂ®'s Stuffed Crust Pizza",
    "a": "What's for dinner, mom?",
    "r": "0",
    "s": 24,
    "des": "\"Perfectly chewy crust stuffed with cheese just like the pizzeria chain. Top with sauce and your favorite toppings.\"",
    "ins": "Combine 4 cups bread flour, beer, water, shortening, yeast, brown sugar, salt, garlic powder, and onion powder in the bowl of a stand mixer fitted with a dough hook attachment. Mix, adding remaining flour a little at a time, until dough pulls away from the sides of the bowl and forms into a ball, about 2 minutes.\nLightly grease a large bowl with 1 teaspoon olive oil. Add dough. Cover with a clean towel and let rise until doubled in size, about 1 hour.\nGrease 2 pizza pans with remaining 2 teaspoons olive oil; dust with cornmeal.\nPunch dough down gently and divide into 2 portions. Place dough on the prepared pans. Cover and let rest, about 5 minutes. Stretch dough out 1 inch past the edge of the pans.\nArrange 8 sticks of cheese, ends touching, around the edge of 1 pan. Fold overhang over cheese and press dough to seal. Repeat with second pan.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "4206579.jpg",
    "o": "",
    "st": "allrecipes"
}