{
    "id": 255278,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large egg, beaten",
        "1 tablespoon ketchup",
        "2 teaspoons Worcestershire sauce",
        "1 teaspoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon brown sugar",
        "1/2 teaspoon onion powder",
        "1/4 teaspoon garlic powder",
        "pinch dried thyme",
        "cayenne pepper to taste",
        "1/4 cup plain bread crumbs",
        "2/3 cup chopped cooked bacon",
        "1 pound ground chuck beef (85% lean)"
    ],
    "nut": [
        "Calories > 520 kcal",
        "Carbs > 8.9 g",
        "Cholesterol > 165 mg",
        "Fat > 37.7 g",
        "Protein > 33.9 g",
        "Sodium > 1389 mg"
    ],
    "n": "Chef John's Grilled Bacon Meatloaf Burgers",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"I love meatloaf, but not as much as I love meatloaf sandwiches. In fact, I'll make a meatloaf just for the leftovers. I'll fry the cold slice in a buttered pan until hot and crusty, and enjoy it on toast with ketchup.Â This recipe is basically that, plus bacon, in burger form.\"",
    "ins": "Whisk egg, ketchup, Worcestershire sauce, salt, brown sugar, onion powder, garlic powder, thyme, and cayenne pepper together in a bowl. Add breadcrumbs and chopped cooked bacon. Crumble in the ground beef. Mix with your fingers until bacon and breadcrumbs are distributed evenly.\nForm mixture into 4 burgers with your wet hands. Cover with plastic wrap and refrigerate until chilled thoroughly, about 3 hours.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nPlace burgers on the grate and cook, turing occasionally, until firm and cooked to your desired doneness. An instant-read thermometer inserted into the center should read between 145 and 150 degrees F (63 degrees C). Let burgers rest for a few minutes before serving.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}