{
    "id": 255215,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon kosher salt",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon seasoned salt (such as Johnny'sÂ®)",
        "2 pounds ground chuck",
        "4 teaspoons canola oil",
        "8 slices Monterey Jack cheese",
        "1/4 cup butter, melted",
        "4 Mexican telera rolls, split",
        "2 avocados, sliced into 1/4-inch wedges",
        "8 small butter lettuce leaves",
        "1 beefsteak tomato, cut into 4 thick slices",
        "1/2 red onion, thinly sliced",
        "12 strips cooked bacon",
        "1/4 cup mayonnaise",
        "2 tablespoons creamed horseradish"
    ],
    "nut": [
        "Calories > 1789 kcal",
        "Carbs > 82.2 g",
        "Cholesterol > 301 mg",
        "Fat > 121.6 g",
        "Protein > 93.5 g",
        "Sodium > 3729 mg"
    ],
    "n": "Jumbo Bacon Avocado Horseradish Cheeseburgers",
    "a": "ChefCookie",
    "r": "0",
    "s": 4,
    "des": "\"The slight kick of the horseradish-mayo gives these a great taste, and using the absolute freshest bread you can find will make it all come together beautifully. The recipe calls for telera rolls, but ciabatta or any fresh and soft roll will do if you can't find telera. You need a roll that holds its shape... You will also need more than one napkin.\"",
    "ins": "Mix kosher salt, black pepper, and seasoned salt together in a small bowl to make seasoning mixture.\nShape ground chuck into four 6-inch patties that are 3/4-inch thick. Press your thumb into the center of each patty to make an indentation. Brush 1/2 teaspoon oil over each side. Sprinkle 1/2 teaspoon seasoning mixture over each side.\nPlace seasoned patties on a plate lined with waxed paper and freeze until firm, about 15 minutes.\nFill a barbeque starter chimney with lump charcoal and ignite in an outdoor briquette barbecue grill; heat until charcoal turns white. Spread charcoal evenly on lower grate. Add upper grate, cover grill, and let heat for 5 minutes. Lightly oil the grate.\nGrill patties, covered, until browned, about 5 minutes. Flip and cook until second side is browned, about 4 minutes. Place 2 slices Monterey Jack cheese over each patty; cook until melted, about 1 minute. Transfer patties to a plate and tent with aluminum foil.\nBrush 1 tablespoon melted butter over insides of each roll. Place roll halves buttered-side down on the grill; toast until golden, 30 seconds to 1 minute. Transfer to a flat work surface.\nTop the bottom half of each roll with 1/4 of the avocados, 2 lettuce leaves, 1 tomato slice, 1/4 of the red onion slices, and 3 slices of bacon.\nWhisk mayonnaise and horseradish together in a bowl until smooth. Spread a thin layer of mayonnaise mixture on each burger patty and place over bacon slices. Cover with top halves of rolls.",
    "pt": "35 m",
    "ct": "11 m",
    "tt": "1 h ",
    "i": "3911429.jpg",
    "o": "",
    "st": "allrecipes"
}