{
    "id": 255267,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup margarine",
        "1/2 cup shortening",
        "2 cups white sugar",
        "5 eggs, separated",
        "2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1 cup buttermilk",
        "1 teaspoon vanilla extract",
        "1 cup chopped pecans",
        "1 (3.5 ounce) can flaked coconut",
        "Frosting:",
        "1 (8 ounce) package cream cheese, softened",
        "1/4 cup margarine, softened",
        "1 pound confectioners' sugar",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 751 kcal",
        "Carbs > 95.7 g",
        "Cholesterol > 99 mg",
        "Fat > 38.9 g",
        "Protein > 8.2 g",
        "Sodium > 374 mg"
    ],
    "n": "Nana's Italian Holiday Cream Cake",
    "a": "angelicvisions66",
    "r": "0",
    "s": 12,
    "des": "\"A delicious holiday cake that all will enjoy! Looks beautiful. Sprinkle top with chopped nuts.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9-inch baking pans.\nBeat 1/2 cup margarine and shortening in a bowl with an electric mixer until creamy. Beat in sugar. Beat in egg yolks until smooth.\nCombine flour and baking soda in a bowl. Add to the margarine mixture in batches, alternating with buttermilk, until batter is smooth. Mix in 1 teaspoon vanilla extract; add pecans and coconut.\nBeat egg whites with clean beaters in a glass, metal, or ceramic bowl until stiff peaks form. Fold into the batter. Pour into prepared pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 25 to 30 minutes. Cool in the pans for 10 minutes; invert onto a cooling rack. Cool completely, about 30 minutes.\nBeat cream cheese and 1/4 cup margarine in a bowl until smooth; stir in confectioners' sugar. Beat in 1 teaspoon vanilla extract until frosting is combined.\nSpread frosting onto the cooled cake layers. Stack cakes; frost top and sides.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}