{
    "id": 255269,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 (1 ounce) slices smoked bacon, cut into 1/2-inch strips",
        "1 large onion, chopped",
        "3 cloves garlic, minced",
        "1 (32 ounce) container chicken broth",
        "3 skinless, boneless chicken breasts",
        "1 (28 ounce) can diced tomatoes and mild green chile peppers (such as RO*TELÂ®)",
        "1 (14 ounce) can tomato sauce",
        "1 (14 ounce) can whole kernel corn",
        "3 chipotle peppers in adobo sauce, chopped, or to taste",
        "1 tablespoon salt",
        "1 tablespoon ground black pepper",
        "1 tablespoon ground cumin",
        "1 1/2 teaspoons dried cilantro",
        "3 (8 inch) flour tortillas, cut into strips",
        "1 (8 ounce) container sour cream",
        "1/2 cup shredded sharp Cheddar cheese"
    ],
    "nut": [
        "Calories > 455 kcal",
        "Carbs > 31.4 g",
        "Cholesterol > 70 mg",
        "Fat > 26.2 g",
        "Protein > 25.2 g",
        "Sodium > 2740 mg"
    ],
    "n": "Spicy Chicken Tortilla Soup",
    "a": "frankp",
    "r": "0",
    "s": 8,
    "des": "\"Quick and easy chicken tortilla soup.\"",
    "ins": "Cook bacon in a large skillet over medium heat until crispy, about 5 minutes. Drain on a paper towel, reserving 1 tablespoon grease in the skillet. Add onion and garlic to the skillet; cook and stir until onion are translucent, about 5 minutes.\nCombine chicken broth and chicken breasts in a large pot; bring to a boil. Cook until chicken breasts are no longer pink in the center, about 15 minutes. Remove chicken breasts from broth; cool until easily handled.\nStir bacon, onion, garlic, diced tomatoes and green chile peppers, and tomato sauce into the chicken broth. Add corn, chipotle peppers, salt, pepper, cumin, and cilantro.\nPreheat oven to 350 degrees F (175 degrees C). Place tortilla strips on a baking sheet.\nTear chicken breasts into small strips; add to the broth mixture. Cook and stir until soup flavors combine, about 20 minutes.\nBake tortilla strips in the preheated oven until slightly crisp, about 5 minutes.\nLadle soup into serving bowls. Top with sour cream; garnish with tortilla strips and Cheddar cheese.",
    "pt": "25 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "4459045.jpg",
    "o": "",
    "st": "allrecipes"
}