{
    "id": 255334,
    "old_rating": "4.68",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 eggs",
        "1/4 teaspoon water",
        "1 teaspoon olive oil",
        "8-inch non-stick skillet",
        "1 ounce freshly grated Parmigiano-Reggiano cheese, or a little less",
        "kosher salt and freshly ground black pepper to taste",
        "1 pinch cayenne pepper"
    ],
    "nut": [
        "Calories > 291 kcal",
        "Carbs > 1.9 g",
        "Cholesterol > 352 mg",
        "Fat > 21.7 g",
        "Protein > 22 g",
        "Sodium > 712 mg"
    ],
    "n": "Parmalet (Crisp Parmesan Omelet)",
    "a": "Chef John",
    "r": "0",
    "s": 1,
    "des": "\"I was attempting to achieve a crispy, inside-out Parmesan omelet--and it worked! The caramelized cheese formed a thin but protective layer and, since the eggs had never directly touched the pan, they were moist and tender. This will also work whether you use one or three eggs, depending on the texture you're going for. Using a single egg is kind of a cool trick, since the cheese layer is almost as thick, and you can really appreciate the crispness even more.\"",
    "ins": "Crack eggs into a mixing bowl. Add 1/4 teaspoon water. Whisk together until just beaten (do not overmix).\nDrizzle olive oil into 8-inch nonstick skillet. Brush evenly over the bottom of the pan. Evenly grate cheese into the skillet approximately 1/2-inch deep (or just shy of 1 ounce).\nPlace pan over medium-high heat. Cheese will slowly start to melt. When cheese starts to bubble and turn golden brown, about 4 minutes, pour eggs evenly over cheese. Reduce heat to low. Sprinkle with salt, pepper, and cayenne. Cover and let eggs cook on low until they are set, checking after the first 30 seconds. For 2 eggs, this should take about 1 minute, total cooking time. Remove pan from heat. Carefully use a spatula to fold \"parmalet\" in half. Transfer to serving plate.",
    "pt": "10 m",
    "ct": "5 m",
    "tt": "15 m",
    "i": "4529838.jpg",
    "o": "4529838.jpg,4529785.jpg,4468482.jpg,4104002.jpg,4099680.jpg,4099673.jpg",
    "st": "allrecipes"
}