{
    "id": 255396,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 spaghetti squash",
        "2 tablespoons olive oil",
        "1 large zucchini, chopped",
        "1 teaspoon sea salt",
        "1/2 teaspoon freshly ground black pepper to taste",
        "1 red bell pepper, sliced",
        "1 yellow onion, sliced",
        "2 cloves garlic, chopped",
        "2 cups trimmed fresh green beans",
        "1 (14 ounce) can diced tomatoes",
        "2 teaspoons Italian seasoning, or more to taste"
    ],
    "nut": [
        "Calories > 127 kcal",
        "Carbs > 18.3 g",
        "Cholesterol > 0 mg",
        "Fat > 5.4 g",
        "Protein > 3.1 g",
        "Sodium > 427 mg"
    ],
    "n": "Paleo Spaghetti Squash Primavera",
    "a": "Cindy Anschutz Barbieri",
    "r": "0",
    "s": 6,
    "des": "\"This was certainly the hit of the party. I served this paleo pasta primavera with my paleo pork roast loin and it disappeared right in front of me! Keep warm until ready to serve.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Poke about 10 holes into spaghetti squash; place in a baking pan.\nBake in the preheated oven until spaghetti squash is softened and partially cooked, about 25 minutes. Remove from oven; cool until easily handled. Reduce oven temperature to 350 degrees F (175 degrees C).\nCut spaghetti squash in half and seed. Pull the squash flesh from the peel with a fork.\nHeat oil in a braising pan over medium-high heat. Add zucchini, salt, and pepper; cook and stir until softened, 3 to 5 minutes. Add bell pepper, onion, and garlic; cook and stir until flavors combine, about 3 minutes. Stir in green beans; cook until bright green, about 2 minutes.\nStir diced tomatoes and Italian seasoning into the pan; simmer until tomatoes are warm, about 5 minutes. Add spaghetti squash; toss until combined. Cover with aluminum foil.\nBake in the preheated oven until spaghetti squash is tender, about 10 minutes.",
    "pt": "30 m",
    "ct": "48 m",
    "tt": "1 h ",
    "i": "4030055.jpg",
    "o": "",
    "st": "allrecipes"
}