{
    "id": 255486,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds turnips, peeled and cubed",
        "water to cover",
        "2 tablespoons olive oil, or more to taste",
        "4 leeks, white portion only, thinly sliced",
        "4 stalks celery, sliced",
        "4 cups chicken stock, divided",
        "6 strips cooked crispy bacon, or more to taste",
        "3 tablespoons cornstarch",
        "2 teaspoons salt, or to taste",
        "1/2 teaspoon ground black pepper, or to taste",
        "2 cups whole milk",
        "2 green onions, sliced, or more to taste"
    ],
    "nut": [
        "Calories > 203 kcal",
        "Carbs > 19.5 g",
        "Cholesterol > 21 mg",
        "Fat > 10.3 g",
        "Protein > 8.8 g",
        "Sodium > 1288 mg"
    ],
    "n": "Low-Carb Faux Potato Soup",
    "a": "NCSDIVER",
    "r": "0",
    "s": 10,
    "des": "\"This is a lower-carb version of potato soup that I created with my 7-year-old daughter for her mother. Both of my children, who eat healthy but can be notoriously picky, loved it. You are replacing potato with turnip, which makes this a very healthy and delicious low-carb, diabetic-friendly meal.\"",
    "ins": "Place turnips in a pot and add water until covered by 3 to 4 inches; bring to a boil. Cook, stirring every 5 to 10 minutes, until soft, about 30 minutes. Drain.\nHeat oil in the pot over medium heat. Add leeks and celery; cook and stir until slightly tender, about 5 minutes.\nBlend leek mixture, 1 cup chicken stock, bacon, cornstarch, salt, and pepper in a food processor until smooth. Pour back into the pot.\nBlend half of the turnips and 1 cup chicken stock in the food processor until smooth; pour into the pot. Repeat with remaining turnips and 1 cup chicken stock.\nPour remaining 1 cup chicken stock into the pot; stir in milk. Simmer, without boiling, until thickened, about 30 minutes. Ladle into bowls; garnish with green onions.",
    "pt": "40 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4006978.jpg",
    "o": "",
    "st": "allrecipes"
}