{
    "id": 255427,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 thick-cut boneless pork chops",
        "1 tablespoon crushed black peppercorns",
        "1 (9.74 ounce) package Idahoan Signatureâ„¢ Russets Mashed Potatoes",
        "1/4 cup butter",
        "2 tablespoons olive oil",
        "4 cloves garlic, chopped",
        "1/2 teaspoon salt, or to taste",
        "2 tablespoons chopped fresh parsley",
        "1 teaspoon chopped fresh rosemary",
        "1 teaspoon chopped fresh sage",
        "1 teaspoon chopped fresh thyme",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1/4 cup dry sherry",
        "2 teaspoons cornstarch (optional)",
        "1 teaspoon water (optional)"
    ],
    "nut": [
        "Calories > 380 kcal",
        "Carbs > 5.1 g",
        "Cholesterol > 109 mg",
        "Fat > 22.8 g",
        "Protein > 36.8 g",
        "Sodium > 363 mg"
    ],
    "n": "Jan's Peppered Pork Chops With Mushrooms and Herb Sherry Sauce",
    "a": "Idahoan",
    "r": "0",
    "s": 6,
    "des": "\"Make a weeknight special in less than 30 minutes using pork chops, fresh herbs and a splash of sherry along with a side of Idahoan Signatureâ„¢ Russets Mashed Potatoes. Quick and easy but smells like a holiday feast you spent hours preparing!\"",
    "ins": "Press crushed pepper corns onto each side of pork chops.\nPrepare Idahoan Signatureâ„¢ Russets Mashed Potatoes according to package directions. Keep warm.\nHeat butter and olive oil in a large skillet over medium heat. Add garlic and cook until garlic begins to turn golden but not brown, 1 to 2 minutes. Add parsley, rosemary, sage, and thyme; cook for 2 minutes.\nPlace pork chops in skillet and cook 5 minutes; turn. Add mushrooms; season with salt. Slowly pour in dry sherry. Cover and cook another 5 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\nTransfer pork chops to a warm serving dish. Continue to cook mushrooms until tender, if needed. Mix together cornstarch and water; stir into skillet. Continue stirring until the sauce thickens slightly, about 1 minute.\nPour mushroom sauce over chops and serve immediately with a side of Prepare Idahoan Signatureâ„¢ Russets Mashed Potatoes.",
    "pt": "10 m",
    "ct": "12 m",
    "tt": "25 m",
    "i": "3961558.jpg",
    "o": "4071668.jpg,4070610.jpg,4069139.jpg,4008338.jpg,4006792.jpg,4006542.jpg",
    "st": "allrecipes"
}