{
    "id": 255488,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup butter",
        "2 large leeks, white and light green parts, chopped, or more to taste",
        "salt to taste",
        "1 red bell pepper, diced",
        "4 cloves garlic, minced, or more to taste",
        "1 chipotle pepper in adobo, minced, or more to taste",
        "1 pinch ground cumin, or to taste",
        "1 pinch dried thyme, or to taste",
        "white pepper to taste",
        "4 cups vegetable broth",
        "3 Yukon Gold potatoes, diced",
        "1/2 cup milk",
        "1/4 cup heavy whipping cream"
    ],
    "nut": [
        "Calories > 385 kcal",
        "Carbs > 48.8 g",
        "Cholesterol > 53 mg",
        "Fat > 18.7 g",
        "Protein > 7.4 g",
        "Sodium > 561 mg"
    ],
    "n": "Chipotle Leek and Potato Soup",
    "a": "Buffalo Winters",
    "r": "0",
    "s": 4,
    "des": "\"A spicy version of this classic soup. The smokiness of the adobo sauce and the bite of the chile balance the savory flavors of the potato and cream. Cumin and white pepper finish off this cozy soup. Best enjoyed next to a fire with a glass of red wine. Serve piping hot topped with sour cream and croutons or cheese and onion rings!\"",
    "ins": "Melt butter in a large pot over medium-low heat. Add leeks and salt; cook, stirring often, until very soft, about 20 minutes. Stir in red bell pepper and garlic; cook and stir for 2 minutes. Add chipotle pepper, cumin, thyme, and white pepper; cook and stir for 2 minutes.\nStir vegetable broth and potatoes into the pot. Bring to a boil; reduce heat to low and cover. Simmer soup, stirring occasionally, until potatoes are tender, about 30 minutes. Stir in milk and cream. Remove from heat and let cool slightly, 10 to 15 minutes.\nPuree soup with an immersion blender to desired smoothness. Simmer until heated through, about 5 minutes.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4436036.jpg",
    "o": "",
    "st": "allrecipes"
}