{
    "id": 255457,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups all-purpose flour",
        "1 teaspoon poppy seeds",
        "1 teaspoon baking powder",
        "1/8 teaspoon salt",
        "1/2 cup butter, at room temperature",
        "1/2 cup white sugar",
        "2 teaspoons vanilla extract",
        "1 teaspoon whiskey",
        "1 tablespoon fruit jam",
        "30 almond slices"
    ],
    "nut": [
        "Calories > 69 kcal",
        "Carbs > 8.8 g",
        "Cholesterol > 8 mg",
        "Fat > 3.4 g",
        "Protein > 0.8 g",
        "Sodium > 48 mg"
    ],
    "n": "Halloween Shortbread Poppy Seed Cookie Fingers",
    "a": "Bratz",
    "r": "0",
    "s": 30,
    "des": "\"Creepy Halloween fingers with bloody nails and liver spots! This poppy seed shortbread recipe adds some nice liver spots to the fingers. If you use red or purple jam to adhere the almond slivers, it will give them an added bloody look. \nCan be stored in an airtight container for up to 4 weeks.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nWhisk flour, poppy seeds, baking powder, and salt together in a bowl.\nBeat butter and sugar together in a stand mixer until light and fluffy, 3 to 5 minutes. Beat in vanilla extract and whiskey. Add the flour mixture; beat until dough is just combined and crumbly.\nChill dough in the refrigerator until set, about 10 minutes.\nDivide dough into 4 portions. Roll 1 portion of dough into a tube on a floured work surface; cut into 1-inch pieces. Place onto prepared baking sheet. Repeat with remaining dough. Flatten dough pieces to about 2 inches long and 3/4-inch wide.\nPress the flat side of a butter knife into 1 end of the dough pieces to make a small dent; dot with jam. Place almond slivers onto jam. Score 2 sets of slits with a knife to create knuckles.\nBake in the preheated oven until golden, about 7 minutes. Cool for 10 minutes before transferring to a wire rack to cook completely, about 20 minutes.",
    "pt": "20 m",
    "ct": "7 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}