{
    "id": 25554,
    "old_rating": "4.8125",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups all-purpose flour",
        "2 teaspoons baking powder",
        "7/8 cup butter",
        "3 egg yolks",
        "1 cup milk",
        "2 (14 ounce) cans sweetened condensed milk",
        "1 cup chopped walnuts",
        "1/4 cup brandy",
        "1/4 cup water"
    ],
    "nut": [
        "Calories > 582 kcal",
        "Carbs > 69.9 g",
        "Cholesterol > 111 mg",
        "Fat > 27.4 g",
        "Protein > 12.4 g",
        "Sodium > 250 mg"
    ],
    "n": "Torta De Hojas",
    "a": "ILIKECAKES",
    "r": "0",
    "s": 12,
    "des": "\"I loved this recipe 27 years ago when I was in Chile. I haven't made it in years, but I do remember my family really enjoyed it.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Mix together the flour and baking powder; set aside.\nIn a large bowl, beat the butter until creamy. Blend in the egg yolks, one at a time. Beat in the flour mixture alternately with the milk. The dough will be stiff like a cookie dough.\nDivide the dough into 10 pieces and shape into balls. Roll each ball into a 9-inch circle. Place on cookie sheets and prick with a fork in several places.\nBake cookies in batches in the preheated oven for 10 to 12 minutes, or until edges are just starting to brown. Let cool.\nIn a saucepan, boil the unopened cans of sweetened condensed milk for 3 hours. Monitor the water closely to make sure there is always water covering the cans. Remove cans from heat and let cool for 10 to 15 minutes.\nIn a small measuring cup, combine the brandy and water.\nPlace one cookie layer on serving plate. Brush with brandy mixture, then spread with the now-thickened condensed milk. Sprinkle with nuts. Continue stacking until all layers are used.",
    "pt": "45 m",
    "ct": "3 h ",
    "tt": "4 h ",
    "i": "644756.jpg",
    "o": "1130780.jpg,1130779.jpg,933932.jpg,726606.jpg,726605.jpg,704516.jpg",
    "st": "allrecipes"
}