{
    "id": 255524,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds peeled and seeded pumpkin, cut into small cubes",
        "5 1/4 cups white sugar",
        "1 lemon, cut into wedges and seeded",
        "1 (2 inch) piece fresh ginger, peeled and grated"
    ],
    "nut": [
        "Calories > 271 kcal",
        "Carbs > 70.1 g",
        "Cholesterol > 0 mg",
        "Fat > 0.1 g",
        "Protein > 0.7 g",
        "Sodium > < 1 mg"
    ],
    "n": "Pumpkin Ginger Jam",
    "a": "tatjanasok",
    "r": "0",
    "s": 16,
    "des": "\"I always loved pumpkin preserves, but this recipe is my favorite. You may decide to omit ginger and only add lemon, but in my opinion ginger makes it very special.\"",
    "ins": "Stir pumpkin and sugar together in a saucepan. Cover and let stand, 8 hours to overnight.\nPlace unpeeled lemon wedges in a food processor; puree until smooth.\nPlace pumpkin and sugar mixture in the saucepan over high heat. Stir in lemon and ginger. Bring to a rolling boil; cook, stirring frequently, until pumpkin is translucent but still holds its shape, about 30 minutes. Mash to desired consistency.\nBring a large pot of water to a boil. Add jars and lids; boil until sterilized, at least 5 minutes. Pack pumpkin mixture into hot jars, filling to within 1/4 inch of the top. Wipe the rims of the jars with a moist paper towel to remove any residue. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool, 12 to 24 hours. Press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
    "pt": "25 m",
    "ct": "1 h",
    "tt": "21 h ",
    "i": "4460388.jpg",
    "o": "",
    "st": "allrecipes"
}