{
    "id": 255590,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup all-purpose flour, or more as needed",
        "1 (16 ounce) package refrigerated pizza crust",
        "1 tablespoon cornmeal, or as needed",
        "6 cups water",
        "1/3 cup baking soda",
        "coarse salt"
    ],
    "nut": [
        "Calories > 221 kcal",
        "Carbs > 40.5 g",
        "Cholesterol > 0 mg",
        "Fat > 2.7 g",
        "Protein > 7.2 g",
        "Sodium > 4782 mg"
    ],
    "n": "Pizza Dough Pretzels",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"When you suddenly get a craving for homemade soft pretzels and you're not at the mall, you won't need to wait for dough to rise if you use store-bought pizza dough! Serve, of course, with mustard.\"",
    "ins": "Lightly flour a work surface. Place dough on flour and sprinkle more on top. Begin to knead dough, kneading about 2 tablespoons flour into dough until it is soft and supple but not too sticky, 5 to 10 minutes. Cover with a large bowl and allow dough to rest and come to room temperature, 15 to 20 minutes.\nPreheat oven to 400 degrees F (200 degrees C). Line a rimmed baking sheet with parchment paper and sprinkle lightly with cornmeal.\nPlace water in a deep skillet. Whisk in baking soda to create an alkaline bath. Bring to a simmer over medium-high heat. Adjust heat to keep water at a low simmer while you shape the dough.\nDust dough with a sprinkling of flour as needed so that dough does not stick to work surface. Flatten slightly and divide into 6 equal pieces. Shape each piece into a round dough ball.\nShape each dough ball into a disk, thinner in the middle, thicker around the edges. Poke a hole in the center. Gently keep pulling and stretching until you've achieved a round pretzel shape that's not too thick.\nTransfer pretzels (in batches if necessary) to simmering alkaline bath. Boil about 30 seconds per side. Transfer to prepared sheet with slotted spoon. Immediately sprinkle with coarse salt while pretzels are still wet and sticky. Let rest 5 to 10 minutes before baking.\nPlace on center rack in preheated oven until beautifully browned, and stretch marks have formed, about 20 minutes. Exact times will depend on the specific size and shape of your pretzel.\nTransfer to a rack to cool a bit.",
    "pt": "15 m",
    "ct": "22 m",
    "tt": "47 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}