{
    "id": 255586,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound ground beef, or more to taste",
        "1 onion, chopped, or more to taste",
        "1 pound bacon",
        "2 (15 ounce) cans kidney beans, undrained, or more to taste",
        "2 (15 ounce) cans baked beans, undrained, or more to taste",
        "1 (28 ounce) can diced stewed tomatoes, or more to taste",
        "1/2 cup brown sugar",
        "2 tablespoons barbeque rub (such as Great American Spice Co.â„¢ Pit Master)",
        "2 tablespoons chili powder",
        "1 tablespoon habanero-based hot sauce (such as Backdraft Fire SauceÂ®)",
        "2 teaspoons garlic powder"
    ],
    "nut": [
        "Calories > 196 kcal",
        "Carbs > 25.3 g",
        "Cholesterol > 22 mg",
        "Fat > 6.3 g",
        "Protein > 11.5 g",
        "Sodium > 810 mg"
    ],
    "n": "Micah's 4 1/2-Alarm Chili",
    "a": "Bhyphenlow",
    "r": "0",
    "s": 20,
    "des": "\"This is my sweet and spicy chili. Enough people have asked for the recipe that I decided to post it here! This makes a pretty big batch of chili. You can always halve the ingredients. Also, I probably make it a little bit differently each time, so it's no biggie if the ingredients aren't an exact match. I think that the chili is best when it has a few days to really combine the flavors.\"",
    "ins": "Combine ground beef and onion in a large skillet over medium heat; cook and stir until browned, 5 to 8 minutes. Pour off excess grease.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain and cut into pieces.\nCombine beef mixture, bacon, kidney beans, baked beans, tomatoes, brown sugar, barbeque rub, chili powder, hot sauce, and garlic powder in a large pot. Cook over medium-low heat, stirring every 30 minutes, until bubbling, 2 to 3 hours. Remove chili from heat and let cool, about 30 minutes.\nRefrigerate chili, 8 hours to overnight.\nReheat chili over low heat, stirring every 30 minutes, for at least 4 hours before serving.",
    "pt": "10 m",
    "ct": "6 h ",
    "tt": "14 h ",
    "i": "4065351.jpg",
    "o": "",
    "st": "allrecipes"
}