{
    "id": 255526,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 (3 ounce) packages sweetened gelatin mix (such as Jell-OÂ®), 5 different colors",
        "3 1/2 cups boiling water, divided",
        "3 1/2 cups cold water, divided",
        "1 (1 ounce) package unflavored gelatin powder",
        "1 (10 ounce) can sweetened condensed milk",
        "10 fluid ounces double cream",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 391 kcal",
        "Carbs > 54.5 g",
        "Cholesterol > 10 mg",
        "Fat > 16.3 g",
        "Protein > 8.4 g",
        "Sodium > 154 mg"
    ],
    "n": "Stained Glass Gelatin Cake",
    "a": "Rita",
    "r": "0",
    "s": 10,
    "des": "\"This showstopper cake is as delicious to eat as it is pretty to look at. Cubes of jelly are suspended in a creamy jelly and set in a mould, creating a stained glass effect. Use ready-made jelly pots to save some time.\"",
    "ins": "Place each gelatin mix in a separate bowl; stir 1/2 cup boiling water into each until completely dissolved, about 2 minutes. Stir 1/2 cup cold water into each gelatin mix; refrigerate until completely set, 4 hours to overnight.\nGrease a 9-inch cake pan or use a silicone mold. Slice the chilled gelatin into cubes and gently toss together; tip into the prepared cake pan.\nPour 1 cup cold water into a bowl and sprinkle unflavored gelatin over water; let sit until dissolved, 2 to 3 minutes. Add 1 cup boiling water and stir until gelatin is dissolved.\nPour sweetened condensed milk into a blender or food processor. Fill the condensed milk can with double cream and add to the blender with the unflavored gelatin mixture and vanilla extract. Blend mixture until well combined; pour over gelatin cubes in the cake pan. Evenly distribute milk mixture using a spatula.\nRefrigerate until set, 4 hours to overnight. Run a knife along the sides of the mold and invert cake onto a plate.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "4148964.jpg",
    "o": "",
    "st": "allrecipes"
}