{
    "id": 255514,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups cubed butternut squash",
        "3 tablespoons olive oil, divided",
        "1 1/2 cups raw cashews",
        "2 cups vegetable broth",
        "1/4 cup mellow white miso",
        "1/4 cup nutritional yeast",
        "2 tablespoons lemon juice",
        "1 (16 ounce) package farfalle (bow-tie) pasta",
        "2 cups diced yellow onion",
        "salt to taste",
        "3 leaves fresh sage, minced",
        "1/4 cup apple cider",
        "ground black pepper to taste",
        "1/4 cup chopped fresh parsley"
    ],
    "nut": [
        "Calories > 626 kcal",
        "Carbs > 86.2 g",
        "Cholesterol > 0 mg",
        "Fat > 24.6 g",
        "Protein > 21.9 g",
        "Sodium > 624 mg"
    ],
    "n": "Isa's Butternut Squash Vegan Alfredo Pasta",
    "a": "isachandra",
    "r": "0",
    "s": 6,
    "des": "\"Easy autumn vegan comfort food!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nCombine squash and 1 tablespoon oil on a baking sheet; toss until coated.\nRoast in the preheated oven until tender and lightly browned, about 25 minutes.\nBring a small pot of water to a boil. Add cashews; simmer until softened, about 20 minutes. Drain.\nCombine cashews and 1 1/2 cup broth in a blender; blend until very smooth. Add roasted squash, remaining 1/2 cup broth, miso, nutritional yeast, and lemon juice; blend until sauce is combined.\nBring a large pot of lightly salted water to a boil. Cook bow-tie pasta, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain, reserving 1 cup pasta water. Transfer pasta to a serving bowl.\nHeat remaining 2 tablespoons oil in a skillet over medium-high heat. Add onion and salt; cook and stir until golden brown, about 9 minutes. Add sage and stir until fragrant, about 1 minute. Pour in cider; cook, stirring up browned bits from the bottom of the skillet, 1 to 2 minutes.\nStir half of the cashew sauce into the pasta. Add onion mixture. Stir in enough reserved pasta water to thin and warm sauce. Season with pepper. Garnish with parsley.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "3960050.jpg",
    "o": "",
    "st": "allrecipes"
}