{
    "id": 255536,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "1 large onion, diced",
        "2 cloves garlic, minced",
        "1 tablespoon fresh thyme",
        "salt and ground black pepper to taste",
        "1 sheet frozen puff pastry, thawed",
        "1 pound tomatoes, sliced into 1/4-inch rounds",
        "1/2 cup grated Parmesan cheese, or more to taste",
        "1/2 cup panko bread crumbs",
        "1/2 cup crumbled feta cheese",
        "1 tablespoon fresh parsley",
        "1 egg, beaten",
        "2 tablespoons thinly sliced fresh basil"
    ],
    "nut": [
        "Calories > 381 kcal",
        "Carbs > 31 g",
        "Cholesterol > 53 mg",
        "Fat > 25.4 g",
        "Protein > 10.4 g",
        "Sodium > 442 mg"
    ],
    "n": "Tomato and Feta Galette",
    "a": "tcasa",
    "r": "0",
    "s": 6,
    "des": "\"A light and savory meal to use up all of those tomatoes from the garden.\"",
    "ins": "Heat butter and oil together in a skillet over medium heat; add onion. Cook and stir until onion is translucent, 10 to 15 minutes. Stir garlic, thyme, salt, and pepper into onion; cook and stir until fragrant, about 2 minutes. Remove skillet from heat.\nRoll out puff pastry on a lightly floured surface. Line a baking sheet with parchment paper and place puff pastry on parchment paper. Place baking sheet in the freezer.\nPreheat oven to 450 degrees F (230 degrees C).\nArrange tomato slices on a wire rack placed on top of a baking sheet. Sprinkle salt over tomato slices and set aside to drain tomatoes, about 10 minutes.\nMix Parmesan cheese, bread crumbs, feta cheese, and parsley together in a bowl. Spread 1/2 of this cheese mixture over the puff pastry, leaving a 1-inch border around the edges. Layer the onion mixture over cheese mixture layer.\nBlot tomatoes dry and arrange over onion layer. Sprinkle remaining cheese mixture over tomato layer. Fold the puff pastry border over the edges of the tomatoes and lightly brush egg over pastry.\nBake in the preheated oven until crust is golden and puffed, about 20 minutes. Sprinkle fresh basil over galette and allow to cool for 15 minutes before slicing.",
    "pt": "15 m",
    "ct": "32 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}