{
    "id": 255609,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 head cauliflower, broken into florets",
        "2 tablespoons hot water",
        "1/2 teaspoon saffron threads",
        "1/4 cup extra-virgin olive oil , divided",
        "3 links sweet Italian chicken sausage, diced",
        "1 large zucchini, chopped",
        "1 yellow onion, chopped",
        "1 carrot, grated",
        "2 cloves garlic, or more to taste, minced",
        "1/4 teaspoon ground cayenne pepper",
        "1 (15 ounce) can artichokes, drained",
        "3 cups chicken stock",
        "sea salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 1/2 cups snow peas"
    ],
    "nut": [
        "Calories > 427 kcal",
        "Carbs > 32 g",
        "Cholesterol > 26 mg",
        "Fat > 26.9 g",
        "Protein > 18.1 g",
        "Sodium > 2196 mg"
    ],
    "n": "Artichoke and Chicken Sausage Cauliflower \"Paella\"",
    "a": "Cindy Anschutz Barbieri",
    "r": "0",
    "s": 4,
    "des": "\"I just love a great one-pot dish that makes everyone go wow. I prepare, cook, and serve right out of my beautiful braising pan. You can also use your paella pan. \n\nThank you to D&D Market (the new Wethersfield, CT store) for the fresh ingredients to make this great recipe. Using cauliflower as your rice makes this dish a perfect paleo side dish or main course! This is also a stove-to-table dish without any mess in 30 minutes!\"",
    "ins": "Place cauliflower florets in a food processor; pulse into grains the size of rice.\nCombine hot water and saffron threads in a small bowl; let stand for 3 minutes to infuse.\nHeat 2 tablespoons olive oil in a paella pan over medium heat. Add sausage; cook and stir until browned, about 5 minutes. Stir in zucchini and onion; cook for 3 minutes. Add saffron infusion, carrot, garlic, and cayenne pepper; cook for 1 minute.\nStir cauliflower \"rice\" and artichokes into the pan. Cook and stir until slightly softened, about 3 minutes. Pour in stock; season with salt and pepper. Bring to a boil; reduce heat and simmer until most of the stock is absorbed, about 10 minutes. Stir in snow peas; simmer until all stock is absorbed, 3 to 5 minutes more.\nRemove paella from the heat and drizzle remaining 2 tablespoons olive oil on top.",
    "pt": "25 m",
    "ct": "27 m",
    "tt": "55 m",
    "i": "4476448.jpg",
    "o": "",
    "st": "allrecipes"
}