{
    "id": 255626,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 sugar pumpkin, halved and seeded",
        "1 teaspoon olive oil, or as needed",
        "1/4 cup chia seeds",
        "1 cup hot water",
        "1/3 cup crystallized sugar cane juice (such as SucanatÂ®)",
        "1/4 cup agave nectar",
        "1 1/2 cups spelt flour",
        "1 cup brown rice flour",
        "2 teaspoons baking powder",
        "2 teaspoons ground cinnamon",
        "1 teaspoon salt",
        "1 teaspoon ground nutmeg (optional)",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon ground cloves",
        "1/2 cup walnuts (optional)"
    ],
    "nut": [
        "Calories > 241 kcal",
        "Carbs > 44.2 g",
        "Cholesterol > 0 mg",
        "Fat > 6.2 g",
        "Protein > 5.6 g",
        "Sodium > 333 mg"
    ],
    "n": "Healthy Vegan Pumpkin Bread",
    "a": "ChrissyintheKitchen",
    "r": "0",
    "s": 10,
    "des": "\"Vegan pumpkin bread! This is an egg-free pumpkin bread. No oil, no butter, just pure flavor. I love this bread toasted with a little butter or ghee or margarine.\"",
    "ins": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add pumpkin, cover, and steam until fully cooked, 35 to 45 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan with olive oil.\nPlace chia seeds in a blender; add hot water and let sit for 5 minutes.\nScoop flesh out of pumpkin halves and add to blender. Add crystallized sugar cane juice and agave nectar to blender; blend until pumpkin mixture is very smooth.\nMix spelt flour, brown rice flour, baking powder, cinnamon, salt, nutmeg, allspice, and cloves together in a bowl. Fold pumpkin mixture and walnuts into flour mixture until batter is just mixed; spoon into the prepared loaf pan.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 1 to 1 1/2 hours.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}