{
    "id": 255604,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup unsalted butter",
        "1 cup sliced onion",
        "5 large cloves garlic, minced",
        "12 cups tightly packed sorrel leaves, stems and veins removed",
        "4 cups chicken stock",
        "2 cups water",
        "3 potatoes, peeled and diced",
        "1 large carrot, peeled and cut into matchsticks",
        "1 cup chopped fresh parsley",
        "3 sprigs fresh dill, chopped, or to taste",
        "1 tablespoon lemon juice",
        "1 teaspoon freshly ground black pepper",
        "1/4 teaspoon ground cayenne pepper, or more to taste"
    ],
    "nut": [
        "Calories > 379 kcal",
        "Carbs > 37.5 g",
        "Cholesterol > 66 mg",
        "Fat > 23.9 g",
        "Protein > 5.9 g",
        "Sodium > 1000 mg"
    ],
    "n": "Baba's Best Sorrel Soup",
    "a": "SandyS",
    "r": "0",
    "s": 4,
    "des": "\"This hearty, herbed soup has a wonderful old-world flavor! After I had experimented with and tweaked several sorrel soup recipes, my 88-year-old father-in-law declared it tasted like his mom made back in Poland - the ultimate compliment! It doesn't look like much, but is it ever tasty and filling. Use fresh sorrel in the spring, when the leaves are most tender. Top each serving with a dollop of sour cream and sprinkle with your favorite fresh herbs - parsley, dill, or cilantro. Serve with crusty bread or hearty biscuits.\"",
    "ins": "Melt butter in a large Dutch oven over medium heat. Add onion and garlic; cook and stir until soft, about 5 minutes. Add sorrel in batches, stirring well until wilted, 5 to 8 minutes in all.\nPour chicken stock and water into the Dutch oven. Stir in potatoes, carrot, parsley, dill, lemon juice, black pepper, and cayenne pepper. Simmer soup until flavors combine, about 1 hour.\nPuree soup with an immersion blender until mostly smooth before serving.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}