{
    "id": 255722,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 acorn squash, halved and seeded",
        "3 tablespoons butter, melted",
        "2 teaspoons garlic powder",
        "1/4 cup olive oil",
        "1 small red bell pepper, chopped",
        "1 small onion, chopped",
        "4 cloves garlic, minced",
        "1 (10 ounce) package frozen chopped spinach, thawed and squeezed dry",
        "3/4 cup Italian-seasoned bread crumbs",
        "1/4 cup grated Parmesan cheese",
        "1/4 cup crumbled feta cheese",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 487 kcal",
        "Carbs > 50.1 g",
        "Cholesterol > 42 mg",
        "Fat > 28.9 g",
        "Protein > 12.8 g",
        "Sodium > 811 mg"
    ],
    "n": "Spinach-Stuffed Acorn Squash",
    "a": "ChefSandi",
    "r": "0",
    "s": 4,
    "des": "\"A tasty choice for a vegetarian meal or even for non-vegetarians as a nice side dish.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nBrush insides of the acorn squash with melted butter. Dust with garlic powder. Place acorn squash halves cut-side up on the baking sheet.\nRoast in the preheated oven until tender, 50 to 60 minutes.\nHeat oil in a large skillet over medium-high heat. Cook red bell pepper until tender, about 4 minutes. Stir in onion and cook until softened, 3 to 4 minutes. Reduce heat to medium and add garlic; cook until fragrant, about 2 minutes. Stir in spinach until it turns dark green, about 3 minutes.\nStir bread crumbs into the skillet; cook until lightly toasted, 2 to 3 minutes. Remove from heat; add Parmesan cheese. Mix in feta cheese thoroughly. Season mixture with salt and pepper.\nFill acorn squash halves with the red bell pepper mixture, mounding it slightly on top.\nBake in the preheated oven until evenly browned, 20 to 25 minutes. Cool for 5 minutes before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}