{
    "id": 255715,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 pounds kabocha squash, peeled and cubed",
        "3/4 cup cassava flour",
        "2 pinches salt",
        "1 pinch ground nutmeg",
        "Balsamic-Saffron Sauce:",
        "1 tablespoon olive oil",
        "4 leaves fresh sage",
        "1 tablespoon coconut milk",
        "1 teaspoon coconut milk",
        "1/8 teaspoon saffron",
        "2 tablespoons aged balsamic vinegar, or to taste"
    ],
    "nut": [
        "Calories > 213 kcal",
        "Carbs > 42.6 g",
        "Cholesterol > 0 mg",
        "Fat > 4.9 g",
        "Protein > 2.1 g",
        "Sodium > 90 mg"
    ],
    "n": "Potato-Free Paleo Gnocchi",
    "a": "Little Bites of Beauty",
    "r": "0",
    "s": 4,
    "des": "\"Italians know it well, making gnocchi without the right potatoes can be a key for disaster. Imagine making gluten-free paleo gnocchi that are potato free as well! That's one tough recipe to come up with!\"",
    "ins": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add kabocha squash, cover, and steam until soft, 10 to 15 minutes.\nTransfer steamed squash to a bowl; mash with a fork or potato masher. Mix in cassava flour, 1 pinch of salt, and nutmeg until a dough forms.\nDust a flat work surface with cassava flour. Divide dough into pieces and roll into 1-inch thick logs. Cut into 1-inch gnocchi. Arrange gnocchi on a tray lined with parchment paper.\nHeat olive oil in a small skillet over medium heat. Cook sage leaves until crisp, 30 seconds to 1 minute. Press down with a fork to break leaves into small pieces. Stir in 1 tablespoon plus 1 teaspoon coconut milk and saffron. Simmer sauce until flavors combine, about 2 minutes. Remove from heat.\nBring a large pot of water to a boil. Add 1 pinch of salt. Slide gnocchi gently into the water; cook until they float to the surface, 4 to 5 minutes. Scoop out with a wire strainer and transfer to serving plates.\nCover gnocchi with 1 tablespoon of sauce. Drizzle some balsamic vinegar on top.",
    "pt": "20 m",
    "ct": "26 m",
    "tt": "46 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}