{
    "id": 255723,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 acorn squash, halved and seeded",
        "2 1/4 cups water",
        "1 1/2 cups whole wheat couscous",
        "2 tablespoons chopped fresh cilantro",
        "1 bunch fresh spinach, trimmed and coarsely chopped",
        "1 tablespoon margarine",
        "1/2 small onion, chopped",
        "1/2 teaspoon seasoned salt, or to taste (optional)",
        "salt and ground black pepper to taste",
        "1/4 cup crumbled feta cheese"
    ],
    "nut": [
        "Calories > 908 kcal",
        "Carbs > 170.5 g",
        "Cholesterol > 28 mg",
        "Fat > 16 g",
        "Protein > 35.6 g",
        "Sodium > 872 mg"
    ],
    "n": "Couscous-Stuffed Acorn Squash",
    "a": "Kaeli L",
    "r": "0",
    "s": 2,
    "des": "\"A delicious, comforting Buttercup squash stuffed with couscous, spinach, cilantro, onions, and topped with feta cheese that is both sweet and savory. Great for that cold fall night!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Place acorn squash cut-side down on baking sheet.\nBake squash in the preheated oven until tender when pierced with a fork, about 45 minutes. Flip to face up and let cool slightly.\nBring 2 1/4 cups water to a boil in a saucepan; remove from heat and stir in couscous and cilantro. Cover saucepan and let stand until water is absorbed completely, about 10 minutes. Fluff couscous with a fork.\nBring a large pot of water to a boil. Add spinach and cook until wilted, 3 to 5 minutes. Drain; use paper towels to squeeze out excess moisture. Fold into couscous.\nMelt margarine in a skillet. Add onion; cook and stir until browned, about 10 minutes. Mix onion into the couscous mixture. Stir in seasoned salt, salt, and pepper.\nStuff acorn squash halves with couscous mixture. Sprinkle feta cheese on top.\nBake in the preheated oven until heated through, about 15 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}