{
    "id": 255864,
    "old_rating": "4.22222",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 skinless, boneless chicken breast half - lightly pounded to an even thickness",
        "1 teaspoon kosher salt",
        "1 tablespoon berbere spice blend, or to taste",
        "2 teaspoons butter",
        "1 lime, juiced",
        "2 teaspoons tomato paste",
        "1/4 cup chicken broth, or as needed",
        "1/3 cup coconut milk",
        "1/2 teaspoon berbere spice blend, or to taste",
        "Salt to taste",
        "1 tablespoon chopped cilantro"
    ],
    "nut": [
        "Calories > 431 kcal",
        "Carbs > 15.6 g",
        "Cholesterol > 92 mg",
        "Fat > 28.1 g",
        "Protein > 28.3 g",
        "Sodium > 3342 mg"
    ],
    "n": "Berbere Spiced Chicken Breasts",
    "a": "Chef John",
    "r": "0",
    "s": 1,
    "des": "\"One of my favorite uses for berbere spice is this chicken breast recipe. But you can use a pork chop or a piece of lamb, it's so versatile.\"",
    "ins": "Season both sides of chicken breast with salt. Sprinkle 1 tablespoon berbere spice mix to coat both sides of chicken breast (see Cook's Note for recipe link).\nMelt butter in a skillet over medium-high heat until it just starts to turn brown. Immediately transfer chicken breast to skillet; cook 2 to 3 minutes per side. Transfer chicken to a warm dish.\nStir in lime juice, tomato paste, chicken broth, and coconut milk; stir to deglaze pan. Bring to a simmer while stirring. Add 1/2 teaspoon berbere spice and a pinch of salt. Transfer chicken breast back to skillet; reduce heat to medium-low. Cook until chicken is cooked through and sauce starts to reduce, basting chicken with pan juices as it cooks, 4 or 5 more minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nSprinkle with chopped cilantro. Serve with a drizzle of the pan sauce.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "20 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}