{
    "id": 255854,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "16 ounces lamb sweetbreads",
        "7 tablespoons butter, divided",
        "1/2 lemon, juiced",
        "salt to taste",
        "2 large portobello mushrooms, diced",
        "1 tablespoon all-purpose flour",
        "1 teaspoon ground paprika",
        "1/2 teaspoon cayenne pepper",
        "1 cup warmed milk, or to taste",
        "2 cups frozen peas",
        "1 jalapeno pepper, thinly sliced"
    ],
    "nut": [
        "Calories > 375 kcal",
        "Carbs > 4.8 g",
        "Cholesterol > 326 mg",
        "Fat > 31.6 g",
        "Protein > 17.8 g",
        "Sodium > 242 mg"
    ],
    "n": "Spicy Sweetbreads",
    "a": "kiwijock",
    "r": "0",
    "s": 4,
    "des": "\"Sweetbreads are tasty and easily digested. I couldn't find a spicy recipe so invented this simple, delicious dish. The sliced jalapeno gives a lovely bite of heat.\"",
    "ins": "Soak sweetbreads in a large bowl of water for 1 hour; drain.\nPlace sweetbreads in a saucepan and cover with cold water; bring to a boil. Drain. Run cold water over sweetbreads to cool.\nReturn sweetbreads to the saucepan and cover with cold water again. Add 1 tablespoon butter, lemon juice, and salt; bring to a boil. Simmer for 10 minutes. Remove from heat and let cool.\nMelt 3 tablespoons butter in a heavy-bottomed skillet over medium heat. Add mushrooms; cook and stir until tender, about 5 minutes. Transfer to a plate.\nMelt remaining 3 tablespoons butter in the skillet. Add flour; cook and stir until a paste forms, about 1 minute. Season with paprika and cayenne. Pour in milk slowly, whisking until sauce is smooth, 3 to 5 minutes.\nStir sweetbreads, mushrooms, and peas into the sauce; cook until peas are heated through, about 5 minutes. Season sweetbreads with salt. Serve garnished with jalapeno pepper.",
    "pt": "15 m",
    "ct": "34 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}