{
    "id": 255823,
    "old_rating": "4.65574",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon olive oil",
        "12 ounces sweet bulk Italian sausage",
        "1 stalk celery, diced",
        "1/2 yellow onion, chopped",
        "3/4 cup dry elbow macaroni",
        "1/4 cup tomato paste",
        "3 cups chicken broth, or more as needed, divided",
        "Salt and freshly ground black pepper to taste",
        "1/4 teaspoon crushed red pepper flakes, or to taste",
        "1/4 teaspoon dried oregano",
        "3 cups chopped Swiss chard",
        "1 (15 ounce) can cannellini (white kidney) beans, drained",
        "1/4 cup grated Parmigiano-Reggiano cheese, plus additional for serving, or to taste"
    ],
    "nut": [
        "Calories > 883 kcal",
        "Carbs > 76.9 g",
        "Cholesterol > 82 mg",
        "Fat > 43.7 g",
        "Protein > 43.5 g",
        "Sodium > 3894 mg"
    ],
    "n": "Pasta Fazool (Pasta e Fagioli)",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"This classic Italian-American comfort food works with any kind of sausage, but I like the fennel and anise flavors of sweet Italian sausage with the beans--it's a hearty soup that's fast and easy to put together.\"",
    "ins": "Heat oil in a skillet over medium-high sausage. Brown sausage while breaking it into small pieces, about 5 minutes. Reduce heat to medium. Add diced celery and chopped onion. Cook until onions are translucent, 4 to 5 minutes. Add dry pasta. Cook and stir 2 minutes.\nStir in tomato paste until evenly distributed, 2 to 3 minutes. Add 3 cups broth. Raise heat to high and bring to a simmer. Add salt, black pepper, pepper flakes, and oregano. When soup comes to a boil, reduce heat to medium and let it simmer about 5 minutes, stirring often. Check soup consistency and add more broth, if needed.\nPlace chopped chard in a bowl. Cover with cold water and rinse the leaves; any grit will fall to the bottom of the bowl. Transfer chard to colander to drain briefly; add to soup. Cook and stir until leaves wilt, 2 to 3 minutes.\nStir in white beans; continue cooking and stirring until pasta is perfectly cooked, another 4 or 5 minutes. Remove from heat and stir in grated cheese. Serve topped with grated cheese, if desired.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "35 m",
    "i": "4485345.jpg",
    "o": "4485345.jpg,4478167.jpg,4470955.jpg,4468330.jpg,4467315.jpg,4467295.jpg",
    "st": "allrecipes"
}