{
    "id": 255814,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup clam juice",
        "1/4 teaspoon dried oregano",
        "1 pound large shrimp, peeled and deveined",
        "1 1/4 cups peeled, seeded, diced ripe tomatoes",
        "1 cup diced English cucumber",
        "1/2 cup diced celery",
        "1/2 cup finely diced red onion",
        "2 tablespoons seeded and diced jalapeno peppers",
        "1/2 cup ketchup",
        "2 limes, juiced",
        "2 tablespoons freshly chopped cilantro, plus more for garnish",
        "Mexican-style hot sauce, to taste",
        "1 large Hass avocado, cubed"
    ],
    "nut": [
        "Calories > 268 kcal",
        "Carbs > 22.8 g",
        "Cholesterol > 174 mg",
        "Fat > 11.7 g",
        "Protein > 22.2 g",
        "Sodium > 690 mg"
    ],
    "n": "Mexican-Style Shrimp Cocktail",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"You can pretty much get Mexican food like tacos and burritos in just about any corner of the country these days. However, Mexican Shrimp Cocktails don't seem to have caught on elsewhere as they have in the Bay Area. Here's my version--you can adapt your own recipe using the listed ingredients and amounts as a rough guide.\"",
    "ins": "Place clam juice and oregano in a saucepan; bring to a boil over medium-high heat. Add shrimp and stir just until shrimp turn pink and are not quite cooked through, about 2 minutes. Transfer shrimp to a bowl with a slotted spoon. Reserve liquid. Let shrimp cool to room temperature.\nPlace chopped tomatoes, cucumbers, celery, red onion, and jalapenos is a mixing bowl. Add ketchup, cooking liquid from the shrimp, lime juice, cilantro, and hot sauce. Gently mix until ingredients are well blended.\nChop shrimp into bite-size pieces, leaving a few whole for garnishes. Stir chopped pieces into the vegetable mixture. Wrap mixing bowl with plastic wrap. Place reserved shrimp in a bowl; wrap with plastic wrap. Refrigerate shrimp cocktail and reserved shrimp until thoroughly chilled, 2 to 3 hours.\nIf mixture seems a bit thick, add a little tomato juice or pickle juice. Stir in avocado cubes. Serve, if possible, in clear glass bowls. Top with reserved whole shrimp and some cilantro leaves.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}