{
    "id": 255868,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup pecans",
        "1/2 cup all-purpose flour",
        "1/2 cup whole wheat flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "6 tablespoons cold butter, cut into small cubes",
        "1/4 cup cold water",
        "1/4 cup dark brown sugar",
        "1 cup pumpkin puree",
        "1 teaspoon vegetable oil"
    ],
    "nut": [
        "Calories > 317 kcal",
        "Carbs > 34.2 g",
        "Cholesterol > 37 mg",
        "Fat > 19.5 g",
        "Protein > 4.2 g",
        "Sodium > 599 mg"
    ],
    "n": "Pumpkin Pecan Biscuits",
    "a": "Kristina S.",
    "r": "0",
    "s": 5,
    "des": "\"Pumpkin and pecans is an irresistible combination. The good thing about these biscuits is that they can easily be transformed from sweet to savory by cutting down on brown sugar or putting no sugar at all. Perfect to serve on Thanksgiving.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spread pecans on a baking sheet.\nToast pecans in the preheated oven until golden brown and fragrant, about 5 minutes. Chop coarsely.\nIncrease oven temperature to 425 degrees F (220 degrees C). Brush a large rimmed baking sheet with oil.\nMix all-purpose flour, whole wheat flour, baking powder, and salt together in a bowl. Rub butter into the mixture until it reaches a crumbly consistency.\nStir water and brown sugar together in a bowl. Blend into crumbly mixture. Stir in pumpkin puree and fold in pecans. Wrap dough in plastic wrap.\nChill dough in the freezer for 10 minutes.\nDivide dough into 5 pieces and shape into balls. Flatten slightly and place 1 inch apart on the prepared baking sheet.\nBake in the preheated oven until puffed and golden brown, 12 to 15 minutes. Transfer to a wire rack and cool completely, about 20 minutes.",
    "pt": "15 m",
    "ct": "17 m",
    "tt": "1 h ",
    "i": "4446313.jpg",
    "o": "",
    "st": "allrecipes"
}