{
    "id": 255974,
    "old_rating": "2.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Poached Eggs:",
        "1 teaspoon vinegar",
        "4 eggs",
        "White Cheddar Hollandaise:",
        "2 egg yolks",
        "2 tablespoons lemon juice",
        "2 tablespoons water",
        "1/2 cup butter",
        "1/2 cup shredded white Cheddar cheese",
        "Benedict:",
        "4 English muffins",
        "2 avocados - peeled, pitted, and thinly sliced",
        "4 Jones Dairy Farm All Natural Golden BrownÂ® Breakfast Sausage Patties, prepared",
        "Salt and pepper to taste"
    ],
    "nut": [
        "Calories > 601 kcal",
        "Carbs > 27.2 g",
        "Cholesterol > 367 mg",
        "Fat > 47.3 g",
        "Protein > 19.1 g",
        "Sodium > 769 mg"
    ],
    "n": "Sausage Avocado Benedict with White Cheddar Hollandaise",
    "a": "Jones Dairy Farm",
    "r": "0",
    "s": 4,
    "des": "\"When it's time to impress, turn to this indulgent benedict made with Jones breakfast sausage, creamy avocados and an incredible white Cheddar hollandaise.\"",
    "ins": "For the Poached Eggs: Fill pan with 2-inches of water and bring to a simmer, add vinegar. Gently crack eggs one at a time into the water, using a spoon to gather egg whites around egg yolks.\nAllow eggs to simmer just until whites are set, approximately 2 minutes. Remove eggs from water, and set aside.\nFor the White Cheddar Hollandaise: While eggs are poaching begin hollandaise. In medium bowl whisk together egg yolks, lemon juice and water until light yellow. Set aside. In small saucepan melt butter over medium-low heat. Add 1 tablespoon melted butter at a time to egg yolk mixture, whisking constantly until fully incorporated. Pour mixture into saucepan and continue to whisk until warmed through and thickened. In last minute, whisk in white cheddar cheese until melted.\nToast English muffins until golden brown. Top each with avocado and sausage patty. Top sausages with fresh poached egg and drizzle with white cheddar hollandaise. Serve immediately.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "4093598.jpg",
    "o": "",
    "st": "allrecipes"
}