{
    "id": 255904,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 sheet frozen puff pastry - thawed, unfolded, and lightly rolled",
        "2 Bartlett pears, halved and cored",
        "2 d'Anjou pears, halved and cored",
        "1 red pear, halved and cored",
        "2 tablespoons white sugar",
        "1/2 lemon, juiced",
        "1/2 (8 ounce) package cream cheese, softened",
        "1/2 cup confectioners' sugar",
        "1/2 teaspoon vanilla extract",
        "1 tablespoon turbinado sugar"
    ],
    "nut": [
        "Calories > 326 kcal",
        "Carbs > 43.2 g",
        "Cholesterol > 15 mg",
        "Fat > 16.5 g",
        "Protein > 3.7 g",
        "Sodium > 118 mg"
    ],
    "n": "Hasselback Pear Tart",
    "a": "Nicholio",
    "r": "0",
    "s": 8,
    "des": "\"Using the Hasselback method on pears makes them even easier to arrange in this delicious fall tart.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Fit puff pastry into a 10-inch square tart pan with removable sides.\nPlace a pear half, cut-side down, onto a work surface. Place a chopstick above and below the pear half, so the pear is framed on the top and bottom. Thinly slice the pear half lengthwise, stopping when the knife hits the chopstick and leaving the bottom 1/4 inch of the pear intact. Repeat with the remaining pear halves.\nPlace hasselbacked pears in a bowl; add white sugar and lemon juice and gently toss to coat. Let hasselbacked pears stand for 5 minutes.\nMix cream cheese, confectioners' sugar, and vanilla extract together in a bowl; spread over puff pastry. Arrange hasselbacked pears over cream cheese layer, cutting some of the halves into quarters if needed to fit them in. Slightly fan out each pear and drizzle any accumulated juices from the pear bowl over pears. Sprinkle turbinado sugar over tart.\nBake in the preheated oven until crust is puffed and lightly browned and juices are bubbling, about 35 minutes. Cool tart for 15 minutes before slicing.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "4049911.jpg",
    "o": "",
    "st": "allrecipes"
}