{
    "id": 255907,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup brown sugar",
        "1 tablespoon ground paprika",
        "1 teaspoon dry mustard",
        "1/4 teaspoon cayenne pepper",
        "1 (12 fl oz) can caffeinated pepper-type soda (such as Dr PepperÂ®)",
        "3/4 cup ketchup",
        "1/4 cup Worcestershire sauce",
        "8 slices bacon",
        "1 large onion, finely chopped",
        "1 clove garlic, minced",
        "1/4 cup bourbon",
        "2 (16 ounce) cans baked beans with pork"
    ],
    "nut": [
        "Calories > 306 kcal",
        "Carbs > 51.8 g",
        "Cholesterol > 18 mg",
        "Fat > 5.8 g",
        "Protein > 10.2 g",
        "Sodium > 928 mg"
    ],
    "n": "Bourbon and DP Baked Beans",
    "a": "dwfalls78",
    "r": "0",
    "s": 8,
    "des": "\"I came up with this recipe after having made some bourbon baked beans and seeing a recipe for cola baked beans and I thought: Why not combine the two?\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nMix brown sugar, paprika, mustard, and cayenne pepper together in a bowl. Whisk in pepper soda, ketchup, and Worcestershire sauce until brown sugar is dissolved.\nCut 4 slices of bacon into small strips. Cook and stir in a large Dutch oven over medium heat until almost crispy, 3 to 5 minutes. Transfer to a bowl, reserving bacon grease.\nStir onion into the bacon grease in the Dutch oven; cook and stir until soft, 3 to 5 minutes. Add garlic; cook and stir for 1 minute. Pour in bourbon, stirring to scrape up browned bits off the bottom with a wooden spoon. Stir bacon strips back in.\nPour brown sugar mixture and baked beans into the Dutch oven. Simmer until beans are heated through, about 15 minutes. Arrange remaining 4 slices of bacon on top of the beans.\nBake in the preheated oven, covered, until beans are bubbly and sauce is syrupy, about 3 hours.",
    "pt": "15 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "4433812.jpg",
    "o": "",
    "st": "allrecipes"
}