{
    "id": 255921,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 skinless, boneless chicken breasts",
        "1/2 teaspoon salt, or to taste",
        "1 tablespoon vegetable oil",
        "1 onion, finely chopped",
        "1 tomato, finely chopped",
        "1 green bell pepper, finely chopped",
        "1 teaspoon chicken bouillon granules",
        "1/2 teaspoon ground black pepper",
        "1 pound corn tortillas",
        "vegetable oil for frying",
        "Tomato Sauce:",
        "1/4 cup water",
        "1 (6.5 ounce) can tomato sauce",
        "1/2 teaspoon chicken bouillon granules",
        "1/2 teaspoon seasoned salt"
    ],
    "nut": [
        "Calories > 347 kcal",
        "Carbs > 49.4 g",
        "Cholesterol > 23 mg",
        "Fat > 11 g",
        "Protein > 15.6 g",
        "Sodium > 694 mg"
    ],
    "n": "Honduran-Style Crispy Fried Tacos",
    "a": "Nissi Pineda",
    "r": "0",
    "s": 5,
    "des": "\"This is one of my favorites to make when it comes to deep-fried appetizers!\n My mom is Honduran and taught me how to make these amazing crispy tacos.\n Serve topped with white cheese, onion sauce, or chopped cabbage.\"",
    "ins": "Place chicken breasts and salt in a pot; cover halfway with water. Bring to a boil; cook until an instant-read thermometer inserted into the center reads at least 165 degrees F (74 degrees C), about 15 minutes. Cool until easily handled, about 5 minutes. Shred into thin pieces.\nHeat 1 tablespoon vegetable oil in a large skillet over medium heat. Add onion, tomato, and green bell peppers; cook and stir until softened, about 2 minutes. Stir in shredded chicken, 1 teaspoon chicken bouillon, and black pepper; cook until golden brown, about 5 minutes.\nSpoon some of the chicken mixture into the middle of each corn tortilla. Fold tortilla around filling and secure with a toothpick.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Fry tortillas in batches until golden and crispy, about 2 minutes per side. Drain on paper towels.\nBring 1/4 cup water to a boil in a small saucepan. Add tomato sauce, 1/2 teaspoon chicken bouillon, and seasoned salt. Cook and stir over medium-high heat until sauce thickens, about 5 minutes. Serve sauce over tacos.",
    "pt": "25 m",
    "ct": "41 m",
    "tt": "1 h ",
    "i": "4116217.jpg",
    "o": "",
    "st": "allrecipes"
}