{
    "id": 255935,
    "old_rating": "4.90909",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups all-purpose flour",
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon cream of tartar",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ginger",
        "1/4 teaspoon allspice",
        "1/4 teaspoon ground cloves",
        "1/8 teaspoon nutmeg",
        "1/2 cup unsalted butter",
        "1/2 cup white sugar",
        "1/3 cup light brown sugar, packed",
        "1 teaspoon vanilla extract",
        "1 large egg",
        "Rolling Sugar:",
        "1/4 cup white sugar",
        "2 teaspoons cinnamon",
        "Glaze (Optional):",
        "1/4 cup confectioners' sugar",
        "1 tablespoon milk, or as needed"
    ],
    "nut": [
        "Calories > 144 kcal",
        "Carbs > 22.4 g",
        "Cholesterol > 24 mg",
        "Fat > 5.5 g",
        "Protein > 1.5 g",
        "Sodium > 95 mg"
    ],
    "n": "Chef John's Pumpkin Spice Snickerdoodles",
    "a": "Chef John",
    "r": "0",
    "s": 18,
    "des": "\"I'm usually not a big fan of snickerdoodles, but I had a feeling the pumpkin spice would work perfectly with the buttery, cinnamon sugar cookie, and it did.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a rimmed baking sheet with a silicone mat or parchment paper.\nPlace flour, salt, baking soda, and cream of tartar in a mixing bowl. Add cinnamon, ginger, allspice, clove, and nutmeg. Whisk until thoroughly mixed, 1 or 2 minutes.\nPlace butter, sugar, and brown sugar in a separate mixing bowl. Cream together with a spatula or wooden spoon until mixture is smooth, 2 or 3 minutes. Add vanilla and egg. Stir until thoroughly combined.\nPour flour mixture into butter mixture. Stir until just combined or until the flour disappears.\nWrap bowl in plastic wrap. Chill dough in refrigerator for about 1 hour.\nStir cinnamon and sugar together in a shallow bowl or plate.\nScoop dough into 2 tablespoon balls. Roll in cinnamon-sugar mixture to coat all sides. Roll into smooth ball and place on prepared baking sheet, 3 to 4 inches apart. Flatten slightly.\nBake in preheated oven until browned, 10 to 12 minutes.\nCool on baking sheet 5 minutes; sprinkle with additional cinnamon-sugar mixture, if desired. Transfer cookies to cooling rack to cool completely.\nIf you'd like to add a bit of a shine to your cookies, you can brush them with a simple glaze. Mix confectioners' sugar with milk or lemon juice to achieve brushing consistency. Brush onto cookies. Sprinkle with more cinnamon sugar or pumpkin pie spice, if desired.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}