{
    "id": 255932,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 Hatch chile peppers, halved and seeded",
        "4 cups water, or more as needed",
        "1 (15 ounce) can cream-style corn",
        "3 skinless, boneless chicken breasts",
        "1/2 teaspoon ground cumin, or more to taste",
        "1/2 cup shredded carrots",
        "3 1/2 teaspoons chicken stock concentrate (such as KnorrÂ® Homestyle)",
        "3 cloves garlic, crushed",
        "1/4 teaspoon poultry seasoning",
        "1 cup cooked rice",
        "1/2 (8 ounce) package processed cheese food (such as VelveetaÂ®)"
    ],
    "nut": [
        "Calories > 361 kcal",
        "Carbs > 42.8 g",
        "Cholesterol > 69 mg",
        "Fat > 9.9 g",
        "Protein > 27.7 g",
        "Sodium > 1440 mg"
    ],
    "n": "Green Chile Chicken Corn Chowder",
    "a": "snowwhiteRN",
    "r": "0",
    "s": 4,
    "des": "\"I bought a ton of Hatch green chiles in August and thought a soup/chowder would be a good way to use them in the winter. They were spicier than I expected so I had to use rice and corn in the soup to cut the spice level. My parents loved it so I passed it on to them, then the girls at work loved it so I passed the recipe on to them also. Hopefully, y'all will love it too. It's a nice comfort food. Serve topped with cheese.\"",
    "ins": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil; place chile peppers cut-side down on top.\nCook chile peppers under the preheated broiler until the skins are blackened and blistered, 5 to 8 minutes. Place in a bowl and tightly seal with plastic wrap. Allow peppers to steam as they cool, about 20 minutes. Remove and discard skins.\nTransfer chile peppers to a large stockpot. Add 4 cups water, corn, chicken breasts, carrots, chicken stock concentrate, garlic, cumin, and poultry seasoning. Bring to a boil; reduce heat and simmer chowder until chicken is falling apart, about 1 hour.\nRemove chicken and green chile peppers from the stockpot. Shred into small pieces and stir back into the chowder.\nStir rice and processed cheese into the chowder until cheese is melted, about 5 minutes. Thin chowder with extra water if it appears too thick.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4420572.jpg",
    "o": "",
    "st": "allrecipes"
}