{
    "id": 256077,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup pecans",
        "1 cup rolled oats",
        "1/4 cup peanut butter",
        "2 tablespoons coconut oil",
        "1/4 cup cocoa powder",
        "3 tablespoons maple syrup",
        "coarse sea salt"
    ],
    "nut": [
        "Calories > 130 kcal",
        "Carbs > 9.1 g",
        "Cholesterol > 0 mg",
        "Fat > 10.2 g",
        "Protein > 2.8 g",
        "Sodium > 42 mg"
    ],
    "n": "Healthy Salted Dark Chocolate Peanut Butter Oatmeal Truffles",
    "a": "Ellen23",
    "r": "0",
    "s": 15,
    "des": "\"These healthy truffles will blow you away! The soft, nutty, peanut butter oatmeal center combined with the salted dark chocolate outer layer make them a delicious dessert. They are fairly easy to make with just a handful of ingredients, so I like to whip them up in small batches for the week and keep the in the fridge. If you'd like to make more, you can definitely double or triple the recipe!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spread pecans in a single layer on a baking sheet.\nBake pecans in the preheated oven until toasted and fragrant, about 10 minutes. Transfer to a bowl and refrigerate until cool, about 10 minutes.\nCombine toasted pecans, rolled oats, and peanut butter in a food processor or blender; blend, stopping to scrape down sides, until a thick \"dough\" forms.\nMicrowave coconut oil in a microwave-safe bowl until melted, 10 to 15 seconds. Stir in cocoa powder and maple syrup until smooth. Line a baking sheet with aluminum foil.\nRoll dough into 1-inch balls with your hands. Dip balls one at a time in the chocolate mixture using a spoon or fork, covering all sides. Transfer to the baking sheet. Let truffles sit, 3 to 5 minutes. Sprinkle sea salt on top.\nRefrigerate truffles until set, about 20 minutes.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "58 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}