{
    "id": 256020,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups frozen precooked rice (such as InnovAsianÂ®)",
        "1 cup coarsely chopped pitted green olives",
        "3/4 cup low-sodium chicken broth",
        "1 orange, juiced",
        "1 teaspoon finely grated orange zest",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon ground black pepper",
        "1 pound medium shrimp, peeled and deveined",
        "4 teaspoons extra-virgin olive oil",
        "4 thin slices orange",
        "2 tablespoons chopped toasted almonds",
        "2 tablespoons chopped fresh parsley"
    ],
    "nut": [
        "Calories > 335 kcal",
        "Carbs > 31.2 g",
        "Cholesterol > 173 mg",
        "Fat > 13 g",
        "Protein > 23 g",
        "Sodium > 1482 mg"
    ],
    "n": "Shrimp and Rice Packets with Olives and Oranges",
    "a": "Molly Gilbert",
    "r": "0",
    "s": 4,
    "des": "\"Shrimp, olive, and orange flavors mingle within individualized roasting packets that make serving a breeze.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Cut four 12x15-inch sheets of parchment paper. Fold each in half widthwise and reopen.\nMix rice, olives, chicken broth, orange juice, orange zest, salt, and pepper together in a bowl.\nSpoon 3/4 cup of the rice mixture onto 1 side of each parchment rectangle, near the crease. Pile shrimp evenly over rice mixture. Drizzle 1 teaspoon olive oil over each pile of shrimp; lay 1 orange slice on top.\nFold empty half of parchment over shrimp filling and crimp edges together with overlapping folds to seal. Arrange packets close together on a sheet pan.\nRoast on the center rack of the preheated oven until shrimp are tender and opaque, 15 to 17 minutes. Unfold 1 edge of the parchment, being careful to avoid steam, and look inside to check doneness.\nOpen packets carefully, being careful to avoid steam. Slide shrimp and rice mixture into bowls. Garnish with almonds and parsley.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "4095425.jpg",
    "o": "",
    "st": "allrecipes"
}