{
    "id": 256087,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds yuca, peeled and coarsely chopped",
        "2 pounds green plantains, peeled and coarsely chopped",
        "2 pounds yautia, peeled and coarsely chopped",
        "2 cups milk",
        "1 pound lard",
        "1 pound achiote seeds",
        "1 tablespoon olive oil, or to taste",
        "1 onion, chopped",
        "1 green bell pepper, chopped",
        "2 pounds pork shoulder roast, cut into small cubes",
        "1 pound ham, cut into small cubes",
        "2 cups garbanzo beans",
        "2 (8 ounce) cans tomato sauce",
        "1 (5 ounce) jar pitted Spanish olives",
        "1 (4 ounce) jar capers",
        "3 tablespoons orange juice",
        "4 sprigs cilantro, chopped",
        "2 tablespoons dried oregano",
        "1 tablespoon salt",
        "2 cloves garlic, minced",
        "24 plantain leaves",
        "kitchen string"
    ],
    "nut": [
        "Calories > 417 kcal",
        "Carbs > 31.2 g",
        "Cholesterol > 45 mg",
        "Fat > 28.2 g",
        "Protein > 11.8 g",
        "Sodium > 1119 mg"
    ],
    "n": "Pasteles with Yuca and Plantains",
    "a": "LKLOTKO",
    "r": "0",
    "s": 24,
    "des": "\"This is a traditional holiday family meal. This recipe has been in our family for years. It is a Puerto Rican dish. It is customary to make this and give them away to all the people you love.\"",
    "ins": "Combine yuca, green plantains, yautia, and milk in a blender; puree into a thick paste the consistency of oatmeal.\nCombine lard and achiote seeds in a saucepan over medium-low heat; heat until lard is melted, and reddish in color, about 5 minutes. Strain out achiote seeds. Mix half of the lard into the yuca paste.\nHeat olive oil in a large pot over medium heat. Add onion and green bell pepper; cook and stir until tender, about 5 minutes. Add pork, ham, garbanzo beans, tomato sauce, olives, capers, orange juice, cilantro, oregano, salt, and garlic; cook and stir until pork is no longer pink in the center, 8 to 10 minutes. Remove from heat.\nMix 2/3 of the remaining lard into the pork mixture.\nSmear each plantain leaf with a small amount of remaining lard. Place a large spoonful of the yuca paste in the center of each one; top with a scoop of the pork mixture. Fold up the sides of each leaf to enclose the filling and create a rectangular pastel.\nStack 2 pasteles and tie them together with kitchen string. Repeat with remaining pasteles.\nBring a large pot of water to a boil. Add pasteles. Cook until filling is tender, about 1 hour. Unwrap pasteles before serving.",
    "pt": "55 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}