{
    "id": 256099,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups milk",
        "1 teaspoon kosher salt, or to taste",
        "1 1/4 cups semolina flour",
        "1 3/4 ounces freshly grated Parmigiano-Reggiano cheese",
        "2 large egg yolks",
        "3 tablespoons cold unsalted butter, cut into small cubes",
        "3 tablespoons melted butter",
        "1 pinch cayenne pepper",
        "2 tablespoons freshly grated Parmigiano-Reggiano cheese, or more to cover"
    ],
    "nut": [
        "Calories > 335 kcal",
        "Carbs > 9.5 g",
        "Cholesterol > 176 mg",
        "Fat > 27.4 g",
        "Protein > 13.3 g",
        "Sodium > 789 mg"
    ],
    "n": "Roman-Style Gnocchi",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Gnocchi alla Romana are as delicious as they are virtually unknown. I feel like I've eaten a fair amount of Italian food, and I've been to Rome, but it wasn't until late in life that I discovered these wonderful, baked semolina dumplings.\"",
    "ins": "Line a rimmed sheet pan with plastic wrap.\nPlace milk and salt in a saucepan. Bring almost to a simmer over medium-high heat. As soon as bubbles start to break the surface of the milk, gradually whisk in the semolina. Whisk until semolina becomes thick, about 20 seconds. Reduce heat to medium-low; continue stirring with a wooden spoon until very thick, 7 to 10 minutes. Remove from heat. Add butter, grated cheese, and egg yolks. Stir quickly to prevent the yolks from cooking.\nTransfer mixture to prepared pan and spread out evenly. Cover with another piece of plastic wrap. Refrigerate until firm enough to cut, about 30 minutes.\nPreheat oven to 425 degrees F (220 degrees C). Brush a round, shallow baking dish with butter.\nUsing a round 2 3/4-inch cookie cutter, cut out circles of the semolina dough. Arrange in a circular overlapping pattern in the prepared baking dish.\nWith your damp hands, form the scraps of dough into a small ball. Flatten and place between 2 pieces of plastic wrap to flatten to the same thickness of the other dough. Cut out a few more rounds and arrange in center of circle.\nDrizzle melted butter over gnocchi and brush it over them evenly. Sprinkle with a pinch of cayenne pepper and a generous dusting of grated cheese.\nBake in preheated oven until golden brown, about 25 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}