{
    "id": 256152,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (9 inch) deep-dish pie crust",
        "8 fun size bars chocolate-covered crispy peanut butter candy (such as ButterfingerÂ®), crushed",
        "1/2 cup white sugar",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground cloves",
        "2 eggs",
        "1 (15 ounce) can pumpkin puree",
        "1 (12 fluid ounce) can evaporated milk",
        "1 tablespoon sugar, or more to taste"
    ],
    "nut": [
        "Calories > 368 kcal",
        "Carbs > 50.2 g",
        "Cholesterol > 60 mg",
        "Fat > 16.4 g",
        "Protein > 7.5 g",
        "Sodium > 537 mg"
    ],
    "n": "Pumpkin ButterfingerÂ® Brulee Pie",
    "a": "MicheleR1",
    "r": "0",
    "s": 8,
    "des": "\"This pie idea popped into my head when I had a craving for ButterfingersÂ® while watching Pumpkin Wars on HGTV! Serve with whipped cream.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nLine a 9-inch pie plate with the crust. Spread crushed candy on the bottom.\nMix 1/2 cup sugar, cinnamon, ginger, salt, and cloves together in a small bowl.\nBeat eggs with an electric mixer in a large bowl until smooth. Add sugar mixture and pumpkin puree; beat on low speed until smooth. Slowly beat in evaporated milk. Pour mixture over crushed candy in the pie crust.\nBake in the preheated oven until crust is golden, about 15 minutes. Reduce oven temperature to 350 degrees F (180 degrees C). Continue baking until a knife inserted into the center comes out clean, 40 to 50 minutes.\nRemove pie from the oven; cool to room temperature, about 1 hour.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nCover edges of the pie crust with aluminum foil. Sprinkle 1 tablespoon sugar evenly over the pie. Broil until sugar melts and turns golden brown, 3 to 5 minutes.\nDiscard aluminum foil. Refrigerate pie until sugar topping hardens, 10 to 15 minutes.",
    "pt": "15 m",
    "ct": "58 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}