{
    "id": 256110,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 1/2 cups grated Parmesan cheese",
        "2 tablespoons minced fresh rosemary",
        "2 cloves garlic, minced",
        "3 1/2 pounds red potatoes",
        "3 tablespoons butter",
        "3 tablespoons all-purpose flour",
        "2 cups whole milk",
        "1/2 teaspoon salt",
        "1 teaspoon olive oil"
    ],
    "nut": [
        "Calories > 395 kcal",
        "Carbs > 50.1 g",
        "Cholesterol > 41 mg",
        "Fat > 15.4 g",
        "Protein > 15.9 g",
        "Sodium > 590 mg"
    ],
    "n": "Fancy Crusted Rosemary Scalloped Potatoes",
    "a": "Mackenzie Schieck",
    "r": "0",
    "s": 6,
    "des": "\"Slices of potatoes are layered around a baking dish to create a beautiful crust for these creamy rosemary potatoes.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Coat an 8-inch baking dish cooking spray.\nMix Parmesan cheese, rosemary, and garlic together in a bowl.\nSlice 3 or 4 potatoes using a mandolin on the thinnest setting. Slice remaining potatoes using a slightly thicker setting on the mandolin.\nLine the bottom of the prepared baking dish with thin potato slices, overlapping them to create a layer that is 2 to 3 slices deep. Stand remaining thin slices along the sides of the baking dish so that half an inch sticks over the rim, overlapping them to create a layer that is 4 slices deep.\nSpread 1/3 of the thicker potato slices in the baking dish. Sprinkle 1/3 of the Parmesan cheese mixture on top. Repeat once more. Arrange remaining potato slices in the baking dish. Reserve 1/3 of the Parmesan cheese mixture.\nMelt butter in a saucepan over medium heat; whisk in flour. Pour in milk; cook, stirring occasionally, until sauce thickens, 5 to 6 minutes. Stir in salt.\nShift potato slices in a few places with a knife to create wells for the sauce to flow through. Pour sauce evenly over potato slices in the baking dish. Sprinkle remaining 1/3 of the Parmesan cheese mixture on top. Brush potato edges sticking out of the baking dish with olive oil.\nBake in the preheated oven until potatoes are soft and edges are crusted, 60 to 75 minutes.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4132196.jpg",
    "o": "",
    "st": "allrecipes"
}