{
    "id": 256162,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "2 (18.3 ounce) packages fudge brownie mix (such as Duncan HinesÂ®)",
        "1 cup vegetable oil",
        "4 eggs",
        "1/2 cup water",
        "Ganache:",
        "6 ounces semisweet chocolate chips",
        "1/2 cup heavy whipping cream",
        "1 (16 ounce) package confectioners' coating (such as WiltonÂ® Candy MeltsÂ®)",
        "lollipop sticks"
    ],
    "nut": [
        "Calories > 284 kcal",
        "Carbs > 32.7 g",
        "Cholesterol > 29 mg",
        "Fat > 16.6 g",
        "Protein > 3.4 g",
        "Sodium > 133 mg"
    ],
    "n": "Brownie Truffles (Brownie Pops)",
    "a": "WickedCreations",
    "r": "0",
    "s": 36,
    "des": "\"Just like their cousin, cake pops/balls, I took this to a whole new level of divine!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Coat an 11x15-inch baking pan with cooking spray.\nEmpty brownie mix into a large bowl. Add vegetable oil, eggs, and water; stir with a wooden spoon until batter is well blended. Pour batter into the prepared baking pan.\nBake in the preheated oven until a toothpick inserted 1 inch from the edge of the pan comes out clean, 35 to 40 minutes. Let cool completely, about 30 minutes.\nCombine chocolate chips and heavy cream in a microwave-safe bowl. Heat in the microwave in 30-second intervals, stirring after each interval, until melted and smooth. Cool, about 5 minutes.\nBreak brownies into pieces and place in a large bowl. Pour ganache evenly over brownie pieces; mix thoroughly.\nLine a jelly roll pan with parchment paper. Press brownie mixture evenly into the pan. Freeze until firm, about 30 minutes.\nPour confectioners' coating into a microwave-safe bowl. Microwave at 50 percent power for 1 minute; stir thoroughly. Continue to microwave and stir at 30-second intervals until smooth and completely melted, 1 to 2 minutes more.\nRoll brownie mixture into balls; insert a lollipop stick halfway into each. Dip balls one at a time into melted confectioners' coating to form a thin, even coating, letting the excess drip off. Stick into a styrofoam block; let stand until coating hardens, about 10 minutes.",
    "pt": "30 m",
    "ct": "38 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}