{
    "id": 256153,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 (18.25 ounce) package white cake mix",
        "1/2 cup 2% milk",
        "1/2 cup butter, melted",
        "3 (1 ounce) packages instant vanilla pudding mix",
        "1 1/2 cups sliced almonds, divided",
        "1 cup white chocolate chips",
        "6 ounces white baking chocolate (such as Baker'sÂ®), chopped and divided",
        "3/4 cup chopped hazelnuts, divided",
        "1 1/2 cups chocolate hazelnut spread"
    ],
    "nut": [
        "Calories > 543 kcal",
        "Carbs > 59.7 g",
        "Cholesterol > 20 mg",
        "Fat > 31.8 g",
        "Protein > 7.5 g",
        "Sodium > 376 mg"
    ],
    "n": "White Chocolate Hazelnut Spread Bars",
    "a": "Tamara A",
    "r": "0",
    "s": 16,
    "des": "\"A great holiday cookie bar. A favorite of my son and daughter.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x13-inch baking pan with aluminum foil; grease with cooking spray.\nCombine white cake mix, milk, melted butter, and vanilla pudding mix in a large bowl; beat with an electric mixer until well blended and thick. Divide dough into 2 pieces.\nPlace 1 piece of dough between 2 large sheets of waxed paper; roll into a 9x13-inch rectangle. Peel off waxed paper and press the dough into the bottom of the baking pan.\nBake in the preheated oven until dough is pale golden, about 10 minutes. Sprinkle half of the sliced almonds, white chocolate chips, white baking chocolate, and hazelnuts on top; press into the soft dough.\nPlace chocolate hazelnut spread in a small microwave-safe bowl; heat on medium-high, stirring often, until melted, about 1 minute. Spread over dough.\nPlace the second piece of dough between 2 large sheets of waxed paper; roll into a 9x13-inch rectangle. Peel off waxed paper and lay the dough over the chocolate hazelnut spread. Sprinkle remaining sliced almonds, white chocolate chips, white baking chocolate, and hazelnuts on top; press into dough with a spatula.\nBake in the preheated oven until dough is golden brown, about 15 minutes. Let cool completely, about 1 hour. Refrigerate until firm, 3 to 4 hours. Cut into bars.",
    "pt": "20 m",
    "ct": "26 m",
    "tt": "4 h ",
    "i": "4416136.jpg",
    "o": "",
    "st": "allrecipes"
}