{
    "id": 256286,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "2 cups cubed beef stew meat",
        "1 onion, diced",
        "2 yellow potatoes, peeled and diced",
        "2 carrots, diced",
        "1 rib celery, diced",
        "1 clove garlic, crushed",
        "1/4 cup all-purpose flour",
        "2 tablespoons butter",
        "1 bay leaf",
        "salt and ground black pepper to taste",
        "3 cups low-sodium beef stock",
        "1 cup milk",
        "1 sprig fresh rosemary",
        "1/2 cup frozen peas",
        "1 (17.5 ounce) package frozen puff pastry, thawed"
    ],
    "nut": [
        "Calories > 834 kcal",
        "Carbs > 59.7 g",
        "Cholesterol > 76 mg",
        "Fat > 52.4 g",
        "Protein > 30.3 g",
        "Sodium > 424 mg"
    ],
    "n": "Puff Pastry Roast Beef Pot Pies",
    "a": "RusticJoyfylFood",
    "r": "0",
    "s": 6,
    "des": "\"This makes 4 to 6 individual pot pies or one 9x13-inch pan or one 12-inch cast iron skillet.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a large stockpot over medium heat; cook and stir stew meat until browned, 2 to 3 minutes. Add onion; cook and stir until onion is lightly browned, 3 to 4 minutes. Add potatoes, carrots, celery, and garlic; cook and stir until slightly tender, 3 to 4 minutes.\nStir flour, butter, bay leaf, salt, and pepper into stew meat mixture; cook and stir until flour is dissolved and a gravy is forming, about 2 minutes. Pour beef stock over meat mixture, scraping brown bits of food off the bottom with a wooden spoon; cook until gravy begins to thicken, about 5 minutes.\nMix milk and rosemary into stew meat-gravy mixture; continue cooking over low heat for 15 to 20 minutes. Stir peas into mixture.\nPour stew meat-gravy mixture into individual pot pie pans or a 12-inch cast iron skillet; top with puff pastry, crimping the sides of the pastry down tightly. Cover with aluminum foil.\nBake in the preheated oven until pastry is puffed and golden, 30 to 45 minutes.",
    "pt": "25 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4222549.jpg",
    "o": "",
    "st": "allrecipes"
}