{
    "id": 25628,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "1 cup white sugar",
        "1 egg",
        "3/4 cup milk",
        "2 cups sifted all-purpose flour",
        "3 teaspoons baking powder",
        "1 teaspoon salt",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground cloves",
        "2 cups rhubarb, cut into 1/2 inch pieces",
        "2 cups white sugar",
        "4 tablespoons cornstarch",
        "2 1/2 cups water",
        "4 tablespoons butter",
        "2 1/2 teaspoons grated lemon zest",
        "2 tablespoons lemon juice",
        "1/4 teaspoon lemon extract (optional)",
        "1 drop yellow food coloring (optional)"
    ],
    "nut": [
        "Calories > 351 kcal",
        "Carbs > 70.8 g",
        "Cholesterol > 32 mg",
        "Fat > 6.8 g",
        "Protein > 3.5 g",
        "Sodium > 340 mg"
    ],
    "n": "Rhubarb Spice Cake with Lemon Sauce",
    "a": "PRICKLY PEAR",
    "r": "0",
    "s": 12,
    "des": "\"My mother got this recipe back in the 1950's from the minister's wife. It's been a family favorite ever since--even for those who claim to dislike rhubarb.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch pan.\nSift together the flour, baking powder, salt, cinnamon, nutmeg and cloves. Set aside.\nIn a large bowl, cream together 2 tablespoons butter and 1 cup sugar until light and fluffy. Beat in the egg.  Beat in the flour mixture alternately with the milk, mixing just until incorporated. Stir in the chopped rhubarb. Pour batter into prepared pan.\nBake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, 45 to 50 minutes. Allow to cool before slicing.\nTo make the Lemon Sauce:  In a saucepan, mix together 2 cups sugar and 4 tablespoons cornstarch. Stir in the water. Cook over medium heat, stirring constantly, until mixture is thickened. Remove from heat and stir in 4 tablespoons butter, lemon zest, lemon juice, and extract (if desired). Stir in 1 or 2 drops yellow food coloring, if using.\nServe slices of cake with the warm lemon sauce.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "654782.jpg",
    "o": "",
    "st": "allrecipes"
}