{
    "id": 256238,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 cups tapioca starch",
        "2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon garlic powder",
        "1 teaspoon ground cayenne pepper",
        "1 teaspoon ground paprika",
        "2 pounds skinless, boneless chicken breasts, cut into cubes",
        "2 tablespoons coconut oil, or more as needed",
        "1 tablespoon unsalted butter, or more as needed",
        "1 clove garlic, minced",
        "1 teaspoon freshly grated ginger",
        "1/2 cup coconut aminos",
        "1/4 cup raw honey",
        "2 teaspoons sriracha sauce, or more to taste",
        "2 scallions, thinly sliced",
        "1 teaspoon sesame oil",
        "toothpicks"
    ],
    "nut": [
        "Calories > 327 kcal",
        "Carbs > 33.7 g",
        "Cholesterol > 73 mg",
        "Fat > 9.2 g",
        "Protein > 25.8 g",
        "Sodium > 1072 mg"
    ],
    "n": "Paleo Boneless Chicken Wings",
    "a": "Cindy Anschutz Barbieri",
    "r": "0",
    "s": 8,
    "des": "\"I was laughing to myself while making these because there is really no such thing as a boneless chicken wing. But we are using the same method and using boneless chicken. I love chicken wings and so do millions of others but when entertaining at home, I don't like to make them because of the mess. The bones that we need to discard, the big pan to fry the wings in, and of course all of the sticky fingers! My Paleo boneless chicken recipe is not only healthy and easy to make but just pop in toothpicks and there won't be any sticky marks in your house. \n\nI hope you enjoy my version!\"",
    "ins": "Mix tapioca starch, salt, pepper, garlic powder, cayenne pepper, and paprika together in a large bowl with a fork. Add chicken cubes; toss with your hands until coated on all sides.\nHeat coconut oil and butter in a large skillet over medium-high heat until melted and hot. Add some of the chicken cubes using tongs; cook until browned, about 2 minutes per side. Transfer to a plate lined with paper towels. Repeat with remaining chicken, heating up more coconut oil and butter as needed.\nReduce heat to medium and whisk garlic and ginger into the grease in the skillet. Whisk in coconut aminos, honey, and sriracha sauce. Simmer over low heat until flavors combine, about 5 minutes. Stir in chicken; cook until sauce thickens and coats chicken, 5 to 7 minutes.\nGarnish chicken with scallions and sesame oil; serve on toothpicks.",
    "pt": "20 m",
    "ct": "22 m",
    "tt": "42 m",
    "i": "4240848.jpg",
    "o": "",
    "st": "allrecipes"
}