{
    "id": 256268,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons white vinegar",
        "3 potatoes, very thinly sliced",
        "6 tablespoons extra virgin-olive oil, divided",
        "3 cups finely chopped ham",
        "1 (10.75 ounce) can condensed cream of mushroom soup (such as Campbell'sÂ®)",
        "1/2 cup finely chopped onion",
        "1/4 cup milk",
        "2 tablespoons minced capers",
        "1 1/2 teaspoons salt",
        "1 teaspoon cayenne pepper",
        "1 teaspoon chili powder",
        "1 cup shredded sharp Cheddar cheese",
        "1/2 cup pepper Jack cheese",
        "1 cup shredded mozzarella cheese",
        "1 tablespoon parsley flakes"
    ],
    "nut": [
        "Calories > 438 kcal",
        "Carbs > 19.3 g",
        "Cholesterol > 60 mg",
        "Fat > 31.2 g",
        "Protein > 20.1 g",
        "Sodium > 1549 mg"
    ],
    "n": "Ham and Scalloped Potato Chip Lasagna",
    "a": "Brian Edward Croner",
    "r": "0",
    "s": 8,
    "des": "\"Got a leftover Christmas ham from the holidays? Do something creative with it! Inspired by Italian lasagna, this transforms your leftover ham and a few potatoes into a really fun, flavorful dish. I hope you enjoy it!\"",
    "ins": "Fill a large pot with water; add vinegar. Bring to a boil. Add potatoes and simmer until tender, about 15 minutes. Drain.\nPreheat oven to 300 degrees F (150 degrees C). Coat 2 rimmed baking sheets with 2 tablespoons olive oil each.\nArrange potato slices on a towel. Dab with another towel to dry. Arrange potato slices on the oiled baking sheets.\nBake in the preheated oven until bottoms are golden brown, about 20 minutes. Flip all slices. Continue baking until tops are golden brown, about 10 minutes. Remove from oven.\nIncrease oven temperature to 350 degrees F (180 degrees C). Coat a 9x12-inch baking dish with the remaining 2 tablespoons oil.\nCombine ham, cream of mushroom soup, onion, milk, capers, salt, cayenne pepper, and chili powder in a large bowl.\nSpread ham mixture in the bottom of the baking dish. Cover evenly with Cheddar cheese and pepper Jack cheese. Arrange potato slices on top. Cover potato slices evenly with mozzarella cheese.\nBake in the preheated oven until mozzarella cheese is melted, about 15 minutes. Garnish with parsley.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4335970.jpg",
    "o": "",
    "st": "allrecipes"
}