{
    "id": 256367,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "1/3 cup vegetable oil",
        "1/4 cup ranch dressing",
        "2 tablespoons Buffalo wing sauce (such as Frank'sÂ® RedHotÂ®)",
        "2 tablespoons garlic powder",
        "1 tablespoon onion powder",
        "2 teaspoons salt",
        "6 Idaho potatoes, cut into 1-inch cubes",
        "2 pounds skinless, boneless chicken breasts, cut into 1-inch cubes",
        "1 (12 ounce) package bacon",
        "3 cups shredded Colby Jack cheese",
        "4 green onions, chopped"
    ],
    "nut": [
        "Calories > 654 kcal",
        "Carbs > 33.4 g",
        "Cholesterol > 131 mg",
        "Fat > 38.2 g",
        "Protein > 44.2 g",
        "Sodium > 1540 mg"
    ],
    "n": "Buffalo Chicken and Potato Casserole",
    "a": "krisgo",
    "r": "0",
    "s": 8,
    "des": "\"Filling and delicious. Don't let the high oven temp or number of steps intimidate you. My family of picky eaters loved this and there were no leftovers. Happy eating and I look forward to your comments.\"",
    "ins": "Preheat oven to 500 degrees F (260 degrees C). Grease a 9x13-inch casserole dish with cooking spray.\nMix oil, ranch dressing, Buffalo wing sauce, garlic powder, onion powder, and salt together in a a large bowl to make sauce. Add potatoes; stir to coat thoroughly. Transfer potatoes to the casserole dish.\nPlace chicken in the sauce bowl; stir to coat with remaining sauce. Marinate in the refrigerator, about 30 minutes.\nRoast potatoes in the preheated oven while chicken marinates, stirring halfway, until tender, about 30 minutes. Stir in chicken. Continue roasting, stirring once or twice, until chicken and potatoes are tender, 15 to 30 minutes.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels.\nCrumble bacon into a bowl; stir in Colby Jack cheese and green onions.\nSprinkle cheese mixture over potatoes and chicken; bake until cheese is melted and bubbly, about 5 minutes.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4516540.jpg",
    "o": "",
    "st": "allrecipes"
}