{
    "id": 256341,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 (1 pint) wide-mouth canning jars with lids and rings",
        "1 tablespoon shortening",
        "1 cup raisins",
        "1 cup hot water",
        "1 1/2 cups white sugar",
        "1 cup shortening",
        "3 eggs",
        "2 cups all-purpose flour",
        "1 tablespoon ground cinnamon",
        "2 teaspoons baking soda",
        "1 teaspoon salt",
        "1/4 teaspoon baking powder",
        "2 cups finely shredded zucchini",
        "1 cup chopped walnuts (optional)",
        "2 teaspoons vanilla extract"
    ],
    "nut": [
        "Calories > 1393 kcal",
        "Carbs > 163.6 g",
        "Cholesterol > 140 mg",
        "Fat > 78.7 g",
        "Protein > 17.8 g",
        "Sodium > 1308 mg"
    ],
    "n": "Zucchini Bread in a Jar",
    "a": "Barbara Roach",
    "r": "0",
    "s": 4,
    "des": "\"Great bread baked in jars so it does not take up freezer space and you always have a treat for drop-in company. Serve the cut tops with whipped cream while warm, yum!\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Grease pint jars with 1 tablespoon shortening.\nSoak raisins in hot water until plump, about 10 minutes. Drain.\nCombine sugar, 1 cup shortening, and eggs in a large bowl; beat with an electric mixer until creamy. Beat in raisins. Add flour, cinnamon, baking soda, salt, and baking powder; beat until blended. Fold zucchini, walnuts, and vanilla extract into the batter.\nDivide batter among greased jars, filling each one 2/3 full. Arrange jars on a rimmed baking sheet.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Turn off oven, keeping jars inside. Remove jars one at a time from the oven using oven mitts; trim off excess cake, wipe rims, and screw on lids.\nPlace jars several inches apart on a cloth-covered or wood surface and let cool completely, about 2 hours. Store jars in the refrigerator.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "3 h ",
    "i": "4465675.jpg",
    "o": "",
    "st": "allrecipes"
}