{
    "id": 256346,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "2 (4.8 ounce) packages graham crackers, crushed",
        "5 tablespoons butter",
        "1 pinch kosher salt",
        "Filling:",
        "1 (8 ounce) package cream cheese, softened",
        "1 (8 ounce) package Neufchatel cheese, softened",
        "3/4 cup white sugar",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "1/4 cup heavy whipping cream",
        "1 (8 ounce) package semisweet chocolate chips",
        "2 tablespoons all-purpose flour",
        "Glaze:",
        "1 (12 ounce) package frozen sweet cherries",
        "2 tablespoons apricot jam",
        "2 tablespoons white sugar",
        "1 tablespoon water",
        "1 tablespoon cornstarch"
    ],
    "nut": [
        "Calories > 568 kcal",
        "Carbs > 64.8 g",
        "Cholesterol > 102 mg",
        "Fat > 32 g",
        "Protein > 9.4 g",
        "Sodium > 420 mg"
    ],
    "n": "Instant PotÂ® Chocolate Cheesecake",
    "a": "Suruchi K",
    "r": "0",
    "s": 10,
    "des": "\"Heavenly smooth, easy peasy. Not too sweet or tangy. It's just right!\"",
    "ins": "Wrap the bottom and sides of an 8-inch springform pan with aluminum foil.\nCombine graham cracker crumbs, butter, and salt in a bowl; mix thoroughly. Pour into the prepared pan; press tightly onto the bottom and up the sides of the pan using the bottom of a measuring cup. Freeze crust until firm, 10 to 15 minutes.\nBeat cream cheese, Neufchatel cheese, and 3/4 cup sugar in a bowl with an electric mixer until creamy, about 4 minutes. Beat in eggs one at a time; add vanilla. Beat in heavy cream.\nMelt chocolate chips in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, 1 to 2 minutes. Beat melted chocolate into the cream cheese mixture. Fold in flour.\nPour chocolate cream cheese mixture over the chilled crust. Cover tightly with aluminum foil.\nPour 1 1/2 cup water into the pot of an electric pressure cooker (such as Instant Pot(R)). Place a metal trivet in the pot; set springform pan on top. Seal and bring cooker to high pressure according to manufacturer's instructions; cook cheesecake for 45 minutes. Release pressure naturally according to manufacturer's instructions, 10 to 12 minutes. Cool cheesecake to room temperature, about 1 hour.\nCombine cherries, apricot jam, and 2 tablespoons sugar in a saucepan over medium heat. Simmer until cherries are heated through and release some of their juices, 5 to 7 minutes.\nMix water and cornstarch in a small bowl until smooth. Stir into the cherry mixture until thick and glossy, 2 to 3 minutes. Remove from heat; cool glaze to room temperature.\nPour glaze over cheesecake and refrigerate until firm, at least 6 hours or overnight. Remove the springform ring and transfer cheesecake to a serving platter.",
    "pt": "25 m",
    "ct": "53 m",
    "tt": "8 h ",
    "i": "4536613.jpg",
    "o": "",
    "st": "allrecipes"
}