{
    "id": 256421,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2/3 pound ground beef (85% lean)",
        "2 cups mayonnaise",
        "2 tablespoons prepared yellow mustard",
        "2 tablespoons sweet pickle relish",
        "1 1/2 teaspoons white wine vinegar, or more to taste",
        "1 teaspoon onion powder",
        "1 teaspoon garlic powder",
        "1 teaspoon ground paprika",
        "4 hamburger bun bottoms",
        "2 hamburger bun tops",
        "2 tablespoons minced onion, or to taste",
        "1/2 cup shredded lettuce, or to taste",
        "2 tablespoons dill pickle slices, or to taste",
        "2 slices American cheese",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 2395 kcal",
        "Carbs > 82.6 g",
        "Cholesterol > 218 mg",
        "Fat > 208.6 g",
        "Protein > 51.7 g",
        "Sodium > 2986 mg"
    ],
    "n": "Big MacÂ® Clone",
    "a": "Nick",
    "r": "0",
    "s": 2,
    "des": "\"A very delicious, authentic, and most importantly great clone of a Big MacÂ® from McDonald'sÂ®.\"",
    "ins": "Shape ground beef into 4 flat patties that will fit the hamburger buns. Place them on a tray lined with waxed paper; transfer to the freezer.\nMix mayonnaise, mustard, pickle relish, white wine vinegar, onion powder, garlic powder, and paprika in a bowl to make sauce. Refrigerate for 10 minutes.\nPreheat a large skillet over medium heat. Toast buns in batches until lightly golden, 1 to 2 minutes.\nLayer some of the sauce, 1 tablespoon minced onion, 2 tablespoons lettuce, and pickles on 2 bottom buns. Layer some of the sauce and remaining 1 tablespoon minced onion, 2 tablespoons lettuce, and American cheese on the other bottom buns.\nSeason patties with salt and pepper. Cook in the hot skillet 2 at a time until browned, 3 to 4 minutes per side. Place 1 patty over each bottom bun; stack and cover with top buns.",
    "pt": "15 m",
    "ct": "14 m",
    "tt": "39 m",
    "i": "4504922.jpg",
    "o": "",
    "st": "allrecipes"
}