{
    "id": 256486,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 slices white bread",
        "4 slices bacon",
        "12 ounces asparagus, trimmed",
        "1 tablespoon butter, or more to taste",
        "1 pinch garlic salt, or to taste",
        "4 slices mozzarella cheese",
        "1 pinch red pepper flakes, or to taste"
    ],
    "nut": [
        "Calories > 220 kcal",
        "Carbs > 17 g",
        "Cholesterol > 34 mg",
        "Fat > 11.3 g",
        "Protein > 13.3 g",
        "Sodium > 616 mg"
    ],
    "n": "Bacon-Wrapped Asparagus on Toast",
    "a": "COOKINGFORTHEKING",
    "r": "0",
    "s": 4,
    "des": "\"Very easy, versatile, and classy appetizer with a kick. Easy clean-up too. Garlic salt and red pepper can be omitted if they don't complement the main dish.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Arrange bread slices on a baking sheet.\nToast bread in the preheated oven until lightly golden, about 5 minutes.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned but still pliable, about 8 minutes. Drain bacon slices on paper towels.\nBring a large pot of lightly salted water to a boil. Add asparagus and cook uncovered until bright green, about 2 minutes. Drain in a colander and immediately immerse in ice water for several minutes to stop the cooking process. Drain.\nMelt butter in a skillet over medium heat; cook and stir asparagus in hot butter under tender, about 5 minutes. Cut asparagus into pieces that will fit the bread slices. Season with garlic salt; wrap with bacon slices.\nArrange bacon-wrapped asparagus on toasted bread slices. Cover with mozzarella cheese slices. Sprinkle red pepper flakes on top.\nBake in the preheated oven until mozzarella cheese is melted and lightly browned, 3 to 5 minutes.",
    "pt": "15 m",
    "ct": "23 m",
    "tt": "38 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}