{
    "id": 256479,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1 tablespoon white sugar",
        "1 teaspoon salt",
        "1 cup chilled unsalted butter, cut into cubes",
        "1/2 teaspoon vanilla extract",
        "1/4 cup cold water",
        "Filling:",
        "1/4 cup unsalted butter, softened",
        "1/4 cup white sugar",
        "2 tablespoons ground cinnamon"
    ],
    "nut": [
        "Calories > 323 kcal",
        "Carbs > 26.5 g",
        "Cholesterol > 61 mg",
        "Fat > 23.3 g",
        "Protein > 2.9 g",
        "Sodium > 237 mg"
    ],
    "n": "Pop-TartsÂ®",
    "a": "Bettina M. Hornsby",
    "r": "0",
    "s": 10,
    "des": "\"These homemade Pop-TartsÂ® include all the flavor of the original, but don't contain any of the stuff you can't pronounce on the back of the box! They freeze well and can be filled with anything. Try pumpkin butter, cinnamon sugar, NutellaÂ®, or peanut butter and jelly! Homemade fruit preserves are delicious as well! Top with confectioners' sugar.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line 2 baking sheets with parchment paper.\nSift flour, 1 tablespoon sugar, and salt together into a bowl. Cut in chilled butter with a pastry blender or 2 knives until mixture resembles small peas. Add vanilla. Mix in cold water, 1 tablespoon at a time, until dough comes together and forms a ball.\nDivide dough into 2 pieces and wrap with plastic wrap; chill until firm, at least 1 hour.\nBeat softened butter, 1/4 cup sugar, and cinnamon together in a bowl to make filling.\nRoll out dough on a lightly floured work surface to 1/2-inch thickness. Cut dough into rectangles with a knife. Drop 1 tablespoon of filling onto half of the rectangles. Cover with remaining rectangles. Press edges with a fork to seal. Poke a few holes in the top of each pastry with a toothpick.\nArrange pastries on the lined baking sheets.\nBake in the preheated oven until golden brown, 25 to 30 minutes. Cool pastries on a wire rack, about 15 minutes.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "2 h",
    "i": "4459489.jpg",
    "o": "",
    "st": "allrecipes"
}