{
    "id": 256404,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Topping:",
        "1/2 cup slivered almonds",
        "1/3 cup white sugar",
        "1/4 cup unsalted butter",
        "1 tablespoon milk",
        "Cake:",
        "1 1/2 cups all-purpose flour",
        "1/2 teaspoon cream of tartar",
        "1/2 teaspoon salt",
        "3/4 cup unsalted butter, softened",
        "1/3 cup almond paste",
        "1 cup white sugar",
        "4 eggs, at room temperature",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon lemon zest",
        "1 teaspoon vanilla extract",
        "1 tablespoon all-purpose flour"
    ],
    "nut": [
        "Calories > 363 kcal",
        "Carbs > 39 g",
        "Cholesterol > 103 mg",
        "Fat > 21.2 g",
        "Protein > 5.5 g",
        "Sodium > 124 mg"
    ],
    "n": "Almond Crunch Pound Cake",
    "a": "Valerie Brunmeier",
    "r": "0",
    "s": 12,
    "des": "\"This is a dense, rich cake with a candy-like topping that is easy to make. It freezes really well so you can have a great dessert on hand. Wrap well and store at room temperature up to 2 days or freeze up to 1 month. Crisp it in the oven briefly at 300 degrees F (150 degrees C) for that just-baked taste. Serve with whipped cream and raspberries.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9-inch springform pan.\nCombine slivered almonds, 1/3 cup white sugar, 1/4 cup butter, and milk in a small saucepan over low heat; cook and stir until butter is melted and mixture is smooth, 3 to 4 minutes. Remove topping from heat.\nCombine 1 1/2 cup flour, cream of tartar, and salt in a bowl.\nBeat 3/4 cup softened butter and almond paste in a large bowl using an electric mixer until creamy. Gradually add 1 cup white sugar and continue beating until mixture is light and fluffy, about 5 minutes. Beat in eggs one at a time, beating 1 minute after each addition; stir in lemon juice, lemon zest, and vanilla extract. Add flour mixture and beat until batter is just mixed, about 1 minute more; pour into the prepared pan and smooth the top.\nSprinkle remaining 1 tablespoon flour evenly over batter. Spoon the topping over the flour layer.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 45 to 50 minutes. Cool on a wire rack.",
    "pt": "20 m",
    "ct": "48 m",
    "tt": "1 h ",
    "i": "4444498.jpg",
    "o": "",
    "st": "allrecipes"
}