{
    "id": 256436,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (17.5 ounce) package frozen puff pastry dough, thawed",
        "2 teaspoons white sugar, or as needed for dusting"
    ],
    "nut": [
        "Calories > 683 kcal",
        "Carbs > 57.3 g",
        "Cholesterol > 0 mg",
        "Fat > 46.7 g",
        "Protein > 8.9 g",
        "Sodium > 305 mg"
    ],
    "n": "Mille Feuille (Napoleon Pastry Sheets)",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"You don't need to make your own dough when frozen puff pastry sheets work just fine. The key is keeping the dough flat when baking which we do by 'docking' it, or pricking all over with the tines of a fork. These crispy, buttery sheets are the first step in making your own Napoleons.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with a silicone sheet.\nSeparate dough at the seams into 4 squares and place on prepared baking sheet. Score the dough all over with the tines of a fork to prevent it from rising too much when baking. Lightly sprinkle dough sheets with white granulated sugar.\nCover with a sheet of parchment paper and 3 sheets of aluminum foil. Nest another baking sheet on top to apply some pressure to the dough while it bakes.\nBake in preheated oven 15 minutes; remove top pan and foil and gently peel off the parchment paper. Return pan to oven and bake until pastry is beautifully browned, 10 to 15 minutes. (Optionally, you can bake about 7 minutes after uncovering, then flip sheets over and bake until brown on the other side, another 7 minutes.)\nTransfer to cooling rack and cool completely before cutting.\nSquare the sheets by trimming uneven edges off sheets using a sharp serrated knife with light sawing motion to keep the pastry from breaking. Cut each rectangle crosswise into 3 equal smaller rectangles. Use 3 small rectangles per pastry.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}