{
    "id": 256435,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Yams:",
        "3 tablespoons kosher salt",
        "2 quarts cold water",
        "3 pounds orange-fleshed sweet potatoes, peeled and cut into 2-inch pieces",
        "Glaze:",
        "1 cup brown sugar",
        "4 tablespoons unsalted butter",
        "1/2 cup freshly squeezed lemon juice",
        "1/4 cup maple syrup",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon ground cinnamon",
        "1 pinch cayenne pepper",
        "Salt to taste",
        "Chopped pistachios, pecans, or walnuts for garnish"
    ],
    "nut": [
        "Calories > 338 kcal",
        "Carbs > 69.6 g",
        "Cholesterol > 15 mg",
        "Fat > 6.3 g",
        "Protein > 3.1 g",
        "Sodium > 2294 mg"
    ],
    "n": "Chef John's Candied Yams",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"Sure, everyone knows orange-fleshed sweet potatoes aren't really yams, but it makes for a shorter name. I'm not a huge sweet side dish person, but I make an exception for these candied yams that use lemon instead of orange juice as a sweetener.\"",
    "ins": "Stir salt into 2 quarts cold water in a large pot. Transfer sweet potato pieces to pot and place over high heat; bring to a simmer. Reduce heat to medium-low and simmer until potatoes are not quite tender but still cooked, 5 to 7 minutes. Use the tip of a knife to test for doneness. Drain.\nPlace brown sugar, butter, lemon juice, maple syrup, ginger, cinnamon, cayenne, and pinch of salt in a skillet. Place over medium-high heat, stirring until glaze ingredients melt and start bubbling. Continue cooking, stirring occasionally, until mixture begins to thicken up, 4 to 6 minutes.\nTransfer drained sweet potatoes to skillet. Raise heat to high and cook and stir until potatoes are coated with glaze and very tender, and glaze has thickened, 5 to 8 minutes. Transfer to serving dish; garnish with chopped nuts.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}