{
    "id": 256567,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "Crust:",
        "1 cup gluten-free flour blend (such as Namaste Perfect Flour Blend)",
        "1 cup chopped pecans",
        "7 tablespoons butter, melted, or more as needed",
        "1/4 cup packed brown sugar",
        "Filling:",
        "3 (8 ounce) packages cream cheese, at room temperature",
        "2/3 cup sugar, or more to taste",
        "1/8 teaspoon salt",
        "3 eggs",
        "1 1/2 teaspoons vanilla extract",
        "1/2 teaspoon lemon extract, or more to taste"
    ],
    "nut": [
        "Calories > 442 kcal",
        "Carbs > 27 g",
        "Cholesterol > 126 mg",
        "Fat > 35 g",
        "Protein > 7.9 g",
        "Sodium > 257 mg"
    ],
    "n": "Gluten-Free Cheesecake Cupcakes",
    "a": "Amenah",
    "r": "0",
    "s": 12,
    "des": "\"Coming from a family that has a lot of gluten intolerance, I decided to try and come up with a gluten-free cheesecake cupcake recipe that everyone can enjoy. \nI've tried many different recipes and finally came up with one that I love, and I hope you all love it, too! \nIt tastes great plain or topped with whipped cream, chocolate ganache, fruits, and more - the options are endless. Happy baking!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a muffin tin with cooking spray.\nMix flour, pecans, butter, and brown sugar together in a bowl until mixture has a sandy texture. Drop a heaping tablespoon of the mixture into the bottom of each muffin cup; press to create a flat and even crust.\nBake in the preheated oven until crust is dry, about 12 minutes. Reduce oven temperature to 300 degrees F (150 degrees C).\nBeat cream cheese in a large bowl with an electric mixer on low speed until very creamy. Add sugar and salt; mix well. Beat in eggs one at a time until smooth. Beat in vanilla extract and lemon extract.\nPour cream cheese mixture evenly over each crust.\nBake cheesecakes in the preheated oven until set, about 20 minutes. Let cool completely, about 20 minutes. Cover and refrigerate until firm, at least 2 hours.",
    "pt": "15 m",
    "ct": "32 m",
    "tt": "3 h ",
    "i": "4461315.jpg",
    "o": "",
    "st": "allrecipes"
}