{
    "id": 256594,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups long-grain white rice",
        "3 tablespoons vegetable oil",
        "1 large onion, thinly sliced",
        "1/2 teaspoon cumin seeds",
        "2 bay leaves, broken in half",
        "2 potatoes, quartered",
        "2 carrots, quartered",
        "1 1/2 teaspoons ground turmeric",
        "1 teaspoon chile powder, or more to taste",
        "1/2 teaspoon ground coriander",
        "2 1/2 cups water",
        "1 cup shelled peas",
        "1 1/2 teaspoons salt, or to taste",
        "1 teaspoon butter",
        "1/2 teaspoon garam masala"
    ],
    "nut": [
        "Calories > 392 kcal",
        "Carbs > 70.8 g",
        "Cholesterol > 2 mg",
        "Fat > 8.4 g",
        "Protein > 7.8 g",
        "Sodium > 616 mg"
    ],
    "n": "Vegetable Biryani (Tehri)",
    "a": "thesiamesecat",
    "r": "0",
    "s": 6,
    "des": "\"Tehri was originally concocted by kings in northern India as a vegetarian equivalent to the Mughals' mutton or chicken biryani. This modern-day version has deliciously soft sweet vegetables and flavorful long-grain rice. Serve with chilled yogurt and spicy curry on the side.\"",
    "ins": "Place rice in large container and cover with several inches of cool water; let soak for 20 minutes. Drain.\nHeat oil in a pressure cooker over medium heat. Add onion, cumin seeds, and bay leaves; cook and stir until onion is translucent, about 5 minutes. Stir in potatoes and carrots; cook until lightly browned, about 5 minutes. Stir in turmeric, chile powder, and coriander; cook until fragrant, about 1 minute.\nStir rice gently into the pressure cooker until evenly coated with oil. Pour in water and peas. Stir in salt, butter, and garam masala. Seal cooker and bring to high pressure according to manufacturer's instructions. Cook for 5 minutes. Remove from heat.\nRelease pressure naturally according to manufacturer's instructions. Fluff rice with a fork.",
    "pt": "15 m",
    "ct": "16 m",
    "tt": "51 m",
    "i": "4433065.jpg",
    "o": "",
    "st": "allrecipes"
}