{
    "id": 256585,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "1 cup gluten-free all-purpose flour",
        "1/2 cup almond meal",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 cup gluten-free rolled oats",
        "1/2 cup packed light brown sugar",
        "1/2 cup white sugar",
        "1/2 cup unsalted butter, melted",
        "2 teaspoons vanilla extract",
        "1/4 teaspoon almond extract (optional)",
        "Apricot Ginger Filling:",
        "1/3 cup white sugar",
        "1 tablespoon cornstarch",
        "2 cups pitted and diced apricots",
        "1 tablespoon diced fresh ginger"
    ],
    "nut": [
        "Calories > 271 kcal",
        "Carbs > 42 g",
        "Cholesterol > 20 mg",
        "Fat > 11 g",
        "Protein > 3.7 g",
        "Sodium > 107 mg"
    ],
    "n": "Apricot Ginger Crumble Oat Bars (Gluten Free)",
    "a": "RitaAnn",
    "r": "0",
    "s": 12,
    "des": "\"Slightly buttery and crunchy with great oat flavor. Apricots and the slightly citrusy and peppery ginger are meant to be together! These bars are a great way to transform fruits and oats into something every kid, big and small, will devour!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch baking dish and line with parchment paper; grease parchment paper.\nWhisk flour, almond meal, baking soda, and salt together in a bowl. Add oats, brown sugar, and 1/2 cup white sugar; whisk to blend and break up clumps of brown sugar. Pour melted butter, vanilla extract, and almond extract over flour mixture; stir with a spatula until moistened.\nPress 2/3 of the flour mixture into the bottom of the prepared baking dish to make the crust.\nWhisk 1/3 cup white sugar and cornstarch together in a small bowl. Add apricots and ginger and toss to coat.\nSpread apricot mixture over the crust. Sprinkle remaining 1/3 of the flour mixture on top.\nBake in the preheated oven until top is golden brown and crisp and filling is bubbling, 35 to 40 minutes. Cool completely before cutting into bars, about 25 minutes.",
    "pt": "30 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}