{
    "id": 256669,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Pizza Crust:",
        "3/4 cup So DeliciousÂ® Dairy Free Original Coconutmilk Creamer",
        "6 cups loosely packed cauliflower",
        "4 tablespoons flax seed, ground",
        "3/4 cup warm water",
        "4 tablespoons oregano leaves (or Italian herb mixture)",
        "1/4 teaspoon kosher salt",
        "1/2 teaspoon ground black pepper",
        "3/4 cup mozzarella-style shreds (like Daiya brand)",
        "White Sauce:",
        "1 1/2 tablespoons sliced garlic",
        "1/2 cup So DeliciousÂ® Dairy Free Original Culinary Coconut Milk",
        "1 tablespoon oregano leaves",
        "1/2 teaspoon salt",
        "1 cup mozzarella-style shreds (like Daiya brand)"
    ],
    "nut": [
        "Calories > 286 kcal",
        "Carbs > 26.8 g",
        "Cholesterol > 0 mg",
        "Fat > 15.8 g",
        "Protein > 10.7 g",
        "Sodium > 802 mg"
    ],
    "n": "Cauliflower Crust Pizza with Garlic Coconut Cream Sauce",
    "a": "So DeliciousÂ® Dairy Free",
    "r": "0",
    "s": 4,
    "des": "\"Cauliflower and ground flax seeds make a delicious gluten-free pizza crust topped with a creamy coconutmilk and garlic sauce.\"",
    "ins": "Preheat oven to 425 degrees (400 if using a convection oven).\nCut cauliflower into medium-small sized florets, and steam until fork tender.\nBlend cauliflower in food processor until it looks like rice or quinoa in size, then, in a kitchen towel, squeeze out excess water and place cauliflower into a large bowl.\nIn a separate bowl, mix flax seed and warm water, and allow to sit for 10 minutes.\nMix all crust ingredients into large bowl (with cauliflower) and mix with hands until just combined.\nOn a sheet pan lined with parchment paper, spray parchment paper with non-stick spray (or use silicone baking sheet) and press out dough until around 1/2 inch thick, (with slightly thicker edges).\nCook crust for around 45 minutes, or until just browned and fairly solid.\nWhile crust cooks, blend garlic, culinary coconut milk, 1 tablespoon oregano, and 1/2 teaspoon salt in saucepan over medium heat, and cook until thick (or has reduced by about 1/2).\nAdd sauce to crust, and top rest of mozzarella-style shreds and your favorite sliced vegetables (for example, 1 cup each (85 g) sliced Brussels sprouts, yellow squash, and red peppers).\nPlace topped pizza back in oven for around 12 minutes or until toppings are just starting to crisp.\nSlice into squares or rectangular slices.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4450314.jpg",
    "o": "",
    "st": "allrecipes"
}