{
    "id": 256644,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (28 ounce) package frozen bite-size potato nuggets (such as Tater TotsÂ®)",
        "salt to taste",
        "2 1/2 cups cooked pulled pork",
        "1 cup barbeque sauce",
        "1/4 cup sour cream",
        "1/2 teaspoon smoked paprika",
        "White Cheddar Cheese Sauce:",
        "2 tablespoons unsalted butter",
        "1 1/2 tablespoons all-purpose flour",
        "2 1/2 cups milk",
        "5 ounces shredded white Cheddar cheese",
        "salt and ground black pepper to taste",
        "1 cup canned pinto beans, drained",
        "1/2 cup chopped roasted red bell peppers",
        "1 tablespoon thinly sliced green onion (optional)",
        "1 teaspoon minced thyme (optional)"
    ],
    "nut": [
        "Calories > 537 kcal",
        "Carbs > 52.7 g",
        "Cholesterol > 88 mg",
        "Fat > 25.7 g",
        "Protein > 28 g",
        "Sodium > 1620 mg"
    ],
    "n": "Loaded Pulled Pork Totchos",
    "a": "SpoonForkBacon",
    "r": "0",
    "s": 8,
    "des": "\"A big bowl of Tater TotsÂ® topped with pulled pork, barbeque sauce, white Cheddar cheese sauce, pinto beans, and smoked paprika sour cream. Perfect for parties, especially the big game.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C). Spread potato nuggets on a baking sheet in a single layer.\nBake in the preheated oven until browned and crisp, 20 to 25 minutes. Transfer to a large bowl; season lightly with salt.\nMix pulled pork and barbeque sauce together in a bowl until pork is evenly coated.\nWhisk sour cream and smoked paprika together in a small bowl.\nMelt butter in a saucepan over medium heat. Whisk in flour until a paste forms, 2 to 3 minutes. Whisk in milk until no lumps remain. Cook and stir until sauce thickens enough to coat the back of a spoon, about 5 minutes. Remove from heat; whisk in Cheddar cheese until melted. Season sauce with salt and pepper.\nDrizzle Cheddar cheese sauce over potato nuggets. Cover with pulled pork mixture and dollops of sour cream. Top with pinto beans, roasted peppers, green onion, and thyme.",
    "pt": "25 m",
    "ct": "27 m",
    "tt": "52 m",
    "i": "4445774.jpg",
    "o": "",
    "st": "allrecipes"
}