{
    "id": 256619,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound bulk Italian turkey sausage",
        "2 tablespoons olive oil, divided",
        "1 cup finely chopped onion",
        "1 teaspoon minced garlic",
        "1 cup Italian-seasoned bread crumbs",
        "1/2 cup Monterey Jack cheese",
        "1/2 cup mozzarella cheese",
        "1 egg",
        "1/4 cup cooked rice",
        "1/4 cup grated Romano cheese",
        "2 tablespoons chopped fresh parsley, or to taste",
        "salt and ground black pepper to taste",
        "8 Cubanelle peppers, stemmed and seeded"
    ],
    "nut": [
        "Calories > 273 kcal",
        "Carbs > 16.3 g",
        "Cholesterol > 81 mg",
        "Fat > 14.9 g",
        "Protein > 19.1 g",
        "Sodium > 847 mg"
    ],
    "n": "Italian Stuffed Cubanelle Peppers",
    "a": "Megan",
    "r": "0",
    "s": 8,
    "des": "\"I got this delicious recipe from a family friend when looking for something to do with all the extra Cubanelle peppers in my garden. I love the versatility in this recipe because I have a vegetarian; I omit the sausage in the mixture when making a batch for her, and everyone can enjoy this flavorful dish. It can be served with your favorite Italian pasta sauce for extra flair. It's delicious with side of pasta and fresh Italian garlic bread.\"",
    "ins": "Cook and stir sausage in a skillet over medium heat until lightly browned, 5 to 8 minutes. Drain excess grease and transfer to a bowl.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat 1 tablespoon olive oil in the skillet; cook and stir onion and garlic until fragrant, 3 to 5 minutes. Stir in sausage, bread crumbs, Monterey Jack cheese, mozzarella cheese, egg, rice, Romano cheese, and parsley. Season with salt and pepper. Transfer to a bowl.\nWipe out skillet and heat remaining 1 tablespoon oil over medium heat. Cook and stir Cubanelle peppers until lightly browned, 3 to 5 minutes.\nStuff Cubanelle peppers with rice mixture, using a teaspoon to push it into the tip. Arrange stuffed peppers in a 10x13-inch baking dish; cover dish with aluminum foil.\nBake in the preheated oven until peppers are tender, about 45 minutes. Remove foil and bake for 15 minutes more.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}