{
    "id": 256627,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound skinless, boneless chicken breasts, cut into strips",
        "1 (12 ounce) bottle liquid fajita marinade",
        "2 tablespoons vegetable oil",
        "1 clove garlic, minced",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon ground black pepper",
        "2 heads romaine lettuce",
        "2 red bell peppers, cut into 1/4-inch strips",
        "1/2 onion, cut into 1/4-inch strips"
    ],
    "nut": [
        "Calories > 283 kcal",
        "Carbs > 19.6 g",
        "Cholesterol > 65 mg",
        "Fat > 10.2 g",
        "Protein > 26.6 g",
        "Sodium > 1738 mg"
    ],
    "n": "Grilled Chicken Fajita Salad",
    "a": "Baking Nana",
    "r": "0",
    "s": 4,
    "des": "\"Low-carb, no-sweat, sizzling hot grilled fajita salad on the table in less than 30 minutes. \nYes, it is possible! Garnish with lime wedges and finely chopped cilantro if desired. This recipe was made in a Panasonic CIO.\"",
    "ins": "Combine chicken strips and fajita marinade in a large bowl. Let marinate in the refrigerator, 1 hour to overnight.\nPreheat Panasonic Countertop Induction Oven to High on the \"Grill\" setting.\nCombine oil, minced garlic, salt, and pepper together in a bowl. Clean heads of romaine lettuce; cut in half from end to end. Brush halved romaine lettuce with oil-garlic mixture.\nAdd sliced peppers and onions to the oil-garlic mixture. Toss to combine.\nArrange the romaine cut-side down on the heated grill pan. Grill for 2 minutes. Remove and set aside to cool.\nSpread marinated chicken evenly in the hot grill pan; top with the peppers and onions. Cook for 5 minutes. Toss the chicken and vegetables and cook for 5 minutes more. Verify that the chicken is cooked to 165 degrees F (74 degrees C) by using an instant-read thermometer. Add more time if necessary.\nSlice grilled lettuce and place on serving plates. Divide chicken and vegetables evenly over the grilled romaine lettuce.",
    "pt": "20 m",
    "ct": "12 m",
    "tt": "1 h ",
    "i": "4450582.jpg",
    "o": "",
    "st": "allrecipes"
}