{
    "id": 256767,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Roasted Ravioli Dip:",
        "1 (1.37 ounce) package McCormickÂ® Thick & Zesty Spaghetti Sauce Mix",
        "1 (8 ounce) package cream cheese, softened",
        "1 egg",
        "1/2 cup shredded Swiss cheese",
        "1/2 cup shredded white Cheddar cheese",
        "1/2 cup ricotta cheese",
        "1/2 teaspoon McCormickÂ® Basil Leaves",
        "Fried Ravioli Dippers:",
        "2 tablespoons milk",
        "1 egg",
        "3/4 cup unseasoned bread crumbs",
        "1/2 teaspoon McCormickÂ® Perfect PinchÂ® Italian Seasoning",
        "1 (9 ounce) package refrigerated cheese ravioli",
        "Oil for frying"
    ],
    "nut": [
        "Calories > 91 kcal",
        "Carbs > 6.2 g",
        "Cholesterol > 31 mg",
        "Fat > 5.6 g",
        "Protein > 4 g",
        "Sodium > 159 mg"
    ],
    "n": "St. Louis Ravioli Dip",
    "a": "McCormick Spice",
    "r": "0",
    "s": 28,
    "des": "\"That yummy goodness that's tucked into traditional cheese ravioli? That's exactly what this saucy, cheesy dip is, thanks to a mix of ricotta, white Cheddar and Swiss cheeses, along with McCormickÂ® Thick & Zesty Spaghetti Sauce Mix. We're dipping breadsticks, garlic bread and our own version of breaded, fried ravioli into this crowd-pleasing appetizer.\"",
    "ins": "Preheat oven to 375 degrees F. For the Ravioli Dip, prepare spaghetti sauce as directed on package.  Set aside and allow to cool slightly.\nMix cream cheese, egg and shredded cheeses in medium bowl until well blended. Spread 1/2 of the cream cheese mixture on bottom of 9-inch round cake pan sprayed with no stick cooking spray. Spread 1/2 of the spaghetti sauce over cream cheese mixture. Repeat layers. Drop tablespoonfuls of ricotta cheese on top of final sauce layer.\nBake 20 minutes or until heated through. Sprinkle with basil.\nMeanwhile for the Ravioli Dippers, mix milk and egg in small bowl. Mix bread crumbs and Seasoning on a large plate. Dip ravioli into egg mixture and then coat with bread crumb mixture.  Discard any remaining egg and bread crumb mixtures.\nPour 2 inches of oil in large skillet. Heat on medium heat. Fry ravioli in batches, about 1 minute per side or until golden brown. Drain on paper towels. Serve ravioli dippers with Roasted Ravioli Dips",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "4462814.jpg",
    "o": "",
    "st": "allrecipes"
}