{
    "id": 256817,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 pound raw shrimp - peeled, deveined, and cut into small pieces",
        "1/2 pound albacore tuna, cut into small pieces",
        "3/4 cup lemon juice, divided",
        "3/4 cup lime juice, divided",
        "1 mango, peeled and diced",
        "3/4 cup pale ale (such as Going to the Sun IPA)",
        "1 tomato, diced",
        "1/2 yellow onion, diced",
        "1 jalapeno pepper, seeded and diced",
        "1 teaspoon mango hot sauce",
        "1 teaspoon sriracha sauce",
        "2 strips bacon, chopped",
        "1 head napa cabbage, leaves separated",
        "1 head radicchio, leaves separated"
    ],
    "nut": [
        "Calories > 305 kcal",
        "Carbs > 35.4 g",
        "Cholesterol > 117 mg",
        "Fat > 4.4 g",
        "Protein > 32.8 g",
        "Sodium > 344 mg"
    ],
    "n": "IPA Ceviche Lettuce Wraps with Bacon",
    "a": "Radd Icenoggle",
    "r": "0",
    "s": 4,
    "des": "\"The temperatures keep creeping up as winter gives way to spring and eventually summer. With these sun-filled days, lighter fare for dinner is more in order. Ceviche, fresh raw fish cured in citrus juices, meets the requirements for a great summer dish: quick, fresh, cooling. \nThis particular recipe features the Going to the Sun IPA from the Great Northern Brewing of Whitefish, Montana.\"",
    "ins": "Combine shrimp and albacore tuna in a small bowl; cover with 1/2 cup lemon juice and 1/2 lime juice. Cure in the refrigerator for at least 2 hours.\nCombine remaining lemon juice and lime juice, mango, pale ale, tomato, yellow onion, jalapeno pepper, mango hot sauce, and sriracha sauce in a bowl. Refrigerate until flavors combine, at least 1 hour.\nPreheat oven to 225 degrees F (110 degrees C). Line a baking sheet with aluminum foil.\nSpread bacon pieces on the lined baking sheet.\nBake in the preheated oven until bacon is crisp, 20 to 30 minutes.\nDrain shrimp and tuna; toss with mango mixture to combine. Divide mixture among napa cabbage and radicchio leaves. Sprinkle bacon on top.",
    "pt": "35 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}