{
    "id": 256856,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Bread:",
        "4 cups all-purpose flour",
        "3 eggs",
        "3 eggs, separated",
        "2/3 cup white sugar",
        "1 tablespoon warm water",
        "2 (.25 ounce) packages dry yeast",
        "1 orange, zested",
        "1 lime, zested",
        "1 pinch salt",
        "1/2 cup butter, softened",
        "1 tablespoon butter, softened",
        "Topping:",
        "1/2 cup white sugar",
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "20 candied citrus peels"
    ],
    "nut": [
        "Calories > 397 kcal",
        "Carbs > 56.7 g",
        "Cholesterol > 126 mg",
        "Fat > 15.5 g",
        "Protein > 8.3 g",
        "Sodium > 138 mg"
    ],
    "n": "Rosca de Reyes",
    "a": "repostera",
    "r": "0",
    "s": 12,
    "des": "\"This traditional holiday Mexican bread is a bit time-consuming, but absolutely worth the effort.\"",
    "ins": "Mix 4 cups flour, eggs, egg yolks, 2/3 cup white sugar, water, dry yeast, orange zest, lime zest, and salt in the bowl of an electric mixer fitted with a dough hook. Add 1/2 cup plus 1 tablespoon butter; mix until dough is elastic and shiny, about 5 minutes.\nForm dough into a ball. Cover and let rise in a warm place for 45 minutes.\nPunch down dough gently; roll into a long cylinder. Join the ends of the cylinder together in the shape of an oval ring. Place ring on a greased baking sheet; cover and let rise in a warm place for 45 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nWhisk eggs whites in a small bowl. Brush egg whites evenly over dough.\nMix 1/2 cup white sugar and 1/4 cup butter in a small bowl with your fingers to form a paste. Add enough flour to give paste the consistency of Play-Doh(R); divide into 5 or 6 balls. Place each ball between two 3-inch squares of parchment paper. Press with the bottom of a 1-cup measuring cup to make a circle about 1/8 inch thick.\nSpace circles evenly around the dough ring. Arrange candied citrus peels on top of the dough.\nBake in the preheated oven until golden brown, about 20 minutes. Cool for 20 minutes before slicing.",
    "pt": "35 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}