{
    "id": 256983,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds bone-in chicken thighs with skin",
        "salt and ground black pepper to taste",
        "1 pound baby red potatoes",
        "1 tablespoon olive oil",
        "1/2 cup ketchup",
        "1/4 cup bourbon",
        "1 cup apple cider juice",
        "1 tablespoon cornstarch",
        "1/8 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 569 kcal",
        "Carbs > 35.8 g",
        "Cholesterol > 128 mg",
        "Fat > 26 g",
        "Protein > 38 g",
        "Sodium > 495 mg"
    ],
    "n": "Bourbon Cider Chicken Thighs with Potatoes",
    "a": "Chef Mo",
    "r": "0",
    "s": 4,
    "des": "\"Use Auto-Cook on your PanasonicÂ® Countertop Induction Oven for your chicken and potatoes while making a simple, but flavorful sauce on the stove. Dinner will be ready in less than 30 minutes!\"",
    "ins": "Pat chicken thighs dry with a paper towel; season with salt and pepper. Place chicken thighs skin-side up on the grill pan of a Countertop Induction Oven (CIO).\nCut larger potatoes in half so all potatoes are about the same size. Place potatoes in a bowl and drizzle olive oil over potatoes; season with salt and pepper. Place potatoes on the grill pan with chicken.\nPlace grill pan in the CIO and set to \"Auto Cook 1\" for 2 pounds chicken. Cook chicken until no longer pink and an instant-read thermometer inserted near the bone reads 165 degrees F (74 degrees C), about 24 minutes.\nCombine ketchup and bourbon in a small saucepan over medium-high heat. Whisk apple cider and cornstarch together in a small bowl until smooth; pour into ketchup mixture. Bring to a boil, whisking occasionally, until sauce is thickened, about 10 minutes. Remove sauce from heat and stir in 1/8 teaspoon black pepper; set aside to cool.\nServe chicken and potatoes with sauce on the side.",
    "pt": "15 m",
    "ct": "39 m",
    "tt": "54 m",
    "i": "4467149.jpg",
    "o": "",
    "st": "allrecipes"
}