{
    "id": 256958,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 cups diced apples",
        "2 tablespoons Hungry JackÂ® Original Syrup",
        "2 1/4 cups Hungry JackÂ® Pancake and Waffle Mix, divided",
        "1/2 cup milk",
        "2 tablespoons Hungry JackÂ® Original Syrup, divided",
        "1/4 cup brown sugar",
        "1/4 cup sugar",
        "1 teaspoon cinnamon",
        "2 tablespoons melted butter, divided",
        "Frosting:",
        "2 ounces cream cheese, softened",
        "1 teaspoon pancake syrup",
        "3/4 cup confectioners' sugar"
    ],
    "nut": [
        "Calories > 290 kcal",
        "Carbs > 55.8 g",
        "Cholesterol > 15 mg",
        "Fat > 6.6 g",
        "Protein > 4 g",
        "Sodium > 515 mg"
    ],
    "n": "Easy Apple Cinnamon Rolls",
    "a": "Hungry Jack",
    "r": "0",
    "s": 9,
    "des": "\"These cinnamon rolls are filled with diced apples and are frosted with a creamy mixture of cream cheese, pancake syrup, and confectioners' sugar.\"",
    "ins": "Preheat the oven to 350 degrees F. Butter an 8x8 pan.\nCombine the apples and syrup in a saucepan and cook over medium heat until the juice from the apples is gone. Set aside to cool.\nMix together 2 cups pancake mix, milk, and 1 tablespoon syrup until a soft dough forms. Sprinkle the counter with the remaining pancake mix and knead the dough a few times. Make sure you keep enough pancake mix under the dough. Gently press the dough into a 12x8 rectangle using your hands.\nSpread the cooled apples on top of the dough.\nMix together the brown sugar, granulated sugar, cinnamon, and 1 tablespoon butter. Sprinkle over the apples. Gently roll the dough up starting from the shorter side. If your dough sticks to the counter, slide a butter knife gently under the roll and push some pancake mix underneath the roll.\nSlice the log into 9 even rolls. Place the rolls in the prepared pan. Mix together the remaining tablespoon of melted butter and syrup. Drizzle over the rolls in the pan. Bake for 20 to 22 minutes. Remove and cool for a few minutes.\nMix together the frosting ingredients and spread over the warm rolls. Drizzle with extra syrup, if desired.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "4489309.jpg",
    "o": "",
    "st": "allrecipes"
}