{
    "id": 256932,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Japanese Cucumber Salad:",
        "3 Japanese cucumbers, very thinly sliced",
        "1 tablespoon kosher salt",
        "1/4 cup rice vinegar",
        "1 tablespoon soy sauce",
        "2 teaspoons white sugar",
        "1 teaspoon sesame oil",
        "1 tablespoon toasted sesame seeds",
        "Teriyaki Sauce:",
        "3 tablespoons soy sauce",
        "2 tablespoons mirin",
        "2 tablespoons sake",
        "2 tablespoons white sugar",
        "Chicken:",
        "1 tablespoon vegetable oil",
        "6 bone-in, skin-on chicken thighs",
        "Toppings:",
        "6 (6 inch) corn tortillas",
        "1 (8 ounce) container sour cream",
        "3 tablespoons sriracha sauce",
        "3 scallions, sliced into thin strips",
        "1 tablespoon black sesame seeds (optional)"
    ],
    "nut": [
        "Calories > 422 kcal",
        "Carbs > 23.4 g",
        "Cholesterol > 88 mg",
        "Fat > 25.1 g",
        "Protein > 23.2 g",
        "Sodium > 1976 mg"
    ],
    "n": "Chicken Teriyaki Tacos",
    "a": "Hapanom",
    "r": "0",
    "s": 6,
    "des": "\"This recipe for chicken teriyaki tacos is like a symphony of flavors: savory and incredibly crispy chicken smothered in a rich teriyaki sauce, topped with a tangy Japanese cucumber salad, scallions, and spicy sriracha sour cream.\"",
    "ins": "Place cucumber slices in a colander in the sink. Sprinkle salt on top and toss to coat. Allow to sit for 20 minutes. Rinse cucumber slices very well with cold water; drain.\nMix rice vinegar, 1 tablespoon soy sauce, 2 teaspoons sugar, and sesame oil together in a bowl. Add cucumber slices and sesame seeds. Toss gently and transfer to the refrigerator.\nWhisk 3 tablespoons soy sauce, mirin, sake, and 2 tablespoons sugar in a small bowl to make teriyaki sauce.\nHeat oil in a large skillet over medium-high heat. Prick chicken skin all over with a fork; place skin-side down in the hot oil. Cook until the skin is golden brown, about 12 minutes. Flip and continue cooking until second side is browned, about 7 minutes.\nReduce heat to medium; pour teriyaki sauce over chicken. Cook until sauce thickens, about 2 minutes. Remove from heat. Cover and let rest for 5 minutes. Slice chicken into strips and place in a bowl; add teriyaki sauce from the skillet and toss to coat.\nToast corn tortillas in a large, dry skillet over medium-high heat until crisp and slightly blackened around the edges, 1 to 2 minutes per side. Wrap in a dish towel to keep warm.\nMix sour cream and sriracha sauce together in a small bowl.\nDivide teriyaki chicken among tortillas. Drizzle sour cream-sriracha mixture over chicken. Top with cucumber salad, scallions, and black sesame seeds.",
    "pt": "25 m",
    "ct": "23 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}