{
    "id": 256992,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon olive oil",
        "4 boneless pork chops",
        "1/4 cup beer",
        "1 tablespoon soy sauce",
        "1 teaspoon honey",
        "1 teaspoon Dijon mustard",
        "1 clove garlic, crushed",
        "1 large apple, peeled and sliced",
        "Colcannon:",
        "4 potatoes, peeled",
        "1/3 cup butter",
        "1/3 cup milk",
        "4 ounces chopped curly kale",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 525 kcal",
        "Carbs > 51.2 g",
        "Cholesterol > 81 mg",
        "Fat > 26.9 g",
        "Protein > 20.9 g",
        "Sodium > 466 mg"
    ],
    "n": "Pork Chops with Apple Mustard Sauce and Colcannon",
    "a": "Ita",
    "r": "0",
    "s": 4,
    "des": "\"Pork chops are quick and easy for any night of the week. The sauce is made with beer, mustard, honey, garlic and soy sauce, so you'll probably have all of the ingredients you need in your cupboard already. This is delicious served with colcannon, which allows you to add plenty of dark green veg to your diet!\"",
    "ins": "Heat oil in a skillet over medium-high heat. Cook chops until browned, about 3 minutes per side. Reduce heat to low; stir in beer, soy sauce, honey, Dijon mustard, and garlic. Add apple slices; simmer until tender, about 10 minutes.\nPlace potatoes in a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer potatoes until tender, about 20 minutes. Drain and return potatoes to the pot.\nCombine butter and milk in a saucepan over medium heat; heat until butter is melted, 3 to 5 minutes. Add kale and simmer until softened, 5 to 10 minutes. Pour over warm boiled potatoes; mash well. Season colcannon with salt and pepper.\nServe pork chops and apple slices over colcannon.",
    "pt": "15 m",
    "ct": "49 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}