{
    "id": 256921,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 (13 ounce) can Mexican cajeta caramel",
        "Cake:",
        "1 (18.25 ounce) box devil's food cake mix",
        "1 1/2 cups water",
        "3 eggs",
        "1/2 cup vegetable oil",
        "Flan:",
        "1 (14 ounce) can sweetened condensed milk",
        "1 (12 fluid ounce) can evaporated milk",
        "5 eggs",
        "1 (8 ounce) package cream cheese, at room temperature",
        "1/2 cup whole milk",
        "1 1/2 teaspoons Mexican vanilla extract"
    ],
    "nut": [
        "Calories > 638 kcal",
        "Carbs > 74.4 g",
        "Cholesterol > 174 mg",
        "Fat > 31.3 g",
        "Protein > 15.6 g",
        "Sodium > 553 mg"
    ],
    "n": "Chocolate Flan Cake",
    "a": "SB",
    "r": "0",
    "s": 12,
    "des": "\"This cake layered with caramel, flan, and chocolate cake is sure to be a hit. You can find this cake in most Mexican bakeries. The first time I tried it, I knew I had to find a good recipe. Finally after much pleading the woman gave it to me! It's very time consuming but worth the end result!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a 15-cup fluted tube pan (such as Bundt(R)) with cooking spray.\nPour cajeta into a microwave-safe bowl. Heat in the microwave until smooth, 20 to 30 seconds. Pour into the bottom of the prepared pan.\nCombine cake mix, water, 3 eggs, and vegetable oil in a large bowl; beat with an electric mixer on low speed until moistened, about 30 seconds. Increase speed to medium and beat until batter is smooth, about 2 minutes.\nPour cake batter over cajeta in the pan.\nCombine condensed milk, evaporated milk, 5 eggs, cream cheese, milk, and vanilla extract in a blender; blend until smooth.\nPour milk mixture slowly over cake batter.\nWrap pan tightly with aluminum foil; place in a large baking dish. Pour enough water into the baking dish to come 2 inches up the sides of the pan.\nBake in the preheated oven until a toothpick inserted into the cake comes out clean, about 2 hours. Remove pan from the baking dish; let cool for 15 minutes. Unwrap the aluminum foil; invert cake onto a large rimmed plate. Let cake cool completely, about 30 minutes. Chill before serving.",
    "pt": "20 m",
    "ct": "2 h",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}