{
    "id": 256979,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "12 empanada pastry rounds",
        "5 tablespoons butter, divided",
        "3 spring onions, minced",
        "1 (14 ounce) can sweet corn, drained",
        "salt and ground black pepper to taste",
        "1 pinch ground nutmeg",
        "6 tablespoons all-purpose flour",
        "1 1/2 cups whole milk",
        "6 tablespoons grated Parmesan cheese, divided"
    ],
    "nut": [
        "Calories > 224 kcal",
        "Carbs > 31.1 g",
        "Cholesterol > 18 mg",
        "Fat > 9.4 g",
        "Protein > 6.4 g",
        "Sodium > 377 mg"
    ],
    "n": "Empanadas Abiertas de Humita (Creamy Corn Empanadas)",
    "a": "MariaZoroza",
    "r": "0",
    "s": 12,
    "des": "\"Creamy corn empanadas are an Argentinean classic. These can be made open like a tart or closed like a pasty - the choice is yours! You can opt to make the pasty-like version; find the method in the footnote.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease and flour a 12-cup muffin tin.\nLine the muffin cups with the 12 pastry rounds.\nHeat 2 tablespoons butter in a skillet over medium heat; cook and stir spring onions until tender, 3 to 5 minutes. Add corn, salt, pepper, and nutmeg; cook and stir until heated through, about 2 minutes. Remove skillet from heat.\nHeat 3 tablespoons butter in a saucepan over medium heat; add flour and cook, stirring with a wooden spoon, until a paste forms, about 1 minute. Slowly pour in milk, whisking constantly, and cook until a thick sauce forms and starts to bubble, 2 to 3 minutes. Add half of the Parmesan cheese and stir until smooth; remove from heat. Stir sauce into corn mixture.\nFill pastry with corn mixture and top each with remaining Parmesan cheese.\nBake in the preheated oven until golden, about 15 minutes.",
    "pt": "15 m",
    "ct": "23 m",
    "tt": "38 m",
    "i": "4500627.jpg",
    "o": "",
    "st": "allrecipes"
}