{
    "id": 256912,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 Ball ParkÂ® Hamburger Buns",
        "2 tablespoons extra virgin olive oil",
        "Burgers:",
        "2 pounds ground bison",
        "1 teaspoon kosher salt",
        "1 teaspoon sweet paprika",
        "1 teaspoon garlic granules",
        "1 teaspoon onion powder",
        "1 teaspoon ground black pepper",
        "1 tablespoon extra-virgin olive oil , divided",
        "Smoky BBQ Sauce:",
        "1 cup ketchup",
        "1 tablespoon molasses",
        "1 tablespoon apple cider vinegar",
        "1 tablespoon Worcestershire sauce",
        "2 teaspoons ground chipotle pepper, or more to taste",
        "1 teaspoon garlic granules",
        "1 teaspoon onion powder",
        "1 teaspoon kosher salt",
        "1 teaspoon ground cumin",
        "1/2 teaspoon dry mustard",
        "Thick-cut dill pickle slices",
        "Hamburger trimmings, such as lettuce, tomato, onion, mustard, if desired"
    ],
    "nut": [
        "Calories > 350 kcal",
        "Carbs > 47.3 g",
        "Cholesterol > 39 mg",
        "Fat > 10.3 g",
        "Protein > 21.3 g",
        "Sodium > 1443 mg"
    ],
    "n": "Smoky Bison Burger",
    "a": "Ball Park Buns",
    "r": "0",
    "s": 6,
    "des": "\"Bison (aka buffalo) meat is one of the healthiest proteins around. It has more Omega-3 fatty acids than even salmon and it's lower in fat and cholesterol than boneless, skinless chicken breast. The best part? It's absolutely delicious. Topped with a smoky sauce and dill pickles, this burger is a taste of the American West. Serve pinto beans, cheesy corn casserole or steak-cut fries alongside.\"",
    "ins": "To make the sauce, combine ketchup with ground chile, molasses, vinegar, Worcestershire sauce, garlic, onion powder, salt, cumin and mustard.\nWhisk well and set aside.\nTo prepare burgers, mix the ground bison with seasonings in a large bowl.\nShape 8 patties of equal size and brush each with half of the olive oil.\nIn a large skillet, add reserved olive oil and heat until smoking over medium-high heat.\nCook 4 patties, covered, for 5 minutes. Turn and cook another 5 minutes, covered. (Add cheese, if desired, for the last 1 minute of cooking.)\nRemove to a warm platter and cover while you cook the remaining patties.\nKeeping the skillet warm, brush the buns with olive oil and toast on either side for about 10 to 15 seconds.\nAssemble burgers by placing cooked patties on bun bottoms, topping with smoky sauce and pickles, along with desired burger toppings.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "25 m",
    "i": "4469232.jpg",
    "o": "",
    "st": "allrecipes"
}