{
    "id": 256957,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound thick-cut bacon",
        "1/4 cup maple syrup, plus more for serving",
        "1 tablespoon brown sugar",
        "1/2 teaspoon pumpkin pie spice",
        "2 cups Hungry JackÂ® Pancake & Waffle Mix",
        "1 cup milk",
        "1/2 cup canned pumpkin (not pumpkin pie mix)",
        "1/4 cup canola oil",
        "1 teaspoon pumpkin pie spice, plus more for serving",
        "Fresh whipped cream"
    ],
    "nut": [
        "Calories > 668 kcal",
        "Carbs > 46.5 g",
        "Cholesterol > 62 mg",
        "Fat > 47.7 g",
        "Protein > 14.5 g",
        "Sodium > 1250 mg"
    ],
    "n": "Pumpkin Spice Maple Bacon Waffles",
    "a": "Hungry Jack",
    "r": "0",
    "s": 6,
    "des": "\"These waffles with glazed maple bacon pieces and pumpkin pie spice make a delicious and hearty breakfast.\"",
    "ins": "Whisk together the maple syrup, brown sugar, and 1/2 teaspoon pumpkin pie spice.\nLine a rimmed baking sheet with foil. Place a baking rack on top of the foil and spray generously with non-stick cooking spray. Place bacon slices across the rack making sure to not overlap.\nTurn oven to 400 degrees F and bake bacon for 15 to 20 minutes. (Do not preheat the oven.)\nCarefully remove the baking sheet from the oven and brush bacon with maple glaze. Return to the oven for another 7 to 8 minutes.\nCarefully remove the baking sheet from the oven and, using a pair of tongs, flip bacon over. Brush with the maple glaze.\nReturn baking sheet to the oven and bake for another 5 to 7 minutes or until bacon reaches your desired level of crispness.\nRemove the baking sheet from the oven (last time!) and let the bacon rest for 5 minutes before removing.\nRoughly chop bacon into bite-size pieces. Reserve 1/4 cup for topping the waffles later.\nWhisk together the pancake mix, milk, pumpkin, oil, and pumpkin pie spice just until blended. Add bacon and stir to combine.\nPreheat waffle iron; cook waffles according to manufacturer's instructions.\nTop waffles with freshly whipped cream, maple bacon, pumpkin pie spice, and maple syrup.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "45 m",
    "i": "4489308.jpg",
    "o": "",
    "st": "allrecipes"
}