{
    "id": 256994,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup self-rising flour",
        "5 tablespoons milk",
        "1 pound potatoes, peeled and coarsely grated",
        "salt and freshly ground black pepper to taste",
        "2 tablespoons butter, divided",
        "2 tablespoons vegetable oil, divided",
        "3 tablespoons all-purpose flour",
        "1 teaspoon dried mixed herbs",
        "8 ounces lamb's liver, cut into thin strips",
        "8 slices bacon",
        "6 ounces shredded cabbage"
    ],
    "nut": [
        "Calories > 353 kcal",
        "Carbs > 35.1 g",
        "Cholesterol > 135 mg",
        "Fat > 16.9 g",
        "Protein > 15 g",
        "Sodium > 641 mg"
    ],
    "n": "Boxty with Liver and Bacon",
    "a": "jean.isacke",
    "r": "0",
    "s": 6,
    "des": "\"This Irish specialty consists of traditional potato pancakes served with bacon, lamb's liver, and cabbage.\"",
    "ins": "Sift self-rising flour into a bowl; stir in milk. Squeeze excess moisture from the grated potatoes and mix in. Season with salt and pepper.\nMelt 1 1/2 teaspoon butter with 1 teaspoon oil in a large skillet over medium heat. Spread a quarter of the potato mixture in the skillet; cook until golden brown, 3 to 4 minutes per side. Repeat 3 times with remaining butter, oil, and potato mixture. Stack potato pancakes on a plate and keep warm.\nMix all-purpose flour, mixed herbs, salt, and pepper in a bowl. Roll liver strips in the flour mixture until evenly coated.\nHeat remaining 2 teaspoons oil in the skillet. Cook and stir liver strips in the hot oil until golden brown, 2 to 3 minutes.\nCook bacon slices in the same skillet, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels.\nBring a large pot of lightly salted water to a boil. Add cabbage; cook until wilted, about 3 minutes. Drain.\nServe warm potatoes pancakes topped with liver, bacon, and cabbage. Season with black pepper.",
    "pt": "25 m",
    "ct": "26 m",
    "tt": "51 m",
    "i": "4535254.jpg",
    "o": "",
    "st": "allrecipes"
}