{
    "id": 256907,
    "old_rating": "4.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 Ball ParkÂ® Tailgaters Brat Buns",
        "Brats:",
        "8 bratwurst",
        "1 cup water",
        "1 cup beer",
        "Cabbage:",
        "1 tablespoon olive oil",
        "1/2 red onion, thinly sliced",
        "1/2 head red cabbage, sliced",
        "1/4 head green cabbage, sliced",
        "1/2 cup apple cider vinegar",
        "1 tablespoon brown sugar",
        "2 teaspoons paprika",
        "1 teaspoon sea salt",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon ground allspice",
        "German or deli-style mustard"
    ],
    "nut": [
        "Calories > 790 kcal",
        "Carbs > 70.9 g",
        "Cholesterol > 92 mg",
        "Fat > 41.6 g",
        "Protein > 27.2 g",
        "Sodium > 1891 mg"
    ],
    "n": "Grilled Brats with Quick-Cooked Cabbage",
    "a": "Ball Park Buns",
    "r": "0",
    "s": 6,
    "des": "\"In German cuisine, bratwursts typically come with sauerkraut or red cabbage. We say, why choose? This recipe combines those ideas, with a tangy-tart braised cabbage that cooks in just a few moments. Cooking the brats with a combination of water and beer, if desired, infuses the sausages with even more flavor. Serve with German mustard and German potato salad on the side.\"",
    "ins": "Prick each brat with the tip of a knife a few times on each side.\nIn a large skillet, place brats and add water and beer to the pan to reach halfway up the sides of the brats.\nCook over medium heat for 15 to 20 minutes, turning once.\nIncrease heat to medium-high and cook another 5 to 10 minutes or until liquid evaporates. Remove sausages to a plate to hold.\nAdd olive oil, onion and red and green cabbage to the pan and stir well, cooking over medium-high heat for 3 minutes.\nAdd vinegar, brown sugar and seasonings, stir well and reduce heat to medium.\nCover and cook for another 5 minutes. Stir once more.\nMeanwhile, warm hot dog buns in a 400-degree oven for about 10 minutes, taking care not to brown.\nSpread mustard on each bun, top with a brat and spoon warm cabbage saute on top.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "4469227.jpg",
    "o": "",
    "st": "allrecipes"
}