{
    "id": 256914,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 Ball ParkÂ® Hamburger Buns",
        "1 (3 pound) boneless pork butt roast, trimmed and quartered",
        "Pork Rub:",
        "1/2 cup packed light brown sugar",
        "1/2 cup sweet paprika",
        "1 tablespoon garlic granules",
        "1 tablespoon ground cumin",
        "1 teaspoon ground cayenne",
        "1/2 teaspoon ground ginger",
        "1 teaspoon kosher salt",
        "1/2 teaspoon ground black pepper",
        "BBQ Sauce:",
        "2 cups ketchup",
        "1/2 cup brown sugar",
        "3/4 cup apple cider vinegar",
        "2 tablespoons plain mustard",
        "1 tablespoon honey",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon liquid smoke flavoring",
        "1/4 cup pork rub",
        "Sweet & Sour Slaw:",
        "3/4 cup white balsamic vinegar",
        "2 tablespoons olive oil",
        "2 tablespoons brown sugar",
        "2 teaspoons garlic granules",
        "Kosher salt and ground black pepper, to taste",
        "1 1/2 cups shredded red cabbage",
        "1 1/2 cups shredded carrots",
        "1 cup seeded, peeled, chopped cucumber",
        "1/2 cup finely chopped Italian parsley"
    ],
    "nut": [
        "Calories > 806 kcal",
        "Carbs > 114.4 g",
        "Cholesterol > 96 mg",
        "Fat > 26.5 g",
        "Protein > 35.5 g",
        "Sodium > 1781 mg"
    ],
    "n": "Barbecued Pulled Pork with Sweet & Sour Slaw",
    "a": "Ball Park Buns",
    "r": "0",
    "s": 6,
    "des": "\"This hearty dish is a great make-ahead option (thank you, slow cooker!) for your next family gathering or tailgate party. You can adjust the sweet and spicy flavors as desired. The slaw can be part of the sandwich or served on the side - or both. Pair it with potato salad, baked beans or mac 'n cheese.\"",
    "ins": "To make rub, combine all ingredients in a large bowl. Mix well with a fork. Reserve 1/4 cup of the rub to use in the barbecue sauce.\nTo make sauce, combine all ingredients in a large Mason jar, stirring well. Cover with tight-fitting lid and give it one more good shake. Place in refrigerator overnight.\nPlace pork rub in a large casserole dish.\nUsing a fork, pierce the pork several times all over.\nRub the spice blend into the pork, covering all surfaces.\nWrap rubbed pork tightly in plastic and refrigerate 8 hours or overnight.\nAt cooking time, unwrap the pork and place in a slow-cooker.\nPour 1 cup of the Barbecue Sauce on the pork, covering all surfaces.\nCover and cook until tender, 9 to 11 hours on Low or 5 to 7 hours on High.\nTransfer pork to a large, deep, wide casserole dish and cool for 15 to 20 minutes.\nUsing two large forks, shred the pork into bite-size pieces, discarding excess fat. Cover to keep warm.\nSkim any fat from the liquid in the pot. Transfer 2 to 3 tablespoons to a bowl and stir in the remaining barbecue sauce.\nStir well and add more of the braising liquid if you prefer a thinner sauce.\nWarm buns in the oven at 400 degrees, turning over once, just until slightly toasty.\nPile pulled pork onto buns, top with some of the Barbecue Sauce and some Tangy Slaw (recipe below) and enjoy.\nFor the slaw: In a large bowl, whisk together vinegar, oil, brown sugar, garlic, salt and pepper.\nAdd cabbage, carrots, cucumber and parsley, mixing well.\nAllow to sit, loosely covered with plastic, for about 30 minutes.\nToss once before serving, adjusting seasonings, if desired.",
    "pt": "25 m",
    "ct": "9 h",
    "tt": "9 h ",
    "i": "4469235.jpg",
    "o": "",
    "st": "allrecipes"
}