{
    "id": 256984,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Rice:",
        "3 cups water",
        "1 cup long-grain brown rice",
        "1/2 teaspoon salt",
        "Dressing:",
        "1 lime, juiced",
        "2 tablespoons olive oil",
        "1 tablespoon sesame oil",
        "1 tablespoon dried Thai basil",
        "1 teaspoon minced hot chile pepper",
        "Vegetables:",
        "2 tablespoons sesame seeds",
        "1/2 (8 ounce) package snow peas",
        "1 cup cooked chickpeas, drained",
        "1/2 (16 ounce) package firm tofu, cut into strips",
        "16 baby corn, cut into bite-sized pieces",
        "1 cup grated carrots",
        "1 small green bell pepper, diced",
        "2 green onions, cut on the diagonal",
        "2 tablespoons chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 583 kcal",
        "Carbs > 80.5 g",
        "Cholesterol > 0 mg",
        "Fat > 22.6 g",
        "Protein > 18 g",
        "Sodium > 692 mg"
    ],
    "n": "Brown Rice Buddha Bowl",
    "a": "Buckwheat Queen",
    "r": "0",
    "s": 3,
    "des": "\"A fresh and crisp meal in one. Brown rice, vegetables, tofu and chickpeas are topped with a spicy Thai basil dressing and toasted sesame seeds.\"",
    "ins": "Combine water, brown rice, and salt in a pressure cooker. Close and secure the lid; bring to high pressure according to manufacturer's instructions. Cook for 10 minutes. Release pressure naturally according to manufacturer's instructions. Drain any remaining water and transfer rice to a large bowl.\nWhisk lime juice, olive oil, sesame oil, Thai basil, and chile pepper in a small bowl to make dressing.\nToast sesame seeds in a nonstick skillet over medium-low heat, stirring occasionally, until evenly browned and fragrant, about 5 minutes. Transfer to a bowl.\nCook and stir snow peas in the same skillet until bright green, 3 to 5 minutes. Remove from heat and let cool.\nArrange snow peas, chickpeas, tofu, baby corn, carrots, and green bell pepper over the brown rice. Drizzle dressing over the entire bowl; toss to mix. Sprinkle toasted sesame seeds on top. Garnish with green onions and cilantro.",
    "pt": "30 m",
    "ct": "18 m",
    "tt": "48 m",
    "i": "4464348.jpg",
    "o": "",
    "st": "allrecipes"
}