{
    "id": 256933,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Cashew Cheese:",
        "2 1/2 cups unsalted raw cashews",
        "2 tablespoons red wine vinegar",
        "2 teaspoons white miso",
        "1/2 teaspoon raw sugar",
        "salt to taste",
        "Pesto:",
        "3 cups roughly chopped basil leaves",
        "1/3 cup roughly chopped raw walnuts",
        "1/4 cup extra-virgin olive oil",
        "2 tablespoons nutritional yeast",
        "1/2 lemon, juiced",
        "1 clove garlic, minced",
        "Eggplant:",
        "1 large light purple eggplant, cut into 1/4-inch slices",
        "1 1/2 tablespoons extra-virgin olive oil",
        "salt and ground black pepper to taste",
        "2 cups marinara sauce"
    ],
    "nut": [
        "Calories > 888 kcal",
        "Carbs > 59.5 g",
        "Cholesterol > 2 mg",
        "Fat > 67 g",
        "Protein > 24.5 g",
        "Sodium > 715 mg"
    ],
    "n": "Vegan Eggplant Rollatini",
    "a": "Juhea Kim",
    "r": "0",
    "s": 4,
    "des": "\"I adapted this dish from a vegan umami cooking class I took one night last year. Pretty purple eggplant rolled with vegan cashew cheese and pesto, and baked in tomato sauce--it's so incredibly tasty, and sure to please anyone. It's casual and elegant, healthy yet comforting.\"",
    "ins": "Place cashews in a large bowl and cover with water; let soak for 7 hours. Drain.\nCombine cashews, red wine vinegar, miso, sugar, and salt in a high-speed blender; blend until mixture is thick and creamy.\nCombine basil leaves, walnuts, 1/4 cup olive oil, nutritional yeast, lemon juice, and garlic in a food processor; blend until pesto is smooth.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.\nToss eggplant with 1 1/2 tablespoon oil, salt, and pepper in a large bowl. Arrange eggplant on the baking sheet.\nBroil eggplant until browned, about 5 minutes per side. Reduce oven temperature to 350 degrees F (175 degrees C).\nSpread 3/4 cup marinara sauce in the bottom of a baking dish. Place 1 tablespoon cashew mixture and 1 tablespoon pesto on the end of an eggplant slice; roll up. Place seam-side down in the sauce. Repeat with remaining cashew mixture, pesto, and eggplant slices. Dot the eggplant with remaining marinara sauce. Cover dish with aluminum foil.\nBake in the preheated oven until sauce is heated through, about 10 minutes.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "7 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}