{
    "id": 256910,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Herbed Mayonnaise:",
        "1/2 cup mayonnaise",
        "3 tablespoons herbes de Provence",
        "2 teaspoons Worcestershire sauce",
        "1 teaspoon lemon juice",
        "8 Ball ParkÂ® Hamburger Buns",
        "1/2 pound thick-cut smoked bacon",
        "1/2 pound button mushrooms, sliced",
        "1 tablespoon soy sauce",
        "2 pounds lean ground beef",
        "2 teaspoons garlic granules",
        "Salt and pepper to taste",
        "16 slices Swiss cheese",
        "Burger trimmings as desired, including lettuce, tomato, onion and pickles"
    ],
    "nut": [
        "Calories > 952 kcal",
        "Carbs > 39.5 g",
        "Cholesterol > 195 mg",
        "Fat > 61.3 g",
        "Protein > 62.7 g",
        "Sodium > 1064 mg"
    ],
    "n": "Bacon-Mushroom-Swiss Burger",
    "a": "Ball Park Buns",
    "r": "0",
    "s": 6,
    "des": "\"Basic gets a boost when you pair burgers with crisp, smoky bacon, earthy mushrooms and melty Swiss cheese. The herbed mayonnaise adds instant sophistication, and toasting the buns gives an extra layer of texture. Sweet potato fries or chips go great with this burger.\"",
    "ins": "To prepare herbed mayo: In a medium bowl, combine mayonnaise, dried herbs, Worcestershire sauce and lemon juice, mixing well. Cover and refrigerate.\nCut each strip of bacon in half and cook in a skillet over medium heat until crisp.\nRemove and drain on paper towels. Pour off all but 1 tablespoon bacon drippings from the pan.\nAdd mushroom slices and soy sauce to the pan.\nOver medium heat, saute mushrooms until browned and soft, about 5 to 10 minutes. Drain on paper towels.\nPreheat grill for medium heat and lightly oil the grate.\nTo prepare burgers, mix ground beef, garlic granules, and salt and pepper together in a bowl. Form into patties. Place on prepared grill and grill 3 to 5 minutes per each side. An instant-read thermometer inserted into the center should read 150 degrees F (65 degrees C).\nDuring last 2 minutes of cooking, top with cheese and cover to melt cheese.\nMeanwhile, heat oven to 400 degrees, arrange hamburger buns on a foil-lined cookie sheet and lightly toast hamburger buns in the oven on each side.\nWhen toasted, remove buns to serving plates and spread some of the herbed mayonnaise on each bun.\nTo serve, put cheese-topped patties on each bun, add desired hamburger trimmings, finish with the top bun and enjoy.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "4469230.jpg",
    "o": "",
    "st": "allrecipes"
}