{
    "id": 256915,
    "old_rating": "4.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 Ball ParkÂ® Hot Dog Buns",
        "2 cups tomato sauce",
        "3 teaspoons garlic granules",
        "3 teaspoons dried Italian herb blend",
        "1 teaspoon sweet paprika",
        "1 teaspoon kosher salt",
        "1 teaspoon ground black pepper",
        "1 pound bulk mild Italian sausage",
        "2 tablespoons extra virgin olive oil",
        "1 teaspoon garlic granules",
        "1 teaspoon dried Italian herb blend",
        "1/2 pound pepperoni slices",
        "1 cup grated mozzarella cheese",
        "1/2 cup grated Parmesan cheese",
        "Fresh oregano sprigs (optional)",
        "Crushed red pepper (optional)"
    ],
    "nut": [
        "Calories > 516 kcal",
        "Carbs > 31.6 g",
        "Cholesterol > 66 mg",
        "Fat > 32 g",
        "Protein > 24.5 g",
        "Sodium > 1887 mg"
    ],
    "n": "Easy Pizza in a Pinch",
    "a": "Ball Park Buns",
    "r": "0",
    "s": 8,
    "des": "\"Get all the flavor of pizza Â– without the hassle of making or buying pizza dough. You can split the buns in half along the fold to make appetizer-size portions, or you can leave the buns whole for mini-pizzas. These come together quickly, a bonus when time is short.\"",
    "ins": "To make the sauce, combine tomato sauce, garlic, 3 teaspoons herbs, paprika, salt and pepper in a sauce pan over medium-high heat.\nWhen sauce bubbles, reduce to a low simmer and stir. Cover and allow to simmer over very low heat for 15 minutes.\nCrumble Italian sausage in a pan and cook over medium heat until no longer pink, about 15 minutes. Drain over paper towels. Set aside.\nPreheat oven to 400 degrees F.\nMix olive oil, garlic and 1 teaspoon herb blend in a small bowl.\nOpen hot dog buns and arrange on sheet pans covered in foil.\nSeparate buns in halves along the folds if you want to make 16 appetizers; leave whole if you want to make 8 pizzas.\nBrush the buns with the olive oil mixture.\nToast buns in the oven for about 5 minutes, just until edges begin to brown.\nRemove pan from oven and spread each of the buns with the warm tomato sauce.\nTop with browned Italian sausage, pepperoni slices, mozzarella and Parmesan cheeses.\nReturn pan to the oven and bake at 400 degrees F for 5 to 10 minutes or until cheeses are bubbling.\nServe garnished with fresh oregano leaves and crushed red pepper, if desired.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "4469237.jpg",
    "o": "4509158.jpg,4508763.jpg,4508656.jpg,4506639.jpg,4506637.jpg,4501750.jpg",
    "st": "allrecipes"
}