{
    "id": 256923,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup lukewarm water",
        "1/2 cup white sugar",
        "3 (.25 ounce) packages active dry yeast",
        "1 1/2 cups soy milk, at room temperature",
        "3/4 cup soy butter, at room temperature, divided",
        "1/2 cup avocado oil",
        "6 tablespoons water",
        "4 1/2 teaspoons dry egg replacer (such as Ener-GÂ®)",
        "1 teaspoon salt",
        "6 1/2 cups bread flour, divided",
        "cooking spray",
        "1 1/2 tablespoons honey"
    ],
    "nut": [
        "Calories > 249 kcal",
        "Carbs > 36.4 g",
        "Cholesterol > 0 mg",
        "Fat > 8.2 g",
        "Protein > 7 g",
        "Sodium > 142 mg"
    ],
    "n": "Dairy-Free Bread Rolls",
    "a": "Ariel Romell",
    "r": "0",
    "s": 24,
    "des": "\"Slightly sweet rolls that are easy for new bakers. Great if you have a dairy or egg allergy. These are a family favorite at the holidays. Don't let the directions scare you... I promise it is easy!\"",
    "ins": "Mix 1 cup lukewarm water, sugar, and yeast together in a large bowl. Let stand until yeast softens and forms a creamy foam, about 20 minutes.\nStir soy milk, 1/2 cup soy butter, avocado oil, 6 tablespoons water, egg replacer, and salt gently into the yeast mixture using a fork. Mix in 2 cups bread flour. Continue mixing by hand, adding flour 1/2 cup at a time, until dough comes together. Knead dough in the bowl for 2 minutes. Cover with plastic wrap and a warm towel; let rise for 1 hour 30 minutes.\nDivide dough into 24 pieces; knead and form into balls.\nGrease 2 muffin tins with cooking spray. Place 1 ball of dough in each muffin cup. Cover with plastic wrap and warm towels; let rise for 1 hour.\nPreheat oven to 425 degrees F (220 degrees C).\nMelt remaining 1/4 cup soy butter in a small saucepan over low heat, about 2 minutes. Remove from heat; whisk in honey.\nBake rolls in the preheated oven until puffed and pale, about 8 minutes. Remove from the oven; brush with half of the soy butter and honey mixture. Return to the oven and bake until golden brown, about 9 minutes more. Brush with remaining soy butter and honey mixture.",
    "pt": "25 m",
    "ct": "19 m",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}