{
    "id": 256944,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup white rice",
        "1 cup yellow lentils (moong dal)",
        "3 tablespoons ghee (clarified butter), divided",
        "salt to taste",
        "4 cups water, or as desired",
        "1 1/2 teaspoons coarsely ground black pepper",
        "1/4 teaspoon cumin seeds",
        "5 curry leaves",
        "1 (1 inch) piece fresh ginger root, minced (optional)",
        "1/4 cup cashews (optional)"
    ],
    "nut": [
        "Calories > 308 kcal",
        "Carbs > 40.9 g",
        "Cholesterol > 25 mg",
        "Fat > 13.9 g",
        "Protein > 5 g",
        "Sodium > 104 mg"
    ],
    "n": "Ven Pongal",
    "a": "Mojo jojo",
    "r": "0",
    "s": 4,
    "des": "\"Popular South Indian breakfast dish prepared mainly with rice and lentils. Ideal dish for any time of the day. Can be served with spicy chutney and vatral-kozhambu (spicy and sour sauce).\"",
    "ins": "Heat a large skillet over medium heat; add rice and lentils. Cook and stir until toasted and fragrant, 3 to 4 minutes. Rinse.\nPlace rice-lentil mixture, 1 tablespoon ghee, and salt in a rice cooker or pressure cooker; add water. Cook according to manufacturer's instructions until rice and lentils are tender and the consistency of a paste, 20 to 25 minutes. Stir and mash into a fine paste.\nHeat 1 tablespoon ghee in a skillet over medium-high heat. Add black pepper and cumin seeds; cook until seeds start to pop, 2 to 3 minutes. Stir cumin mixture into rice-lentil mixture.\nTear curry leaves roughly and stir into rice-lentil mixture; stir in ginger. Season with salt.\nHeat remaining 1 tablespoon ghee in a skillet over medium-high heat; cook and stir cashews until toasted and fragrant, 2 to 4 minutes. Garnish rice-lentil mixture with toasted cashews.",
    "pt": "10 m",
    "ct": "27 m",
    "tt": "37 m",
    "i": "4465821.jpg",
    "o": "",
    "st": "allrecipes"
}