{
    "id": 256981,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds pork shoulder",
        "1 pound hanger steak (onglet)",
        "7 ounces pork fat",
        "1/2 cup beer",
        "1 tablespoon salt",
        "4 cloves garlic, minced",
        "2 teaspoons red pepper flakes (optional)",
        "2 teaspoons ground white pepper",
        "1 teaspoon caraway seeds",
        "1 teaspoon dried marjoram",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon ground ginger",
        "1 hog casing"
    ],
    "nut": [
        "Calories > 395 kcal",
        "Carbs > 2.3 g",
        "Cholesterol > 69 mg",
        "Fat > 35 g",
        "Protein > 15.9 g",
        "Sodium > 912 mg"
    ],
    "n": "Bratwurst",
    "a": "Brandon",
    "r": "0",
    "s": 8,
    "des": "\"Learn how to make homemade bratwurst sausages with this step-by-step recipe. A German feast awaits!\"",
    "ins": "Place pork shoulder, hanger steak, and pork fat on a large plate in the freezer for 30 minutes. Place the meat grinder attachment in the freezer to make grinding easier.\nCut pork shoulder, hanger steak, and pork fat into cubes. Pass through the cold meat grinder fitted with a medium plate.\nCombine ground meat mixture with beer, salt, garlic, red pepper flakes, pepper, caraway seeds, marjoram, nutmeg, allspice, and ginger in a large bowl. Mix with your hands until the mixture starts to congeal, 2 to 3 minutes.\nCover mixture with plastic wrap and chill for 1 hour, or up to overnight.\nSoak hog casing in cold water for 30 minutes. Place the wide end of a sausage-stuffing funnel up against the kitchen faucet and run cold water through the inside of the casing.\nThread the casing onto the funnel using the medium sausage-stuffing funnel attachment. Pass the pork mixture through the funnel, stopping as it starts to come out the other end. Tie the casing into a knot at the end. Pass remaining meat mixture through the funnel, supporting the sausage with your other hand. Tie the other end of the casing into a knot.\nTwist the casing at regular intervals to create individual links, alternating between clockwise and counterclockwise twists.\nPoke 2 or 3 small holes in each sausage with a metal skewer to allow air to escape during cooking.\nHeat a skillet over medium heat; cook bratwurst, turning occasionally, until cooked all the way through, 10 to 15 minutes.",
    "pt": "1 h ",
    "ct": "10 m",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}