{
    "id": 257009,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "3 pounds ground beef",
        "1 (10 ounce) can diced tomatoes with green chile peppers",
        "3 eggs",
        "1 large white onion, chopped",
        "1/2 cup panko bread crumbs",
        "2 tablespoons seasoned salt (such as LAWRY'SÂ®)",
        "2 tablespoons ground black pepper",
        "2 hot banana peppers, diced",
        "2 teaspoons pink salt",
        "2 teaspoons onion salt",
        "2 teaspoons garlic salt",
        "2 teaspoons smoked paprika",
        "2 teaspoons liquid smoke flavoring",
        "Sauce:",
        "1/2 cup ketchup",
        "1/4 cup tomato-based chile sauce (such as HeinzÂ®)",
        "1/4 cup white sugar",
        "1 tablespoon ground black pepper",
        "2 teaspoons hot pepper sauce (such as Frank's RedHotÂ®)",
        "2 teaspoons Worcestershire sauce",
        "1 teaspoon salt",
        "1 teaspoon ground red chile pepper",
        "1 teaspoon red pepper flakes"
    ],
    "nut": [
        "Calories > 441 kcal",
        "Carbs > 16.1 g",
        "Cholesterol > 143 mg",
        "Fat > 32.6 g",
        "Protein > 22 g",
        "Sodium > 2074 mg"
    ],
    "n": "Spicy Smoked Meatloaf",
    "a": "LJNew",
    "r": "0",
    "s": 12,
    "des": "\"This is like a little taste of pure masterfulness. I am a fanatic of meatloaf and wandered around aimlessly for 20-odd years looking for an answer... This is it!\"",
    "ins": "Preheat smoker to 225 degrees F (110 degrees C) according to manufacturer's instructions. Grease a loaf pan with cooking spray.\nCombine ground beef, diced tomatoes, eggs, onion, panko bread crumbs, seasoned salt, 2 teaspoons pepper, hot banana peppers, pink salt, onion salt, garlic salt, paprika, and liquid smoke flavoring in a large bowl. Mix well with your hands. Pack it into the prepared loaf pan, doming the top.\nSmoke meatloaf for 2 hours, adding wood chips to the drip tray according to manufacturer's instructions.\nWhisk ketchup, chile sauce, sugar, 1 tablespoon pepper, hot sauce, Worcestershire sauce, salt, red chile pepper, and red pepper flakes together to make sauce.\nDrain excess grease from meatloaf; spread sauce on top. Return to smoker for 30 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).",
    "pt": "25 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "4471535.jpg",
    "o": "",
    "st": "allrecipes"
}