{
    "id": 257089,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package angel hair pasta",
        "2 tablespoons butter",
        "6 green onions, thinly sliced",
        "3 tablespoons chopped fresh garlic",
        "1 1/2 pounds frozen cooked shrimp, tails removed",
        "1 cup white wine",
        "1 1/2 tablespoons cornstarch",
        "1/2 cup heavy whipping cream",
        "2 teaspoons lime juice",
        "2 teaspoons Creole seasoning",
        "2 teaspoons white sugar",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 (9 ounce) package fresh baby spinach with carrots",
        "1/4 cup chopped fresh basil"
    ],
    "nut": [
        "Calories > 750 kcal",
        "Carbs > 76.4 g",
        "Cholesterol > 388 mg",
        "Fat > 22 g",
        "Protein > 51.2 g",
        "Sodium > 1540 mg"
    ],
    "n": "Creamy Creole Shrimp and Spinach Pasta",
    "a": "Laurie Fontaine Bennett",
    "r": "0",
    "s": 4,
    "des": "\"A favorite restaurant in Hawaii serves a fantastic spicy, creamy, garlicky, shrimp, and spinach pasta. I played around with ingredients and finally arrived at this recipe. Easy preparation, easy to make, and just delicious. My family loves it! Great for a company dish as well.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook angel hair pasta in the boiling water, stirring occasionally, until tender yet firm to the bite, 4 to 5 minutes. Drain.\nMelt butter in a large skillet over medium heat. Cook and stir green onions and garlic in the butter until softened, about 2 minutes. Add frozen shrimp; cook and stir until thawed, about 5 minutes. Transfer shrimp to a bowl.\nWhisk wine and cornstarch together in a small bowl until smooth. Pour over the green onions and garlic in the skillet. Stir in heavy cream, lime juice, Creole seasoning, sugar, salt, and pepper; simmer until mixture thickens, about 3 minutes.\nReturn shrimp to the skillet. Stir in spinach and basil. Cook and stir until shrimp is heated through and spinach is wilted, about 5 minutes. Serve over angel hair pasta.",
    "pt": "25 m",
    "ct": "24 m",
    "tt": "49 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}