{
    "id": 257086,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil",
        "3 pounds chicken legs and thighs on the bone, cut into large chunks",
        "4 heads garlic, cloves separated and peeled",
        "1/2 cup chopped fresh parsley",
        "1 tablespoon dried tarragon",
        "1/2 teaspoon ground cinnamon",
        "2 bay leaves",
        "salt and ground black pepper to taste",
        "1 cup dry white wine",
        "1 (16 ounce) package egg noodles",
        "2 tablespoons melted butter",
        "1 ounce dry bread crumbs"
    ],
    "nut": [
        "Calories > 1243 kcal",
        "Carbs > 106.4 g",
        "Cholesterol > 301 mg",
        "Fat > 51.1 g",
        "Protein > 76.1 g",
        "Sodium > 339 mg"
    ],
    "n": "Stewed Chicken and Garlic with Noodles",
    "a": "Sonya Jane",
    "r": "0",
    "s": 4,
    "des": "\"Cooked garlic becomes wonderfully nutty in flavor. Hence what seems to be a huge quantity in this recipe. Just a wonderful dish, this, when the stew is mixed with the noodles and baked!\"",
    "ins": "Heat olive oil in a heavy skillet over medium-high heat. Place chicken pieces in the hot oil. Add garlic cloves, parsley, tarragon, cinnamon, bay leaves, salt, and pepper. Pour in wine and bring to a simmer. Reduce heat to medium-low. Cover and simmer, stirring occasionally, until chicken is tender, about 1 hour.\nPreheat oven to 375 degrees F (190 degrees C). Butter a large baking dish or casserole.\nFill a large pot with lightly salted water and bring to a rolling boil. Stir in the egg noodles and bring back to a boil. Cook until tender but slightly firm, about 5 minutes. Drain well.\nStir noodles into chicken in the skillet. Transfer chicken and noodles to prepared baking dish. Mix melted butter and breadcrumbs together and sprinkle on top.\nBake in preheated oven until chicken and noodles are tender, about 30 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}