{
    "id": 257068,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (9 inch) deep-dish prepared pie crusts",
        "4 cups fresh elderberries, stemmed",
        "1 cup water",
        "1 cup white sugar",
        "3 tablespoons water",
        "3 tablespoons cornstarch",
        "1 tablespoon orange juice"
    ],
    "nut": [
        "Calories > 389 kcal",
        "Carbs > 61.8 g",
        "Cholesterol > 0 mg",
        "Fat > 15.3 g",
        "Protein > 3.3 g",
        "Sodium > 239 mg"
    ],
    "n": "Elderberry Pie",
    "a": "April Broxton",
    "r": "0",
    "s": 8,
    "des": "\"This is one of my man's favorite pies. His father brought this jar of elderberries from an elder lady whose lawn he mowed. I thought back to when I was younger and grew up in the deep South. I remembered my mom and grandmother making pies of all sorts in the summer and fall seasons. Elderberry pies were one of grannie's favorite pies as well. So here is the simple recipe...\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nUnroll 1 crust and press firmly against the side and bottom of an ungreased 9-inch pie plate. Prick bottom and sides with a fork.\nBake in the preheated oven until light brown, 10 to 12 minutes. Let cool.\nCombine elderberries, 1 cup water, and sugar in a saucepan over medium heat. Whisk 3 tablespoons water and cornstarch together in a bowl; pour into the saucepan. Cook and stir until filling thickens and coats the back of a wooden spoon, 5 to 10 minutes. Remove from heat; stir in orange juice.\nPour filling into the cooled pie crust. Lay second crust on top. Press edges together to seal with a fork. Cut slits in the top crust with a knife for steam to escape.\nBake in the preheated oven until crust is browned and filling is bubbly, about 40 minutes. Cool completely before slicing, about 1 hour.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}