{
    "id": 257071,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups cubed French bread, crusts removed",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground sage",
        "1/4 teaspoon sumac powder",
        "1/4 teaspoon ground white pepper",
        "1/4 teaspoon ground cloves",
        "1 acorn squash, halved and seeded",
        "1/2 teaspoon olive oil",
        "3/4 cup vegetable stock",
        "4 ounces ground sausage",
        "2 tablespoons dried cranberries",
        "2 tablespoons pecans, broken into small pieces",
        "1 teaspoon diced fresh thyme"
    ],
    "nut": [
        "Calories > 410 kcal",
        "Carbs > 49.8 g",
        "Cholesterol > 32 mg",
        "Fat > 19.5 g",
        "Protein > 13.6 g",
        "Sodium > 780 mg"
    ],
    "n": "Sausage-Stuffed Acorn Squash",
    "a": "Shyla Lane",
    "r": "0",
    "s": 2,
    "des": "\"The combination of the sausage with the different spices and the sweetness from the cranberries really turn your average garden acorn squash into a dish that makes you feel like the professional home cook that you are. Perfect for serving at dinner parties or for a nice quiet meal at home.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spread bread cubes on a baking sheet.\nToast bread in the preheated oven, stirring occasionally, 10 to 15 minutes.\nMix cinnamon, sage, sumac, white pepper, and cloves together in a small bowl.\nBrush acorn squash halves with olive oil. Sprinkle 3/4 teaspoon of the cinnamon mixture evenly over both halves. Transfer to a baking sheet.\nBake acorn squash in the preheated oven until tender, about 30 minutes. Scrape flesh with a fork to loosen slightly.\nCombine toasted bread and vegetable stock in a pot over medium-low heat. Stir bread around to soak up the vegetable stock and warm up, about 3 minutes. Transfer to a large bowl.\nCook and stir sausage in a large skillet over medium heat until browned, about 5 minutes. Stir into the bread in the bowl. Add remaining cinnamon mixture, cranberries, pecans, and thyme; stir until evenly mixed.\nDivide bread mixture between the acorn squash halves.\nBake in the preheated oven until golden brown, about 15 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}