{
    "id": 257195,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup cassava flour (such as AmafilÂ®)",
        "1 cup potato starch",
        "1 pinch stevia powder",
        "6 tablespoons coconut milk",
        "5 tablespoons coconut oil",
        "4 egg yolks",
        "2 tablespoons brandy-based orange liqueur (such as Grand MarnierÂ®)",
        "1 tablespoon honey",
        "2 tablespoons peach jam",
        "1 tablespoon colored sprinkles"
    ],
    "nut": [
        "Calories > 195 kcal",
        "Carbs > 27.1 g",
        "Cholesterol > 68 mg",
        "Fat > 9 g",
        "Protein > 1.3 g",
        "Sodium > 6 mg"
    ],
    "n": "Gluten-Free Easter Egg Cookies",
    "a": "Little Bites of Beauty",
    "r": "0",
    "s": 12,
    "des": "\"As you can imagine, Easter treats are huge in Italy! And because I wanted to stick to this delicious Italian tradition, I created a recipe for Gluten-Free Easter Egg Cookies together with a quick video that shows you how to make them. \n\nYou should really be in Italy at this time of the year: Chocolate Easter eggs are ubiquitous, chocolate shaped rabbits and hens are in every store, and all of the bakeries and pastry shops fill their windows with amazing sweet and savory treats, from Colomba to Torta Pasqualina. There's really something for everybody.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nCombine cassava flour, potato starch, and stevia powder in a bowl; add coconut milk, coconut oil, egg yolks, orange liqueur, and honey and knead until dough is well mixed.\nRoll dough on a work surface using a rolling pin until 1/4-inch thick. Cut egg-shaped cookies using an egg-shaped cookie cutter. Place egg-shaped cookies on a baking sheet. Spread jam over each cookie and top with sprinkles.\nBake in the preheated oven until edges start to become lightly browned, about 25 minutes. Cool completely.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}