{
    "id": 257181,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Marinade:",
        "1/3 cup strawberry preserves",
        "1/4 cup soy sauce",
        "1/4 cup apple cider vinegar",
        "2 tablespoons toasted sesame oil",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon ground black pepper",
        "1 pound skin-on salmon fillets",
        "Strawberry-Pineapple Salsa:",
        "1 cup chopped fresh strawberries",
        "1 cup chopped fresh pineapple",
        "1/3 cup chopped sweet onion (such as Vidalia)",
        "1/4 cup chopped fresh parsley, or to taste",
        "1 tablespoon vegetable oil"
    ],
    "nut": [
        "Calories > 401 kcal",
        "Carbs > 31.1 g",
        "Cholesterol > 56 mg",
        "Fat > 21.4 g",
        "Protein > 21.5 g",
        "Sodium > 961 mg"
    ],
    "n": "Grilled Hawaiian Salmon with Strawberry Pineapple Salsa",
    "a": "KelleyBee",
    "r": "0",
    "s": 4,
    "des": "\"My inspiration for this splendid recipe came from a dish on the menu at LonghornÂ® Steakhouse. I've guessed how it's made and decided to add strawberries to the salsa, but I am sure it will be fine with just pineapples. Strawberry preserves serve as the marinade base, mixed with soy, vinegar, and sesame oil.\"",
    "ins": "Mix strawberry preserves, soy sauce, apple cider vinegar, sesame oil, garlic powder, onion powder, ginger, and pepper together in a bowl to make marinade. Pour 1/3 cup into a glass measuring cup; reserve. Place salmon fillets in the bowl.\nMarinate salmon in the refrigerator for 1 hour.\nMix strawberries, pineapple, onion, and parsley in a bowl to make salsa. Cover with plastic wrap and refrigerate.\nPreheat grill for medium heat and lightly oil the grate. Oil a stainless steel grill basket. Place salmon fillets skin-side up in the basket; cook for 6 minutes. Flip and continue cooking skin-side down, about 6 minutes more.\nDivide salmon fillets among serving plates; drizzle reserved 1/3 cup marinade on top. Spoon salsa on top.",
    "pt": "30 m",
    "ct": "12 m",
    "tt": "1 h ",
    "i": "4478627.jpg",
    "o": "",
    "st": "allrecipes"
}