{
    "id": 257172,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 veal shanks, sliced for ossobuco",
        "1 dash all-purpose flour",
        "1 tablespoon butter, or to taste",
        "1 tablespoon olive oil, or to taste",
        "1 tablespoon chopped onion",
        "1 tablespoon chopped carrot",
        "1/2 cup white wine",
        "1 tablespoon tomato puree",
        "salt and ground black pepper to taste",
        "1 cup beef stock",
        "1/4 cup chopped fresh parsley",
        "1/2 lemon, zested"
    ],
    "nut": [
        "Calories > 476 kcal",
        "Carbs > 2.7 g",
        "Cholesterol > 254 mg",
        "Fat > 18.9 g",
        "Protein > 63.9 g",
        "Sodium > 287 mg"
    ],
    "n": "Ossobuco alla Milanese",
    "a": "clara",
    "r": "0",
    "s": 4,
    "des": "\"Ossobuco is one of the signature dishes of Milanese cuisine. Veal shanks are cut crosswise to reveal the marrow, a cut often just referred to as 'ossobucco'. The dish is finished with a gremolata, which is a mix of chopped parsley and lemon zest. In Milan, ossobucco is typically served with a saffron risotto.\"",
    "ins": "Slit the skin around the veal shanks in 2 or 3 places so that slices do not curl when cooked. Dust veal shanks with flour.\nHeat butter and olive oil in a large skillet over medium heat. Add onion and carrot; cook and stir until softened, about 5 minutes. Add veal shanks; cook until browned, 3 to 5 minutes per side. Pour in white wine and simmer until reduced, about 5 minutes.\nStir tomato puree, salt, and pepper into the skillet. Pour in beef stock gradually, stirring between each addition. Reduce heat to medium-low, cover, and cook, turning veal shanks occasionally, until tender, about 55 minutes.\nMix parsley and lemon zest together in a small bowl. Stir into the skillet. Cook until flavors combine, about 5 minutes.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4503852.jpg",
    "o": "",
    "st": "allrecipes"
}