{
    "id": 257102,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup extra-virgin olive oil, divided",
        "1 teaspoon Hawaiian sea salt, or to taste",
        "2 (16 ounce) boxes fettuccine",
        "1/4 cup butter",
        "1 pinch ground black pepper",
        "1 pound ground beef",
        "1 (12 ounce) can cooked luncheon meat (such as SPAMÂ®), cut into tiny pieces",
        "2 tablespoons Worcestershire sauce",
        "1 tablespoon crushed garlic",
        "1/4 teaspoon liquid smoke flavoring",
        "2 (8 ounce) packages bean sprouts",
        "1 (10 ounce) can sliced mushrooms, drained (optional)",
        "1 bunch scallions, cut into 1/4-inch pieces",
        "2 carrots, grated",
        "1 bunch cilantro, chopped, divided"
    ],
    "nut": [
        "Calories > 654 kcal",
        "Carbs > 74.7 g",
        "Cholesterol > 64 mg",
        "Fat > 29 g",
        "Protein > 26.7 g",
        "Sodium > 943 mg"
    ],
    "n": "Chow Fun",
    "a": "Skip Elkins",
    "r": "0",
    "s": 10,
    "des": "\"My son learned the basics in Home Ec at school and we tinkered with it until we matched the recipe made by the tutu down the block. Always good for a neighborhood luau, or a take-along to a potluck party. Serve with soy sauce and garlic bread.\"",
    "ins": "Fill a large pot with water, 2 tablespoons olive oil, and sea salt; bring to a rolling boil. Stir in fettuccine and cook over medium heat until tender yet firm to the bite, about 8 minutes. Drain and transfer to a large bowl. Toss with butter and black pepper.\nHeat remaining 2 tablespoons olive oil in a large skillet over medium heat. Add ground beef, luncheon meat, Worcestershire sauce, garlic, and liquid smoke; cook and stir until beef is browned, 8 to 10 minutes. Transfer beef mixture to a plate lined with paper towels using a slotted spoon.\nStir bean sprouts, mushrooms, scallions, carrots, and half of the cilantro into the grease in the skillet. Cook and stir until bean sprouts are wilted, 3 to 4 minutes. Return beef mixture to the skillet; stir until reheated, about 2 minutes.\nMix beef and bean sprout mixture into the fettucine in the bowl. Garnish with remaining cilantro.",
    "pt": "30 m",
    "ct": "26 m",
    "tt": "56 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}