{
    "id": 257192,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "3 cups chocolate wafer crumbs",
        "10 tablespoons butter, melted",
        "Filling:",
        "1 pound semisweet chocolate, chopped",
        "2 eggs",
        "4 eggs, separated",
        "2 cups heavy whipping cream",
        "6 tablespoons confectioners' sugar",
        "Topping:",
        "2 cups heavy whipping cream",
        "1/4 cup confectioners' sugar, or to taste",
        "2 tablespoons orange liqueur (such as Grand MarnierÂ®) (optional)"
    ],
    "nut": [
        "Calories > 736 kcal",
        "Carbs > 51.6 g",
        "Cholesterol > 228 mg",
        "Fat > 57.4 g",
        "Protein > 9.4 g",
        "Sodium > 296 mg"
    ],
    "n": "Elegant Chocolate Mousse Cake",
    "a": "MBMITCH",
    "r": "0",
    "s": 12,
    "des": "\"An elegant presentation for all chocolate lovers. You can adapt for special occasions by adding chocolate hearts for Valentine's Day or Christmas trees for Christmas, etc.\"",
    "ins": "Mix chocolate wafer crumbs and butter together in a bowl. Press over the bottom and up the sides of a 10-inch springform pan. Freeze until firm, 20 to 30 minutes.\nMelt chocolate in top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula, about 5 minutes. Remove from heat.\nWhisk 2 eggs and 4 egg yolks in a bowl. Gradually pour in melted chocolate, whisking constantly, until well blended.\nBeat egg whites in a glass, metal, or ceramic bowl until stiff peaks form.\nBeat cream in a chilled glass or metal bowl with an electric mixer until foamy. Add 6 tablespoons confectioners' sugar; continue to beat until soft peaks form.\nFold one-third of the egg whites and one-third of the whipped cream into the chocolate mixture until lightened. Fold in remaining egg whites and whipped cream until thoroughly incorporated. Pour into the crust.\nChill cake until mousse is set, 6 hours to overnight.\nCombine 2 cups heavy cream, 1/4 confectioners' sugar, and orange liqueur in a large bowl; beat until stiff peaks form. Spoon into a pastry bag fitted with a star tip. Pipe whipped cream rosettes to garnish each slice.",
    "pt": "30 m",
    "ct": "5 m",
    "tt": "6 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}