{
    "id": 257294,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 head cauliflower",
        "1/4 cup grated Parmesan cheese",
        "2 tablespoons fat-free half-and-half, or as needed",
        "2 1/2 cups low-sodium vegetable broth, divided",
        "2 large carrots, peeled and chopped",
        "2 stalks celery, chopped",
        "1/2 onion, chopped",
        "1/2 small red bell pepper, chopped",
        "8 ounces sliced fresh mushrooms, chopped if very large",
        "1/2 cup frozen peas",
        "1 teaspoon chopped garlic",
        "1 teaspoon ground thyme",
        "salt and ground black pepper to taste",
        "2 tablespoons tomato paste",
        "2 tablespoons all-purpose flour",
        "cooking spray",
        "2 tablespoons grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 143 kcal",
        "Carbs > 23.1 g",
        "Cholesterol > 7 mg",
        "Fat > 2.9 g",
        "Protein > 8.8 g",
        "Sodium > 442 mg"
    ],
    "n": "Vegetarian Shepherd's Pie with Mashed Cauliflower",
    "a": "Sandy G",
    "r": "0",
    "s": 4,
    "des": "\"A meatless version of shepherd's pie made with mashed cauliflower instead of potato.\"",
    "ins": "Place the cauliflower into a large pot and cover with water. Bring to a boil; reduce heat and simmer until fork-tender, 8 to 12 minutes. Drain and allow to steam dry for 1 to 2 minutes.\nCoarsely chop cauliflower and place in a food processor. Pulse until cauliflower is mashed, 7 or 8 pulses. Add 1/4 cup grated Parmesan cheese; pulse 2 or 3 times until blended. Pour in 2 tablespoons half-and-half and pulse 2 or 3 times until cauliflower mixture is the consistency of mashed potatoes. Add 1 tablespoon half-and-half if mixture is too thick.\nPour 1/2 cup vegetable broth into a skillet; bring to a simmer over medium-high heat. Add carrots, celery, onion, and red bell pepper. Reduce heat to medium; cover. Cook until vegetables begin to soften, 3 to 5 minutes. Add mushrooms; cover and cook for 1 minute.\nStir peas, garlic, thyme, salt, and pepper into the skillet. Add more broth if needed. Stir in tomato paste and flour until well combined. Pour in the remaining vegetable broth. Raise heat to medium-high. Cook and stir until liquid has thickened and coats the back of a spoon, about 5 minutes. Remove from heat.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler. Spray a glass pie plate or baking dish with nonstick cooking spray.\nTransfer carrot mixture to the prepared baking dish. Gently spread the mashed cauliflower mixture over the top. Sprinkle with 2 tablespoons grated Parmesan cheese.\nBroil until cauliflower is light brown, 3 to 4 minutes.",
    "pt": "35 m",
    "ct": "29 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}