{
    "id": 257214,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 large beets",
        "1 head garlic, halved crosswise",
        "1 tablespoon extra-virgin olive oil",
        "1 pinch salt and ground black pepper to taste",
        "1 (15 ounce) can chickpeas, drained and rinsed",
        "1/4 cup extra-virgin olive oil",
        "1 1/2 lemons, juiced",
        "2 tablespoons tahini",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1/4 teaspoon cayenne pepper",
        "1/4 cup plain Greek yogurt (optional)"
    ],
    "nut": [
        "Calories > 251 kcal",
        "Carbs > 23.2 g",
        "Cholesterol > 2 mg",
        "Fat > 15.9 g",
        "Protein > 5.6 g",
        "Sodium > 437 mg"
    ],
    "n": "Roasted Beetroot and Garlic Hummus",
    "a": "Elizabeth",
    "r": "0",
    "s": 6,
    "des": "\"This roasted beetroot and garlic hummus checks all the boxes: healthy, easy, delicious, and so pretty! It's the perfect snack throughout the week or a beautiful appetizer for guests. Garnish with a dollop of Greek yogurt and fresh herbs, and serve alongside veggies or pita. Enjoy!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nPoke beets all over with a fork; transfer to a microwave-safe bowl. Cover bowl with plastic wrap, leaving some room for air to escape. Cook beets in the microwave for 4 minutes. Wrap each beet with aluminum foil and place on a baking sheet.\nSeason garlic halves with 1 tablespoon olive oil, salt, and pepper. Wrap each half with aluminum foil and place on the baking sheet.\nBake in the preheated oven until beets are tender when pierced with a fork, about 35 minutes.\nCool beets until running water for 1 minute. Peel off skins and transfer to a food processor.\nSqueeze garlic cloves into the food processor. Drizzle in any olive oil remaining on the aluminum foil. Add chickpeas, 1/4 cup olive oil, lemon juice, tahini, cumin, salt, pepper, and cayenne. Pulse until combined. Add Greek yogurt; process until smooth.",
    "pt": "15 m",
    "ct": "39 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}