{
    "id": 257203,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon unsalted butter, divided",
        "6 (1 inch thick) slices stale French bread",
        "1 cup whole milk",
        "3 eggs, divided",
        "1 pinch ground nutmeg",
        "salt and ground black pepper to taste",
        "1/2 cup grated Parmesan cheese",
        "1 stalk asparagus, chopped",
        "1 tablespoon olive oil"
    ],
    "nut": [
        "Calories > 708 kcal",
        "Carbs > 91.5 g",
        "Cholesterol > 45 mg",
        "Fat > 25.1 g",
        "Protein > 29.5 g",
        "Sodium > 1408 mg"
    ],
    "n": "Eggs and Savory French Toast with Cheese and Asparagus",
    "a": "LBELDEN",
    "r": "0",
    "s": 2,
    "des": "\"Use up that old bread and have breakfast for dinner with this great savory dish. I made this dish when my boyfriend had his teeth pulled and could only eat egg-based, soft dishes. This was delicious but also easy on the teeth!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease a 1-quart baking dish with 1 teaspoon butter.\nArrange bread slices in a single layer in the baking dish.\nWhisk milk, 1 egg, nutmeg, salt, and pepper together in a bowl. Pour over bread slices. Sprinkle Parmesan cheese on top. Let stand until milk mixture is absorbed, 15 to 30 minutes. Dot remaining 2 teaspoons butter over Parmesan cheese.\nToss asparagus with olive oil in a bowl. Spread on a baking sheet. Season with salt and pepper.\nBake bread slices in the preheated oven until puffed up, about 10 minutes. Place asparagus in the oven. Continue baking bread slices until golden brown, about 10 minutes more.\nFill a large saucepan with 2 to 3 inches of water and bring to a boil. Reduce the heat to medium-low to bring water to a gentle simmer.\nCrack 1 egg into a small bowl then gently slip egg into the simmering water, holding the bowl just above the surface of water. Repeat with the remaining egg. Cook eggs until the whites are firm and the yolks have thickened but still runny, 2 1/2 to 3 minutes. Remove the eggs from the water with a slotted spoon.\nDivide bread between 2 plates. Top each portion with a poached egg. Season with salt and pepper. Serve asparagus on the side.",
    "pt": "15 m",
    "ct": "28 m",
    "tt": "58 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}