{
    "id": 257238,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 cups all-purpose flour",
        "2 tablespoons baking powder",
        "3/4 teaspoon salt",
        "3 cups white sugar",
        "1 cup butter, softened",
        "2 tablespoons vanilla extract",
        "2 cups cold water",
        "6 eggs",
        "Filling:",
        "1 cup raspberry preserves",
        "Frosting:",
        "1 cup butter, softened",
        "8 cups confectioners' sugar",
        "3/4 cup milk",
        "2 teaspoons vanilla extract",
        "1 pinch salt",
        "2/3 cup cocoa powder",
        "Topping:",
        "1 tablespoon water",
        "4 drops green food coloring",
        "3 cups shredded coconut",
        "1 cup candy-coated chocolate eggs, or to taste"
    ],
    "nut": [
        "Calories > 679 kcal",
        "Carbs > 105.7 g",
        "Cholesterol > 90 mg",
        "Fat > 27.6 g",
        "Protein > 6.4 g",
        "Sodium > 344 mg"
    ],
    "n": "Easter Basket Cake",
    "a": "HappyMumma",
    "r": "0",
    "s": 24,
    "des": "\"Fun Easter basket cake children will love!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour two 9-inch round cake pans and one 8-inch square pan.\nMix flour, baking powder, and salt together in a large bowl.\nCombine white sugar, 1 cup butter, and 2 tablespoons vanilla extract in a large bowl; beat with an electric mixer until soft and fluffy. Beat in flour mixture alternately with cold water until batter is combined. Beat in eggs 1 at a time.\nPour batter into the prepared cake pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 25 minutes. Cool in the pans for 5 minutes. Invert onto wire racks and let cool completely, about 20 minutes.\nTrim one of the round cakes by 1 inch using a serrated knife. Cut a 5-inch circle, about 1/2-inch deep, out of the second round cake. Cut the square cake so it measures 8 inches on the diagonal.\nPlace square cake layer on a large cake plate. Spread half of the raspberry preserves on top. Cover with the 8-inch round cake. Spread remaining raspberry preserves on top. Add the 9-inch round cake layer, positioning it so the hole is in the center.\nWhisk 1 cup butter in a bowl until creamy. Whisk in confectioners' sugar gradually, alternating with milk, until frosting is smooth. Stir in 2 teaspoons vanilla and 1 pinch salt. Whisk in cocoa powder until frosting is evenly mixed.\nSpread frosting around the sides of the cake. Spread frosting over the top cake layer but leave the hole unfrosted. Make horizontal marks over the frosting with an icing knife to create a basket look.\nMix 1 tablespoon water and green food coloring together in a bowl. Add coconut; toss until evenly coated with green food coloring. Pour into the hole on top of the cake. Cover coconut with chocolate eggs.\nCut out a strip of cardboard that measures 1x18 inches. Grip it with both hands at one end; run your thumbs down the strip in opposite directions to create a smooth, rounded shape. Wrap handle well with aluminum foil.\nInsert handle into the cake. Cover aluminum foil with a thin layer of frosting. Make horizontal marks over the frosting with an icing knife to create a basket look.",
    "pt": "45 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}