{
    "id": 257243,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 cup white sugar",
        "1/2 cup butter, softened",
        "6 ripe bananas, mashed",
        "2 eggs, beaten",
        "1 1/2 cups cake flour",
        "3 tablespoons cake flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 teaspoon vanilla extract",
        "1/2 cup European cookie spread (such as BiscoffÂ®)"
    ],
    "nut": [
        "Calories > 327 kcal",
        "Carbs > 50.9 g",
        "Cholesterol > 51 mg",
        "Fat > 12.7 g",
        "Protein > 3.4 g",
        "Sodium > 269 mg"
    ],
    "n": "The Best Moist Lotus Cookie Butter Banana Bread Recipe Ever",
    "a": "Carla Maria",
    "r": "0",
    "s": 12,
    "des": "\"Hey its Carla Bruno from CarlasCakes! Here is another great recipe I had to share with you. I am obsessed with banana bread and so it my husband, and I am also obsessed with Lotus Cookie Butter! If you don't know what that is yet, I strongly suggest you become familiar because I am telling you, it is the best thing ever! There are lots of different types of cookie butters. However, I love Lotus because it has a caramel taste to it.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a loaf pan with cooking spray.\nCombine sugar and butter in a large bowl; beat with an electric mixer until creamy. Beat in bananas and eggs.\nMix 1 1/2 cup plus 3 tablespoons cake flour, baking soda, and salt together in a bowl. Mix into the banana mixture. Stir in vanilla extract. Pour half of the batter into the prepared pan.\nHeat cookie spread in the microwave until softened, about 20 seconds. Spread over the batter in the pan. Cover with remaining banana batter; swirl decoratively with a knife.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 50 to 60 minutes. Cool in the pan for 5 minutes. Invert onto a wire rack. Cool for 10 to 15 minutes before serving.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "4502421.jpg",
    "o": "",
    "st": "allrecipes"
}