{
    "id": 257268,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "4 cups water",
        "1/4 cup baking soda",
        "1 (11 ounce) package refrigerated French bread dough (such as PillsburyÂ®)",
        "1 egg yolk",
        "1 tablespoon water",
        "1 tablespoon coarse sea salt",
        "2 tablespoons butter, melted"
    ],
    "nut": [
        "Calories > 85 kcal",
        "Carbs > 11.4 g",
        "Cholesterol > 22 mg",
        "Fat > 3.1 g",
        "Protein > 2.3 g",
        "Sodium > 1864 mg"
    ],
    "n": "Bunny Pretzels",
    "a": "SHORECOOK",
    "r": "0",
    "s": 12,
    "des": "\"A quick and easy way to make homemade pretzels. They can be brushed with butter or dipped in cinnamon sugar, just like they do at the mall. This is a treat I like to make for our Easter egg hunt.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet with cooking spray.\nMix 4 cups water and baking soda together in a large saucepan; bring to a boil. Pour into a shallow dish.\nFlatten bread dough on a floured work surface; cut into 3 pieces, each about 6 inches long. Slice each piece into 4 long strips. Break a 1-inch piece off each strip; roll into a ball for the tail. Roll the remainder of each strip into a log about 9 inches long.\nWrap 1 log around the tail to make the body; twist twice to make the head and ears. Repeat with remaining 11 strips.\nSubmerge \"bunnies,\" 2 at a time, into the water-baking soda mixture for 30 seconds. Transfer to the prepared baking sheet. Adjust ears if they became untwisted.\nWhisk egg yolk and 1 tablespoon water together in a small bowl. Brush over bunnies. Sprinkle salt on top.\nBake in the preheated oven until warmed through, about 5 minutes. Move around with a spatula to ensure they don't stick. Continue baking until golden brown, about 10 minutes. Transfer to cooling racks. Brush with melted butter while still warm.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "4478032.jpg",
    "o": "",
    "st": "allrecipes"
}