{
    "id": 257256,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound whole grain bow-tie pasta",
        "1/2 cup extra-virgin olive oil",
        "2 cups peeled, seeded, and cubed winter squash",
        "1 sweet onion, diced",
        "1 red bell pepper, diced",
        "1 (15 ounce) can diced tomatoes",
        "1 cup fresh green beans, cut into 1-inch pieces",
        "1/2 cup pitted kalamata olives",
        "2 tablespoons minced garlic",
        "3 cups torn fresh spinach",
        "1/2 cup red wine vinegar",
        "3 tablespoons white sugar",
        "1 tablespoon minced fresh basil",
        "1/2 teaspoon sea salt, or to taste",
        "1/2 teaspoon cracked black pepper, or to taste",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 850 kcal",
        "Carbs > 111.9 g",
        "Cholesterol > 9 mg",
        "Fat > 37.2 g",
        "Protein > 23.8 g",
        "Sodium > 847 mg"
    ],
    "n": "Pasta Inverno (Winter Vegetable Pasta)",
    "a": "Karen Barris Calabro",
    "r": "0",
    "s": 4,
    "des": "\"A delicious and economical twist on a pasta primavera, this winter dish has been a favorite of vegetarian clients for years. It was born from a Sicilian side dish for Pumpkin Agrodolce (literally sour and sweet), taught to me by one of my first master chefs, but this is a meal that stands alone.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook bow-tie pasta at a boil, stirring occasionally, until tender yet firm to the bite, 8 to 9 minutes. Drain.\nHeat olive oil in a deep skillet over high heat. Add winter squash, onion, and red bell pepper; cook, stirring with a wooden spoon and scraping the bottom of the skillet, until browned, 8 to 10 minutes. Stir in tomatoes, green beans, olives, and garlic. Reduce heat to medium-low and simmer until green beans are tender, about 10 minutes.\nStir spinach, red wine vinegar, sugar, basil, salt, and black pepper into the skillet. Cook and stir until spinach starts to wilt, about 1 minute. Add drained pasta; cook and stir until tender and coated with sauce, about 3 minutes. Sprinkle Parmesan cheese on top and toss well.",
    "pt": "30 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}