{
    "id": 257230,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 sweet potato, cubed",
        "3 tablespoons canola oil, divided",
        "1 large onion, chopped, divided",
        "4 large skinless, boneless chicken breasts, cut into 1-inch pieces",
        "4 cloves garlic, minced",
        "2 cups goat's milk",
        "2 large apples, cubed",
        "1 cup goat's milk yogurt",
        "1 tablespoon grated fresh ginger",
        "1 tablespoon curry powder",
        "1 teaspoon ground cumin",
        "1/2 teaspoon ground turmeric",
        "salt and ground black pepper to taste",
        "1/4 cup chicken stock (optional)"
    ],
    "nut": [
        "Calories > 589 kcal",
        "Carbs > 43.3 g",
        "Cholesterol > 138 mg",
        "Fat > 22.8 g",
        "Protein > 52.9 g",
        "Sodium > 311 mg"
    ],
    "n": "Chicken Curry with Goat's Milk",
    "a": "Michael Bach",
    "r": "0",
    "s": 4,
    "des": "\"I have dairy allergies but I love curry. I created this recipe based on another curry recipe and it turned out amazing. Tasty and delicious curry. Not too spicy, but spicy enough to taste like a true curry. An easy dish that you can cook in only about half an hour. And best of all - no cow's milk! Serve with quinoa or rice.\"",
    "ins": "Place sweet potato cubes on a large microwave-safe plate. Cook in the microwave until softened, about 10 minutes.\nHeat 2 tablespoons oil in a large saucepan over medium-high heat. Add half of the chopped onion; cook and stir until tender, 3 to 5 minutes. Add chicken; cook and stir until lightly browned, about 5 minutes. Transfer to a bowl.\nHeat remaining 1 tablespoon oil in the saucepan. Cook and stir remaining onion with garlic until tender, 3 to 5 minutes. Add sweet potato, goat's milk, apples, yogurt, ginger, curry powder, cumin, turmeric, salt, and pepper; bring to a simmer. Return chicken to the saucepan. Simmer until flavors combine, about 10 minutes.\nStir chicken stock into the saucepan. Cook until heated through, about 1 minute.",
    "pt": "25 m",
    "ct": "36 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}