{
    "id": 257265,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "1 (16.5 ounce) package refrigerated sugar cookie dough",
        "1 tablespoon all-purpose flour, or as needed",
        "3/4 cup unsalted butter, at room temperature",
        "3 cups confectioners' sugar, sifted",
        "3 tablespoons canned coconut milk, or more as needed",
        "1 teaspoon coconut extract",
        "1/4 cup colored sugar (optional)",
        "1/4 cup candy sprinkles (optional)",
        "1/4 cup shredded coconut (optional)"
    ],
    "nut": [
        "Calories > 232 kcal",
        "Carbs > 30.9 g",
        "Cholesterol > 17 mg",
        "Fat > 12.1 g",
        "Protein > 0.9 g",
        "Sodium > 72 mg"
    ],
    "n": "Sugar Cookie Cups with Coconut Buttercream Frosting",
    "a": "foodelicious",
    "r": "0",
    "s": 24,
    "des": "\"Adorable mini sugar cookie cups are filled with swirls of coconut buttercream frosting for easy, irresistible two-bite desserts. Customize them for any holiday or occasion by adding colorful sprinkles and candies. Perfect for showers, cookie swaps, and bake sales, too.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a mini muffin tin with cooking spray.\nScoop up 2 teaspoons of cookie dough and roll into a ball. Place the ball in the prepared tin. Repeat with remaining cookie dough.\nDip the bottom of a shot glass in flour and use to press each ball of dough into a cup shape; the top of each cup should be about 1/4 inch below the rim of the tin.\nBake in the preheated oven until golden, about 10 minutes. Press again with the shot glass to reinforce the cup shape. Continue baking cookie cups until very lightly browned, about 1 minute more. Cool in the tin for 5 minutes. Transfer carefully to a wire rack to cool completely.\nBeat butter in a bowl with an electric mixer until fluffy. Beat in confectioners' sugar, 1 cup at a time, until well blended. Add coconut milk and coconut extract; beat at high speed until frosting is light and fluffy. Add 1 tablespoon coconut milk if frosting is too thick.\nSpoon or pipe frosting into each cookie cup. Decorate with colored sugar, candy sprinkles, and shredded coconut.",
    "pt": "20 m",
    "ct": "11 m",
    "tt": "36 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}