{
    "id": 257267,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Chicken Burgers:",
        "1 pound ground chicken",
        "3/4 cup bread crumbs",
        "1 egg",
        "3 tablespoons Worcestershire sauce",
        "1 tablespoon chopped fresh parsley",
        "1 teaspoon garlic powder",
        "1 teaspoon kosher salt",
        "2 tablespoons olive oil",
        "1/2 cup sliced onions",
        "Biscuits:",
        "2 1/4 cups all-purpose flour",
        "1 tablespoon baking soda",
        "1 tablespoon white sugar",
        "1 teaspoon salt",
        "2 tablespoons chopped fresh chives (optional)",
        "1/2 cup vegetable shortening",
        "1 cup low-fat milk",
        "1 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 732 kcal",
        "Carbs > 63.9 g",
        "Cholesterol > 111 mg",
        "Fat > 35.8 g",
        "Protein > 36.9 g",
        "Sodium > 1997 mg"
    ],
    "n": "Indoor Chicken Burgers on Biscuits",
    "a": "mommymeggy",
    "r": "0",
    "s": 5,
    "des": "\"Delicious alternative to beef and buns without having to light up the grill.\"",
    "ins": "Combine ground chicken, bread crumbs, egg, Worcestershire sauce, parsley, garlic powder, and kosher salt in a bowl using your hands; shape into 5 patties about 3 inches across and 1 inch thick.\nHeat oil in a skillet over medium heat. Cook patties in the hot oil until browned, about 5 minutes. Flip patties and add onions to the skillet. Cook until patties are browned on the second side and onions are tender, about 5 minutes. An instant-read thermometer inserted into the patties should read at least 165 degrees F (74 degrees C).\nPreheat oven to 425 degrees F (220 degrees C).\nMix flour, baking soda, white sugar, and salt together in a bowl; fold in chives. Cut shortening into flour mixture until crumbly. Gradually pour milk into mixture while stirring with a wooden spoon until dough starts to pull away from the sides of the bowl.\nTurn dough onto a floured surface and knead for 2 minutes; flatten into 1 inch thickness. Use a round cookie cutter or juice glass to cut into individual biscuits, pushing straight down and pulling straight up to maintain fluffiness while baking. Arrange biscuits on a baking sheet.\nBake in the preheated oven until lightly browned, about 13 minutes.\nSlice biscuits open and place a burger on the bottom half of each biscuit; top with onion and mozzarella cheese. Place top half of the biscuit on top of the mozzarella cheese to create a sandwich.",
    "pt": "25 m",
    "ct": "23 m",
    "tt": "48 m",
    "i": "4486531.jpg",
    "o": "",
    "st": "allrecipes"
}