{
    "id": 257241,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Cake:",
        "3 cups milk",
        "1 (4.6 ounce) package cook and serve vanilla pudding mix",
        "2 large carrots, grated",
        "3/4 cup raisins, divided",
        "1 tablespoon ground cinnamon",
        "1 1/2 teaspoons ground allspice",
        "1 (15.25 ounce) package carrot cake mix",
        "1 (5 ounce) package glazed pecans, divided",
        "Frosting:",
        "1 1/2 cups confectioners' sugar",
        "1 (8 ounce) package cream cheese",
        "1/2 cup butter, melted",
        "1 tablespoon vanilla extract"
    ],
    "nut": [
        "Calories > 526 kcal",
        "Carbs > 66.8 g",
        "Cholesterol > 75 mg",
        "Fat > 24.9 g",
        "Protein > 10.2 g",
        "Sodium > 494 mg"
    ],
    "n": "Hornet's Nest Carrot Cake",
    "a": "Nikita  Aven",
    "r": "0",
    "s": 12,
    "des": "\"This recipe puts a delightful carrot cake spin on a traditional hornet's nest cake, which takes the flavor of the cake and bakes it into the consistency of a brownie or bread pudding. Cut into small, bite-sized squares for a crowd-pleasing party dessert or just grab a fork and dig in straight from the baking dish, I'm not here to judge!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nBring milk to a boil in a saucepan, stirring constantly. Pour in pudding mix and remove saucepan from heat. Stir in grated carrots, 1/2 cup raisins, cinnamon, and allspice. Cool mixture until lukewarm, 5 to 10 minutes. Stir in carrot cake mix to form a thick batter.\nPour batter into the prepared pan. Scatter 2 tablespoons raisins and half of the pecans on top.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 35 minutes. Cool to room temperature, about 30 minutes.\nCombine confectioners' sugar, cream cheese, butter, and vanilla extract in a large bowl; beat until frosting smooth. Spread frosting over cooled cake. Top with remaining raisins and pecans.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}