{
    "id": 257381,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 quart milk",
        "5 tablespoons butter, divided",
        "salt to taste",
        "1 1/2 cups fine semolina flour",
        "2 egg yolks",
        "1 1/4 cups grated Grana Padano cheese, divided",
        "1/3 cup grated Gruyere cheese",
        "1 (3 ounce) package pancetta bacon, diced",
        "1 pinch ground nutmeg, or to taste"
    ],
    "nut": [
        "Calories > 648 kcal",
        "Carbs > 58.6 g",
        "Cholesterol > 190 mg",
        "Fat > 32.2 g",
        "Protein > 29.7 g",
        "Sodium > 790 mg"
    ],
    "n": "Gnocchi Alla Romana (Baked Semolina Gnocchi)",
    "a": "clara",
    "r": "0",
    "s": 4,
    "des": "\"Not to be confused with the traditional potato gnocchi, gnocchi alla Romana are semolina dumplings, baked with cheese and butter. In this recipe, pancetta is added to the mix for a tastier version of this classical Roman dish.\"",
    "ins": "Combine milk, 1/4 cup butter, and a pinch of salt in a saucepan; bring to a boil. Whisk semolina into boiling milk, mixing well to prevent lumps. Reduce heat and cook, stirring often, until thickened, 3 to 4 minutes. Remove saucepan from heat. Add egg yolks, 1 cup Grana Padano, and Gruyere cheese; stir well.\nHeat a nonstick skillet over medium heat; cook and stir pancetta until crisp, 7 to 10 minutes. Stir pancetta into semolina mixture.\nPreheat oven to 350 degrees F (175 degrees C). Grease 2 baking sheets with 1 1/2 teaspoon butter.\nSpread semolina mixture onto 1 of the prepared baking sheets, about 1/2-inch thick. Allow to cool to room temperature, about 15 minutes.\nCut small disks out of cooled semolina using a juice glass or cookie cutter. Place the disks onto the other prepared baking sheet, slightly overlapping the disks. Sprinkle the remaining Grana Padano cheese over disks and dot with remaining 1 1/2 teaspoon butter.\nBake in the preheated oven until gnocchi are nicely crisp and golden, about 20 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}