{
    "id": 257349,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 perilla leaves (shiso)",
        "8 ounces thinly sliced pork",
        "salt and ground black pepper to taste",
        "2 pieces picked plum (umeboshi), seeds removed and plums mashed",
        "2 slices American cheese, sliced into 8 strips",
        "8 shumai wrappers",
        "2 stalks celery, thinly sliced",
        "1/3 ounce semi-dried baby sardines (shirasu)"
    ],
    "nut": [
        "Calories > 96 kcal",
        "Carbs > 5.3 g",
        "Cholesterol > 27 mg",
        "Fat > 5.3 g",
        "Protein > 7.7 g",
        "Sodium > 371 mg"
    ],
    "n": "Pork, Cheese, and Shiso Wraps",
    "a": "Pearl Ishizaki",
    "r": "0",
    "s": 8,
    "des": "\"In Japan, pork, cheese, and perilla leaves (shiso) are a common food combo. They can be cooked in many ways. I've tried rolling the ingredients together and wrapping them with some leftover shumai wrappers that I have on the fridge and steamed it in the microwave. The wrappers served as an agent so the pork rolls won't open while cooking and it worked well. It's delicious.\"",
    "ins": "Wash perilla leaves and soak in a bowl of cold water. Drain.\nLay pork slices flat on a work surface and season with salt and pepper. Spread a small amount of pickled plum over pork. Arrange American cheese slices over pork and top with perilla leaves. Roll pork around cheese and leaves, creating 8 rolls.\nWrap each pork roll with a shumai wrapper. Dampen the edges and fold wrapper around pork filling, sealing the edges.\nArrange celery in 1 layer on a microwave-safe plate and spread sardines on top. Place the wrapped pork rolls on top, keeping space between each one to avoid them sticking together. Cover plate or wrap with plastic wrap.\nCook in the microwave for 8 minutes. Keep the plate covered for 5 minutes before uncovering.",
    "pt": "20 m",
    "ct": "8 m",
    "tt": "33 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}