{
    "id": 257330,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 cups chicken stock, or as needed",
        "3 skinless, boneless chicken breasts",
        "1 (8 ounce) package manicotti shells",
        "3 cups shredded mozzarella cheese, divided",
        "1 (8 ounce) package cream cheese, softened",
        "1 (8 ounce) package fresh mushrooms, finely chopped",
        "1/4 cup chopped green onions (optional)",
        "3 cloves garlic, minced",
        "2 (16 ounce) jars Alfredo sauce"
    ],
    "nut": [
        "Calories > 693 kcal",
        "Carbs > 29.8 g",
        "Cholesterol > 126 mg",
        "Fat > 51.4 g",
        "Protein > 31.2 g",
        "Sodium > 1809 mg"
    ],
    "n": "Chicken Alfredo Stuffed Manicotti",
    "a": "Heather Beal",
    "r": "0",
    "s": 8,
    "des": "\"Creamy chicken Alfredo stuffed inside manicotti noodles, topped with chicken Alfredo and mozzarella cheese. I created this recipe myself so it is by no means professional. I have never shared a recipe before but my family loves this one so much I figured this would be a good first one.\"",
    "ins": "Bring chicken stock to a boil in a saucepan. Add chicken breasts. Cook until chicken can be easily pulled apart with a fork, about 30 minutes. Drain and cool until easily handled. Shred using 2 forks.\nPreheat oven to 375 degrees F (190 degrees C).\nBring a large pot of lightly salted water to a boil. Cook manicotti in the boiling water, stirring occasionally, until still firm to the bite, about 7 minutes. Drain.\nMix shredded chicken, 2 cups mozzarella cheese, cream cheese, mushrooms, green onions, and garlic together in a bowl. Pour in enough Alfredo sauce until filling has a thick and creamy consistency.\nSpoon chicken filling into a piping bag, reserving about 1/2 cup of the filling in the bowl. Pipe filling into manicotti.\nMix remaining Alfredo sauce with reserved chicken filling in the bowl.\nArrange stuffed manicotti in a baking dish. Cover evenly with Alfredo sauce mixture until there are no dry spots. Sprinkle remaining 1 cup mozzarella cheese on top. Cover baking dish with aluminum foil.\nBake in the preheated oven until cheese is melted and sauce is bubbling, about 50 minutes. Remove aluminum foil and continue baking until cheese starts to brown, about 10 minutes.",
    "pt": "45 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "4482079.jpg",
    "o": "",
    "st": "allrecipes"
}