{
    "id": 257360,
    "old_rating": "4.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "French Toast:",
        "6 large eggs",
        "1 (13.5 ounce) can light coconut milk",
        "2 tablespoons white sugar",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon salt",
        "16 (1 1/4-inch thick) diagonal slices French bread",
        "1 cup packed sweetened flaked coconut",
        "Pineapple-Rum Sauce:",
        "1 (6 ounce) can unsweetened pineapple juice",
        "1/2 cup packed brown sugar",
        "4 1/2 cups frozen pineapple chunks",
        "2 tablespoons butter",
        "2 tablespoons dark rum"
    ],
    "nut": [
        "Calories > 521 kcal",
        "Carbs > 84.1 g",
        "Cholesterol > 125 mg",
        "Fat > 15.3 g",
        "Protein > 11.2 g",
        "Sodium > 515 mg"
    ],
    "n": "Baked Coconut French Toast with Pineapple-Rum Sauce",
    "a": "Kempstr",
    "r": "0",
    "s": 8,
    "des": "\"Add some Caribbean flair to your standard French toast with coconut and pineapple.\"",
    "ins": "Line a 13x18-inch sheet pan with parchment paper. Whisk eggs in a deep bowl, then whisk in coconut milk, sugar, vanilla, and salt until sugar is dissolved. Submerge each slice of bread in egg mixture, turning over several times, until saturated, then transfer to prepared sheet pan. Pour remaining egg mixture over bread and chill, covered with plastic wrap, at least 8 hours or up to 24 hours.\nPreheat oven to 350 degrees F (175 degrees C). Press coconut evenly into bread. Bake in upper third of oven until cooked through and golden, 30 to 35 minutes.\nMeanwhile, bring pineapple juice and brown sugar to a simmer over medium heat, stirring. Add pineapple chunks and bring to a boil, stirring, then cook over medium-high heat, stirring occasionally, 10 minutes. Add butter and rum and simmer, stirring, until butter is melted. Keep warm, covered, off heat.\nServe French toast with warm pineapple-rum sauce.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "8 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}