{
    "id": 257341,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon olive oil, or as needed",
        "2 pounds raw shrimp (16-20 per pound)",
        "Breadcrumb Mixture:",
        "3 cloves garlic",
        "kosher salt to taste",
        "1/4 teaspoon dried oregano leaves",
        "1/4 teaspoon dried thyme leaves",
        "1/3 cup chopped fresh Italian parsley, divided",
        "1/3 cup olive oil",
        "1 cup plain dry bread crumbs",
        "1 pinch kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 pinch cayenne pepper, or to taste",
        "1/2 cup freshly grated Parmigiano-Reggiano cheese"
    ],
    "nut": [
        "Calories > 260 kcal",
        "Carbs > 10.6 g",
        "Cholesterol > 177 mg",
        "Fat > 13.8 g",
        "Protein > 22.4 g",
        "Sodium > 476 mg"
    ],
    "n": "Prawns Provencale",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"I learned how to make these prawns working for a caterer back in the '80s. Be sure to season the breadcrumbs well. Butterflying the prawns takes time, but practically everything except the baking can be done ahead of time. Serve with any number of dips (like lemon aioli) or just a squeeze of fresh lemon.\"",
    "ins": "Preheat oven to 475 degrees F (245 degrees C). Line a sheet pan with aluminum foil. Brush with 1 tablespoon olive oil.\nCarefully remove shells and legs of prawns; leave the tail attached. To butterfly the prawns, cut a slit with a small sharp knife lengthwise down the belly side of shrimp, almost to the skin on the back. Open out like a book.\nPlace chopped garlic, large pinch kosher salt, oregano, and thyme in a mortar; pound and stir with a pestle a few seconds. Add 1 tablespoon fresh parsley. Pound and stir mixture until it turns into a paste, 1 or 2 minutes. Add 1/3 cup olive oil; mix about 1 minute to infuse olive oil with herbs and garlic.\nPlace bread crumbs in a mixing bowl. Transfer herb-garlic mixture to breadcrumbs. Add a pinch of salt, black pepper, pinch cayenne, remaining chopped parsley, and grated cheese. Mix with a fork to distribute ingredients evenly. Pinch a bit of the mixture; if it feels a bit dry and doesn't stick to your finger, drizzle in a bit more olive oil. Stir until mixture reaches desired consistency. 2 to 3 minutes.\nLightly but thoroughly coat cut side of prawns with crumb mixture; place on prepared baking sheet.\nBake in preheated oven until cooked through and tails curl up, 8 to 10 minutes.",
    "pt": "20 m",
    "ct": "8 m",
    "tt": "28 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}