{
    "id": 257378,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup soy sauce",
        "2 tablespoons fish sauce",
        "2 tablespoons grated fresh ginger",
        "5 cloves garlic, minced",
        "1 pound beef tenderloin, cut into 1/2-inch cubes",
        "3 tablespoons all-purpose flour",
        "2 tablespoons peanut oil",
        "1 teaspoon sesame oil",
        "Rice:",
        "2 eggs, beaten",
        "2 tablespoons soy sauce",
        "1 teaspoon sesame oil",
        "1 teaspoon Chinese five-spice powder",
        "3 cups cooked long-grain white rice",
        "2/3 cup plain tomato sauce",
        "Lemon Sauce:",
        "6 tablespoons lemon juice",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 large sweet onion, coarsely chopped"
    ],
    "nut": [
        "Calories > 598 kcal",
        "Carbs > 56.6 g",
        "Cholesterol > 151 mg",
        "Fat > 29.4 g",
        "Protein > 26.1 g",
        "Sodium > 2480 mg"
    ],
    "n": "Beef Loc Lac",
    "a": "brittneyart",
    "r": "0",
    "s": 4,
    "des": "\"A delicious Cambodian recipe that I discovered in an Asian restaurant in Paris. Its flavors are perfect and rich. Dip a piece of beef in the lemon sauce and eat it with some rice and raw onion.\"",
    "ins": "Mix 1/4 cup soy sauce, fish sauce, ginger, and garlic together in a large bowl. Stir in beef cubes. Marinate in the refrigerator for at least 1 hour and up to overnight.\nPreheat oven to 275 degrees F (135 degrees C).\nPlace flour in a shallow bowl. Strain beef into the flour; toss to coat. Reserve marinade.\nHeat peanut oil and 1 teaspoon sesame oil in a large wok or skillet over medium-high heat. Add beef cubes; saute until browned, 3 to 4 minutes. Transfer to an oven-safe plate and place in the oven to keep warm.\nCook eggs in the same wok until scrambled, about 2 minutes. Stir in reserved marinade, 2 tablespoons soy sauce, 1 teaspoon sesame oil, and Chinese five-spice powder; cook for 1 minute. Stir rice gradually into the wok until evenly distributed. Pour in tomato sauce; cook and stir until heated through, about 4 minutes.\nWhisk lemon juice, salt, and pepper together in a bowl. Divide evenly among 4 dipping cups.\nServe beef with rice, lemon juice, and chopped onion.",
    "pt": "35 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}