{
    "id": 257471,
    "old_rating": "4.14286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) box BarillaÂ® Elbows",
        "1/2 cup BarillaÂ® Traditional Basil Pesto",
        "6 slices bacon",
        "2 tablespoons butter",
        "2 garlic cloves, minced",
        "2 tablespoons all-purpose flour",
        "2 cups milk",
        "1/2 cup heavy cream",
        "salt and pepper to taste",
        "8 ounces grated white Cheddar cheese",
        "1/4 cup panko bread crumbs",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 505 kcal",
        "Carbs > 50.9 g",
        "Cholesterol > 71 mg",
        "Fat > 25.5 g",
        "Protein > 20.4 g",
        "Sodium > 493 mg"
    ],
    "n": "Bacon White Cheddar Pesto Mac and Cheese",
    "a": "fabeverydayblog",
    "r": "0",
    "s": 8,
    "des": "\"A rich and bacon-y variation of the tradition macaroni and cheese pasta dish.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 1/2- or 3-quart baking dish.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until tender yet firm to the bite, 8 minutes. Drain. Transfer pasta back to pot; cover and keep warm off heat.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned and crisp, about 10 minutes. Drain bacon slices on paper towels. Crumble.\nPlace butter and minced garlic in a saucepan over medium-high heat; stir until butter is melted. Whisk flour into butter mixture, and continue whisking until flour starts to turn golden brown, about 1 minute. Slowly add milk, heavy cream, salt, and pepper to the saucepan, whisking until there are no lumps. Bring to a boil, stirring frequently. Reduce heat to medium.\nStir grated Cheddar cheese into the cream mixture, stirring until the cheese is melted. Add basil pesto sauce and half of the crumbled bacon; stir. Transfer mixture to pot with cooked elbows; stir to combine. Pour into prepared baking dish.\nMix panko bread crumbs and Parmesan cheese together in a bowl. Sprinkle topping evenly over macaroni and cheese.\nBake in preheated oven until bubbly and just starting to brown, about 20 minutes. Top with remaining half of bacon.\nPreheat the oven's broiler. Place baking dish under broiler until browned, 1 to 3 minutes. Garnish with chopped basil.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "45 m",
    "i": "4489234.jpg",
    "o": "4505538.jpg,4504086.jpg,4503926.jpg,4501433.jpg,4499459.jpg,4499307.jpg",
    "st": "allrecipes"
}