{
    "id": 257468,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup BarillaÂ® Ditalini",
        "1 cup BarillaÂ® Tomato & Basil Sauce",
        "2/3 cup water",
        "1/3 cup quinoa",
        "2 tablespoons olive oil",
        "1 carrot, minced",
        "1 celery stalk, minced",
        "1 small onion, minced",
        "2 cups cooked chickpeas, liquid reserved",
        "1 jalapeno pepper, seeded and minced (optional)",
        "1 teaspoon salt",
        "1/4 cup nutritional yeast",
        "2 cups boiling water, or more if needed",
        "18 cooked shrimp, shelled",
        "3 tablespoons chopped fresh flat-leaf parsley",
        "1 tablespoon extra-virgin olive oil"
    ],
    "nut": [
        "Calories > 2776 kcal",
        "Carbs > 123.1 g",
        "Cholesterol > 4033 mg",
        "Fat > 38.5 g",
        "Protein > 460 g",
        "Sodium > 6210 mg"
    ],
    "n": "Super Pasta e Ceci",
    "a": "Buckwheat Queen",
    "r": "0",
    "s": 3,
    "des": "\"Traditional Italian ditalini pasta and chickpeas made even better and faster by adding BarillaÂ® Tomato and Basil sauce, cooked quinoa, and shrimp for a savory meal.\"",
    "ins": "Bring water and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender, 15 to 20 minutes. If all water has not been absorbed, drain.\nHeat oil in a large pot. Add carrots, celery, and onion; cook and stir until vegetables soften and onions begin to turn translucent, 3 to 5 minutes. Add chickpeas with liquid and cooked quinoa. Stir in jalapeno pepper. Add tomato sauce, salt, and nutritional yeast; stir to combine.\nSlowly pour in 2 cups boiling water; add ditalini. Continue to stir; add more water only if needed. Cook until ditalini are al dente, 9 to 10 minutes. Mixture should have a stew-like consistency. Add shrimp; cook and stir until shrimp are heated through, 1 more minute.\nDivide among serving bowls; top with fresh, chopped parsley and a drizzle of extra-virgin olive oil.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "4489230.jpg",
    "o": "",
    "st": "allrecipes"
}