{
    "id": 257425,
    "old_rating": "4.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup uncooked long-grain white rice",
        "1/4 teaspoon kosher salt",
        "1 cup water",
        "1/4 cup white sugar",
        "1 1/3 cups milk",
        "1/2 teaspoon vanilla extract",
        "1/8 teaspoon ground cinnamon",
        "1 large egg yolk",
        "1 tablespoon cold butter",
        "2 tablespoons dried cherries, chopped"
    ],
    "nut": [
        "Calories > 235 kcal",
        "Carbs > 39.6 g",
        "Cholesterol > 65 mg",
        "Fat > 5.7 g",
        "Protein > 5.4 g",
        "Sodium > 180 mg"
    ],
    "n": "Chef John's Classic Rice Pudding",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"For whatever reason, rice pudding is usually not near the top when people list their favorite desserts, but despite that, it's a proven crowd-pleaser, and quite easy to make, especially using this simplified, one-pot method.\"",
    "ins": "Place rice, salt, and water into a saucepan. Bring to a boil over medium-high heat. Reduce heat to low, cover, and cook until tender, about 20 minutes. Remove from heat; sprinkle with sugar and pour in milk. Stir with a whisk until until the thin layer of cooked-on starch at the bottom of the pan is cleared and incorporated into the mixture, 2 or 3 minutes.\nPlace pan over medium heat, stirring frequently, until it reaches your desired of level of doneness and creaminess, 8 to 10 minutes. The longer it cooks, the thicker and stickier it will be. Remove from heat. Add vanilla and cinnamon. Very quickly whisk in the egg yolk (to prevent it from cooking). Whisk for about 1 more minute. Add butter and dried cherries; stir thoroughly.\nTransfer warm pudding to serving dishes. Cool to room temperature. Cover and refrigerate until thoroughly chilled, 3 to 4 hours.",
    "pt": "5 m",
    "ct": "30 m",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}