{
    "id": 257499,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup canola oil, divided",
        "1 large yellow onion, finely chopped",
        "1 teaspoon ground turmeric",
        "1 1/2 pounds boneless chuck roast, cut into 1 1/2-inch cubes",
        "1 1/2 cups finely chopped spinach",
        "1 cup finely chopped green onions (green part only)",
        "1/2 cup finely chopped Italian flat-leaf parsley",
        "1/4 cup finely chopped cilantro",
        "1/4 cup finely chopped chives",
        "1/4 cup finely chopped fenugreek leaves",
        "1 1/2 cups water, or more as needed",
        "salt and ground black pepper to taste",
        "1 lemon, juiced",
        "4 dried Persian limes (limoo amani), or more to taste",
        "1 (15 ounce) can red kidney beans, drained and rinsed"
    ],
    "nut": [
        "Calories > 342 kcal",
        "Carbs > 18.1 g",
        "Cholesterol > 51 mg",
        "Fat > 22.5 g",
        "Protein > 18.3 g",
        "Sodium > 225 mg"
    ],
    "n": "Ghormeh Sabzi (Persian Herb Stew)",
    "a": "marybakes",
    "r": "0",
    "s": 6,
    "des": "\"Ghormeh sabzi is deliciously savory and loaded with the flavors of several different green herbs. It's traditionally served atop white rice (polow). You can also serve it with lavash bread.\"",
    "ins": "Heat 2 tablespoons oil in a large pot over medium-high heat. Add onion; cook and stir until deep golden brown, 10 to 15 minutes. Stir in turmeric for 1 to 2 minutes. Add chuck cubes; cook until coated in turmeric and browned on all sides, 8 to 10 minutes.\nHeat remaining 2 tablespoons oil in a separate pot over medium heat. Add spinach, green onions, parsley, cilantro, chives, and fenugreek leaves; cook and stir until deep dark green in color, 5 to 10 minutes.\nStir spinach mixture into the onion and chuck mixture. Pour in enough water to create a slurry consistency. Season with salt and pepper. Pour in lemon juice. Reduce heat, cover, and simmer stew until greens soften, about 1 hour.\nPierce dried limes with a fork and add to the stew. Continue simmering until chuck is tender, 30 minutes to 1 hour. Stir in red kidney beans. Cook until flavors combine, about 30 minutes. Discard dried limes before serving.",
    "pt": "45 m",
    "ct": "2 h ",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}