{
    "id": 257478,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 (8 ounce) package lasagna noodles",
        "1/4 cup butter, divided",
        "6 large portobello mushroom caps, diced",
        "salt and ground black pepper to taste",
        "1 large Vidalia onion, diced",
        "5 cloves garlic, minced",
        "2 cups whole milk",
        "2 cups heavy whipping cream",
        "3 cups grated Parmesan cheese",
        "3 cups crumbled feta cheese",
        "3 cups shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 672 kcal",
        "Carbs > 18.6 g",
        "Cholesterol > 192 mg",
        "Fat > 52.4 g",
        "Protein > 32.5 g",
        "Sodium > 1508 mg"
    ],
    "n": "Mushroom Lasagna with Garlic Parmesan Cream Sauce",
    "a": "cherrybaum",
    "r": "0",
    "s": 10,
    "des": "\"Yummy alternative to traditional lasagna.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally until tender yet firm to the bite, about 8 minutes. Drain.\nMelt 2 tablespoons butter in a large pot over medium heat. Cook and stir portobello mushrooms until soft, 5 to 10 minutes. Season lightly with salt and pepper.\nMelt remaining 2 tablespoons butter in a large pot over medium heat. Cook and stir onion and garlic in butter until deeply browned, about 25 minutes. Pour in milk and heavy cream; bring to a simmer. Whisk in Parmesan cheese until sauce thickens slightly. Remove from heat; season lightly with salt and pepper.\nPreheat oven to 350 degrees F (175 degrees C).\nLayer lasagna noodles, portobello mushrooms, onion sauce, feta cheese, and mozzarella cheese in a baking dish, ending with cheese on top.\nBake in the preheated oven until lasagna is heated through and lightly browned on top, about 30 minutes.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}