{
    "id": 257428,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons honey",
        "2 tablespoons Shaoxing cooking wine",
        "1 tablespoon hoisin sauce",
        "1 tablespoon pureed kiwi",
        "1 tablespoon Chinese dark soy sauce",
        "1 tablespoon Thai chile sauce",
        "2 cloves garlic, grated",
        "2 teaspoons oyster sauce",
        "1/2 teaspoon Chinese five-spice powder",
        "1 1/2 pounds pork belly, skin removed"
    ],
    "nut": [
        "Calories > 355 kcal",
        "Carbs > 13 g",
        "Cholesterol > 62 mg",
        "Fat > 23.6 g",
        "Protein > 21.1 g",
        "Sodium > 1809 mg"
    ],
    "n": "Char Siu (Chinese Barbeque Pork)",
    "a": "MelisaG",
    "r": "0",
    "s": 4,
    "des": "\"My favorite Chinese food ever! Chinese dark soy sauce is actually a key component. Serve with rice or noodles.\"",
    "ins": "Mix honey, cooking wine, hoisin sauce, kiwi, dark soy sauce, chile sauce, garlic, oyster sauce, and five-spice powder together in a large resealable plastic bag. Add pork belly. Seal bag, pressing out as much air as possible.\nPlace bag on a plate and marinate pork belly in the refrigerator, flipping occasionally, for at least 2 days.\nPreheat oven to 275 degrees F (135 degrees C) with a rack in the upper third of the oven. Set a wire rack on a rimmed baking sheet.\nPlace pork belly on the wire rack, reserving marinade.\nBake pork belly in the preheated oven until the internal temperature reaches 160 degrees F (71 degrees C), about 1 hour. Remove pork belly from the oven; baste with reserved marinade.\nMove oven rack to the top position and preheat the oven's broiler.\nBroil pork until it is dark and glossy and the edges start to blacken, about 5 minutes. Flip and baste on the second side. Continue broiling until second side darkens and starts to blacken, about 5 minutes more. Slice with a sharp knife.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "2 d ",
    "i": "4513143.jpg",
    "o": "",
    "st": "allrecipes"
}