{
    "id": 257479,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons olive oil",
        "4 cups sliced fresh mushrooms",
        "2 cups unpeeled shredded zucchini",
        "1 onion, chopped",
        "1 carrot, shredded",
        "3 cups meatless spaghetti sauce",
        "1 teaspoon dried oregano",
        "1 teaspoon dried basil",
        "cooking spray",
        "12 lasagna noodles",
        "2 cups 1% cottage cheese",
        "2 cups shredded mozzarella cheese",
        "1 (10 ounce) package frozen chopped spinach, thawed and well drained",
        "1/4 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 333 kcal",
        "Carbs > 38.2 g",
        "Cholesterol > 24 mg",
        "Fat > 12 g",
        "Protein > 19.8 g",
        "Sodium > 692 mg"
    ],
    "n": "Homestyle Mushroom Lasagna",
    "a": "gemini9gem",
    "r": "0",
    "s": 10,
    "des": "\"This is a family favorite. It is always requested for birthday dinners. I usually triple this recipe and hope for leftovers. Enjoy!\"",
    "ins": "Heat olive oil in a large saucepan over medium heat. Add mushrooms, zucchini, onion, and carrot; cook and stir until softened, 5 to 10 minutes.\nStir spaghetti sauce, oregano, and basil into the saucepan; bring to a boil. Reduce heat and simmer sauce, covered, until flavors combine, 20 to 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan with cooking spray.\nBring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally until tender yet firm to the bite, about 8 minutes. Drain.\nSpread a thin layer of sauce in the bottom of the baking pan. Layer 6 lasagna noodles, 1 cup cottage cheese, and 1 cup mozzarella cheese on top of the sauce. Cover mozzarella cheese with spinach. Repeat layers with remaining sauce, lasagna noodles, cottage cheese, and mozzarella cheese. Sprinkle Parmesan cheese on top.\nBake in the preheated oven until bubbly, 40 to 45 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}