{
    "id": 257550,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "Crumb Topping:",
        "1/2 cup white whole wheat flour",
        "1/2 cup rolled oats",
        "6 tablespoons unsalted butter, melted",
        "1/4 cup loosely packed light brown sugar",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon salt",
        "Bottom Layer:",
        "1/2 cup unsalted butter, softened",
        "1/2 cup confectioners' sugar",
        "2 eggs",
        "1 egg yolk",
        "1 tablespoon lemon zest",
        "1 1/2 teaspoons finely chopped rosemary, or more to taste",
        "1/2 teaspoon vanilla extract",
        "3/4 cup white whole wheat flour",
        "1/2 teaspoon baking powder",
        "1/8 teaspoon salt",
        "2 (6 ounce) containers fresh blackberries"
    ],
    "nut": [
        "Calories > 319 kcal",
        "Carbs > 31.3 g",
        "Cholesterol > 112 mg",
        "Fat > 20.3 g",
        "Protein > 5.2 g",
        "Sodium > 145 mg"
    ],
    "n": "Rosemary and Lemon Blackberry Bars",
    "a": "Anne J.",
    "r": "0",
    "s": 9,
    "des": "\"These blackberry bars are best made when the berries are in peak season. They are the perfect end to a meal because they are not cloyingly sweet, and they have a nice, savory note with the addition of the rosemary. Garnish with a little lemon zest or rosemary.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line an 8-inch baking dish with parchment paper, leaving an overhang on two sides.\nCombine 1/2 cup white whole wheat flour, oats, 6 tablespoons butter, brown sugar, 1/2 teaspoon vanilla extract, and 1/4 teaspoon salt in a small bowl; mix with a fork to make a crumbly topping. Place in the refrigerator.\nCombine 1/2 cup butter and confectioners' sugar in a bowl; beat with an electric mixer until light and creamy. Add eggs and egg yolk one at a time, mixing well after each addition. Beat in lemon zest, rosemary, and 1/2 teaspoon vanilla extract.\nMix 3/4 cup white whole wheat flour, baking powder, and 1/8 teaspoon salt together in a separate bowl. Add to the creamed butter mixture in 2 to 3 batches, mixing well after each addition, until a thick dough forms.\nSpread dough in the bottom of the prepared pan. Arrange blackberries evenly on top. Stir crumb topping and sprinkle evenly over blackberries. Press down gently to pack topping down.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 40 to 45 minutes. Transfer to a wire rack; let cool for 1 hour.\nLift bars out of the pan using the parchment paper edges. Cut into 12 pieces using a long serrated knife.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "2 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}