{
    "id": 257580,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Noodles:",
        "1 (12 ounce) package dried rice noodles",
        "boiling water to cover",
        "Sauce:",
        "1 cup water",
        "1 tablespoon chicken bouillon granules",
        "1 tablespoon soy sauce",
        "Vegetables:",
        "1 tablespoon olive oil",
        "4 ounces Japanese white mushrooms, stemmed and sliced",
        "4 ounces baby cabbage, shredded",
        "4 ounces pickled Chinese mustard greens, chopped",
        "1/4 head lettuce, shredded",
        "1 large Japanese cucumber, sliced"
    ],
    "nut": [
        "Calories > 373 kcal",
        "Carbs > 77 g",
        "Cholesterol > < 1 mg",
        "Fat > 4.3 g",
        "Protein > 5.8 g",
        "Sodium > 674 mg"
    ],
    "n": "Hong Kong-Style Five Vegetable Fried Rice Noodle (Ng So Chao Mai Sin)",
    "a": "Renita Au Yeung",
    "r": "0",
    "s": 4,
    "des": "\"This is a traditional fried rice noodle in Taiwanese way and Hong Kong style. I make a little change for vegetarians. Most of the fried noodles are oily and high in calories, but this one is good for health or diet and it is easy. The cabbage and the mushroom makes the noodle taste really perfect, and you can add Chinese salt mustard if you want to make it little bit salty.\"",
    "ins": "Place noodles in a bowl and pour in enough boiling water to cover; soak until noodles are softened, about 10 minutes. Drain.\nMix 1 cup water, chicken bouillon, and soy sauce in a bowl until sauce is smooth.\nHeat olive oil in a large skillet over medium heat; cook and stir mushrooms, baby cabbage, mustard greens, lettuce, and Japanese cucumber until mushrooms are fragrant and vegetables are tender, about 5 minutes. Add noodles and sauce; cook and stir using a long wooden chopstick until sauce has nearly evaporated, about 5 minutes.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}