{
    "id": 257596,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Bouillabaisse:",
        "1/2 cup coarsely chopped onion",
        "1/4 cup coarsely chopped celery",
        "1/4 cup coarsely chopped carrot",
        "1 tablespoon olive oil",
        "1 tablespoon coarsely chopped garlic",
        "1 teaspoon lemon zest",
        "3/4 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 teaspoon saffron threads",
        "1/4 teaspoon fennel seeds",
        "1/4 teaspoon herbes de Provence",
        "4 chicken thighs, skinned and trimmed of excess fat",
        "5 Yukon Gold potatoes, peeled and halved",
        "1/2 (14 ounce) can diced tomatoes",
        "3/4 cup water",
        "1/2 cup dry white wine",
        "10 ounces kielbasa sausage, cut into 4 pieces",
        "1 tablespoon chopped fresh tarragon",
        "2 teaspoons anise-flavored liqueur (such as PernodÂ®) (optional)",
        "Rouille:",
        "2 large cloves garlic, peeled",
        "1/4 teaspoon paprika",
        "1/8 teaspoon cayenne pepper",
        "1 egg yolk",
        "1/2 cup olive oil",
        "salt to taste (optional)"
    ],
    "nut": [
        "Calories > 937 kcal",
        "Carbs > 55.5 g",
        "Cholesterol > 171 mg",
        "Fat > 60.9 g",
        "Protein > 35.3 g",
        "Sodium > 1222 mg"
    ],
    "n": "Chicken Bouillabaisse",
    "a": "Jacques Pepin",
    "r": "0",
    "s": 4,
    "des": "\"This dish, made with chicken, kielbasa, and potatoes, takes its inspiration from the \nfamous fish stew of the South of France and contains all the classic seasonings, including \nsaffron. An expensive spice, saffron is essential to this dish. The best comes from Spain. I've also added a little tarragon at the end. Although not absolutely necessary, tarragon \nhas a slight anise taste that complements the other seasonings. To reinforce its flavor, I add a splash of PernodÂ® or RicardÂ® at the last minute, although this ingredient is optional \ntoo.\"",
    "ins": "Combine onion, celery, carrot, 1 tablespoon olive oil, chopped garlic, lemon zest, 3/4 teaspoon salt, pepper, saffron, fennel seeds, and herbes de Provence in a bowl; add chicken and turn to coat. Cover bowl and refrigerate until flavors combine, at least 15 minutes.\nTransfer chicken mixture to a stainless steel pot; add potatoes, tomatoes, water, and white wine. Cover and bring to a boil; reduce heat to low and simmer for 25 minutes. Add sausage and cook for 5 minutes. Stir tarragon and liqueur into pot.\nRemove half of a cooked potato and 1/4 cup liquid from the pot and place in a food processor; add peeled garlic, paprika, and cayenne pepper. Process until smooth, about 10 seconds. Add egg yolk and keep processor running; pour in 1/2 cup olive oil slowly until incorporated and rouille is smooth. Season with salt.\nServe bouillabaisse in warmed soup plates with a spoonful of rouille drizzled on top.",
    "pt": "35 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "4488988.jpg",
    "o": "",
    "st": "allrecipes"
}