{
    "id": 257570,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 kiwis, peeled",
        "3/4 cup white sugar, divided",
        "4 cups hulled fresh strawberries",
        "4 cups fresh blackberries",
        "1 (14.4 ounce) package graham crackers (such as Honey MaidÂ®)",
        "2 cups ricotta cheese",
        "1 (16 ounce) container cream cheese frosting (such as Duncan HinesÂ®)",
        "3 (3.5 ounce) containers banana cream pudding (such as Snack PackÂ®)",
        "1/2 cup whipped cream (optional)",
        "1/2 cup toasted sliced almonds (optional)"
    ],
    "nut": [
        "Calories > 411 kcal",
        "Carbs > 64.1 g",
        "Cholesterol > 11 mg",
        "Fat > 14.9 g",
        "Protein > 7.6 g",
        "Sodium > 301 mg"
    ],
    "n": "Summertime Dessert Lasagna",
    "a": "Kari Chappell",
    "r": "0",
    "s": 16,
    "des": "\"Delicious lasagna made with graham crackers, banana pudding, cream cheese frosting, and fresh fruit layers. The whole family will love this treat on a hot summer day. Great for get-togethers as well.\"",
    "ins": "Combine 4 kiwis and 2 tablespoons sugar in a food processor; puree until smooth. Transfer puree to a bowl. Rinse the food processor bowl.\nCombine 2 cups strawberries and 2 tablespoons sugar in the food processor; puree until smooth. Strain puree into a bowl. Rinse the food processor bowl.\nCombine 2 cups blackberries and 2 tablespoons sugar in the food processor; puree until smooth. Strain puree into a bowl.\nCut remaining kiwis into 1/4-inch slices. Cut remaining strawberries into 1/8-inch slices. Cut remaining blackberries in half.\nPlace 4 graham crackers in a resealable plastic bag; seal. Crush with a rolling pin.\nMix remaining sugar, ricotta cheese, cream cheese frosting, and banana cream pudding together in a bowl.\nCover the bottom of a 9x13-inch glass pan with whole graham crackers. Spread 1/3 of the ricotta cheese mixture evenly on top. Cover with kiwi puree and kiwi slices. Lay more whole graham crackers on top. Spread 1/2 of the remaining ricotta cheese mixture over crackers. Cover with strawberry puree and strawberry slices. Repeat layers with blackberry puree and halved blackberries.\nSpread whipped cream over blackberries. Garnish with crushed graham crackers and toasted almonds. Cover tightly with plastic wrap and refrigerate until flavors combine, 5 hours to overnight.",
    "pt": "1 h",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}