{
    "id": 257599,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cookie Base:",
        "1 cup unsalted butter, at room temperature",
        "3/4 cup white sugar",
        "1 egg",
        "2 tablespoons lemon juice",
        "2 teaspoons lemon zest",
        "1 teaspoon vanilla extract",
        "2 1/2 cups all-purpose flour",
        "2 tablespoons poppy seeds",
        "1 teaspoon sea salt",
        "Filling:",
        "1 (8 ounce) package cream cheese, at room temperature",
        "1/4 cup sour cream",
        "2 1/2 tablespoons white sugar",
        "24 strawberries",
        "1 small bunch fresh mint"
    ],
    "nut": [
        "Calories > 196 kcal",
        "Carbs > 19.6 g",
        "Cholesterol > 39 mg",
        "Fat > 12.1 g",
        "Protein > 2.8 g",
        "Sodium > 107 mg"
    ],
    "n": "Lemon Poppy Seed Tartlet with a Strawberry Rose",
    "a": "Ashley Baron Rodriguez",
    "r": "0",
    "s": 24,
    "des": "\"Spring is finally upon us and what better way to celebrate with a little sweet that looks like it was freshly plucked from the garden. \nHere a jeweled toned strawberry is transformed into a blooming rose with a few simple knife cuts. It rests on a tangy cream cheese filling that cozies up to a butter and tart lemon poppyseed cookie.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper.\nCombine butter and 3/4 cup sugar in a large bowl; beat with an electric mixer until creamy. Beat in egg, lemon juice, lemon zest, and vanilla extract. Stir in flour, poppy seeds, and salt until dough comes together and no floury streaks remain.\nPinch off 1 1/2 teaspoon-sized pieces of dough and roll into balls. Place balls on the lined baking sheets. Press down on each ball with your thumb to create a small indent.\nBake in the preheated oven until firm, about 7 minutes. Remove from the oven and use the back of a spoon to reinforce each indent. Continue baking until cookies are barely golden around the edges, about 5 minutes more.\nTransfer cookies to a wire rack to cool completely.\nMix cream cheese, sour cream, and 2 1/2 tablespoons sugar together in a bowl until well blended. Fill each cooled cookie with 1/2 teaspoon of the cream cheese mixture.\nMake 4 deep cuts along the bottom third of each strawberry using a sharp paring knife. Fan out the cuts carefully so they open up. Repeat this process, cutting in between the cuts from the row below, until you reach the top.\nPlace a strawberry rose over each cookie; tuck 1 or 2 mint leaves around each strawberry.",
    "pt": "40 m",
    "ct": "12 m",
    "tt": "52 m",
    "i": "4499904.jpg",
    "o": "",
    "st": "allrecipes"
}