{
    "id": 25758,
    "old_rating": "2.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 shallots, thinly sliced",
        "1/4 cup vegetable oil",
        "6 ounces egg noodles",
        "1 cup bean sprouts",
        "3 quarts chicken broth",
        "3 cups shredded, cooked chicken breast meat",
        "1/2 cup chopped green onion",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 384 kcal",
        "Carbs > 35.7 g",
        "Cholesterol > 73 mg",
        "Fat > 15.9 g",
        "Protein > 25.3 g",
        "Sodium > 61 mg"
    ],
    "n": "Chicken Noodle Soup III",
    "a": "Angie",
    "r": "0",
    "s": 6,
    "des": "\"In Asia, there are different kinds of 'noodle soup'.  Noodle soup is more a noodle dish rather than a soup dish.  This one is a great comfort food on a cold day.  Light and healthy as well. Quantities are arbitrary.  Adjust to own taste. Very important to add the shallots as they give the fragrance and flavor.  Instead of egg noodles, sometimes I use macaroni.   You can also use soy sauce instead of the salt.  If you are adventurous, eat with chopped hot chile pepper or add some cayenne pepper to make the soup spicy.\"",
    "ins": "In a small skillet over medium heat, cook shallots in oil until brown and fragrant.  Remove from heat and set aside.\nBring a large pot of water to a boil.  Cook noodles in boiling water until just tender, 8 to 10 minutes; drain and rinse under cold water.  Set aside.\nBring a small pot of water to a boil; have ready a bowl of ice water.  Blanch bean sprouts by plunging them into boiling water for 1 minute, then into cold water.  Drain and set aside.\nIn a large saucepan over medium heat, bring chicken broth to a simmer.\nDivide noodles evenly between 6 bowls.  Top with bean sprouts and shredded chicken.  Pour the heated broth into the bowls.  Drizzle with the shallot mixture and garnish with the green onion.  Season with salt and pepper.  Serve at once.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "2782138.jpg",
    "o": "",
    "st": "allrecipes"
}