{
    "id": 257525,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup rice flour",
        "1/2 cup coconut flour",
        "1/2 cup cornmeal",
        "1 teaspoon xanthan gum",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon fine sea salt",
        "2 tablespoons warm water",
        "1 1/2 teaspoons dry egg replacer (such as Ener-GÂ®)",
        "3 tablespoons applesauce, or as needed",
        "3/4 cup oat milk",
        "3/4 cup maple syrup",
        "1 (5 ounce) package baby spinach",
        "1/4 cup canola oil",
        "2 teaspoons pure vanilla extract",
        "2 medium ripe bananas, mashed",
        "1/2 cup vegan chocolate chips (such as Enjoy LifeÂ®)"
    ],
    "nut": [
        "Calories > 238 kcal",
        "Carbs > 42.9 g",
        "Cholesterol > 0 mg",
        "Fat > 6.1 g",
        "Protein > 3.4 g",
        "Sodium > 175 mg"
    ],
    "n": "Allergy-Friendly Green Banana Muffins",
    "a": "Lindsay",
    "r": "0",
    "s": 12,
    "des": "\"These muffins go so fast in my house! The spinach is indiscernible and the sweetness is just right. We have these for breakfast, snack, or dessert. Store in an airtight container in the refrigerator for 3 to 4 days.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a muffin tin with paper liners.\nWhisk rice flour, coconut flour, cornmeal, xanthan gum, baking powder, baking soda, and salt together in a large bowl.\nWhisk water and egg replacer together in a glass measuring cup. Add enough applesauce to make 1/4 cup. Transfer mixture to a blender; add oat milk, maple syrup, baby spinach, oil, and vanilla extract. Blend until smooth.\nPour spinach mixture over the flour mixture; mix until just combined. Fold mashed bananas and chocolate chips into the batter.\nScoop batter into the prepared tin, filling each cup 3/4 full.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 25 minutes. Transfer to a wire rack to cool completely.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}