{
    "id": 257579,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds beef heel muscle, cut into 3/4-inch cubes",
        "2 beefsteak tomatoes, sliced",
        "4 carrots, sliced",
        "1 onion, sliced",
        "4 slices fresh ginger, or to taste",
        "1 1/2 teaspoons beef seasoning",
        "3 cups water",
        "1 cup soy sauce",
        "1 cup beef broth",
        "1 cup ketchup",
        "1 cup Chinese rice wine",
        "28 ounces raw ramen noodles",
        "1 cup cold water",
        "1/2 head Chinese white cabbage, or to taste, cut into chunks",
        "1/2 cup diced garlic",
        "1/2 cup sliced scallions"
    ],
    "nut": [
        "Calories > 718 kcal",
        "Carbs > 35.9 g",
        "Cholesterol > 148 mg",
        "Fat > 36.8 g",
        "Protein > 52 g",
        "Sodium > 2781 mg"
    ],
    "n": "Taiwanese-Style Beef Noodles",
    "a": "Anita Chen",
    "r": "0",
    "s": 8,
    "des": "\"Beef stew cooked with onions, carrots, and tomatoes in a slow cooker, paired with ramen and veggies. This is my mom's recipe for the famous Taiwanese beef noodle soup. I don't eat beef noodles anywhere else because I can't find anything like this anywhere!\"",
    "ins": "Place beef cubes in a large pot of cold water; bring to a boil. Drain and pat dry.\nArrange beefsteak tomatoes, carrots, onion, and fresh ginger in the bottom of a slow cooker. Lay beef cubes on top. Sprinkle beef seasoning over beef cubes.\nMix 3 cups water, soy sauce, beef broth, ketchup, and rice wine together in a bowl. Pour into the slow cooker.\nCook on High until beef is tender, 2 to 3 hours.\nBring 2 quarts water to a boil in a large pot. Add ramen noodles; cook until softened, 2 to 3 minutes. Add 1 cup cold water; bring back to a boil. Transfer noodles to a large bowl with a slotted spoon. Cook cabbage in the boiling water until tender, 3 to 5 minutes. Drain.\nStir beef mixture and cabbage into the bowl of noodles. Garnish with garlic and scallions.",
    "pt": "35 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}