{
    "id": 257528,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "1 cup finely chopped bittersweet chocolate",
        "3 egg whites, at room temperature",
        "2 cups confectioners' sugar, divided",
        "1/2 cup unsweetened cocoa powder",
        "1 tablespoon cornstarch",
        "1/4 teaspoon salt",
        "1/2 cup chopped dark chocolate",
        "1/4 teaspoon coarse sea salt"
    ],
    "nut": [
        "Calories > 119 kcal",
        "Carbs > 19.3 g",
        "Cholesterol > < 1 mg",
        "Fat > 4.6 g",
        "Protein > 1.5 g",
        "Sodium > 51 mg"
    ],
    "n": "Flourless Triple Chocolate Cookies",
    "a": "jamiebrooke5761",
    "r": "0",
    "s": 24,
    "des": "\"These gluten-free triple chocolate cookies, made without flour, are quick and easy to make and will impress all the chocolate lovers in your life.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Spray 2 baking sheets with cooking spray.\nMelt bittersweet chocolate in top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Remove from heat and cool slightly.\nBeat egg whites in a large bowl using an electric mixer until soft peaks form; gradually beat in 1 cup confectioners' sugar until mixture resembles soft marshmallow creme.\nWhisk 1/2 cup confectioners' sugar, cocoa powder, cornstarch, and salt together in a bowl. Beat confectioners' sugar mixture into egg white mixture on low speed until a soft meringue forms. Stir in cooled melted bittersweet chocolate and dark chocolate until dough becomes stiff.\nPlace remaining 1/2 cup confectioners' sugar in a bowl. Roll 1 rounded tablespoon of dough into a ball and roll ball in the confectioners' sugar, generously coated all sides. Repeat with remaining dough and sugar. Arrange cookies 2 inches apart on the baking sheets and sprinkle coarse salt over each.\nBake in the preheated oven until tops start to crack, 9 to 10 minutes. Cool cookies on the baking sheets for 10 minutes before transferring to a wire rack to cool completely.",
    "pt": "30 m",
    "ct": "9 m",
    "tt": "49 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}