{
    "id": 257517,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup sweetened flaked coconut",
        "21 chocolate sandwich cookies, crushed",
        "1/4 cup butter, softened",
        "2 cups dulce de leche (caramel sauce), divided",
        "1 (8 ounce) package cream cheese, softened",
        "1/4 cup white sugar",
        "1/4 cup confectioners' sugar",
        "2 cups heavy cream",
        "1 teaspoon vanilla extract",
        "5 tablespoons heavy cream",
        "1/4 cup milk chocolate chips"
    ],
    "nut": [
        "Calories > 858 kcal",
        "Carbs > 87.9 g",
        "Cholesterol > 151 mg",
        "Fat > 54.1 g",
        "Protein > 9.7 g",
        "Sodium > 463 mg"
    ],
    "n": "Samoa Pie",
    "a": "OkieBrave",
    "r": "0",
    "s": 8,
    "des": "\"If you love Girl Scout Samoa Cookies, then this dessert is for you. Rich and creamy, this delectable dessert never lasts long in our family! You can also use a regular caramel sauce, but the dulce de leche is luscious and irresistible in this recipe.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Spread coconut on a rimmed baking sheet.\nToast coconut in the preheating oven until lightly golden, 5 to 10 minutes.\nMix crushed cookies and butter together in a bowl. Press evenly into a 9-inch pie plate.\nBake in the preheated oven until crisp, about 10 minutes. Transfer to a wire rack to cool.\nCombine 1/2 cup dulce de leche, cream cheese, white sugar, and confectioners' sugar in a large bowl; beat with an electric mixer until smooth. Add 2 cups heavy cream and vanilla extract; beat until soft peaks form. Pour over the cooled crust; spread in an even layer with a spatula.\nRefrigerate pie until cream layer is set, at least 6 hours.\nSpread 1/2 cup dulce de leche evenly over the chilled cream layer.\nMix toasted coconut with 3/4 cup dulce de leche in a bowl. Spoon over dulce de leche layer; press down gently with a spatula.\nCombine remaining 1/4 cup dulce de leche and 2 tablespoons heavy cream in a microwave-safe bowl. Heat in the microwave for 20 seconds. Stir. Continue heating in 20-second intervals until melted and smooth, stirring after each interval.\nCombine chocolate chips and remaining 3 tablespoons heavy cream in a separate microwave-safe bowl. Heat in the microwave for 20 seconds. Stir. Continue heating in 20-second intervals until melted and smooth, stirring after each interval.\nDrizzle melted caramel and chocolate over pie.",
    "pt": "30 m",
    "ct": "17 m",
    "tt": "6 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}