{
    "id": 257538,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tomato",
        "3 dried guajillo chile peppers, seeded",
        "2 dried ancho chile peppers, seeded",
        "1 pineapple, sliced 3/4-inch thick",
        "1/2 cup orange juice",
        "1 onion, quartered",
        "1/4 cup white vinegar",
        "2 chipotle peppers in adobo sauce",
        "1 tablespoon salt, or to taste",
        "2 cloves garlic, crushed",
        "3 cloves",
        "1 teaspoon cumin seeds",
        "1 teaspoon dried oregano",
        "1 (2 pound) pork tenderloin, cut into thin slices",
        "To Serve:",
        "1/2 cup chopped onion",
        "1/2 cup chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 205 kcal",
        "Carbs > 23 g",
        "Cholesterol > 44 mg",
        "Fat > 5.6 g",
        "Protein > 16.9 g",
        "Sodium > 748 mg"
    ],
    "n": "Tender Tacos al Pastor",
    "a": "docmancito",
    "r": "0",
    "s": 10,
    "des": "\"Tacos al pastor is a quintessential Mexican dish, with tender pork and pineapple marinated in a savory and aromatic chile sauce. Serve with warm corn tortillas, tomatillos salsa, and lemon or lime wedges.\"",
    "ins": "Cook tomato on a ridged grill pan over medium-high heat until slightly blackened, about 5 minutes. Remove from heat and cool until easily handled. Peel off skin and remove seeds.\nBring a small pot of water to a boil. Add guajillo and ancho chile peppers; cook until softened, about 5 minutes. Drain.\nCombine tomato flesh, softened chile peppers, 2 slices pineapple, orange juice, quartered onion, vinegar, chipotle peppers, salt, garlic, cloves, cumin seeds, and oregano in a blender; blend until smooth.\nArrange pork slices in a glass or ceramic baking dish. Pour blended mixture over pork, ensuring all sides are evenly coated. Cover baking dish with plastic wrap.\nMarinate pork in the refrigerator, 4 hours to overnight.\nCook remaining pineapple slices on a ridged grill pan over medium-high heat until slightly blackened and soft, about 5 minutes per side. Chop into small pieces.\nWipe out grill pan and preheat over medium-high heat. Cook marinated pork in the hot pan, turning once, until browned, 4 to 5 minutes.\nChop pork coarsely into small pieces against the grain. Serve with pineapple, chopped onion, and cilantro.",
    "pt": "50 m",
    "ct": "29 m",
    "tt": "5 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}