{
    "id": 257551,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup white sugar",
        "1/2 cup applesauce",
        "1 egg, beaten",
        "1 teaspoon vanilla extract",
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground nutmeg",
        "cooking spray",
        "3 cups fresh blackberries",
        "3 tablespoons instant tapioca",
        "1 cup chocolate chips"
    ],
    "nut": [
        "Calories > 122 kcal",
        "Carbs > 24.1 g",
        "Cholesterol > 8 mg",
        "Fat > 2.6 g",
        "Protein > 1.9 g",
        "Sodium > 19 mg"
    ],
    "n": "Chocolate Blackberry Bars",
    "a": "FARNSWORTH",
    "r": "0",
    "s": 24,
    "des": "\"Tastes like a cobbler with some chocolate thrown in the middle.\"",
    "ins": "Mix sugar, applesauce, egg, and vanilla extract together in a large bowl.\nCombine flour, baking powder, cinnamon, and nutmeg in a separate bowl. Pour into the applesauce mixture; mix until a thick dough forms. Place dough in the refrigerator.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with cooking spray.\nCombine blackberries and tapioca in a saucepan over low heat; cook and stir until mixture is the consistency of a runny jam, about 10 minutes. Remove from heat.\nTurn dough out onto a floured work surface; knead about 10 times. Divide dough into 2 pieces. Roll each piece to 1/4-inch thickness. Press 1 piece of rolled dough into the prepared baking dish.\nMelt chocolate chips in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, 1 to 3 minutes. Spread chocolate over dough.\nSpread blackberry mixture over the chocolate. Cover blackberry mixture with the second piece of dough.\nBake in the preheated oven until top is golden brown, about 30 minutes. Let cool before before slicing, at least 15 minutes.",
    "pt": "20 m",
    "ct": "41 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}