{
    "id": 257518,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups packed brown sugar",
        "1 cup butter, softened",
        "2 eggs (such as Eggland's BestÂ®)",
        "2 teaspoons vanilla extract",
        "2 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon salt",
        "1/4 cup white sugar",
        "1 tablespoon ground cinnamon",
        "2 (13.4 ounce) cans dulce de leche",
        "2 (6 ounce) packages white baking chocolate, chopped",
        "1/3 cup heavy whipping cream",
        "1 tablespoon light corn syrup"
    ],
    "nut": [
        "Calories > 389 kcal",
        "Carbs > 59.1 g",
        "Cholesterol > 47 mg",
        "Fat > 15.6 g",
        "Protein > 4.5 g",
        "Sodium > 283 mg"
    ],
    "n": "Caramel Snickerdoodle Bars",
    "a": "Shane",
    "r": "0",
    "s": 24,
    "des": "\"What did I do when I couldn't decide between two of my favorite desserts? Combined them! This snickerdoodle-blondie hybrid is even better with my other favorite ingredient: caramel. Great treats that everyone will love. Refrigerate leftovers.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x13-inch baking pan with parchment paper, leaving a 1-inch overhang over each side.\nCombine brown sugar and butter in a large bowl; beat with an electric mixer until light and fluffy. Beat in eggs and vanilla extract.\nWhisk flour, baking powder, and salt together in a separate bowl. Beat flour mixture gradually into the creamed butter mixture until batter is combined. Spread batter in the bottom of the lined baking pan.\nMix white sugar and cinnamon together in a small bowl. Sprinkle 2 tablespoons of the cinnamon sugar over the batter.\nBake in the preheated oven until edges are light brown, 25 to 30 minutes. Transfer to a wire rack to cool completely, about 15 minutes.\nSpread dulce de leche over cooled crust.\nCombine white chocolate, heavy cream, and light corn syrup in a small saucepan. Cook and stir over low heat until smooth, about 5 minutes. Let cool slightly, about 5 minutes.\nSpread white chocolate mixture over dulce de leche. Sprinkle remaining cinnamon sugar on top. Cover baking pan and refrigerate until firm, at least 1 hour.\nLift out of the baking pan using the parchment paper ends. Cut into bars.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}