{
    "id": 257501,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups dried lentils",
        "1 tablespoon butter, or to taste",
        "2 carrots, finely chopped",
        "3 stalks celery, finely chopped",
        "1 yellow onion, finely chopped",
        "3 cloves garlic, minced",
        "2 tablespoons ground paprika",
        "2 tablespoons ground turmeric",
        "1 tablespoon kosher salt",
        "2 teaspoons red pepper flakes",
        "2 teaspoons ground cinnamon",
        "freshly ground black pepper to taste",
        "2 tablespoons olive oil",
        "1 quart beef broth",
        "1 cup boiling water, or as needed",
        "2 cups chopped spinach",
        "2 limes, juiced",
        "2 tablespoons chopped green onions",
        "2 cubes beef bouillon",
        "1/2 cup plain nonfat yogurt, or to taste",
        "2 tablespoons chopped fresh parsley, or to taste"
    ],
    "nut": [
        "Calories > 268 kcal",
        "Carbs > 39.2 g",
        "Cholesterol > 4 mg",
        "Fat > 6.3 g",
        "Protein > 16.1 g",
        "Sodium > 1386 mg"
    ],
    "n": "Persian Lentil Stew",
    "a": "Persian Spice Elevator",
    "r": "0",
    "s": 8,
    "des": "\"My mom's lentil stew always comforted me as a child so this is a recipe close to my heart. Earlier this week my husband told me he was craving it so I made my own version of the soup. I tweaked the recipe by adding some herbs and spices not traditionally used in this dish (paprika, red pepper flakes, and red onion). This stew is great for a winter evening or in the summertime served with some tangy yogurt. Enjoy!\"",
    "ins": "Place lentils in a large container and cover with several inches of cool water; let soak for 10 to 15 minutes. Drain.\nMelt butter in a Dutch oven over medium heat. Add carrots, celery, onion, and garlic; cook and stir until lightly golden brown, 5 to 7 minutes. Stir in paprika, turmeric, salt, red pepper flakes, cinnamon, and pepper. Add lentils and olive oil; cook and stir until lentils are coated with oil, 1 to 2 minutes.\nPour beef broth into the Dutch oven; bring to a boil. Simmer, adding boiling water as lentils absorb the broth to maintain a stew consistency, about 20 minutes. Stir in spinach, lime juice, green onions, and beef bouillon cubes. Continue simmering until lentils are soft, about 1 hour.\nServe stew topped with spoonfuls of yogurt and fresh parsley.",
    "pt": "40 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}