{
    "id": 257523,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 large beefsteak tomatoes",
        "1 tablespoon olive oil",
        "1 pinch salt and ground black pepper to taste",
        "Filling:",
        "1 cup kasha (roasted buckwheat groats)",
        "2 eggs, lightly beaten",
        "1 tablespoon olive oil",
        "1/2 large red onion, diced",
        "1 teaspoon minced garlic",
        "2 cups vegetable broth",
        "2 ears fresh corn, kernels cut off",
        "1 tablespoon chili powder, or more to taste",
        "1 tablespoon ground cumin, or more to taste",
        "1 cup shredded Monterey Jack cheese, divided",
        "Romesco Sauce:",
        "1/4 cup toasted almonds",
        "1 slice sandwich bread, toasted",
        "1 (12 ounce) jar roasted red peppers",
        "2 tablespoons extra-virgin olive oil",
        "1 1/2 tablespoons sherry vinegar",
        "1 large clove garlic, minced",
        "1/2 teaspoon sea salt",
        "1/4 teaspoon cayenne pepper"
    ],
    "nut": [
        "Calories > 414 kcal",
        "Carbs > 44.3 g",
        "Cholesterol > 71 mg",
        "Fat > 21.7 g",
        "Protein > 15.4 g",
        "Sodium > 712 mg"
    ],
    "n": "Kasha Stuffed Tomatoes with Romesco Sauce",
    "a": "Amber411",
    "r": "0",
    "s": 6,
    "des": "\"Tomatoes stuffed with kasha and corn, topped with a delicious Romesco sauce. I guarantee you won't miss the meat in this dish! Garnish with cilantro.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nCut tops off tomatoes and scoop out the core and flesh with a spoon, being careful not to puncture the skin. Reserve 1/2 cup of tomato flesh in a bowl.\nBrush tomatoes with 1 tablespoon olive oil; season with salt and pepper. Arrange tomatoes on a baking sheet.\nBake in the preheated oven until softened, about 6 minutes. Pour out any juices that collected in the tomatoes.\nMix kasha and eggs together in a bowl.\nHeat 1 tablespoon olive oil in a large skillet over medium heat. Add onion and 1 clove garlic; cook and stir until onion is translucent, about 5 minutes. Pour in kasha mixture; cook over medium-high heat, stirring constantly, until kernels separate and look dry, 1 to 2 minutes.\nPour vegetable broth into the skillet. Reduce heat; cover and cook until kasha is tender and broth is absorbed, 7 to 10 minutes. Stir in corn, chili powder, cumin, salt, and pepper. Remove from heat and stir in about 1/2 cup Monterey Jack cheese.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nSpoon kasha mixture into the tomatoes. Sprinkle remaining 1/2 cup Monterey Jack cheese on top.\nBroil tomatoes in the preheated oven until cheese has melted, 2 to 3 minutes.\nCombine almonds and toasted bread in a food processor; process until finely ground. Add reserved tomato flesh, roasted red peppers, 2 tablespoons olive oil, sherry vinegar, 1 clove garlic, sea salt, and cayenne pepper; process until smooth. Spoon sauce over tomatoes.",
    "pt": "40 m",
    "ct": "21 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}