{
    "id": 257597,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 1/2 tablespoons olive oil, divided",
        "3/4 teaspoon salt, divided",
        "1 (3 pound) chicken, quartered, drumsticks and thighs separated",
        "2 tablespoons unsalted butter, softened",
        "2 tablespoons chopped fresh tarragon",
        "2 teaspoons fresh lemon juice"
    ],
    "nut": [
        "Calories > 575 kcal",
        "Carbs > 0.5 g",
        "Cholesterol > 220 mg",
        "Fat > 39.6 g",
        "Protein > 51.4 g",
        "Sodium > 588 mg"
    ],
    "n": "Grilled Chicken with Tarragon Butter",
    "a": "Jacques Pepin",
    "r": "0",
    "s": 4,
    "des": "\"I prepare this dish inside on my stovetop gas grill in winter and outdoors on my gas or\ncharcoal grill in summer. Make sure your grill is very clean, or the chicken will stick. The\n bird is grilled long enough so that most of the fat in the skin drains away, and it is then \ntransferred to a warm oven to finish cooking in its own juices. A delicious tarragon butter, \ndotted on the chicken at serving time, replicates the flavor of a bearnaise sauce.\"",
    "ins": "Preheat an outdoor grill for medium-high heat. Preheat oven to 160 degrees F (71 degrees C).\nSpread 1 tablespoon olive oil and 1/2 teaspoon salt over the chicken pieces.\nPlace chicken pieces skin-side down on the hot grill; cook until browned, turning occasionally, about 20 minutes for the breasts and 30 minutes for the leg pieces. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Transfer to a baking sheet and keep warm in the preheated oven.\nCombine remaining 1 1/2 tablespoon olive oil, remaining 1/4 teaspoon salt, butter, tarragon, and lemon juice in a food processor; blend until smooth.\nDivide grilled chicken pieces among 4 serving plates. Dot each serving with about 1 tablespoon of the tarragon butter.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "4488659.jpg",
    "o": "",
    "st": "allrecipes"
}