{
    "id": 257658,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Dressing:",
        "1/2 cup vegetable oil",
        "3 tablespoons red wine vinegar",
        "3 tablespoons Dijon mustard",
        "3 tablespoons sesame seeds",
        "2 tablespoons honey",
        "1 teaspoon chopped garlic",
        "Salad:",
        "1/2 pound bacon",
        "12 cups spinach leaves",
        "6 cups coarsely chopped frisee (French curly endive)",
        "3 small pears, thinly sliced",
        "2/3 red onion, thinly sliced",
        "6 grapes, halved (optional)",
        "Cashews:",
        "3/4 cup raw cashews",
        "1 tablespoon butter",
        "1 tablespoon brown sugar",
        "1 teaspoon curry powder",
        "1 teaspoon dried rosemary",
        "1/2 teaspoon salt",
        "1/8 teaspoon cayenne pepper"
    ],
    "nut": [
        "Calories > 481 kcal",
        "Carbs > 33.9 g",
        "Cholesterol > 19 mg",
        "Fat > 35.7 g",
        "Protein > 11.5 g",
        "Sodium > 746 mg"
    ],
    "n": "Cashew-Curry Spinach Salad",
    "a": "Wende Wubbena Carlisle",
    "r": "0",
    "s": 6,
    "des": "\"Fabulous salad for a fall dinner with friends or a holiday dinner. The cashew flavoring really adds to the salad and you can make the cashews just for snacking as well. My roommate suggested this salad to me and it is just tasty!\"",
    "ins": "Whisk vegetable oil, red wine vinegar, Dijon mustard, sesame seeds, honey, and garlic together in a bowl to make dressing.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Crumble into smaller pieces.\nLayer bacon crumbles, spinach leaves, frisee, pears, red onion, and grapes on individual serving plates.\nPreheat oven to 400 degrees F (200 degrees C). Spread cashews on a baking sheet.\nMelt butter in a saucepan over low heat. Stir in brown sugar, curry powder, rosemary, salt, and cayenne pepper until smooth.\nToast cashews in the preheated oven until lightly browned, 8 to 10 minutes. Add to the saucepan with the butter mixture; stir until coated. Let cool, about 10 minutes.\nSprinkle cashews over salad plates. Drizzle dressing on top.",
    "pt": "30 m",
    "ct": "18 m",
    "tt": "58 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}