{
    "id": 257601,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/3 cup chopped pecans, or more to taste",
        "2 pounds riced cauliflower",
        "3 tablespoons olive oil",
        "2 cloves garlic, grated",
        "1 tablespoon chopped fresh thyme, divided",
        "2 1/2 teaspoons kosher salt, divided",
        "freshly ground black pepper to taste",
        "4 thinly sliced chicken breasts",
        "8 thin bacon slices",
        "1/4 cup brown sugar",
        "3/4 teaspoon chili powder",
        "1/2 cup chopped fresh parsley"
    ],
    "nut": [
        "Calories > 500 kcal",
        "Carbs > 28.7 g",
        "Cholesterol > 85 mg",
        "Fat > 28.1 g",
        "Protein > 36.3 g",
        "Sodium > 565 mg"
    ],
    "n": "Herby Cauliflower Rice with Pecans and Candied Bacon-Wrapped Chicken",
    "a": "Julie Hubert",
    "r": "0",
    "s": 4,
    "des": "\"Bacon-wrapped chicken with brown sugar and chili powder is baked next to cauliflower rice in this easy sheet pan dinner ready in about an hour.\"",
    "ins": "Heat a skillet over medium heat; add pecans and cook, stirring frequently, until toasted, about 5 minutes.\nPreheat oven to 425 degrees F (220 degrees C). Cover a baking sheet with aluminum foil, ensuring the foil goes up the sides of the sheet to catch all the juices.\nCombine cauliflower, olive oil, garlic, 2 teaspoons thyme, 1 1/2 teaspoons salt, and black pepper in a bowl; spread over 2/3 of the prepared baking sheet.\nSeason chicken with remaining 1 teaspoon thyme, 1 teaspoon salt, and ground black pepper. Wrap each chicken breast with 2 pieces bacon, covering the entire surface of the chicken. Arrange chicken in 1 row down the remaining 1/3 of the baking sheet.\nMix brown sugar and chili powder together in a bowl and sprinkle half of it over the bacon-wrapped chicken.\nBake in the preheated oven for 25 minutes; stir cauliflower and flip bacon-wrapped chicken using tongs. Sprinkle the remaining brown sugar mixture over chicken. Continue baking until chicken is no longer pink in the center and bacon is crisp, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Broil for a few minutes if bacon needs crisping.\nRemove chicken from baking sheet and stir cauliflower into the bacon and chicken drippings. Stir in toasted pecans and parsley. Spoon cauliflower into bowls and top with bacon-wrapped chicken.",
    "pt": "25 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}