{
    "id": 257643,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Gluten-Free Crust:",
        "3 cups gluten-free all-purpose baking flour (such as Bob's Red MillÂ®)",
        "2 teaspoons coarse kosher salt, divided",
        "1 teaspoon instant dry yeast",
        "1 cup water, or more as needed",
        "2 tablespoons olive oil",
        "Toppings:",
        "2 teaspoons olive oil, or more to taste",
        "1 teaspoon balsamic vinegar, or more to taste",
        "1 small red onion, thinly sliced",
        "4 cloves garlic, minced, or more to taste",
        "1 large Fuji apple, chopped",
        "3 heads radicchio, shredded, or more to taste",
        "salt and ground black pepper to taste",
        "1/4 cup chopped fresh parsley, or to taste",
        "2 teaspoons honey, or more to taste"
    ],
    "nut": [
        "Calories > 255 kcal",
        "Carbs > 47.7 g",
        "Cholesterol > 0 mg",
        "Fat > 6.6 g",
        "Protein > 6.7 g",
        "Sodium > 519 mg"
    ],
    "n": "Gluten-Free Radicchio and Caramelized Onion Flatbread",
    "a": "happyolks",
    "r": "0",
    "s": 8,
    "des": "\"Intensely tasty gluten-free radicchio and caramelized onion flat bread with fresh parsley and honey.\"",
    "ins": "Combine flour, kosher salt, and yeast in a food processor. Pour in water and olive oil, with the food processor running, until the mixture forms a sticky ball of dough. Add more water if needed.\nTurn dough onto a floured surface and knead until it forms a smooth, round ball, about 10 seconds. Place dough in a greased bowl. Cover with plastic wrap and let rise in a warm, draft-free area until it doubles in size, 1 to 2 hours.\nHeat 1 teaspoon olive oil and balsamic vinegar in a skillet over medium heat; cook and stir onion and garlic until softened and slightly browned, 5 to 8 minutes. Add apples; cook and stir until slightly softened, 2 to 3 minutes.\nToss radicchio with remaining 1 teaspoon olive oil, salt, and pepper together in a large bowl.\nPreheat oven to 450 degrees F (230 degrees C).\nSpread dough onto a pizza stone or greased baking sheet.\nBake in the preheated oven until pale, 5 to 7 minutes. Spread a thin layer of onion mixture onto crust and top with radicchio. Bake in the oven for 5 minutes more. Turn on the oven's broiler and broil until edges begin to brown, 1 to 2 minutes.\nRemove flatbread from oven and garnish with parsley. Top with a drizzle of honey.",
    "pt": "40 m",
    "ct": "18 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}