{
    "id": 257610,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 1/2 cups packed dark brown sugar",
        "1 cup butter, softened",
        "1/2 cup white sugar",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "2 cups all-purpose flour",
        "1 1/2 teaspoons baking soda",
        "1 1/2 teaspoons salt",
        "3 cups old-fashioned rolled oats",
        "1 (11 ounce) package butterscotch chips",
        "16 chocolate sandwich cookies with extra creme filling (such as Double Stuf OreoÂ®)",
        "flaked sea salt"
    ],
    "nut": [
        "Calories > 503 kcal",
        "Carbs > 69.9 g",
        "Cholesterol > 54 mg",
        "Fat > 21.9 g",
        "Protein > 5.1 g",
        "Sodium > 520 mg"
    ],
    "n": "OreoÂ®-Stuffed Oatmeal Scotchies",
    "a": "Julie Hubert",
    "r": "0",
    "s": 16,
    "des": "\"Traditional oatmeal scotchies are stuffed with chocolate sandwich cookies in this cookie-stuffed cookie recipe that everyone will love.\"",
    "ins": "Line 2 baking sheets with parchment paper and spray with cooking spray.\nBeat brown sugar, butter, and white sugar together in a bowl using an electric mixer until smooth and creamy, about 5 minutes. Scrape down sides of bowl a few times. Continue beating mixture while adding eggs, 1 at a time, beating well after each addition. Add vanilla extract and mix well.\nWhisk flour, baking soda, and salt together in a separate bowl. Slowly add flour mixture to creamed butter mixture while beating on low speed until dough is just mixed. Fold oats and butterscotch chips into dough.\nScoop 32 balls of dough using a large cookie scoop and arrange on the prepared baking sheets. Spray the bottom of a broad, flat glass or bowl with cooking spray and press onto each dough ball to flatten. Place a chocolate sandwich cookie on top of 16 flattened dough balls and cover with remaining 16 flattened dough balls, sealing the edges together with your fingers.\nTransfer stuffed cookies to a container or tray and cover with a lid or plastic wrap. Refrigerate at least 1 hour to overnight.\nPreheat oven to 375 degrees F (190 degrees C). Line baking sheets with parchment paper.\nArrange cookies on the sheets with no more than 6 per sheet; top with a sprinkling of flaked salt.\nBake 1 tray at a time in the preheated oven until golden brown, 14 to 16 minutes. Cool on the baking sheet for 1 minute before transferring to a wire rack to cool.",
    "pt": "20 m",
    "ct": "14 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}