{
    "id": 257618,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups water",
        "1 cup quinoa",
        "2 teaspoons olive oil, divided",
        "5 skinless, boneless chicken breasts, cubed",
        "salt and ground black pepper to taste",
        "1 yellow onion, chopped",
        "1 cup chopped carrots",
        "1 cup chopped celery",
        "1/2 cup chopped red bell pepper",
        "1/2 cup chopped yellow bell pepper",
        "2 tablespoons chopped garlic",
        "8 cups chicken broth",
        "2 cups chopped spinach leaves",
        "1/2 teaspoon dried marjoram",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon dried basil",
        "1/2 teaspoon crushed bay leaf",
        "1/3 cup cornstarch",
        "1/4 cup cold water"
    ],
    "nut": [
        "Calories > 229 kcal",
        "Carbs > 26.6 g",
        "Cholesterol > 42 mg",
        "Fat > 4.6 g",
        "Protein > 19.1 g",
        "Sodium > 1050 mg"
    ],
    "n": "Chicken Quinoa Soup",
    "a": "riversiderunner",
    "r": "0",
    "s": 8,
    "des": "\"Quinoa is a tasty, protein-filled grain that makes a great addition to chicken soup! Add some carrots, celery, spinach, onions and bell peppers for amazing color and flavor. My husband loves this with multigrain crackers, but I think it's great as-is!\"",
    "ins": "Bring 3 cups water and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender, 15 to 20 minutes.\nHeat 1 teaspoon olive oil in a Dutch oven over medium-high heat. Add chicken; season with salt and pepper. Cook and stir until chicken is no longer pink in the center, about 5 minutes. Transfer chicken to a plate.\nHeat remaining 1 teaspoon olive oil in the Dutch oven over medium heat. Add onion, carrots, celery, red bell pepper, yellow bell pepper, and garlic; cook and stir until soft, about 10 minutes.\nPour chicken broth into the Dutch oven. Add spinach leaves, marjoram, oregano, basil, and bay leaf. Bring to a boil; reduce heat and simmer until flavors combine, about 10 minutes. Stir in cooked quinoa. Return chicken to the Dutch oven; cook until heated through, about 2 minutes.\nDissolve cornstarch in 1/4 cup cold water in a small bowl. Pour slowly into the Dutch oven; cook, stirring occasionally, until soup thickens, about 1 minute.",
    "pt": "40 m",
    "ct": "53 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}