{
    "id": 257661,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 teaspoons caraway seeds",
        "1 1/2 teaspoons fennel seeds",
        "1 1/2 teaspoons anise seeds",
        "1 1/4 cups whole milk",
        "1/4 cup butter, cut into cubes",
        "1/4 cup molasses",
        "3 1/2 teaspoons active dry yeast",
        "2 cups all-purpose flour, or more as needed",
        "1 cup rye flour",
        "1 1/2 teaspoons sea salt",
        "1 teaspoon orange zest"
    ],
    "nut": [
        "Calories > 273 kcal",
        "Carbs > 44.8 g",
        "Cholesterol > 19 mg",
        "Fat > 7.7 g",
        "Protein > 6.5 g",
        "Sodium > 392 mg"
    ],
    "n": "Swedish Limpa Rye Bread",
    "a": "S",
    "r": "0",
    "s": 8,
    "des": "\"Wonderful dark bread.\"",
    "ins": "Combine caraway seeds, fennel seeds, and anise seeds in a spice grinder; pulse until coarsely ground.\nHeat milk and butter in a deep saucepan, stirring occasionally, until butter melts and milk comes to a bare simmer, about 5 minutes. Remove from heat and cool until milk registers 100 degrees F (38 degrees C) on an instant-read thermometer.\nStir molasses and yeast into the milk mixture. Let stand until yeast is foamy, about 5 minutes. Add 2 cups all-purpose flour, rye flour, sea salt, and orange zest; stir until dough forms a shaggy mass. Knead in the saucepan, adding more flour if needed, until dough is no longer sticky, 5 to 7 minutes.\nTurn dough out on a floured surface. Knead, adding more flour if needed, until smooth and springy, about 7 minutes.\nPlace dough in a large greased bowl, turning to coat. Cover with a damp kitchen towel or piece of plastic wrap. Let rise in a warm area until somewhat puffy, about 1 hour.\nLine a baking sheet with parchment paper. Place dough on the baking sheet. Cover lightly with the towel or plastic wrap. Let rise until puffy, about 1 hour 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in the preheated oven until browned, 35 to 40 minutes. Bread will sound hollow when tapped on the bottom.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}