{
    "id": 257652,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Sweet Creme Fraiche:",
        "2 cups heavy whipping cream",
        "2 tablespoons buttermilk",
        "2 tablespoons white sugar",
        "Pancakes:",
        "1 cup all-purpose flour",
        "2 1/2 teaspoons baking powder",
        "1 dash salt",
        "1 3/4 cups ricotta cheese",
        "5 eggs, separated",
        "1 cup milk",
        "1/2 cup white sugar",
        "1 lemon, zested"
    ],
    "nut": [
        "Calories > 306 kcal",
        "Carbs > 22.9 g",
        "Cholesterol > 145 mg",
        "Fat > 20.1 g",
        "Protein > 9.4 g",
        "Sodium > 234 mg"
    ],
    "n": "Lemon Ricotta Pancakes with Sweet Creme Fraiche",
    "a": "princessgertie",
    "r": "0",
    "s": 12,
    "des": "\"This is one of my favorite recipes from a B&B (Fairholme Manor) my husband and I stayed in in Victoria, BC. I eat the pancakes with creme fraiche alone, but many enjoy it with the addition of maple syrup. Enjoy the creme fraiche as a substitute to whipped cream on just about anything.\"",
    "ins": "Mix heavy cream, buttermilk, and 2 tablespoons sugar together in a bowl. Let stand at room temperature until slightly thickened, 6 to 8 hours. Cover and refrigerate for at least 24 hours before using.\nSift flour, baking powder, and salt together in a bowl.\nWhisk ricotta cheese, egg yolks, milk, sugar, and lemon zest together in a separate bowl. Whisk in flour mixture until batter is smooth.\nBeat egg whites in a glass, metal, or ceramic bowl until stiff peaks form. Fold very gently into the batter.\nHeat a lightly oiled griddle over medium heat. Drop 1/2 cup batter onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\nBeat sweetened creme fraiche until stiff peaks form. Serve with pancakes.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "1 d ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}