{
    "id": 257642,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 leaves kale, stemmed and torn into pieces",
        "2 1/2 tablespoons extra-virgin olive oil, divided",
        "1 pinch seasoned salt",
        "1 egg",
        "3 slices bacon",
        "1 1/2 cups chopped radicchio",
        "1 1/2 cups chopped butter lettuce",
        "1/2 avocado, cubed",
        "1/4 cup thinly sliced red onion",
        "1 large Roma tomato, sliced",
        "2 radishes, sliced",
        "2 tablespoons sliced fresh oyster mushrooms",
        "1/4 cup fresh blueberries",
        "1 1/2 tablespoons balsamic vinegar",
        "sea salt to taste",
        "1 pinch lemon pepper"
    ],
    "nut": [
        "Calories > 403 kcal",
        "Carbs > 18 g",
        "Cholesterol > 108 mg",
        "Fat > 32.9 g",
        "Protein > 11.9 g",
        "Sodium > 777 mg"
    ],
    "n": "Radicchio and Butter Lettuce Salad with Blueberries and Kale Chips",
    "a": "Daniele",
    "r": "0",
    "s": 2,
    "des": "\"I came up with this salad trying to get as many veggies in at the end of a day as possible while adding some crunch and protein, because I had not had any all that day. So I ended up taking a bunch of things I liked and mixing them up with my favorite dressing: olive oil and vinegar with salt and pepper to taste. I think it turned out great! I liked it so much I ate the whole bowl! I hope you'll try it and see what you think.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nSpread kale on a baking sheet. Drizzle 1 tablespoon olive oil over kale; season with seasoned salt.\nBake in the preheated oven until edges are browned, 10 to 15 minutes. Place kale chips on paper towels to drain excess oil.\nPlace egg in a saucepan and cover with water. Bring to a boil; cook for 5 minutes. Remove from heat. Cool under running water. Peel off shell and slice egg.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Place bacon slices on paper towels to drain excess oil. Crumble.\nToss radicchio, butter lettuce, avocado, red onion, tomato, radishes, and mushrooms together in a large bowl. Add egg slices, bacon crumbles, and blueberries; toss again. Add remaining 1 1/2 tablespoon olive oil, balsamic vinegar, salt, and lemon pepper; toss one more time. Scatter kale chips on top.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}