{
    "id": 257609,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Bread:",
        "1 1/4 cups warm water (105 degrees F/41 degrees C)",
        "2 teaspoons active dry yeast",
        "2 1/2 teaspoons white sugar",
        "1 1/2 cups all-purpose flour",
        "1 1/2 cups bread flour",
        "1 teaspoon salt",
        "Crust Topping:",
        "1 1/2 cups white rice flour",
        "1 cup warm water (105 degrees F/41 degrees C)",
        "2 tablespoons vegetable oil",
        "2 tablespoons white sugar",
        "2 tablespoons active dry yeast",
        "1/4 teaspoon salt"
    ],
    "nut": [
        "Calories > 307 kcal",
        "Carbs > 58.9 g",
        "Cholesterol > 0 mg",
        "Fat > 4.2 g",
        "Protein > 7.8 g",
        "Sodium > 327 mg"
    ],
    "n": "Dutch Crunch Rolls",
    "a": "melody741",
    "r": "0",
    "s": 9,
    "des": "\"If you live in the SF Bay Area, you've probably had one of these at some time or another. I guess in the UK they are also known as Tiger Bread. These crunchy little rolls are great with dry Italian salami and thickly sliced American cheese or in place of buns for hamburgers. Store in an airtight container.\"",
    "ins": "Combine 1 1/4 cup warm water and 2 teaspoons yeast in a large bowl; stir until yeast is dissolved. Stir in 2 1/2 teaspoons sugar. Let stand until yeast forms a creamy foam, about 10 minutes.\nSift 1 cup all-purpose flour, 1 cup bread flour, and 1 teaspoon salt together in a separate bowl. Stir into the yeast mixture. Add remaining all-purpose and bread flour, 1/2 cup at a time, until dough pulls away from the side of the bowl.\nPlace dough on a lightly floured surface; knead until smooth, about 8 minutes. Transfer to a greased bowl. Cover with plastic wrap and let rise until doubled, about 1 hour.\nPunch dough down and cut into 9 equal pieces. Press down on each piece with your palm and roll against the work surface to form into a ball.\nPlace balls of dough on a baking sheet lined with parchment paper. Cover with greased plastic wrap; let rise until puffy, 40 to 50 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nCombine rice flour, 1 cup warm water, vegetable oil, 2 tablespoons sugar, 2 tablespoons yeast, and 1/4 teaspoon salt in a bowl to make topping. Let rest for 5 minutes.\nSpread topping thickly over tops and sides of the rolls.\nBake in the preheated oven until golden brown, 25 to 30 minutes. Cool on a wire rack.",
    "pt": "40 m",
    "ct": "25 m",
    "tt": "3 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}