{
    "id": 257655,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Streusel:",
        "1/4 cup packed light brown sugar",
        "1/4 cup dark brown sugar",
        "1/4 cup chopped walnuts",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground ginger",
        "1 1/2 teaspoons cold butter",
        "1/4 cup chocolate chips",
        "Cake:",
        "1/2 cup butter, softened",
        "1/2 cup light brown sugar",
        "1/2 cup white sugar",
        "2 eggs",
        "1/2 cup canned pumpkin puree",
        "1/2 cup sour cream",
        "1 1/2 teaspoons dark rum",
        "1 teaspoon vanilla extract",
        "1 1/2 cups all-purpose flour",
        "1 teaspoon ground cinnamon",
        "1 teaspoon baking soda",
        "3/4 teaspoon fine sea salt",
        "2 (1 ounce) squares bittersweet chocolate, chopped"
    ],
    "nut": [
        "Calories > 494 kcal",
        "Carbs > 67.7 g",
        "Cholesterol > 86 mg",
        "Fat > 23.1 g",
        "Protein > 6.2 g",
        "Sodium > 445 mg"
    ],
    "n": "Pumpkin Babka with Chocolate Streusel",
    "a": "AllieGeekPi",
    "r": "0",
    "s": 8,
    "des": "\"Pumpkin babka with chocolate streusel is perfect for Thanksgiving or to use up leftover pumpkin puree.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x5-inch loaf pan.\nMix 1/4 cup light brown sugar, dark brown sugar, walnuts, 1 teaspoon cinnamon, and 1/4 teaspoon ginger together in a bowl. Cut in 1 1/2 teaspoon butter with a pastry blender until mixture is crumbly. Divide streusel mixture between two bowls. Mix chocolate chips into one bowl.\nCombine 1/2 cup butter, 1/2 cup light brown sugar, and white sugar in a large bowl; beat with an electric mixer until light and fluffy. Add eggs one at a time, beating well after each addition. Add pumpkin puree, sour cream, dark rum, and vanilla extract; mix well.\nCombine flour, 1 teaspoon cinnamon, baking soda, and sea salt in a bowl. Beat gradually into the pumpkin mixture until batter is smooth.\nSpoon half of the batter into the prepared pan. Sprinkle chocolate chip streusel over batter, keeping it away from the sides of the pan. Spoon remaining batter on top, spreading it to the edges of the pan. Sprinkle remaining streusel on top.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 55 minutes. Transfer pan to a wire rack; let cool for 30 minutes. Invert cake onto the wire rack to cool completely.\nMelt bittersweet chocolate in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, 1 to 3 minutes. Drizzle over the top and side of the cake. Chill cake until chocolate is set, about 20 minutes.",
    "pt": "20 m",
    "ct": "56 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}