{
    "id": 257649,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 cups all-purpose flour",
        "1/4 teaspoon salt",
        "1/2 cup cold unsalted butter",
        "1/4 cup ice water",
        "1/4 cup plain yogurt",
        "2 teaspoons lime juice",
        "2 tablespoons olive oil",
        "1 tablespoon butter",
        "2 small leeks, white parts only, chopped",
        "1 teaspoon minced fresh marjoram, or more to taste",
        "4 shiitake mushrooms, stemmed and diced",
        "3 button mushrooms, stemmed and diced",
        "salt and ground black pepper to taste",
        "1 egg yolk",
        "1 tablespoon water"
    ],
    "nut": [
        "Calories > 205 kcal",
        "Carbs > 14.8 g",
        "Cholesterol > 53 mg",
        "Fat > 15.2 g",
        "Protein > 2.6 g",
        "Sodium > 97 mg"
    ],
    "n": "Mini Mushroom Galettes",
    "a": "Chef AidF",
    "r": "0",
    "s": 9,
    "des": "\"This was my first attempt at a mushroom recipe. On my website, I describe this recipe as small, savory treats that can be served to accompany a variety of dishes.\"",
    "ins": "Mix flour and salt together in a bowl. Cut in 1/2 cup butter with a pastry blender until mixture resembles small pebbles.\nMix 1/4 cup ice water, yogurt, and lime juice together in a small bowl. Stir into the flour mixture until dough comes together. Shape dough into a disc; wrap in plastic wrap. Chill until firm, about 45 minutes.\nHeat olive oil and 1 tablespoon butter in a large skillet over medium heat. Add leeks; cook and stir until softened, about 5 minutes. Stir in marjoram; cook until fragrant, about 1 minute. Stir in shiitake mushrooms and button mushrooms; cook and stir until tender, about 5 minutes. Remove from heat; season with salt and pepper.\nPreheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nRoll out dough on a floured work surface with a floured rolling pin. Cut into 5-inch circles. Place circles on the baking sheet.\nPlace 1 tablespoon of the leek and mushroom filling in the center of each circle, leaving a 1-inch border. Fold up and overlap edges of border around the filling.\nWhisk egg yolk and 1 tablespoon water together in a small bowl to make egg wash. Brush egg wash over dough.\nBake in the preheated oven until light golden brown, 15 to 25 minutes.",
    "pt": "40 m",
    "ct": "26 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}