{
    "id": 257748,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 thin slices soppressata ham",
        "2 cloves garlic, minced",
        "3/4 cup dry white wine, such as Chardonnay",
        "2 tablespoons butter",
        "1 (8 ounce) package frozen chopped spinach, thawed and squeezed dry",
        "1 (8 ounce) jar marinated artichoke hearts, drained and chopped",
        "1 1/2 cups grated Parmesan cheese",
        "1/4 cup light olive oil",
        "1 (8 ounce) package cream cheese, softened",
        "2 tablespoons chopped fresh basil",
        "1/2 teaspoon dried parsley",
        "1/2 teaspoon onion powder",
        "1/2 teaspoon ground black pepper",
        "1 1/2 cups milk, at room temperature"
    ],
    "nut": [
        "Calories > 270 kcal",
        "Carbs > 7 g",
        "Cholesterol > 46 mg",
        "Fat > 21.8 g",
        "Protein > 10 g",
        "Sodium > 436 mg"
    ],
    "n": "Party Spinach and Artichoke Dip",
    "a": "babyfacenc",
    "r": "0",
    "s": 10,
    "des": "\"The recipe used what I had on hand in my kitchen after buying the spinach, marinated artichoke quarters, and cream cheese blindly without checking recipe for guidance first.\"",
    "ins": "Cook and stir soppressata and garlic in a saucepan over medium heat until soppressata is crisp, about 5 minutes. Transfer soppressata to a plate, leaving garlic in the saucepan. Chop soppressata into small pieces.\nPour white wine into the saucepan and bring to a simmer, stirring to scrape up the browned bits from the bottom, about 5 minutes. Add butter; stir until melted, about 1 minute. Stir in spinach, artichoke hearts, and Parmesan cheese. Reduce heat to medium-low and cook, stirring occasionally, until mixture is heated through, 4 to 5 minutes. Stir in olive oil.\nMix soppressata, cream cheese, basil, parsley, onion powder, and black pepper together in a bowl.\nStir cream cheese mixture into the saucepan. Stir in milk until evenly blended and simmering, about 5 minutes. Remove from heat and let cool, stirring a few times to ensure bottom doesn't scorch, about 20 minutes. Transfer to a bowl and chill until serving.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}