{
    "id": 257761,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 sweet onion (such as VidaliaÂ®)",
        "1 cup whole milk",
        "1/2 cup water",
        "2 eggs",
        "2 teaspoons salt, divided",
        "1 1/4 cups all-purpose flour",
        "1 (1 ounce) package ranch dressing mix (such as Hidden Valley Ranch Â®)",
        "1 teaspoon cayenne pepper",
        "1/2 gallon peanut oil",
        "salt and ground black pepper to taste",
        "2 cups shredded Cheddar cheese",
        "1 cup cubed cooked chicken",
        "4 slices cooked bacon, diced",
        "1/2 cup ranch dressing",
        "1 green onion, minced"
    ],
    "nut": [
        "Calories > 741 kcal",
        "Carbs > 28.3 g",
        "Cholesterol > 133 mg",
        "Fat > 58.9 g",
        "Protein > 24 g",
        "Sodium > 1702 mg"
    ],
    "n": "Chicken Bacon Ranch Loaded Bloomin' Onion",
    "a": "Julie Hubert",
    "r": "0",
    "s": 6,
    "des": "\"A homemade fried blooming onion is loaded with Cheddar cheese, bacon, and chicken in this crowd-pleasing appetizer served with ranch dressing.\"",
    "ins": "Cut 1/2 inch off the pointed part of the onion and peel. Place onion on a work surface, cut-side down. Make a downward cut into the onion, starting 1/2 inch from the root, all the way to the work surface. Repeat 3 more times, making a total of 4 evenly spaced cuts around the onion to create 4 sections\nCut each of the 4 sections of the onion into 3 even slices to reach a total of 16 evenly spaced cuts. Turn the onion over and gently separate the outer pieces, using your fingers.\nWhisk milk, water, eggs, and 1 teaspoon salt together in a bowl.\nWhisk flour, ranch dressing mix, cayenne pepper, and 1 teaspoon salt together in a separate bowl.\nPreheat oven to 450 degrees F (230 degrees C).\nHeat peanut oil in a deep fryer or deep, heavy pot to 400 degrees F (200 degrees C).\nDip onion in the egg mixture using a slotted spoon or your hand. Remove and let excess egg drip back into the egg mixture. Place onion in a bowl, cut-side up. Pour all of the flour mixture on top. Shake the bowl and distribute the flour mixture evenly using a spoon or your fingers, making sure the flour mixture reaches inside the onion's \"petals\".\nLift onion out of bowl by the core, turning over and patting to release excess flour. Fully submerge the onion in egg mixture again; remove and let excess egg mixture drip back into bowl. Place onion back in bowl with flour mixture and spoon to coat onion again with flour mixture.\nTurn the onion cut-side down and place in a wire skimmer. Shake gently over the flour bowl and pat to release any excess flour.\nCarefully lower onion in the hot oil, cut-side down. Adjust the heat so the oil temperature stays at 350 degrees (175 degrees C). Fry for 3 minutes; carefully turn onion over and cook until golden brown, about 4 minutes more. Remove and drain on paper towels and season with salt.\nPlace onion on a baking sheet and top with 1/2 of the Cheddar cheese, chicken, bacon, and remaining 1/2 of the Cheddar cheese.\nBake in the preheated oven until cheese is melted, 3 to 4 minutes. Drizzle ranch dressing over onion and sprinkle green onion, salt, and pepper over the top.",
    "pt": "45 m",
    "ct": "10 m",
    "tt": "55 m",
    "i": "4527517.jpg",
    "o": "",
    "st": "allrecipes"
}