{
    "id": 257702,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 1/2 cups warm soy milk (110 degrees F/45 degrees C)",
        "6 tablespoons honey",
        "3 tablespoons brown sugar",
        "2 (.25 ounce) packages active dry yeast",
        "6 1/2 cups bread flour, divided",
        "1/4 cup ground flax seed",
        "3 tablespoons butter, softened",
        "1 tablespoon salt"
    ],
    "nut": [
        "Calories > 286 kcal",
        "Carbs > 52.6 g",
        "Cholesterol > 6 mg",
        "Fat > 4.5 g",
        "Protein > 8.6 g",
        "Sodium > 474 mg"
    ],
    "n": "Honey and Soy Milk Bread with Flax Seed",
    "a": "wai kheng",
    "r": "0",
    "s": 16,
    "des": "\"A lovely soft healthy bread that is so simple to make! You can even vary it infinitely (different types of flour and nuts).\"",
    "ins": "Stir warm soy milk, honey, and brown sugar together in a bowl until sugar is dissolved; stir in yeast and let sit until mixture becomes foamy, about 5 minutes. Stir 3 cups flour, ground flax seed, butter, and salt into yeast mixture. Mix remaining flour, 1/2 cup at a time, mixing well after each addition, until dough pulls together.\nTurn dough onto a lightly floured surface; knead until smooth and elastic, about 8 minutes.\nLightly oil a large bowl and place dough in the bowl, turning to coat. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 30 minutes.\nCarefully turn dough onto a lightly floured surface; punch dough down. Divide dough into 2 equal pieces and form into loaves. Place loaves into 2 lightly greased 9x5-inch loaf pans. Cover loaves with a damp cloth and let rise until doubled in volume, about 40 minutes.\nPreheat oven to 425 degrees F (220 degrees C).\nPlace loaves in the preheated oven and reduce heat to 375 degrees F (190 degrees C); bake until the tops are golden brown and bottom of loaves sound hollow when tapped, 27 to 30 minutes.",
    "pt": "20 m",
    "ct": "27 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}