{
    "id": 257712,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup pine nuts",
        "1 1/2 pounds carrots, peeled and halved lengthwise",
        "5 tablespoons olive oil, divided",
        "kosher salt and ground black pepper to taste",
        "1 1/2 pounds pork tenderloin",
        "1 clove garlic, grated",
        "2 tablespoons red wine vinegar, divided",
        "1 tablespoon water, or more as needed",
        "1/2 teaspoon red pepper flakes",
        "2 cups watercress"
    ],
    "nut": [
        "Calories > 278 kcal",
        "Carbs > 12.5 g",
        "Cholesterol > 49 mg",
        "Fat > 16.8 g",
        "Protein > 20.3 g",
        "Sodium > 189 mg"
    ],
    "n": "Roast Pork Loin with Carrot Romesco",
    "a": "HootOwl",
    "r": "0",
    "s": 6,
    "des": "\"Elegant but simple.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spread pine nuts on a rimmed baking sheet.\nToast pine nuts in the preheated oven, tossing occasionally, until golden brown, 8 to 10 minutes. Let cool.\nIncrease oven temperature to 450 degrees F (230 degrees C). Toss carrots with 1 tablespoon olive oil on a separate rimmed baking sheet; season with salt and pepper.\nRoast carrots in the preheated oven, tossing occasionally, until softened and browned, 15 to 20 minutes.\nHeat 1 tablespoon oil in a large ovenproof skillet over medium-high heat. Season pork tenderloin with salt and pepper; cook in the hot oil, turning occasionally, until golden brown, 10 to 15 minutes.\nTransfer skillet to the oven; roast pork until an instant-read thermometer inserted into the center reads at least 160 degrees F (71 degrees C), about 15 minutes.\nCombine pine nuts, remaining 3 tablespoons olive oil, and garlic in a food processor; process into a coarse paste. Add 1/4 of the carrots, 1 tablespoon vinegar, 1 tablespoon water, and red pepper flakes. Process, adding more water as needed, into a coarse puree. Season with salt and pepper.\nToss remaining carrots, remaining 1 tablespoon vinegar, and watercress in a large bowl. Season with salt and pepper.\nSlice pork and top with carrot puree; serve with salad.",
    "pt": "20 m",
    "ct": "48 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}