{
    "id": 257752,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup olive oil",
        "1/2 cup chopped fresh cilantro, divided",
        "3 tablespoons chili powder",
        "4 large cloves garlic, minced",
        "1 tablespoon lime juice",
        "1/2 teaspoon salt",
        "1 pound frozen shrimp - thawed, peeled, deveined, and cleaned",
        "cooking spray",
        "1 onion, sliced into rings and rings separated",
        "1 large green bell pepper, sliced into strips",
        "1 serrano chile pepper, sliced, or more to taste",
        "4 (8 inch) flour tortillas",
        "1 cup shredded Cheddar cheese, or to taste",
        "1/2 cup shredded lettuce, or to taste",
        "1/4 cup sour cream, or to taste",
        "1/4 cup chopped tomatoes, or to taste"
    ],
    "nut": [
        "Calories > 693 kcal",
        "Carbs > 41.5 g",
        "Cholesterol > 209 mg",
        "Fat > 45.1 g",
        "Protein > 32.6 g",
        "Sodium > 975 mg"
    ],
    "n": "Chili-Lime Shrimp Fajitas",
    "a": "Jackie",
    "r": "0",
    "s": 4,
    "des": "\"Easy, quick, and delicious recipe for homemade shrimp fajitas using shrimp, green pepper, onions, lime and just a few spices!\"",
    "ins": "Whisk olive oil, 1/4 cup cilantro, chili powder, garlic, lime juice, and salt together in a bowl; add shrimp, toss to coat, and marinate in the refrigerator for 20 minutes.\nHeat a large skillet over medium-high heat; spray with cooking spray. Add onion, green bell pepper, and serrano chile pepper; saute until tender, 10 to 12 minutes. Transfer vegetables to a bowl and cover with aluminum foil to keep warm.\nPour shrimp and marinade into the same skillet over medium-high heat; cook until shrimp are pink and opaque, about 2 minutes per side. Stir vegetables into shrimp mixture; cook and stir until heated through, 2 to 3 minutes.\nSpoon shrimp-vegetable mixture onto tortillas and top each with Cheddar cheese, lettuce, sour cream, tomatoes, and remaining 1/4 cup cilantro.",
    "pt": "20 m",
    "ct": "16 m",
    "tt": "56 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}