{
    "id": 257727,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Stew:",
        "1 tablespoon coarse sea salt, or to taste",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground black pepper",
        "1/8 teaspoon ground nutmeg",
        "1/8 teaspoon garlic salt",
        "2 pork shanks",
        "2 tablespoons olive oil",
        "water to cover",
        "1 large onion, cut into chunks",
        "1 stalk celery, coarsely chopped",
        "Meatballs:",
        "1 1/2 pounds ground pork",
        "1 small onion, finely chopped",
        "2 tablespoons chopped fresh parsley",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon mustard powder",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "2/3 cup toasted flour",
        "2 tablespoons olive oil"
    ],
    "nut": [
        "Calories > 632 kcal",
        "Carbs > 16.4 g",
        "Cholesterol > 148 mg",
        "Fat > 40.8 g",
        "Protein > 48.8 g",
        "Sodium > 2193 mg"
    ],
    "n": "Ragout de Pattes de Cochon (Pork Shank and Meatball Stew)",
    "a": "Paloma",
    "r": "0",
    "s": 4,
    "des": "\"Rich stew from a French recipe.\"",
    "ins": "Mix sea salt, 1/2 teaspoon cinnamon, 1/4 teaspoon cloves, 1/4 teaspoon black pepper, nutmeg, and garlic salt together in a bowl. Rub salt mixture all over pork shanks.\nHeat 2 tablespoons olive oil in a large saucepan. Cook pork shanks in the hot oil until browned, 2 to 3 minutes per side. Pour in enough water to cover the shanks. Stir in coarsely chopped onion and celery. Bring to a boil; reduce heat and simmer until pork can be easily removed from the bones, 2 to 3 hours.\nTransfer pork shanks to a cutting board; shred pork.\nStrain cooking liquid, discarding bones, onion, and celery. Pour strained liquid back into the saucepan. Stir in shredded pork.\nMix ground pork, finely chopped onion, parsley, 1/4 teaspoon cinnamon, 1/4 teaspoon cloves, ginger, mustard powder, salt, and 1/4 teaspoon pepper together in a large bowl. Shape into balls.\nPour toasted flour into a shallow dish. Roll meatballs in toasted flour.\nHeat 2 tablespoons olive oil in a large skillet over medium-high heat. Cook meatballs in batches until browned, about 1 minute per side.\nStir browned meatballs into the shredded pork stew. Simmer, stirring in leftover toasted flour, until meatballs are no longer pink in the center and stew is thick, about 30 minutes.",
    "pt": "40 m",
    "ct": "2 h ",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}