{
    "id": 257763,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups shredded mozzarella cheese",
        "1 1/2 cups shredded Gruyere cheese",
        "1 (8 ounce) package cream cheese, softened",
        "1/2 cup sour cream",
        "1 (1 ounce) package dry French onion soup mix",
        "3/4 teaspoon chopped fresh rosemary (optional)",
        "1 1/2 cups all-purpose flour",
        "4 eggs",
        "2 cups seasoned bread crumbs",
        "1 quart vegetable oil for frying"
    ],
    "nut": [
        "Calories > 313 kcal",
        "Carbs > 21.5 g",
        "Cholesterol > 85 mg",
        "Fat > 19.6 g",
        "Protein > 12.7 g",
        "Sodium > 603 mg"
    ],
    "n": "French Onion Dip Mozzarella Sticks",
    "a": "Julie Hubert",
    "r": "0",
    "s": 16,
    "des": "\"Serve warm, with or without your favorite marinara sauce.\"",
    "ins": "Combine mozzarella cheese, Gruyere cheese, cream cheese, sour cream, onion soup mix, and rosemary in the bowl of a food processor; process until smooth, about 30 seconds.\nLine an 8-inch square baking dish with parchment paper. Spoon cheese mixture into the dish, smoothing with a spatula. Freeze until solid, at least 1 hour.\nPour flour into a shallow dish. Beat 4 eggs in a small bowl. Pour bread crumbs into a separate shallow dish.\nLift the cheese mixture out of the dish and, working quickly, cut in half. Cut into twenty 3/4-inch wide rectangles.\nPress cheese rectangles into flour, tapping to remove excess. Dredge in beaten eggs and press into bread crumbs until evenly coated. Transfer coated cheese mixture to a plate.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nLower coated cheese mixture, 3 or 4 at a time, carefully into the hot oil; fry until cheese sticks are golden brown, about 1 minute. Drain on a paper towel-lined plate.",
    "pt": "25 m",
    "ct": "1 m",
    "tt": "1 h ",
    "i": "4524130.jpg",
    "o": "",
    "st": "allrecipes"
}