{
    "id": 257744,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Toppings:",
        "2 tablespoons olive oil, divided",
        "8 thin slices capicola sausage, chopped",
        "8 thin slices spicy capicola sausage, chopped",
        "1 clove garlic, minced",
        "1 cup sliced shiitake mushrooms",
        "Sauce:",
        "1 tablespoon minced garlic",
        "1/2 teaspoon sesame oil",
        "2 tablespoons soy sauce",
        "1 1/2 tablespoons oyster sauce",
        "1 tablespoon chili-garlic sauce",
        "1 tablespoon water",
        "1 teaspoon white sugar",
        "ground black pepper to taste",
        "1 (12 inch) prepared whole wheat pizza crust",
        "1 (12 ounce) jar giardiniera, drained and chopped into 1/4-inch pieces",
        "1 cup shredded smoked Gouda cheese",
        "1 cup grated Manchego cheese"
    ],
    "nut": [
        "Calories > 515 kcal",
        "Carbs > 29.4 g",
        "Cholesterol > 61 mg",
        "Fat > 34.6 g",
        "Protein > 22.6 g",
        "Sodium > 1638 mg"
    ],
    "n": "Capicola, Shiitake, and Giardiniera Pizza with Smoked Gouda and Manchego",
    "a": "cosgrove911",
    "r": "0",
    "s": 6,
    "des": "\"Try it... you'll like it!\"",
    "ins": "Pour 1 tablespoon olive oil into a skillet, swirling to coat. Cook and stir capicola over medium heat until lightly browned and crisp, 3 to 5 minutes. Stir in garlic clove; remove skillet from heat. Transfer capicola and garlic to a bowl, reserving grease in the skillet.\nPour remaining 1 tablespoon olive oil into the skillet. Cook and stir shiitake mushrooms until tender, about 5 minutes. Remove from heat.\nPreheat oven to 425 degrees F (220 degrees C).\nCombine 1 tablespoon minced garlic and sesame oil in a small saucepan over medium-low heat; cook and stir until fragrant, about 2 minutes. Remove from heat. Stir soy sauce, oyster sauce, chili-garlic sauce, water, sugar, and pepper into the garlic.\nSpread garlic sauce over the pizza crust. Top with capicola, giardiniera, and shiitake mushrooms. Cover capicola and mushrooms with smoked Gouda and Manchego cheeses.\nBake in the preheated oven until crust is golden and cheeses are melted, 8 to 12 minutes.",
    "pt": "30 m",
    "ct": "18 m",
    "tt": "48 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}