{
    "id": 257774,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "1 (15.25 ounce) package chocolate cake mix",
        "1 cup water",
        "3 eggs",
        "1/3 cup vegetable oil",
        "2 (16 ounce) packages chocolate sandwich cookies with cream filling",
        "1 (8 ounce) package cream cheese, softened",
        "1 (3.4 ounce) package instant vanilla pudding mix",
        "1 (3.4 ounce) package instant chocolate pudding mix",
        "3 1/2 cups milk",
        "1 (8 ounce) container frozen whipped topping, thawed",
        "1 (5 ounce) bag gummy worm candies"
    ],
    "nut": [
        "Calories > 1007 kcal",
        "Carbs > 136.7 g",
        "Cholesterol > 87 mg",
        "Fat > 48 g",
        "Protein > 14.2 g",
        "Sodium > 1199 mg"
    ],
    "n": "Garden Dirt Cake",
    "a": "DuhTEEnuh",
    "r": "0",
    "s": 10,
    "des": "\"The first time I had this cake was in the 1st grade when I was learning nursery rhymes. My teacher called it Mary Mary Quite Contrary's Garden. It must be enjoyable for both kids and adults, as I still remember it 16 years later! I've seen 3 other variations of this, but I felt that they needed more substance. This version has layers of chocolate cake to make it almost like a trifle. Add an artificial plant for decoration and serve with a small shovel.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease two 9-inch round cake pans with cooking spray.\nCombine chocolate cake mix, water, eggs, and vegetable oil in a large bowl; beat with an electric mixer until moistened, about 30 seconds. Increase speed to medium and beat batter until smooth, about 2 minutes. Divide batter between the prepared pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 24 to 29 minutes. Cool on a wire rack for 15 minutes. Invert onto the wire rack; cool completely, about 15 minutes. Slice 1 cake into 1/4-inch layers. Reserve second cake for another use.\nPulse chocolate sandwich cookies in a food processor in batches until finely ground.\nCombine cream cheese, vanilla pudding mix, and chocolate pudding mix in a large bowl; beat with an electric mixer until smooth. Beat in milk until evenly blended. Fold in whipped topping with a rubber spatula.\nPour some of the cookie crumbs into the bottom of a 9-inch trifle bowl. Top with a layer of pudding, 1 layer of chocolate cake, and some gummy worms. Repeat layers twice more, ending with remaining cookie crumbs on top.",
    "pt": "30 m",
    "ct": "24 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}