{
    "id": 257705,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 pound bacon, cut crosswise into 1/4-inch pieces",
        "2 (9 ounce) packages refrigerated cheese tortellini",
        "1 cup milk",
        "1 cup mayonnaise",
        "1 (1 ounce) package ranch dressing mix",
        "3 (10 ounce) bags baby spinach",
        "2 cups shredded red cabbage",
        "1 cup cherry tomatoes, or more to taste"
    ],
    "nut": [
        "Calories > 405 kcal",
        "Carbs > 31.9 g",
        "Cholesterol > 41 mg",
        "Fat > 25.9 g",
        "Protein > 13.6 g",
        "Sodium > 767 mg"
    ],
    "n": "Layered Spinach Tortellini Salad",
    "a": "MOOSETRAX75",
    "r": "0",
    "s": 10,
    "des": "\"Not your standard 7-layer salad, this is always a big hit at pitch-ins and my wonderful daughter even requests it for her birthday dinner and other family functions. It has that 'just right' side dish flavor and lightness, while still being a special treat. If you use real bacon bits and bottled dressing, it's even faster to have ready for drop-in guests! Add croutons or fresh Parmesan cheese to top if desired. Store in refrigerator and serve chilled.\"",
    "ins": "Heat a skillet over medium heat; cook and stir bacon until crispy, 7 to 10 minutes. Drain on a paper towel-lined plate.\nBring a large pot of lightly salted water to a boil. Cook tortellini in the boiling water until tender yet firm to the bite, 3  to 4 minutes; drain and run under cold water.\nWhisk milk, mayonnaise, and ranch dressing mix together in a bowl until dressing is smooth.\nPlace a layer of spinach in the bottom of a 9x13-inch baking dish; top with 1 cup cabbage and layer of tortellini, arranging tortellini so they are evenly spaced over the cabbage. Sprinkle half of the bacon over tortellini layer. Drizzle half of the dressing over salad. Continue layering with remaining spinach, cabbage, tortellini, bacon (reserving a few for the end), and ending with cherry tomatoes. Drizzle the remaining dressing over the top. Garnish with a few bacon pieces. Serve chilled.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}