{
    "id": 257759,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "1 3/4 cups crushed chicken-flavored crackers (such as NabiscoÂ® Chicken in a Biscuit)",
        "6 tablespoons melted butter",
        "1 egg white, beaten",
        "Filling:",
        "3/4 pound boneless chicken breast, cut into small pieces",
        "salt and ground black pepper to taste",
        "1 tablespoon olive oil",
        "2 tablespoons butter",
        "1/2 cup chopped shallot",
        "6 ounces cremini mushrooms, thinly sliced",
        "1 tablespoon minced garlic",
        "2 teaspoons finely chopped fresh rosemary",
        "1 cup heavy whipping cream",
        "2 eggs",
        "6 tablespoons grated Parmesan cheese, divided",
        "1/4 cup finely chopped Italian parsley, divided",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 454 kcal",
        "Carbs > 18.3 g",
        "Cholesterol > 145 mg",
        "Fat > 35.1 g",
        "Protein > 16 g",
        "Sodium > 598 mg"
    ],
    "n": "Creamy Chicken and Mushroom Tart with NabiscoÂ® Chicken in a Biscuit Cracker Crust",
    "a": "Julie Hubert",
    "r": "0",
    "s": 8,
    "des": "\"Chicken and mushrooms are baked in a creamy egg filling in a crust made with NabiscoÂ® Chicken in a Biscuit crackers in this decadent tart recipe.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nMix crushed crackers and melted butter together in a bowl; press into the bottom and up the sides of a 9-inch springform pan.\nBake in the preheated oven for 10 minutes. Remove crust from oven and brush egg white onto the crust, to seal. Bake 4 minutes more. Remove from oven and cool to room temperature.\nSeason chicken with salt and pepper.\nHeat olive oil in a heavy large skillet over medium heat; cook and stir chicken just until brown, about 2 minutes per side. Transfer chicken to a plate.\nReduce heat under skillet to medium-low; add 2 tablespoons butter. Cook and stir shallot in the hot butter until beginning to soften, about 2 minutes. Add mushrooms, garlic, rosemary, and 1 pinch salt; cook and stir until mushrooms are tender and juices evaporate, about 8 minutes.\nWhisk cream, eggs, 1/4 cup grated Parmesan cheese, 2 tablespoons parsley, 1/2 teaspoon salt, and 1/2 teaspoon pepper together in a bowl.\nPlace baked crust on a baking sheet; top with chicken and mushrooms. Pour egg mixture over top. Sprinkle remaining 2 tablespoons Parmesan cheese over the top.\nBake in the preheated oven until top is lightly golden and middle is set, 30 to 35 minutes. Let tart rest for 10 minutes. Remove outer ring. Top tart with 2 tablespoons remaining parsley.",
    "pt": "30 m",
    "ct": "58 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}