{
    "id": 257859,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup rum",
        "1/2 cup raisins",
        "1/4 cup brown sugar",
        "2 cups semolina flour",
        "3 cups water",
        "2 1/2 cups unsweetened coconut cream",
        "2 cups white sugar",
        "1/2 cup corn oil",
        "2 eggs, beaten",
        "1/2 teaspoon salt",
        "2 tablespoons honey, or to taste (optional)",
        "2 tablespoons white poppy seeds (optional)"
    ],
    "nut": [
        "Calories > 580 kcal",
        "Carbs > 59.1 g",
        "Cholesterol > 37 mg",
        "Fat > 33.6 g",
        "Protein > 4 g",
        "Sodium > 138 mg"
    ],
    "n": "Burmese Semolina Cake with Rum Raisins (Shwe Gye)",
    "a": "Calvin Lam",
    "r": "0",
    "s": 10,
    "des": "\"One of my favorite things growing up was a Burmese semolina cake. It is known by a few names: san win ma kin or shwe gye may be the most familiar ones. I didn't have a major sweet tooth growing up, but this dessert was something I couldn't resist. When I was a kid, my mother would make me stir the mixture for an hour (it kept me out of trouble and from making a mess running around the house).\"",
    "ins": "Combine rum, raisins, and brown sugar in a small saucepan over low heat. Cook, stirring occasionally, until raisins absorb rum, about 10 minutes.\nToast semolina in a dry saucepan over medium heat, stirring frequently, until fragrant, about 2 minutes. Add water, coconut cream, sugar, oil, eggs, and salt; cook and stir until mixture thickens, 8 to 10 minutes. Reduce heat and stir in raisin mixture. Cook and stir until mixture pulls away from the sides of the pan, 5 minutes to 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 9-inch baking dish.\nScrape semolina mixture into the prepared baking dish; smooth the top.\nBake in the preheated oven until top is golden brown, about 1 hour. Garnish with a drizzle of honey and poppy seeds.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}