{
    "id": 257834,
    "old_rating": "1",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Cookies:",
        "1/2 cup unsalted butter, softened",
        "1/4 cup Pyure Organic All Purpose Stevia Blend",
        "1 egg",
        "1 teaspoon vanilla extract",
        "1 1/4 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon salt",
        "Icing:",
        "1/2 cup cornstarch",
        "3 tablespoons Pyure Organic All Purpose Stevia Blend",
        "2 tablespoons unsalted butter, softened",
        "1/4 cup milk, or as needed",
        "1 teaspoon vanilla extract",
        "Food coloring (optional)"
    ],
    "nut": [
        "Calories > 82 kcal",
        "Carbs > 7.6 g",
        "Cholesterol > 21 mg",
        "Fat > 5.1 g",
        "Protein > 1.1 g",
        "Sodium > 39 mg"
    ],
    "n": "Sugar-Free \"Sugar\" Cookies with Sugar-Free \"Sugar\" Icing",
    "a": "Pyure",
    "r": "0",
    "s": 24,
    "des": "\"These cookies don't have to be a guilty pleasure!\"",
    "ins": "Beat butter with Pyure Organic All Purpose Stevia Blend until light and fluffy.\nBeat in egg until well blended. Beat in vanilla.\nWhisk flour, baking powder and salt together. Stir into butter mixture in two additions.\nWrap dough in plastic wrap and refrigerate for 30 minutes.\nRoll on lightly floured surface or between sheets of waxed paper to 1/4-inch thick.\nUsing desired cookie cutter, cut out desired shapes.\nPreheat oven to 350 degrees F. Place cookies 2-inches apart on parchment paper lined baking sheets. Bake for 10 to 12 minutes or until golden. Let cool on racks.\nGlaze cookies with Pyure Sugar Free Cookie Icing.\nIcing Directions: Beat cornstarch, Pyure Organic All Purpose Stevia Blend and butter with a mixer on medium-high speed until well combined.\nGradually add milk and vanilla until smooth. Add more milk if icing mixture is too dry.\nIf adding food coloring, add a drop at a time until desired color is reached.\nRefrigerate icing for 10 minutes until set.\nSpread or pipe over cooled Sugar Free \"Sugar\" Cookies. Use day of.",
    "pt": "15 m",
    "ct": "10 m",
    "tt": "55 m",
    "i": "4528416.jpg",
    "o": "",
    "st": "allrecipes"
}