{
    "id": 257898,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (8 ounce) package quinoa pasta",
        "2 tablespoons extra-virgin olive oil",
        "1 eggplant - peeled, sliced 3/4-inch thick, and diced",
        "2 small zucchini, sliced 1/2-inch thick",
        "1 1/4 cups tomato sauce, divided",
        "1/4 teaspoon garlic salt (optional)",
        "1/4 teaspoon dried oregano (optional)",
        "3/4 cup sliced fresh mushrooms (optional)",
        "1/2 small onion, diced (optional)",
        "1 small tomato, diced (optional)"
    ],
    "nut": [
        "Calories > 342 kcal",
        "Carbs > 58.7 g",
        "Cholesterol > 0 mg",
        "Fat > 8.4 g",
        "Protein > 9.9 g",
        "Sodium > 525 mg"
    ],
    "n": "Eggplant Marinara Veggie Sauce",
    "a": "WildVine",
    "r": "0",
    "s": 4,
    "des": "\"This gluten-free, dairy-free recipe is a great way to eat pasta and get your vegetables too. Change up some of the optional ingredients or add meat for other delicious variations.  Great way to use up vegetables before they go bad in your fridge. This recipe is very forgiving and hard to screw up. The amounts are just a guesstimate and do not have to be exact. I encourage you to play, eat, and enjoy!\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook pasta in the boiling water, stirring occasionally until tender yet firm to the bite, 6 to 9 minutes. Drain.\nHeat olive oil in a pot over medium-high heat. Cook and stir eggplant and zucchini in the hot oil until browned, about 5 minutes. Stir in 1/2 cup tomato sauce. Season with garlic salt and oregano. Cover and simmer until flavors combine, about 5 minutes.\nStir mushrooms and onion into the pot; cover and cook for 5 minutes. Add remaining tomato sauce and diced tomato. Cover and simmer until tomato begins to break down, about 5 minutes. Reduce heat to medium-low; simmer, stirring occasionally, until eggplant and zucchini soft, about 7 minutes.\nServe sauce over quinoa pasta.",
    "pt": "20 m",
    "ct": "38 m",
    "tt": "58 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}