{
    "id": 257827,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 cups water",
        "2 1/2 cups quinoa",
        "1 tablespoon olive oil",
        "2 onions, chopped",
        "salt to taste",
        "2 large sweet potatoes",
        "4 eggs",
        "1/2 cup tahini",
        "1/2 cup kefir",
        "1/2 cup ground flax seeds",
        "1/2 cup grated Parmesan cheese, or more to taste",
        "1/4 cup sesame seeds",
        "1/4 cup sunflower seeds",
        "1/4 cup coarsely chopped pumpkin seeds, or more to taste",
        "1 tablespoon soy sauce",
        "1 tablespoon all-purpose vegetable seasoning",
        "1 tablespoon raw apple cider vinegar (such as BraggÂ®)",
        "salt and ground black pepper to taste",
        "3/4 cup frozen corn kernels, thawed",
        "1/2 cup spelt flour, or more as needed",
        "2 tablespoons butter",
        "24 thin slices Cheddar cheese"
    ],
    "nut": [
        "Calories > 279 kcal",
        "Carbs > 27 g",
        "Cholesterol > 50 mg",
        "Fat > 14.7 g",
        "Protein > 11.6 g",
        "Sodium > 245 mg"
    ],
    "n": "Nothing I'd Rather Eat Quinoa Patties",
    "a": "JKW",
    "r": "0",
    "s": 24,
    "des": "\"What a treat! You will never miss hamburger meat again. This is real food that you can feel good about and that tastes so delicious and in addition is packed with the healthiest ingredients. These burgers do not need a bun so you will save some calories there.  I made this in my quest to satisfy my Chase and her difficult palate and it is a winner. Keep the batter ready to go in your refrigerator.\"",
    "ins": "Bring water and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is soft, 15 to 20 minutes.\nHeat olive oil in a large skillet over medium heat. Add onions and salt; cook and stir until tender, 5 to 8 minutes.\nPlace sweet potatoes on a microwave-safe plate; prick all over with a fork. Cook on high, turning once, until tender, 8 to 10 minutes. Cool until easily handled, about 5 minutes.\nPeel sweet potatoes and place flesh in a bowl. Add eggs, tahini, kefir, flax seeds, Parmesan cheese, sesame seeds, sunflower seeds, pumpkin seeds, soy sauce, vegetable seasoning, vinegar, salt, and pepper; beat with an electric mixer until well blended. Stir in quinoa, onions, and corn.\nStir enough spelt flour into the sweet potato mixture until it barely holds together.\nMelt 1/4 teaspoon butter on a griddle over medium heat. Spoon a burger-sized patty onto the hot griddle and cook until browned, about 4 minutes. Flip; add 1 slice Cheddar cheese. Cover patty with a frying pan and cook until cheese is melted, about 4 minutes more. Repeat with remaining butter, sweet potato mixture, and Cheddar cheese.",
    "pt": "20 m",
    "ct": "41 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}