{
    "id": 257883,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter, softened",
        "3/4 cup tightly packed dark brown sugar",
        "1/2 cup white sugar",
        "2 eggs",
        "1 tablespoon molasses",
        "1 1/2 teaspoons vanilla extract",
        "1 1/2 cups all-purpose flour",
        "1 teaspoon ground cinnamon",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 1/2 cups rolled oats",
        "1 cup cinnamon chips (such as Hershey'sÂ®)",
        "Filling:",
        "2 cups confectioners' sugar",
        "1/2 cup butter, softened",
        "1 tablespoon heavy whipping cream, or more as needed",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 481 kcal",
        "Carbs > 60.8 g",
        "Cholesterol > 76 mg",
        "Fat > 24.9 g",
        "Protein > 4.7 g",
        "Sodium > 343 mg"
    ],
    "n": "Irresistible Oatmeal Cream Pies",
    "a": "SavedByGrace",
    "r": "0",
    "s": 15,
    "des": "\"These cookie sandwiches are absolutely delicious and irresistible! My husband took one bite and exclaimed that these were his new favorite dessert. The secret ingredient is Hershey'sÂ® cinnamon chips!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nCombine 1 cup butter, brown sugar, white sugar, eggs, molasses, and 1 1/2 teaspoon vanilla extract in a large bowl; beat with an electric mixer until creamy.\nMix flour, cinnamon, baking soda, and salt together in a separate bowl. Stir into the creamed butter mixture. Mix in oats until evenly incorporated. Fold cinnamon chips into the dough.\nDrop tablespoonfuls of dough onto ungreased baking sheets.\nBake in the preheated oven until edges start to brown, 10 to 12 minutes. Transfer to wire racks to cool.\nCombine confectioners' sugar, 1/2 cup butter, heavy cream, and 1 teaspoon vanilla extract in the bowl of a stand mixer. Beat on high speed until light and fluffy, 2 to 3 minutes.\nSpread 1 teaspoon of the cream filling over the back of half of the cookies; top with remaining cookies.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}