{
    "id": 257895,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 cup confectioners' sugar, divided",
        "1 1/4 cups water, divided",
        "2 tablespoons agar agar powder",
        "2 egg whites",
        "2 cups white sugar",
        "1 tablespoon light corn syrup",
        "1 1/2 teaspoons vanilla extract"
    ],
    "nut": [
        "Calories > 108 kcal",
        "Carbs > 27.3 g",
        "Cholesterol > 0 mg",
        "Fat > 0 g",
        "Protein > 0.4 g",
        "Sodium > 7 mg"
    ],
    "n": "Nicole's Vegetarian Marshmallows",
    "a": "Nicole",
    "r": "0",
    "s": 20,
    "des": "\"Finally a vegetarian marshmallow recipe that works! These marshmallows are great for s'mores, hot cocoa, dipping in chocolate... anything you can dream up!\"",
    "ins": "Lightly oil a 9-inch square baking dish with cooking spray. Dust generously with 1/2 cup confectioners' sugar.\nBring 1/2 cup water to a boil in a small saucepan. Remove from heat and stir in agar agar; let soak until dissolved, 10 to 15 minutes.\nBeat egg whites in a stand mixer fitted with the whisk attachment until soft peaks form.\nCombine remaining 3/4 cup water, white sugar, and corn syrup in a small saucepan. Cook over medium-high heat until mixture registers 250 to 265 degrees F (121 to 129 degrees C) on a candy thermometer or until a small amount of syrup dropped into cold water forms a rigid ball. Remove from heat; stir agar agar mixture into the hot syrup.\nTurn stand mixer on to continue beating egg whites. Pour hot syrup in a thin stream down the side of the bowl, beating until egg whites are very stiff. Stir in vanilla extract.\nSpread marshmallow mixture evenly in the prepared pan. Dust with remaining 1/2 cup confectioner's sugar. Let stand until set, 8 hours to overnight.\nDip a sharp knife in very hot water and wipe off; slice marshmallow mixture into 2-inch pieces.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "8 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}