{
    "id": 257902,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon diced garlic",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon ground coriander",
        "1/4 teaspoon ground allspice",
        "1 pound ground lamb",
        "1 egg",
        "2 teaspoons water",
        "2 (10x15-inch) sheets of frozen puff pastry, thawed",
        "1/2 cup tzatziki sauce"
    ],
    "nut": [
        "Calories > 375 kcal",
        "Carbs > 23 g",
        "Cholesterol > 49 mg",
        "Fat > 35 g",
        "Protein > 12.4 g",
        "Sodium > 279 mg"
    ],
    "n": "Lamb Puff Pastry Bite Appetizer",
    "a": "The Flying Shepard",
    "r": "0",
    "s": 10,
    "des": "\"Bring lamb to your next holiday meal! This is a quick and easy way to impress your family with a delicious appetizer. This recipe is best if domestic lamb is used, as it is much more mild and flavorful than imported lamb. The spices are the typical spices used in Mediterranean cooking of lamb.\"",
    "ins": "Mix garlic, salt, pepper, cumin, coriander, and allspice together in a bowl; add lamb. Form lamb mixture into 10-inch logs the thickness of hot dogs.\nWhisk egg and water together in a small bowl to make egg wash.\nLay puff pastry sheets on a lightly floured work surface; roll gently to smooth the creases. Slice pastry into 10x4-inch strips. Brush egg wash over pastry. Place 1 lamb log on each strip of pastry; wrap dough around lamb and pinch edges to seal. Wrap in plastic wrap and chill for 1 hour.\nPreheat oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper.\nRemove plastic wrap and slice each piece of pastry into 8 pieces with a sharp knife. Arrange in a single layer on the lined baking sheet. Brush each piece with egg wash.\nBake in the preheated oven until golden brown, about 20 minutes. Serve with tzatziki sauce.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}