{
    "id": 25799,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup butter, softened",
        "1/2 cup superfine sugar",
        "1 grated zest of one orange",
        "1/2 cup corn oil",
        "2 1/2 cups all-purpose flour",
        "1 1/2 cups semolina",
        "4 teaspoons baking powder",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground cloves",
        "1/2 cup orange juice",
        "1 cup water",
        "1 cup white sugar",
        "1/2 cup honey",
        "1 cinnamon stick",
        "2 teaspoons lemon juice",
        "1/2 cup finely chopped walnuts"
    ],
    "nut": [
        "Calories > 100 kcal",
        "Carbs > 14.9 g",
        "Cholesterol > 4 mg",
        "Fat > 4.1 g",
        "Protein > 1.3 g",
        "Sodium > 35 mg"
    ],
    "n": "Finikia",
    "a": "DIANALYNN",
    "r": "0",
    "s": 60,
    "des": "\"Delicious Greek pastries...probably one of my favorites because of the orange and cinnamon combination.  Worth the time they take!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the butter, superfine sugar and orange zest. Gradually mix in the oil and beat until light and fluffy. Combine the flour, semolina, baking powder, cinnamon and cloves; beat into the fluffy mixture alternately with the orange juice. As the mixture thickens, turn out onto a floured board and knead into a firm dough. Pinch off tablespoonfuls of dough and form them into balls or ovals. Place cookies 2 inches apart onto the prepared cookie sheets.\nBake for 25 minutes in the preheated oven, or until golden. Cool on baking sheets until room temperature.\nTo make the syrup: In a medium saucepan, over medium heat, combine the water, white sugar, honey, cinnamon stick and lemon juice. Bring to a boil and boil for 10 minutes. Remove the cinnamon stick. While the mixture is boiling hot, dip the cookies in one at a time, making sure to cover them completely. Place them on a wire rack to dry and sprinkle with walnuts. Place paper under the rack to catch the drips. Keep finished cookies in a sealed container at room temperature.",
    "pt": "45 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "1830928.jpg",
    "o": "",
    "st": "allrecipes"
}