{
    "id": 257984,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "2 1/2 cups all-purpose flour",
        "1/4 teaspoon salt",
        "1 egg",
        "2 teaspoons vanilla extract",
        "1 cup butter, softened",
        "1/2 cup white sugar",
        "3 tablespoons confectioners' sugar",
        "Icing:",
        "1 (8 ounce) package cream cheese, softened",
        "1/4 cup confectioners' sugar",
        "1 tablespoon vanilla extract",
        "Topping:",
        "3 very firm Bartlett pears, cored and sliced 1/8-inch thick",
        "5 tablespoons brown sugar, divided",
        "1/4 cup dry red wine",
        "2 teaspoons ground cinnamon",
        "1 teaspoon ground ginger",
        "1 pinch freshly grated nutmeg"
    ],
    "nut": [
        "Calories > 612 kcal",
        "Carbs > 68.9 g",
        "Cholesterol > 115 mg",
        "Fat > 33.9 g",
        "Protein > 7.5 g",
        "Sodium > 332 mg"
    ],
    "n": "Poached Pear Pizza",
    "a": "Mandy Kay",
    "r": "0",
    "s": 8,
    "des": "\"A yummy way to enjoy poached pears at a potluck or picnic!\"",
    "ins": "Sift flour and salt together together in a bowl.\nWhisk egg and 2 teaspoons vanilla extract together in a small bowl.\nCombine butter, white sugar, and 3 tablespoons confectioners' sugar in a large bowl; beat with an electric mixer until fluffy. Beat in egg mixture. Add flour and salt gradually, beating until dough comes together.\nTurn dough out on a large piece of plastic wrap; wrap and chill until firm, at least 2 hours.\nPreheat oven to 350 degrees F (175 degrees C). Line a rimmed baking sheet with parchment paper; spread dough in an even layer on top.\nBake in the preheated oven until center is firm and edges are golden, 10 to 15 minutes. Let cool completely.\nWhisk cream cheese, 1/4 confectioners' sugar, and 1 tablespoon vanilla extract in a bowl until smooth. Spread icing over the cooled crust.\nCover icing with sliced pears, overlapping slices slightly.\nCombine 3 tablespoons brown sugar and red wine in a small saucepan over low heat; stir until brown sugar is dissolved, 3 to 5 minutes. Add cinnamon and ginger. Bring to a boil; reduce heat and simmer until reduced to a syrup, 3 to 5 minutes.\nCoat pear slices with syrup using a pastry brush. Sprinkle remaining 2 tablespoons brown sugar on top.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nBroil pizza until brown sugar melts and browns, about 3 minutes. Grate fresh nutmeg over pizza; cut into squares.",
    "pt": "30 m",
    "ct": "24 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}