{
    "id": 257954,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 whole fish, scaled and cleaned, or more to taste",
        "1 lemon, juiced",
        "8 cups water",
        "4 green bananas, chopped",
        "1 pound pumpkin, cut into 1-inch pieces, or more to taste",
        "2 potatoes, chopped",
        "2 ears corn, cut into 1-inch pieces",
        "4 ounces carrots, cut into 1/2-inch pieces",
        "1/2 cup chopped okra",
        "4 scallions, chopped",
        "1 hot chile pepper",
        "2 cloves garlic, chopped",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "4 sprigs fresh thyme, leaves stripped"
    ],
    "nut": [
        "Calories > 203 kcal",
        "Carbs > 35 g",
        "Cholesterol > 26 mg",
        "Fat > 3.3 g",
        "Protein > 11.6 g",
        "Sodium > 338 mg"
    ],
    "n": "Caribbean Fish Soup",
    "a": "Toney P",
    "r": "0",
    "s": 8,
    "des": "\"Not just a healthy soup, it's very tasty too. I always loved this soup while growing up in the Caribbean. To my surprise it turned out to be a good warm-up drink too. Long story short, as I waited for a bus on a very cold and windy winter evening in NYC, I noticed a West Indian restaurant across the street. I ran in to get a cup of coffee or tea. The last thing on my mind was a bowl of soup. They were about to close and the only thing they had was fish soup. I took a small cup and went back to the bus stop. It warmed me up so much and reached such a good place inside me that I ran back for more.\"",
    "ins": "Rinse fish with lemon juice; drain.\nBring water to a boil in a large bowl. Add fish; simmer until soft, about 30 minutes. Strain fish, reserving broth. Let fish cool. Remove bones, trying to keep large pieces of fish intact.\nBring broth to a boil. Add green bananas, pumpkin, potatoes, corn, carrots, okra, scallions, chile pepper, garlic, salt, pepper, and thyme. Bring back to a boil. Reduce heat to low; simmer until potatoes are almost tender, about 10 minutes. Stir in fish. Simmer until flavors combine, about 5 minutes more.\nRemove soup from heat and let stand before serving, about 30 minutes. Discard chile pepper.",
    "pt": "35 m",
    "ct": "1 h",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}