{
    "id": 258029,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon vanilla extract",
        "1 tablespoon instant espresso powder (optional)",
        "2 1/2 cups all-purpose flour",
        "3/4 cup unsweetened cocoa powder",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1 cup mini chocolate chips",
        "1 cup white sugar",
        "3 eggs",
        "1/2 cup vegetable oil"
    ],
    "nut": [
        "Calories > 103 kcal",
        "Carbs > 14.7 g",
        "Cholesterol > 14 mg",
        "Fat > 4.7 g",
        "Protein > 1.8 g",
        "Sodium > 61 mg"
    ],
    "n": "Sinful Chocolate Biscotti",
    "a": "Chef V",
    "r": "0",
    "s": 40,
    "des": "\"A brownie-like biscotti that tastes great with a cup of coffee. Drizzle with more chocolate if desired. Especially popular in the winter time when coffee and chocolate taste so much better. Enjoy!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line 2 baking sheets with parchment paper.\nCombine vanilla extract and espresso powder in a small bowl; mix until espresso powder is dissolved.\nSift flour, cocoa powder, baking powder, and salt into a bowl; mix in chocolate chips.\nWhisk vanilla mixture, sugar, eggs, and oil together in a large bowl. Add flour mixture; stir, by hand if needed, until dough comes together and is thick and stiff.\nDivide dough into 2 equal pieces and place onto the baking sheets. Shape each piece into a log as long as the baking sheet; press down with wet hands to about 1/2 inch thickness.\nBake in the preheated oven until firm, about 25 minutes. Remove from oven and cool until easily handled, about 5 minutes.\nMove cooled logs to a cutting board and slice into 1/2-inch long slices with a serrated knife. Return the slices to the baking sheets, placing them on their sides.\nBake until dry, about 6 minutes per side. Remove from oven and let cool until hardened on wire racks.",
    "pt": "30 m",
    "ct": "37 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}