{
    "id": 258058,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 slices bacon, or more to taste",
        "1 cup cassava flour (such as Otto's)",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/4 cup butter, at room temperature",
        "2 tablespoons coconut sugar",
        "3/4 cup coconut milk, at room temperature",
        "1/4 cup maple syrup, at room temperature",
        "1 egg, at room temperature",
        "1/2 teaspoon vanilla extract",
        "Topping:",
        "6 tablespoons almond butter, at room temperature",
        "3 tablespoons maple syrup, at room temperature",
        "2 tablespoons coconut milk, at room temperature (optional)"
    ],
    "nut": [
        "Calories > 205 kcal",
        "Carbs > 22.2 g",
        "Cholesterol > 24 mg",
        "Fat > 12.5 g",
        "Protein > 2.8 g",
        "Sodium > 188 mg"
    ],
    "n": "Paleo Maple Bacon Mini Donuts",
    "a": "Back Porch Paleo",
    "r": "0",
    "s": 13,
    "des": "\"A tasty duo of maple and bacon wrapped up into mini paleo bites of happiness. Top donuts with more chopped bacon!\"",
    "ins": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels, reserving bacon drippings in the skillet. Chop bacon.\nWhisk cassava flour, baking powder, and salt together in a bowl.\nBeat butter and coconut sugar together in a bowl using an electric mixer until fluffy. Add 3/4 cup coconut milk, 1/4 cup maple syrup, and egg; beat until well combined. Mix flour mixture into butter mixture until batter is smooth. Add bacon drippings, 1 tablespoon at a time, if batter is too thick. Mix chopped bacon into batter.\nPreheat donut maker according to manufacturer's instructions.\nTransfer batter to a clear plastic bag and snip off a corner; fill donut maker with batter according to manufacturer's instructions. Cook for 4 to 5 minutes. Transfer donuts to a wire rack to cool, about 15 minutes.\nMix almond butter, 3 tablespoons maple syrup, and 2 tablespoons coconut milk together in a bowl until very smooth. Dip cooled donuts into almond butter topping.",
    "pt": "20 m",
    "ct": "14 m",
    "tt": "49 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}