{
    "id": 258004,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (12 ounce) box BarillaÂ® Gluten Free Rotini",
        "1/2 cup dried cranberries",
        "1/2 cup hot water",
        "1 bunch green onions",
        "7 tablespoons extra-virgin olive oil, divided",
        "salt and black pepper to taste",
        "1/4 cup cashews",
        "1/4 cup grated Parmigiano-Reggiano cheese",
        "3 ice cubes"
    ],
    "nut": [
        "Calories > 502 kcal",
        "Carbs > 92.7 g",
        "Cholesterol > 3 mg",
        "Fat > 10.9 g",
        "Protein > 9.4 g",
        "Sodium > 120 mg"
    ],
    "n": "BarillaÂ® Gluten Free Rotini with Charred Green Onion Pesto, Cashews, and Cranberries",
    "a": "Barilla Canada",
    "r": "0",
    "s": 6,
    "des": "\"Charred green onion pesto with cashews and cranberries is tossed with gluten free rotini pasta for a quick and easy dinner.\"",
    "ins": "Pre-heat the oven to 425 degrees F (215 C). Reconstitute cranberries in 1/2 cup hot water.\nBring a large pot of water to a boil; add salt.\nToss green onions with 1 tablespoon of olive oil in a large skillet over medium heat, season with salt and black pepper. Place green onions on a sheet tray and roast in the oven until lightly charred, about 10 minutes.\nRemove green onions from the oven and let them cool down.\nCombine green onions, cashews and Parmigiano-Reggiano cheese in a blender, pulse for 5 seconds. Drizzle in the remaining olive oil and season with salt and black pepper to taste. Add ice cubes and puree to make pesto.\nRemove pesto from the blender and place it in a large bowl.\nCook pasta according to the package directions. Drain pasta and reserve 1/2 cup pasta cooking liquid.\nAdd pasta cooking liquid, pasta and drained cranberries to the pesto, stir to combine before serving.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "35 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}