{
    "id": 258074,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds beef oxtail, cut into pieces",
        "4 quarts water, divided",
        "4 ounces daikon radish, peeled and cut into 2-inch cubes",
        "6 green onions, green and white parts chopped and separated",
        "3 tablespoons milk",
        "10 cloves garlic",
        "4 teaspoons sea salt",
        "4 teaspoons ground black pepper"
    ],
    "nut": [
        "Calories > 310 kcal",
        "Carbs > 7.2 g",
        "Cholesterol > 126 mg",
        "Fat > 15.6 g",
        "Protein > 36.3 g",
        "Sodium > 2020 mg"
    ],
    "n": "Kkori Gomtang (Oxtail Soup)",
    "a": "Ann Lee",
    "r": "0",
    "s": 4,
    "des": "\"This is a simple oxtail soup requiring you to cook the oxtail first in a pressure cooker and then again with some simple seasonings. The broth will come out with a milky consistency.\"",
    "ins": "Soak oxtail in cold water to remove blood, about 2 hours. Drain. Trim fat off the oxtail.\nPlace oxtail in a pressure cooker; add 2 cups water. Cover and cook over medium heat according to manufacturer's instructions for 30 minutes. Add 8 cups water and cook for 1 hour more. Remove from heat; release pressure according to manufacturer's instructions. Let cool, about 30 minutes.\nTransfer oxtail to a container using a slotted spoon. Pour broth into a separate container. Cover and refrigerate, 8 hours to overnight.\nDiscard layer of fat that formed over the surface of the oxtail and broth.\nCombine oxtail and broth in a large pot. Add remaining 6 cups water, daikon, white parts of the green onions, milk, and garlic. Cook over medium heat, skimming foam occasionally off the top, until garlic is soft, about 1 hour. Reduce heat to low; cook for 30 minutes more.\nRemove daikon and white parts of the greens from the soup with a slotted spoon; discard. Garnish soup with green parts of the green onions. Season individual bowls with 1 teaspoon salt and 1 teaspoon black pepper.",
    "pt": "20 m",
    "ct": "3 h",
    "tt": "13 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}