{
    "id": 258063,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup uncooked white rice",
        "5 dried shiitake mushrooms",
        "8 cups water, divided, or as needed",
        "1 leftover turkey carcass",
        "1 teaspoon soy sauce, or more to taste",
        "1 cup boiling water",
        "4 cloves garlic, peeled",
        "1 piece Chinese salted turnip",
        "2 slices fresh ginger root",
        "16 ounces flat dried bean curd",
        "1 pinch salt and ground black pepper to taste",
        "1/4 cup shelled raw peanuts"
    ],
    "nut": [
        "Calories > 2469 kcal",
        "Carbs > 59.8 g",
        "Cholesterol > 508 mg",
        "Fat > 191.2 g",
        "Protein > 127.5 g",
        "Sodium > 330 mg"
    ],
    "n": "Chinese Porridge (Congee or Jook)",
    "a": "Sammye R",
    "r": "0",
    "s": 6,
    "des": "\"What can you do with all those turkey bones left over from your Thanksgiving or Christmas dinner? Chinese congee or jook (Cantonese) is an excellent dish to make with those bones and leftover meat. Scrumptious and delicious meal for breakfast or lunch. Serve with chopped green onions and a deep-fried breadstick or donut (can be purchased frozen or get it from the deli at the Asian market where they sell dim sum).\"",
    "ins": "Place rice into a container and cover with several inches of cool water; let soak 8 hours to overnight. Drain.\nSoak dried mushrooms in a bowl of warm water until soft, about 20 minutes. Drain and slice into strips.\nBring 4 cups water and drained rice to a boil in a pot. Cook until rice breaks down into a thick and mushy consistency, about 45 minutes. Transfer to a slow cooker.\nBring 4 cups water and turkey carcass to a boil in a large pot. Simmer until broth forms, about 45 minutes. Skim fat from the surface of the broth.\nStrain turkey broth into the slow cooker. Pull meat off the carcass and shred; transfer to a bowl. Mix in soy sauce. Discard turkey bones.\nStir mushrooms, 1 cup boiling water, garlic, salted turnip, and ginger into the slow cooker. Cover and cook on Low for 4 to 5 hours.\nSoak dried bean curd in a bowl of warm water until soft, about 10 minutes. Drain and rinse with running water. Break up bean curd into bite-sized pieces.\nStir bean curd pieces into the slow cooker. Cook on High for 10 minutes. Season with salt and pepper.\nSpoon congee into individual bowls. Top with 2 tablespoons of turkey meat and peanuts.",
    "pt": "15 m",
    "ct": "5 h ",
    "tt": "14 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}