{
    "id": 258064,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 cups water",
        "2 cups uncooked white rice",
        "3 tablespoons vegetable oil",
        "1 whole head garlic, minced",
        "1 tablespoon sliced ginger",
        "2 tablespoons sliced onion",
        "2 skinless, boneless chicken breasts, cut into cubes",
        "1 tablespoon fish sauce, or to taste",
        "ground black pepper to taste",
        "1 teaspoon annatto powder",
        "2 hard-boiled eggs, peeled, or to taste",
        "2 tablespoons chopped spring onions, or to taste"
    ],
    "nut": [
        "Calories > 552 kcal",
        "Carbs > 80.2 g",
        "Cholesterol > 135 mg",
        "Fat > 14.8 g",
        "Protein > 22 g",
        "Sodium > 348 mg"
    ],
    "n": "Filipino-Style Congee (Lugaw)",
    "a": "mythloaf",
    "r": "0",
    "s": 4,
    "des": "\"This one's for you. Filipinos' all-time favorite food.\"",
    "ins": "Bring water and rice to a boil in a large pot. Cook, stirring constantly, until rice is soft, about 25 minutes.\nHeat vegetable oil in a saucepan over medium heat. Cook and stir garlic in the hot oil until golden brown, 5 minutes. Transfer half of the garlic to a small bowl.\nStir ginger into the garlic remaining in the saucepan; cook and stir until fragrant, about 1 minute. Add onion; cook and stir until softened, about 5 minutes. Add chicken; season with fish sauce and pepper. Cook and stir until chicken is no longer pink in the center, about 5 minutes.\nStir chicken mixture into the rice. Dust annatto powder over rice using a strainer; stir until dissolved. Add hard-boiled eggs. Simmer on low, stirring constantly, until rice reaches a porridge-like consistency, about 5 minutes. Remove from heat and stir in spring onions.\nGarnish bowls of congee with reserved fried garlic.",
    "pt": "25 m",
    "ct": "51 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}