{
    "id": 258083,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 3/4 cups vegetable broth",
        "3 1/2 tablespoons hot water",
        "1 pinch saffron threads",
        "2 tablespoons extra-virgin olive oil",
        "1/2 onion, thinly sliced",
        "10 1/2 ounces Arborio rice",
        "1/2 cup white wine",
        "1/2 cup grated Parmesan cheese",
        "2 tablespoons grated Parmesan cheese",
        "1 3/4 ounces pancetta, cubed",
        "2 tablespoons butter"
    ],
    "nut": [
        "Calories > 510 kcal",
        "Carbs > 67.2 g",
        "Cholesterol > 31 mg",
        "Fat > 18.1 g",
        "Protein > 12.4 g",
        "Sodium > 644 mg"
    ],
    "n": "Risotto con Zafferano e Pancetta in Pentola a Pressione (Saffron and Pancetta Risotto)",
    "a": "miche",
    "r": "0",
    "s": 4,
    "des": "\"Fragrant, flavorful saffron is the perfect ingredient for a simple, yet tasty risotto. You can prepare this recipe in no time using a pressure cooker, or choose to make it the traditional way in a regular pot.\"",
    "ins": "Pour vegetable stock into a saucepan over low heat. Cover and keep warm.\nCombine hot water and saffron threads in a small bowl.\nHeat 2 tablespoons oil in a stovetop pressure cooker. Cook and stir onion until softened, 3 to 5 minutes. Add Arborio rice; cook and stir until toasted and coated with oil, 2 to 3 minutes. Increase heat and pour in wine; simmer until alcohol has evaporated and rice has absorbed wine, about 2 minutes.\nStir vegetable stock and saffron mixture into the pressure cooker. Seal according to manufacturer's instructions. Increase heat to high; cook until cooker whistles, about 5 minutes. Reduce heat to low and cook for 4 minutes.\nRemove cooker from heat and release pressure according to manufacturer's instructions. Remove the lid. Stir in 1/2 cup plus 2 tablespoons Parmesan cheese, pancetta, and butter. Let stand until rice absorbs remaining stock and Parmesan cheese melts, 2 to 3 minutes.",
    "pt": "15 m",
    "ct": "16 m",
    "tt": "33 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}