{
    "id": 258055,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Stuffed Chicken:",
        "6 skinless, boneless chicken breasts",
        "2 cloves garlic, diced",
        "salt and freshly ground pepper to taste",
        "1 pinch dried thyme",
        "1 pinch dried basil",
        "1 pinch dried parsley",
        "1 bunch fresh spinach",
        "6 slices fontina cheese",
        "6 thin slices prosciutto",
        "2 eggs",
        "2 cups seasoned bread crumbs, or as needed",
        "3 tablespoons olive oil, divided, or to taste",
        "1/4 cup grated Parmigiano-Reggiano cheese, or to taste",
        "Marsala Sauce:",
        "2 cloves garlic, diced",
        "1 (10 ounce) package sliced fresh mushrooms",
        "1/2 cup Marsala wine",
        "2 cups chicken stock",
        "1 tablespoon butter",
        "1 tablespoon all-purpose flour"
    ],
    "nut": [
        "Calories > 604 kcal",
        "Carbs > 36.8 g",
        "Cholesterol > 177 mg",
        "Fat > 28 g",
        "Protein > 45.8 g",
        "Sodium > 1519 mg"
    ],
    "n": "Crisp Stuffed Chicken in Marsala Sauce",
    "a": "RoRoCo",
    "r": "0",
    "s": 6,
    "des": "\"I love chicken Marsala sauce, but I am not a fan of the soggy chicken that usually goes along with it. This recipe is my interpretation of chicken Marsala. One taste and you will never go back to the Old World version. Serve over bow-tie pasta or canned white potatoes.\"",
    "ins": "Place chicken breasts between 2 sheets of waxed paper. Pound lightly with the smooth side of a meat mallet. Cut a pocket into each chicken breast.\nRub 2 garlic cloves over chicken breast. Season chicken inside and out with salt, pepper, thyme, basil, and parsley. Stuff pockets with spinach, fontana cheese, and prosciutto.\nPreheat oven to 450 degrees F (230 degrees C).\nBeat 2 eggs in a bowl. Pour bread crumbs into a shallow bowl.\nDip stuffed chicken into eggs. Dredge in bread crumbs until coated.\nHeat 2 tablespoons oil in a large skillet over medium-high heat. Cook breaded chicken until browned, about 6 minutes per side.\nTransfer chicken to a baking sheet. Sprinkle Parmigiano-Reggiano cheese over chicken; drizzle remaining 1 tablespoon olive oil on top.\nBake in the preheated oven until chicken is no longer pink in the center, 10 to 20 minutes.\nCook and stir 2 garlic cloves in the same skillet used to brown chicken for 1 to 2 minutes. Add mushrooms; cook and stir until browned, about 5 minutes. Pour in Marsala wine; simmer until reduced by half, about 5 minutes. Stir in chicken stock.\nStir butter and flour into the skillet until sauce thickens, about 5 minutes. Serve sauce over chicken.",
    "pt": "15 m",
    "ct": "38 m",
    "tt": "53 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}