{
    "id": 258080,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons extra-virgin olive oil, divided",
        "1 small white onion, finely chopped",
        "1 bunch parsley, stems and leaves chopped separately",
        "3 zucchini, cut into long, thin strips",
        "salt and ground black pepper to taste",
        "7 1/2 cups zucchini blossoms, pistils removed",
        "6 eggs",
        "3 tablespoons grated Parmesan cheese",
        "1 tablespoon grated Pecorino Romano cheese",
        "4 leaves fresh mint, chopped"
    ],
    "nut": [
        "Calories > 267 kcal",
        "Carbs > 10.3 g",
        "Cholesterol > 284 mg",
        "Fat > 19.6 g",
        "Protein > 14.5 g",
        "Sodium > 250 mg"
    ],
    "n": "Frittata di Zucchine e Fiori di Zucca (Italian Courgette Frittata)",
    "a": "AnnaG",
    "r": "0",
    "s": 4,
    "des": "\"This classic Italian frittata uses both the courgette and courgette flowers, boasting loads of summertime flavors. It's great warm or at room temperature, which makes it a great choice for buffets or picnics.\"",
    "ins": "Heat 2 tablespoons olive oil in a large skillet over medium heat. Add onion and parsley stems; cook and stir until onion is translucent, about 5 minutes. Add zucchini and salt; cook and stir until softened, about 5 minutes.\nStir zucchini blossoms into the skillet. Reduce heat to medium-low, cover, and cook for 10 minutes. Uncover skillet and cook until moisture evaporates, 2 to 3 minutes more.\nWhisk parsley leaves, eggs, Parmesan cheese, Pecorino Romano cheese, and mint together in a bowl. Fold in zucchini mixture from the skillet. Mix well; season with salt and pepper.\nHeat remaining 1 tablespoon oil in a large skillet over high heat. Pour in egg mixture and spread evenly across the skillet. Cook for 2 minutes. Prick surface in several places with a fork. Reduce heat to low and cook for 5 minutes. Remove from heat and cover; let stand until top is just set, about 5 minutes.\nInvert frittata onto a large plate and slide back into the skillet. Cook over low heat until second side is set, about 5 minutes more. Remove from heat and let stand 5 to 10 minutes before serving.",
    "pt": "20 m",
    "ct": "34 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}