{
    "id": 258061,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 skinless, boneless chicken breasts, halved lengthwise",
        "salt and ground black pepper to taste",
        "1/4 cup olive oil, divided",
        "6 mushrooms, chopped",
        "2 cloves garlic, minced",
        "1 (8 ounce) package cream cheese",
        "1/2 (10 ounce) package frozen chopped spinach, thawed",
        "2 tablespoons chopped green onions",
        "1/2 teaspoon red pepper flakes",
        "12 toothpicks"
    ],
    "nut": [
        "Calories > 289 kcal",
        "Carbs > 3.2 g",
        "Cholesterol > 75 mg",
        "Fat > 23.7 g",
        "Protein > 16.6 g",
        "Sodium > 185 mg"
    ],
    "n": "Cheesy Spinach Chicken Rolls",
    "a": "VickiP",
    "r": "0",
    "s": 6,
    "des": "\"Cream cheese, mushroom, spinach, and garlic filling inside rolled chicken breasts make a delicious change of pace for boneless skinless chicken.\"",
    "ins": "Place chicken breasts between 2 sheets of heavy plastic on a solid, level surface; firmly pound with the smooth side of a meat mallet to a 1/4-inch thickness. Season with salt and pepper.\nHeat 1 tablespoon olive oil in a skillet over medium heat. Add mushrooms and garlic; cook and stir until softened, about 5 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nCombine mushroom-garlic mixture, cream cheese, spinach, green onions, and red pepper flakes in a bowl.\nSpoon 1 tablespoon cream cheese mixture into the middle of each chicken breast. Roll chicken breasts around mixture and secure with toothpicks.\nHeat remaining 3 tablespoons in an ovenproof skillet over medium heat. Arrange chicken rolls in the skillet in a single layer; cook until golden, about 5 minutes per side.\nTransfer skillet to the preheated oven; bake until chicken is no longer pink in the center, 10 to 15 minutes more.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}