{
    "id": 258066,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 2/3 pounds white asparagus",
        "1/4 cup butter, divided",
        "1 pinch white sugar",
        "salt and ground black pepper to taste",
        "2 shallots, chopped",
        "1 tablespoon all-purpose flour",
        "1/2 cup dry white wine",
        "1 (4 ounce) package Cambozola cheese, cubed",
        "4 sprigs chervil, leaves stripped, divided",
        "5 tablespoons heavy whipping cream"
    ],
    "nut": [
        "Calories > 367 kcal",
        "Carbs > 17.6 g",
        "Cholesterol > 77 mg",
        "Fat > 27 g",
        "Protein > 12.2 g",
        "Sodium > 530 mg"
    ],
    "n": "Spargelsuppe mit Kase (Cream of White Asparagus Soup with Blue Cheese)",
    "a": "Marianne",
    "r": "0",
    "s": 4,
    "des": "\"The classic cream of asparagus soup with a twist: Cambozola cheese, a combination of French soft cheese and Gorgonzola. The cheese makes this soup especially creamy.\"",
    "ins": "Peel asparagus spears with a vegetable peeler from top to bottom, starting below the tips. Trim off any woody ends and chop asparagus spears, leaving the tips intact.\nBring a large pot of water to a boil. Add asparagus pieces, 1 tablespoon butter, sugar, and salt. Reduce heat; simmer until asparagus is tender and easily pierced with a knife, 15 to 25 minutes. Drain, reserving 2 cups cooking liquid.\nMelt remaining 3 tablespoons butter in the pot. Cook shallots, stirring often, until translucent, about 5 minutes. Stir in flour until shallots are evenly coated. Whisk in reserved cooking liquid and white wine until soup is thick and smooth, about 5 minutes. Stir in Cambozola cheese until melted, about 1 minute.\nStir asparagus pieces, except for the tips, into the sauce. Add all but 2 teaspoons chervil leaves. Puree soup with an immersion blender until smooth. Season with salt and pepper.\nBeat heavy cream in a bowl with an electric mixer until stiff peaks form. Stir cream into the soup. Garnish soup with reserved asparagus tips and 2 teaspoon chervil leaves.",
    "pt": "25 m",
    "ct": "31 m",
    "tt": "56 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}