{
    "id": 258137,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 ounces butter",
        "1 cup packed dark brown sugar",
        "1 teaspoon coarse sea salt",
        "6 tablespoons cornstarch",
        "5 cups whole milk",
        "4 large eggs",
        "2 tablespoons bourbon",
        "1 teaspoon vanilla extract",
        "Candied Bacon:",
        "6 slices FarmlandÂ® Bacon",
        "1/2 cup light brown sugar",
        "1 tablespoon bourbon",
        "1/4 cup maple syrup",
        "Whipped cream for garnish",
        "Candied pecans for garnish"
    ],
    "nut": [
        "Calories > 1177 kcal",
        "Carbs > 106.6 g",
        "Cholesterol > 341 mg",
        "Fat > 73.9 g",
        "Protein > 21.8 g",
        "Sodium > 967 mg"
    ],
    "n": "Butterscotch Pudding with Candied Bacon",
    "a": "Farmland Foods",
    "r": "0",
    "s": 6,
    "des": "\"Homemade butterscotch pudding with a touch of bourbon is topped with crumbled candied bacon, whipped cream, and candied pecans.\"",
    "ins": "Melt butter in medium-sized saucepan. Add dark brown sugar and salt, and stir until sugar is dissolved. Remove from heat.\nIn small bowl, whisk together cornstarch with about 1/4 cup milk until smooth; then whisk in eggs.\nGradually pour remaining milk into melted brown sugar, whisking constantly; then whisk in cornstarch mixture as well.\nReturn pan to heat, and bring mixture to boil, whisking frequently. Once it begins to bubble, reduce heat to low simmer and continue to cook for 1 minute, whisking nonstop, until pudding thickens.\nRemove from heat and stir in bourbon and vanilla.\nPour into individual dishes and chill thoroughly before serving.\nPreheat oven to 350 degrees F.\nLine baking sheet with parchment and place wire rack on top.\nIn small saucepot over medium heat, add brown sugar, bourbon and maple syrup. Cook, stirring often, until mixture is thickened.\nPlace bacon slices on rack and brush half of glaze on both sides of bacon. Sprinkle with additional brown sugar if desired.\nBake in preheated oven for 8 minutes, flip and brush bacon with remaining glaze. Cook until crispy and browned.\nTo serve: Top butterscotch puddings with bacon, whipped cream and candied pecans.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "2 h ",
    "i": "4518474.jpg",
    "o": "",
    "st": "allrecipes"
}