{
    "id": 258115,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 skinless, boneless chicken breasts",
        "1 cup Italian-seasoned bread crumbs",
        "1 cup grated Parmesan cheese",
        "1 tablespoon smoked paprika",
        "1 teaspoon dried parsley flakes",
        "2 eggs",
        "olive oil cooking spray",
        "1 (28 ounce) jar chunky marinara sauce (such as BarillaÂ®)",
        "2 cups shredded mozzarella cheese",
        "2 teaspoons crushed oregano"
    ],
    "nut": [
        "Calories > 669 kcal",
        "Carbs > 51 g",
        "Cholesterol > 209 mg",
        "Fat > 26.6 g",
        "Protein > 54.4 g",
        "Sodium > 1973 mg"
    ],
    "n": "Cindy's Microwave Chicken Parmesan",
    "a": "Cindy Henderson Foster",
    "r": "0",
    "s": 4,
    "des": "\"This is a great summer recipe. It's easy and not much mess to clean up. My family loves it!  The chicken stays very moist and leftovers are yummy! Serve over your favorite pasta. I serve over linguini with Alfredo sauce.\"",
    "ins": "Place chicken breasts between 2 sheets of heavy plastic on a solid, level surface. Firmly pound with the smooth side of a meat mallet to 1/2-inch thickness.\nShake bread crumbs, Parmesan cheese, paprika, and parsley flakes together in a large resealable plastic bag.\nBeat eggs in a shallow bowl. Dip chicken breasts in beaten eggs; dredge in bread crumb mixture. Dip and dredge each chicken breast once more.\nSpray a microwave-safe dish large enough to hold chicken breasts in a single layer with cooking spray. Arrange breaded chicken breasts in the dish. Spray tops of the chicken breasts with cooking spray.\nCook in the microwave at 50% power for 6 minutes. Pour marinara sauce over chicken breasts. Cover and cook at 100% power for 12 minutes. Sprinkle mozzarella cheese and oregano over sauce. Cover dish and let stand until mozzarella cheese melts, about 10 minutes.",
    "pt": "15 m",
    "ct": "18 m",
    "tt": "43 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}