{
    "id": 258166,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 Madagascar vanilla beans",
        "Crust:",
        "1 1/4 cups graham cracker crumbs (such as KeeblerÂ®)",
        "1/3 cup butter, melted",
        "1/4 cup white sugar",
        "Cheesecake:",
        "2 (8 ounce) packages cream cheese, softened",
        "1 (8 ounce) container sour cream",
        "1 cup white sugar",
        "2 tablespoons cornstarch",
        "2 tablespoons butter, softened",
        "1 teaspoon vanilla extract",
        "White Chocolate Mousse:",
        "2 cups heavy whipping cream",
        "1/4 cup confectioners' sugar",
        "2 (4 ounce) bars white baking chocolate, chopped",
        "1 (8 ounce) package cream cheese, softened",
        "Vanilla Bean Whipped Cream:",
        "1 cup heavy whipping cream",
        "1 1/2 tablespoons confectioners' sugar"
    ],
    "nut": [
        "Calories > 1128 kcal",
        "Carbs > 74.7 g",
        "Cholesterol > 261 mg",
        "Fat > 89.2 g",
        "Protein > 11.8 g",
        "Sodium > 478 mg"
    ],
    "n": "The Best Vanilla Bean Cheesecake",
    "a": "littlebit86",
    "r": "0",
    "s": 8,
    "des": "\"Enjoy the best vanilla bean cheesecake that tastes very close to The Cheesecake Factory'sÂ® version. Each bit is a little piece of heaven. This recipe takes time to make and is best after it has set in the refrigerator for 2 to 3 days.\"",
    "ins": "Split 1 vanilla bean lengthwise with the tip of a sharp knife. Holding the pod open, scrape seeds from each half using the flat side of your knife; place in a bowl. Repeat with second vanilla bean, placing seeds in a separate bowl.\nPreheat oven to 350 degrees F (175 degrees C).\nMix graham cracker crumbs, melted butter, and 1/4 white sugar together in a bowl. Press over the bottom and up the sides of a 9-inch springform pan.\nCombine 2 packages cream cheese, sour cream, 1 cup white sugar, and cornstarch in a large bowl; mix until sugar is dissolved. Add seeds from 1 vanilla bean, softened butter, and vanilla extract; blend until smooth. Pour over graham cracker crust.\nBake in the preheated oven until top is a light tan color, 30 to 35 minutes. Cool for 1 to 2 hours.\nBeat 2 cups heavy cream in a chilled bowl with an electric mixer until soft peaks form. Add 1/4 confectioners' sugar, 1 tablespoon at a time, beating until cream is stiff. Place in the refrigerator.\nMelt white chocolate in top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Remove from heat and let cool, about 5 minutes.\nBeat 1 package cream cheese with an electric mixer until fluffy. Beat in white chocolate until smooth. Fold in whipped cream. Spread over the cooled cheesecake. Chill for 1 to 2 hours.\nBeat 1 cup heavy cream in a chilled bowl with an electric mixer until soft peaks form. Beat in seeds from the second vanilla bean and 1 1/2 tablespoon confectioners' sugar until stiff peaks form. Spread over cheesecake. Cover and refrigerate until firm, at least 1 day.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 d ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}