{
    "id": 258177,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "2 pounds beef shanks",
        "1/2 cup butter",
        "4 large yellow onions, halved and sliced",
        "2 large white onions, halved and sliced",
        "1 pinch kosher salt",
        "1 tablespoon chopped garlic",
        "1/2 cup all-purpose flour",
        "3 quarts vegetable broth",
        "2 tablespoons Worcestershire sauce",
        "2 teaspoons liquid smoke flavoring",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 670 kcal",
        "Carbs > 50.3 g",
        "Cholesterol > 138 mg",
        "Fat > 33.5 g",
        "Protein > 40.9 g",
        "Sodium > 1839 mg"
    ],
    "n": "Swaggy B's Hearty French Onion Soup",
    "a": "Punker Mike",
    "r": "0",
    "s": 4,
    "des": "\"This is my son's favorite soup. I've made it many different ways, but this rendition is his favorite. Serve topped with melted provolone cheese sprinkled with grated Parmesan over sliced baguette.\"",
    "ins": "Heat a large pot over medium-high heat; grease with cooking spray. Cook beef shanks until browned, 2 to 3 minutes per side. Transfer to a large plate.\nMelt butter in the same pot. Add yellow onions, white onions, and kosher salt; cook and stir until soft and lightly browned, about 15 minutes. Stir in garlic; cook until soft, about 5 minutes. Stir in flour until onions and garlic are coated. Add vegetable broth gradually, stirring until it is absorbed.\nSeason soup with Worcestershire sauce, liquid smoke, salt, and pepper. Return beef shanks to the pot. Bring to a boil. Reduce heat and simmer, stirring occasionally, until beef falls off the bone, 3 to 4 hours.\nTransfer beef shanks to a cutting board with a slotted spoon. Shred beef and return to the pot. Discard bones.",
    "pt": "20 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}