{
    "id": 258148,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 ears fresh corn",
        "1 shallot, minced",
        "1/4 cup liquid egg substitute",
        "1/4 cup fat-free half-and-half, divided",
        "3 tablespoons cornmeal",
        "3 tablespoons all-purpose flour",
        "1/2 teaspoon sea salt",
        "1/2 teaspoon baking powder",
        "1 pinch cayenne pepper",
        "1 cup oil for frying"
    ],
    "nut": [
        "Calories > 161 kcal",
        "Carbs > 26.1 g",
        "Cholesterol > < 1 mg",
        "Fat > 5.3 g",
        "Protein > 5.3 g",
        "Sodium > 235 mg"
    ],
    "n": "Jacque's Fresh Corn Fritters",
    "a": "Jacque",
    "r": "0",
    "s": 6,
    "des": "\"My wife cannot eat the whole kernels of corn and I love corn. Pureeing the batter seemed to be a logical approach to solving this problem. I am type 2 diabetic so the use of liquid egg helped my situation. The flavor from grilling the corn adds a flavor that cannot be duplicated and turned these ordinary fritters into great fritters.\"",
    "ins": "Remove silk from the top of the ears of corn and trim so that there is an even layer of husk around the ears. Tie the husk in 1 or 2 places. Soak in a large bowl of water for 2 to 3 hours.\nPreheat grill for medium heat and lightly oil the grate. Cook corn in the husk, turning every 10 minutes, until husks look blackened, 15 to 20 minutes.\nCool corn until easily handled, about 5 minutes. Pull off husks and any remaining husks. Cut kernels from the ears of corn and place in a bowl.\nScrape any pulp remaining on the cobs into a blender. Add shallot, liquid egg substitute, 3 tablespoons half-and-half, cornmeal, flour, salt, baking powder, and cayenne pepper; blend until smooth. Thin batter with remaining 1 tablespoon half-and-half if needed.\nPreheat oven to 200 degrees F (95 degrees C).\nHeat oil in a large nonstick skillet over medium-high heat until shimmering. Drop 6 tablespoonfuls of batter into the hot oil; cook until golden brown, about 3 minutes per side. Transfer fritters to an ovenproof plate lined with paper towels and keep warm in the oven. Repeat with remaining batter.",
    "pt": "20 m",
    "ct": "21 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}