{
    "id": 258110,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 3/4 cups all-purpose flour",
        "3 tablespoons white sugar",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1 1/2 cups milk",
        "3 eggs, beaten",
        "1/2 cup butter, melted",
        "1 teaspoon vanilla extract",
        "60 lollipop sticks",
        "1 (12 ounce) package white chocolate chips",
        "1/2 cup shredded sweetened coconut",
        "1/2 cup minced candied ginger"
    ],
    "nut": [
        "Calories > 73 kcal",
        "Carbs > 7.9 g",
        "Cholesterol > 15 mg",
        "Fat > 4.1 g",
        "Protein > 1.3 g",
        "Sodium > 61 mg"
    ],
    "n": "Mini Waffle Pops with White Chocolate, Coconut, and Candied Ginger",
    "a": "foodelicious",
    "r": "0",
    "s": 60,
    "des": "\"Turn ordinary waffles into fun and festive party treats. These easy mini waffles are baked on lollipop sticks, drizzled with white chocolate, and crusted with shredded coconut and candied ginger.\"",
    "ins": "Preheat and grease a waffle iron according to manufacturer's instructions.\nWhisk flour, sugar, baking powder, and salt together in a large bowl.\nWhisk milk, eggs, butter, and vanilla extract together in a separate bowl; stir into flour mixture just until batter is moistened.\nPour 2 teaspoons batter into the preheated waffle iron for each waffle, leaving spaces between each. Insert a lollipop stick about 3/4 of the way into each pool of batter; close the lid. Cook until golden and crispy, about 1 minute. Transfer each waffle pop to a cooling rack and repeat with the remaining batter.\nMelt white chocolate in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each interval, 1 to 3 minutes. Transfer melted white chocolate to a pastry bag fitted with a small writing tip or a resealable plastic bag with the corner snipped. Drizzle white chocolate over each waffle pop.\nSprinkle coconut and candied ginger over the melted chocolate on each waffle pop, lightly pressing toppings to help stick to chocolate as it cools and firms.",
    "pt": "30 m",
    "ct": "2 m",
    "tt": "32 m",
    "i": "4517062.jpg",
    "o": "",
    "st": "allrecipes"
}