{
    "id": 258106,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cookie Cake:",
        "3/4 cup brown sugar",
        "3/4 cup unsalted butter, at room temperature",
        "1/4 cup white sugar",
        "1 egg",
        "2 teaspoons vanilla extract",
        "2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 cup semi-sweet chocolate chips",
        "Vanilla Buttercream:",
        "1/2 cup shortening",
        "1/2 cup butter, softened",
        "4 cups confectioners' sugar, divided",
        "1 tablespoon water, or more as needed",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 758 kcal",
        "Carbs > 101.4 g",
        "Cholesterol > 80 mg",
        "Fat > 38.9 g",
        "Protein > 4.7 g",
        "Sodium > 322 mg"
    ],
    "n": "Homemade Cookie Cake",
    "a": "Nourish33",
    "r": "0",
    "s": 10,
    "des": "\"Homemade cookie cake is so easy and so much tastier than the store-bought version! Perfect for special occasions and simple enough for an everyday treat! Food coloring can be added to the buttercream, if desired.\"",
    "ins": "Beat brown sugar, unsalted butter, and white sugar together in a bowl using an electric mixer until light and fluffy, 3 to 4 minutes. Mix in egg and 2 teaspoons vanilla extract until smooth. With the mixer on low speed, add flour, baking soda, and salt and blend until batter is just mixed. Fold chocolate chips into batter. Batter will be thick. Chill in refrigerator at least 30 minutes to overnight.\nPreheat oven to 350 degrees F (175 degrees C). Line a 9-inch cake pan with parchment paper.\nSpread batter into the prepared cake pan.\nBake in th preheated oven until edges are golden brown, about 20 minutes. Slightly cool cake in the pan before transferring to a wire rack to cool completely, about 30 minutes.\nBeat shortening and butter together in a bowl using an electric mixer until smooth. Slowly beat in 3 cups confectioners' sugar until smooth. Mix water and 1 teaspoon vanilla extract into confectioners' sugar mixture; add remaining confectioners' sugar and mix until buttercream is smooth. Add more water to thin, if needed.\nSpread buttercream onto cookie cake.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}