{
    "id": 258157,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 2/3 cups glutinous rice",
        "2 cups water",
        "2 tablespoons white sugar",
        "1 tablespoon butter",
        "5 dates",
        "3/4 cup red bean paste",
        "3 tablespoons toasted walnuts, finely chopped",
        "1/2 teaspoon vegetable oil",
        "1 pineapple ring",
        "1 tablespoon toasted pumpkin seeds, finely chopped",
        "1 tablespoon roasted peanuts, finely chopped",
        "10 canned mandarin orange segments"
    ],
    "nut": [
        "Calories > 269 kcal",
        "Carbs > 51.8 g",
        "Cholesterol > 4 mg",
        "Fat > 4.9 g",
        "Protein > 5.1 g",
        "Sodium > 25 mg"
    ],
    "n": "Eight Treasure Rice Pudding",
    "a": "xiangxiangzui",
    "r": "0",
    "s": 8,
    "des": "\"Sticky rice is layered with pineapple, dates, toasted nuts, and bean paste in this traditional Chinese eight treasure rice pudding recipe.\"",
    "ins": "Rinse and soak rice in a bowl of water for 50 minutes. Drain well and transfer rice to a rice cooker; add 2 cups water.\nCook rice according to manufacturer's instructions, about 20 minutes. Transfer cooked rice to a large bowl and cool for 2 minutes. Stir in sugar and butter.\nRinse and soak dates in a bowl of warm water for 30 minutes. Drain and slice dates in half and remove pits.\nMix red bean paste and walnuts together in a bowl.\nLightly oil a shallow bowl with vegetable oil. Place pineapple ring in the bottom and fill with pumpkin seeds and peanuts. Arrange dates and mandarin oranges around the pineapple ring, creating a sunshine pattern. Spoon 1/2 of the rice into the bowl and flatten. Spread red bean paste mixture evenly on top. Fill the bowl with the remaining rice and flatten.\nPlace bowl in a steamer, cover, and steam over medium-high heat for 25 minutes. Remove from heat and cool for 5 minutes. Run a knife around the edge of the rice. Place a plate over the top, flip over, and remove bowl.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}