{
    "id": 258138,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package FarmlandÂ® Diced Ham",
        "1 (16 ounce) package frozen phyllo dough",
        "3 tablespoons unsalted butter",
        "3 tablespoons all-purpose flour",
        "2 cups milk",
        "Salt and pepper to taste",
        "4 ounces grated cheese (Cheddar, Monterey Jack, etc.)",
        "1/2 cup diced onion",
        "Cooking spray"
    ],
    "nut": [
        "Calories > 506 kcal",
        "Carbs > 51.6 g",
        "Cholesterol > 82 mg",
        "Fat > 20.9 g",
        "Protein > 25.5 g",
        "Sodium > 1511 mg"
    ],
    "n": "Ham & Cheese Turnover",
    "a": "Farmland Foods",
    "r": "0",
    "s": 6,
    "des": "\"Phyllo dough triangles are filled with a creamy ham and cheese mixture and baked until golden brown. These turnovers make great snacks or appetizers.\"",
    "ins": "Preheat oven to 350 degrees F. Thaw frozen phyllo for about 1 hour before beginning, leaving wrapped tightly in packaging to avoid drying out.\nIn heavy-bottomed sauce pot, heat butter until melted and then whisk in flour. Continue whisking until mixture has completely homogenized; then stir in milk. Continue whisking to incorporate completely and remove any lumps.\nContinue cooking over medium heat, stirring continuously, until milk has thickened. Add salt and pepper.\nFold in ham, cheese and onions and allow to cool slightly.\nWorking quickly, spray and lay out 3 sheets of phyllo. Keep all phyllo not actively being used wrapped tightly to avoid drying out. Cut phyllo into thirds the long way, making 3 long strips.\nPlace about 1 Tbsp. filling about 1 inch from corner of each strip. Fold diagonally across to form a triangle; continue to fold triangle onto itself. Repeat until all filling is used up. Spray outside of each tart and place on baking sheet, with at least an inch between them.\nBake for about 25-30 minutes, until golden brown.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "4514048.jpg",
    "o": "",
    "st": "allrecipes"
}