{
    "id": 258174,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon extra-virgin coconut oil (such as Barlean'sÂ®)",
        "1/4 cup extra-virgin coconut oil (such as Barlean'sÂ®)",
        "2 cups white whole wheat flour (such as King ArthurÂ®)",
        "1/4 cup ground flaxseeds (such as Barlean'sÂ®)",
        "1 tablespoon freshly grated ginger",
        "1 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon sea salt",
        "1/2 cup firmly packed brown sugar",
        "1 egg",
        "1 (10 ounce) package frozen butternut squash puree, thawed",
        "1/2 cup coconut milk",
        "1/4 cup molasses",
        "2 teaspoons pure vanilla extract"
    ],
    "nut": [
        "Calories > 268 kcal",
        "Carbs > 41.7 g",
        "Cholesterol > 19 mg",
        "Fat > 10.4 g",
        "Protein > 5.1 g",
        "Sodium > 186 mg"
    ],
    "n": "Healthy Gingerbread Spice Cake With Butternut Squash Puree",
    "a": "Ivy Larson",
    "r": "0",
    "s": 10,
    "des": "\"Even though I live in balmy south Florida, where it is pretty much summer year round, I still like to 'get into' the seasons by cooking something festive and seasonally appropriate. I started slowly spiking my recipes with ultra-healthy ingredients (flax, wheat germ, hemp seeds, chickpea puree, etc.) This is a vegetarian and dairy-free recipe.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x5-inch loaf pan with 1 teaspoon coconut oil.\nPlace 1/4 cup coconut oil in a microwave-safe bowl; heat in microwave until melted, about 30 seconds.\nMix flour, ground flaxseeds, ginger, baking soda, cinnamon, allspice, and sea salt in a large bowl.\nCombine brown sugar, melted coconut oil, and egg in a separate large bowl; add squash puree, coconut milk, molasses, and vanilla extract and mix well. Stir flour mixture into squash mixture until batter is smooth. Pour batter into the prepared loaf pan and smooth the top.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 45 to 55 minutes. Cool for 5 minutes before turning cake onto a wire rack to cool completely.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}