{
    "id": 258233,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup milk",
        "1/3 cup packed brown sugar",
        "5 tablespoons butter, divided",
        "1 teaspoon salt",
        "1/2 cup warm water (110 to 115 degrees F/43 to 46 degrees C)",
        "2 (.25 ounce) packages active dry yeast",
        "1 1/2 cups pumpkin puree",
        "1 1/2 cups all-purpose flour, or more as needed",
        "1 1/2 cups whole wheat flour",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon ground nutmeg"
    ],
    "nut": [
        "Calories > 235 kcal",
        "Carbs > 39.1 g",
        "Cholesterol > 17 mg",
        "Fat > 6.8 g",
        "Protein > 6 g",
        "Sodium > 374 mg"
    ],
    "n": "Pumpkin Dinner Rolls",
    "a": "Dilia Gee",
    "r": "0",
    "s": 10,
    "des": "\"These are awesome.\"",
    "ins": "Combine milk, brown sugar, 1 tablespoon butter, and salt in a small saucepan over medium heat; heat to about 110 degrees F (43 degrees C), 2 to 4 minutes. Remove from heat.\nMix warm water and yeast together in a bowl until yeast is dissolved. Combine yeast mixture and milk mixture in a large bowl. Add pumpkin puree, all-purpose flour, whole wheat flour, cinnamon, ginger, and nutmeg; beat until dough is smooth, adding more all-purpose flour if needed to form a soft dough.\nGrease a large bowl.\nTurn dough onto a floured surface and knead until smooth and elastic. Place dough into the greased bowl, turning once to grease the top of the dough. Cover and let rise in a warm place until doubled in size, about 1 hour.\nGrease an 9x13-inch baking dish.\nPunch dough down and divide into 10 pieces. Shape each dough piece into a ball. Place dough balls into the prepared baking dish; cover and let rise until doubled in size, about 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nMelt remaining butter in a saucepan over medium-low heat, 2 to 3 minutes. Brush melted butter over dough.\nBake in the preheated oven until golden brown, 20 to 25 minutes. Transfer rolls to a wire rack to cool slightly before serving.",
    "pt": "20 m",
    "ct": "24 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}