{
    "id": 258240,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 skinless, boneless chicken breast",
        "3/4 cup vegetable oil for frying",
        "2 tablespoons all-purpose flour, or as needed",
        "2 eggs",
        "2 tablespoons butter",
        "1/4 teaspoon chopped fresh parsley",
        "salt and ground black pepper to taste",
        "2 lemons, juiced",
        "1/4 cup Chablis wine",
        "1/2 cup chicken stock"
    ],
    "nut": [
        "Calories > 372 kcal",
        "Carbs > 11.3 g",
        "Cholesterol > 247 mg",
        "Fat > 25.8 g",
        "Protein > 19.2 g",
        "Sodium > 284 mg"
    ],
    "n": "A NJ Restaurant-Style Chicken Francese",
    "a": "John",
    "r": "0",
    "s": 2,
    "des": "\"This was one of the most popular dishes I made during my 12-year stint as head chef of a restaurant in Northern New Jersey. Sauce will be lemony and thin, and is best served over pasta.\"",
    "ins": "Cut chicken breast horizontally through the middle to within one-half inch of the other side. Open the two sides and spread them out like an open book; cut into 4 pieces. Cover chicken pieces with plastic wrap; pound firmly with a meat mallet to an even thickness.\nDust chicken pieces lightly with flour on both sides.\nWhisk eggs in a shallow bowl until smooth. Dip floured chicken in eggs until coated.\nHeat oil in a deep skillet over medium-high heat. Cook chicken in the hot oil until golden, 2 to 3 minutes per side. Drain on paper towels.\nCombine butter, parsley, salt, and pepper in a skillet; heat over medium heat until butter is melted, 1 to 2 minutes. Add chicken pieces; swirl skillet to coat them with butter. Pour in lemon juice; swirl skillet to coat chicken evenly.\nPour white wine into the skillet. Cook until reduced, about 2 minutes. Pour in chicken stock. Cook until chicken is no longer pink in the center, about 10 minutes.",
    "pt": "15 m",
    "ct": "17 m",
    "tt": "32 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}