{
    "id": 258259,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "12 green olives, pitted",
        "1 stalk celery, chopped",
        "2 onions, sliced",
        "1/2 cup water",
        "2 teaspoons white sugar",
        "1 tablespoon extra-virgin olive oil",
        "1 (2 pound) whole chicken, cut into pieces",
        "4 ripe tomatoes, diced",
        "1 bunch fresh basil, chopped",
        "1 lemon, juiced",
        "2 tablespoons capers",
        "salt and ground black pepper to taste",
        "1/4 cup extra-virgin olive oil, or to taste",
        "5 potatoes, peeled and cubed"
    ],
    "nut": [
        "Calories > 342 kcal",
        "Carbs > 34.6 g",
        "Cholesterol > 31 mg",
        "Fat > 17 g",
        "Protein > 15.1 g",
        "Sodium > 271 mg"
    ],
    "n": "Pollo alla Cacciatore",
    "a": "Maria",
    "r": "0",
    "s": 8,
    "des": "\"Chicken cacciatore is typical Tuscan dish, traditionally cooked in a terracotta pot with caramelized onions, capers, olives, tomatoes, and herbs. As a final touch, fried potatoes are added to the pot, too.\"",
    "ins": "Bring a small pot of water to a boil. Add olives and celery; simmer until celery is bright green, about 30 seconds. Drain well.\nCombine onions, water, and sugar in a saucepan over medium heat. Cover and cook, stirring occasionally, until onions are soft and caramelized, about 30 minutes.\nHeat 1 tablespoon olive oil in a large skillet over medium heat. Cook chicken pieces until browned, about 4 minutes per side.\nTransfer chicken pieces to a large saucepan; add olives, celery, caramelized onions, tomatoes, basil, lemon juice, capers, salt, and pepper. Cover and cook over medium heat until chicken is no longer pink in the center, about 1 hour.\nHeat 1/4 cup olive oil in a deep skillet. Add potatoes; cook and stir until crisp and golden brown, about 10 minutes. Stir potatoes into the saucepan shortly before removing from the heat.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}