{
    "id": 258270,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 pound cod",
        "1/2 pound prawns",
        "1 onion, quartered",
        "1 carrot, chopped",
        "1 stalk celery, chopped",
        "salt and ground black pepper to taste",
        "water to cover",
        "6 tablespoons extra-virgin olive oil",
        "1/2 small onion, sliced",
        "1 red chile pepper, chopped",
        "1 clove garlic, minced",
        "1/2 cup dry white wine",
        "1/2 pound tomatoes, chopped",
        "1/2 pound clams in shell, cleaned",
        "1/2 pound mussels, cleaned and debearded",
        "4 slices bread, or more to taste",
        "1 clove garlic, halved",
        "1 bunch fresh parsley, chopped"
    ],
    "nut": [
        "Calories > 531 kcal",
        "Carbs > 29.9 g",
        "Cholesterol > 152 mg",
        "Fat > 24.6 g",
        "Protein > 40.7 g",
        "Sodium > 569 mg"
    ],
    "n": "Zuppa di Pesce e Frutti di Mare (Mediterranean Seafood Soup)",
    "a": "Giulia",
    "r": "0",
    "s": 4,
    "des": "\"Easy yet tasty fish soup made only with the best fresh Mediterranean fish and seafood. Use the remaining fish stock for a seafood risotto.\"",
    "ins": "Cut cod into pieces, reserving any scraps. Peel and devein prawns, reserving any scraps.\nPlace cod and prawn scraps, quartered onion, carrot, celery, salt, and pepper in a large saucepan; cover with water. Bring to a boil; reduce heat and simmer until fish stock is fragrant, 15 to 20 minutes. Strain and reserve fish stock.\nHeat olive oil in a saucepan over medium heat; cook and stir sliced onion, red chile pepper, and minced garlic until softened, 5 to 10 minutes. Pour in wine; cook for 5 minutes. Add tomatoes; bring to a boil. Add cod, prawns, clams, and mussels; pour in 1 cup fish stock. Simmer until fish is cooked through and clams and mussels have opened, 15 to 20 minutes.\nToast bread in a toaster. Rub garlic halves on to 1 side of toasted bread.\nPlace a piece of toasted bread in the bottom of each serving bowl. Ladle soup over toasted bread and top with parsley.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}