{
    "id": 258274,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Enchilada Sauce:",
        "3 tablespoons vegetable oil",
        "1 tablespoon all-purpose flour",
        "2 tablespoons chili powder, or more to taste",
        "2 cups chicken stock",
        "1 (6 ounce) can tomato paste",
        "1 teaspoon dried oregano",
        "1 teaspoon ground cumin",
        "1/4 teaspoon salt",
        "Enchiladas:",
        "cooking spray",
        "1 pound ground beef",
        "1 teaspoon extra-virgin olive oil",
        "1 onion, diced",
        "2 (4 ounce) cans fire-roasted diced green chiles",
        "1/2 green bell pepper, diced",
        "1 (15 ounce) can black beans, rinsed and drained",
        "8 low-carb high-fiber tortillas (such as La Tortilla FactoryÂ®)",
        "1 (8 ounce) package shredded low-fat Mexican cheese blend"
    ],
    "nut": [
        "Calories > 815 kcal",
        "Carbs > 62.2 g",
        "Cholesterol > 113 mg",
        "Fat > 44.5 g",
        "Protein > 48.7 g",
        "Sodium > 2560 mg"
    ],
    "n": "Beef Enchiladas with Homemade Sauce",
    "a": "Heather Marie",
    "r": "0",
    "s": 4,
    "des": "\"Beef enchiladas with homemade sauce. Top with black olives, mashed avocado, and fresh cilantro!\"",
    "ins": "Heat vegetable oil in a saucepan over medium heat. Add flour; cook and stir using a wooden spoon until smooth, 1 to 2 minutes. Mix in chili powder  and cook until fragrant, about 30 seconds. Stir in chicken stock, tomato paste, oregano, cumin, and salt; bring to a boil. Reduce heat and simmer enchilada sauce until thickened and smooth, about 15 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Coat the inside of a 9x13-inch baking dish with cooking spray.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nHeat olive oil in a separate skillet over medium heat; cook and stir onion, green chiles, and green bell pepper until softened, 5 to 10 minutes. Mix in ground beef and black beans. Stir in 1/2 of the enchilada sauce; cook and stir 1 to 2 minutes.\nSpoon beef mixture evenly onto the center of each tortilla and roll tortilla around filling. Place tortillas, seam-side down, in the baking dish. Cover tortillas with remaining enchilada sauce and Mexican cheese blend.\nBake in the preheated oven until cheese is melted, about 20 minutes.",
    "pt": "15 m",
    "ct": "52 m",
    "tt": "1 h ",
    "i": "4520671.jpg",
    "o": "",
    "st": "allrecipes"
}