{
    "id": 258269,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 fluid ounces water",
        "5 tablespoons unsalted butter",
        "1 pinch salt",
        "1 3/4 cups all-purpose flour",
        "5 fluid ounces anise-flavored liqueur",
        "1/4 cup white sugar",
        "3 tablespoons grappa",
        "1 tablespoon lemon zest",
        "3 eggs, separated",
        "2 cups lard, or as needed"
    ],
    "nut": [
        "Calories > 299 kcal",
        "Carbs > 30.1 g",
        "Cholesterol > 94 mg",
        "Fat > 14.5 g",
        "Protein > 5.3 g",
        "Sodium > 49 mg"
    ],
    "n": "Tortelli di Carnevale (Italian Carnevale Doughnuts)",
    "a": "Giulia",
    "r": "0",
    "s": 8,
    "des": "\"Doughnuts are typical of Carnevale in Italy, the famous festival in the days leading up to Lent. Each region, and indeed each family, has its own recipe. In Milan and the Lombardy region, Carnival donuts are called 'tortelli' and they are flavored with anise liqueur, grappa, and lemon zest.\"",
    "ins": "Combine water, butter, and salt in a saucepan; bring to a boil. Remove from heat; stir in flour until well mixed. Return saucepan to medium heat; cook and stir until dough starts to pull away from the sides of the saucepan, 3 to 5 minutes.\nRemove saucepan from heat and stir anise-flavored liqueur, sugar, grappa, and lemon zest into dough. Cool dough to room temperature, at least 30 minutes.\nBeat egg yolks into the cooled dough until well mixed. Cover bowl with a clean towel and let rest for 3 hours.\nBeat egg whites in a bowl until stiff peaks form; gently fold into the dough until no white streaks remain.\nHeat lard in a heavy saucepan over medium heat or in a deep fryer. Form dough into balls the size of golf balls; fry in the hot lard in batches, until doughnuts are lightly browned and cooked through, 4 to 5 minutes.",
    "pt": "20 m",
    "ct": "12 m",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}