{
    "id": 258242,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons olive oil",
        "2 cups all-purpose flour",
        "3 eggs",
        "1 pound skinless, boneless chicken breast halves",
        "2 cups chicken broth",
        "1/2 cup white wine",
        "1/2 cup butter",
        "3 tablespoons lemon juice",
        "5 cloves garlic, thinly sliced",
        "1 tablespoon chopped fresh parsley",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 701 kcal",
        "Carbs > 51.6 g",
        "Cholesterol > 262 mg",
        "Fat > 36.7 g",
        "Protein > 34.3 g",
        "Sodium > 787 mg"
    ],
    "n": "Chicken Francese, Italian-Style",
    "a": "Lainabug",
    "r": "0",
    "s": 4,
    "des": "\"A chicken dish that takes some time and effort to cook, but is very simple to follow. Can be put over pasta or rice.\"",
    "ins": "Place flour in a shallow bowl. Beat eggs in a separate shallow bowl. Coat each piece of chicken in flour; dip in beaten eggs to coat completely. Press chicken into flour again until evenly coated. Reserve remaining flour.\nCoat a skillet with olive oil and set over medium heat. Cook each piece of coated chicken in the hot olive oil until browned, about 5 minutes per side. Transfer chicken to a 9x13-inch baking dish.\nPreheat oven to 300 degrees F (150 degrees C).\nCombine chicken broth, white wine, butter, lemon juice, garlic, parsley, salt, and pepper in a saucepan over medium heat; cook and stir until sauce is smooth, not allowing it to boil, about 5 minutes. Slowly sift 1 cup reserved flour into sauce while continually whisking until sauce thickens, 2 to 3 minutes. Pour sauce over chicken.\nBake chicken in the preheated oven until no longer pink in the center and juices run clear, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
    "pt": "20 m",
    "ct": "37 m",
    "tt": "57 m",
    "i": "4540456.jpg",
    "o": "",
    "st": "allrecipes"
}