{
    "id": 258250,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons vegetable oil",
        "2 bunches green onions, coarsely chopped, divided",
        "1 large red bell pepper, seeded and chopped",
        "3 cloves garlic, diced",
        "1 large tomato, chopped",
        "1/2 cup sliced black olives",
        "2 jalapeno peppers, seeded and diced",
        "2 cups drained canned black beans",
        "1 1/2 cups cooked white rice",
        "1 (8 ounce) package cream cheese, softened",
        "1 1/2 cups shredded Cheddar cheese, divided",
        "1/2 cup chopped fresh cilantro",
        "1/2 lime, juiced",
        "1 dash hot sauce (such as TabascoÂ®), or to taste",
        "2 (8 ounce) cans enchilada sauce",
        "8 (10 inch) flour tortillas",
        "1/2 cup sour cream, or to taste"
    ],
    "nut": [
        "Calories > 626 kcal",
        "Carbs > 67.2 g",
        "Cholesterol > 59 mg",
        "Fat > 31.2 g",
        "Protein > 20.6 g",
        "Sodium > 1138 mg"
    ],
    "n": "Jeannie's Vegetarian Enchiladas",
    "a": "Jeannie Jyurovat",
    "r": "0",
    "s": 8,
    "des": "\"These enchiladas are a filling and flavorful recipe that will satisfy everyone, even non-vegetarians. These are best when you use really large tortilla shells and stuff them full. I love to use organic ingredients for a great flavor.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C).\nHeat oil in a large skillet over medium heat. Add most of the green onions, reserving some in a bowl, red bell pepper, and garlic; cook and stir until fragrant, about 3 minutes. Add tomato, black olives, and jalapeno peppers; cook and stir over low heat until tomato is soft, about 5 minutes.\nMix black beans and rice together in a large bowl. Fold in tomato mixture. Stir in cream cheese, 1 1/4 cup Cheddar cheese, cilantro, lime juice, and hot sauce.\nDivide black bean mixture evenly among tortillas using a large spoon. Roll up tortillas.\nSpread a thin layer of enchilada sauce in a large, shallow baking pan. Arrange rolled tortillas seam side-down over the sauce; cover with remaining enchilada sauce. Sprinkle reserved green onions and remaining 1/4 cup Cheddar cheese on top. Cover baking pan with aluminum foil.\nBake in the preheated oven until Cheddar cheese is melted, 10 to 15 minutes. Serve enchiladas with sour cream.",
    "pt": "40 m",
    "ct": "18 m",
    "tt": "58 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}