{
    "id": 258215,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (1 pound) beef skirt steak",
        "1/3 cup hoisin sauce",
        "3 tablespoons Chinese vinegar (or sherry vinegar)",
        "1 tablespoon soy sauce",
        "2 teaspoons hot sauce",
        "2 teaspoons sesame oil",
        "1 tablespoon grated fresh ginger root",
        "4 cloves garlic, finely minced",
        "1 tablespoon packed brown sugar",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 green onion, light parts only, minced",
        "Toasted sesame seeds"
    ],
    "nut": [
        "Calories > 404 kcal",
        "Carbs > 33.2 g",
        "Cholesterol > 52 mg",
        "Fat > 16.4 g",
        "Protein > 30.2 g",
        "Sodium > 2483 mg"
    ],
    "n": "Grilled Hoisin Beef",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"The (underrated) hoisin sauce is a thickened, fermented soy-sauce-like substance, flavored with chilies, garlic, vinegar, sugar, and, of course, exotic spices.Â It makes a great marinade. And unless you horribly overcook it, this skirt steak is juicy and tender.\"",
    "ins": "Whisk hoisin sauce, vinegar, soy sauce, hot sauce, sesame oil, grated ginger, garlic, brown sugar, salt, and pepper together in a large mixing bowl.\nCut skirt steak crosswise into about 4 or 5 smaller pieces. Transfer steak into marinade and toss until all pieces are evenly coated. Cover with plastic wrap. Refrigerate; marinate at least 2 hours and up to 12 hours.\nLine a baking pan with paper towels. Transfer pieces of steak to the paper towels and mop off some of the marinade.\nPreheat an outdoor grill for high heat and lightly oil the grate.\nTransfer steak pieces to grill. Cook to medium rare or medium, 4 to 5 minutes per side. An instant-read thermometer inserted into the center should read between 130 and 135 degrees F (about 54 degrees C). Thinner pieces might finish earlier. Transfer steak to a warm plate. Let rest for a few minutes.\nTransfer steak to a warm serving platter and pour any accumulated juices over skirt steak. Sprinkle with sesame seeds and sliced green onions.",
    "pt": "10 m",
    "ct": "8 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}