{
    "id": 258398,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/3 cup buckwheat flour",
        "1/3 cup finely grated Parmigiano-Reggiano cheese",
        "1/4 cup gluten-free all-purpose flour",
        "2 tablespoons butter, divided",
        "1 tablespoon black sesame seeds",
        "1 tablespoon fresh thyme leaves",
        "3 tablespoons water, or more as needed"
    ],
    "nut": [
        "Calories > 309 kcal",
        "Carbs > 28.5 g",
        "Cholesterol > 42 mg",
        "Fat > 18.8 g",
        "Protein > 10.3 g",
        "Sodium > 289 mg"
    ],
    "n": "Buckwheat Grissini with Real Butter (Gluten Free)",
    "a": "Buckwheat Queen",
    "r": "0",
    "s": 2,
    "des": "\"Crunchy, thin breadsticks made with buckwheat flour and butter to give your appetizers or salads a new twist. Grissini are long, crunchy breadsticks from Torino, usually made with lard or oil. The butter lends a soft interior and a crunchy exterior while bursting with a creamy, buttery flavor. These are perfect for serving with prosciutto, olives, and your favorite cheeses, or just on their own. They are so easy to make. You can make them at the last minute but they also store well, so they can even be made a few days ahead of time. If there are leftovers, do not put them in an airtight container. Wrap them in a cloth or parchment paper for a day or two. The crunchier they are, the better.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nMix buckwheat flour, Parmigiano-Reggiano cheese, gluten-free flour, and 1 1/2 tablespoon butter in a bowl with your hands until the mixture resembles small pebbles. Mix in sesame seeds and thyme. Add water, 1 tablespoon at a time, until the mixture pulls together into a soft dough.\nDivide dough into 6 portions. Let dough rest for 5 minutes.\nRoll each portion of dough into a long, thin stick about 6 to 7 inches long. Arrange side by side on the baking sheet. Brush remaining 1 1/2 teaspoon butter over dough.\nBake in the preheated oven until completely browned, about 20 minutes. Cool completely before serving, about 10 minutes.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "4524389.jpg",
    "o": "",
    "st": "allrecipes"
}