{
    "id": 258395,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (17.5 ounce) package frozen puff pastry, thawed",
        "2 links chicken sausage, halved lengthwise and cut into bite-sized pieces",
        "3 tablespoons butter",
        "4 carrots, cut into bite-sized pieces",
        "1 leek, halved lengthwise and cut into bite-sized pieces",
        "2 garlic cloves",
        "1 (4 ounce) package mushrooms, quartered",
        "3 tablespoons all-purpose flour",
        "1 1/4 cups vegetable broth",
        "1 tablespoon Dijon mustard",
        "1 teaspoon ground cayenne pepper",
        "1/2 teaspoon ground nutmeg",
        "salt and ground black pepper to taste",
        "1 egg",
        "1 tablespoon water"
    ],
    "nut": [
        "Calories > 623 kcal",
        "Carbs > 49.6 g",
        "Cholesterol > 81 mg",
        "Fat > 41.9 g",
        "Protein > 13.1 g",
        "Sodium > 600 mg"
    ],
    "n": "Mushroom, Leek, and Sausage Pot Pie",
    "a": "Char Triplett",
    "r": "0",
    "s": 6,
    "des": "\"This recipe is a fantastic spin on the normal pot pie and much better than what you can buy in a box.\"",
    "ins": "Roll out each puff pastry sheet to an even thickness. Cut two 8-inch rounds from each sheet using a sharp knife.\nLine bottom and sides of two 8-inch pie tins with pastry rounds. Reserve 2 pastry rounds for tops of pies. Place pie tins and tops on a baking sheet; transfer to the refrigerator.\nCook and stir sausage in a skillet over medium heat until browned, about 5 minutes. Drain excess grease. Add butter, carrots, leek, and garlic; cook and stir until leek softens, about 5 minutes.\nStir mushrooms into the skillet; cook until tender, about 8 minutes. Stir in flour for 1 minute. Pour in vegetable broth slowly; add Dijon mustard, cayenne pepper, nutmeg, salt, and pepper. Cook and stir until sauce thickens, about 5 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nDivide sausage mixture evenly between the pie tins. Cover with pastry tops.\nWhisk egg and water together in a small bowl to make egg wash. Brush egg wash over pastry tops.\nBake in the preheated oven until golden brown, about 35 minutes. Cool briefly before slicing, about 10 minutes.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}