{
    "id": 258332,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Dough:",
        "1 1/4 cups whole milk, lukewarm",
        "2 tablespoons white sugar, divided",
        "1 (.25 ounce) package active dry yeast",
        "1 egg",
        "2 3/4 cups all-purpose flour",
        "1 teaspoon salt",
        "3 tablespoons ginger syrup, divided",
        "1 1/2 tablespoons butter, melted",
        "2 teaspoons vegetable oil, divided",
        "Filling:",
        "3/4 cup Belgian pearl sugar",
        "1 tablespoon butter, melted",
        "1 teaspoon ground cinnamon"
    ],
    "nut": [
        "Calories > 338 kcal",
        "Carbs > 62 g",
        "Cholesterol > 37 mg",
        "Fat > 7.1 g",
        "Protein > 6.8 g",
        "Sodium > 344 mg"
    ],
    "n": "Fries Suikerbrood (Frisian Sugar Bread)",
    "a": "jet",
    "r": "0",
    "s": 8,
    "des": "\"This Frisian sugar bread recipe is native to the Dutch province of Friesland. It's softer than a cloud with a stunning marbling of cinnamon-coated pearl sugar clusters throughout. This loaf is easy to make, authentic, and absolutely heavenly served warm straight from the oven. Alternatively, cool fully for a firmer texture.\"",
    "ins": "Combine milk, 1 tablespoon sugar, and yeast in a small bowl. Let stand until yeast is frothy, about 10 minutes.\nWhisk egg in a small bowl. Place 1 tablespoon in a separate bowl; reserve for glazing.\nSift flour into a large bowl; mix in salt. Add yeast mixture, beaten egg, 2 tablespoons ginger syrup, and 1 1/2 tablespoon melted butter. Knead until a smooth dough forms.\nGrease a large bowl with 1 teaspoon oil. Place dough in the greased bowl. Cover with a clean dish towel and let rise in a warm place until doubled, about 1 hour.\nGrease a 2-pound disposable loaf pan with remaining 1 teaspoon oil. Sprinkle remaining 1 tablespoon sugar and ginger syrup over the bottom and sides of the pan.\nMix pearl sugar, 1 tablespoon melted butter, and cinnamon together in a bowl.\nRoll dough into a rectangle on a lightly floured work surface. Sprinkle 1/2 of the pearl sugar mixture on top; knead until evenly incorporated. Roll out again and add remaining pearl sugar mixture; knead until evenly incorporated.\nShape dough into a loaf; place seam-side down in the prepared pan. Cover with a damp cloth and let rise until puffy, about 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Brush top of loaf with reserved beaten egg.\nBake in the preheated oven until top is golden brown, about 30 minutes. Cool slightly in the pan before slicing, about 10 minutes.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}