{
    "id": 258397,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 potatoes, cut into bite-sized pieces",
        "1 pound ground turkey",
        "1/2 onion, chopped",
        "1/4 cup salsa",
        "3 tablespoons Worcestershire sauce",
        "3 tablespoons steak sauce (such as A1Â®)",
        "2 tablespoons spicy mustard",
        "1 pinch garlic powder, or to taste",
        "salt and ground black pepper to taste",
        "1/4 bunch fresh cilantro, chopped",
        "1 (17.5 ounce) package frozen puff pastry, thawed"
    ],
    "nut": [
        "Calories > 670 kcal",
        "Carbs > 61.2 g",
        "Cholesterol > 56 mg",
        "Fat > 37.3 g",
        "Protein > 23.9 g",
        "Sodium > 605 mg"
    ],
    "n": "Turkey and Potato Pockets",
    "a": "Rachel Traff",
    "r": "0",
    "s": 6,
    "des": "\"This is a recipe thrown together based on what I had on hand. My husband loved it and told me to write it down, so here it goes. Let me know what you think. It's a savory little pastry that's fairly hearty and can be spiced a thousand different ways. The base is the turkey, potatoes, and pastry and the cook can make up the rest! I just threw this together without measuring so the measurements are just guesses. Prepare it to taste.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Grease 2 baking sheets.\nPlace potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until softened but not fully cooked, about 5 minutes. Drain.\nCook and stir turkey in a skillet over medium-high heat until no longer pink, about 5 minutes. Reduce heat to medium; stir in potatoes, onion, salsa, Worcestershire sauce, steak sauce, mustard, garlic powder, salt, and pepper. Simmer until sauce is reduced and no longer soupy, 5 to 10 minutes. Stir in cilantro.\nPlace 1 puff pastry sheet on each baking sheet. Cut pastry into thirds using the fold lines as a guide. Cut each third into 2 rectangles.\nDrop large spoonfuls of turkey-potato mixture on one side of each pastry rectangle. Fold pastry over filling and pinch edges to seal.\nBake in the preheated oven until pastry is puffed up and golden brown, about 1 hour.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}