{
    "id": 258344,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 frozen breaded chicken patties (such as TysonÂ®)",
        "2 tablespoons garlic butter, or to taste",
        "4 slices Italian bread",
        "1 cup marinara sauce",
        "1/2 teaspoon dried basil, or to taste",
        "1 pinch garlic salt, or to taste",
        "6 thin slices provolone cheese",
        "2 tablespoons shredded Parmesan cheese"
    ],
    "nut": [
        "Calories > 752 kcal",
        "Carbs > 50.2 g",
        "Cholesterol > 111 mg",
        "Fat > 45.3 g",
        "Protein > 34.7 g",
        "Sodium > 1993 mg"
    ],
    "n": "Lazy Chicken Parmesan Grilled Cheese",
    "a": "Cindylee Bloomer",
    "r": "0",
    "s": 2,
    "des": "\"Wanted to eat a chicken Parmesan sub but didn't feel like spending the time cooking and breading chicken. So I opted to cut corners using frozen chicken patties and pre-prepared ingredients to make my life easier. Picked up the sub rolls and couldn't justify eating that many calories, so opted instead for sliced Italian bread and thin-sliced cheese. Turned out so surprisingly good, I thought I'd share. Enjoy!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Place chicken patties on a baking sheet.\nBake in the preheated oven until cooked through and crispy, about 20 minutes. Cut chicken patties in half lengthwise.\nSpread garlic butter onto 1 side of each bread slice.\nMix marinara sauce, basil, and garlic salt together in a microwave-safe bowl; heat in microwave until warmed, 30 seconds to 1 minute. Stir.\nPlace 1 bread slice, butter-side down, into a skillet; top with 2 slices provolone cheese, 1 tablespoon marinara sauce, 2 chicken patty halves, overlapped to cover bread, 2 tablespoons marinara sauce, 1 slice provolone cheese, and bread, butter-side up. Cook over medium heat until bread is crisp and cheese is melted, 2 to 3 minutes per side. Repeat with remaining ingredients.\nSprinkle Parmesan cheese over remaining marinara sauce and serve alongside each sandwich.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "35 m",
    "i": "4524132.jpg",
    "o": "",
    "st": "allrecipes"
}