{
    "id": 25839,
    "old_rating": "3.9375",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup margarine",
        "1 cup white sugar",
        "1 egg",
        "1/2 cup molasses",
        "2 1/2 teaspoons baking soda",
        "3 tablespoons boiling water",
        "4 1/2 cups all-purpose flour",
        "1 tablespoon margarine",
        "3 tablespoons boiling water",
        "1/4 teaspoon ground ginger",
        "1/8 teaspoon salt",
        "2 1/2 cups confectioners' sugar"
    ],
    "nut": [
        "Calories > 262 kcal",
        "Carbs > 44.5 g",
        "Cholesterol > 8 mg",
        "Fat > 8.4 g",
        "Protein > 2.8 g",
        "Sodium > 242 mg"
    ],
    "n": "Frosted Molasses Ginger Sandwich Cookies",
    "a": "RAMB",
    "r": "0",
    "s": 24,
    "des": "\"I use a doughnut cutter to make these.  They have icing in between.\"",
    "ins": "In a large bowl, cream together 1 cup margarine and sugar until smooth. Beat in the egg and molasses until well blended. Dissolve the baking soda in boiling water; stir into the molasses mixture. Gradually mix in the flour to make a smooth dough. Cover and chill dough for at least 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). On a lightly floured surface, roll the dough out to 1/8 inch in thickness. Cut into circles using a  3 inch round cutter. Cut a smaller 1 inch circle out of half of the cookies. It is easier to cut the center hole after the cookies have been placed onto the cookie sheets. Place cookies 1 inch apart onto ungreased cookie sheets.\nBake for 7 to 10 minutes in the preheated oven, until edges begin to darken. Allow cookies to cool completely before sandwiching. Frost solid cookies and place a cookie with the center hole on top.\nTo make the frosting: Beat 1 tablespoon of margarine and water together. Blend in the ginger and salt. Gradually beat in the confectioners' sugar until the desired consistency is reached. Sandwich between cooled cookies.",
    "pt": "15 m",
    "ct": "6 m",
    "tt": "30 m",
    "i": "772691.jpg",
    "o": "",
    "st": "allrecipes"
}