{
    "id": 258372,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Sauce:",
        "1/2 cup mayonnaise",
        "2 teaspoons ground dried chipotle pepper",
        "1 lime, juiced",
        "Fritters:",
        "1 large egg white",
        "1/4 cup ice water",
        "1/2 teaspoon kosher salt",
        "1/4 cup cornstarch",
        "1/4 cup self-rising flour",
        "2 ears fresh sweet white corn, kernels removed from cob",
        "1 cup vegetable oil for frying, or as needed",
        "1 1/2 cups flaked fresh Dungeness crab meat",
        "1 fresh lime, cut into wedges"
    ],
    "nut": [
        "Calories > 279 kcal",
        "Carbs > 19.8 g",
        "Cholesterol > 27 mg",
        "Fat > 19.2 g",
        "Protein > 8.8 g",
        "Sodium > 447 mg"
    ],
    "n": "Crispy Fresh Corn Fritters with Crab and Chipotle Lime Dressing",
    "a": "Chef John",
    "r": "0",
    "s": 6,
    "des": "\"Freshly shucked corn stars here, as does the thin, light, crispy batter. You can substitute shrimp or even ceviche for the crab.\"",
    "ins": "Whisk mayonnaise, chipotle powder, and lime juice together in a mixing bowl. Cover with plastic wrap and refrigerate until needed for serving.\nWhisk egg white, ice water, and salt together in a large mixing bowl until mixture is light and foamy, 1 or 2 minutes. Add cornstarch and flour; whisk together until thoroughly mixed. Batter should resemble a thin pancake batter. Stir in corn.\nHeat 1/2 inch vegetable oil to 350 degrees F (175 degrees C) in a seasoned cast iron skillet. Spoon about 2 large spoonfuls of batter into oil for each fritter. Do not crowd, cook in batches, if necessary. Fry until browned and crispy, about 2 minutes per side. Turn fritters carefully to avoid spattering the oil. Drain on paper-towel-lined plate.\nServe topped with fresh Dungeness crab and drizzle with the chipotle dressing. Serve with a wedge of lime.",
    "pt": "12 m",
    "ct": "4 m",
    "tt": "16 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}