{
    "id": 258371,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large sheet heavy-duty aluminum foil (20x12 inch)",
        "2 large egg whites, room temperature",
        "1/2 cup white sugar",
        "1/2 cup packed all-purpose flour, plus more if needed",
        "2 tablespoons whole milk",
        "2 tablespoons melted butter",
        "1 tablespoon cold water, or as needed",
        "1/4 teaspoon vanilla extract",
        "1/8 teaspoon kosher salt"
    ],
    "nut": [
        "Calories > 109 kcal",
        "Carbs > 18.7 g",
        "Cholesterol > 8 mg",
        "Fat > 3.1 g",
        "Protein > 1.9 g",
        "Sodium > 66 mg"
    ],
    "n": "Ice Cream Cones",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"Making your own ice cream cones makes sense, especially if you make your own ice cream and have extra egg whites. You will need a silicone mat to bake these on.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a rimmed baking sheet with a silicone baking mat.\nFold aluminum foil in half and bunch it up to form a solid cone shape with a pointy end and a wider end about the size  of an ice cream cone. This will be used to shape the cones when they come out of the oven.\nWhisk egg whites and sugar together in a mixing bowl until mixture is smooth and shiny, about 2 minutes. Add flour, milk, melted butter, water, vanilla, and salt. Whisk together until thoroughly combined.\nLadle about 1 to 2 tablespoons batter on 1 side of silicone mat on prepared baking sheet. Gently swirl the batter with the back of the ladle outwards to create a fairly thin flat circle 5 or 6 inches in diameter. If necessary, you can use a pastry brush to even the thickness. If batter seems too thin, add a bit more flour. If too thick, more water. Bake in batches, 2 per batch.\nBake in preheated oven until edges are browned around the outside few inches, about 8 minutes.\nGently loosen one of the circles. While still hot, place the aluminum foil cone mold on one end and roll the circle into a cone shape, pressing together the pointed bottom to seal it. Place on a cooking rack seam side down. You may need to put the pan back in the oven for a minute to heat the second circle; they need to be hot to wrap around the mold. Repeat for the remaining cones.",
    "pt": "10 m",
    "ct": "8 m",
    "tt": "18 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}