{
    "id": 258370,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 large egg yolks",
        "2/3 cup white sugar",
        "1 pinch salt",
        "1 cup whole milk",
        "2 cups heavy cream",
        "2 1/2 teaspoons pure vanilla extract"
    ],
    "nut": [
        "Calories > 650 kcal",
        "Carbs > 40.5 g",
        "Cholesterol > 425 mg",
        "Fat > 51.5 g",
        "Protein > 7.7 g",
        "Sodium > 119 mg"
    ],
    "n": "Frozen Vanilla Custard",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"American-style ice cream uses no eggs, but this is the French style--with eggs! It's rich and creamy and, although traditionally served soft in cones, I prefer to freeze it firm then scoop it.\"",
    "ins": "Whisk egg yolks, sugar, and salt together until mixture changes from dark golden to pale yellow becomes fluffy.\nHeat milk and cream in a heavy saucepan over medium heat. Stir occasionally to prevent sticking to the bottom. Cook just until mixture starts to simmer when little bubbles begin to appear on the surface, 5 to 8 minutes. Remove from heat.\nWhisk a ladleful of milk-cream mixture into the egg yolk mixture. Add another ladleful and whisk thoroughly before adding the next (this will keep the eggs from cooking). Gradually add the remaining milk-cream mixture and whisk thoroughly. Whisk in vanilla. Cool completely (you can place the bowl in a larger bowl with ice water to cool it faster).\nPour cooled mixture into a pitcher; cover. Refrigerate until ice cold or overnight.\nPour custard mixture into ice cream maker and process (according to manufacturer's instructions) until custard reaches the consistency of soft ice cream, about 20 minutes. Quickly transfer to a plastic container. Place a piece of plastic wrap over the surface of the custard. Cover container and freeze until custard is firm enough to scoop, at least 3 hours.",
    "pt": "15 m",
    "ct": "5 m",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}