{
    "id": 258468,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons canola oil",
        "1/2 onion, diced",
        "2 teaspoons salt, divided",
        "2 pounds beef stew meat, cut into 1-inch cubes",
        "1 teaspoon freshly ground black pepper",
        "3 cloves garlic, minced",
        "1/2 teaspoon dried thyme",
        "2 tablespoons soy sauce",
        "3 cups chopped mushrooms",
        "2 tablespoons all-purpose flour",
        "3 cups chicken broth",
        "1 (16 ounce) package wide egg noodles",
        "3/4 cup sour cream, or to taste"
    ],
    "nut": [
        "Calories > 535 kcal",
        "Carbs > 45.1 g",
        "Cholesterol > 121 mg",
        "Fat > 26.1 g",
        "Protein > 28.9 g",
        "Sodium > 1236 mg"
    ],
    "n": "Beef Stroganoff for Instant PotÂ®",
    "a": "Lissa",
    "r": "0",
    "s": 8,
    "des": "\"A truly one-pot meal! Fork-tender beef and mushrooms with egg noodles. This recipe is written using the Instant PotÂ®.\"",
    "ins": "Heat oil in an electric pressure cooker (such as Instant Pot(R)) on the \"Saute\" setting for 1 minute. Add onion and 1/2 teaspoon salt; cook and stir until onion begins to soften, 3 to 4 minutes.\nSeason beef with 1 teaspoon salt and pepper. Stir into the pressure cooker. Cook and stir until browned evenly on all sides, about 2 minutes. Add garlic and thyme; cook until fragrant, about 30 seconds. Pour in soy sauce.\nStir mushrooms into the pressure cooker. Stir in flour until evenly incorporated. Pour in chicken broth and remaining 1/2 teaspoon salt. Seal pressure cooker and bring to high pressure according to manufacturer's instructions; cook for 10 minutes.\nRelease pressure carefully using the quick-release method. Open pressure cooker; add egg noodles. Seal and bring to high pressure again; cook for 5 minutes.\nLet pressure release naturally for 5 minutes. Release remaining pressure using the quick-release method. Open pressure cooker; stir in sour cream.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "40 m",
    "i": "4543079.jpg",
    "o": "",
    "st": "allrecipes"
}