{
    "id": 258429,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon dried thyme",
        "1 teaspoon dried dill weed",
        "1 teaspoon dried rosemary",
        "1 teaspoon garlic powder",
        "2 pounds pork belly strips",
        "1 cup chopped kimchi",
        "1 bulb garlic, cloves separated and peeled",
        "3 scallions (pajori), chopped",
        "Ssamjang Dipping Sauce:",
        "2 tablespoons doenjang (Korean soybean paste)",
        "2 tablespoons gochujang (Korean hot pepper paste), or more to taste",
        "1 tablespoon sesame oil",
        "2 cloves garlic, minced",
        "1 1/2 teaspoons sesame seeds",
        "1 teaspoon rice wine",
        "1 teaspoon brown sugar"
    ],
    "nut": [
        "Calories > 349 kcal",
        "Carbs > 11.5 g",
        "Cholesterol > 55 mg",
        "Fat > 24.1 g",
        "Protein > 20.9 g",
        "Sodium > 1594 mg"
    ],
    "n": "Herb Samgyupsal (Korean Grilled Pork Belly)",
    "a": "mykoreaneats",
    "r": "0",
    "s": 6,
    "des": "\"I accepted samgyupsal (grilled pork belly, aka thick bacon) into my late-night diet of soju and beer outings while living in Seoul. The best thing about samgyupsal is that there is little or no marinating involved. You just need to cut it into bite-size pieces and cook it on the stovetop. Enjoy with a variety of lettuce varieties (red leaf lettuce, Boston bibb, frisee) and rice.\"",
    "ins": "Mix thyme, dill, rosemary, and garlic powder together in a small bowl. Rub over both sides of each pork belly strip. Let stand at room temperature, about 15 minutes.\nHeat a large skillet over medium-high heat. Cook pork belly strips until well browned, about 7 minutes per side. Transfer to a paper towel-lined plate, reserving some grease in the skillet. Cut strips into bite-sized pieces.\nSaute kimchi, garlic cloves, and scallions in the reserved grease over medium-high heat until starting to brown, about 3 minutes. Drain on a paper towel-lined plate.\nMix doenjang, gochujang, sesame oil, minced garlic, sesame seeds, rice wine, and brown sugar in a bowl to make ssamjang sauce.\nServe pork belly strips with kimchi, garlic, scallions, and ssamjang sauce.",
    "pt": "25 m",
    "ct": "17 m",
    "tt": "57 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}