{
    "id": 258427,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Salsa:",
        "4 Roma (plum) tomatoes, chopped",
        "5 dried chile de arbol peppers",
        "1 cup water",
        "1/2 white onion, chopped",
        "1 bunch fresh cilantro, chopped",
        "1 tablespoon dried oregano",
        "1 clove garlic, minced, or more to taste",
        "salt and ground black pepper to taste",
        "1/2 head cabbage, shredded",
        "Tacos:",
        "1 tablespoon vegetable oil",
        "1/2 white onion, diced",
        "2 cloves garlic, minced",
        "2 Roma (plum) tomatoes, diced",
        "1 pound raw shrimp - peeled, deveined, and halved lengthwise",
        "1 tablespoon crushed dried oregano",
        "1/2 cup shredded cabbage",
        "1 jalapeno pepper, seeded and minced",
        "salt and ground black pepper to taste",
        "8 (6 inch) corn tortillas",
        "1 cup vegetable oil for deep frying, or as needed",
        "1 avocado - peeled, seeded, and sliced"
    ],
    "nut": [
        "Calories > 554 kcal",
        "Carbs > 62.9 g",
        "Cholesterol > 173 mg",
        "Fat > 19.4 g",
        "Protein > 31 g",
        "Sodium > 357 mg"
    ],
    "n": "Fried Shrimp Tacos",
    "a": "jimwolverine",
    "r": "0",
    "s": 4,
    "des": "\"This is one of my favorites, fried shrimp tacos that go along with its own unique salsa!\"",
    "ins": "Place 4 chopped roma tomatoes and arbol chiles in a saucepan. Add water; bring to a boil. Reduce heat to medium; simmer for 1 minute. Remove from heat; cool to room temperature.\nTransfer cooled tomatoes and chiles to a blender or food processor. Add 1/2 of the cooking water, 1/2 chopped onion, cilantro, 1 tablespoon oregano, 1 clove minced garlic, salt, and pepper. Pulse 6 to 8 times to chop ingredients. Transfer mixture to a bowl; stir in 1/2 of the shredded cabbage. Cover and refrigerate until serving.\nHeat 1 tablespoon oil in a skillet over medium heat. Add 1/2 chopped onion; cook and stir until beginning to soften, 3 to 5 minutes. Stir in 2 cloves minced garlic and 2 diced tomatoes; cook 1 more minute. Add shrimp and 1 tablespoon oregano; cook and stir for 1 minute. Add 1/2 cup shredded cabbage, jalapeno pepper, salt, and ground black pepper. Cook and stir until shrimp turns opaque, about 3 minutes. Remove skillet from heat.\nHeat oil in large saucepan to 350 degrees F (175 degrees C).\nPlace 3 tablespoons of the shrimp mixture in the center of each tortilla. Fold in half. Place filled tortillas in hot oil, working in batches if needed. Fry until golden brown, about 3 minutes. Turn carefully with tongs. Brown the other side, about 3 minutes more. Transfer cooked tacos to a paper-towel-lined plate to drain.\nTop with cabbage salsa and a slice of avocado.",
    "pt": "15 m",
    "ct": "19 m",
    "tt": "1 h ",
    "i": "4539011.jpg",
    "o": "",
    "st": "allrecipes"
}