{
    "id": 258493,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds large russet potatoes",
        "1/4 cup kosher salt",
        "10 cups cold water",
        "1/2 cup finely diced celery",
        "2 tablespoons finely diced sweet onion (optional)",
        "2 tablespoons chopped fresh parsley",
        "3 large hard-boiled eggs, peeled and cut into chunks",
        "chopped fresh chives for garnish (optional)",
        "paprika for garnish (optional)",
        "Dressing:",
        "1 1/4 cups mayonnaise, or more if needed",
        "3 tablespoons apple cider vinegar",
        "2 tablespoons Dijon mustard",
        "1 teaspoon kosher salt, plus more as needed",
        "1/2 teaspoon freshly ground black pepper",
        "cayenne pepper to taste"
    ],
    "nut": [
        "Calories > 279 kcal",
        "Carbs > 22.4 g",
        "Cholesterol > 62 mg",
        "Fat > 19.6 g",
        "Protein > 4.3 g",
        "Sodium > 2282 mg"
    ],
    "n": "Perfect Potato Salad",
    "a": "Chef John",
    "r": "0",
    "s": 12,
    "des": "\"This is my mother Pauline's recipe. It's pretty much a classic American salad but remember, if you add onions, use sweet onions and chop with a very sharp knife, allow potatoes to cool to room temp before dressing them, and always taste for salt.\"",
    "ins": "Place whole potatoes in a pot with 1/4 cup kosher salt. Cover with cold water. Bring to a boil over high heat. Reduce heat to medium-low. Simmer until tender, about 40 minutes (depending on size). Transfer cooked potatoes to a plate. Allow them to cool to room temperature.\nWhen potatoes are completely cooled, peel off the skin. Cut into larger than bite-size pieces as the pieces will break down slightly when you toss with the dressing. Transfer potato pieces to a mixing bowl. Add celery, onions, parsley, chopped hard-boiled eggs. Combine ingredients, breaking up larger pieces of potato.\nPlace mayonnaise in mixing bowl. Add cider vinegar, mustard, salt, black pepper, and cayenne pepper. Whisk until well combined.\nPour mayonnaise mixture onto potatoes; stir until well combined. Cover and refrigerate until completely chilled, 2 to 3 hours. Taste for seasonings and texture. Salad may need a bit more salt and another spoonful of mayonnaise.",
    "pt": "15 h",
    "ct": "40 m",
    "tt": "15 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}