{
    "id": 258495,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 frozen dinner rolls (such as RhodesÂ®)",
        "cooking spray",
        "1/2 cup white sugar",
        "1/2 cup brown sugar",
        "3 tablespoons ground cinnamon",
        "1/4 cup butter, melted",
        "2 apple - peeled, cored, and chopped",
        "1/4 cup golden raisins",
        "1/2 cup cream cheese, at room temperature",
        "1/2 cup confectioners' sugar",
        "3 tablespoons heavy whipping cream, or more as needed",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 308 kcal",
        "Carbs > 48 g",
        "Cholesterol > 27 mg",
        "Fat > 11.3 g",
        "Protein > 5.4 g",
        "Sodium > 274 mg"
    ],
    "n": "Easy Apple Cinnamon Roll Muffins",
    "a": "Culinary Envy",
    "r": "0",
    "s": 12,
    "des": "\"These apple cinnamon roll muffins are soft, buttery, gooey 'cinnamon roll' tasting muffins that are delicious and super easy to make!\"",
    "ins": "Put frozen rolls on a baking sheet, spray a piece of plastic wrap with cooking spray and place over rolls. Let rise until doubled in size, about 3 hours.\nPreheat oven to 350 degrees F (175 degrees C). Line a muffin tin with paper liners.\nMix white sugar, brown sugar, and cinnamon together in a bowl. Place melted butter in a small bowl.\nGrab approximately 1 tablespoon of thawed and risen dough and roll into a ball. Dip the ball in the melted butter and roll in the cinnamon-sugar mixture. Repeat to fill each muffin liner with 3 buttered and sugared dough balls.\nCombine apples and raisins in a bowl. Sprinkle about 1 teaspoon apple-raisin mixture over each muffin.\nBake in the preheated oven until golden brown, about 25 minutes.\nBeat cream cheese, confectioners' sugar, whipping cream, and vanilla extract together in a bowl until glaze is smooth, 3 to 5 minutes. Drizzle glaze over muffins.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}