{
    "id": 258498,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Crust:",
        "1 cup whole wheat flour",
        "1/3 cup all-purpose flour",
        "1/4 cup butter",
        "1 egg",
        "3 tablespoons sour cream",
        "1/4 teaspoon salt",
        "1 teaspoon butter",
        "Filling:",
        "1 tablespoon olive oil",
        "2 zucchini, coarsely grated",
        "1 sprig fresh thyme, leaves stripped",
        "sea salt and ground black pepper to taste",
        "1 cup ricotta cheese",
        "1 egg",
        "10 tablespoons grated Parmesan cheese",
        "1 tablespoon bread crumbs",
        "3 ounces thinly sliced prosciutto",
        "6 tablespoons pine nuts"
    ],
    "nut": [
        "Calories > 321 kcal",
        "Carbs > 19.5 g",
        "Cholesterol > 84 mg",
        "Fat > 21.5 g",
        "Protein > 14.2 g",
        "Sodium > 525 mg"
    ],
    "n": "Tart with Zucchini, Prosciutto, and Pine Nuts",
    "a": "Laka kuharica - Easy Cook",
    "r": "0",
    "s": 8,
    "des": "\"This savory tart is filled with delightful Italian flavors and it is ideal for a takeaway lunch or a picnic. Serve warm or cold with a green salad.\"",
    "ins": "Combine whole wheat flour, all-purpose flour, 1/4 cup butter, 1 egg, sour cream, and 1/4 teaspoon salt in a bowl; knead until dough comes together. Shape dough into a ball. Wrap in plastic wrap and refrigerate until firm, at least 1 hour and up to overnight.\nRoll out dough into a 10-inch circle on a lightly floured work surface.\nGrease a 9-inch tart tin with 1 teaspoon butter. Press dough into the tart tin. Trim edges with a sharp knife. Place crust in the refrigerator.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a large skillet over high heat. Add zucchini; cook and stir until just tender, 3 to 5 minutes. Season with thyme, salt, and pepper. Remove from heat.\nMix ricotta cheese and 1 egg together in a bowl. Fold in zucchini and Parmesan cheese gently.\nSprinkle bread crumbs over chilled crust; cover with prosciutto slices. Spread ricotta-zucchini mixture evenly over prosciutto. Smooth the top with a spatula; sprinkle pine nuts on top.\nBake in the preheated oven until center is firm and top is golden, about 35 minutes. Let stand for 10 minutes before slicing.",
    "pt": "30 m",
    "ct": "35 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}