{
    "id": 258409,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups vegetable oil for frying, or as needed",
        "1/2 yellow onion, diced, divided",
        "1 yellow bell pepper, diced",
        "1 red bell pepper, diced",
        "1 orange bell pepper, diced",
        "6 ounces thick cut smoked ham steak, diced, divided",
        "1 (15 ounce) can HORMELÂ® Mary KitchenÂ® Corned Beef Hash",
        "1 tablespoon minced garlic",
        "1 egg, lightly beaten",
        "3 green onion tops, finely chopped",
        "1 cup mozzarella cheese, grated",
        "3/4 cup all-purpose flour",
        "2 eggs, beaten",
        "1 cup panko bread crumbs"
    ],
    "nut": [
        "Calories > 223 kcal",
        "Carbs > 18.3 g",
        "Cholesterol > 65 mg",
        "Fat > 12.6 g",
        "Protein > 10.9 g",
        "Sodium > 432 mg"
    ],
    "n": "Corned Beef Hash Croquettes",
    "a": "Chef Roy",
    "r": "0",
    "s": 12,
    "des": "\"Delicious croquettes made with corned beef hash, bell peppers, garlic, onions, ham, and mozzarella cheese rolled all rolled up in Japanese bread crumbs.\"",
    "ins": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nHeat non-stick skillet over medium heat. Cook and stir onions, yellow, red, and orange bell peppers, and 1/2 of chopped ham until onions are soft, 5 or 6 minutes. Add corned beef hash and garlic. Cook and stir until ingredients begin to brown, 3 or 4 more minutes. Remove from heat.\nStir in the remaining ham, 1 beaten egg, green onions, and the cheese. Mix well.\nPlace flour, remaining 2 beaten eggs, and panko crumbs in 3 separate shallow dishes. Shape croquettes into small ovals or rounds about the size of a golf ball. Roll croquettes in flour, then eggs, then panko crumbs. Place on a rack.\nGently lower the croquettes into hot oil. Do not crowd them; you can cook in batches. Fry until nicely browned, about 3 to 5 minutes. Drain on paper towels.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "4525635.jpg",
    "o": "",
    "st": "allrecipes"
}