{
    "id": 258496,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon butter, divided",
        "1 tablespoon olive oil, divided",
        "1 (8 ounce) package baby bella (cremini) mushrooms, sliced",
        "1/2 teaspoon fresh thyme leaves",
        "salt and freshly ground black pepper to taste",
        "1 tablespoon soy sauce",
        "1 bell pepper, sliced into strips",
        "1 onion, sliced",
        "2 slices provolone cheese, cut in half",
        "2 hoagie rolls, split lengthwise",
        "2 teaspoons Dijon mustard, or more to taste"
    ],
    "nut": [
        "Calories > 664 kcal",
        "Carbs > 81.8 g",
        "Cholesterol > 35 mg",
        "Fat > 27.5 g",
        "Protein > 23.9 g",
        "Sodium > 1708 mg"
    ],
    "n": "Vegetarian Mushroom Philly Cheese Steak Sandwiches",
    "a": "Amanda Sheumaker",
    "r": "0",
    "s": 2,
    "des": "\"With a satisfying chew and complex flavors, this is going to be a big hit with anyone. Best when served hot, but also a yummy lunchbox choice because melting the cheese on the bread keeps it from getting soggy. If you like, add potato chips and a dill pickle on the side.\"",
    "ins": "Preheat toaster oven to 300 degrees F (150 degrees C).\nHeat 1 1/2 teaspoon butter and 1 1/2 teaspoon oil in a large nonstick skillet over medium-high heat until hot but not smoking, about 2 minutes. Toss in mushroom slices; season with thyme leaves, salt, and pepper. Cook and stir until mushrooms start to brown and are tender, about 5 minutes. Drizzle soy sauce over mushrooms, toss briefly and transfer to a bowl.\nWipe out skillet. Heat remaining butter and oil over medium-high heat until hot but not smoking, about 2 minutes. Toss in peppers and onions; season with salt and pepper. Cook and stir until soft, about 5 minutes. Transfer peppers and onions to the bowl with the cooked mushrooms; toss to combine.\nPlace rolls on toaster oven baking tray. Spread mustard over 2 halves. Place 1 piece provolone cheese over each half. Toast open-faced until cheese is melted, about 3 minutes.\nPlace the toasted rolls on plates and top with mushroom mixture.",
    "pt": "10 m",
    "ct": "17 m",
    "tt": "27 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}