{
    "id": 258583,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 large red potatoes, peeled and diced",
        "2 sweet potatoes, peeled and diced",
        "1 1/2 cups cooked rice",
        "1/4 cup milk",
        "1/4 cup butter, divided",
        "1 teaspoon salt, divided",
        "1 tablespoon olive oil",
        "1 cup finely chopped cremini mushrooms",
        "1 tablespoon minced garlic",
        "1 teaspoon chopped fresh thyme",
        "1 teaspoon chopped fresh marjoram",
        "2 tablespoons Madeira wine",
        "1 1/2 cups bread crumbs",
        "1/2 cup grated Parmesan cheese",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon dried marjoram",
        "1/2 teaspoon dried thyme",
        "1/4 cup canola oil"
    ],
    "nut": [
        "Calories > 214 kcal",
        "Carbs > 29.1 g",
        "Cholesterol > 10 mg",
        "Fat > 8.7 g",
        "Protein > 4.8 g",
        "Sodium > 300 mg"
    ],
    "n": "Sweet Potato and Mushroom Croquettes",
    "a": "Collette Duck",
    "r": "0",
    "s": 16,
    "des": "\"I came up with this recipe for Thanksgiving to serve as a vegetarian main dish that would marry well with gravy and cranberry sauce. It hit the spot for that purpose, but we'll be making it again and again for more casual meals.\"",
    "ins": "Place red potatoes and sweet potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain. Add rice, milk, 2 tablespoons butter, and 1/2 teaspoon salt into the pot; mash until combined.\nCover and refrigerate potato mixture until cool, about 15 minutes.\nHeat remaining 2 tablespoons butter and olive oil in a large skillet. Add mushrooms, garlic, fresh thyme, and fresh marjoram; cook and stir until mushrooms release their moisture and are tender, about 15 minutes. Pour in Madeira wine, scraping up browned bits from the bottom of the pan with a wooden spoon.\nPlace 1/4 cup of the cooled potato mixture in the palm of 1 hand; flatten slightly. Place 1 tablespoon of the mushroom mixture in the center; form potato mixture into a ball around mushroom mixture using the back of a spoon. Repeat with remaining potato and mushroom mixtures.\nCombine 1/2 teaspoon salt, bread crumbs, Parmesan cheese, pepper, dried marjoram, and dried thyme in a shallow dish. Drop potato balls gently into the bread crumb mixture; roll around until coated. Press down to flatten potato balls into patties.\nHeat canola oil in a large skillet over medium heat. Cook patties 4 at a time until golden and crispy, about 4 minutes per side.",
    "pt": "40 m",
    "ct": "48 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}