{
    "id": 258584,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 butternut squash, halved and seeded",
        "2 sweet potatoes, halved lengthwise",
        "2 3/4 cups water",
        "1/4 teaspoon salt",
        "1 1/2 cups whole grain couscous",
        "5 links precooked apple chicken sausage, sliced into rounds",
        "1 green bell pepper, diced",
        "1/2 cup diced green onion",
        "1 (12 ounce) package shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 309 kcal",
        "Carbs > 40.9 g",
        "Cholesterol > 61 mg",
        "Fat > 9.7 g",
        "Protein > 17.5 g",
        "Sodium > 396 mg"
    ],
    "n": "November Harvest Casserole",
    "a": "crystallynn",
    "r": "0",
    "s": 12,
    "des": "\"This casserole is perfect for Thanksgiving or any other fall meal. The sweetness of the squash and the potatoes are a pleasant combination. I make this recipe with apple Gouda chicken sausages from CostcoÂ® but any other chicken sausage will do the trick. I originally created this recipe by combining extras in the fridge that needed to be cooked. Now, it is a staple in our home and everyone loves it!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Place butternut squash and sweet potatoes cut-side down on the baking sheet.\nBake in the preheated oven until softened, about 30 minutes. Cool until easily handled, 5 to 10 minutes. Scoop flesh out of the skins; place in a 9x13-inch casserole dish.\nBring water and salt to a boil in a small saucepan. Stir in couscous; simmer over medium-high heat until couscous is soft, about 5 minutes. Drain excess water.\nStir couscous, sausage, green bell pepper, and green onion into the casserole dish. Sprinkle mozzarella cheese on top. Cover casserole dish tightly with aluminum foil.\nBake in the preheated oven until hot and bubbly, 30 to 40 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}