{
    "id": 258574,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil, divided",
        "2 tablespoons pine nuts",
        "1/2 pound ground beef",
        "1 small onion, chopped",
        "3/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground allspice",
        "salt and ground black pepper to taste",
        "5 (12-inch) spring roll wrappers",
        "5 tablespoons butter, melted"
    ],
    "nut": [
        "Calories > 94 kcal",
        "Carbs > 2.3 g",
        "Cholesterol > 20 mg",
        "Fat > 8.1 g",
        "Protein > 3.2 g",
        "Sodium > 62 mg"
    ],
    "n": "Meat Sambusa",
    "a": "Jeanette",
    "r": "0",
    "s": 15,
    "des": "\"Stuffed pastry with meat, a Middle Eastern appetizer.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nHeat 1 tablespoon olive oil in a large skillet over medium heat. Add pine nuts; cook and stir until lightly toasted, about 2 minutes. Transfer to a paper towel-lined plate with a slotted spoon.\nHeat remaining 1 tablespoon olive oil in the same skillet over medium heat. Add beef; cook, stirring to break up clumps, until no longer pink, 3 to 5 minutes. Stir in onion; cook and stir until tender, 3 to 5 minutes. Remove from heat; season with cinnamon, allspice, salt, and pepper. Stir in pine nuts.\nCut each spring roll wrapper into three 12x4-inch rectangles. Brush each rectangle lightly with melted butter.\nPlace a heaping teaspoonful of the beef mixture near the short end of 1 rectangle. Fold 1 corner over to enclose the filling and form a triangle. Continue to fold until the rectangle has been folded into a triangular packet, sealing any holes to prevent filling from oozing out. Dab cold water on the outside fold to seal sambusa closed.\nRepeat with remaining spring roll rectangles and beef mixture. Arrange sambusa on the prepared baking sheet.\nBake in the preheated oven until crisp and golden, about 25 minutes.",
    "pt": "25 m",
    "ct": "31 m",
    "tt": "56 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}