{
    "id": 258593,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup pitted dates",
        "1 cup raw walnuts",
        "3 shredded wheat cereal biscuits (such as Weetabixâ„¢)",
        "cooking spray",
        "1 1/2 cups raw cashews, soaked in water",
        "1/2 cup full-fat coconut milk",
        "2 tablespoons full-fat coconut milk",
        "1/2 cup maple syrup",
        "1/3 cup coconut oil, melted",
        "1 lemon, juiced",
        "Toppings:",
        "3 tablespoons caramel sauce",
        "2 tablespoons natural peanut butter",
        "1/4 cup frozen wild blueberries"
    ],
    "nut": [
        "Calories > 354 kcal",
        "Carbs > 33.9 g",
        "Cholesterol > < 1 mg",
        "Fat > 24.1 g",
        "Protein > 6.6 g",
        "Sodium > 30 mg"
    ],
    "n": "No-Bake Vegan Weetabixâ„¢ Cheesecakes",
    "a": "Zainab Pervaiz",
    "r": "0",
    "s": 12,
    "des": "\"This recipe has been tested by many of my foodie family members and friends and heartily approved. So good, so creamy, insanely delicious! I make them even more than regular cheesecakes. These beauties contain 3 ingredients in the crust: Weetabixâ„¢, dates, and walnuts (or almonds).\nThese are extremely delicious plain, but to pork them up a bit I topped them with blueberries, caramel, and peanut butter.\"",
    "ins": "Combine dates and walnuts in a food processor; pulse until a loose dough forms. Mix in wheat cereal biscuits until a pliable dough forms.\nGrease a muffin tin lightly with cooking spray. Line muffin cups with strips of parchment paper.\nDrop 1 tablespoon of dough into each muffin cup; press over the bottom with your fingers. Freeze until firm, 10 to 15 minutes.\nCombine soaked cashews, 1/2 cup plus 2 tablespoons coconut milk, maple syrup, coconut oil, and lemon juice in a blender; blend until smooth.\nDivide cashew mixture evenly among muffin cups. Tap muffin tin against a work surface to release any air bubbles in the cashew mixture. Cover with plastic wrap. Freeze until firm, 4 to 6 hours.\nPull cheesecakes out of muffin cups using the parchment paper ends. Drizzle caramel sauce and peanut butter on top; garnish with blueberries.",
    "pt": "25 m",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}