{
    "id": 258588,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 zucchini",
        "cooking spray",
        "1 onion, halved and sliced",
        "1/2 bunch radishes, trimmed and quartered",
        "2 tablespoons olive oil, divided, or to taste",
        "1 teaspoon kosher salt, or to taste",
        "1 teaspoon lemon zest, or to taste",
        "3 cloves garlic, sliced and roughly chopped",
        "1/4 teaspoon dill weed",
        "1 pinch salt and ground black pepper to taste",
        "1/2 lemon, juiced"
    ],
    "nut": [
        "Calories > 196 kcal",
        "Carbs > 17 g",
        "Cholesterol > 0 mg",
        "Fat > 14 g",
        "Protein > 3.1 g",
        "Sodium > 1063 mg"
    ],
    "n": "Wifey's Lemony Zoodles",
    "a": "Redd Summers",
    "r": "0",
    "s": 2,
    "des": "\"A light, refreshing springtime dish that is vegan and paleo-friendly.\"",
    "ins": "Cut zucchini into noodles using a spiralizer. Place noodles in a colander set in the sink. Season lightly with salt. Let stand for 20 to 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Grease a baking sheet with cooking spray.\nSpread onion slices on one side of the baking sheet. Spread radishes on the other side of the baking sheet. Drizzle 1 tablespoon olive oil on top.\nCombine kosher salt and lemon zest in a small bowl; rub together with your fingers until fragrant. Sprinkle over onion and radishes.\nBake in the preheated oven until onion and radishes are tender and slightly browned, about 25 minutes.\nHeat a large skillet over medium heat; grease with cooking spray. Cook and stir garlic until fragrant, 3 to 5 minutes. Drizzle in 1 tablespoon olive oil. Add onion and radishes; cook and stir until browned, about 3 minutes. Stir in dill weed.\nMix zucchini noodles into the skillet; cook until heated through, about 3 minutes. Season with salt and pepper. Remove from heat; pour lemon juice on top.",
    "pt": "20 m",
    "ct": "34 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}