{
    "id": 258591,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Seasoning Mix:",
        "2 tablespoons chili powder, or more to taste",
        "2 teaspoons garlic powder",
        "1/2 (1 ounce) square unsweetened chocolate, grated",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground cumin",
        "1/2 teaspoon salt",
        "1/2 teaspoon cayenne pepper",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon ground cloves",
        "1 bay leaf",
        "Lentil Chili:",
        "1 tablespoon olive oil, or as needed",
        "2 cups diced onions",
        "2 cups diced green bell pepper",
        "6 cups vegetable broth",
        "2 cups dry lentils",
        "2 (8 ounce) cans tomato sauce",
        "2 tablespoons apple cider vinegar",
        "2 teaspoons Worcestershire sauce",
        "1/2 cup water, or as needed (optional)"
    ],
    "nut": [
        "Calories > 77 kcal",
        "Carbs > 12.1 g",
        "Cholesterol > 0 mg",
        "Fat > 2.9 g",
        "Protein > 2.3 g",
        "Sodium > 658 mg"
    ],
    "n": "Skyline Lentil Chili",
    "a": "Cair",
    "r": "0",
    "s": 10,
    "des": "\"Serve chili over spaghetti and top with chopped onion, finely shredded Cheddar cheese, kidney beans, and TabascoÂ® sauce. I used to love Skyline Cincinnati-style chili. When I went vegetarian I came up with this Skyline lentil chili to give me that Skyline taste. I use green or black lentils as the protein where standard Cincinnati-style would use ground meat. Even though I've gone back to eating meat this is still my preferred way to get my Skyline fix.\"",
    "ins": "Mix chili powder, garlic powder, unsweetened chocolate, cinnamon, cumin, salt, cayenne pepper, allspice, cloves, and bay leaf together in a bowl until seasoning mix is well combined.\nHeat olive oil in a Dutch oven over medium heat; cook and stir onions and green bell pepper until lightly browned, about 10 minutes. Add vegetable broth and lentils; simmer for 20 minutes. Stir in seasoning mix, tomato sauce, apple cider vinegar, and Worcestershire sauce; simmer for 1 hour more, adding water if chili gets too thick.\nRemove bay leaf from chili. Blend chili using an immersion blender until desired consistency is reached.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}