{
    "id": 258573,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 3/4 cups all-purpose flour",
        "1 1/2 teaspoons salt",
        "3/4 cup shortening",
        "3 eggs, lightly beaten",
        "1/3 cup milk",
        "8 cups peeled and sliced tart baking apples",
        "1 1/2 cups white sugar",
        "1 cup crushed cornflakes",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1 egg white, lightly beaten"
    ],
    "nut": [
        "Calories > 311 kcal",
        "Carbs > 49.2 g",
        "Cholesterol > 35 mg",
        "Fat > 11.1 g",
        "Protein > 4.8 g",
        "Sodium > 238 mg"
    ],
    "n": "Cookie Sheet Apple Pie",
    "a": "Rachel",
    "r": "0",
    "s": 16,
    "des": "\"No fork necessary for this apple pie. You can get more servings from this dish if you cut it into smaller pieces.\"",
    "ins": "Combine flour and salt in a large bowl. Cut in shortening with a pastry blender until mixture resembles coarse crumbs. Add eggs and milk; mix until dough is moistened. Cover and chill for 20 minutes.\nPreheat oven to 400 degrees F (200 degrees C). Grease a 10x15-inch jelly roll pan.\nDivide dough in half so that 1 piece is slightly larger than the other. Roll out the larger piece on a floured work surface; press over the bottom and up the sides of the greased jelly roll pan. Arrange apple slices on top.\nMix sugar, cornflakes, cinnamon, and nutmeg together in a bowl. Sprinkle over apple slices. Roll out smaller piece of dough to fit on top. Place over apples and press edges to seal. Cut a few slits in the dough using a sharp knife. Brush egg white over dough.\nBake in the preheated oven until starting to brown, about 15 minutes. Reduce oven temperature to 350 degrees F (175 degrees C). Continue baking until golden brown, 20 to 25 minutes. Let cool completely, at least 30 minutes. Cut into slices.",
    "pt": "30 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}