{
    "id": 258565,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 sheet frozen puff pastry",
        "1 (15 ounce) can HORMELÂ® Mary KitchenÂ® Corned Beef Hash",
        "1 cup shredded Swiss cheese, divided",
        "4 large eggs",
        "salt and pepper to taste",
        "2 chopped green onions",
        "Sriracha hot chili sauce (optional)"
    ],
    "nut": [
        "Calories > 676 kcal",
        "Carbs > 41 g",
        "Cholesterol > 236 mg",
        "Fat > 45.4 g",
        "Protein > 25.8 g",
        "Sodium > 765 mg"
    ],
    "n": "Corned Beef Hash & Egg Pastry Squares",
    "a": "Happyschmoopies",
    "r": "0",
    "s": 4,
    "des": "\"A twist on a traditional hash and eggs served on a flaky puff pastry square.\"",
    "ins": "Thaw puff pastry sheet at room temperature until workable but still cold, about 30 minutes.\nPreheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nHeat a large skillet over medium high heat. Add corned beef hash. Cook and stir, breaking down larger pieces, until fat is rendered and hash is beginning to crisp up, about 15 minutes. and spread out. Transfer to a paper towel lined plate.\nUnroll puff pastry onto a 2nd sheet of parchment paper lightly dusted with flour. Roll out to a (11x11-inch) square.  Cut into 4 square (5 1/2 x 5 1/2-inch) pieces.\nPlace squares on prepared baking sheet making sure they do not touch. Prick the center of each square several times with a fork. Bake in preheated oven 10 minutes. Pastry will have puffed in the middle. Gently press down the center of each pastry leaving a small puffed border around the edges.\nDivide corned beef among the pastry squares leaving a 1/2-inch border. Top with 1/4 cup of Swiss cheese.  Arrange toppings to create a slight well in the center for the eggs.\nCarefully crack an egg into the center of each square. Sprinkle with salt and pepper.\nBake until eggs are cooked to your preference, about 12 to 15 minutes.\nServe topped with chopped green onions and a drizzle of sriracha sauce.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "4530387.jpg",
    "o": "",
    "st": "allrecipes"
}