{
    "id": 258575,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large sweet potato, cut into chunks",
        "2 tablespoons olive oil",
        "salt and ground black pepper to taste",
        "2 cups chicken broth",
        "1 cup quinoa, rinsed",
        "1 (12 ounce) package extra-firm tofu, cut into 1-inch cubes",
        "2 tablespoons all-purpose flour",
        "2 tablespoons cornstarch",
        "2 teaspoons garlic powder",
        "1/4 cup vegetable oil",
        "3 tablespoons olive oil",
        "2 tablespoons lime juice",
        "1 teaspoon Dijon mustard",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon ground cumin",
        "1 avocado, diced",
        "2 cups mixed greens with spinach",
        "1 cup bite-sized broccoli florets",
        "1/2 cup diced red bell pepper",
        "1/4 cup capers",
        "7 leaves fresh basil, cut into strips, or more to taste"
    ],
    "nut": [
        "Calories > 747 kcal",
        "Carbs > 69.3 g",
        "Cholesterol > 2 mg",
        "Fat > 46 g",
        "Protein > 19.8 g",
        "Sodium > 896 mg"
    ],
    "n": "Quinoa Salad with Crispy Tofu Cubes and Lime Vinaigrette",
    "a": "paralee",
    "r": "0",
    "s": 4,
    "des": "\"Had this salad at a restaurant in Minneapolis and had to make it the second I got home. It takes a bit of prep work, but definitely worth it!\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C).\nToss sweet potato with 2 tablespoons olive oil, salt, and pepper on a baking sheet; spread out in an even layer.\nRoast sweet potato in the preheated oven until soft, about 20 minutes.\nBring chicken broth to a boil in a saucepan. Reduce heat to low; stir in quinoa. Cover and simmer until quinoa is tender, about 30 minutes. Place in the refrigerator to cool.\nBring a pot of generously salted water to a boil. Remove from heat; add tofu cubes. Let soak for 15 minutes. Drain and pat dry with a clean dish towel.\nMix flour, cornstarch, garlic powder, salt, and pepper together in a shallow bowl. Toss tofu cubes in flour mixture until evenly coated.\nHeat 1/4 cup vegetable oil in a large skillet over medium-high heat. Cook tofu cubes in 2 batches until browned, about 20 seconds per side.\nPlace 3 tablespoons olive oil, lime juice, Dijon mustard, garlic powder, cumin, salt, and pepper in a jar. Seal and shake well to make dressing.\nPour dressing into a large bowl. Add sweet potato, tofu cubes, avocado, mixed greens, broccoli, red bell pepper, capers, and basil; toss to combine.\nDivide quinoa among serving plates; top with sweet potato salad mixture.",
    "pt": "30 m",
    "ct": "58 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}