{
    "id": 258612,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (14.5 ounce) can Del MonteÂ® Sliced New Potatoes, well drained",
        "1/2 teaspoon smoked paprika or paprika",
        "2 (14.5 ounce) cans Del MonteÂ® French-Style Green Beans, well drained",
        "Salt and ground black pepper, to taste",
        "4 (5 ounce) boneless, skinless salmon fillets",
        "2 tablespoons olive oil",
        "1 1/2 tablespoons chopped fresh thyme or oregano",
        "Salt and cracked black pepper, to taste",
        "4 lemon wedges (optional)"
    ],
    "nut": [
        "Calories > 345 kcal",
        "Carbs > 16.3 g",
        "Cholesterol > 63 mg",
        "Fat > 15.3 g",
        "Protein > 33 g",
        "Sodium > 1022 mg"
    ],
    "n": "Grilled Salmon Supper in Foil",
    "a": "Del Monte",
    "r": "0",
    "s": 4,
    "des": "\"Ingredients are layered and sealed in foil so salmon and vegetables steam together on the grill or in the oven for a simple meal with little clean up.\"",
    "ins": "Prepare a gas or charcoal grill for medium-high heat. Tear 4 pieces of heavy-duty aluminum foil into 12- to 14-inch squares.\nDivide the potatoes among the 4 pieces of foil and arrange in the center in an area about the size of a salmon fillet. Sprinkle potatoes with paprika. Arrange green beans evenly over the potatoes. Lightly season with salt and pepper.  Top beans with salmon fillets. Drizzle salmon with olive oil, sprinkle with thyme and season with salt and pepper, to taste.\nFor each packet, bring sides of foil up so edges meet and fold over at least twice until sealed, leaving room for steam. Pinch and seal foil ends.\nGrill the packets 4 to 6 inches from heat on a covered grill 15 to 20 minutes or until salmon flakes easily with a fork. (Time depends on thickness of salmon.) To serve, place packets on dinner plates. Carefully snip to open foil and allow steam to escape.  Use a spatula to remove food to plate or eat directly from foil.  Squeeze lemon over salmon, if desired.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "4528731.jpg",
    "o": "",
    "st": "allrecipes"
}