{
    "id": 258636,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup couscous",
        "2 sprigs fresh mint, stemmed and chopped",
        "2 sprigs cilantro, chopped",
        "2 cups boiling water",
        "2 skinless, boneless chicken breast halves",
        "1 tablespoon sweet paprika",
        "salt and ground black pepper to taste",
        "1 large green bell pepper, chopped",
        "1 large red bell pepper, chopped",
        "1 mango, cubed",
        "1 avocado, cubed",
        "1 small bunch watercress",
        "1/4 cup crumbled feta cheese",
        "3 tablespoons low-fat yogurt"
    ],
    "nut": [
        "Calories > 400 kcal",
        "Carbs > 53.8 g",
        "Cholesterol > 39 mg",
        "Fat > 11.6 g",
        "Protein > 22.2 g",
        "Sodium > 210 mg"
    ],
    "n": "Chicken, Mango, and Avocado Salad",
    "a": "Pete Cooks",
    "r": "0",
    "s": 4,
    "des": "\"What better to brighten up your day than a funky summer salad? Bit of a mishmash, really, but put all these flavors together and you're on to a winner. Garnish with fresh mint and cilantro leaves.\"",
    "ins": "Combine couscous, mint, and cilantro in a bowl. Pour in boiling water. Cover and let stand until couscous is soft, about 5 minutes.\nPlace chicken breasts between 2 sheets of heavy plastic on a solid, level surface; pound firmly with the smooth side of a meat mallet to 1-inch thickness. Season both sides with paprika, salt, and pepper.\nHeat a large nonstick skillet over medium heat. Cook chicken breasts until no longer pink in the center and the juices run clear, about 5 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Slice chicken into strips.\nCombine green bell pepper and red bell pepper in the same skillet used to cook the chicken; cook and stir over high heat until blackened in spots, about 5 minutes.\nSpread couscous over the bottom a large serving plate. Top with chicken slices, pepper mixture, mango, avocado, watercress, feta cheese, and yogurt.",
    "pt": "40 m",
    "ct": "10 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}