{
    "id": 258650,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package lasagna noodles",
        "1 tablespoon olive oil, or more as needed",
        "1 bulb fennel, thinly sliced",
        "1 large yellow onion, diced",
        "1/2 cup baby bella (crimini) mushrooms, sliced",
        "6 cloves garlic, minced",
        "1 pound sweet Italian sausage, casings removed",
        "1 (24 ounce) jar marinara sauce",
        "3 tablespoons dried basil",
        "1 teaspoon red pepper flakes",
        "1 (8 ounce) package cream cheese, at room temperature",
        "2 cups shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 523 kcal",
        "Carbs > 55.7 g",
        "Cholesterol > 53 mg",
        "Fat > 25.4 g",
        "Protein > 19.5 g",
        "Sodium > 928 mg"
    ],
    "n": "Fennel Lasagna",
    "a": "GRECKLE",
    "r": "0",
    "s": 8,
    "des": "\"A traditional lasagna only in the sense that it uses layered stratas and lasagna noodles.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally until tender yet firm to the bite, about 8 minutes. Drain.\nHeat olive oil in a skillet over medium heat. Add fennel, onion, mushrooms, and garlic; cook and stir until onions are translucent, 5 to 7 minutes.\nPlace sausage into a skillet over medium-high heat. Cook and stir until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add marinara sauce, basil, and red pepper flakes to skillet, stir to combine.\nCoat the bottom of a Dutch oven with marinara sauce mixture; add a layer of lasagna noodles. Spread a 1/4-inch layer of cream cheese over noodles; add a layer of onion-fennel mixture. Top with more sauce. Repeat layers until all sauce, cream cheese, and onion-fennel mixture are used up; about 3 layers. Top last layer with mozzarella cheese.\nBake in the preheated oven until bubbling, about 30 minutes.",
    "pt": "25 m",
    "ct": "48 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}