{
    "id": 258669,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground chicken",
        "1 bunch green onions, chopped, or to taste",
        "2 egg whites",
        "1 bunch fresh cilantro, chopped, or to taste",
        "1 jalapeno pepper, seeded and chopped",
        "1 1/2 tablespoons sour cream",
        "1 tablespoon ground dried chipotle pepper",
        "salt and ground black pepper to taste",
        "2 cups dry bread crumbs",
        "2 teaspoons garlic powder, or to taste",
        "1 tablespoon vegetable oil",
        "Avocado Sour Cream Spread:",
        "1 ripe avocado",
        "1/2 cup sour cream, or to taste"
    ],
    "nut": [
        "Calories > 370 kcal",
        "Carbs > 33.6 g",
        "Cholesterol > 54 mg",
        "Fat > 14.9 g",
        "Protein > 25.9 g",
        "Sodium > 382 mg"
    ],
    "n": "Mexican Chicken Patties with Avocado Sour Cream Spread",
    "a": "travisd1",
    "r": "0",
    "s": 6,
    "des": "\"Threw them together on a busy day and they were so good I wanted to share. Recommended to be topped with iceberg lettuce, thin sliced tomato, Monterey Jack cheese, and hot salsa, or better yet, hot picante.\"",
    "ins": "Combine ground chicken, green onions, egg whites, cilantro, jalapenos, 1 1/2 tablespoons sour cream, chipotle pepper, salt, and pepper in large bowl. Mix until sticky and difficult to handle.\nShape ground chicken mixture into patties. Combine bread crumbs, garlic powder, salt, and pepper in a bowl. Coat patties lightly with seasoned bread crumbs.\nHeat oil in a large skillet over medium heat. Cook patties until browned, about 2 minutes per side. Reduce heat to medium-low. Cover and cook until no longer pink in the center and the juices run clear, about 4 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nMash avocado and 1/2 cup sour cream together in a bowl. Season with salt and pepper. Spread over chicken patties.",
    "pt": "25 m",
    "ct": "12 m",
    "tt": "37 m",
    "i": "4530759.jpg",
    "o": "",
    "st": "allrecipes"
}