{
    "id": 258621,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "12 spears asparagus",
        "1 (8 ounce) package shredded mozzarella cheese",
        "4 skinless, boneless chicken thighs",
        "4 extra-thick bacon slices",
        "kitchen string",
        "2 tablespoons butter, divided",
        "2 jalapeno peppers - stemmed, seeded, and minced",
        "3 tablespoons all-purpose flour",
        "2 cups warm milk",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 447 kcal",
        "Carbs > 13.9 g",
        "Cholesterol > 117 mg",
        "Fat > 27.3 g",
        "Protein > 35.6 g",
        "Sodium > 1348 mg"
    ],
    "n": "Bacon-Wrapped Chicken Thighs Smothered and Stuffed with Awesome",
    "a": "Kat R",
    "r": "0",
    "s": 4,
    "des": "\"These are pretty much all of my favorite things layered into one extremely satisfying dish. You may have a lot of leftover bechamel sauce; bout a half of a box of cooked pasta will take care of this for you.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Line a 9-inch square pan with parchment paper.\nTrim asparagus spears to extend 1 inch past each side of the thighs.\nPlace 1 cup of the mozzarella cheese into a bowl.\nLay chicken thighs flat on a work surface. Place 1/4 cup mozzarella cheese on each thigh, followed by 3 asparagus spears. Roll thigh around stuffing; wrap 1 bacon slice around each thigh. Tie a 12-inch length of string around the bacon, ensuring bacon ends are secured. Place stuffed thighs in the lined pan.\nBake in the preheated oven until no longer pink in the center and juices run clear, 30 to 40 minutes. An instant-read thermometer inserted into the middle of a thigh should read at least 165 degrees F (74 degrees C).\nMelt 1 tablespoon butter in a small saucepan over medium-high heat; add jalapenos. Cook, stirring regularly, until juices have evaporated, 1 to 2 minutes. Add remaining butter, melt completely, about 1 minute. Stir in flour until it starts to brown, 1 to 2 minutes. Pour in warm milk, 1/3 cup at a time, mixing completely after each addition.\nBring milk mixture to a boil; reduce heat to medium-low. Simmer, stirring occasionally, until sauce thickens, about 7 minutes. Season sauce with salt and pepper. Add remaining mozzarella cheese, stir gently to incorporate into sauce.\nCut strings from thighs and smother with sauce.",
    "pt": "20 m",
    "ct": "46 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}