{
    "id": 258658,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Chicken Patties:",
        "2 (12.5 fl oz) cans chicken chunks, drained",
        "1 1/2 cups panko bread crumbs",
        "1 (4 ounce) packet saltine crackers, finely crushed",
        "1 cup sour cream",
        "2 eggs",
        "1/2 (1 ounce) package ranch dressing mix, or to taste",
        "1 tablespoon Dijon mustard",
        "1 tablespoon dried onion granules",
        "1 teaspoon ground black pepper",
        "1 tablespoon dried parsley",
        "1 tablespoon cooking oil, or as needed",
        "Creamy Cheddar Sauce:",
        "1 (11 ounce) can condensed Cheddar cheese soup",
        "1 cup chicken broth",
        "1 cup sour cream",
        "5 green onions, thinly sliced"
    ],
    "nut": [
        "Calories > 486 kcal",
        "Carbs > 34.9 g",
        "Cholesterol > 135 mg",
        "Fat > 27.8 g",
        "Protein > 28.2 g",
        "Sodium > 1319 mg"
    ],
    "n": "Ranch Chicken Patties with Creamy Cheddar Sauce",
    "a": "sadiebea",
    "r": "0",
    "s": 8,
    "des": "\"These are a great quick dinner with some steamed broccoli or green beans on the side. Most everything is from the pantry. To serve, place 2 patties on a plate and spoon sauce over. Garnish with chopped green onions if desired. Quick and easy!\"",
    "ins": "Mix chicken, panko, saltines, sour cream, eggs, ranch dressing mix, mustard, onion, black pepper, and parsley together in a bowl until well combined. Shape chicken mixture into 8 patties, approximately 3/4-inch thick.\nPour panko onto a plate, coat patties, and place on a platter. Chill for 1 hour or overnight.\nCoat a nonstick skillet with vegetable oil over medium heat. Cook patties until golden brown and heated through, 5 to 7 minutes per side. Place a layer of paper towels on a baking rack, transfer patties to paper towels to drain.\nCombine soup and broth in a saucepan; heat until just boiling, about 5 minutes. Reduce heat to low, stir sour cream and green onions into sauce. Serve patties with sauce on top.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "4534424.jpg",
    "o": "",
    "st": "allrecipes"
}