{
    "id": 258732,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups 2% milk",
        "1/2 cup unsalted butter",
        "2 eggs",
        "1 teaspoon salt",
        "3 cups bread flour",
        "1 (4 ounce) packet purple yam powder, or more to taste",
        "3 1/2 teaspoons bread machine yeast",
        "1/2 cup unseasoned bread crumbs, or as needed"
    ],
    "nut": [
        "Calories > 139 kcal",
        "Carbs > 19 g",
        "Cholesterol > 27 mg",
        "Fat > 5.1 g",
        "Protein > 4 g",
        "Sodium > 136 mg"
    ],
    "n": "Hot Ube Pandesal (Filipino Purple Yam Bread Rolls)",
    "a": "Ruby Hernandez",
    "r": "0",
    "s": 24,
    "des": "\"What I'm sharing here is my version of the hot pandesal we ate for breakfast as kids and even for merienda (snack time), with hot chocolate or warm milk. I love food with ube flavor thus incorporating it with my favorite breakfast bread. I know there are many pan de sal recipes online but hope you give this a try and let me know what you think. Thank you! Serve hot with or without spread/butter of your choice. For leftovers, warm in a toaster oven before serving for better taste.\"",
    "ins": "Pour milk into a microwave-safe bowl. Heat in the microwave until warm, about 1 minute.\nPlace butter in a microwave-safe bowl. Heat in the microwave until melted, about 30 seconds.\nPlace eggs in a bowl; cover with warm water for 1 minute. Drain and crack into the bowl; beat lightly with a fork.\nPlace warm milk, melted butter, eggs, salt, bread flour, purple yam powder, and bread machine yeast into a bread machine in the order listed. Run \"Dough\" cycle.\nPreheat oven to 375 degrees F (190 degrees C).\nTransfer dough to a greased bowl. Deflate dough with your fist. Cut into 24 oval pieces. Roll each piece into a ball.\nPour bread crumbs into a shallow plate; roll balls of dough in bread crumbs until coated. Arrange close together, slightly touching, in an ungreased baking pan.\nBake in the preheated oven until tops are golden brown, about 15 minutes.",
    "pt": "25 m",
    "ct": "17 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}