{
    "id": 258729,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup olive oil",
        "1 large clove garlic, peeled and crushed",
        "2 tablespoons chopped fresh rosemary, or more to taste",
        "2 tablespoons chopped fresh thyme, or more to taste",
        "4 Idaho potatoes, each cut into 8 wedges",
        "1 teaspoon garlic salt",
        "freshly ground black pepper to taste"
    ],
    "nut": [
        "Calories > 144 kcal",
        "Carbs > 19.2 g",
        "Cholesterol > 0 mg",
        "Fat > 6.9 g",
        "Protein > 2.3 g",
        "Sodium > 233 mg"
    ],
    "n": "Grilled Potato Wedges",
    "a": "Gypsy Girl",
    "r": "0",
    "s": 8,
    "des": "\"We just started cooking with a 30-inch gas grill after decades of using a WeberÂ® charcoal grill. While we still use the charcoal grill, the extra space allotted to us on the gas grill has made us really branch out with different sides. I created this one knowing we could put the potatoes directly on the grill and not have to make a foil packet to make it fit!\"",
    "ins": "Combine olive oil, crushed garlic, chopped rosemary, and chopped thyme in a covered container; let stand for 2 hours or longer.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nPut potatoes in a large saucepan and pour in enough salted water to cover; bring to a boil; cook over medium-high heat until mostly tender, 8 to 9 minutes. Drain potatoes and transfer to a bowl.\nRemove garlic from the olive oil mixture and discard. Pour oil over potatoes, sprinkle with garlic salt and black pepper, and toss to coat.\nPlace potatoes skin-side down on the grill over direct heat; reserve remaining oil. Grill for 10 minutes; move potatoes to indirect heat until completely cooked, 5 to 10 minutes. Transfer to a serving bowl and drizzle remaining oil over potatoes.",
    "pt": "10 m",
    "ct": "28 m",
    "tt": "2 h ",
    "i": "4534722.jpg",
    "o": "",
    "st": "allrecipes"
}