{
    "id": 258785,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup all-purpose flour",
        "2 tablespoons granulated sugar",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon apple pie spice",
        "1/4 teaspoon salt",
        "1/4 cup butter",
        "1 tablespoon butter",
        "3 cups sliced peeled fresh peaches",
        "1/2 cup granulated sugar",
        "1 tablespoon cornstarch",
        "1 cup fresh raspberries",
        "1 egg",
        "1/4 cup milk",
        "1 tablespoon turbinado (raw) sugar or coarse sugar",
        "Vanilla bean ice cream"
    ],
    "nut": [
        "Calories > 314 kcal",
        "Carbs > 49 g",
        "Cholesterol > 61 mg",
        "Fat > 11.8 g",
        "Protein > 4.1 g",
        "Sodium > 313 mg"
    ],
    "n": "Grilled Peach Cobbler from Dixie",
    "a": "Dixie",
    "r": "0",
    "s": 6,
    "des": "\"Fresh peach cobbler with raspberries and spiced biscuit toppers is 'baked' on the grill and served with vanilla bean ice cream.\"",
    "ins": "For biscuit topper, in a medium bowl combine flour, 2 tablespoons sugar, baking powder, apple pie spice, and salt. Using a pastry blender, cut in the 1/4 cup butter until mixture resembles coarse crumbs; set aside.\nIn a charcoal or gas grill preheat a 10-inch cast iron skillet over medium-high heat. Add 1 tablespoon butter and peaches to skillet. Cover and grill directly over heat for 4 to 5 minutes or until lightly charred. Remove from grill. (Or, cook on stove top over medium-high heat.)\nIn a small bowl, combine 1/2 cup sugar and cornstarch. Sprinkle over peaches in skillet and stir to combine. Gently fold in raspberries.\nTo finish topping, in a small bowl beat together egg and milk. Add to flour mixture, stirring to moisten. Using two spoons, drop batter into six mounds on top of filling. Sprinkle with turbinado sugar.\nArrange the grill for indirect grilling over medium heat. Place skillet on grill rack above burner that is off or in the center of the charcoal grill. Cover and grill 20 to 25 minutes or until a wooden toothpick inserted comes out clean. (Or, transfer to a 400 degrees F oven and bake 20 to 25 minutes.) Let cool for 20 minutes. Serve with ice cream.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "4530441.jpg",
    "o": "",
    "st": "allrecipes"
}