{
    "id": 25870,
    "old_rating": "4.41667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound fresh shrimp, peeled, deveined and finely minced",
        "1/2 yellow onion, minced",
        "1/2 cup finely chopped water chestnuts",
        "1/2 cup finely chopped celery",
        "1 green onion, finely chopped",
        "1/2 cup cooked crabmeat",
        "1 egg, beaten",
        "1 1/2 tablespoons chopped fresh parsley",
        "1 teaspoon sesame oil",
        "salt to taste",
        "ground black pepper to taste",
        "5 drops soy sauce",
        "1 teaspoon minced garlic",
        "2 cups oil for frying",
        "8 thick slices white bread",
        "1/4 cup soy sauce",
        "1 tablespoon water",
        "1 teaspoon sesame oil",
        "3 tablespoons chopped fresh parsley",
        "garlic powder to taste",
        "1 teaspoon white sugar"
    ],
    "nut": [
        "Calories > 454 kcal",
        "Carbs > 37.8 g",
        "Cholesterol > 238 mg",
        "Fat > 18.5 g",
        "Protein > 33.8 g",
        "Sodium > 1733 mg"
    ],
    "n": "Daddy's Shrimp Toast",
    "a": "LISA158",
    "r": "0",
    "s": 4,
    "des": "\"My father made this for me while experimenting in the kitchen. It was absolutely the most delicious way to use shrimp. I think I've gotten pretty good at making this dish but it still doesn't compare to my father's! Don't be fooled by the ingredients. Most are optional and this is easy to make! Great for parties as appetizers or a main dish.\"",
    "ins": "In a mixing bowl, combine the shrimp, onion, water chestnuts, celery, and green onion. Stir in crabmeat, egg, parsley, sesame oil, soy sauce, and garlic. Season with salt and pepper to taste.\nMake the dipping sauce:  In a small mixing bowl, whisk together soy sauce, water, sesame oil, parsley, garlic powder, and sugar; set aside.\nIn a heavy skillet, heat 2 cups oil, or enough to be 1/2 inch deep, over medium heat. Spread a thick layer of shrimp filling on one side of each slice of bread.\nFry the topped bread in hot oil until golden brown and shrimp is pink, turning once. Do not let the filling sit on the bread too long or the sandwich will get soggy. Drain on paper towels and let cool for a minute. Slice diagonally and serve with dipping sauce or alone.",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "40 m",
    "i": "1043854.jpg",
    "o": "",
    "st": "allrecipes"
}