{
    "id": 258786,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 whole chicken wings",
        "Salt and ground black pepper to taste",
        "1 teaspoon lime zest",
        "2 tablespoons lime juice",
        "2 tablespoons olive oil",
        "2 teaspoons honey",
        "2 teaspoons sriracha hot chili sauce or other hot sauce",
        "1 teaspoon chopped fresh rosemary",
        "3 cloves garlic, minced",
        "Lime wedges"
    ],
    "nut": [
        "Calories > 99 kcal",
        "Carbs > 2.2 g",
        "Cholesterol > 19 mg",
        "Fat > 7.2 g",
        "Protein > 6.3 g",
        "Sodium > 297 mg"
    ],
    "n": "Honey-Lime Grilled Chicken Wings",
    "a": "Dixie",
    "r": "0",
    "s": 10,
    "des": "\"Chicken wings are marinated in a lime-honey-sriracha blend then grilled over indirect heat until browned and tender.\"",
    "ins": "Cut off and discard the tips from the chicken wings. Cut the rest of the wings at the joints to make 2 pieces each. Sprinkle wing portions generously with salt and pepper.\nPlace wing portions in a resealable plastic bag set in a shallow dish. In a small bowl combine lime zest, lime juice, olive oil, honey, Sriracha sauce, rosemary and garlic. Pour half of the lime mixture over wings. Cover and chill the remaining lime mixture. Seal bag; turn to coat. Marinate in the refrigerator 2 to 8 hours, turning bag occasionally. Drain wings, discarding marinade.\nPrepare grill for indirect heat using a drip pan. Test for medium heat above the drip pan. Place wings over drip pan. Grill, covered, 30 minutes or until chicken is no longer pink, turning once and brushing with reserved marinade 5 minutes before the end of grilling time. Transfer wings over direct heat and grill 3 to 5 minutes more to crisp the skin, turning to brown both sides.\nServe with lime wedges.",
    "pt": "15 m",
    "ct": "33 m",
    "tt": "2 h ",
    "i": "4530442.jpg",
    "o": "",
    "st": "allrecipes"
}