{
    "id": 258720,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "6 potatoes, peeled and cut into small cubes",
        "1 onion, coarsely chopped",
        "3 cloves garlic, peeled and coarsely chopped",
        "1 red chile pepper, seeded and finely chopped (optional)",
        "2 uncooked, smoked turkey legs",
        "1 (8 ounce) can diced tomatoes",
        "1/2 head cabbage, thinly sliced",
        "1 cup canned baked beans in tomato sauce",
        "1 teaspoon smoked paprika",
        "1 pinch salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 325 kcal",
        "Carbs > 42.1 g",
        "Cholesterol > 45 mg",
        "Fat > 7.2 g",
        "Protein > 24.4 g",
        "Sodium > 248 mg"
    ],
    "n": "Roasted Potatoes and Smoked Turkey Legs",
    "a": "Delyse.Z.A.",
    "r": "0",
    "s": 8,
    "des": "\"Not knowing what to do with smoked turkey legs, I did a little research without much success, so I decided to try this out. My family loved it and couldn't believe it wasn't out of a recipe book. Serve with crusty bread to soak up all the juices and a lettuce and tomato salad. It's also delicious over pasta.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a Dutch oven or an oven-proof pot over medium heat. Add potatoes, onion, garlic, and chile pepper; cook and stir until onion is translucent, about 5 minutes. Place turkey legs on top; cover with diced tomatoes. Cover Dutch oven with lid.\nBake in the preheated oven until potatoes are tender, about 45 minutes. Turn turkey legs around to coat with tomato mixture. Stir cabbage and baked beans into the pot; season with paprika, salt, and pepper. Replace lid.\nContinue baking until turkey legs are tender, about 45 minutes. Pull turkey meat off the bones and cut into bite-sized pieces. Mix into the pot.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}