{
    "id": 258779,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup olive oil, or as needed, divided",
        "1 pound ground beef",
        "2 cloves garlic, minced",
        "2 teaspoons Italian seasoning, divided, or to taste",
        "1/2 teaspoon kosher salt, or to taste",
        "1/2 teaspoon ground black pepper, or to taste",
        "2 cups marinara sauce, divided",
        "1 eggplant, sliced",
        "2 small zucchini, sliced",
        "2 Cubanelle peppers, chopped",
        "2 cups sliced fresh mushrooms",
        "2 small sweet potatoes, thinly sliced, or more to taste"
    ],
    "nut": [
        "Calories > 223 kcal",
        "Carbs > 16.3 g",
        "Cholesterol > 28 mg",
        "Fat > 13.5 g",
        "Protein > 9.8 g",
        "Sodium > 339 mg"
    ],
    "n": "Loaded Sweet Potato Lasagna",
    "a": "Cindy Anschutz Barbieri",
    "r": "0",
    "s": 10,
    "des": "\"Every morning I love watching the Today Show while drinking my coffee. I normally watch the cooking segment (and critique it) and on this morning I was curious who Kevin Curry was from Fit Men Cook so I grabbed my cup of coffee and sat to watch his segment. \n\nI am Italian and love the gym. Currently I am doing a weight loss challenge at my gym called HEWFIT and this recipe inspired me to create this dish! \n\nI don't miss the cheese at all. Enjoy my paleo version.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking pan with 1 tablespoon olive oil.\nHeat 1 tablespoon oil in a large skillet over medium heat. Cook beef, breaking apart into small pieces using a wooden spoon, until browned, about 5 minutes. Move to a bowl using a slotted spoon.\nWipe the skillet clean with a paper towel. Heat the remaining 1 tablespoon oil. Add garlic and cook until fragrant, about 30 seconds. Add to the beef. Season beef with 1 teaspoon Italian seasoning, salt, and pepper. Stir in 1 1/2 cups marinara sauce until well combined.\nCook and stir eggplant in the skillet until soft, about 2 minutes per side. Season with salt. Set on a plate. Repeat with zucchini. Cook and stir mushrooms over medium heat until soft, about 5 minutes. Transfer to a bowl. Cook and stir Cubanelle peppers until tender, about 3 minutes.\nLay sweet potatoes evenly over the bottom of the baking pan, reserving a few slices. Layer eggplant, beef, zucchini, Cubanelle peppers, and mushrooms on top. Cover with the remaining 1/2 cup marinara. Top with the reserved sweet potato slices. Drizzle with oil; season with the remaining 1 teaspoon Italian seasoning, salt, and pepper. Cover with aluminum foil.\nBake in the preheated oven until sweet potatoes are soft, about 45 minutes. Remove aluminum foil and bake until golden brown, about 15 minutes more. Let rest for 5 minutes before serving.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}