{
    "id": 25873,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 large Spanish onions, sliced",
        "1 large ripe tomato",
        "1/2 cup olive oil",
        "3/4 cup fresh lemon juice",
        "4 (8 ounce) cans oysters",
        "1 large ripe tomato, diced",
        "3 green onions, chopped",
        "3/8 cup ketchup",
        "1/2 teaspoon soy sauce",
        "1/2 teaspoon garlic salt",
        "2 tablespoons chopped fresh parsley",
        "1/2 teaspoon granulated sugar",
        "salt to taste"
    ],
    "nut": [
        "Calories > 227 kcal",
        "Carbs > 15.7 g",
        "Cholesterol > 55 mg",
        "Fat > 15.2 g",
        "Protein > 8.4 g",
        "Sodium > 436 mg"
    ],
    "n": "Seviche",
    "a": "ROBERTAJ",
    "r": "0",
    "s": 9,
    "des": "\"This recipe was given to me by a dear friend from Ecuador. This dish is also great with raw shrimp, scallops, or fish. If using canned oysters, cover the dish with plastic wrap and place in refrigerator for about 30 minutes. If using raw shrimp, scallops, or fish, cover with plastic wrap and place in refrigerator for at least 2 hours or until they are opaque in the middle.\"",
    "ins": "In a saucepan over medium heat, add the sliced onions and add just enough water to cover. Bring to a simmer and cook just enough to soften. Remove from heat and drain. Rinse with cold water and drain.\nTake one 1 large tomato and score an 'X' , skin deep, on the top and bottom. Place in the same saucepan used for the onions and add enough water to cover. Bring to a simmer and cook until soft and the skin starts to peel, about 5 minutes. Remove the tomato and rinse under cold water until it's cool enough to hold in your hand. Using your fingers or the blade of a knife, gently peel off the skin. Place the peeled tomato in a blender and puree.\nIn a large glass dish or bowl, combine the onions, olive oil and lemon juice. Stir in the oysters, pureed tomato, diced tomato, green onions, ketchup and soy sauce. Season with garlic salt, parsley, sugar, and salt to taste.",
    "pt": "20 m",
    "ct": "",
    "tt": "",
    "i": "2934818.jpg",
    "o": "",
    "st": "allrecipes"
}