{
    "id": 258782,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 ears fresh sweet corn",
        "4 tablespoons olive oil, divided",
        "Salt and ground black pepper to taste",
        "1 medium cucumber, chopped",
        "1 1/2 cups blueberries",
        "1 small red onion, cut into thin wedges",
        "1/2 cup thinly sliced radishes",
        "1 fresh jalapeno chile, seeded and minced",
        "1 tablespoon snipped fresh cilantro",
        "1/2 teaspoon lime zest",
        "3 tablespoons lime juice",
        "1 tablespoon honey",
        "1/2 cup crumbled queso fresco"
    ],
    "nut": [
        "Calories > 131 kcal",
        "Carbs > 16.1 g",
        "Cholesterol > 4 mg",
        "Fat > 7.1 g",
        "Protein > 3.4 g",
        "Sodium > 42 mg"
    ],
    "n": "Blueberry Corn Salad",
    "a": "Dixie",
    "r": "0",
    "s": 10,
    "des": "\"When fresh sweet corn and blueberries are at their peak ripeness, this summer salad with cucumbers, radishes, and chopped jalapeno chiles makes a great salad for barbecues.\"",
    "ins": "Remove husks and silks from corn. Brush with 1 tablespoon of the olive oil and season with salt and pepper. For a gas or charcoal grill, grill corn on the rack of a covered grill directly over medium heat for 8 to 10 minutes, turning occasionally or until tender and lightly charred. (Or for a grill pan, heat a grill pan over medium heat. Grill corn on the grill pan for 8 to 10 minutes, turning occasionally until tender and lightly charred.) Cut kernels from the cobs.\nIn a medium bowl combine corn, cucumber, blueberries, red onion, radishes, jalapeno, and cilantro.\nIn a small screw-top jar combine lime zest, lime juice, remaining 3 tablespoons olive oil, and honey. Cover and shake until honey dissolves. Season to taste with salt and pepper. Add to corn mixture and toss to coat. Top with queso fresco.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "4530438.jpg",
    "o": "",
    "st": "allrecipes"
}