{
    "id": 258704,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cakes:",
        "2 cups white sugar",
        "1 cup butter, softened",
        "4 eggs",
        "3 cups self-rising flour",
        "1 cup 2% milk",
        "1 teaspoon vanilla extract",
        "Filling:",
        "1 (16 ounce) container sour cream",
        "1 (16 ounce) package frozen sweetened sliced strawberries, unthawed",
        "Frosting:",
        "1 (16 ounce) package frozen whipped topping, thawed",
        "1 pint whole fresh strawberries",
        "2 sprigs fresh mint, stemmed"
    ],
    "nut": [
        "Calories > 646 kcal",
        "Carbs > 77.7 g",
        "Cholesterol > 121 mg",
        "Fat > 35.1 g",
        "Protein > 7.9 g",
        "Sodium > 568 mg"
    ],
    "n": "Four-Layer Strawberry Cream Cake",
    "a": "The Durrett's",
    "r": "0",
    "s": 12,
    "des": "\"Since I first made this cake, everyone at work requests it for special occasions and I have even sold some! Keep refrigerated.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease four 9-inch round cake pans and line with parchment paper.\nCombine sugar and butter in a stand mixer fitted with the paddle attachment; beat until smooth and creamy. Beat in eggs one at a time. Mix in 1 cup flour. Beat in 1/2 cup milk. Repeat with remaining flour and milk, beating briefly after each addition. Scrape down sides of bowl and mix in vanilla extract.\nPour batter evenly into the prepared cake pans. Smooth the tops with a spatula.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 15 minutes. Cool cakes in the pans for 10 minutes; invert onto a wire rack to cool completely, about 20 minutes.\nMix sour cream and sliced strawberries together in a large bowl. Spread evenly between the cooled cake layers.\nFrost top and sides of cake with whipped topping. Decorate top of cake with whole strawberries and mint leaves.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}