{
    "id": 258767,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 ounces fresh porcini mushrooms",
        "3 cups beef stock",
        "1/4 cup extra-virgin olive oil, divided",
        "1 clove garlic, crushed",
        "1 cup white wine, divided",
        "1 bunch fresh parsley, chopped, divided",
        "salt to taste",
        "1 spring onion, finely sliced",
        "1 1/2 cups Arborio rice",
        "3/4 cup grated Parmesan cheese",
        "2 tablespoons butter"
    ],
    "nut": [
        "Calories > 644 kcal",
        "Carbs > 75.8 g",
        "Cholesterol > 28 mg",
        "Fat > 25 g",
        "Protein > 15.9 g",
        "Sodium > 389 mg"
    ],
    "n": "Risotto ai Funghi Porcini in Pentola a Pressione (Porcini Mushroom Risotto)",
    "a": "miche",
    "r": "0",
    "s": 4,
    "des": "\"Porcini are the most flavorful mushrooms you can find. This risotto recipe explains how to make the risotto the traditional way, as well as in a pressure cooker. With a pressure cooker, you can have this authentic Italian risotto ready after just 4 minutes of cooking!\"",
    "ins": "Brush dirt off porcini mushrooms with a clean cloth or vegetable brush. Slice into bite-sized pieces.\nPour beef stock into a saucepan over low heat. Cover and keep warm.\nHeat 2 tablespoons olive oil in a skillet over medium heat. Cook garlic until lightly golden, about 1 minute. Stir in mushrooms; cook until slightly softened, 2 to 3 minutes. Pour in 1/2 cup wine; cook until alcohol evaporates, 3 to 5 minutes. Continue cooking until mushrooms are tender but still firm, adding a little beef stock if they look dry, about 10 minutes.\nRemove skillet from heat; sprinkle half the parsley over mushrooms. Season with salt. Cover and keep warm.\nHeat remaining 2 tablespoons olive oil in a stovetop pressure cooker. Cook spring onion until softened, about 1 minute. Add Arborio rice; cook and stir until toasted and coated with oil, 2 to 3 minutes. Increase heat and pour in remaining 1/2 cup wine; simmer until alcohol has evaporated and rice has absorbed most of the wine, about 2 minutes.\nStir beef stock into the pressure cooker. Seal according to manufacturer's instructions. Increase heat to high; cook until cooker whistles, about 5 minutes. Reduce heat to low and cook for 4 minutes.\nRemove cooker from heat and release pressure according to manufacturer's instructions. Remove the lid. Fold mushroom mixture, with 1 to 2 tablespoons cooking liquid, into the rice. Stir in Parmesan cheese and butter. Let stand for 2 to 3 minutes. Sprinkle remaining parsley on top.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "47 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}