{
    "id": 258723,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (4 ounce) fillets tilapia",
        "salt and ground black pepper to taste",
        "1/4 cup all-purpose flour, divided",
        "1 teaspoon garlic powder",
        "1/4 cup margarine, divided",
        "2 tablespoons lemon juice",
        "2 tablespoons capers, drained and smashed",
        "1/2 cup fish stock",
        "1 tablespoon chopped fresh parsley"
    ],
    "nut": [
        "Calories > 251 kcal",
        "Carbs > 7.6 g",
        "Cholesterol > 41 mg",
        "Fat > 13 g",
        "Protein > 24.7 g",
        "Sodium > 443 mg"
    ],
    "n": "Tilapia Piccata",
    "a": "Savannah Leigh",
    "r": "0",
    "s": 4,
    "des": "\"Low cholesterol and alcohol free, this healthy fish version of chicken piccata pleases even my 5-year-old son. Serve with green beans or broccoli and whole wheat couscous, rice, or pasta.\"",
    "ins": "Season tilapia fillets on both sides with salt and pepper.\nMix 3 tablespoons flour and garlic powder together in a shallow bowl. Dredge tilapia fillets in flour mixture; shake off excess.\nMelt 3 tablespoons margarine in a large skillet over medium-high heat. Cook fillets in the hot margarine for 2 minutes. Flip; cook until crust is crisp and flesh just starts to flake when pressed with a fork, about 1 minute more. Transfer fillets to a paper towel-lined plate.\nMelt remaining 1 tablespoon margarine in the same skillet over medium heat. Scrape the browned bits of fish off the bottom of the skillet with a wooden spoon. Stir in remaining 1 tablespoon flour until thickened. Add lemon juice and capers.\nPour fish stock into the skillet; cook, stirring frequently, until reduced by half, 5 to 10 minutes. Return fillets to the skillet and spoon reduced stock on top. Garnish with parsley.",
    "pt": "15 m",
    "ct": "8 m",
    "tt": "23 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}