{
    "id": 258764,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Filling:",
        "2 pounds sheep's milk ricotta cheese",
        "1 1/2 cups confectioners' sugar",
        "1/4 cup mixed peel",
        "1 1/2 ounces dark chocolate, finely chopped",
        "Cannoli Shells:",
        "1 1/4 cups all-purpose flour",
        "3 tablespoons dry Marsala wine, or more to taste",
        "1 tablespoon butter, softened",
        "1 tablespoon white sugar",
        "2 teaspoons vinegar, or more to taste",
        "corn oil for frying",
        "Topping:",
        "3 tablespoons chopped pistachio nuts",
        "2 tablespoons confectioners' sugar, or to taste"
    ],
    "nut": [
        "Calories > 177 kcal",
        "Carbs > 25.2 g",
        "Cholesterol > 16 mg",
        "Fat > 5.5 g",
        "Protein > 6.6 g",
        "Sodium > 68 mg"
    ],
    "n": "Cannoli alla Siciliana (Sicilian Cannoli)",
    "a": "Maria",
    "r": "0",
    "s": 20,
    "des": "\"Not only do these little Italian pastries look and taste delicious, but this cannoli recipe stays true to the classic version, right down to the mixed peel and chocolate pieces in the filling and the finish of chopped pistachios on top. You won't be able to resist these! Fill the cannoli just before serving or the shells will get soggy.\"",
    "ins": "Beat ricotta cheese and 1 1/2 cup confectioners' sugar together in a bowl until smooth. Stir in mixed peel and chocolate. Cover and refrigerate for 3 hours.\nMix flour, Marsala wine, butter, sugar, and vinegar together in a bowl to make cannoli dough. Wrap in plastic wrap; let rest for 30 minutes.\nKnead dough on a lightly floured work surface until smooth. Roll to 1/8-inch thickness. Cut into twenty 4-inch squares. Wrap each square around a metal tubular mold, overlapping ends and dabbing with warm water to seal.\nHeat oil in a large saucepan over medium-high heat. Lower some cannoli molds into the hot oil; cook until shells are golden and crisp, about 10 minutes. Drain on paper towels. Repeat with remaining cannoli molds. Cool briefly; twist molds carefully to remove shells. Let shells cool completely, about 15 minutes.\nFill cooled cannoli shells with ricotta filling using a spoon or piping bag. Arrange cannoli on a serving platter. Garnish with pistachios; sprinkle 2 tablespoons confectioners' sugar on top.",
    "pt": "35 m",
    "ct": "10 m",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}