{
    "id": 258865,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package elbow macaroni",
        "6 tablespoons butter, divided",
        "1 tablespoon olive oil",
        "1 large shallot, minced",
        "3 cloves garlic, pressed",
        "3 tablespoons all-purpose flour",
        "1 (12 ounce) can evaporated milk",
        "1/4 cup 2% milk",
        "1 cup shredded sharp Cheddar cheese",
        "1 cup grated fontina cheese",
        "1 cup shredded Monterey Jack cheese",
        "3 tablespoons grated Parmesan cheese",
        "1/2 cup sour cream",
        "2 eggs",
        "1 tablespoon prepared yellow mustard",
        "1 teaspoon Worcestershire sauce",
        "1/2 teaspoon chipotle-flavored hot sauce (such as TabascoÂ® Chipotle Pepper Sauce)",
        "1 teaspoon liquid smoke flavoring",
        "1/2 teaspoon dried oregano",
        "salt and ground black pepper to taste",
        "1/4 cup Italian-seasoned bread crumbs"
    ],
    "nut": [
        "Calories > 420 kcal",
        "Carbs > 36.3 g",
        "Cholesterol > 91 mg",
        "Fat > 22.9 g",
        "Protein > 17.1 g",
        "Sodium > 379 mg"
    ],
    "n": "Smoky Fontina Mac",
    "a": "HomeCookinMom",
    "r": "0",
    "s": 12,
    "des": "\"This is a smoky, rich change from ordinary mac 'n cheese. I make this recipe and my family of 4 can eat on it for dinner for a few days.... Just change up your veggies every day and top your mac with bacon one day and fresh chopped parsley the next. Try it and you won't be disappointed!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch glass baking dish.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally, until tender yet firm to the bite, about 8 minutes. Drain.\nHeat 2 tablespoons butter and olive oil in a large saucepan over medium heat. Cook and stir shallot and garlic until slightly softened, about 3 minutes. Stir in flour; cook until flour turns a pale tan color, about 2 minutes. Stir in evaporated milk and 2% milk; cook over low heat until sauce thickens, about 5 minutes.\nStir Cheddar cheese, fontina cheese, Monterey Jack cheese, and Parmesan cheese into the sauce until melted and smooth.\nMix sour cream, eggs, mustard, Worcestershire sauce, and hot sauce together in a bowl. Stir in 1/2 cup sauce until well blended. Pour sour cream mixture into the saucepan. Stir in macaroni, liquid smoke, oregano, salt, and pepper.\nSpread macaroni and sauce in the prepared baking dish.\nHeat remaining 1/4 butter in a microwave-safe bowl until melted, about 30 seconds. Stir in bread crumbs; sprinkle over macaroni and sauce.\nBake in the preheated oven until top is golden brown and bubbly, 45 minutes to 1 hour. Let cool for 15 minutes before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}