{
    "id": 258805,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Dressing:",
        "1/4 cup real French Dijon mustard",
        "1/4 cup seasoned rice vinegar",
        "1/4 cup vegetable oil",
        "1/4 teaspoon Worcestershire sauce",
        "freshly ground black pepper",
        "1 pinch cayenne pepper, or to taste",
        "Toasted Pecans:",
        "3/4 cup pecan halves",
        "2 teaspoons vegetable oil",
        "1 pinch salt, or to taste",
        "1 teaspoon white sugar",
        "Salad:",
        "4 hearts of romaine, cut or torn into bite-size pieces",
        "1 apple, thinly sliced",
        "2 tablespoons chopped fresh dill",
        "2 tablespoons chopped fresh tarragon",
        "2 ounces extra sharp aged Cheddar cheese"
    ],
    "nut": [
        "Calories > 386 kcal",
        "Carbs > 14.2 g",
        "Cholesterol > 15 mg",
        "Fat > 35.3 g",
        "Protein > 6.6 g",
        "Sodium > 830 mg"
    ],
    "n": "The Brutus Salad",
    "a": "Chef John",
    "r": "0",
    "s": 4,
    "des": "\"Watch your back, Caesar! This salad could be the next national favorite and was inspired by a salad I had at a seafood restaurant in Healdsburg, CA. With apple slices, romaine lettuce, Cheddar cheese, fresh herbs, toasted pecans, and Dijon vinaigrette, it's amazing.\"",
    "ins": "Place Dijon mustard, vegetable oil, seasoned rice vinegar, Worcestershire sauce, pepper, and cayenne into a bowl. Whisk thoroughly until well blended, about a minute. Transfer to an easy-to-pour container.\nPlace pecans in a skillet over medium heat. Drizzle with vegetable oil. Cook and stir until pecans smell toasty and have darkened slightly, 1 or 2 minutes. Sprinkle with kosher salt and sugar. Cook and stir another minute; remove from heat. Transfer to a plate to cool.\nPlace romaine pieces into a large bowl. Add apple slices, dill, tarragon, and a handful of pecans, reserving some for garnish. Grate Cheddar lightly onto salad, reserving some for garnish. Drizzle in some dressing and toss. Taste and add more salt or dressing if desired. You make not need all of the dressing.\nGarnish with a few toasted pecans and some grated Cheddar cheese.",
    "pt": "20 m",
    "ct": "4 m",
    "tt": "34 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}