{
    "id": 258848,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound ground lamb",
        "1 pound ground beef",
        "1/2 cup finely diced yellow onion",
        "4 cloves garlic, crushed",
        "1 tablespoon minced fresh rosemary",
        "2 teaspoons dried oregano",
        "2 teaspoons kosher salt, or to taste",
        "1 teaspoon fresh ground black pepper",
        "1 teaspoon cumin",
        "1 teaspoon paprika",
        "1/8 teaspoon ground cinnamon",
        "1/8 teaspoon cayenne pepper",
        "2 tablespoons dry bread crumbs",
        "1 tablespoon olive oil"
    ],
    "nut": [
        "Calories > 255 kcal",
        "Carbs > 3.4 g",
        "Cholesterol > 72 mg",
        "Fat > 17.8 g",
        "Protein > 19.3 g",
        "Sodium > 549 mg"
    ],
    "n": "American Gyros",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"Authentic Greek gyros are made with pork and chicken, but I prefer this version. It uses the same spices but is made with ground lamb and/or beef. Plus it's perfect for making ahead of time and heating it when you make your gyros. Don't forget to make tzatziki!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x13-inch baking dish. Line with parchment paper that extends up the sides. Turn the parchment paper over so the oiled side is up.\nPlace ground lamb and beef in a mixing bowl. Add onions, garlic, rosemary, oregano, salt, pepper, cumin, paprika, cinnamon, cayenne pepper, and bread crumbs. Mix until well combined. Transfer to prepared baking dish and press the meat mixture firmly into the dish in an even layer that extends to the edges. Meat mixture should be packed and fairly dense.\nBake in preheated oven until nicely browned, 40 to 45 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Cool to room temperature. Transfer to a plate. Cover with plastic wrap and refrigerate until chilled, 1 to 2 hours.\nTransfer meat to a cutting board. Cut into 3 pieces crosswise. Slice each piece into 1/8-inch thick slices as you need them.\nHeat oil in a skillet over medium-high heat. Cook slices until browned, about 2 minutes per side.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}