{
    "id": 258814,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons vegetable oil, or more as needed",
        "1 large onion, coarsely chopped",
        "1 pound ground beef, or more to taste",
        "1 egg",
        "1 tablespoon plain yogurt, or to taste",
        "1 tablespoon garlic paste",
        "1 tablespoon ginger paste",
        "1 teaspoon ground coriander",
        "1 1/2 teaspoons salt",
        "1 teaspoon ground red pepper, or more to taste",
        "Sauce:",
        "1 1/2 teaspoons cumin seeds",
        "1 cup tomato sauce",
        "1 teaspoon salt"
    ],
    "nut": [
        "Calories > 344 kcal",
        "Carbs > 11.1 g",
        "Cholesterol > 112 mg",
        "Fat > 22.4 g",
        "Protein > 22.6 g",
        "Sodium > 1990 mg"
    ],
    "n": "Oven-Baked Kofta Kebabs (Pakistani-Style)",
    "a": "sommer",
    "r": "0",
    "s": 4,
    "des": "\"These delicious kebabs are guaranteed to be a big hit! This recipe has been in my husband's family for generations. Serve with basmati rice or naan.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat oil in a large skillet over medium-high heat. Saute onion until golden brown, about 5 minutes. Transfer onion and 1 tablespoon of the oil from the skillet to a food processor and puree until smooth. Reserve remaining oil in the skillet.\nPlace onion puree, beef, egg, yogurt, garlic paste, ginger paste, coriander, salt, and red pepper in a bowl. Mix by hand to combine. Form beef mixture into 4 to 5-inch-long kebabs using oiled hands. Arrange in a baking pan.\nSaute cumin seeds in the reserved oil over medium-high heat until blackened, about 5 minutes. Stir in tomato sauce, and salt; cook until heated through, about 5 minutes more. Pour the sauce over the kebabs. Cover with aluminum foil.\nBake in the preheated oven until beef is no longer pink in the center, about 20 minutes. Uncover and turn on the broiler. Broil until brown, about 5 minutes more.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "4536927.jpg",
    "o": "",
    "st": "allrecipes"
}