{
    "id": 258866,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (8 ounce) packages cream cheese, at room temperature",
        "1 (3.4 ounce) package instant vanilla pudding mix",
        "1 (16 ounce) container whipped topping (such as Cool WhipÂ®), divided",
        "1 1/2 cups white sugar, divided",
        "2 cups water",
        "5 tablespoons cornstarch",
        "2 (3 ounce) packages strawberry-flavored gelatin mix (such as Jell-OÂ®)",
        "2 tablespoons lemon juice",
        "2 quarts fresh strawberries, thinly sliced",
        "1 (10 ounce) angel food cake, cut into bite-sized pieces",
        "1 (8 ounce) container whipped topping (such as Cool WhipÂ®)"
    ],
    "nut": [
        "Calories > 537 kcal",
        "Carbs > 70.8 g",
        "Cholesterol > 41 mg",
        "Fat > 27.6 g",
        "Protein > 5.6 g",
        "Sodium > 316 mg"
    ],
    "n": "Strawberry Vanilla Trifle",
    "a": "KMBSinkhorn",
    "r": "0",
    "s": 12,
    "des": "\"Creamy and oh so good. I make this amount for a group, but you could easily half the recipe. This trifle is best refrigerated several hours or overnight before serving.\"",
    "ins": "Combine cream cheese and vanilla pudding mix in a large bowl; beat with an electric mixer on high speed until smooth and creamy. Add large container of whipped topping; beat on high speed until thoroughly combined. Beat in 1/2 cup sugar.\nStir water and cornstarch together in a saucepan. Set over medium heat. Pour in remaining 1 cup sugar, strawberry-flavored gelatin mix, and lemon juice. Bring to a boil, stirring constantly until thickened. Remove from heat; let cool for 5 minutes. Fold in strawberries.\nSpread 3/4 inch of the cream cheese mixture in the bottom of a trifle bowl. Top with half of the cake pieces. Add half of the strawberry gelatin mixture. Repeat layers.\nFold small container of whipped topping into the remaining cream cheese mixture. Spread over the top of the trifle. Place trifle in the refrigerator.",
    "pt": "20 m",
    "ct": "5 m",
    "tt": "30 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}