{
    "id": 258858,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup unsalted butter",
        "12 leaves fresh sage",
        "4 thin slices prosciutto",
        "4 skinless, boneless chicken breasts, pounded flat",
        "8 slices fontina cheese, thinly sliced",
        "ground black pepper to taste",
        "Sauce:",
        "1 cup dry white wine (optional)",
        "1 teaspoon minced fresh sage (optional)",
        "1/4 cup unsalted butter (optional)"
    ],
    "nut": [
        "Calories > 629 kcal",
        "Carbs > 2.9 g",
        "Cholesterol > 198 mg",
        "Fat > 45.7 g",
        "Protein > 39.8 g",
        "Sodium > 653 mg"
    ],
    "n": "Chicken with Prosciutto, Sage, and Fontina Cheese",
    "a": "LISA VAN GELDER",
    "r": "0",
    "s": 4,
    "des": "\"Elegant, delicious and simple to prepare. The fontina cheese is creamy, rich, and nutty. Fresh sage leaves, browned in butter, give this dish a unique taste. It can be altered for calories and fat content easily. The sauce is optional; pour it over the chicken before serving.\"",
    "ins": "Heat 1/4 cup butter in a large skillet over medium heat. Allow butter to foam; add sage leaves and cook for 1 to 2 minutes per side. Remove and reserve leaves; reserve butter in the skillet.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nPlace 1 slice of prosciutto on each chicken breast. Put chicken, prosciutto side down, in the warm skillet with reserved butter. Cook chicken over medium heat until no longer pink in the center and the juices run clear, 5 to 6 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nTransfer chicken to a baking sheet, reserving skillet contents. Layer 3 sage leaves and 2 slices of fontina cheese on each chicken breast.\nBroil until cheese is melted, 3 to 5 minutes.\nAdd wine to the skillet used to cook the chicken. Cook and stir over high heat, scraping the bottom of the skillet, until reduced to 1/2 cup, about 5 minutes. Add minced sage; cook and stir for 1 minute. Whisk in 1/4 cup butter; reduce heat to low and simmer for 1 to 2 minutes. Serve sauce alongside chicken.",
    "pt": "10 m",
    "ct": "22 m",
    "tt": "32 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}