{
    "id": 258845,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Gelatin:",
        "2 cups boiling water",
        "1 (6 ounce) package cherry-flavored gelatin mix (such as Jell-OÂ®)",
        "2 cups cold water",
        "cooking spray",
        "1 (15.25 ounce) package yellow cake mix (such as Duncan HinesÂ®)",
        "1 cup water",
        "3 eggs",
        "1/3 cup vegetable oil",
        "2 bananas, sliced",
        "3 cups milk",
        "1 (4.6 ounce) package cook-and-serve banana cream pudding mix",
        "1 1/2 cups sliced strawberries",
        "1 cup heavy whipping cream",
        "1 cup pitted and halved Rainier cherries",
        "1/4 cup chopped pecans"
    ],
    "nut": [
        "Calories > 348 kcal",
        "Carbs > 46.2 g",
        "Cholesterol > 59 mg",
        "Fat > 16.4 g",
        "Protein > 5.7 g",
        "Sodium > 331 mg"
    ],
    "n": "Gramma Durbin's Trifle Cake",
    "a": "Marcy",
    "r": "0",
    "s": 16,
    "des": "\"My grandmother, born in 1916, loved all things Jell-OÂ®! While going through her recipes, I adapted one of her favorites for my daughter's 33rd birthday party! I remember we loved this as children and it served a lot of people.  Gramma's version featured only bananas for fruit. She also used Dream WhipÂ® to top it. I added the extra fruit and used real whipped cream because let's face it; Dream WhipÂ® just doesn't hold the appeal it did in the late 60's!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking pan with cooking spray.\nCombine cake mix, 1 cup water, eggs, and oil in a bowl. Beat with an electric mixer until blended. Pour batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 23 to 28 minutes. Cool on a rack, about 15 minutes.\nMix 2 cups boiling water and gelatin mix together in a bowl until dissolved. Stir in 2 cups cold water.\nTransfer cake to a flat work surface. Cut out and discard the hard edges; crumble the rest of the cake onto the bottom of the baking pan. Spoon gelatin over cake; cover with bananas. Refrigerate until set, 2 to 4 hours.\nCombine milk and pudding mix in a saucepan over medium heat. Bring to a boil, stirring constantly. Remove from heat and let cool until slightly thickened, about 10 minutes. Pour over the bananas. Layer strawberries on top. Chill trifle until set, 20 to 30 minutes.\nBeat cream in a chilled glass or metal bowl with an electric mixer until soft peaks form. Spread over the trifle. Place cherries on top. Add pecans.",
    "pt": "35 m",
    "ct": "28 m",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}