{
    "id": 258824,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 small spaghetti squash, halved and seeded",
        "2 tablespoons extra-virgin olive oil, divided",
        "1/4 cup chopped white onion",
        "1 clove garlic, minced",
        "2 skinless, boneless chicken breasts, cut into 1-inch pieces",
        "1/2 (15 ounce) can fire-roasted diced tomatoes",
        "1 teaspoon Italian seasoning",
        "1/2 teaspoon ground paprika",
        "salt and ground black pepper to taste",
        "1 tablespoon shredded Parmesan cheese, or to taste",
        "1 pinch dried oregano"
    ],
    "nut": [
        "Calories > 362 kcal",
        "Carbs > 25 g",
        "Cholesterol > 60 mg",
        "Fat > 18 g",
        "Protein > 25.8 g",
        "Sodium > 489 mg"
    ],
    "n": "Chicken with Spaghetti Squash and Fire-Roasted Tomatoes",
    "a": "Desirae",
    "r": "0",
    "s": 2,
    "des": "\"A great, healthy alternative to noodles for spaghetti with a little spice!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Place spaghetti squash cut-side down in a nonstick baking pan.\nBake spaghetti squash in the preheated oven until tender when pierced with a fork, about 45 minutes. Cool in the pan for 5 minutes. Transfer to a cooling rack; cool until easily handled.\nHeat 1 tablespoon olive oil in a large skillet over medium heat. Add onion and garlic; cook and stir until onion softens, 3 to 5 minutes. Stir in chicken breasts, tomatoes with juice, Italian seasoning, and paprika; cook until chicken is no longer pink in the center, 15 to 20 minutes. Remove from heat; spoon out excess liquid.\nScrape squash flesh into spaghetti strands using a fork. Stir squash strands into the skillet. Fold in remaining 1 tablespoon olive oil with a spatula. Season with salt and pepper. Serve in a pasta bowl garnished with Parmesan cheese and oregano.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4540046.jpg",
    "o": "",
    "st": "allrecipes"
}