{
    "id": 258818,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup extra-virgin olive oil , divided",
        "1 red bell pepper, thinly sliced",
        "1 green bell pepper, thinly sliced",
        "1 small yellow onion, chopped",
        "2 skinless, boneless chicken breast halves",
        "1/4 teaspoon garlic powder, or to taste",
        "salt and ground black pepper to taste",
        "1 (16 ounce) package penne pasta",
        "1 teaspoon minced garlic",
        "1/4 cup all purpose flour",
        "1/2 cup nonfat plain Greek yogurt",
        "2 tablespoons freshly grated Parmesan cheese",
        "2 tablespoons crumbled blue cheese",
        "1 cup low-sodium chicken broth"
    ],
    "nut": [
        "Calories > 353 kcal",
        "Carbs > 47 g",
        "Cholesterol > 22 mg",
        "Fat > 11.4 g",
        "Protein > 16.2 g",
        "Sodium > 109 mg"
    ],
    "n": "Josh's Skinny Chicken Pasta",
    "a": "steubner",
    "r": "0",
    "s": 8,
    "des": "\"My late husband created this dish, and it was one of our family favorites. He taught me to cook it, and now it's one that my boys request all the time! I tweaked it to make it 'skinny.' It's great with shrimp or veggies also!\"",
    "ins": "Heat 2 tablespoons olive oil in a large skillet over medium-high heat; add red bell pepper, green bell pepper, and onion. Cook and stir until onion begins to brown, about 5 minutes.\nSeason chicken with garlic powder, salt, and pepper; add to skillet. Cook until chicken is no longer pink in the center and the juices run clear, 4 to 5 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove chicken from skillet and slice thinly.\nBring a large pot of lightly salted water to a boil; add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain; return to pot.\nHeat 2 tablespoons olive oil in a skillet over medium heat. Add minced garlic; stir until starting to brown, about 3 minutes. Whisk in flour; stir frequently to dissolve lumps and avoid burning, 2 to 3 minutes. Reduce heat to medium-low; stir yogurt into flour mixture. Add broth slowly until sauce is thinned, about 3 minutes. Add Parmesan cheese and blue cheese; stir until melted.\nStir peppers and onions into sauce; season with salt and pepper. Pour sauce over pasta; stir to coat. Mix in chicken.",
    "pt": "15 m",
    "ct": "32 m",
    "tt": "47 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}