{
    "id": 258846,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Almond Cake:",
        "1 (18.25 ounce) package white cake mix",
        "1 cup water",
        "4 eggs",
        "1 (3.4 ounce) package instant vanilla pudding mix",
        "1/3 cup vegetable oil",
        "1 tablespoon almond extract",
        "Cannoli Cream:",
        "2 (15 ounce) containers ricotta cheese",
        "1 cup confectioners' sugar",
        "4 tablespoons white sugar",
        "2 teaspoons vanilla extract",
        "Whipped Cream:",
        "1 cup heavy whipping cream, or as needed",
        "1/4 (16 ounce) package confectioners' sugar, or more to taste",
        "1 teaspoon vanilla extract, or more to taste",
        "1/2 cup chocolate chips, or to taste"
    ],
    "nut": [
        "Calories > 351 kcal",
        "Carbs > 44 g",
        "Cholesterol > 62 mg",
        "Fat > 16.4 g",
        "Protein > 7.5 g",
        "Sodium > 309 mg"
    ],
    "n": "Almond Cake Cannoli Trifle",
    "a": "Alison C. NJ",
    "r": "0",
    "s": 20,
    "des": "\"This is a delightful trifle of almond cake with layers of cannoli cream and chocolate chips. Top it off with fresh whipped cream for a beautiful and tasty dessert!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10-inch fluted tube pan (such as Bundt(R)).\nCombine cake mix, water, eggs, pudding mix, and almond extract in a bowl. Blend on low with an electric mixer until moistened. Increase speed to medium and blend about 2 minutes more. Pour into the prepared pan.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 40 to 45 minutes. Cool in the pan for 25 minutes; transfer cake to cooling rack.\nCombine ricotta cheese, 1 cup confectioners' sugar, white sugar, and vanilla extract in a bowl. Whip cannoli cream until smooth using an electric mixer.\nBeat heavy cream in a chilled glass or metal bowl with an electric mixer until foamy. Add 1/4 cup confectioners' sugar and 1 teaspoon vanilla extract at a time to achieve desired sweetness, continuing to beat until cream is stiff.\nTransfer cooled cake to a cutting board and cut into small, bite-size pieces. Arrange 1 layer of cake pieces to cover the bottom of a trifle bowl. Top with a layer of chocolate chips and the cannoli cream. Continue with layers until bowl is nearly full; top with the whipped cream and chocolate chips.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}