{
    "id": 258945,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2/3 cup olive oil",
        "3 tablespoons lemon juice, divided",
        "3 tablespoons water",
        "2 teaspoons Italian seasoning",
        "4 teaspoons lemon zest, divided",
        "1/2 teaspoon oregano",
        "salt and ground black pepper to taste",
        "3 large tomatoes, seeded and thinly sliced",
        "1 large English cucumber, thinly sliced",
        "2 green bell pepper, cut into rings",
        "1/2 small red onion, thinly sliced",
        "1/4 cup artichoke hearts, drained and chopped",
        "2 cloves garlic, pressed",
        "4 pita bread rounds",
        "4 chicken breasts, cut into bite-size pieces"
    ],
    "nut": [
        "Calories > 641 kcal",
        "Carbs > 41.9 g",
        "Cholesterol > 65 mg",
        "Fat > 39.9 g",
        "Protein > 30.7 g",
        "Sodium > 386 mg"
    ],
    "n": "Chicken with Greek-Style Vegetables",
    "a": "teenxxchef",
    "r": "0",
    "s": 4,
    "des": "\"Grilled chicken with vegetables, topped with Greek salad dressing. The chicken cooks well in grill pans or panini makers, because it is cut into pita-sized pieces.\"",
    "ins": "Preheat grill for medium heat and lightly oil the grate.\nCombine olive oil, 2 tablespoons lemon juice, water, 2 teaspoons Italian seasoning, 1 teaspoon lemon zest, oregano, salt, and pepper in a bowl.\nPlace cucumber, green pepper, red onion, artichoke hearts, and garlic in a large bowl. Toss salad to distribute evenly. Cut each pita bread round into 4 to 5 slices.\nToast pita bread on the preheated grill until slight grill marks appear, about 4 minutes.\nPlace chicken in a grill pan and coat with the remaining 1 tablespoon lemon juice, 1 tablespoon lemon zest, salt, and pepper. Transfer the pan to the grill.\nGrill the chicken until no longer pink in the center and the juices run clear, 5 to 10 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nArrange chicken, salad, and pita bread on a serving plate and enjoy sandwich-style or as individual components.",
    "pt": "30 m",
    "ct": "14 m",
    "tt": "44 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}