{
    "id": 258973,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup boiling water",
        "1/2 teaspoon saffron",
        "1 pinch salt",
        "1 (2 ounce) package cake yeast",
        "1/4 cup warm water",
        "1 pinch white sugar",
        "1 cup white sugar",
        "1 1/2 teaspoons salt",
        "1/4 teaspoon ground nutmeg",
        "2 cups milk",
        "3/4 cup shortening, melted and cooled",
        "1 tablespoon lemon extract",
        "2 tablespoons lemon zest",
        "2 eggs, at room temperature",
        "8 cups all-purpose flour, sifted",
        "1 cup raisins",
        "1 cup dried currants"
    ],
    "nut": [
        "Calories > 298 kcal",
        "Carbs > 51.1 g",
        "Cholesterol > 18 mg",
        "Fat > 8 g",
        "Protein > 6 g",
        "Sodium > 168 mg"
    ],
    "n": "Sweet Saffron Buns",
    "a": "LCOADY",
    "r": "0",
    "s": 24,
    "des": "\"A sweet and savory breakfast roll.\"",
    "ins": "Combine 1/2 cup boiling water, saffron, and 1 pinch salt in a small bowl; steep for 8 hours to overnight.\nCrumble yeast into a small bowl; add 1/4 cup warm water and 1 pinch sugar.\nMix 1 cup sugar, 1 1/2 teaspoon salt, and nutmeg in a large bowl.\nHeat milk in a small saucepan over medium heat until it begins to bubble, about 5 minutes. Remove from heat; allow to cool for 5 minutes.\nBeat saffron water, scalded milk, shortening, lemon extract, and lemon zest together in a bowl. Add eggs; stir to combine.\nPour yeast mixture and milk mixture into sugar mixture; mix well. Add flour 1/2 cup at a time; mix after each addition until incorporated. Stir in raisins and currants. Knead dough well; transfer to a greased bowl and cover with plastic wrap. Allow dough to rise until doubled in size, 1 to 2 hours.\nPreheat oven to 350 degrees F (175 degrees C). Grease two 9x12-inch baking pans.\nTurn dough out onto a lightly floured surface; divide in half. Form each half into 12 equal balls; arrange in prepared baking pans. Allow dough to rise again, 30 minutes to 1 hour.\nBake in the preheated oven until golden, about 30 minutes.",
    "pt": "30 m",
    "ct": "35 m",
    "tt": "10 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}