{
    "id": 258997,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2/3 cup whole milk",
        "3 tablespoons brown sugar",
        "3 tablespoons white sugar",
        "1 (.25 ounce) package active dry yeast",
        "6 1/2 tablespoons unsalted butter, melted, divided",
        "1 eggs",
        "2 cups all-purpose flour",
        "2 tablespoons honey, or more to taste",
        "1 teaspoon salt, or as needed"
    ],
    "nut": [
        "Calories > 182 kcal",
        "Carbs > 26.1 g",
        "Cholesterol > 33 mg",
        "Fat > 7.3 g",
        "Protein > 3.4 g",
        "Sodium > 208 mg"
    ],
    "n": "Almost Heaven Honey Butter Yeast Rolls",
    "a": "drtrmiller",
    "r": "0",
    "s": 12,
    "des": "\"A familiar, famously fluffy and buttery-sweet Southern comfort, these yeast rolls are sure to satisfy day or night. The combination of white and brown sugars with the honey lends to the rich complexity of the sugar profile, and elevates the dish from just another buttery roll, to an inimitable southern comfort. Halve the dough and roll to make a soft and fluffy cinnamon roll base, or sprinkle sugar on top after baking and buttering for a doughnut breakfast alternative.\"",
    "ins": "Mix milk, brown sugar, and white sugar together in a microwave-safe bowl. Microwave until warm, 40 to 50 seconds. Stir in yeast.\nWhisk 6 tablespoons butter and eggs in a separate bowl. Whisk into the milk mixture until just combined, 30 to 60 seconds. Stir in flour, 1/2 cup at a time, mixing well after each addition until dough is smooth and still wet.\nPlace dough in a greased bowl. Loosely cover and let rise in a warm, dry place until doubled in volume, about 1 hour.\nTransfer dough to a floured work surface. Drizzle with honey and salt. Fold in half and repeat the honey-salt drizzle. Repeat folding and drizzling, 5 to 6 times.\nRoll dough into a rectangle about 1/2-inch in thickness. Cut into 12 equal pieces using a pizza cutter. Place rolls on lightly greased 9x13-inch baking pans or on lightly greased baking sheets. Cover rolls with a light cloth and let rise again until doubled in volume, 45 minutes to 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nBake rolls in the preheated oven until tops begin to brown, 11 to 14 minutes. Brush the remaining 1/2 tablespoon butter and some honey over the rolls right after removing from the oven.",
    "pt": "20 m",
    "ct": "12 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}