{
    "id": 258906,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Patties:",
        "2 tablespoons olive oil, divided",
        "1/2 onion, finely chopped",
        "1 clove garlic, finely chopped",
        "1 1/2 cups stemmed and chopped kale",
        "1 1/4 cups cooked quinoa",
        "1/2 cup crumbled feta cheese",
        "1/2 cup Italian bread crumbs",
        "1/4 cup cooked lentils",
        "2 eggs, beaten",
        "1 tablespoon chopped parsley",
        "salt and ground black pepper to taste",
        "Sauce:",
        "3 tablespoons mayonnaise",
        "6 fresh basil leaves, chopped",
        "1 tablespoon chopped parsley",
        "2 teaspoons dried dill weed",
        "1 teaspoon lemon juice",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 282 kcal",
        "Carbs > 21.2 g",
        "Cholesterol > 83 mg",
        "Fat > 17.7 g",
        "Protein > 10.7 g",
        "Sodium > 531 mg"
    ],
    "n": "Kale and Quinoa Patties with Herb Dipping Sauce",
    "a": "tcasa",
    "r": "0",
    "s": 6,
    "des": "\"I needed a recipe to use up leftover quinoa and lentils. This is what I came up with using what I had on hand. Very versatile, quick, and easy.\"",
    "ins": "Heat 1 tablespoon oil in a large cast iron skillet over medium heat. Cook onion and garlic, stirring frequently, until translucent, about 4 minutes. Add kale; cook until wilted, 4 to 5 minutes.\nPlace quinoa, feta cheese, bread crumbs, lentils, eggs, 1 tablespoon parsley, salt, and pepper in a large bowl. Mix to fully combine. Mix in the kale mixture. Form into patties by hand.\nHeat the remaining 1 tablespoon oil in a skillet over medium heat. Cook the patties, covered, until golden brown, about 5 minutes per side.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler. Transfer the skillet to the oven; broil the patties until top is crispy, 3 to 5 minutes.\nCombine mayonnaise, basil, 1 tablespoon parsley, dill, lemon juice, salt, and pepper in bowl to make the sauce. Dollop onto the patties and serve.",
    "pt": "25 m",
    "ct": "21 m",
    "tt": "46 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}