{
    "id": 258975,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large skinless, boneless chicken breast, ground",
        "1/4 cup butter, divided",
        "1 red onion, chopped",
        "1 tablespoon garlic, minced",
        "1/2 cup roughly chopped pineapple, drained and juice reserved",
        "4 cups cooked white rice, or more to taste",
        "1/2 cup chopped fresh cilantro, divided",
        "1/4 cup sweet and sour sauce",
        "3 tablespoons teriyaki sauce",
        "2 tablespoons soy sauce",
        "2 tablespoons white sugar",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 230 kcal",
        "Carbs > 33.1 g",
        "Cholesterol > 30 mg",
        "Fat > 6.8 g",
        "Protein > 8.7 g",
        "Sodium > 588 mg"
    ],
    "n": "Thai-Inspired Fried Rice",
    "a": "kitkate",
    "r": "0",
    "s": 8,
    "des": "\"This amazing fried rice dish is sure to knock family and friends off of their feet! It will make them think you are a 5-star chef! It mixes sweet and savory in a perfect blend that you will love. You can add or take away to adjust to your favorite flavors...you just can't go wrong with this one!\"",
    "ins": "Heat a small skillet over medium heat. Cook and stir chicken until no longer pink in the center and the juices run clear, about 5 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nHeat 2 tablespoons butter in a large wok over medium heat; stir in onion and garlic. Cook and stir until softened and onion is translucent, about 5 minutes. Stir in the cooked chicken, pineapple, and 3 tablespoons pineapple juice, 1 to 2 minutes. Add rice, 4 tablespoons cilantro, and the remaining 2 tablespoons butter; cook and stir until thoroughly mixed, about 5 minutes.\nPour sweet and sour sauce, teriyaki sauce, soy sauce, sugar, salt, and pepper into the rice mixture. Cook and stir to combine, 5 to 8 minutes. Mix in the remaining 4 tablespoons cilantro, 1 to 2 minutes.",
    "pt": "25 m",
    "ct": "22 m",
    "tt": "47 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}