{
    "id": 258912,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup milk",
        "2 eggs",
        "1/2 cup white sugar",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon sea salt",
        "12 ounces brioche bread, cut into 3/4-inch cubes",
        "1 pint blackberries, halved",
        "4 ounces cream cheese, chilled and diced (optional)",
        "aluminum foil (such as Reynolds WrapÂ®)",
        "1 tablespoon unsalted butter, melted"
    ],
    "nut": [
        "Calories > 415 kcal",
        "Carbs > 50.1 g",
        "Cholesterol > 145 mg",
        "Fat > 19.3 g",
        "Protein > 11 g",
        "Sodium > 474 mg"
    ],
    "n": "Grilled Blackberry Brioche Bread Pudding",
    "a": "Julie Hubert",
    "r": "0",
    "s": 6,
    "des": "\"Don't heat up the house when you want to bake a blackberry brioche bread pudding in the summertime - make a package and pop it on the grill. Scoop into bowls and top with whipped cream or ice cream to serve!\"",
    "ins": "Preheat an outdoor grill for medium-high heat, approximately 375 degrees F (190 degrees C).\nWhisk milk, eggs, sugar, vanilla extract, and salt together in a large bowl. Fold in bread cubes, blackberries, and cream cheese. Set aside until liquid is absorbed, about 15 minutes.\nPlace a layer of heavy duty aluminum foil or 2 layers of regular aluminum foil on a flat surface. Brush aluminum foil with melted butter.\nArrange bread mixture in the center of the aluminum foil. Bring short ends together; fold over twice to seal. Bring sides in, leaving room for steam to form; fold over twice to seal.\nGrill over indirect heat until bread pudding is puffed, liquid is absorbed, and edges are toasty, about 35 minutes.\nRemove package from the grill; open carefully using tongs or mitts. Cool for 10 minutes.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "4538456.jpg",
    "o": "",
    "st": "allrecipes"
}