{
    "id": 259004,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Marinara Sauce:",
        "1 tablespoon olive oil",
        "1/2 cup diced onions",
        "3 cloves garlic, chopped",
        "1 (28 ounce) can whole peeled plum tomatoes, crushed by hand or mashed",
        "1 teaspoon salt",
        "1 teaspoon dried oregano",
        "1 teaspoon dried basil",
        "1/2 teaspoon fennel seeds",
        "1/2 teaspoon dried thyme",
        "1/4 teaspoon red pepper flakes",
        "Chicken:",
        "4 skinless, boneless chicken breast halves",
        "2 cups panko bread crumbs",
        "3 eggs, beaten",
        "1 cup all-purpose flour",
        "1/3 cup grated Parmesan cheese",
        "1/2 teaspoon salt",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon dried basil",
        "1/4 teaspoon ground black pepper",
        "1/4 cup olive oil, or as needed",
        "salt as needed",
        "To Serve:",
        "1 cup shredded mozzarella cheese",
        "16 slider buns"
    ],
    "nut": [
        "Calories > 182 kcal",
        "Carbs > 18.6 g",
        "Cholesterol > 57 mg",
        "Fat > 8.1 g",
        "Protein > 12.2 g",
        "Sodium > 461 mg"
    ],
    "n": "Chicken Parmesan Sliders",
    "a": "BOBINIOWA",
    "r": "0",
    "s": 16,
    "des": "\"This is one of my favorite chicken slider recipes.\"",
    "ins": "Heat olive oil, onions, and garlic in a saucepan over medium-high heat. Saute, stirring occasionally until translucent, 6 to 8 minutes. Add tomatoes, salt, oregano, basil, fennel seeds, thyme, and red pepper flakes; stir to combine. Reduce heat; cook over low heat for 15 minutes. Adjust seasoning if necessary; keep warm.\nPlace chicken on a cutting board. Slice each breast lengthwise into 2 thin cutlets; slice each cutlet into 2 smaller pieces.\nPreheat oven to 450 degrees F (230 degrees C). Place a cooling rack on a baking sheet and set aside.\nPour panko and eggs into separate shallow dishes. Combine flour, Parmesan cheese, 1/2 teaspoon salt, 1/2 teaspoon oregano, 1/2 teaspoon basil, and 1/4 teaspoon black pepper in another shallow dish.\nHeat olive oil over medium-high heat in a large skillet. Dredge chicken pieces first in flour mixture, then eggs, and finally panko. Pan fry the chicken until lightly browned, no longer pink in the center, and the juices run clear, 2 to 3 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove to the cooling rack; sprinkle lightly with salt.\nTop each piece of chicken (still on cooling rack) with 2 tablespoons of marinara sauce and 1 tablespoon of mozzarella cheese.\nBake in the preheated oven until cheese is melted, 3 to 5 minutes. Remove from oven; place chicken on buns.",
    "pt": "30 m",
    "ct": "28 m",
    "tt": "58 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}