{
    "id": 259081,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups precooked cornmeal (such as P.A.N.Â®)",
        "1/4 cup all-purpose flour",
        "1 tablespoon white sugar",
        "1 teaspoon salt",
        "1 teaspoon baking powder",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon paprika",
        "1/2 teaspoon ground cinnamon",
        "1/4 cup butter",
        "1 cup water",
        "1/2 cup milk",
        "1/2 cup shredded mild Cheddar cheese",
        "vegetable oil for frying"
    ],
    "nut": [
        "Calories > 356 kcal",
        "Carbs > 44.3 g",
        "Cholesterol > 34 mg",
        "Fat > 16.5 g",
        "Protein > 7.6 g",
        "Sodium > 608 mg"
    ],
    "n": "Cornmeal-Cheese Sticks (Sorullitos de Maiz)",
    "a": "MKCortes (Latin Goddess)",
    "r": "0",
    "s": 6,
    "des": "\"Cornmeal sticks or sorullitos are a snack or appetizer popular among Hispanic Caribbean folk. In Puerto Rico, they are commonly served as part of a cheese platter with salsa rosada (Puerto Rican-style homemade Thousand Island dipping sauce made with garlic, mayo, ketchup, Worcestershire sauce, and cilantro) or ajilimojili (garlic and sweet chili pepper dipping sauce). Serve with salsa rosada or ketchup.\"",
    "ins": "Combine cornmeal, flour, sugar, salt, baking powder, black pepper, paprika, and cinnamon in a large bowl. Add butter; use fingers to crumble into flour until the mixture resembles peas.\nCombine water and milk in a saucepan over medium heat; bring to a simmer and remove from heat. Pour into cornmeal mixture; stir rapidly until dough forms a soft ball that separates from the sides of the bowl. Add Cheddar cheese; stir to combine.\nCover bowl with a clean dish cloth; allow dough to rest for 5 minutes.\nScoop a heaping teaspoon of dough; using your hands, form a ball and then roll into a stick. Repeat with remaining dough.\nHeat oil in a large skillet; fry sticks until golden, 3 to 5 minutes per side.",
    "pt": "25 m",
    "ct": "6 m",
    "tt": "36 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}