{
    "id": 259036,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 whole duck",
        "2 tablespoons salt, or more to taste",
        "2 lemongrass stalks",
        "2 onions, sliced",
        "4 cloves garlic",
        "vegetable oil for deep-frying",
        "1 3/4 cups cubed potatoes",
        "1 (10 ounce) can pineapple chunks, juice reserved, or more to taste",
        "1 (32 fluid ounce) bottle lemon-lime soda (such as SpriteÂ®)",
        "1 (14 ounce) can evaporated milk"
    ],
    "nut": [
        "Calories > 313 kcal",
        "Carbs > 36.2 g",
        "Cholesterol > 26 mg",
        "Fat > 16.1 g",
        "Protein > 7.9 g",
        "Sodium > 1827 mg"
    ],
    "n": "Saucy Pineapple Fried Duck",
    "a": "charissa edquilang sian",
    "r": "0",
    "s": 8,
    "des": "\"This is an all-time favorite dish in my husband's family. At every occasion it's there...from the first taste to the last, I love it. The more pineapple you add, the tastier the dish! It will taste slightly salty and sweet.\"",
    "ins": "Place duck on a work surface. Coat skin with salt and fill the cavity with lemon grass. Transfer duck to a pot and cover with water. Add onions and garlic; boil until meat is tender, about 1 hour 15 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 165 degrees F (74 degrees C).\nLet duck cool, 15 to 20 minutes. Carve.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). Deep-fry the duck meat until crispy and brown, 8 to 10 minutes. Fry the potatoes until golden brown, about 5 minutes.\nLayer the duck, pineapple juice, soda, evaporated milk, potatoes, and pineapple chunks, in this particular order, in a large saucepan. Simmer until sauce is slightly thickened, 12 to 15 minutes. Season with salt.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}