{
    "id": 259066,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup vegetable oil, divided",
        "2 pounds andouille sausage, cut into cubes",
        "1 pound pork tenderloin, cubed",
        "2 slices bacon, diced",
        "5 cloves garlic, minced",
        "2 large red onions, diced",
        "2 large red bell peppers, seeded and diced",
        "2 (28 ounce) cans tomato sauce",
        "2 (8 ounce) cans corn, drained (optional)",
        "1 (14 ounce) can diced tomatoes",
        "2 (7 ounce) cans diced green chile peppers",
        "2 (4 ounce) cans diced jalapeno peppers",
        "1/2 cup Burgundy wine",
        "7 tablespoons chili powder",
        "2 tablespoons baharat (Middle Eastern spice mix)",
        "1 1/2 tablespoons Cajun seasoning (such as Tony Chachere'sÂ®)",
        "2 1/2 teaspoons chipotle hot sauce (such as LouisianaÂ®)",
        "1/4 teaspoon browning sauce (such as Kitchen BouquetÂ®)"
    ],
    "nut": [
        "Calories > 678 kcal",
        "Carbs > 42.3 g",
        "Cholesterol > 93 mg",
        "Fat > 44.3 g",
        "Protein > 30.4 g",
        "Sodium > 3800 mg"
    ],
    "n": "Cajunatti Chili",
    "a": "Riknard",
    "r": "0",
    "s": 8,
    "des": "\"Cross between Cajun ingredients and a similar flavor spice to that of Cincinnati-style chili. SkylineÂ® brand Cincinnati-style chili is what I was inspired by. Can be served over rice with cubed cheese or straight from a bowl.\"",
    "ins": "Heat 2 tablespoons oil in a large pot over medium-low heat. Add andouille sausage, pork tenderloin, and bacon; cook and stir until pork is no longer pink, about 12 minutes. Transfer to a plate using a slotted spoon. Drain excess grease.\nHeat remaining 2 tablespoons oil in the same pot. Add garlic; stir until fragrant, about 15 seconds. Add onions and red bell peppers; cook and stir until tender, about 12 minutes.\nReturn sausage, pork, and bacon to the pot. Add tomato sauce, corn, diced tomatoes, green chile peppers, jalapeno peppers, Burgundy wine, chili powder, baharat, Cajun seasoning, chipotle hot sauce, and browning sauce. Bring to a boil; reduce heat and simmer, covered, until flavors combine, at least 1 hour.",
    "pt": "35 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}