{
    "id": 259044,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 pound chicken breasts",
        "2 (14.5 ounce) cans chicken broth",
        "4 green plantains, peeled and cut into 1/2-inch chunks",
        "2 tablespoons salt",
        "8 thick slices bacon",
        "1 cup oil for frying",
        "1 1/2 tablespoons freshly minced garlic",
        "1 pinch salt and freshly ground black pepper to taste",
        "2 tablespoons chopped fresh cilantro"
    ],
    "nut": [
        "Calories > 507 kcal",
        "Carbs > 59.4 g",
        "Cholesterol > 76 mg",
        "Fat > 18.8 g",
        "Protein > 29.2 g",
        "Sodium > 5019 mg"
    ],
    "n": "Mofongo with Chicken",
    "a": "Wenani97",
    "r": "0",
    "s": 4,
    "des": "\"Inspired from a vacation in Puerto Rico, this recipe is a blending of many mofongo recipes found online. I combined several recipes until I found the right one for me. I hope you enjoy it as much as I do.\"",
    "ins": "Place chicken in a pot and cover with water. Bring to a boil; reduce heat to low and simmer until tender, 15 to 20 minutes. Drain and cool until easily handled, about 5 minutes. Shred.\nPour chicken broth into a saucepan over medium heat. Cover and keep warm.\nPlace plantains and salt in a bowl of cold water. Let soak for 5 minutes. Drain and blot dry with a paper towel.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Crumble into small pieces.\nHeat 1 inch oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Fry plantains in batches until golden brown, 2 to 3 minutes per batch. Drain on paper towels.\nSmash plantains with the bottom of an empty chicken broth can. Fry again until crispy, 1 to 2 minutes more. Drain; blot with paper towels.\nTransfer plantains to a large bowl. Add bacon and garlic; mash together. Fill an empty chicken broth can halfway with mashed mixture. Press down until firmly packed. Invert can onto a plate; tap until mofongo slides onto the plate. Repeat with remaining mashed mixture.\nCover mofongos with shredded chicken and warmed broth. Season with salt and pepper. Garnish with cilantro.",
    "pt": "20 m",
    "ct": "33 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}