{
    "id": 259037,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 bunch fresh spinach, stemmed",
        "2 fresh duck breasts, skinned",
        "1 (1 pound) package bacon slices, halved",
        "1 (5 ounce) can sliced water chestnuts, drained",
        "toothpicks",
        "1 tablespoon chopped fresh thyme, or to taste"
    ],
    "nut": [
        "Calories > 61 kcal",
        "Carbs > 2 g",
        "Cholesterol > 11 mg",
        "Fat > 4 g",
        "Protein > 4.3 g",
        "Sodium > 233 mg"
    ],
    "n": "Duck Rumaki",
    "a": "Dan",
    "r": "0",
    "s": 16,
    "des": "\"Similar to the more well known version made with chicken livers, but I've made some additions. This came about when a co-worker gave me about a dozen duck breasts and I had to find a way to use them up. The result was an appetizer that continues to be a favorite at dinner parties, and one that can be prepared well in advance of actual cooking.\n\n If you are like some people who don't care for the gamey flavor of wild duck, I'm including a technique to soften or tame it. This can be made the day before your party and kept tightly covered in the fridge. Bring to room temperature before the final grilling.\"",
    "ins": "Soak spinach in a bowl of salted water until absorbed, about 10 minutes. Drain and dry on paper towels.\nCarve out the duck meat on a flat work surface with a sharp boning knife, starting along the side of the duck's breast bone to the ribs. Continue cutting outwards, staying as close to the rib cage as possible. Freeze and save the bones for soup. Cut the meat into roughly even cubes.\nLay bacon slices on a work surface. Place 2 spinach leaves, 1 cube of duck, and 1 water chestnut at 1 end of each slice, rolling it up and securing the ends of the rumaki with a toothpick. Sprinkle thyme on top.\nPreheat grill for medium-high heat and lightly oil the grate.\nGrill the rumaki until brown and crisp, turning occasionally, about 8 minutes.\nArrange the rumaki on top of the remaining spinach leaves on a serving platter.",
    "pt": "50 m",
    "ct": "8 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}