{
    "id": 25905,
    "old_rating": "4.35938",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 quart water",
        "2 cups uncooked long-grain white rice",
        "2 tablespoons chicken broth",
        "1 tablespoon minced garlic",
        "1 green bell pepper, chopped",
        "1 small yellow onion, chopped",
        "1 (15 ounce) can cream-style corn",
        "1 (11 ounce) can Mexican-style corn, drained",
        "1 (11 ounce) can whole kernel corn, drained",
        "1 (10 ounce) can diced tomatoes with green chile peppers, with liquid",
        "1 (4 ounce) can chopped green chile peppers, drained",
        "1 (8 ounce) package Mexican-style processed cheese food, cubed",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/2 teaspoon chili powder",
        "3/4 cup shredded reduced-fat Cheddar cheese"
    ],
    "nut": [
        "Calories > 332 kcal",
        "Carbs > 56.7 g",
        "Cholesterol > 20 mg",
        "Fat > 7.4 g",
        "Protein > 12.4 g",
        "Sodium > 1046 mg"
    ],
    "n": "Cheesy Mexi-Rice Casserole",
    "a": "MAHooper",
    "r": "0",
    "s": 10,
    "des": "\"A great way to use leftover rice.  This is delicious and has a little bit of 'kick' to it.  We like it as a side dish with grilled chicken breasts. If you have any left, it freezes well, too!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).  Grease a 3 1/2 quart casserole dish.\nIn a saucepan, bring water to a boil.  Stir in rice, reduce heat, and cover. Simmer for 20 minutes.\nIn a wok or large skillet, heat the broth and saute the garlic, bell pepper and onion until tender, about 5 minutes.  Stir in cooked rice, cream-style corn, Mexican-style corn, whole kernel corn, diced tomatoes with chiles, green chiles,  Mexican-style processed cheese, salt, pepper and chili powder.  Spoon into prepared casserole dish.\nBake in preheated oven for 30 minutes, or until bubbly.  Top with shredded Cheddar, cover and bake 5 minutes more.  Remove from oven, uncover and let stand 10 minutes.",
    "pt": "30 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "1102582.jpg",
    "o": "",
    "st": "allrecipes"
}