{
    "id": 259033,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil, divided",
        "10 ounces beef sirloin steak",
        "salt and black pepper to taste",
        "1 nectarine, pitted and thinly sliced",
        "1 shallot, minced",
        "2 tablespoons red wine vinegar",
        "1 (4 ounce) package mixed spring greens",
        "1/2 ounce basil, thinly sliced",
        "1 ounce crumbled feta",
        "1 ounce pecans"
    ],
    "nut": [
        "Calories > 501 kcal",
        "Carbs > 16.9 g",
        "Cholesterol > 99 mg",
        "Fat > 33.3 g",
        "Protein > 35.9 g",
        "Sodium > 1427 mg"
    ],
    "n": "Seared Steak and Charred Nectarine Salad with Feta, Pecans, and Basil",
    "a": "HelloFresh.com",
    "r": "0",
    "s": 2,
    "des": "\"A quick flash in a hot pan transforms juicy nectarines from \nsweet to nearly candy-like. Tossed with perfectly seared steak, \ntangy feta, and summery basil, this salad is bound to become\n a staple of your weekly repertoire.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nHeat 1/2 tablespoon olive oil in a large skillet over medium heat. Season steak on all sides with salt and pepper. Sear steak in the hot skillet until evenly browned, 3 to 4 minutes per side. Transfer to a baking sheet and finish cooking in the oven until cooked to desired doneness, 5 to 7 minutes. Remove steak from oven; set aside to rest for 5 minutes.\nPlace nectarines in the same skillet over high heat. Sear until caramelized and charred on all sides, 1 to 2 minutes.\nWhisk together shallot, red wine vinegar, and remaining 1 1/2 tablespoons olive oil in a large salad bowl to make vinaigrette. Season with salt and pepper. Add spring mix and basil to the vinaigrette; toss to combine.\nThinly slice steak against the grain on a cutting board. Arrange steak, nectarines, feta, and pecans over salad.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}