{
    "id": 259010,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup couscous",
        "3 1/2 tablespoons butter, or as needed, divided",
        "1 cup finely chopped white onion",
        "1/2 cup diced mushrooms",
        "4 serrano peppers, diced, or more to taste",
        "cayenne pepper",
        "1 whole duckling - thawed, neck and giblets removed, rinsed",
        "1 1/2 teaspoons dried basil, or to taste",
        "sea salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 321 kcal",
        "Carbs > 38.4 g",
        "Cholesterol > 51 mg",
        "Fat > 13.1 g",
        "Protein > 12.3 g",
        "Sodium > 182 mg"
    ],
    "n": "Grilled Stuffed Duckling",
    "a": "Tina",
    "r": "0",
    "s": 4,
    "des": "\"I love to barbeque everything. I searched far and wide for a recipe on how to grill a whole duckling on the grill and found nothing. So, I came up with this basic, easy recipe that works best when grilled on a gas-powered grill. Any residual drippings would make a delicious gravy to serve on top the final product; or make gravy with the neck and giblets.\"",
    "ins": "Bring water to a boil in a saucepan; remove from heat and stir couscous into the water. Cover saucepan and let stand until water is absorbed completely, about 10 minutes. Fluff couscous with a fork.\nHeat 1 1/2 tablespoons butter in a skillet over medium heat. Add onion, mushrooms, and serrano peppers; cook and stir until lightly browned, about 5 minutes. Mix in the cooked couscous and cayenne pepper.\nFill the duckling's cavity with the couscous mixture. Spread 1 tablespoon butter in a thin layer over the duckling's skin. Rub skin with basil, salt, and pepper. Wrap in aluminum foil.\nPreheat grill for medium heat, about 300 degrees F (150 degrees C). Lightly oil the grate.\nPlace duckling on grill and cook for about 30 minutes, turning once. Remove foil; continue grilling, turning occasionally and basting with butter each time. Cook until no longer pink at the bone and the juices run clear, 25 to 30 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C).\nRemove the duckling from the grill, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area for 10 minutes before slicing. Spoon out the couscous and serve alongside the duckling.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}