{
    "id": 259024,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Meatloaf:",
        "1 small yellow onion, roughly chopped",
        "4 cloves garlic",
        "1/2 cup flat-leaf parsley leaves",
        "2/3 cup almond meal",
        "2 eggs, beaten",
        "2 tablespoons tomato paste",
        "1 tablespoon Worcestershire sauce",
        "2 teaspoons kosher salt",
        "1 teaspoon paprika",
        "3/4 teaspoon ground black pepper",
        "1/2 teaspoon dried oregano",
        "1 1/2 pounds lean ground beef",
        "1 pound ground pork",
        "3 hard-boiled eggs, or more to taste",
        "Topping:",
        "2 tablespoons tomato paste",
        "2 teaspoons ghee (clarified butter)"
    ],
    "nut": [
        "Calories > 394 kcal",
        "Carbs > 6.9 g",
        "Cholesterol > 211 mg",
        "Fat > 25.8 g",
        "Protein > 33.1 g",
        "Sodium > 683 mg"
    ],
    "n": "Paleo Meatloaf with Egg in the Middle",
    "a": "littlewing789",
    "r": "0",
    "s": 8,
    "des": "\"Mom's old-fashioned meatloaf, paleo-style.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace the onion and garlic in a food processor; pulse until onion is finely chopped but not watery. Transfer to a large bowl. Puree parsley in the food processor; add to the bowl. Mix in almond meal, beaten eggs, 2 tablespoons tomato paste, Worcestershire sauce, salt, paprika, black pepper, and oregano. Add ground beef and pork; mix gently by hand until just combined.\nPlace half of the ground meat mixture in a loaf pan. Press down until well-packed. Make a shallow well in the center; fill with hard-boiled eggs. Pat the remaining ground meat mixture down on top, squeezing out any air pockets.\nStir 2 tablespoons tomato paste and ghee together in a small bowl. Spread an even layer of the topping over the meatloaf. Place the loaf pan on a baking sheet.\nBake on the center rack of the preheated oven until no longer pink in the center, about 1 hour 30 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\nCool meatloaf until slightly shrunk and pulled away from the sides, at least 15 minutes. Transfer to a cutting board using 2 sturdy spatulas. Slice and serve.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}