{
    "id": 259187,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups water",
        "1 cup parboiled long grain rice",
        "1/2 cup grated Parmesan cheese",
        "cooking spray",
        "1 tablespoon cornmeal, divided",
        "1 egg, beaten",
        "2 tablespoons sesame seeds",
        "1/4 teaspoon dried cilantro (optional)",
        "2 cups prepared chili",
        "1/4 cup shredded Cheddar cheese, or more if desired",
        "1/4 cup shredded mozzarella cheese, or more if desired",
        "1 tablespoon panko bread crumbs"
    ],
    "nut": [
        "Calories > 458 kcal",
        "Carbs > 58.9 g",
        "Cholesterol > 86 mg",
        "Fat > 16.8 g",
        "Protein > 19.7 g",
        "Sodium > 906 mg"
    ],
    "n": "Chili Pizza with Rice Crust",
    "a": "jazzbrat",
    "r": "0",
    "s": 4,
    "des": "\"Chili and rice are made for each other, and this recipe is a perfect way to meld the two! Just as the title suggests, this recipe delivers a 'pizza' made with a rice crust and topped with your favorite chili. Easily adaptable for vegan or gluten-free diets. After baking, garnish with cilantro or arugula if desired. Serves 4 as a main course with salad, or 1 hungry teenager.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nHeat water and rice in a saucepan; boil for 1 minute and remove from heat. Cover; let stand until water is absorbed and rice is tender, about 20 minutes. Spoon warm rice into a bowl; stir in Parmesan cheese. Allow mixture to cool.\nCoat a pizza pan with cooking spray. Dust with 1 1/2 teaspoon cornmeal.\nMix beaten egg, sesame seeds, and cilantro into rice mixture. Mound in the center of the prepared pizza pan. Shape into a deep-dish crust, approximately 1/4-inch deep with slightly raised edges. Dust edges with remaining cornmeal.\nBake on the upper rack of the preheated oven for 20 minutes. Slide crust carefully from the pan directly onto the oven rack using a pizza paddle; bake until just starting to brown, 5 to 8 minutes more. Use the paddle to remove crust from the oven and return it to the pan.\nTop pizza with chili, Cheddar cheese, mozzarella cheese, and panko. Spray with cooking spray.\nReturn pizza to the hot oven; bake until cheese bubbles, 5 to 10 minutes. Remove from oven; let stand for 5 minutes.",
    "pt": "15 m",
    "ct": "31 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}