{
    "id": 259164,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Starter:",
        "2 cups warm water",
        "2 cups whole wheat flour",
        "1 (.25 ounce) package active dry yeast",
        "Dough:",
        "1 cup whole milk",
        "2 tablespoons butter",
        "5 cups bread flour",
        "3 1/4 teaspoons white sugar",
        "1 (.25 ounce) package active dry yeast",
        "2 tablespoons cornmeal (optional)"
    ],
    "nut": [
        "Calories > 316 kcal",
        "Carbs > 59.6 g",
        "Cholesterol > 7 mg",
        "Fat > 4 g",
        "Protein > 10.8 g",
        "Sodium > 26 mg"
    ],
    "n": "Homemade Sourdough Rolls",
    "a": "HugeTaste",
    "r": "0",
    "s": 12,
    "des": "\"Hands down, sourdough is my favorite bread to eat. Something about it just gets my saliva flowing, and I will eat copious amounts of it. So much so that I like it with pretty much anything, including sandwiches and hamburgers. This is a recipe for making all-organic sourdough rolls if you want to add it to pretty much every kind of meal. This recipe demands some time (for the sourdough starter), but makes up for it with deliciousness. All products used in the initial recipe were organic. You can also use conventional goods if organic isn't your thing.\"",
    "ins": "Combine water, whole wheat flour, and 1 package yeast in a bowl and mix well. Cover loosely with a towel and set aside, stirring occasionally, until starter smells sour and sweet, 2 to 4 days.\nPlace milk and butter in a small pot and heat over low heat until butter is melted, 3 to 5 minutes.\nCombine 2 cups bread flour, sugar, and 1 package yeast in a bowl. Stir heated milk mixture in slowly. Add remaining 3 cups bread flour and the sourdough starter, mixing constantly. Knead dough for about 5 minutes.\nGrease a bowl and place the dough inside. Let dough rise, about 45 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking pan and dust with cornmeal.\nPunch down dough and turn onto a lightly floured surface. Divide dough into 12 equal pieces. Flatten into rounds of your desired size using a rolling pin or by hand. Place in the prepared pan. Cover with a towel and let rise in a warm place, about 30 minutes.\nUncover and bake in the preheated oven until top is golden brown, about 22 minutes.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "2 d ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}