{
    "id": 259159,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Tart:",
        "1/2 cup unsalted butter, chilled",
        "1/4 cup white sugar",
        "1 cup all-purpose flour",
        "2 tablespoons all-purpose flour, plus more for dusting",
        "2 tablespoons white sugar",
        "1 teaspoon vanilla extract",
        "Filling:",
        "3 Granny Smith apples - peeled, cored and thinly sliced",
        "11 ounces creme fraiche",
        "2 small eggs",
        "1 teaspoon vanilla extract",
        "For the glaze:",
        "3 tablespoons apricot preserves",
        "1 tablespoon water",
        "2 teaspoons white sugar",
        "1/2 teaspoon ground cinnamon"
    ],
    "nut": [
        "Calories > 271 kcal",
        "Carbs > 25 g",
        "Cholesterol > 80 mg",
        "Fat > 18.7 g",
        "Protein > 3.1 g",
        "Sodium > 22 mg"
    ],
    "n": "Apple Tart with Creme Fraiche",
    "a": "nch",
    "r": "0",
    "s": 12,
    "des": "\"A juicy and moist apple tart perfect for afternoon tea and picnics by the river. Serve with creme fraiche for an extra treat.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease a 10-inch springform pan and line with parchment paper.\nCombine butter, 1 cup plus 2 tablespoons flour, 1/4 cup plus 2 tablespoons sugar, and 1 teaspoon vanilla extract in the bowl of a food processor; pulse until mixture resembles breadcrumbs. Turn out onto a clean work surface and quickly form into a ball. Dust a large piece of plastic wrap with flour and place pastry on top. Cover with a second piece of plastic wrap and roll out between the wrap to fit the 9-inch springform pan.\nPlace pastry into the bottom and the sides of the prepared springform and prick numerous times with a fork. Line pastry with parchment paper and a layer of pie weights or dried beans. Bake in the preheated oven until the pastry crust is firm but not hard, about 15 minutes. Let the pastry cool for 5 minutes. Carefully remove the parchment paper and weights; continue baking until the crust sets, about 5 minutes more.\nLayer thinly sliced apples evenly over the pre-baked pastry crust.\nWhisk creme fraiche, eggs, and vanilla extract together in a bowl. Pour over apples.\nBake tart in the preheated oven on top of a baking sheet (in case some filling spills) until tart is set and the top is golden brown, about 30 minutes. The filling should still be a little wobbly, as it firms up while cooling.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nStrain apricot jam through a sieve. Combine apricot jam and water in a saucepan and heat until runny, about 3 minutes. Brush the jam over the top of the tart. Mix sugar and cinnamon in a small bowl and sprinkle over tart.\nPlace tart under the broiler until the top is golden brown, about 1 to 2 minutes.",
    "pt": "30 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "4538936.jpg",
    "o": "",
    "st": "allrecipes"
}