{
    "id": 259110,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 large eggplants",
        "2 tablespoons olive oil",
        "1 egg",
        "3 tablespoons grated Parmesan cheese",
        "2 tablespoons bread crumbs, plus more for rolling",
        "1 teaspoon mint, thinly sliced, or more to taste",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 173 kcal",
        "Carbs > 18.3 g",
        "Cholesterol > 50 mg",
        "Fat > 9.8 g",
        "Protein > 6.2 g",
        "Sodium > 144 mg"
    ],
    "n": "Polpettine di Melanzane al Forno (Italian Baked Eggplant and Parmesan Bites)",
    "a": "alemarsi",
    "r": "0",
    "s": 4,
    "des": "\"When eggplants are in season we make these yummy eggplant balls a lot. They are made with baked eggplant, Parmesan cheese, breadcrumbs, and I add mint for extra taste! Feel free to experiment with other cheeses.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nWrap each eggplant in foil and place on a baking tray. Bake until skin can easily be pierced with a fork, about 45 minutes. Slice each eggplant in half, discard seeds, and scoop out soft flesh; place flesh in a colander.\nPlace colander on a plate; cover eggplant with foil and set a heavy object, like a plate with some cans, on top of the plate to squeeze out any excess liquid. Let stand for about 20 minutes, then chop the flesh, squeezing out extra water as you work.\nIncrease oven temperature to 400 degrees F (200 degrees C). Grease baking sheet with olive oil.\nCombine chopped eggplant, egg, grated Parmesan cheese, breadcrumbs, mint, salt, and pepper in a bowl; mix well.\nScoop up a small amount of eggplant mixture and roll into a ball between your palms. Roll in breadcrumbs and place on the prepared baking sheet. Continue making balls and rolling them in breadcrumbs until mixture has been used up.\nBake in the preheated oven for 40 minutes until golden brown, carefully turning balls after 20 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4540646.jpg",
    "o": "",
    "st": "allrecipes"
}