{
    "id": 259191,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 head cauliflower, cored and cut into florets",
        "1 yam, diced",
        "1 tablespoon olive oil, or to taste",
        "salt and ground black pepper to taste",
        "1 large buttercup squash, halved and seeded",
        "1/4 cup butter",
        "1 yellow onion, diced",
        "3 tablespoons red curry paste",
        "1 teaspoon ground turmeric",
        "1 teaspoon powdered ginger",
        "3 (14.5 ounce) cans chicken broth",
        "2 boiled chicken breasts, shredded",
        "1/4 cup pecan pieces, toasted"
    ],
    "nut": [
        "Calories > 495 kcal",
        "Carbs > 56 g",
        "Cholesterol > 80 mg",
        "Fat > 19.8 g",
        "Protein > 27.7 g",
        "Sodium > 1188 mg"
    ],
    "n": "Curried Buttercup Squash and Chicken Soup",
    "a": "BriV",
    "r": "0",
    "s": 6,
    "des": "\"Roasted cauliflower and toasted pecans bring out the flavors in this sweet curried soup dish. Sure to be a fall favorite and extremely versatile!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Place a baking sheet in the oven.\nToss cauliflower, yam, and olive oil together until coated; season with salt and pepper. Transfer to the hot baking sheet in a single layer.\nBake until slightly tender and toasted on top, 30 to 40 minutes.\nMicrowave buttercup squash until flesh is soft and easily removed from skin, about 10 minutes. Let cool for handling. Remove skin.\nMelt butter in a large pot over medium heat. Add onion, curry paste, turmeric, and ginger; cook and stir until onion is softened, about 5 minutes. Stir in roasted yams, 1/2 of the roasted cauliflower, squash, and chicken broth. Reduce heat to low; simmer soup until flavors are well blended, about 30 minutes.\nStir chicken and the remaining roasted cauliflower into the soup. Simmer until cauliflower is soft, 15 to 20 minutes. Season with salt and pepper. Garnish with toasted pecans.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}