{
    "id": 259266,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Glazed Fruits:",
        "1/4 cup white sugar, divided, or more to taste",
        "1/4 cup Pinot Grigio wine, divided",
        "3 strawberries, sliced, or more to taste",
        "3 blueberries",
        "3 raspberries",
        "1 teaspoon freshly squeezed orange juice",
        "Mascarpone Cream:",
        "1/2 cup mascarpone cheese",
        "1/4 cup heavy whipping cream",
        "2 tablespoons white sugar",
        "1 tablespoon vanilla extract",
        "Soaking Liquid:",
        "1/2 cup strong peach-flavored iced tea",
        "10 ladyfinger cookies, broken in half, or more as needed",
        "Dusting:",
        "1 tablespoon grated white chocolate, or as needed (optional)",
        "1 tablespoon confectioners' sugar, or as needed (optional)"
    ],
    "nut": [
        "Calories > 271 kcal",
        "Carbs > 29.5 g",
        "Cholesterol > 78 mg",
        "Fat > 14.6 g",
        "Protein > 3.7 g",
        "Sodium > 44 mg"
    ],
    "n": "Tiramisu All'estate Semplice",
    "a": "ShokugekiNoSenpai",
    "r": "0",
    "s": 6,
    "des": "\"This is a summer take on tiramisu, which I was commissioned to make a recipe of by a friend. It will produce a beautiful no-bake dessert if you follow this recipe. This is the simple version of this recipe. It will make enough for about 2 large servings or 4 small ones. It's best to serve it in cup or small bowl.\"",
    "ins": "Combine 1/4 cup sugar, 2 tablespoons wine, strawberries, blueberries, raspberries, and orange juice in a small bowl. Toss to coat the berries.\nCombine mascarpone cheese and heavy cream carefully in a separate bowl using a spoon or whisk. Add 2 tablespoons sugar and vanilla extract. Beat mixture together in a bowl using an electric mixer until creamy and smooth.\nMix the remaining 2 tablespoons wine and peach tea together in a separate bowl. Dip each ladyfinger in the liquid once until coated but not extra soggy.\nSpoon a dollop of the mascarpone cream onto the bottom of a serving cup. Arrange a few ladyfingers to cover the bottom. Layer berries on top. Dollop on more mascarpone cream. Repeat to make a second layer. Repeat with each serving cup.\nRap the bottom of each cup against the counter to expel excess air bubbles. Cover cups with plastic wrap; refrigerate tiramisu until cool and firm, 8 hours to overnight. Dust tops with white chocolate and confectioners' sugar.",
    "pt": "35 m",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}