{
    "id": 259247,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup walnuts, toasted",
        "4 squares low-fat honey graham crackers",
        "1 (8 ounce) package reduced-fat cream cheese (Neufchatel), softened",
        "1/4 cup plain fat-free Greek yogurt",
        "1/4 cup low-fat milk, or more as needed",
        "2 packets Carnation Breakfast EssentialsÂ® Light Startâ„¢ Classic French Vanilla Powdered Drink Mix",
        "1 tablespoon vanilla",
        "1 cup fresh raspberries",
        "1 packet stevia based sweetener (such as Stevia In The RawÂ®)",
        "1/4 cup frozen light whipped dessert topping, thawed"
    ],
    "nut": [
        "Calories > 308 kcal",
        "Carbs > 20.7 g",
        "Cholesterol > 45 mg",
        "Fat > 20.2 g",
        "Protein > 11.8 g",
        "Sodium > 316 mg"
    ],
    "n": "No-Bake Cheesecake Snacks",
    "a": "Carnation Breakfast Essentials",
    "r": "0",
    "s": 4,
    "des": "\"Chopped walnuts and graham cracker crumbs are layered with a creamy vanilla cheesecake mixture and topped with raspberries and whipped topping.\"",
    "ins": "In a food processor, combine walnuts and graham crackers. Cover and process to fine crumbs.\nIn a medium bowl, beat cream cheese with an electric mixer on medium speed for 30 seconds. Add yogurt, milk,  Carnation Breakfast Essentials(R) Light Start(TM) Classic French Vanilla Light Start Powdered Drink Mix, and vanilla. Beat until combined.\nIn a small bowl, mash raspberries lightly with a fork, adding stevia in the raw.\nDivide half of the graham cracker mixture between 4 half-pint jars. Spoon half of the cheesecake mixture carefully over the crumb mixture and spread to a smooth layer. Repeat with the remaining half of the graham cracker mixture and remaining half of the cheesecake mixture, so that there are four layers. Spoon raspberry mixture over the last cheesecake mixture layer. Screw on lids and chill in the refrigerator 2 hours or up to 2 days. Before serving, add frozen light whipped dessert topping.",
    "pt": "15 m",
    "ct": "",
    "tt": "",
    "i": "4540270.jpg",
    "o": "",
    "st": "allrecipes"
}