{
    "id": 259287,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Pineapple Salsa:",
        "1 1/2 cups chopped fresh pineapple",
        "1 roma tomato, chopped",
        "1/4 cup finely chopped red onion",
        "2 tablespoons chopped fresh cilantro",
        "1 tablespoon lime juice",
        "1/8 teaspoon salt",
        "Bacon and Shrimp Tacos:",
        "6 slices FarmlandÂ® Hickory Smoked Bacon",
        "1/4 cup teriyaki sauce",
        "1/4 cup orange juice",
        "1 teaspoon grated fresh ginger",
        "1/4 teaspoon crushed red pepper",
        "12 ounces fresh or frozen medium shrimp in shells (thawed if frozen), peeled and deveined",
        "8 (6 inch) white corn or flour tortillas",
        "2 cups shredded green or red cabbage (or use a combination)"
    ],
    "nut": [],
    "n": "Bacon and Shrimp Tacos with Pineapple Salsa",
    "a": "Farmland Foods",
    "r": "0",
    "s": 4,
    "des": "\"Marinated grilled shrimp are served in tortillas topped with cabbage, fresh pineapple salsa, and crisp crumbled bacon.\"",
    "ins": "For Pineapple Salsa, in a small bowl, combine pineapple, tomato, red onion, cilantro, lime juice, and salt. Set aside.\nBacon and Shrimp Tacos: In a large skillet cook bacon over medium heat until browned and crisp. Remove to paper towels to drain; crumble bacon.\nIn a large bowl stir together the teriyaki sauce, orange juice, ginger, and crushed red pepper. Remove half of the sauce and set aside. Add shrimp to remaining sauce in bowl and toss to coat.\nFor a gas or charcoal grill, grill shrimp in a grill basket set on the rack of a covered grill directly over medium heat for 8 to 10 minutes or until opaque, turning once. Toss shrimp with remaining sauce.\nServe shrimp in tortillas topped with cabbage, Pineapple Salsa, and bacon.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "4545473.jpg",
    "o": "",
    "st": "allrecipes"
}