{
    "id": 259211,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons vegetable oil",
        "2 cloves garlic, chopped",
        "1 onion, chopped",
        "1 butternut squash, peeled and cubed",
        "1 (15 ounce) can chicken stock",
        "1 (16 ounce) package linguine pasta",
        "1/2 cup chopped fresh mint",
        "5 1/2 tablespoons heavy whipping cream, or more to taste",
        "2 tablespoons butter",
        "1 teaspoon dried sage",
        "1 cup hulled pumpkin seeds",
        "4 (1/2 inch) cubes crumbled feta cheese, or more to taste (optional)"
    ],
    "nut": [
        "Calories > 637 kcal",
        "Carbs > 83.5 g",
        "Cholesterol > 39 mg",
        "Fat > 28.1 g",
        "Protein > 19.8 g",
        "Sodium > 493 mg"
    ],
    "n": "Butternut Squash and Pumpkin Seed Linguine with Mint Cream Sauce",
    "a": "todlambe",
    "r": "0",
    "s": 6,
    "des": "\"The perfect meal to be made after work on a cold day. Fast and healthy.\"",
    "ins": "Heat a large saucepan over medium heat. Add oil and garlic; cook and stir until fragrant, about 2 minutes. Stir in onion; cook until soft, 5 to 7 minutes. Toss in butternut squash; cook until edges brown, about 5 minutes. Pour in chicken stock; cook sauce until butternut squash is tender but not soft enough to mash, 10 to 15 minutes.\nTransfer butternut squash to a separate dish and cover. Continue cooking the sauce until liquid is reduced by half, about 15 minutes.\nBring a large pot of lightly salted water to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes; drain.\nIncorporate mint, heavy cream, butter, and sage into sauce. Cook until liquid is reduced by half and sauce is thickened to your liking, 5 to 8 minutes.\nHeat a separate skillet over medium heat. Add pumpkin seeds. Cook, stirring constantly, until puffed and slightly brown, 4 to 5 minutes. Arrange linguine on a serving plate; place butternut squash on top and drizzle sauce, pumpkin seeds, and feta cheese on top.",
    "pt": "15 m",
    "ct": "42 m",
    "tt": "57 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}