{
    "id": 25928,
    "old_rating": "3.90909",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cloves garlic, finely chopped",
        "1 tablespoon finely chopped fresh ginger root",
        "1 teaspoon chile paste",
        "1/2 cup orange juice",
        "1 tablespoon sherry (optional)",
        "2 tablespoons soy sauce",
        "2 teaspoons cider vinegar",
        "1 teaspoon white sugar",
        "2 teaspoons cornstarch",
        "2 tablespoons cold water",
        "2 tablespoons peanut oil, divided",
        "4 skinless, boneless chicken breast halves - cut into strips",
        "6 green onions, chopped into 1 inch pieces",
        "2 green bell peppers, cut into 1 inch pieces",
        "1 small onion, diced",
        "1 tablespoon grated orange zest",
        "1/3 cup finely chopped peanuts"
    ],
    "nut": [
        "Calories > 331 kcal",
        "Carbs > 18.5 g",
        "Cholesterol > 68 mg",
        "Fat > 14.7 g",
        "Protein > 32.2 g",
        "Sodium > 568 mg"
    ],
    "n": "Go Girl Hot Szechwan Chicken",
    "a": "Marie-Lyne",
    "r": "0",
    "s": 4,
    "des": "\"Go girl, this is HOT. If it is too hot, just cut down on ingredients that make a dish more spicy (like onions, green onions, chilies or chili paste).\"",
    "ins": "In a small bowl combine the garlic, ginger and chile paste. Mix together and set aside. In a second bowl mix together the orange juice, sherry, soy sauce and vinegar and sugar. In a third bowl combine the cornstarch with the water and mix until dissolved.\nHeat 1 tablespoon oil in a large skillet over medium high heat. Saute chicken for about 3 minutes, until browned. Remove from skillet and set aside.\nHeat 1 teaspoon oil in skillet and saute green onion, bell pepper and onion for about 3 minutes. Stir in garlic/ginger mixture and saute for 1 minute, stirring constantly. Add chicken and orange juice mixture and cook, stirring, for 2 minutes. Finally, stir in orange zest and cornstarch mixture. Heat through, stirring slowly, until sauce is clear and thick. Sprinkle with peanuts and serve.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "611916.jpg",
    "o": "",
    "st": "allrecipes"
}