{
    "id": 25924,
    "old_rating": "2.91667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup vegetable oil, divided",
        "1 red onion, cut into strips",
        "1 (2 to 3 pound) whole chicken, cut into 8 pieces",
        "3/4 cup all-purpose flour",
        "1/8 teaspoon salt",
        "1/8 teaspoon ground black pepper",
        "1 tablespoon crushed red pepper flakes",
        "2 cups water",
        "1 cup cider vinegar"
    ],
    "nut": [
        "Calories > 618 kcal",
        "Carbs > 22.3 g",
        "Cholesterol > 140 mg",
        "Fat > 36 g",
        "Protein > 46.6 g",
        "Sodium > 209 mg"
    ],
    "n": "Colonel Jackson's Smothered Chicken",
    "a": "Clyde Baisey",
    "r": "0",
    "s": 4,
    "des": "\"This southern chicken dish will please most palates. It is an alternative to the traditional fried chicken and is great served with rice or potatoes.\"",
    "ins": "Heat 1 tablespoon oil in a large skillet and saute onion until tender. Remove and set aside.\nPlace flour, salt and pepper in a large, clean grocery bag. Add chicken, close bag tightly and shake to coat. Let sit 5 minutes. Remove chicken from bag, reserving leftover flour in bag. Heat remaining oil in skillet and brown chicken on all sides in hot oil. Remove chicken from skillet and place in a deep roasting pan.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat reserved flour in skillet over medium high heat, stirring constantly, to make a dark roux. Slowly stir in pepper flakes, water and vinegar. Finally stir in reserved sauteed onion. Mix well and pour mixture over chicken.\nCover dish and bake in preheated oven for about 35 to 45 minutes, or until chicken is tender and cooked through (no longer pink inside). Note: If gravy is too thick, add water to pan, a little at a time, until desired consistency is reached.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "688561.jpg",
    "o": "",
    "st": "allrecipes"
}