{
    "id": 259220,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup peeled, seeded, and cubed butternut squash",
        "1 cup peeled and cubed sweet potatoes",
        "1 tablespoon olive oil",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "2 links apple chicken sausage (such as AidellsÂ®), thinly sliced and quartered",
        "4 eggs",
        "2 cups fresh baby spinach",
        "1 tablespoon red pepper flakes, or to taste",
        "1 cup canned black beans, rinsed",
        "2 tablespoons goat cheese, or to taste",
        "2 large whole-wheat pita breads, toasted and halved"
    ],
    "nut": [
        "Calories > 328 kcal",
        "Carbs > 30.5 g",
        "Cholesterol > 241 mg",
        "Fat > 15.8 g",
        "Protein > 17.6 g",
        "Sodium > 1047 mg"
    ],
    "n": "Harvest Breakfast Pitas",
    "a": "Stevanda",
    "r": "0",
    "s": 4,
    "des": "\"Here's a great use for leftover roasted root vegetables. The ingredients are flexible; onion, mushroom, tomato, cilantro, and avocado slices also work well. Good with a hot sauce like CholulaÂ® and polenta or grits.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nCombine butternut squash, sweet potatoes, olive oil, salt, and pepper in a storage container. Cover with lid and shake well until fully coated. Place vegetables onto a baking sheet.\nBake in the preheated oven until vegetables are easily pierced with a fork, about 45 minutes.\nPlace chicken sausage in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Reduce heat to medium-low; add eggs, spinach, and red pepper flakes. Cook and stir until eggs are set, about 5 minutes. Mix in black beans; cook until heated through, about 1 minute. Add goat cheese.\nFill pita breads with scrambled eggs and baked vegetables.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}