{
    "id": 259334,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (8 ounce) package spaghetti",
        "3 tablespoons butter, divided",
        "1/2 onion, chopped",
        "1 bunch red Swiss chard, stems trimmed and finely chopped, leaves coarsely chopped",
        "1 clove garlic, minced",
        "1/2 cup heavy cream, or as needed",
        "3 teaspoons Dijon mustard, or more to taste",
        "salt and pepper to taste",
        "2 medium tomatoes, diced",
        "1 pinch ground nutmeg",
        "2 tablespoons grated Parmesan cheese, or to taste"
    ],
    "nut": [
        "Calories > 862 kcal",
        "Carbs > 99.4 g",
        "Cholesterol > 132 mg",
        "Fat > 43.1 g",
        "Protein > 21.5 g",
        "Sodium > 743 mg"
    ],
    "n": "Spaghetti with Red Chard and Mustard Cream Sauce",
    "a": "sanne",
    "r": "0",
    "s": 2,
    "des": "\"This is my favorite chard recipe with pasta, tomatoes, and a creamy mustard sauce. If you cook the pasta and sauce at the same time it goes pretty quick and it tastes simply divine!\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Drain.\nMelt 2 tablespoons butter in a deep frying pan over low heat. Cook onions, chard stalks, and garlic until soft while stirring, 5 to 10 minutes. Add chard leaves and the rest of the butter. Cover and cook until chard is soft and wilted, about 8 to 10 minutes.\nCombine cream and mustard in a bowl; season with salt and pepper. Add to chard in pan and simmer for 3 to 5 minutes. Add tomatoes, cover, and cook until tomatoes are soft, about 5 minutes. Season with nutmeg, salt, and pepper.\nAdd drained pasta to vegetable sauce and stir to combine. Serve with Parmesan cheese.",
    "pt": "15 m",
    "ct": "33 m",
    "tt": "48 m",
    "i": "4543048.jpg",
    "o": "",
    "st": "allrecipes"
}