{
    "id": 259318,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups whole wheat elbow macaroni",
        "1 small buttercup squash, cut into 1/2-inch cubes",
        "1 acorn squash, cut into 1/2-inch cubes",
        "1 yellow onion, chopped",
        "2 Fresno chile peppers, diced",
        "2 green chile peppers, diced",
        "2 slices whole wheat bread, cubed",
        "1 (15 ounce) can cannellini beans, drained and rinsed",
        "1 1/2 cups soy milk",
        "1 cup vegetable stock",
        "7 mushrooms, diced",
        "1 lemon, juiced",
        "3 tablespoons tahini",
        "2 tablespoons olive oil",
        "2 tablespoons white miso paste",
        "2 tablespoons nutritional yeast",
        "3 teaspoons chile powder",
        "1 teaspoon dried sage",
        "1/2 teaspoon ground cayenne pepper, or to taste",
        "ground black pepper to taste"
    ],
    "nut": [
        "Calories > 410 kcal",
        "Carbs > 69.3 g",
        "Cholesterol > 0 mg",
        "Fat > 11.7 g",
        "Protein > 15.5 g",
        "Sodium > 520 mg"
    ],
    "n": "Eddie's Squash and Pepper Casserole",
    "a": "Eddie Mars",
    "r": "0",
    "s": 6,
    "des": "\"This vegan casserole is full of color! The sauce used has a wonderfully creamy texture and taste. An extremely healthy take on the classic macaroni casserole.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook macaroni in the boiling water, stirring occasionally, until tender yet firm to the bite, about 8 minutes. Drain and place macaroni in a casserole dish.\nPlace 2 cups chopped buttercup squash and acorn squash in a microwave-safe bowl. Microwave until tender, about 90 seconds. Transfer to the casserole dish. Repeat with the remaining portions of chopped squash. Add 3/4 of the chopped onion, Fresno chiles, and green chiles; mix well. Sprinkle bread evenly on top of the vegetables.\nPlace the remaining chopped onion, beans, soy milk, vegetable stock, mushrooms, lemon, tahini, olive oil, miso paste, nutritional yeast, chile powder, sage, and cayenne pepper in a blender. Blend until creamy. Pour sauce over the bread and vegetables until thoroughly doused. Season with black pepper.\nBake in the preheated oven until lightly browned and bubbling, 35 to 40 minutes.",
    "pt": "45 m",
    "ct": "48 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}