{
    "id": 259329,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups chicken stock",
        "2 cups half-and-half",
        "2 1/2 teaspoons sea salt, divided",
        "1 1/4 cups coarsely ground cornmeal (polenta)",
        "2 tablespoons olive oil",
        "4 (4 ounce) links hot Italian sausage",
        "1 red bell pepper, sliced",
        "1 yellow bell pepper, sliced",
        "1 red onion, sliced",
        "1 teaspoon dried oregano",
        "4 cloves garlic, minced",
        "1/2 cup dry white wine",
        "1 cup basil marinara sauce",
        "3/4 cup grated Parmesan cheese, divided",
        "1/4 cup butter",
        "ground black pepper to taste",
        "5 large basil leaves, rolled and thinly sliced"
    ],
    "nut": [
        "Calories > 973 kcal",
        "Carbs > 61.5 g",
        "Cholesterol > 160 mg",
        "Fat > 63 g",
        "Protein > 34.7 g",
        "Sodium > 3857 mg"
    ],
    "n": "Sausage and Peppers over Creamy Parmesan Polenta",
    "a": "Julie Hubert",
    "r": "0",
    "s": 4,
    "des": "\"A delicious medley of hot Italian sausage and peppers is spooned over creamy Parmesan polenta in this satisfying weeknight recipe.\"",
    "ins": "Combine chicken stock, half-and-half, and 1 1/2 teaspoon salt in a large saucepan; cover and bring to a boil. Whisk in polenta. Reduce heat to low; cook, whisking often, until polenta is soft, about 15 minutes.\nHeat olive oil in a large skillet over high heat. Add sausage links; cook, turning often, until browned on all sides, about 6 minutes. Transfer to a plate.\nStir remaining 1 teaspoon salt, red bell pepper, yellow bell pepper, red onion, and oregano into the skillet. Cook over medium heat, stirring often, until onion is translucent, about 6 minutes. Add garlic; cook and stir for 1 minute. Reduce heat to low; pour in white wine. Stir in marinara sauce.\nSlice sausages and return to the skillet. Cook, covered, until no longer pink in the center, about 3 minutes.\nStir 1/2 cup Parmesan cheese and butter into polenta until melted. Season with black pepper. Divide polenta among 4 serving plates. Top with sausage and pepper mixture. Garnish with remaining 1/4 cup Parmesan cheese and basil.",
    "pt": "20 m",
    "ct": "36 m",
    "tt": "56 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}