{
    "id": 259360,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup canned garbanzo beans, undrained",
        "5 1/4 cups warm water (110 degrees F (43 degrees C)), divided",
        "2 (.25 ounce) packages active dry yeast",
        "1 cup dried lentils",
        "1/2 cup millet",
        "2 tablespoons dried great northern beans",
        "2 tablespoons dried mung beans",
        "2 tablespoons dried adzuki beans",
        "8 cups whole wheat flour",
        "4 cups barley flour",
        "1/4 cup rye flour",
        "1 cup honey",
        "5 tablespoons olive oil",
        "2 tablespoons sea salt"
    ],
    "nut": [
        "Calories > 166 kcal",
        "Carbs > 33.6 g",
        "Cholesterol > 0 mg",
        "Fat > 2.2 g",
        "Protein > 5 g",
        "Sodium > 238 mg"
    ],
    "n": "Ezekiel Bread (Wing and a Prayer Recipe)",
    "a": "Chef Squee",
    "r": "0",
    "s": 48,
    "des": "\"This is also known as fasting bread, prayer bread, or Bible bread. It is nutritionally complete and tastes yummy. In my search for a recipe for this bread, I found 3. I made a special trip to a health food store to pick up the less common ingredients. When I got there, I found that I couldn't find all the ingredients for any of the recipes so I winged it and prayed that it would turn out well and it did. I hope you enjoy it as much as I did.\"",
    "ins": "Place garbanzo beans in a small saucepan over medium heat. Cook until soft, 10 to 15 minutes. Drain and let cool.\nStir 1/2 cup water and yeast together in a small bowl until yeast dissolves. Let stand until yeast forms a creamy foam, about 10 minutes.\nCombine lentils, millet, great northern beans, mung beans, and adzuki beans in a high-powdered food processor or blender. Blend on high speed until fine enough to pass through the mesh of a sifter or strainer.\nPour lentil mixture into a large bowl. Mix in whole wheat flour, barley flour, and rye flour.\nPlace cooled garbanzo beans in a large bowl. Add honey, olive oil, and salt; mash together. Stir in remaining 4 3/4 cups water. Stir in yeast mixture. Whisk in 2 cups flour mixture. Stir in remaining flour mixture, 1 cup at a time, kneading well until dough is smooth.\nGrease a large bowl and place dough inside. Cover with a very damp cloth. Let rise until doubled, about 1 hour.\nDeflate dough and turn out onto a lightly floured work surface. Knead gently and divide into 4 pieces. Form each piece into a loaf.\nGrease four 9x5-inch loaf pans. Place loaves inside. Cover with a very damp cloth and let rise until doubled, about 40 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nBake loaves in the preheated oven until golden brown and the bottom of a loaf sounds hollow when tapped, about 1 hour.",
    "pt": "40 m",
    "ct": "1 h ",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}