{
    "id": 259349,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 potato, diced",
        "1 bunch beet tops with stems",
        "2 tablespoons bacon grease",
        "1/2 cup diced onion",
        "1/2 cup shredded carrots (optional)",
        "salt and ground black pepper to taste",
        "4 cups chicken stock, divided",
        "1 1/2 cups shredded cooked pork",
        "1 cup frozen peas"
    ],
    "nut": [
        "Calories > 275 kcal",
        "Carbs > 21.6 g",
        "Cholesterol > 59 mg",
        "Fat > 10.7 g",
        "Protein > 23 g",
        "Sodium > 845 mg"
    ],
    "n": "Beet Greens Soup",
    "a": "Breanna W.",
    "r": "0",
    "s": 4,
    "des": "\"I love to buy beets at the farmers market, because we can eat the roots and the greens. This is a recipe I made to introduce my kids to eating the greens, and they loved it! This soup is wonderful topped with sour cream or plain yogurt, and served with warm bread.\"",
    "ins": "Place potato in a microwave-safe bowl. Cover with salted water. Cook in the microwave until tender, about 5 minutes.\nPlace beet tops and stems on a flat work surface. Cut greens into thin strips and dice stems. Stack greens and stems in separate piles.\nHeat bacon grease in a large skillet over medium-high heat. Add beet stems, onion, and carrots. Cook and stir until tender, about 5 minutes. Season with salt. Add beet greens; saute until wilted, about 5 minutes.\nReserve 1/2 cup of the greens mixture in the skillet. Transfer the rest of the mixture into a blender; add boiled potato and 2 cups stock. Blend until smooth, adding salty potato water to thin mixture as needed.\nPour the blended mixture into a large pot. Stir in the reserved greens mixture, the remaining 2 cups stock, shredded pork, and peas. Cook until soup is heated through, about 8 minutes. Season with salt and pepper.",
    "pt": "25 m",
    "ct": "23 m",
    "tt": "48 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}