{
    "id": 259324,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cake:",
        "1/2 (15.25 ounce) package devil's food cake mix",
        "1/4 cup vegetable oil",
        "1 egg",
        "1/2 cup semi-sweet chocolate chips",
        "1 pinch flaked salt (optional)",
        "Toppings:",
        "1 quart vanilla ice cream",
        "1/2 cup chopped walnuts, or more to taste",
        "1/3 cup hot fudge, or more to taste"
    ],
    "nut": [
        "Calories > 468 kcal",
        "Carbs > 50.7 g",
        "Cholesterol > 58 mg",
        "Fat > 28.1 g",
        "Protein > 7.2 g",
        "Sodium > 337 mg"
    ],
    "n": "Ice Cream Pizza",
    "a": "Julie Hubert",
    "r": "0",
    "s": 8,
    "des": "\"Devil's food cake mix is transformed into a cookie crust and topped with ice cream and your favorite toppings in this ice cream pizza, perfect for parties.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nCombine cake mix, vegetable oil, and egg in a large bowl until well blended; fold in chocolate chips. Spread mixture onto the prepared baking sheet using your fingers, forming into a 9-inch round about 1/4-inch thick. Top with salt.\nBake in the preheated oven until cookie crust is set, 14 to 16 minutes. Remove from oven and knock bottom of baking sheet firmly on the counter to flatten any extra air from cookie crust. Cool crust on the baking sheet, at least 30 minutes. Transfer to a large plate or platter.\nSoften ice cream at room temperature for 20 minutes; transfer to a bowl and beat with an electric mixer until the consistency of soft serve.\nSpread beaten ice cream over cooled cookie crust with an offset spatula or knife. Transfer to the freezer until firm, about 30 minutes.\nSlice ice cream \"pizza\" into 6 to 8 slices and top each slice with walnuts and hot fudge.",
    "pt": "20 m",
    "ct": "14 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}