{
    "id": 259323,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 teaspoon butter, or as needed",
        "3/4 cup brown rice flour",
        "1/4 cup tapioca starch",
        "1/4 cup potato starch",
        "2 teaspoons active dry yeast",
        "2 teaspoons guar gum",
        "1 teaspoon salt",
        "1 teaspoon baking powder",
        "1/4 cup quinoa",
        "1/4 cup sunflower seeds",
        "1/4 cup toasted almonds, chopped",
        "1/4 cup flax seeds",
        "3/4 cup warm milk (115 degrees F or 46 degrees C)",
        "2 eggs",
        "2 egg whites",
        "2 tablespoons molasses",
        "2 tablespoons agave nectar",
        "2 tablespoons olive oil",
        "2 teaspoons apple cider vinegar",
        "1 teaspoon sesame seeds (optional)"
    ],
    "nut": [
        "Calories > 228 kcal",
        "Carbs > 28 g",
        "Cholesterol > 40 mg",
        "Fat > 10.6 g",
        "Protein > 6.7 g",
        "Sodium > 322 mg"
    ],
    "n": "Gluten-Free Multigrain Bread",
    "a": "swalker3",
    "r": "0",
    "s": 10,
    "des": "\"This bread tastes like our favorite gluten-free multigrain. Has a better texture then any others we've tried and is good for you.\"",
    "ins": "Butter and flour a 9x5-inch loaf pan.\nSift rice flour, tapioca starch, potato starch, yeast, guar gum, salt, and baking powder together in a bowl.\nPlace quinoa, sunflower seeds, almonds, and flax seeds in a coffee grinder. Grind until very fine. Transfer to the flour-starch mixture. Mix until new dry mixture is well combined.\nCombine milk, eggs, egg whites, molasses, agave nectar, olive oil, and vinegar in the bowl of a stand mixer fitted with the paddle attachment; beat on low until well blended. Pour in dry mixture slowly, beating on medium-high and pushing dough down with a spatula as necessary.\nScoop dough into the prepared pan, spreading it evenly with a wet spatula. Sprinkle with sesame seeds. Fill a large bowl with boiling-hot water and place it in a microwave. Rest a cooling rack on top of the bowl. Place pan on top and cover the dough. Let dough rise until it reaches the top of the pan, about 1 hour 30 minutes.\nBake in the preheated oven until the top is golden and an instant-read thermometer inserted in the center reads 200 degrees F (93 degrees C), about 45 minutes. Let bread cool thoroughly before slicing with a serrated knife.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}