{
    "id": 259345,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons pine nuts",
        "3 cups fresh basil leaves",
        "1 cup fresh parsley",
        "1 cup mint leaves",
        "2 cloves garlic clove, smashed",
        "1 1/4 cups olive oil, divided",
        "1/4 cup freshly grated Parmigiano-Reggiano cheese",
        "sea salt and freshly ground black pepper to taste",
        "1 (16 ounce) package fusilli pasta (such as De CeccoÂ®)",
        "1 pound asparagus, cut into 1/2-inch pieces",
        "1 (5 ounce) bag baby spinach leaves"
    ],
    "nut": [
        "Calories > 1092 kcal",
        "Carbs > 90.6 g",
        "Cholesterol > 4 mg",
        "Fat > 74.3 g",
        "Protein > 23.1 g",
        "Sodium > 204 mg"
    ],
    "n": "Italian Vegetable Fusilli with Basil Mint Pesto",
    "a": "Cindy Anschutz Barbieri",
    "r": "0",
    "s": 4,
    "des": "\"I spotted a box of fusilli pasta in my pantry and immediately decided to make an Italian dish with green vegetables and a pesto! My Italian vegetable fusilli with basil mint pesto was amazing, if I can say so myself.\"",
    "ins": "Place pine nuts in a skillet over medium heat. Toast until golden, about 2 minutes. Transfer to a plate and let cool.\nCombine pine nuts, basil, parsley, mint, and garlic in a food processor or mini chopper; pulse until finely chopped. Add 1 cup olive oil and Parmigiano-Reggiano cheese; pulse to incorporate. Season pesto with salt and pepper.\nBring a large pot of lightly salted water to a boil. Cook fusilli in the boiling water, stirring occasionally, until firm to the bite, about 8 minutes. Drain, reserving 1 cup cooking water. Wipe out pot.\nHeat remaining 1/4 cup olive oil in the pot over high heat. Add asparagus; season with salt and pepper. Cook until crisp-tender and browned in spots, about 4 minutes. Stir in spinach and cook just until wilted, 3 minutes. Add pesto and fusilli; toss well to coat. Stir in reserved cooking water if pesto looks dry.",
    "pt": "15 m",
    "ct": "22 m",
    "tt": "37 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}