{
    "id": 259325,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup orzo",
        "2 teaspoons garlic powder",
        "5 large basil leaves, thinly sliced, divided",
        "2 teaspoons sea salt, divided",
        "1 (1 1/2 pound) skin-on, sockeye salmon",
        "1/4 cup butter, melted, divided",
        "3 slices bacon, chopped",
        "1 (16 ounce) package frozen peas",
        "freshly ground black pepper to taste",
        "2 lemons, juiced, divided"
    ],
    "nut": [
        "Calories > 702 kcal",
        "Carbs > 59.7 g",
        "Cholesterol > 153 mg",
        "Fat > 30.1 g",
        "Protein > 51.1 g",
        "Sodium > 1278 mg"
    ],
    "n": "Baked Salmon with Lemony Orzo and Basil-Bacon Peas",
    "a": "Julie Hubert",
    "r": "0",
    "s": 4,
    "des": "\"Orzo, lemon, basil, bacon, peas, and baked sockeye salmon come together to make a quick and easy weeknight pasta dish for the whole family.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C). Line a baking pan with aluminum foil or parchment paper.\nBring a large pot of lightly salted water to a boil. Cook orzo in the boiling water, stirring occasionally until tender yet firm to the bite, about 10 minutes. Drain.\nMix garlic powder, 4 leaves basil, and 1/2 teaspoon salt together in a small bowl.\nPlace salmon skin side-down on the prepared pan. Brush with 1 tablespoon butter; sprinkle garlic-basil mixture on top.\nBake in the preheated oven until salmon flakes easily with a fork, about 8 minutes. Remove and let rest.\nPlace bacon in a skillet over medium-low heat and cook, stirring often, until crispy, about 4 minutes. Add 1/2 teaspoon salt and peas. Season with pepper. Cook and stir until peas are heated through, 3 to 4 minutes.\nWhisk remaining 3 tablespoons butter, juice from 1 lemon, and remaining 1 teaspoon salt together in a bowl. Pour over the cooked orzo and toss to coat. Season with pepper.\nDivide orzo among 4 plates; top with salmon and place peas on the side. Garnish with the remaining basil. Drizzle remaining lemon juice on top.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}