{
    "id": 259455,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup unsalted butter",
        "1/4 cup olive oil",
        "3 cups diced mushrooms",
        "1 cup chopped onion",
        "1 sprig rosemary",
        "1 1/2 cups Arborio rice",
        "3/4 cup white wine",
        "1 quart chicken stock",
        "salt and ground black pepper to taste",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 645 kcal",
        "Carbs > 76.6 g",
        "Cholesterol > 40 mg",
        "Fat > 28.7 g",
        "Protein > 12.4 g",
        "Sodium > 881 mg"
    ],
    "n": "Instant PotÂ® Mushroom Risotto",
    "a": "Shauna James Ahern",
    "r": "0",
    "s": 4,
    "des": "\"Creamy risotto with softened mushrooms and a sprinkling of cheese seems like a dish best ordered at a restaurant instead of made at home. That's because traditionally risotto is made slowly, stirring often, adding 1/4 cup of hot stock at a time, then more stirring. It's a labor-intensive dish that's worth the fuss. However, risotto made in a pressure cooker is so simple and quick that it feels like cheating. It's not. This is the real stuff. You'll probably start making risotto far more often after you try this one.\"",
    "ins": "Select the \"Saute\" setting on an electric pressure cooker (such as Instant Pot(R)). Add butter and olive oil; stir until butter melts, about 2 minutes. Add mushrooms; cook, stirring occasionally, until slightly softened, about 3 minutes. Stir in onion; cook for 2 minutes. Add rosemary sprig; cook for 1 minute.\nStir rice into the pressure cooker until each grain is coated with butter-olive oil mixture, about 2 minutes. Pour in wine; simmer for 3 minutes. Pour in chicken stock, stirring to scrape the sides of the pot. Simmer for 1 minute.\nSeal pressure cooker and turn the venting knob to point at \"Sealed.\" Press the \"Manual\" button; set timer for 6 minutes.\nTap venting knob a few times with a wooden spoon or spatula. Stand back; turn knob to point at \"Vent.\" Remove lid when pressure is released, about 5 minutes.\nStir risotto until creamy, about 1 minute. Discard rosemary sprig. Season with salt and pepper. Stir in Parmesan cheese until melted and combined.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}