{
    "id": 259444,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil, or more to taste",
        "4 boneless chicken breast halves",
        "1 teaspoon Worcestershire sauce",
        "1 teaspoon hot pepper sauce",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon ground paprika",
        "1/4 teaspoon cayenne pepper",
        "salt and ground black pepper to taste",
        "1 1/2 teaspoons lemon juice",
        "1 (15 ounce) can black beans, drained and rinsed",
        "1 red bell pepper, diced",
        "1 orange bell pepper, diced",
        "1 green bell pepper, diced",
        "1/2 white onion, diced",
        "5 (6 inch) corn tortillas, cut into strips",
        "1 (10.5 ounce) can cream of chicken soup",
        "1/2 (8 ounce) package cream cheese",
        "1/2 cup shredded Cheddar cheese",
        "1/4 cup sour cream"
    ],
    "nut": [
        "Calories > 610 kcal",
        "Carbs > 42.8 g",
        "Cholesterol > 130 mg",
        "Fat > 29.4 g",
        "Protein > 44.1 g",
        "Sodium > 1234 mg"
    ],
    "n": "All-in-One-Pan Chicken Enchiladas",
    "a": "sillybakedbunny",
    "r": "0",
    "s": 4,
    "des": "\"Great for a quick throw-together weeknight meal. Easy to add and subtract ingredients and make it your own. No extra dishes to clean! Serve enchiladas with lettuce, tomatoes, and green onions on top.\"",
    "ins": "Heat olive oil in a large skillet over medium heat. Add chicken breasts; drizzle Worcestershire sauce and hot sauce on top. Season with cumin, paprika, cayenne pepper, salt, and pepper. Cover and cook, breaking chicken apart into small chunks with a wooden spoon, until no longer pink in the center and the juices run clear, about 15 minutes. Stir in lemon juice.\nReduce heat to medium-low. Mix in black beans, red bell pepper, orange bell pepper, green bell pepper, onion, and tortilla strips. Simmer until peppers are slightly softened, about 5 minutes. Add cream of chicken soup, cream cheese, Cheddar cheese, and sour cream. Cook and stir until cheeses are melted and hot, about 5 minutes.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}