{
    "id": 259481,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour, plus more for kneading",
        "5 teaspoons olive oil",
        "1/2 teaspoon fine salt",
        "2 teaspoons white wine vinegar",
        "3/4 cup warm water (110 degrees F (43 degrees C))",
        "Starch Mixture:",
        "1/2 cup cornstarch",
        "2 tablespoons all-purpose flour"
    ],
    "nut": [
        "Calories > 178 kcal",
        "Carbs > 32.6 g",
        "Cholesterol > 0 mg",
        "Fat > 3.3 g",
        "Protein > 3.5 g",
        "Sodium > 148 mg"
    ],
    "n": "Homemade Phyllo (or Filo) Dough",
    "a": "Chef John",
    "r": "0",
    "s": 8,
    "des": "\"I'm no expert at making phyllo dough, but the good news is, despite that, I still managed to achieve some fairly excellent results, and suspect you will as well. And it's way more fun than buying it frozen from the store.\"",
    "ins": "Place 2 cups flour in a mixing bowl; make a well in the center. Drizzle in olive oil and add salt; add white wine vinegar and warm water. Mix until dough just comes together and pulls away from the sides of the bowl, 1 or 2 minutes. Transfer dough ball to a lightly floured work surface.\nKnead until dough is smooth, using just enough flour to keep it from sticking to the work surface or your hands, 2 or 3 minutes. Continue to knead until dough is supple and elastic, about 5 more minutes. Wrap dough ball in plastic wrap and let rest at room temperature, 1 to 2 hours.\nDivide dough into 20 (20 gram) portions using a kitchen scale; roll each portion into a ball. Place on plate and cover with plastic wrap to prevent dough balls from drying out while you begin to roll them out. Work in batches of 5.\nMix cornstarch and 2 tablespoons flour together in a bowl. Dust a work surface and the first dough ball with the cornstarch mixture. Flatten out the dough ball and roll out into a circle, about 5 inches in diameter. Dust again with cornstarch mixture. Set circle to one side. Roll out 4 more dough balls to about the same diameter and stack them on the first one, dusting each layer with more of the cornstarch mixture to keep them from sticking together.\nWhen you have 5 circles, roll out the stack to a larger circle about double in size, turning as you go to maintain a round shape. Separate each layer and lay out the circles. Re-apply more cornstarch mixture where needed and restack them. Roll again until the 5-layer stack is paper thin, about 10 to 12 inches in diameter. Place on a sheet of parchment paper; top with another piece of parchment. Gently roll up the dough; wrap in plastic wrap. Refrigerate.\nRepeat with the remaining 15 balls of dough in batches of 5.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}