{
    "id": 259448,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "cooking spray",
        "Cake:",
        "1 (15.25 ounce) package yellow cake mix",
        "1 cup water",
        "3 eggs",
        "1/4 cup vegetable oil",
        "Graham Crumbs:",
        "2 cups finely crushed graham cracker crumbs",
        "6 tablespoons unsalted butter, melted",
        "Triple Berry Filling:",
        "8 ounces fresh strawberries, hulled and chopped",
        "8 ounces fresh blackberries",
        "6 ounces fresh raspberries",
        "1/3 cup white sugar",
        "1/3 cup water",
        "2 tablespoons lemon juice",
        "Cheesecake:",
        "1 (14 ounce) can sweetened condensed milk, divided",
        "2 (8 ounce) packages cream cheese, softened",
        "1/4 cup fresh lemon juice",
        "1/4 teaspoon sea salt"
    ],
    "nut": [
        "Calories > 603 kcal",
        "Carbs > 68.8 g",
        "Cholesterol > 115 mg",
        "Fat > 33.2 g",
        "Protein > 10.1 g",
        "Sodium > 529 mg"
    ],
    "n": "Triple Berry Cheesecake Poke Cake",
    "a": "Julie Hubert",
    "r": "0",
    "s": 12,
    "des": "\"Poke a classic yellow cake and fill with homemade berry sauce before topping with a tangy, delicious no-bake cheesecake! This cake is best made the day before, which makes it great to bring to all those summer potlucks!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray and line with parchment paper.\nMix cake mix, 1 cup water, eggs, and vegetable oil in a stand mixer on low speed for 30 seconds. Increase speed to medium and mix for 2 minutes more. Pour batter into the prepared baking dish.\nBake in the preheated oven until cake is golden brown, about 25 minutes. Cool cake at room temperature for 10 minutes. Keep oven on.\nLine a baking sheet with parchment paper.\nMix graham cracker crumbs and melted butter together in a bowl; spread onto the prepared baking sheet.\nBake graham cracker crumb mixture for 10 minutes. Cool to room temperature and store in an airtight container.\nMix strawberries, blackberries, raspberries, sugar, 1/3 cup water, and 2 tablespoons lemon juice together in a saucepan; bring to a boil. Reduce heat and simmer, stirring occasionally, until fruit is soft and easily mashed, 7 to 8 minutes. Mash berries together with a fork and cool for 5 minutes.\nPoke 5 rows of 6 holes in the cake using the handle of a wooden spoon, creating 30 holes. Drizzle 1/3 cup sweetened condensed milk over the entire cake. Pour berry mixture over cake and spread using a spatula, ensuring berry mixture goes into the holes. Cover cake and refrigerate at least 1 hour.\nPlace cream cheese in the bowl of a stand mixer fitted with a whisk attachment; mix on high until very smooth, at least 3 minutes. Add the remaining sweetened condensed milk, 1/4 cup lemon juice, and sea salt; mix for 1 minute. Spread cream cheese mixture over the cooled cake. Cover and chill cake, 3 hours to overnight.\nSlice into 12 large pieces and top each with graham cracker crumb mixture.",
    "pt": "30 m",
    "ct": "42 m",
    "tt": "5 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}