{
    "id": 259483,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 yellow onion, coarsely chopped",
        "3 cloves garlic, peeled and crushed",
        "1 large bay leaf",
        "1 1/2 teaspoons smoked Spanish paprika",
        "1 1/2 teaspoons kosher salt",
        "1 tablespoon olive oil",
        "1/2 cup white wine",
        "Octopus:",
        "1 (1 pound) piece Spanish octopus",
        "2 tablespoons olive oil",
        "Sauce:",
        "1/3 cup braising liquid",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon extra-virgin olive oil",
        "salt to taste",
        "1 pinch cayenne pepper to taste"
    ],
    "nut": [
        "Calories > 513 kcal",
        "Carbs > 15 g",
        "Cholesterol > 109 mg",
        "Fat > 29.7 g",
        "Protein > 35.1 g",
        "Sodium > 2046 mg"
    ],
    "n": "Spanish Octopus",
    "a": "Chef John",
    "r": "0",
    "s": 2,
    "des": "\"Above and beyond the ingredients, the cooking method, or should I say methods, couldn't be easier. As long as you braise it gently on low heat, until just tender, and then give it a nice sear before serving, you should be in great shape.Â This smoky braised octopus is great served with crusty roasted potatoes.\"",
    "ins": "Place chopped onion, garlic cloves, bay leaf, paprika, salt, and 1 tablespoon olive oil into saucepan. Cook and stir over medium-high heat until onions start to soften, about 5 minutes. Add white wine to create the braising liquid. Bring to a simmer.\nTransfer octopus into braising liquid, turning to coat with the liquid. Cover; reduce heat to low. Simmer 20 minutes and turn octopus over. Continue cooking until octopus is tender, another 40 to 45 minutes.\nRemove from heat; transfer octopus to a large bowl. Pour braising liquid over octopus. Place bowl above a bowl of ice water to cool to room temperature.\nCover bowl with plastic wrap when octopus and liquid are cool. Refrigerate until thoroughly chilled, at least 2 hours or overnight.\nTransfer octopus to a work surface and mop off braising juices with paper towels; remove as much of the purple skin as you want. Cut octopus into 3 or 4 serving-size pieces. Brush with olive oil.\nTransfer braising liquid to saucepan. Bring to a boil; remove from heat. Strain out solids; transfer liquid to a mixing bowl; let cool about 10 minutes. Stir in lemon juice, extra-virgin olive oil, parsley, salt, and cayenne pepper to make the serving sauce.\nHeat a grill pan or outdoor grill to high heat. Transfer octopus pieces to grill. Cook until flesh is seared, almost charred, 3 or 4 minutes. Turn and cook other side until dark brown, caramelized, and heated through, another 3 or 4 minutes. Transfer to a platter.\nSlice octopus into fairly thick diagonal slices. Place on a serving dish. Spoon braising liquid mixture over the top. Dust with a bit of cayenne pepper, if desired.",
    "pt": "10 m",
    "ct": "1 h ",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}