{
    "id": 259465,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Tomato Sauce:",
        "3 tablespoons extra-virgin olive oil",
        "1 onion, finely chopped",
        "1 carrot, finely chopped",
        "1 rib celery, finely chopped",
        "4 cups tomato puree",
        "2 tablespoons milk",
        "salt",
        "Stock:",
        "1 onion, peeled",
        "1 carrot",
        "1 stalk celery",
        "4 cups water",
        "8 cups stale Italian bread, crumbled",
        "1 1/4 cups grated Parmesan cheese",
        "1 tablespoon extra-virgin olive oil, divided",
        "2 tablespoons Parmesan cheese, shaved",
        "5 leaves chopped fresh basil"
    ],
    "nut": [
        "Calories > 584 kcal",
        "Carbs > 71.7 g",
        "Cholesterol > 25 mg",
        "Fat > 24.7 g",
        "Protein > 22.7 g",
        "Sodium > 1911 mg"
    ],
    "n": "Tuscan Tomato Soup (Pappa al Pomodoro)",
    "a": "Roberta",
    "r": "0",
    "s": 4,
    "des": "\"Known in Tuscany and all over Italy as Pappa al pomodoro, this thick soup is made with tomatoes, Parmesan, and day-old bread. You can use this soup as base for a more gourmet dish, adding grilled fish or prawns on top.\"",
    "ins": "Heat 3 tablespoons olive oil in a large saucepan over medium heat; add chopped onion, chopped carrot, and chopped celery. Cook until softened, stirring often, about 15 minutes. Stir in tomato passata and milk. Season with salt, cover and simmer tomato sauce until flavors are well combined, 20 minutes.\nCombine whole onion, whole carrot, and whole celery stalk in a stockpot; cover with water and bring to a boil. Simmer for 15 minutes. Strain vegetables and keep stock warm.\nStir 1 1/2 cups stock into tomato sauce. Add stale bread; stir and set aside for 15 to 20 minutes to allow the bread to soften.\nCombine tomato-bread mixture, 1 1/4 cups grated Parmesan cheese, and 1 teaspoon of olive oil in a blender; blend until mixture has consistency of a mousse.\nLadle soup into bowls and serve with shaved Parmesan cheese and drizzled with remaining olive oil. Garnish with basil leaves.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}