{
    "id": 259564,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (12 ounce) package mild Italian pork sausage",
        "1 large apple, diced",
        "salt",
        "1 egg",
        "1 egg yolk",
        "1 (14.1 ounce) package pastry for 9-inch double-crust pie",
        "1/4 cup finely grated Parmesan cheese, divided",
        "2 teaspoons thyme leaves, roughly chopped, divided",
        "freshly ground pepper to taste"
    ],
    "nut": [
        "Calories > 376 kcal",
        "Carbs > 26.4 g",
        "Cholesterol > 68 mg",
        "Fat > 25.3 g",
        "Protein > 10.6 g",
        "Sodium > 662 mg"
    ],
    "n": "Sausage and Apple Pie in a Parmesan Thyme Crust",
    "a": "Ashley Baron Rodriguez",
    "r": "0",
    "s": 8,
    "des": "\"Make these savory hand pies the day before and pop in the oven to serve. Serve warm or at room temperature.\"",
    "ins": "Heat a large skillet over medium heat. Add sausage; cook, breaking meat apart with a wooden spoon, until browned, about 5 minutes. Add apple; cook and stir until starting to soften, 2 to 3 minutes. Season with salt. Let filling stand until cooled, at least 15 minutes.\nBeat egg and egg yolk together in a small bowl to make egg wash.\nPreheat oven to 450 degrees F (230 degrees C). Line 2 baking sheets with parchment paper.\nUnroll pastries onto a lightly floured work surface. Spread and gently press 1 tablespoon Parmesan cheese and 1/2 teaspoon thyme over each pastry.\nSlice each pastry crosswise into 4 wedges. Add a generous 1/4 cup filling to each wedge. Brush edges with egg wash. Fold dough over the filling and seal the pies. Crimp edges with a fork and trim any excess dough. Arrange pies on the prepared baking sheets. Brush with any remaining egg wash; sprinkle the remaining 2 tablespoons Parmesan cheese and 1 teaspoon thyme over pies. Season with pepper.\nBake in the preheated oven until golden brown, rotating pans halfway through, 12 to 15 minutes. Let cool before serving, about 10 minutes.",
    "pt": "35 m",
    "ct": "17 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}