{
    "id": 259568,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound butternut squash, peeled and diced, or more to taste",
        "1/4 cup olive oil, divided",
        "4 ears corn on the cob, husks and silk removed",
        "1 tablespoon olive oil, or as needed",
        "1 small red onion, chopped",
        "3/4 cup dried cranberries",
        "lemon, juiced",
        "3 tablespoons chile paste",
        "1 tablespoon garlic powder",
        "1 teaspoon cider vinegar",
        "1/2 teaspoon paprika",
        "1/2 bunch cilantro, chopped"
    ],
    "nut": [
        "Calories > 197 kcal",
        "Carbs > 30.9 g",
        "Cholesterol > 0 mg",
        "Fat > 9.9 g",
        "Protein > 2.6 g",
        "Sodium > 61 mg"
    ],
    "n": "Roasted Butternut Squash and Corn Salad with Cranberries and Cilantro",
    "a": "devaroni",
    "r": "0",
    "s": 8,
    "des": "\"Perfect side dish for fall, may be served warm or cold. Also note that it is gluten-free!\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nArrange butternut squash into a single layer onto a baking pan. Drizzle 1 tablespoon olive oil on top. Wrap each ear of corn in aluminum foil.\nBake in the preheated oven until squash is tender, about 15 minutes. Continue cooking corn until charred, about 15 minutes more.\nCut corn kernels off cob; place in a container with the butternut squash.\nHeat 1 tablespoon olive oil in a skillet over medium heat. Add red onion; cook and stir until softened and translucent, about 5 minutes. Add cranberries; cook and stir until soft and slightly plump, 5 to 7 minutes. Transfer onion and cranberries to the squash mixture.\nCombine the remaining 2 tablespoons olive oil, lemon juice, chile paste, garlic powder, vinegar, and paprika in a bowl. Toss with the cranberry-squash mixture. Mix cilantro into the salad.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}