{
    "id": 259549,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 slices sourdough bread",
        "1 tablespoon unsalted butter",
        "1 tablespoon vegetable oil",
        "2 large russet potatoes, unpeeled and whole",
        "1 1/2 teaspoons salt",
        "1/8 teaspoon ground nutmeg",
        "1/2 cup all-purpose flour, or more if needed",
        "2 tablespoons cornstarch",
        "1 large egg"
    ],
    "nut": [
        "Calories > 216 kcal",
        "Carbs > 36.7 g",
        "Cholesterol > 36 mg",
        "Fat > 5.4 g",
        "Protein > 5.6 g",
        "Sodium > 655 mg"
    ],
    "n": "Kartoffelkloesse (German Potato Dumplings)",
    "a": "Chris Thorne",
    "r": "0",
    "s": 6,
    "des": "\"Just what the name implies, these are German-style potato dumplings, as found everywhere in the South of Germany, Austria, and Bohemia. These are traditionally served with any roast with gravy, but most well known as an accompaniment for a hearty Sauerbraten and red cabbage. Like polenta, second-day leftovers are a treat when sliced into slabs and fried in butter.\"",
    "ins": "Remove crust and slice bread into 1/2-inch cubes. Heat butter and oil together in a skillet over medium heat; fry bread cubes until golden brown, 3 to 5 minutes. Transfer to a paper-towel lined plate.\nBring a large pot of salted water to a boil. Add potatoes; cook until tender, about 45 minutes. Drain; allow to cool slightly. Peel and cut into large pieces. Transfer to a bowl; refrigerate about 30 minutes.\nMash potatoes with a fork; stir in salt and nutmeg. Add flour and cornstarch. Knead mixture in bowl, using your hands, until a smooth dough forms. Add more flour by tablespoon if dough is sticky. Mix in egg.\nRoll dough into balls, 1/4 cup per dumpling. Insert a bread cube into the center of each dumpling; roll between palms to smooth over.\nBring a large pot of salted water nearly to a boil. Place 4 dumplings at a time into the pot; cook until they float to the surface, 10 to 15 minutes. Transfer cooked dumplings to a large bowl using a slotted spoon; keep warm. Repeat with remaining dumplings.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}