{
    "id": 259556,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon unsalted butter",
        "2 tablespoons minced shallot",
        "1 teaspoon minced garlic",
        "1 (10 ounce) package button mushrooms, finely chopped",
        "1 1/2 teaspoons salt, divided",
        "ground white pepper to taste",
        "1/3 cup toasted walnuts",
        "3 tablespoons dry white wine",
        "4 Cornish game hens",
        "1 teaspoon paprika",
        "1 teaspoon onion powder",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon freshly ground black pepper",
        "4 sprigs fresh thyme"
    ],
    "nut": [
        "Calories > 755 kcal",
        "Carbs > 13.3 g",
        "Cholesterol > 310 mg",
        "Fat > 52.2 g",
        "Protein > 57.1 g",
        "Sodium > 1028 mg"
    ],
    "n": "Mushroom and Walnut Stuffed Cornish Hens",
    "a": "Bizou",
    "r": "0",
    "s": 4,
    "des": "\"This is a simple and easy recipe for roasted Cornish hens. This changes things up a bit from chicken!\"",
    "ins": "Melt butter in a large skillet over medium-high heat. Add shallot and garlic; cook and stir for 30 seconds. Add mushrooms, 1/2 teaspoon salt, and white pepper. Reduce heat to medium; cook, stirring often, until moisture has evaporated and mushrooms start to brown, about 12 minutes.\nStir walnuts and white wine into the skillet. Cook, scraping browned bits off the bottom of the skillet, until wine has evaporated, 3 to 5 minutes. Remove from heat and let cool, 10 to 15 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nSeason Cornish hens inside and out with remaining 1 teaspoon salt, paprika, onion powder, garlic powder, and black pepper. Open cavities gently with your fingers; stuff with mushroom mixture. Pull skin back in place to cover stuffing. Place hens breast side-up in a roasting pan.\nRoast in the preheated oven, basting once or twice with juices from the pan, until an instant-read thermometer inserted into the thickest part of the thigh registers 180 degrees F (82 degrees C), about 45 minutes. Garnish with thyme sprigs.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}