{
    "id": 259587,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups chocolate wafer cookie crumbs",
        "5 tablespoons butter",
        "3 (8 ounce) packages cream cheese, at room temperature",
        "5 eggs",
        "1 cup white sugar",
        "2 teaspoons vanilla extract",
        "2 (4 ounce) bars dark chocolate (such as LindtÂ® 70% Cocoa)",
        "1 (4 ounce) bar milk chocolate (such as LindtÂ® Milk Chocolate Classic Recipe Bar)",
        "1/2 cup sour cream"
    ],
    "nut": [
        "Calories > 702 kcal",
        "Carbs > 58.8 g",
        "Cholesterol > 191 mg",
        "Fat > 47.9 g",
        "Protein > 12.2 g",
        "Sodium > 421 mg"
    ],
    "n": "\"Make-Them-Swoon\" Chocolate Cheesecake",
    "a": "clmurphy",
    "r": "0",
    "s": 10,
    "des": "\"Every time I make this cheesecake people think I bought it from the Cheesecake Factory. It truly is an amazing recipe that people will just go gaga over. I like to decorate with prepared cream cheese frosting and raspberries (the raspberries add a nice complementary flavor).\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C).\nMix cookie crumbs and butter together in a bowl. Press crust mixture into a 9-inch springform pan.\nBeat cream cheese, eggs, sugar, and vanilla extract together in a large bowl with an electric mixer until smooth and fluffy. Spoon 1/2 of the cream cheese mixture into the crust.\nBreak dark chocolate and milk chocolate into smaller pieces. Place dark chocolate and 1/4 of the milk chocolate in the top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, about 5 minutes.\nStir melted chocolate into the bowl of remaining cream cheese mixture. Drizzle over the batter in the crust to make a swirl pattern.\nBake in the preheated oven until center is set, about 50 minutes. Transfer cheesecake to a wire rack to cool cheesecake completely, at least 40 minutes.\nPlace the cheesecake on a serving plate. Cover with plastic wrap and refrigerate until chilled, 2 hours to overnight.\nMelt the remaining milk chocolate using the double broiler, about 5 minutes. Combine with sour cream in a small bowl; spread over the cheesecake. Chill until frosting is set, about 5 minutes.",
    "pt": "15 m",
    "ct": "52 m",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}