{
    "id": 259563,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust and Crumb Topping:",
        "2 1/2 cups all-purpose flour",
        "6 tablespoons white sugar, divided",
        "2 teaspoons ground cinnamon, divided",
        "1 1/2 teaspoons salt",
        "1 teaspoon cream of tartar",
        "3/4 cup unsalted butter, melted",
        "1 tablespoon apple cider vinegar",
        "1 tablespoon water",
        "Filling:",
        "5 Granny Smith apples - peeled, cored, and sliced",
        "1/2 cup white sugar",
        "3 tablespoons all-purpose flour",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon sea salt"
    ],
    "nut": [
        "Calories > 432 kcal",
        "Carbs > 65.6 g",
        "Cholesterol > 46 mg",
        "Fat > 17.7 g",
        "Protein > 4.8 g",
        "Sodium > 496 mg"
    ],
    "n": "Snickerdoodle-Crusted Apple Pie",
    "a": "Ashley Baron Rodriguez",
    "r": "0",
    "s": 8,
    "des": "\"What happens when you combine two of our favorite things into one pie? Magic. Buttery cookie crumbs scented with cinnamon act as both crust and crumble topping, making this an easy and delicious dessert option for your Thanksgiving table.\"",
    "ins": "Preheat oven to 425 degrees F (220 degrees C); position rack in the bottom third of oven.\nWhisk 2 1/2 cups flour, 2 tablespoons sugar, 1 teaspoon cinnamon, 1 1/2 teaspoons salt, and cream of tartar in a large bowl. Drizzle in butter. Stir crust mixture until just combined and crumbly.\nTransfer 1 1/4 cups of crust mixture into a separate bowl; add the remaining 1/4 cup sugar and 1 teaspoon cinnamon. Knead with your fingertips until well combined but still crumbly. Cover with plastic wrap; freeze crumb topping until ready to use.\nPour vinegar and water into the remaining crust mixture. Mix to form a dough; transfer to a lightly floured work surface and knead until smooth. Press dough onto the bottom and sides of a pie plate using a flat-bottomed measuring cup to make the bottom crust. Crimp edges with a lightly floured fork. Freeze until ready to use.\nToss apples, 1/2 cup sugar, 3 tablespoons flour, 1 teaspoon cinnamon, and sea salt together in a large bowl. Pile over the bottom crust and cover with the crumb topping.\nBake on the bottom rack of the preheated oven until lightly browned, about 20 minutes.\nReduce oven temperature to 350 degrees F (174 degrees C). Turn pie and continue baking, covering crust aluminum foil or a pie shield halfway through, until crust is golden brown, about 50 minutes. Cool on a wire rack before slicing, about 1 hour.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}