{
    "id": 259562,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Crust:",
        "1 1/4 cups panko bread crumbs",
        "1/2 cup white sugar",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon sea salt",
        "5 tablespoons unsalted butter, melted",
        "Filling:",
        "1 (15 ounce) can pumpkin",
        "1 (8 ounce) package cream cheese, at room temperature",
        "2 teaspoons pumpkin pie spice",
        "1 teaspoon vanilla extract",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon sea salt",
        "1 cup heavy whipping cream",
        "1/2 cup white sugar"
    ],
    "nut": [
        "Calories > 426 kcal",
        "Carbs > 43.4 g",
        "Cholesterol > 91 mg",
        "Fat > 28.7 g",
        "Protein > 5.2 g",
        "Sodium > 471 mg"
    ],
    "n": "Cinnamon Toast-Crusted Pumpkin Pie",
    "a": "Ashley Baron Rodriguez",
    "r": "0",
    "s": 8,
    "des": "\"We take the classic flavors of cinnamon toast and turn it into a crust in this simple pumpkin pie recipe. Serve with plenty of whipped cream and a sprinkle of cinnamon.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nCombine bread crumbs, 1/2 cup sugar, cinnamon, and salt in the bowl of a food processor; process for 15 seconds. Pour in melted butter; process until moist crumbs form, about 1 minute. Press into the bottom and up the sides of a 9-inch pie plate (not deep dish).\nBake in the preheated oven until deep golden brown, 25 to 30 minutes. Cool completely, about 30 minutes.\nBeat pumpkin and cream cheese together in the bowl of a stand mixer until no lumps remain, about 2 minutes. Add pumpkin pie spice, vanilla extract, cinnamon, and salt; stir to combine. Transfer mixture to a bowl.\nPour cream and 1/2 cup sugar into the bowl of a stand mixer; beat on high until stiff peaks form, 3 to 5 minutes. Fold into pumpkin mixture with a rubber spatula, being careful not to deflate the cream. Pour mixture into the crust; refrigerate until set, 4 hours to overnight.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "5 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}