{
    "id": 259588,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup chocolate cookie crumbs",
        "1/4 cup butter, softened",
        "2 tablespoons white sugar",
        "3 (8 ounce) packages cream cheese, softened",
        "1 cup white sugar",
        "3 eggs",
        "3 (4 ounce) bars semisweet chocolate",
        "4 tablespoons heavy whipping cream",
        "1/8 teaspoon salt",
        "1 cup sour cream",
        "2 tablespoons raspberry essence",
        "Topping:",
        "3 tablespoons raspberry jam",
        "3 (4 ounce) bars semisweet chocolate",
        "3 tablespoons heavy whipping cream",
        "12 fresh raspberries"
    ],
    "nut": [
        "Calories > 546 kcal",
        "Carbs > 48.1 g",
        "Cholesterol > 104 mg",
        "Fat > 38.6 g",
        "Protein > 8.5 g",
        "Sodium > 227 mg"
    ],
    "n": "Copycat Chocolate Raspberry Cheesecake",
    "a": "Goli",
    "r": "0",
    "s": 16,
    "des": "\"This is the closest I could get to the chocolate raspberry cheesecake from the Cheesecake FactoryÂ®! To make chocolate leaves to decorate your cake, melt 1 ounce semisweet chocolate in a pan or bowl set over boiling water, stir until smooth. Brush real nontoxic plant leaves (such as orange leaves) on 1 side with melted chocolate. Freeze until firm and then peel off the chocolate leaves. Freeze until needed.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Butter a 9-inch springform pan.\nCombine cookie crumbs, 1/4 cup butter, and 2 tablespoons sugar in a bowl; press into the bottom of the prepared pan.\nBeat cream cheese in a bowl using an electric mixer until smooth. Add 1 cup sugar gradually; mix until well blended. Add eggs, 1 at a time; beat at low speed until very smooth.\nSet a heat-proof bowl over a saucepan of boiling water. Break 3 bars of chocolate into pieces and place in the bowl; add 4 tablespoons cream and salt. Stir until melted, about 2 minutes.\nPour chocolate into cream cheese mixture; blend well. Stir in sour cream and raspberry essence; beat until smooth. Pour into the prepared pan.\nBake in the center of the preheated oven until set but still soft, about 45 minutes. Do not over bake; the cake will firm up when chilled. Turn off heat; leave cake in oven with door ajar for 45 minutes more. Remove cake from oven; refrigerate in the pan until firm, at least 12 hours.\nRemove cake from pan carefully; transfer to a serving plate. Top with a very thin layer of raspberry jam.\nSet a heat-proof bowl over a saucepan of boiling water. Break remaining 3 bars of chocolate into pieces and place in the bowl; add 3 tablespoons cream. Stir until melted, about 2 minutes. Pour the melted chocolate evenly over the cake. Arrange raspberries on top; refrigerate until set, about 30 minutes.",
    "pt": "45 m",
    "ct": "49 m",
    "tt": "14 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}