{
    "id": 259582,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter, softened",
        "1 (8 ounce) package cream cheese, softened",
        "1 1/2 cups white sugar",
        "1 egg",
        "1 teaspoon vanilla extract",
        "1 (0.13 ounce) package unsweetened cherry-flavored soft drink mix (such as Kool-AidÂ®)",
        "1/2 teaspoon almond extract",
        "3 1/2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1 teaspoon maraschino cherry juice, or as needed (optional)",
        "1 teaspoon milk, or as needed (optional)",
        "1 teaspoon lemon juice, or as needed (optional)"
    ],
    "nut": [
        "Calories > 146 kcal",
        "Carbs > 17.9 g",
        "Cholesterol > 26 mg",
        "Fat > 7.5 g",
        "Protein > 2 g",
        "Sodium > 88 mg"
    ],
    "n": "Cherry Cheesecake Hearts",
    "a": "kareninfla",
    "r": "0",
    "s": 36,
    "des": "\"This is the result of my trying to create a cut-out cookie homage to the cherry cheesecake martini my friends and I enjoy at our local martini bar. Unsweetened Kool-AidÂ® gives these cookies their pretty pink color with just the right balance of sweet and tart. You could certainly substitute strawberry, tropical punch, or even pink lemonade Kool-AidÂ® if you prefer. Just be sure to use the unsweetened powder. Glaze with your favorite frosting or icing and decorate as desired. I glazed my cooled cookie hearts with Sugar Cookie Icing by JBS BOX and sprinkled with purple decorating sugar, as I was sending these hearts to wounded soldiers at a military hospital. Tint the icing the same color as your decorating sugar for an intensely vibrant, colorful cookie.\"",
    "ins": "Beat butter and cream cheese in a bowl until smooth and creamy. Add sugar; beat until mixture is pale yellow and fluffy. Add egg, vanilla extract, soft drink mix, and almond extract; beat well.\nSift flour, baking powder, and salt into a bowl. Add to cream cheese mixture; beat until well mixed. Add maraschino cherry juice, milk, or lemon juice to loosen dough; mix to incorporate. Divide in half; wrap in plastic wrap and refrigerate 2 hours to overnight.\nPreheat oven to 375 degrees F (190 degrees C). Line 2 baking sheets with parchment paper.\nRoll dough to 1/4-inch to 1/8-inch thickness on a lightly floured surface. Cut out using a heart-shaped cookie cutter; transfer cookies to the prepared sheets.\nBake in the preheated oven until golden, 8 to 10 minutes. Cool on a wire rack, about 15 minutes.",
    "pt": "30 m",
    "ct": "8 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}