{
    "id": 259544,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups all-purpose flour",
        "2 tablespoons all-purpose flour",
        "2 teaspoons baking powder",
        "1 cup white sugar",
        "1 cup finely ground almonds",
        "2 eggs",
        "3 tablespoons rum",
        "1/2 teaspoon vanilla extract",
        "9 tablespoons butter, cut into small pieces",
        "Icing:",
        "1 cup confectioners' sugar",
        "1 (1 ounce) bottle rum flavored extract",
        "1 teaspoon hot water, or more as needed",
        "48 blanched almond halves"
    ],
    "nut": [
        "Calories > 119 kcal",
        "Carbs > 16 g",
        "Cholesterol > 13 mg",
        "Fat > 4.9 g",
        "Protein > 2.4 g",
        "Sodium > 39 mg"
    ],
    "n": "Rumherzen",
    "a": "Heide F",
    "r": "0",
    "s": 48,
    "des": "\"A traditional German christmas cookie that has a buttery rum and almond flavoring. They look simple but taste like a warm Christmas on a cold snowy day. Store in an airtight container for up to 1 week.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nSift 4 cups plus 2 tablespoons flour and baking powder onto a pastry board.\nMake a well in the center of the flour mixture; add white sugar, almonds, eggs, and rum. Mix in flour from the sides of the well to form a thick paste. Drop butter pieces into the flour. Knead dough, starting from the middle, until firm and smooth.\nRoll out dough to 1/8-inch thickness on a floured work surface. Cut into shapes using 3-inch cookie cutters. Transfer to the prepared baking sheets using a spatula.\nBake in the preheated oven until edges are golden, 8 to 12 minutes. Transfer to wire racks to cool slightly, about 5 minutes.\nMix confectioners' sugar, rum flavoring, and water together in a bowl to make icing. Spread icing over warm cookies. Place 1 almond half on top of each cookie.",
    "pt": "35 m",
    "ct": "8 m",
    "tt": "53 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}