{
    "id": 259586,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "20 vanilla sandwich cookies (such as Oreo Golden Original Sandwich CookiesÂ®)",
        "1/4 cup margarine",
        "Cheesecake:",
        "24 ounces cream cheese, softened",
        "2/3 cup white sugar",
        "2 tablespoons cornstarch",
        "3 eggs",
        "3/4 cup mashed bananas",
        "1/2 cup heavy whipping cream",
        "1 tablespoon vanilla extract",
        "Homemade Whipped Cream:",
        "2 cups heavy whipping cream",
        "1/4 cup white sugar, or to taste",
        "1 tablespoon vanilla extract"
    ],
    "nut": [
        "Calories > 936 kcal",
        "Carbs > 61.5 g",
        "Cholesterol > 265 mg",
        "Fat > 72.2 g",
        "Protein > 12.3 g",
        "Sodium > 504 mg"
    ],
    "n": "Cheesecake FactoryÂ® Banana Cheesecake with Homemade Whipped Cream",
    "a": "Allison",
    "r": "0",
    "s": 8,
    "des": "\"My family and I went to the Cheesecake FactoryÂ® in Nashville and we got the best cheesecake I had ever had. I came home and was determined to figure the recipe out. I tried it out one weekend and it tasted almost identical of the original. Garnish with more fresh banana slices.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace cookies in a food processor; pulse until finely crushed. Add margarine; pulse until well blended. Press the crumb mixture into the bottom of a 10-inch springform pan. Refrigerate crust until ready to use.\nBeat cream cheese in a large bowl with electric mixer at medium speed until creamy. Add 2/3 cup sugar and cornstarch; beat until blended. Add eggs, 1 at a time, beating well after each addition. Beat in bananas, 1/2 cup cream, and 1 tablespoon vanilla extract until well combined. Pour cream cheese mixture into the crust. Lay the pan on a baking sheet.\nBake in the preheated oven for 15 minutes. Reduce oven temperature to 200 degrees F (95 degrees C); continue baking until center is almost set, about 1 hour 15 minutes.\nLoosen edges of cheesecake from the pan. Refrigerate, uncovered, until completely chilled, 6 hours to overnight.\nBeat 2 cups cream in a chilled glass or metal bowl with an electric mixer until frothy. Add 1/4 cup sugar and 1 tablespoon vanilla extract gradually, continuing to beat until soft peaks form. Top cheesecake with whipped cream.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "7 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}