{
    "id": 259550,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (6 ounce) lean beef steaks, thinly sliced",
        "1/4 cup Dijon mustard",
        "salt and ground black pepper to taste",
        "4 slices smoked bacon",
        "1 large onion, finely chopped",
        "4 baby dill spears (optional)",
        "kitchen string",
        "2 tablespoons vegetable oil",
        "1 tablespoon butter",
        "1/2 teaspoon salt",
        "1 cup boiling water, or as needed",
        "1/4 cup ice-cold water",
        "2 tablespoons all-purpose flour"
    ],
    "nut": [
        "Calories > 421 kcal",
        "Carbs > 10.2 g",
        "Cholesterol > 108 mg",
        "Fat > 23.8 g",
        "Protein > 38.8 g",
        "Sodium > 1033 mg"
    ],
    "n": "Ingrid's Rouladen",
    "a": "ingrid",
    "r": "0",
    "s": 4,
    "des": "\"This recipe was made every Christmas Eve for dinner. It will always be a favorite of mine because it truly reminds me of family and of Christmas. The most important step in this recipe is the browning; it is what determines your gravy. You must brown this meat until it is very dark, but not burned. The browner the meat, the better the gravy. Take your time, and brown on medium to medium-low heat. My father is from a small town in Bavaria called Hof, and my mother is from Gelsenkirchen, which is in northwestern Germany. My paternal oma (grandma) made this with pickles and my maternal oma without the pickles. I preferred it without, even though I love pickles.\"",
    "ins": "Pound steaks very thin, about 1/8-inch thick, using the flat side of a mallet. Spread 1 tablespoon mustard over each; sprinkle with salt and black pepper.\nCenter 1 bacon slice on each steak. Sprinkle 1 tablespoon onion on top; reserve remaining onion. Place 1 pickle spear at the end of each steak; roll up, tucking edges in. Secure rolls with kitchen string.\nHeat oil and butter in a Dutch oven over medium-low heat. Place rolls in the Dutch oven; fry until very dark on all sides, 20 to 30 minutes. Transfer to a plate.\nPlace remaining onion in Dutch oven over medium heat. Cook and stir, scraping bits from the bottom, until onions are translucent, about 5 minutes. Add 1/2 teaspoon salt; stir. Add 1/4 cup boiling water; scrape the bottom again.\nReturn rolls to the Dutch oven. Add additional boiling water to just cover rolls; place lid on Dutch oven. Reduce heat to low; simmer until meat is very tender, about 90 minutes. Check from time to time, adding more boiling water if needed. Season with salt and pepper.\nTransfer rolls to a plate; keep warm. Combine ice-cold water and flour in a small container with a lid; shake to blend. Add mixture slowly to the simmering juices; stir until gravy is thickened, about 5 minutes.\nArrange rolls on a serving platter; cover with gravy.",
    "pt": "30 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}