{
    "id": 259558,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Crust:",
        "1 1/2 cups finely crushed graham crackers",
        "1/4 cup white sugar",
        "6 tablespoons butter, melted",
        "1 teaspoon ground cinnamon",
        "Filling:",
        "1 cup heavy whipping cream",
        "1 (12 ounce) bag dark chocolate chips",
        "1 cup raspberry preserves",
        "2 (8 ounce) packages cream cheese, softened",
        "1/2 cup white sugar",
        "2 eggs",
        "1/2 cup sour cream"
    ],
    "nut": [
        "Calories > 290 kcal",
        "Carbs > 29.4 g",
        "Cholesterol > 59 mg",
        "Fat > 19.2 g",
        "Protein > 3.3 g",
        "Sodium > 121 mg"
    ],
    "n": "Mini Chocolate-Raspberry Truffle Cheesecakes",
    "a": "cindy tee",
    "r": "0",
    "s": 24,
    "des": "\"These mini cheesecakes are very smooth and perfect with whipped cream topped with raspberries!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nMix graham cracker crumbs, sugar, butter, and cinnamon together in a bowl until well blended. Press mixture evenly into the cups of a mini muffin tin.\nBake in the preheated oven until golden, about 7 minutes. Remove from oven; allow to cool, about 5 minutes.\nReduce oven temperature to 325 degrees F (165 degrees C).\nHeat cream in the top of a double boiler over low heat until it begins to bubble. Remove from heat. Add chocolate chips; stir until fully melted. Mix in raspberry preserves; stir until dissolved. Allow mixture to cool, 8 to 10 minutes.\nCombine cream cheese and sugar in a bowl; beat until smooth. Blend in eggs 1 at a time using a wooden spoon. Fold in sour cream. Add chocolate-raspberry mixture; mix batter well.\nPour batter into crust-lined muffin tin, filling cups to the brim. Place tin into a large baking pan; pour in enough boiling water to come halfway up the outside of the muffin cups.\nBake in the preheated oven until set, about 20 minutes.\nTurn oven off; open oven door halfway and leave cheesecakes, still in the tin, inside to cool for 1 hour. Remove from oven; cool completely, about 1 hour more. Refrigerate until completely chilled, 8 hours to overnight.",
    "pt": "20 m",
    "ct": "32 m",
    "tt": "11 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}