{
    "id": 259699,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (9 ounce) packages ground pork chorizo",
        "30 (10 inch) flour tortillas",
        "1/2 cup olive oil",
        "6 cups shredded Cheddar cheese",
        "2 jalapeno peppers, sliced",
        "1/2 cup guacamole",
        "1/2 cup sour cream",
        "1/2 cup crumbled cotija cheese",
        "1/2 cup chopped cilantro",
        "1/4 cup sliced green onions"
    ],
    "nut": [
        "Calories > 880 kcal",
        "Carbs > 74.4 g",
        "Cholesterol > 85 mg",
        "Fat > 49.8 g",
        "Protein > 32.4 g",
        "Sodium > 1647 mg"
    ],
    "n": "Giant Nachos",
    "a": "Mackenzie Schieck",
    "r": "0",
    "s": 15,
    "des": "\"Each chip from this massive pile of nachos is about the size of a small piece of pizza. As they should be for the ultimate nacho lover, right?! This recipe takes more time than the average plate of nachos, but is well worth the effort. It's the perfect snack for a large group!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper. Line a jelly roll pan or large cake pan with parchment paper.\nHeat a large skillet over medium-high heat. Cook and stir pork chorizo in the hot skillet until browned and crumbly, about 7 minutes. Transfer to a bowl; place in the refrigerator.\nStack 5 tortillas. Slice off rounded edges to create large triangles. Repeat with remaining tortillas.\nPlace 3 to 5 tortilla triangles in a large bowl. Drizzle some olive oil on top; rub over the triangles with your fingers. Transfer to the prepared baking sheets. Repeat with remaining triangles and olive oil, arranging 6 triangles per baking sheet.\nBake in the preheated oven until toasted, 7 to 8 minutes. Remove from oven; flip with tongs. Continue baking until second side is golden brown, 7 to 8 minutes more. Transfer to a wire rack to cool. Repeat with remaining triangles.\nLayer baked triangles, chorizo, Cheddar cheese, and jalapeno slices in the prepared jelly roll pan.\nBake in the preheated oven until Cheddar cheese is melted, 20 to 25 minutes. Top with guacamole, sour cream, cotija cheese, cilantro, and green onions.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4549749.jpg",
    "o": "",
    "st": "allrecipes"
}