{
    "id": 259611,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "20 chocolate wafer cookies, finely ground",
        "1/4 cup butter",
        "1 tablespoon white sugar",
        "1/2 cup caramel chips, divided",
        "1/4 cup chopped peanuts, divided",
        "4 (8 ounce) packages cream cheese",
        "1 1/2 cups white sugar",
        "3/4 cup milk",
        "4 eggs",
        "1 cup sour cream",
        "1 tablespoon vanilla extract",
        "3 tablespoons all-purpose flour, divided",
        "16 mini chocolate-coated caramel-peanut nougat candy bars (such as SnickersÂ®), divided",
        "1 (7 ounce) can whipped cream (optional)",
        "1/4 cup chocolate chips"
    ],
    "nut": [
        "Calories > 647 kcal",
        "Carbs > 50.7 g",
        "Cholesterol > 179 mg",
        "Fat > 45.7 g",
        "Protein > 11.8 g",
        "Sodium > 387 mg"
    ],
    "n": "SnickersÂ® Cheesecake",
    "a": "Kara",
    "r": "0",
    "s": 12,
    "des": "\"Decadently rich, but oh so addictive. Combines two of my loves, candy and cheesecake.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nMix ground cookies, butter, and 1 tablespoon sugar together in a bowl until combined. Press into the bottom of a 9-inch springform pan. Top crust with 1/4 cup caramel chips and 2 tablespoons chopped peanuts.\nMix cream cheese and 1 1/2 cups sugar together until smooth. Blend in milk. Mix in eggs 1 at a time; stir until just incorporated. Mix in sour cream, vanilla extract, and 2 tablespoons flour, using a wooden spoon, until batter is smooth.\nChop 6 mini candy bars into small pieces; toss with 1 tablespoon flour in a bowl (to prevent sinking to bottom of cake). Stir into batter; pour into crust-lined pan.\nBake in the preheated oven for 1 hour. Keep door closed. Turn off heat; let cake cool in the oven for at least 3 hours. Remove from oven; chill 8 hours to overnight.\nRelease cake from pan; transfer to a serving plate. Decorate top edge of cake with whipped cream. Put remaining 1/4 cup caramel chips and 2 tablespoons chocolate chips in separate microwave-safe bowls; heat in the microwave until melted, about 1 minute. Drizzle melted caramel over cake; repeat with melted chocolate. Chop remaining candy bars and arrange on top of whipped cream. Sprinkle remaining 2 tablespoons peanuts on cake.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "12 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}