{
    "id": 259705,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 teaspoons olive oil, divided, or more as needed",
        "6 slices bacon, diced",
        "3 Granny Smith apples, diced",
        "1/2 cup brown sugar",
        "4 (6 ounce) boneless pork chops, 3/4-inch thick",
        "4 toothpicks, or as needed",
        "1/4 cup apple juice",
        "1/2 cup shredded Cheddar-Monterey Jack cheese blend"
    ],
    "nut": [
        "Calories > 461 kcal",
        "Carbs > 43.8 g",
        "Cholesterol > 82 mg",
        "Fat > 18.7 g",
        "Protein > 30 g",
        "Sodium > 443 mg"
    ],
    "n": "Beginner Stuffed Pork Chops",
    "a": "kgm1988",
    "r": "0",
    "s": 4,
    "des": "\"This is one of my favorite pork dishes; my dad taught me to make it for the first dinner I cooked when I was 11. I like to serve this with some kind of sweet potato or garlic mashed potatoes and a vegetable.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nHeat 1 teaspoon oil in a skillet over medium heat; add bacon and stir until starting to soften and still underdone, about 3 minutes. Mix apples and brown sugar together in a bowl. Add to skillet; cook and stir filling until glazed, about 2 minutes.\nHeat 1 teaspoon oil in a skillet over high heat; fry pork chops, about 45 seconds per side.\nTransfer each pork chop to a flat work surface; lay flat. Use the tip of a sharp boning or paring knife to create a pocket by making a slit in the side; repeat with remaining pork chops.\nStuff pork chops with filling and secure closed with toothpicks. Pour apple juice into a 9x13-inch baking pan; add pork chops. Sprinkle Cheddar and Monterey Jack cheese on top.\nBake in the preheated oven until pork chops are no longer pink in the center, about 45 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
    "pt": "20 m",
    "ct": "52 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}