{
    "id": 259709,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup olive oil, divided",
        "1 small onion, chopped",
        "1 tablespoon chopped garlic",
        "1 (4 ounce) package cream cheese",
        "1/4 cup ricotta cheese",
        "2 tablespoons pine nuts",
        "salt and ground black pepper to taste",
        "1 cup sliced baby bella mushrooms",
        "3 tablespoons cognac",
        "2 cups panko bread crumbs",
        "1/2 cup finely chopped almonds",
        "6 pork chops",
        "1 tablespoon dried parsley",
        "1/2 teaspoon garlic salt"
    ],
    "nut": [
        "Calories > 606 kcal",
        "Carbs > 30.1 g",
        "Cholesterol > 130 mg",
        "Fat > 32.1 g",
        "Protein > 50.2 g",
        "Sodium > 491 mg"
    ],
    "n": "Cream Cheese and Ricotta-Stuffed Pork Chops",
    "a": "Alisa Costa Kronshage",
    "r": "0",
    "s": 6,
    "des": "\"I created this recipe as a change in routine for my family. I had no leftovers when it was done. The flavor was amazing. Add other favorites to cheese mixture such as finely chopped peppers for variety. Serve over cooked asparagus and golden sliced fried potatoes. Drizzle a Hollandaise sauce over entire dish for a fantastic meal.\"",
    "ins": "Heat oil in an oven-safe skillet over medium heat. Add onion and garlic; cook and stir until softened and translucent, about 5 minutes.\nMix cream cheese, ricotta cheese, and pine nuts together in a bowl. Stir in sauteed onions and garlic; season with salt and pepper.\nHeat the remaining 2 tablespoons oil in the same skillet over medium-high heat. Add mushrooms; saute until softened, 4 to 5 minutes. Add cognac; cook until liquid is reduced and mushrooms are nicely glazed, about 5 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nCombine bread crumbs and almonds in a shallow dish.\nPound pork chops flat with a meat tenderizer until about 1 1/2 inch thick. Place a spoonful of cheese mixture onto the center of each pork chop; add a small spoonful of mushrooms. Roll pork chops to seal; place into almond-bread crumb mixture and coat completely.\nReduce skillet heat to medium. Add pork chops; season with salt, pepper, parsley, and garlic salt. Cook until lightly browned and crispy, 3 to 5 minutes per side. Move skillet to oven.\nBake in the preheated oven until no longer pink in the center, about 25 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
    "pt": "30 m",
    "ct": "44 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}