{
    "id": 25976,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup shortening",
        "1 1/2 cups cane syrup",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "2/3 cup milk",
        "2 cups all-purpose flour",
        "1/2 cup unsweetened cocoa",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 cup butter",
        "1/4 cup unsweetened cocoa",
        "3/8 cup milk",
        "4 cups confectioners' sugar",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 530 kcal",
        "Carbs > 91.2 g",
        "Cholesterol > 53 mg",
        "Fat > 18.4 g",
        "Protein > 5 g",
        "Sodium > 315 mg"
    ],
    "n": "Busy Day Syrup Cake",
    "a": "NELL 2",
    "r": "0",
    "s": 12,
    "des": "\"A good old recipe for a moist chocolate cake with Easy Chocolate Frosting. The recipe dates clear back to the early 20th Century!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 3 (8 inch) pans. Sift together the flour, 1/2 cup cocoa, baking soda and salt. Set aside.\nIn a large bowl, cream together the shortening and cane syrup until light and fluffy. Beat in the eggs one at a time, then stir in 1 teaspoon vanilla.  Beat in the flour mixture alternately with 2/3 cup milk, mixing just until incorporated. Pour batter into prepared pans.\nBake in the preheated oven for 25 to 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pans for 10 minutes, then turn out onto a wire rack and cool completely. Frost between layers, on top and sides with Easy Chocolate Frosting.\nTo make Easy Chocolate Frosting:  In a saucepan, combine 1/2 cup butter, 1/4 cup cocoa and 1/4 cup plus 2 tablespoons milk. Cook over low heat, stirring constantly, until mixture boils. Remove from heat. Gradually beat in confectioners' sugar and continue beating until spreading consistency is achieved. Beat in vanilla.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}