{
    "id": 259774,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup olive oil, divided",
        "2 pounds boneless skinless chicken breasts, cut into strips",
        "1 teaspoon garlic granules, or to taste",
        "1 teaspoon chili powder, or to taste",
        "1 pinch dried oregano, or to taste",
        "1 pinch ground cumin, or to taste",
        "1 (14.5 ounce) can diced tomatoes for chili",
        "1 large onion, cut in strips",
        "1 green bell pepper, cut into strips, or to taste",
        "1 red bell pepper, cut into strips, or to taste",
        "1/2 (4 ounce) can chopped green chiles",
        "1/2 teaspoon seasoned salt, or to taste"
    ],
    "nut": [
        "Calories > 430 kcal",
        "Carbs > 12.1 g",
        "Cholesterol > 129 mg",
        "Fat > 19.3 g",
        "Protein > 49.3 g",
        "Sodium > 562 mg"
    ],
    "n": "Quick and Easy Baked Chicken Fajitas",
    "a": "Nancy Ball",
    "r": "0",
    "s": 4,
    "des": "\"I've been making chicken fajitas on the stove with packaged taco seasoning for years but always had so much clean up afterwards. This was not only better tasting, but also easier to clean up and way more satisfying! Serve with warm tortillas, sour cream, and shredded cheese. Taco sauce optional.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nDrizzle 2 tablespoons olive oil over the bottom of a 10x14 glass dish. Add chicken strips.\nCombine remaining 2 tablespoons olive oil, garlic granules, chili powder, oregano, and cumin in a small bowl. Rub mixture over the chicken. Add tomatoes, onion, green bell pepper, red bell pepper, and green chiles. Mix thoroughly. Sprinkle with seasoned salt.\nBake in the preheated oven, uncovered, until chicken is no longer pink in the center and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}