{
    "id": 259796,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 strips bacon",
        "5 Yukon Gold potatoes, cut into eighths",
        "1/2 cup butter",
        "1 small sweet onion, diced",
        "2 cloves garlic, minced",
        "3 tablespoons flour",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1 pint half-and-half",
        "3 (15 ounce) cans chicken broth",
        "1 (8 ounce) container sour cream",
        "2 cups shredded Cheddar cheese",
        "1 teaspoon dried parsley"
    ],
    "nut": [
        "Calories > 658 kcal",
        "Carbs > 30.3 g",
        "Cholesterol > 147 mg",
        "Fat > 51.1 g",
        "Protein > 20.8 g",
        "Sodium > 2030 mg"
    ],
    "n": "Fully-Loaded Baked Potato Soup",
    "a": "Kristine Skaggs Frisone",
    "r": "0",
    "s": 6,
    "des": "\"The thickest and most delicious potato soup ever. I created this soup after having a similar soup at a restaurant.  Incredible comfort food with ease! It's a very simple recipe to adjust to your taste. My family always asks for this soup in the winter. Garnish with chives, bacon crumbles, and Cheddar cheese.\"",
    "ins": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until crisp, about 10 minutes. Remove from skillet and crumble. Reserve drippings.\nPlace potatoes in a pot; cover with water. Bring to a boil. Reduce heat to medium-low. Cook, covered, until tender, 15 to 20 minutes. Drain.\nMelt butter in a large skillet over medium-high heat. Add onion and garlic; saute until onion is translucent, about 5 minutes. Stir in bacon crumbles, reserved bacon drippings, flour, salt, and pepper. Reduce heat; add the boiled potatoes, half-and-half, and chicken broth. Simmer until thickened, about 5 minutes. Add sour cream and 1 cup Cheddar cheese; cook and stir until heated through, about 5 minutes. Garnish soup with remaining Cheddar cheese and parsley.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}