{
    "id": 259811,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil",
        "1/2 onion, chopped",
        "1 clove garlic, minced",
        "1 pound Hatch chile peppers, seeded",
        "1 quart chicken stock",
        "1/4 cup all-purpose flour",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 127 kcal",
        "Carbs > 20 g",
        "Cholesterol > < 1 mg",
        "Fat > 4.1 g",
        "Protein > 4.3 g",
        "Sodium > 729 mg"
    ],
    "n": "Hatch Green Chile Bowl of Green",
    "a": "TexasJG",
    "r": "0",
    "s": 4,
    "des": "\"This is what is known in New Mexico as a 'bowl of green.' The heat depends on how hot your chiles are, and fresh late-summer Hatch chiles are the best ingredients. It is easily made with or without meat, and the vegan version loses nothing in terms of flavor. Serve with tortillas. It also freezes and reheats well.\"",
    "ins": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil. Place Hatch chile peppers, cut sides-down, onto the prepared baking sheet.\nCook peppers under the preheated broiler until the skin has blackened and blistered, 6 to 8 minutes. Place blackened peppers into a bowl and tightly seal with plastic wrap. Allow peppers to steam as they cool, about 20 minutes. Discard skins and chop peppers.\nHeat oil in a soup pot over medium heat. Add onion and garlic; cook and stir until softened, about 5 minutes. Add chiles; cook and stir until fragrant, 3 to 5 minutes. Pour in chicken stock; mix briefly. Sift in flour, whisking well until no lumps remain. Bring mixture to a boil. Reduce heat to low and simmer soup until flavors combine, about 20 minutes.\nBlend soup in the pot using an immersion blender. Season with salt and pepper.",
    "pt": "20 m",
    "ct": "39 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}