{
    "id": 259973,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (14 ounce) can sweetened condensed milk",
        "1 (8 ounce) package cream cheese, at room temperature",
        "1 lemon, zested (optional)",
        "1/2 lemon, juiced",
        "1 teaspoon vanilla extract",
        "2 cups heavy whipping cream",
        "1 (21 ounce) can blueberry pie filling",
        "2 (12 count) packages (4-inch) molasses cookies",
        "12 waxed paper or parchment sandwich bags"
    ],
    "nut": [
        "Calories > 577 kcal",
        "Carbs > 73.9 g",
        "Cholesterol > 92 mg",
        "Fat > 28.5 g",
        "Protein > 7.3 g",
        "Sodium > 377 mg"
    ],
    "n": "Blueberry Cheesecake No-Churn Ice Cream Sandwiches",
    "a": "Matt Wencl",
    "r": "0",
    "s": 12,
    "des": "\"Imagine if a blueberry slushie swirled through a creamy cheesecake and landed in between two soft molasses cookies!\"",
    "ins": "Combine sweetened condensed milk and cream cheese in a bowl; beat with an electric mixer until smooth. Mix in lemon zest, lemon juice, and vanilla extract.\nBeat heavy cream in a large bowl with an electric mixer until stiff peaks form. Fold in cream cheese mixture gently, 1/3 at a time, using a rubber spatula.\nSpritz a metal loaf pan with water. Drape in a piece of parchment paper; press paper against the wet sides of the pan to adhere. Pour in 1/4 of the cheesecake ice cream mixture. Spread 1/3 of the blueberry pie filling on top. Repeat layers twice more, ending with a final layer of ice cream mixture. Cover with plastic wrap.\nFreeze ice cream mixture and molasses cookies until firm, 8 hours to overnight.\nPlace a small baking sheet in the freezer. Remove molasses cookies from their packages. Set out sandwich bags.\nRemove ice cream from the freezer. Place 1 cookie flat-side down on a plate. Fill a 2-inch ice cream scoop with ice cream; scrape against the pan's edge to flatten the top. Drop scoop onto the cookie and top with another cookie. Flatten gently with your palm, slip into a sandwich bag, fold the edge and crease to seal, and place on the baking sheet in the freezer. Repeat with remaining cookies and ice cream.\nFreeze ice cream sandwich cookies until firm, 5 hours to overnight.\nPeel the bag down as you eat, keeping the bag underneath to catch drips.",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}