{
    "id": 259926,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 butternut squash, halved and seeded",
        "3 onions, quartered and separated into pieces, or more to taste",
        "3 pears, peeled and halved, or more to taste",
        "4 Roma tomatoes, peeled and seeded",
        "1 large unpeeled carrot, cut into chunks",
        "3 tablespoons olive oil, or to taste",
        "ground black pepper, to taste",
        "1 pinch freshly ground nutmeg",
        "2 1/2 cups chicken stock, divided, or more to taste",
        "salt"
    ],
    "nut": [
        "Calories > 248 kcal",
        "Carbs > 46.7 g",
        "Cholesterol > < 1 mg",
        "Fat > 7.6 g",
        "Protein > 4 g",
        "Sodium > 334 mg"
    ],
    "n": "Easy Butternut Squash and Pear Soup",
    "a": "rxspo",
    "r": "0",
    "s": 6,
    "des": "\"This soup is great for a cold fall day. I don't often cook using recipes so all amounts are my best guess but feel free to experiment - this recipe is great no matter what I seem to do with it.  One helpful hint with the squash: It is really hard to peel so I do not peel it but instead roast it and then scoop the insides out into the soup. It's much easier that way! Serve topped with blue cheese crumbles and crusty bread on the side.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nPlace butternut squash, onions, pears, tomatoes, and carrot in a large roasting pan. Drizzle olive oil on top. Season with pepper and nutmeg.\nRoast in the preheated oven until squash is easily pierced with a knife, 1 to 2 hours. Cool until squash is easily handled, about 10 minutes.\nScoop flesh out of the squash with a spoon; place in a pot. Discard peel. Transfer roasted onions, pears, tomatoes, and carrot to the pot. Add 1 cup chicken stock. Puree mixture with an immersion blender until smooth.\nStir remaining 1 1/2 cups chicken stock into the pot. Heat soup until warmed through, about 10 minutes. Season with salt.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}