{
    "id": 259978,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Chicken:",
        "2 pounds chicken drumsticks",
        "1/2 large onion, diced",
        "1 (2 inch) piece fresh ginger root, peeled and thinly sliced",
        "2 cubes chicken bouillon, crushed",
        "2 cloves garlic, diced",
        "1 tablespoon curry powder, or more to taste",
        "1 teaspoon herbes de Provence",
        "freshly ground black pepper and red pepper to taste",
        "1 cup water",
        "Rice:",
        "3 tablespoons vegetable oil",
        "1/2 large onion, diced",
        "1 (14 ounce) can tomato sauce",
        "1 (14 ounce) can coconut milk",
        "1 teaspoon herbes de Provence",
        "1 teaspoon salt, or to taste",
        "1/2 teaspoon ground black pepper, or to taste",
        "3 cups parboiled rice (such as Uncle Ben'sÂ®)",
        "1 (16 ounce) package frozen mixed vegetables (carrots, corn, peas)",
        "Plantains:",
        "4 ripe plantains, peeled and cut diagonally into 1/2-inch slices",
        "1/2 cup canola oil for frying"
    ],
    "nut": [
        "Calories > 717 kcal",
        "Carbs > 99.2 g",
        "Cholesterol > 71 mg",
        "Fat > 22.9 g",
        "Protein > 32.4 g",
        "Sodium > 952 mg"
    ],
    "n": "Nigerian Jollof Rice with Chicken and Fried Plantains",
    "a": "Daisy",
    "r": "0",
    "s": 8,
    "des": "\"This traditional Nigerian dish brings out the best possible flavor of rice and chicken. Chicken is first sauteed on the stove top to produce a wonderful aromatic base for the rice. For an extra special and authentic touch, serve jollof rice with fried plantains.\"",
    "ins": "Place chicken drumsticks in a large Dutch oven over medium heat. Add 1/2 onion, ginger, crushed bouillon cubes, garlic, curry powder, 1 teaspoon herbes de Provence, black pepper, and red pepper. Mix well. Cook until chicken starts sticking to the bottom, about 5 minutes. Pour in water, mix, cover the pot, and bring to a gentle simmer; cook for 15 minutes. Remove from heat.\nTransfer chicken to a baking dish using a slotted spoon. Strain cooking liquid through a fine-mesh sieve. Reserve 1 1/2 cups liquid. Discard solids.\nPreheat oven to 400 degrees F (200 degrees C).\nBake chicken in the preheated oven until no longer pink in the middle and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the thickest part should read 165 degrees F (74 degrees C).\nHeat 3 tablespoons vegetable oil in a large pot over medium-low heat and cook 1/2 onion until soft and translucent but not browned, about 5 minutes. Add tomato sauce; cook and stir until slightly thickened and infused into the oil, 5 to 7 minutes.\nStir reserved chicken broth, coconut milk, 1 teaspoon herbes de Provence, salt, and pepper into the pot. Bring to a simmer; add rice. Cook, stirring often, until rice is almost tender, 15 to 20 minutes. Add frozen vegetables and continue cooking until rice is tender and creamy, about 5 minutes.\nHeat 1/2 cup of canola oil in a nonstick pan over medium heat. Add plantains and fry on both sides until golden and crispy, about 2 to 3 minutes per side. Drain on paper towels. Garnish jollof rice with friend plantains and serve with chicken.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}