{
    "id": 259910,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 pounds ripe pears - unpeeled, quartered, and cored",
        "1/2 cup water",
        "1 1/2 cups agave nectar",
        "1/3 cup fresh lemon juice",
        "1 tablespoon orange zest",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/8 teaspoon ground cloves",
        "1/8 teaspoon allspice"
    ],
    "nut": [
        "Calories > 64 kcal",
        "Carbs > 16.9 g",
        "Cholesterol > 0 mg",
        "Fat > 0.1 g",
        "Protein > 0.2 g",
        "Sodium > < 1 mg"
    ],
    "n": "Spiced Pear Butter",
    "a": "Shae's Mama",
    "r": "0",
    "s": 40,
    "des": "\"A delicious, naturally low-sugar treat! The orange and spices are wonderful... the trick is to not let them overpower the pears. The lemon adds a brightness to the flavor, while the vanilla is balancing. Spread over toast or with meats such as ham, pork chops, or chicken. Makes an excellent gift too. Place improperly sealed or open jars in refrigerator and use within the month.\"",
    "ins": "Place pears and 1/2 cup water in a large saucepan over medium heat. Cook until softened, about 20 minutes. Transfer pears to a blender or food processor; puree until smooth but not liquefied.\nReturn pear puree to the saucepan. Add agave nectar, lemon juice, orange zest, vanilla extract, cinnamon, nutmeg, cloves, and allspice. Reduce heat to medium-low. Simmer pear butter until thickened, stirring frequently, 70 to 90 minutes.\nWash and rinse six 1/2-pint jars, lids and rings; let jars and rings dry on a rack. Immerse lids in a dish of boiling water.\nFill a large canning pot with water. Bring to a boil; cover and keep simmering.\nFill the dry jars to 1/2 inch from the top with hot pear butter using a ladle and canning funnel. Wipe rims clean. Pick up lids using tongs; cap jars and screw on the rings. Use canning tongs to completely immerse jars into the pot of boiling water. Cover pot; boil jars for 10 minutes.\nRemove jars with your tongs. Let cool, about 24 hours. Check seals to make sure lids have sucked down; listen for a popping sound. Label jars and store.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 d ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}