{
    "id": 259976,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "cooking spray",
        "1 (20 ounce) package double-chocolate brownie mix (such as GhirardelliÂ®)",
        "1/3 cup vegetable oil",
        "1 egg",
        "1/4 cup water",
        "1 (1.5 quart) container chocolate ice cream, softened for 10 to 15 minutes",
        "1 (1.5 quart) container cherry chocolate ice cream, softened for 10 to 15 minutes",
        "12 waxed paper or parchment sandwich bags"
    ],
    "nut": [
        "Calories > 814 kcal",
        "Carbs > 98.9 g",
        "Cholesterol > 128 mg",
        "Fat > 43.5 g",
        "Protein > 11.4 g",
        "Sodium > 295 mg"
    ],
    "n": "Choco-Cherry Ice Cream Brownie'Wiches",
    "a": "Matt Wencl",
    "r": "0",
    "s": 12,
    "des": "\"Is there anything better together than cherry and chocolate? The assembly for these ice cream sandwiches is a bit challenging, but the flavor is totally worth it!\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C). Spritz a 11x17-inch baking pan with water; line with parchment paper. Grease parchment paper with cooking spray.\nStir brownie mix, vegetable oil, egg, and water together in a large bowl. Spread into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 25 minutes. Let cool completely, at least 10 minutes.\nMake a shallow cut down the middle of the brownies using a knife or bench scraper. Make shallow cuts in each half to divide brownies into 4x3-inch rectangles. Cover with plastic wrap and place in the freezer.\nLine two 9x13-inch rimmed baking sheets with aluminum foil and parchment paper.\nPlace chocolate ice cream in the bowl of a stand mixer fitted with the paddle attachment. Blend on low speed until uniformly softened, 10 to 15 seconds. Spread into one of the baking sheets.\nClean out stand mixer bowl and dry. Add cherry chocolate ice cream. Blend on low speed until uniformly softened, 10 to 15 seconds. Spread in the second baking sheet. Cover both baking sheets with plastic wrap and freeze until firm, 8 hours to overnight.\nSlide 1 half of the brownies onto another baking sheet. Return 1 half to the freezer. Remove chocolate cherry ice cream from the freezer. Lift parchment paper with a spatula; slip your hand underneath and flip ice cream over the brownies. Peel off the parchment. Freeze for 2 hours.\nRemove chocolate ice cream and ice cream-covered brownies from the freezer. Lift parchment paper with a spatula to slip your hand underneath. Flip chocolate ice cream over cherry chocolate ice cream layer and peel off the parchment. Top with the brownie half. Freeze until firm, 5 hours to overnight.\nRemove baking sheet from the freezer. Cut through shallow cuts with a sharp knife or bench scraper to make 6 ice cream sandwiches. Place 1 sandwich into each sandwich bag; fold the edge and crease to seal. Place ice cream sandwiches in the freezer. Return baking sheet to the freezer for 1 hour.\nRepeat to make 6 more ice cream sandwiches. Freeze for 1 hour.\nPeel down bag as you eat, keeping the bag underneath to catch drips.",
    "pt": "40 m",
    "ct": "25 m",
    "tt": "18 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}