{
    "id": 259974,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (19 ounce) package cake mix with candy bits (such as PillsburyÂ® FunfettiÂ®)",
        "2 eggs",
        "1/3 cup vegetable oil",
        "1 teaspoon vanilla extract",
        "1 tablespoon all-purpose flour, or as needed",
        "1 (1.5 quart) container strawberry ice cream, softened for 10 to 15 minutes",
        "1 cup colored miniature marshmallows (such as KraftÂ® FunMallows)",
        "1 (16 ounce) container vanilla frosting with candy bits (such as PillsburyÂ® FunfettiÂ®)",
        "1 cup multicolored candy sprinkles, or as needed",
        "12 waxed paper or parchment sandwich bags"
    ],
    "nut": [
        "Calories > 726 kcal",
        "Carbs > 109.5 g",
        "Cholesterol > 65 mg",
        "Fat > 30 g",
        "Protein > 7 g",
        "Sodium > 429 mg"
    ],
    "n": "Happy Birthday Cake Ice Cream Sandwiches",
    "a": "Matt Wencl",
    "r": "0",
    "s": 12,
    "des": "\"Colorful mini marshmallows stay soft and add fun color inside these tasty ice cream sandwiches, which are perfect for parties. Dip half of each sandwich in sprinkles to really add some fun to the party!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Line 2 baking sheets with parchment paper.\nStir cake mix, eggs, oil, and vanilla extract together in a bowl. Shape dough into 1-inch balls. Arrange 2 inches apart on the prepared baking sheets. Coat a glass lightly with flour; flatten each dough ball into a cookie.\nBake in the preheated oven until cookies are slightly golden at the edges, 6 to 8 minutes. Transfer to wire racks to cool completely.\nPlace ice cream in the bowl of a stand mixer fitted with the paddle attachment. Blend on low speed until uniformly softened, 10 to 15 seconds. Add marshmallows; blend until incorporated.\nLine a rimmed 9x13-inch baking sheet with aluminum foil. Spread ice cream on top. Freeze until firm, 5 hours to overnight.\nLine a baking sheet with parchment paper. Spread 1 to 2 teaspoons frosting on the bottom of each cookie. Place 12 cookies frosting side-up on the baking sheet.\nRemove ice cream from the freezer. Cut ice cream into rounds using a 2-inch cookie cutter. Place ice cream rounds onto the cookies using a spatula or by pressing them out of the cookie cutter with a spoon. Press another cookie on top, frosting-side down.\nPlace baking sheet in the freezer until ice cream cookie sandwiches are firm, 8 hours to overnight.\nPour sprinkles into a bowl. Roll each ice cream sandwich in sprinkles. Place 1 sandwich into each sandwich bag; fold the edge and crease to seal. Freeze for 1 to 2 hours.\nPeel down bag as you eat, keeping the bag underneath to catch drips.",
    "pt": "30 m",
    "ct": "6 m",
    "tt": "14 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}