{
    "id": 26038,
    "old_rating": "4.14286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups cake flour",
        "2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "3/4 cup unsalted butter, softened",
        "1 1/3 cups white sugar",
        "2 eggs",
        "3/4 cup creamy peanut butter",
        "1 tablespoon vanilla extract",
        "1 cup milk",
        "3/4 cup unsalted butter",
        "1 1/4 cups confectioners' sugar",
        "2 tablespoons milk",
        "1 teaspoon vanilla extract",
        "1/2 cup creamy peanut butter",
        "1 (12 ounce) jar hot fudge topping"
    ],
    "nut": [
        "Calories > 531 kcal",
        "Carbs > 57.7 g",
        "Cholesterol > 70 mg",
        "Fat > 30.8 g",
        "Protein > 8.6 g",
        "Sodium > 244 mg"
    ],
    "n": "Peanut Butter and Chocolate Cake I",
    "a": "D. Kelly",
    "r": "0",
    "s": 16,
    "des": "\"Two layers of peanut butter cake sandwiched with peanut butter filling and covered in chocolate fudge frosting.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 (9  inch) pans. Sift together the flour, baking powder and salt. Set aside.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time, then stir in the peanut butter and vanilla. Beat in the flour mixture alternately with the milk. Pour batter into prepared pans.\nBake in the preheated oven for 25 to 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pans for 10 minutes, then turn out onto a wire rack and cool completely.\nMake the Frosting and Filling:  In a large bowl, beat 3/4 cup butter until smooth. Slowly beat in confectioners' sugar until smooth. Blend in 2 tablespoons milk and vanilla.  Beat at high speed until light and fluffy.  For filling, combine 1/2 cup of butter mixture with 1/2 cup peanut butter. For frosting, beat 1/2 cup of the (cool) hot fudge into remaining butter mixture.\nTo assemble:  Place one cake layer on serving plate.  Spread top with peanut butter filling.  Place second layer on top and frost top and sides with fudge frosting. Warm the remaining fudge sauce and drizzle over cake when serving.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "4535067.jpg",
    "o": "",
    "st": "allrecipes"
}