{
    "id": 26067,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter",
        "2 cups light brown sugar",
        "3 cups fresh peaches, pitted and sliced",
        "2/3 cup margarine",
        "1 1/3 cups white sugar",
        "4 eggs",
        "2 teaspoons vanilla extract",
        "1 1/3 cups milk",
        "3 1/3 cups all-purpose flour",
        "4 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 teaspoon ground cinnamon"
    ],
    "nut": [
        "Calories > 418 kcal",
        "Carbs > 66.5 g",
        "Cholesterol > 63 mg",
        "Fat > 15.1 g",
        "Protein > 5.1 g",
        "Sodium > 326 mg"
    ],
    "n": "Upside-Down Coffee Cake",
    "a": "Colleen Royal",
    "r": "0",
    "s": 16,
    "des": "\"This is a gorgeous moist and gooey coffee cake! Use any type of fresh or frozen fruit, or combination of 2 fruits. Peach, cherry, blackberry and/or red raspberry are some of the best. The deep baking pan is required due to the bubbling caramel sauce and the height of the cake. Every time I serve it I get rave reviews!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Use a deep sided 10 inch pan, or wrap the outside of a 10 inch springform pan with aluminum foil to prevent leaking. Sift together the flour, baking powder, salt and cinnamon. Set aside.\nIn a saucepan over medium heat, combine brown sugar and 1/2 cup butter. Bring to a boil, then pour into bottom of springform pan. Sprinkle with sliced peaches.\nIn a large bowl, cream together 2/3 cup margarine and the white sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla. Beat in the flour mixture alternately with the milk. Pour batter over caramel and fruit in pan.\nBake in the preheated oven for 90 minutes, or until a toothpick inserted into the center of the cake comes out clean. Cool in pan for 10 minutes, then invert onto serving platter and carefully remove pan. Be extremely careful of hot caramel and fruit juices! Serve warm.",
    "pt": "45 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "2493569.jpg",
    "o": "3893878.jpg,2869166.jpg,1262824.jpg,1011605.jpg,888914.jpg,715997.jpg",
    "st": "allrecipes"
}