{
    "id": 26329,
    "old_rating": "4.36364",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Crust",
        "2 1/2 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1/4 cup butter",
        "1/2 cup white sugar",
        "3 eggs",
        "1/2 teaspoon vanilla extract",
        "Filling",
        "1 cup water",
        "1/2 cup uncooked white rice",
        "1 quart milk",
        "1 (15 ounce) container ricotta cheese",
        "1 1/2 cups white sugar",
        "1 tablespoon lemon juice",
        "1 tablespoon grated lemon zest",
        "6 eggs"
    ],
    "nut": [
        "Calories > 323 kcal",
        "Carbs > 49.3 g",
        "Cholesterol > 125 mg",
        "Fat > 9.2 g",
        "Protein > 11.1 g",
        "Sodium > 182 mg"
    ],
    "n": "Italian Rice Pie II",
    "a": "Michele O'Sullivan",
    "r": "0",
    "s": 16,
    "des": "\"This sweet rice pie is a dessert traditionally served on Easter by many Italian families. But  this version is so good, I make it more often than that.\"",
    "ins": "Stir the flour and baking powder together in a bowl; set aside. In a second large bowl, cream the butter and 1/2 cup sugar until light and fluffy. Beat in 3 eggs, one at a time, and stir in the vanilla. Gradually beat in the flour mixture to make a soft dough. Divide the dough in half and shape into two balls. Working on a lightly floured surface, roll out each ball to fit two 10 inch pie plates. Line the pie plates with the crust, and refrigerate until needed.\nBring the water to a boil in a saucepan, and stir in the rice. Reduce the heat to medium-low, cover, and cook for 20 minutes. Stir in the milk. Continue cooking, stirring frequently, until the mixture thickens. Set aside to cool.\nPreheat oven to 325 degrees F (165 degrees C).\nMeanwhile, beat the ricotta cheese, 1 1/2 cups sugar, lemon juice, lemon zest, and 6 eggs together in a mixing bowl until smooth and frothy. Stir in the cooled rice mixture until evenly blended. Pour into the pie shells.\nBake pies in preheated oven until the filling is set and tops are golden brown, about 90 minutes. Cool on racks.",
    "pt": "50 m",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "935100.jpg",
    "o": "",
    "st": "allrecipes"
}