{
    "id": 26602,
    "old_rating": "4.38554",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (1.5 ounce) package dry enchilada sauce mix",
        "1 (6 ounce) can tomato paste",
        "3/4 cup water",
        "1 1/2 pounds ground beef",
        "1 teaspoon garlic salt",
        "1/2 teaspoon onion powder",
        "1 (16 ounce) can refried beans",
        "1 (12 ounce) package corn tortillas",
        "1 cup shredded Cheddar cheese",
        "1 cup shredded Monterey Jack cheese"
    ],
    "nut": [
        "Calories > 449 kcal",
        "Carbs > 34.6 g",
        "Cholesterol > 87 mg",
        "Fat > 22 g",
        "Protein > 28.4 g",
        "Sodium > 1522 mg"
    ],
    "n": "Enchilada Casserole III",
    "a": "Kathy",
    "r": "0",
    "s": 8,
    "des": "\"This is a layered casserole that is always a favorite with my husband and kids. Served with Spanish rice and a green salad, it is sure to please everyone.\"",
    "ins": "Preheat oven to 375  degrees F (190 degrees C).\nIn a medium bowl, mix the dry enchilada sauce according to package directions, replacing tomato sauce with the tomato paste and water\nIn a large skillet, brown the ground beef with garlic salt and onion powder; drain fat. Mix refried beans and 1/2 cup of the prepared enchilada sauce with the meat.\nDip enough corn tortillas to cover the bottom of a 3 quart casserole dish in the remaining enchilada sauce. Arrange tortillas in the dish. Spoon in half of the meat mixture, covering the tortillas. Spread half of the Cheddar and Monterey Jack cheeses over the meat. Cover with another layer tortillas dipped in enchilada sauce. Spoon in remaining meat mixture and top with a final layer of tortillas dipped in enchilada sauce. Pour any remaining sauce over the layers and top with remaining cheese.\nCover and bake in preheated oven for 20 minutes. Remove from oven and let sit for 5 minutes before serving.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "72122.jpg",
    "o": "3719225.jpg,3182748.jpg,3034451.jpg,2903346.jpg,2553455.jpg,954506.jpg",
    "st": "allrecipes"
}