{
    "id": 26670,
    "old_rating": "4.55333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds ground beef",
        "1 onion, finely chopped",
        "1 teaspoon salt",
        "ground black pepper to taste",
        "dried dill weed to taste",
        "1 (.25 ounce) package active dry yeast",
        "1/4 cup warm water",
        "1 cup milk",
        "3 eggs",
        "1/2 cup vegetable oil",
        "2 tablespoons granulated sugar",
        "1 teaspoon salt",
        "4 cups all-purpose flour",
        "3 cups oil for frying"
    ],
    "nut": [
        "Calories > 447 kcal",
        "Carbs > 42.4 g",
        "Cholesterol > 67 mg",
        "Fat > 24.7 g",
        "Protein > 13.5 g",
        "Sodium > 478 mg"
    ],
    "n": "Taylor's Piroshki",
    "a": "TAYLORSMOMMY",
    "r": "0",
    "s": 11,
    "des": "\"These are as authentic Russian as you can get without traveling to Russia. I received the recipe from my Russian language teacher in high school and have been making them ever since. The kids like them too! They take a little time to roll out - but then doesn't anything 'authentic' take a little time?\"",
    "ins": "In a medium skillet over medium heat, cook the ground beef until evenly browned; drain. Stir in the onion and cook with the beef until translucent. Sprinkle in salt, pepper and dill weed to taste. Allow to cool before using.\nDissolve the yeast in the 1/4 cup of warm water and place in a warm location until frothy, about 10 to 15 minutes. In a medium saucepan over low heat, warm the milk and gently whisk in the eggs, oil, sugar and salt. Remove from heat.\nPlace half the flour in a large mixing bowl and gradually stir in the milk mixture. Then add the yeast solution alternately with the remaining flour, stirring after each addition. Mix well. Knead until the dough forms a ball and does not stick to the bowl. (Note: Start with the 4 cups of flour. You may need to add more, a little at a time, as you knead the dough). Cover the bowl with a clean cloth. Set in a warm location and allow to rise until doubled in volume.\nRemove dough from bowl and place on a lightly floured surface. Pinch off pieces approximately the size of golf balls. Roll the pieces into disks about 3 1/2 to 4 inches in diameter.\nFill center of each disk with a heaping tablespoon of the cooled meat mixture. Fold disks over the mixture and firmly pinch edges to seal. Arrange on a flat surface and allow to sit approximately 10 minutes.\nIn an large, heavy skillet or deep fryer, heat the oil to 375 degrees F (190 degrees C). Deep fry the piroshki in batches until golden brown on one side; gently turn and fry the other side. Remove and let drain on a plate lined with paper towels.",
    "pt": "1 h ",
    "ct": "20 m",
    "tt": "2 h",
    "i": "588050.jpg",
    "o": "4284730.jpg,3995231.jpg,3844818.jpg,3475774.jpg,3297511.jpg,2681614.jpg",
    "st": "allrecipes"
}