{
    "id": 26796,
    "old_rating": "4.65625",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 Fuji apple - peeled, cored and diced",
        "1 cup sliced fresh strawberries",
        "2 kiwis, peeled and sliced",
        "2 bananas, peeled and sliced",
        "1 tablespoon fresh lime juice",
        "2 tablespoons white sugar",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1 cup oil for frying",
        "6 (10 inch) flour tortillas",
        "3 tablespoons white sugar",
        "1 tablespoon ground cinnamon"
    ],
    "nut": [
        "Calories > 70 kcal",
        "Carbs > 12.5 g",
        "Cholesterol > 0 mg",
        "Fat > 1.8 g",
        "Protein > 1.3 g",
        "Sodium > 86 mg"
    ],
    "n": "Fruit Salsa with Cinnamon Tortilla Chips",
    "a": "CRISSYF",
    "r": "0",
    "s": 32,
    "des": "\"The fun of this recipe is that it can be tailored to your tastes. I'm a 'throw it in and see how it turns out' kind of cook, so please adjust the recipe to fit your own tastes. This recipe is best used immediately, as fresh fruit doesn't keep well in the refrigerator. If you prefer baked cinnamon chips, arrange the tortilla triangles in a single layer on a lightly greased baking sheet. Spray with cooking spray, sprinkle with sugar and cinnamon, and bake 5 to 10 minutes in an oven preheated to 350 degrees F (175 degrees C). Watch them closely so they don't burn!\"",
    "ins": "In a medium bowl, mix together Fuji apple, strawberries, kiwis, bananas, lime juice, white sugar, cinnamon and nutmeg. Cover and chill in the refrigerator approximately 20 minutes.\nHeat oil in a medium heavy saucepan to 375 degrees F (190 degrees C).\nSlice flour tortillas into triangles. Carefully place tortilla triangles into the hot oil and fry until golden brown, 2 to 4 minutes. Drain on paper towels.\nPlace white sugar and cinnamon in a large ziplock plastic bag. Drop fried tortilla triangles into the bag and shake to coat.\nServe the cinnamon chips warm with the chilled fruit salsa.",
    "pt": "30 m",
    "ct": "5 m",
    "tt": "1 h",
    "i": "335942.jpg",
    "o": "",
    "st": "allrecipes"
}