{
    "id": 27185,
    "old_rating": "4.22222",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "24 chocolate wafers",
        "1/4 cup unsalted butter, melted",
        "1 1/2 cups cranberries",
        "1/2 cup light corn syrup",
        "1/3 cup white sugar",
        "1/3 cup water",
        "3 cups vanilla ice cream, softened",
        "1/2 cup shelled pistachio nuts",
        "1 tablespoon unsalted butter",
        "1/4 teaspoon salt",
        "1 cup heavy cream",
        "3 tablespoons confectioners' sugar",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 399 kcal",
        "Carbs > 45.5 g",
        "Cholesterol > 66 mg",
        "Fat > 23.8 g",
        "Protein > 4.2 g",
        "Sodium > 220 mg"
    ],
    "n": "Cranberry Ice Cream Swirl Cake",
    "a": "AlwaysCookin",
    "r": "0",
    "s": 10,
    "des": "\"Outstanding 'non-heavy' dessert for when you want guests applauding! I have yet to make this recipe without rave reviews.  Flavors blend perfectly. It has become my signature recipe.  Not difficult to make, but allow enough time to make.  I make it the day before.  You may garnish with semi-sweet or bittersweet chocolate shavings or curls if you like.\"",
    "ins": "In a food processor or blender, process wafers until finely ground.  Stir ground wafers together with 1/4 cup melted butter and press into the bottom and partway up the sides of an 8-inch springform pan.  Freeze 30 minutes.\nMeanwhile, in a covered saucepan over medium heat, simmer cranberries, corn syrup, sugar and water for 10 minutes.  Transfer mixture to a blender or food processor and puree until smooth.  Place in a bowl and chill until cold.\nSpread half the softened ice cream over the frozen crust.  Drizzle all but 1/3 cup of the cold cranberry mixture over the ice cream.  Top with remaining ice cream.  Draw a knife through the layers to marble.  Freeze 30 minutes, or until firm.\nSpread remaining 1/3 cup cranberry mixture over top of frozen dessert and freeze 15 minutes more.\nMeanwhile, chop pistachios finely and place in a small skillet over medium heat with 1 tablespoon butter and salt.  Cook, stirring, 1 minute, until fragrant.  Set aside to cool.\nIn a chilled bowl, whip cream until soft peaks form.  Beat in confectioners' sugar and vanilla and whip until stiff peaks form.  Fold in cooled pistachios and spread cream over chilled cake.  Freeze 30 minutes, then cover tightly with plastic wrap and foil and freeze 4 hours.\nTo unmold, wrap a hot, dampened towel around the sides of the pan for 1 to 2 minutes.  Then remove the sides of the pan.",
    "pt": "45 m",
    "ct": "10 m",
    "tt": "6 h",
    "i": "2020117.jpg",
    "o": "",
    "st": "allrecipes"
}