{
    "id": 27204,
    "old_rating": "3.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups shredded potatoes, drained and pressed",
        "1 cup cold mashed potatoes",
        "1 egg, beaten",
        "1 teaspoon grated onion",
        "salt and ground black pepper to taste",
        "3/4 cup all-purpose flour",
        "2 teaspoons baking powder",
        "2 cups dry cottage cheese",
        "1 egg, beaten",
        "1 pinch salt"
    ],
    "nut": [
        "Calories > 310 kcal",
        "Carbs > 47.2 g",
        "Cholesterol > 103 mg",
        "Fat > 2.8 g",
        "Protein > 23.9 g",
        "Sodium > 395 mg"
    ],
    "n": "Ukrainian Filled Halushky Dumplings",
    "a": "Olga",
    "r": "0",
    "s": 4,
    "des": "\"Halushky is a Ukrainian name for dumplings made of batter or thick dough mixture. Various ingredients are added for tenderness, texture, flavor, and food value. They are served with a stew, or roast and gravy, or as a side dish. Good halushky should be light. Their lightness depends on the proportions used and on the method of cooking them. This standard recipe may be varied as desired. Dry curd cheese is preferred for a filling because a wet, creamy one will melt giving flat and empty varenyky or halushky.\"",
    "ins": "Fill a large pot with lightly salted water and bring to a boil.\nIn a medium bowl, stir together the shredded potatoes, mashed potatoes, egg and onion until well blended. Season with salt and pepper to taste. Combine the flour and baking powder; stir into the potato mixture. The mixture should be thick enough to form into balls.\nProcess the cottage cheese in a food processor or blender, or run through a sieve. Stir in the egg and salt. Flatten the balls of dough and place a teaspoon of filling into the center. Pinch the dough around the filling to seal it in.\nDrop the halushky into rapidly boiling salted water, stir gently once, and cook from 5 to 8 minutes. Remove them to a colander and drain. Place in a serving dish, sprinkle generously with browned butter, and toss lightly. Serve with sour cream.",
    "pt": "30 m",
    "ct": "2 h ",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}