{
    "id": 27781,
    "old_rating": "4.50685",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 boneless, skinless chicken breast halves",
        "salt and pepper to taste",
        "1 cup all-purpose flour",
        "3 tablespoons olive oil",
        "2 cups diced onion",
        "1 cup diced celery",
        "1 cup diced carrots",
        "2 tablespoons finely chopped garlic",
        "3 bay leaves",
        "1 teaspoon dried thyme",
        "1 cup dry white wine",
        "2 (32 fluid ounce) containers chicken broth"
    ],
    "nut": [
        "Calories > 314 kcal",
        "Carbs > 26.4 g",
        "Cholesterol > 53 mg",
        "Fat > 9 g",
        "Protein > 22.9 g",
        "Sodium > 1560 mg"
    ],
    "n": "Braised Chicken Breasts in Tasty Mirepoix Ragout",
    "a": "Gordon",
    "r": "0",
    "s": 6,
    "des": "\"A very flavorful, chicken dish that my friends rave about.  Serve over halved baked potatoes, using the sauce as a gravy for the potato and the chicken.  Can also be served over pasta noodles.\"",
    "ins": "Season chicken breasts with salt and pepper, then dredge in flour until completely coated. Heat 2 tablespoons oil in a Dutch oven and fry breasts until lightly browned, about 5 minutes on each side. Remove chicken from pan and set aside.\nAdd remaining tablespoon of oil to the pan and saute the onions for 2 minutes. Stir in the celery and carrots and cook for about one more minute. Season with garlic, bay leaves, thyme and salt and pepper to taste. Cook for another minute.\nDeglaze the pot with white wine, stirring until nothing is stuck to the pan, then pour in the chicken broth. Simmer for 90 minutes.\nReturn the chicken breasts to the pan and simmer for an additional 30 minutes. The mixture should reduce considerably by this time so check frequently to see that the chicken is covered. Spoon baste if necessary.  The ragout should have a stew like consistency when finished.",
    "pt": "25 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "872387.jpg",
    "o": "",
    "st": "allrecipes"
}