{
    "id": 27838,
    "old_rating": "4.524",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter, divided",
        "1/2 cup chopped onion",
        "8 large mushrooms, chopped",
        "1 clove garlic, minced",
        "2 tablespoons all-purpose flour",
        "1/2 cup chicken stock",
        "1 teaspoon celery salt",
        "1/2 teaspoon white pepper",
        "1/2 cup white wine",
        "1 1/2 cups shredded Monterey Jack cheese",
        "1 cup all-purpose flour",
        "salt and pepper to taste",
        "8 skinless, boneless chicken breast halves - pounded thin"
    ],
    "nut": [
        "Calories > 399 kcal",
        "Carbs > 16 g",
        "Cholesterol > 117 mg",
        "Fat > 21.1 g",
        "Protein > 32.6 g",
        "Sodium > 485 mg"
    ],
    "n": "Chicken Monterey",
    "a": "DOREENB",
    "r": "0",
    "s": 8,
    "des": "\"This is a delicious entree - easy to make and elegant enough for a dinner party!!!\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C). Lightly grease a medium baking dish.\nMelt 1/4 cup butter in a medium skillet over medium heat. Stir in onion, mushrooms and garlic. Cook until tender, about 10 minutes. Stir in 2 tablespoons flour, chicken stock, celery salt, white pepper and white wine. Reduce heat to low, and cook, stirring frequently, until thickened and well blended, about 10 minutes. Mix 1/2 cup Monterey Jack cheese into the thickened sauce mixture, and stir until melted.\nIn a shallow medium bowl, mix 1 cup flour with salt and pepper. Dredge chicken breast halves in the flour mixture to coat. Melt remaining 1/4 cup butter in a large skillet over medium high heat. Cook chicken until lightly browned on all sides. Arrange breast halves in the prepared baking dish, and cover with the sauce.\nTop chicken breast halves with remaining Monterey Jack cheese. Bake in the preheated oven 25 minutes, or until chicken is no longer pink and juices run clear.",
    "pt": "30 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "18391.jpg",
    "o": "",
    "st": "allrecipes"
}