{
    "id": 28078,
    "old_rating": "4.48636",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup all-purpose flour",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper",
        "1 teaspoon chopped fresh parsley",
        "1/2 teaspoon dried dill weed",
        "1/4 cup butter, divided",
        "4 boneless, skinless chicken breast halves",
        "1 pound fresh mushrooms",
        "1 onion, sliced into rings",
        "1/2 cup white wine",
        "8 ounces Gruyere cheese, shredded"
    ],
    "nut": [
        "Calories > 557 kcal",
        "Carbs > 13.5 g",
        "Cholesterol > 160 mg",
        "Fat > 33.2 g",
        "Protein > 46.2 g",
        "Sodium > 630 mg"
    ],
    "n": "Chicken Gruyere with Sauteed Mushrooms",
    "a": "Rebecca",
    "r": "0",
    "s": 4,
    "des": "\"Chicken breasts are browned in butter, then baked with mushrooms, onion, and white wine. The finishing touch is an exquisite layer of melted Gruyere cheese on the top. If you enjoy rich French cooking then you will love this recipe. Serve hot over rice.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). In a shallow dish, stir together the flour, salt, pepper, parsley, and dill. Rinse chicken breasts, and pat dry. Dredge chicken in the flour mixture.\nIn a large skillet, heat 2 tablespoons of the butter over medium-high heat. Place chicken into the hot buttered skillet, and fry until brown on both sides. Transfer chicken breasts to a 1 quart glass baking dish. Add remaining butter to skillet, and fry the mushrooms and onion until wilted and lightly browned. Stir in the white wine, and reduce heat to medium. Simmer for 3 minutes to blend flavors. Pour the mushroom mixture over the chicken in the dish.\nCover dish, and bake for 20 minutes in the preheated oven. After 20 minutes, remove cover, and sprinkle with shredded cheese. Continue baking for 10 more minutes, or until cheese is lightly browned and bubbly.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "331915.jpg",
    "o": "3604931.jpg,3290897.jpg,3117813.jpg,1897917.jpg,1897915.jpg,1210812.jpg",
    "st": "allrecipes"
}