{
    "id": 29100,
    "old_rating": "3.52941",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package elbow macaroni",
        "1 cup andouille sausage, diced",
        "4 tablespoons butter",
        "3/4 cup bread crumbs",
        "1/2 cup grated Parmesan cheese",
        "1 onion, chopped",
        "2 stalks celery, chopped",
        "1 tablespoon all-purpose flour",
        "1/2 teaspoon paprika",
        "1/2 teaspoon prepared mustard",
        "1 1/2 cups milk",
        "1 cup grated Gruyere cheese",
        "1 1/2 cups shredded Cheddar cheese",
        "kosher salt to taste",
        "black pepper to taste"
    ],
    "nut": [
        "Calories > 481 kcal",
        "Carbs > 33.9 g",
        "Cholesterol > 77 mg",
        "Fat > 28.5 g",
        "Protein > 21.5 g",
        "Sodium > 653 mg"
    ],
    "n": "Creole Macaroni and Cheese",
    "a": "F. Craig Littlejohn",
    "r": "0",
    "s": 8,
    "des": "\"Use the best aged cheeses you can find. Any andouille sausage will work, but do not substitute.  Just leave it out if you can't find any.\"",
    "ins": "Cook macaroni in a large pot of boiling water until al dente. Drain.\nIn a small pan, cook the andouille sausage over medium heat until done. Set aside. In the same pan, melt 1 tablespoon butter over medium heat.  Add bread crumbs, and stir to coat. Cool, and then mix in Parmesan. Set aside.\nIn a medium saucepan, melt 1 tablespoon butter. Saute onions and celery until translucent. Transfer to a bowl.\nIn the same saucepan, melt 1 tablespoon butter over medium heat. Whisk in the flour, to make a white roux. Try not to let the roux brown at all, it should be white. Mix in paprika and mustard, then stir in milk. Bring to boil over medium heat, then add Gruyere and Cheddar cheeses. Simmer, stirring often, until thick enough to coat the back of a spoon, about 10 minutes. Season with salt and pepper to taste.\nPreheat the oven to 350 degrees F (175 degrees C). Butter a 9x13 in pan, or similar sized casserole dish. Transfer cooked macaroni to the dish, and toss in the andouille sausage.  Stir in the cheese mixture. Sprinkle the breadcrumb and Parmesan mixture evenly over the top.\nBake for 20 minutes, or until crust turns golden brown.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "1918137.jpg",
    "o": "",
    "st": "allrecipes"
}