{
    "id": 29112,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 large red bell peppers",
        "2 tablespoons minced garlic",
        "1/4 cup fresh basil",
        "3 tablespoons extra virgin olive oil",
        "2 cups half-and-half",
        "1/4 cup grated Romano cheese",
        "4 tablespoons butter",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 206 kcal",
        "Carbs > 5.9 g",
        "Cholesterol > 42 mg",
        "Fat > 18.9 g",
        "Protein > 3.6 g",
        "Sodium > 258 mg"
    ],
    "n": "Roasted Red Pepper Cream Sauce",
    "a": "BOB BAILEY",
    "r": "0",
    "s": 8,
    "des": "\"A light and creamy sauce with puree of roasted red peppers as the base. It is excellent on any type of pasta, but tortellini or ravioli seems to be the best match. The prep time is rather long, but the result is definitely worth it.  Freezes well. In fact, the taste may improve slightly.\"",
    "ins": "Preheat broiler. Lightly coat the red peppers with olive oil. Grill peppers under the broiler until the skin is blackened, and the flesh has softened slightly. Place peppers in a paper bag or resealable plastic bag to cool for approximately 45 minutes.\nRemove the seeds and skin from the peppers (the skin should come off the peppers easily now). Cut peppers into small pieces.\nIn a skillet, cook and stir the garlic, basil, and red peppers in 3 tablespoons olive oil over medium heat. Cook for 10 minutes, so that the flavors mix.\nPlace mixture in blender (careful it is hot), and puree to desired consistency. Return puree to skillet, and reheat to a boil. Stir in the half-and-half and the Romano cheese; cook and stir until the cheese melts.  Add the butter, and stir until melted. Season with salt and pepper to taste. Simmer for 5 minutes.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "17329.jpg",
    "o": "2534027.jpg,1272498.jpg,1110050.jpg,862315.jpg,645479.jpg,386649.jpg",
    "st": "allrecipes"
}