{
    "id": 30485,
    "old_rating": "4.46154",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 boneless, skinless chicken breast halves",
        "2 tablespoons lemon juice",
        "2 tablespoons olive oil",
        "2 teaspoons lemon pepper",
        "2 Vidalia onions, thickly sliced",
        "4 large mushroom caps, chopped",
        "1 cup mayonnaise",
        "hot sauce to taste",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 426 kcal",
        "Carbs > 9.3 g",
        "Cholesterol > 59 mg",
        "Fat > 35.6 g",
        "Protein > 18 g",
        "Sodium > 405 mg"
    ],
    "n": "Accidental Grilled Chicken Salad",
    "a": "Karen",
    "r": "0",
    "s": 6,
    "des": "\"Was expecting a few hungry friends to walk in as I started cooking, but they called and had an emergency.  Fortunately nothing bad, but there I was with too much food. Chopped everything up, added mayo, and a generous slurp of hot sauce (the way I like it). Not your run-of-the-mill chicken salad. Good way to finish up those leftovers! I put the onion slices and mushrooms in a grill basket so they could be turned without falling apart as they cooked. Hope you like it!\"",
    "ins": "Place chicken breast halves in a large resealable plastic bag with lemon juice, olive oil, and lemon pepper. Shake to coat, and marinate in the refrigerator for at least 1 hour.\nPreheat a grill for high heat.\nLightly oil the grill grate. Place the Vidalia onions and mushrooms on the grill, and cook until lightly charred on both sides; set aside. Place chicken onto the grill, and discard marinade. Cook for 15 minutes, turning once, or until juices run clear. Remove from heat, cool, and chop.\nIn a large bowl, thoroughly mix the onions, mushrooms, chicken, and mayonnaise. Season with hot sauce, salt, and pepper. Cover, and refrigerate until serving.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "2 h",
    "i": "293813.jpg",
    "o": "",
    "st": "allrecipes"
}