{
    "id": 31045,
    "old_rating": "4.32192",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 fresh poblano chile peppers",
        "1/2 pound lean ground beef",
        "1 onion, chopped",
        "1 clove garlic, chopped",
        "salt and pepper to taste",
        "3 eggs, separated",
        "1 cup shredded mozzarella cheese",
        "2 roma (plum) tomatoes, chopped",
        "1/2 cup all-purpose flour",
        "1 cup corn oil"
    ],
    "nut": [
        "Calories > 808 kcal",
        "Carbs > 19.7 g",
        "Cholesterol > 195 mg",
        "Fat > 70.6 g",
        "Protein > 25.4 g",
        "Sodium > 270 mg"
    ],
    "n": "Chiles Rellenos (Stuffed Peppers)",
    "a": "ADRIANSALAS",
    "r": "0",
    "s": 4,
    "des": "\"This is a great traditional Mexican dish. It takes a little bit of time, but it is worth every minute! Provecho! Serve with a side of Spanish Rice.\"",
    "ins": "Place whole peppers over an open flame (gas burner) or under the broiler. Roast, turning frequently until evenly black and blistered. Remove from heat, place in a plastic bag, and let them sweat for a while. This will allow the skins to peel of easily.\nWhile the peppers are sweating, place the ground beef in a skillet over medium-high heat. Cook, stirring to crumble, until evenly browned. When beef is fully cooked, add the onion, garlic and tomato, and cook for a few more minutes. Season to taste with salt and pepper.\nRemove the peppers from the bag, and peel off the burnt skin. You may wish to wear protective gloves. Run peppers under cool running water to rinse away any burnt pieces. Make a small vertical slit in the side of the peppers, and remove the seeds and veins. Stuff each pepper halfway with the ground beef mixture, then fill the rest of the way with shredded cheese. Close the slits, and secure with toothpicks.\nWhip egg whites in a large glass or metal bowl until thick and fluffy. Add the egg yolks, and whip for a minute to blend in.\nMeanwhile, heat 1/4 inch of oil in a large heavy skillet over medium-high heat. Coat the stuffed peppers with a light dusting of flour, then dip them in the egg  so they are fully covered. Carefully place in the hot oil, and fry on both sides until golden. Drain on paper towels, then serve on a large platter.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "356856.jpg",
    "o": "3896782.jpg,3641254.jpg,2305349.jpg,2172626.jpg,1329220.jpg,1272419.jpg",
    "st": "allrecipes"
}