{
    "id": 31272,
    "old_rating": "3.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 gallon green tomatoes, thinly sliced",
        "6 large onions, thinly sliced",
        "1/2 cup salt",
        "1 tablespoon whole black peppercorns",
        "1 tablespoon whole cloves",
        "1 tablespoon whole allspice berries",
        "1 tablespoon celery seeds",
        "1 tablespoon mustard seed",
        "1 tablespoon ground mustard",
        "3 cups distilled white vinegar",
        "3 cups brown sugar",
        "1/2 lemon, sliced",
        "2 red bell peppers, minced",
        "1 red bell pepper, thinly sliced"
    ],
    "nut": [
        "Calories > 117 kcal",
        "Carbs > 28.1 g",
        "Cholesterol > 0 mg",
        "Fat > 0.5 g",
        "Protein > 1.6 g",
        "Sodium > 1762 mg"
    ],
    "n": "Green Tomato Pickles",
    "a": "QUICKIEP",
    "r": "0",
    "s": 32,
    "des": "\"Great use for green tomatoes! Do not use cold-damaged or bruised tomatoes in this recipe.\"",
    "ins": "In a large ceramic bowl or crock, combine green tomatoes and onions. Sprinkle with salt. Refrigerate overnight.\nPour cold water over tomatoes and onions, and let stand for 1 hour. Place peppercorns, cloves, allspice berries, mustard seeds, and ground mustard in a small cheesecloth bag.\nDrain tomatoes and onions.\nIn a large pot, stir together vinegar and sugar, and then add the tomatoes and onions, the cheesecloth bag with spices, the sliced lemon, and minced red pepper. Bring to a low boil, and then simmer over low heat for 30 minutes. Check frequently; you may need to pull the pot off of the heat occasionally to prevent scorching. Discard spice bag.\nFill sterilized jars with tomato mixture, leaving 1/2 inch headspace. Garnish with thin strips of red pepper arrange vertically along the sides of the jars. Screw on lids, and process in a boiling water bath for 15 minutes. Remove jars and let jars cool completely. Refrigerate any that haven't sealed completely. Store sealed jars in a cool dark place.",
    "pt": "2 h",
    "ct": "30 m",
    "tt": "11 h ",
    "i": "53023.jpg",
    "o": "",
    "st": "allrecipes"
}