{
    "id": 31972,
    "old_rating": "4.48235",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (4 pound) whole duck, dressed",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground white pepper",
        "1/8 teaspoon ground cloves",
        "3 tablespoons soy sauce",
        "1 tablespoon honey",
        "1 orange, sliced in rounds",
        "1 tablespoon chopped fresh parsley, for garnish",
        "5 green onions",
        "1/2 cup plum jam",
        "1 1/2 teaspoons sugar",
        "1 1/2 teaspoons distilled white vinegar",
        "1/4 cup finely chopped chutney"
    ],
    "nut": [
        "Calories > 556 kcal",
        "Carbs > 48.1 g",
        "Cholesterol > 91 mg",
        "Fat > 31 g",
        "Protein > 22.4 g",
        "Sodium > 748 mg"
    ],
    "n": "Peking Duck",
    "a": "Allison",
    "r": "0",
    "s": 4,
    "des": "\"I have made this recipe and it is delicious. It can be served with plum sauce as well as a fruit sauce. This is actually a short-cut version but it is fantastic.\"",
    "ins": "Rinse the duck inside and out, and pat dry. Cut off tail and discard. In a small bowl, mix together the cinnamon, ginger, nutmeg, white pepper and cloves. Sprinkle one teaspoon of the mixture into the cavity of the duck. Stir one tablespoon of the soy sauce into the remaining spice mixture and rub evenly over the entire outside of the bird. Cut one of the green onions in half and tuck inside the cavity. Cover and refrigerate the bird for at least 2 hours, or overnight.\nPlace duck breast side up on a rack in a big enough wok or pot and steam for an hour adding a little more water, if necessary, as it evaporates. Lift duck with two large spoons, and drain juices and green onion.\nPreheat the oven to 375 degrees F (190 degrees C). Place duck breast side up in a roasting pan and prick skin all over using a fork.\nRoast for 30 minutes in the preheated oven. While the duck is roasting, mix together the remaining 2 tablespoons of soy sauce and honey. After 30 minutes, brush the honey mixture onto the duck and return it to the oven. Turn the heat up to 500 degrees F (260 degrees C). Roast for 5 minutes, or until the skin is richly browned. Do not allow the skin to char.\nPrepare the duck sauce by mixing the plum jam with the sugar, vinegar and chutney in a small serving bowl. Chop remaining green onions and place them into a separate bowl. Place whole duck onto a serving platter and garnish with orange slices and fresh parsley. Use plum sauce and onions for dipping.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "3 h ",
    "i": "662217.jpg",
    "o": "4267973.jpg,4165368.jpg,3634049.jpg,3258047.jpg,2880697.jpg,2616057.jpg",
    "st": "allrecipes"
}