{
    "id": 32069,
    "old_rating": "2.88889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil, divided",
        "3 tablespoons minced garlic",
        "1 cup red wine vinegar",
        "4 goose breasts",
        "1 1/4 cups milk",
        "1/2 cup chopped onion",
        "1/4 cup chopped carrot",
        "1 cup sliced fresh mushrooms",
        "salt and pepper to taste",
        "1/4 cup all-purpose flour",
        "1 tablespoon dried rosemary",
        "2 cups uncooked white rice"
    ],
    "nut": [
        "Calories > 1347 kcal",
        "Carbs > 93.5 g",
        "Cholesterol > 246 mg",
        "Fat > 75.4 g",
        "Protein > 68.3 g",
        "Sodium > 263 mg"
    ],
    "n": "Rosemary Mushroom Goose Breast",
    "a": "SHIVERDEN",
    "r": "0",
    "s": 4,
    "des": "\"Serve over cooked rice.  Red potatoes are a good side dish.  You need to marinate the breasts for about 4 to 6 hours in the refrigerator first.\"",
    "ins": "Heat 1 tablespoon of olive oil in a medium saucepan over medium heat. Add garlic and saute for 5 minutes. Remove from heat and stir the garlic mixture into the red wine vinegar. Place the goose breasts into a shallow glass dish and cover with the vinegar mixture. Cover and refrigerate for at least 4 hours.\nIn a medium saucepan over medium heat, combine the milk, onion and carrot. Gradually bring to a boil, stirring frequently. Season with pepper to taste. As soon as the mixture comes to a boil, remove from heat, cover and set aside.\nPreheat oven to 350 degrees F (175 degrees C). Place goose breasts  and marinade into a  baking dish and cover with foil.\nRoast for 25 to 30 minutes in the preheated oven. Cook white rice according to package directions. Heat two tablespoons of oil in a small saucepan over medium-low heat. Add mushrooms and saute for 5 minutes. Whisk in the flour, stirring for 2 minutes, then gradually whisk in the milk mixture. Season with rosemary, salt and pepper. Bring to a boil, stirring constantly, then reduce heat to low and simmer for 3 minutes.\nMake a bed of cooked white rice on a serving platter. Lay the goose breasts on top and pour the sauce over all.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "4 h ",
    "i": "260098.jpg",
    "o": "",
    "st": "allrecipes"
}