{
    "id": 33620,
    "old_rating": "4.59804",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup warm milk",
        "1 egg, lightly beaten",
        "1 egg yolk, beaten",
        "3 cups bread flour",
        "1/2 tablespoon salt",
        "3 tablespoons butter",
        "1/4 cup white sugar",
        "3 teaspoons bread machine yeast",
        "Filling:",
        "18 2 inch sausages, cut in 1/2",
        "1 (16 ounce) package frozen hash brown potatoes",
        "8 slices Cheddar cheese, quartered"
    ],
    "nut": [
        "Calories > 259 kcal",
        "Carbs > 25.2 g",
        "Cholesterol > 52 mg",
        "Fat > 13.9 g",
        "Protein > 11.1 g",
        "Sodium > 544 mg"
    ],
    "n": "Breakfast Kolaches",
    "a": "Melissa Vannoy",
    "r": "0",
    "s": 18,
    "des": "\"This is a recipe that my family has created for a portable breakfast. It uses a bread machine for the dough preparation. The filling can be with a variety of things. We like the sausage, cheese, and hash browns for a breakfast meal. I prepare the recipe by filling the kolaches the night before, and keeping them in the refrigerator overnight. In the morning, I set out the kolaches to warm to room temperature while the oven is preheating, and then cook them for a quick, hot breakfast.\"",
    "ins": "In the order suggested by the manufacturer, place milk, egg, egg yolk, bread flour, salt, butter, sugar and bread machine yeast in bread machine. Select Dough cycle, and press Start.\nPreheat oven to 375  degrees F (190 degrees C). Lightly grease a large baking sheet.\nOn a lightly floured surface, punch down dough, and divide into 36 pieces. Roll pieces into balls. Arrange balls in a single layer on the prepared baking sheet, about 2 inches apart. Allow balls to rise 15 to 20 minutes.\nFlatten balls, and make a depression in the center of each. Fill each with 1 piece of sausage, about 1 tablespoon hash browns, and 1 quarter slice of cheese.\nBake 15 to 18 minutes in the preheated oven, or until lightly browned.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "4 h ",
    "i": "1005276.jpg",
    "o": "3412070.jpg,1643730.jpg,1614082.jpg,1110178.jpg,1110177.jpg,1003854.jpg",
    "st": "allrecipes"
}