{
    "id": 34029,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon melted butter",
        "1 1/4 cups tea biscuits, crushed",
        "4 tablespoons butter, melted",
        "4 ounces white chocolate, chopped",
        "1/2 cup half-and-half or light cream",
        "1 (8 ounce) package cream cheese, softened",
        "1 (8 ounce) container mascarpone cheese",
        "1/4 cup superfine sugar",
        "3 egg yolks",
        "1/2 cup passion fruit pulp",
        "3 egg whites",
        "1/4 cup confectioners' sugar for dusting",
        "6 passion fruit, pulp removed"
    ],
    "nut": [
        "Calories > 474 kcal",
        "Carbs > 32.8 g",
        "Cholesterol > 151 mg",
        "Fat > 35.5 g",
        "Protein > 8.3 g",
        "Sodium > 223 mg"
    ],
    "n": "White Chocolate and Passion Fruit Cheesecake",
    "a": "SoOtY",
    "r": "0",
    "s": 9,
    "des": "\"TRUST ME ON THIS -- Anyone who likes white chocolate will LOVE this cheesecake! great for dinner guests and parties. This cheesecake will keep (removed from the pan, in an airtight container) for up to 3 days. Takes a while to make but every bit of it is worth it in the end!\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C). Grease an 8 inch springform pan with 1 tablespoon melted butter.\nIn a medium bowl, mix together biscuit crumbs and 4 tablespoons melted butter. Press into the bottom of springform pan, and smooth with the back of a spoon; set aside in the refrigerator to firm up.\nPlace the chocolate in a heatproof bowl. Heat half-and-half to a simmer in a small saucepan; pour over white chocolate. Set aside for 1 minute, then stir until smooth; set aside.\nIn a large bowl, beat cream cheese until smooth. Mix in mascarpone cheese, sugar, and egg yolks. Stir in white chocolate mixture and 1/2 cup passion fruit pulp. In a large glass or metal mixing bowl, beat egg whites until soft peaks form. Fold 1/3 of the whites into the batter very thoroughly, then quickly fold in remaining whites until no streaks remain. Pour batter into prepared pan. Place the cake pan on a baking sheet\nBake for 1 1/4 hours in the preheated oven, or until just set in the center when shaken lightly. Turn off the oven, and leave the cheesecake in the oven with the door ajar for 2 to 3 hours, or until cool. Refrigerate for at least 2 hours.\nBefore serving, remove from pan, and let stand at room temperature for 30 minutes. Dust with confectioners' sugar, and serve with pulp from 6 passion fruit.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "245339.jpg",
    "o": "",
    "st": "allrecipes"
}