{
    "id": 34099,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon ground ginger",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon ground anise seed",
        "1 dash cayenne pepper",
        "4 skinless, boneless chicken breast halves",
        "2 cups water",
        "1 cup basmati rice",
        "1 mango - peeled, seeded and diced",
        "1/2 cup orange juice",
        "2 tablespoons fresh lime juice",
        "2 tablespoons honey",
        "2 teaspoons cornstarch",
        "1 1/2 tablespoons water",
        "2 tablespoons dark rum"
    ],
    "nut": [
        "Calories > 418 kcal",
        "Carbs > 62.4 g",
        "Cholesterol > 67 mg",
        "Fat > 3.5 g",
        "Protein > 28.9 g",
        "Sodium > 66 mg"
    ],
    "n": "Grilled Spiced Chicken with Caribbean Citrus-Mango Sauce",
    "a": "LINDA W.",
    "r": "0",
    "s": 4,
    "des": "\"A taste of the islands! The spices and sweet-tart sauce are a wonderful combination, and just the way to start the summer grilling season. Great with freshly steamed green beans.\"",
    "ins": "In a medium bowl, mix the ginger, cinnamon, cumin, anise, and cayenne pepper. Rub the chicken with the spice mixture, and place in the bowl. Cover, and refrigerate 20 to 30 minutes.\nCombine 2 cups of water and basmati rice in a saucepan, and bring to a boil. Reduce heat, cover and simmer for 20 minutes, or until tender.\nIn a small saucepan, mix the mango, orange juice, lime juice, and honey. Bring to a boil, reduce heat, and simmer for 5 minutes, stirring occasionally. In a small cup, mix cornstarch with 1 1/2 tablespoons of water until cornstarch is dissolved. Stir into mango mixture, and simmer one minute, or until sauce has thickened slightly. Stir in dark rum.\nPreheat an outdoor grill for medium heat. When grill is hot, brush the grate with oil.\nGrill chicken 6 to 8 minutes per side, until no longer pink and juices run clear. Serve over the cooked rice, and top with the mango sauce.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "39363.jpg",
    "o": "",
    "st": "allrecipes"
}