{
    "id": 34368,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground lamb",
        "5 green chile peppers, diced",
        "3 onions, peeled and chopped",
        "1 tablespoon dark soy sauce",
        "1 tablespoon Worcestershire sauce",
        "2 tablespoons ginger paste",
        "2 tablespoons garlic paste",
        "1/2 teaspoon ground white pepper",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground cardamom",
        "1/2 teaspoon ground cloves",
        "2 tablespoons chopped fresh cilantro",
        "1 (17.5 ounce) package frozen puff pastry sheets, thawed",
        "1 egg, beaten"
    ],
    "nut": [
        "Calories > 222 kcal",
        "Carbs > 15.7 g",
        "Cholesterol > 27 mg",
        "Fat > 14.1 g",
        "Protein > 7.2 g",
        "Sodium > 247 mg"
    ],
    "n": "Lamb Patties",
    "a": "Madhu",
    "r": "0",
    "s": 18,
    "des": "\"Minced Lamb stuffed into puff pastry, as hot or mild as you like it. Makes a very filling munchy.\"",
    "ins": "In a large pot, combine the ground lamb, onion, chilies, soy sauce and Worcestershire sauce. Season with ginger and garlic pastes, white pepper, cinnamon, cardamom and cloves. Cook, stirring occasionally, over medium heat until the meat is evenly browned and the onions are tender, about 15 minutes. Mix in cilantro, cover and set aside.\nPreheat the oven to 375 degrees F (190 degrees C). Lay sheets of puff pastry out on a lightly floured surface. Cut each one into 9 squares and roll out to 1/4 inch thickness. Spoon about 1 1/2 tablespoons of the meat mixture into the center of each square. Brush the edge with water, fold corner over to form a triangle, and press to seal. Do not overstuff the triangles, or they will burst in the oven. Place the patties onto a foil lined baking sheet leaving at least an inch between each one. Brush the tops lightly with beaten egg.\nBake for 12 to 15 minutes in the preheated oven, or until golden brown all over. Serve hot for best flavor.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "4533605.jpg",
    "o": "",
    "st": "allrecipes"
}