{
    "id": 34579,
    "old_rating": "4.18182",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "14 medium red potatoes",
        "1/4 cup olive oil",
        "2 cloves garlic, crushed",
        "2 tablespoons Dijon mustard",
        "2 cups shredded red cabbage",
        "1 (11 ounce) can whole kernel corn, drained",
        "1 large red onion, diced",
        "1 red bell pepper, diced",
        "1 green bell pepper, diced",
        "1 yellow bell pepper, diced",
        "1 cucumber, diced",
        "1 (15.5 ounce) can white kidney or cannelini beans, rinsed and drained (optional)",
        "1/2 cup grated Romano cheese",
        "salt and ground black pepper to taste"
    ],
    "nut": [
        "Calories > 508 kcal",
        "Carbs > 94.4 g",
        "Cholesterol > 8 mg",
        "Fat > 9.8 g",
        "Protein > 14.8 g",
        "Sodium > 323 mg"
    ],
    "n": "French Cafe Summer Salad",
    "a": "Kimberly West",
    "r": "0",
    "s": 8,
    "des": "\"It is a fresh and colorful salad made with potatoes cabbage, peppers and corn in a tangy Dijon dressing. Full of flavor and loved everywhere I take it. Serve this cold on a hot summer day with a loaf of crusty bread and your favorite cheese.\"",
    "ins": "Place the potatoes in a large pot with enough lightly salted water to cover. Bring to a boil over medium-high heat, and cook until tender, but still firm. It will take about 20 minutes. Drain, cool and cut into bite-size pieces.\nIn a large salad bowl, whisk together the olive oil, garlic, and Dijon mustard. Add the cabbage, corn, red onion, red pepper, green pepper, yellow pepper,  and cucumber. Add kidney beans, if desired. Mix in the cooled potatoes. Wash your hands, and use them to mix everything together until well coated with the dressing. Gently stir in the Romano cheese, and season with salt and pepper to taste. Chill for one hour before serving.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "662183.jpg",
    "o": "",
    "st": "allrecipes"
}