{
    "id": 34721,
    "old_rating": "4.50752",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups water",
        "2 cups uncooked white rice",
        "1 tablespoon vegetable oil",
        "1 pound ground pork",
        "1 bunch green onions, thinly sliced",
        "1/2 teaspoon minced garlic",
        "1 (14 ounce) package firm tofu, drained and cubed",
        "2 carrots, shredded",
        "3 tablespoons hoisin sauce",
        "2 tablespoons soy sauce",
        "1 teaspoon sesame oil",
        "1/4 teaspoon hot chile paste",
        "1 head iceberg lettuce leaves, separated"
    ],
    "nut": [
        "Calories > 836 kcal",
        "Carbs > 95.5 g",
        "Cholesterol > 74 mg",
        "Fat > 31 g",
        "Protein > 45.8 g",
        "Sodium > 774 mg"
    ],
    "n": "Asian Lettuce Wraps",
    "a": "SMACPRODUCTIONS",
    "r": "0",
    "s": 4,
    "des": "\"After many attempts and searching for recipes, I have ended up with this one.  Easy to do and great as a summer meal outside.  Try different versions by alternating optional ingredients, such as peanuts, peppers, shrimp, steamed rice noodles, diced teriyaki chicken, scrambled egg, or bean sprouts. The possibilities are endless!\"",
    "ins": "In a saucepan combine the water and rice. Bring to a boil, cover, and reduce heat to a simmer. Simmer for 20 minutes, until water is absorbed. Set aside and keep warm.\nHeat oil in a wok over medium-high heat. Cook the pork, green onions, and garlic for 5 to 7 minutes, or until lightly brown. Add the tofu, carrot, Hoisin, and soy sauce, stirring frequently until heated through. Remove from heat, and stir in the sesame oil and chile paste.\nTo serve: spoon a small amount of rice into each lettuce leaf, top with the stir-fry mixture, and drizzle with additional soy sauce or hoisin, if desired. Wrap the lettuce leaf to enclose the filling.",
    "pt": "15 m",
    "ct": "32 m",
    "tt": "47 m",
    "i": "220949.jpg",
    "o": "4477190.jpg,4411112.jpg,4134465.jpg,4026866.jpg,3999444.jpg,2645663.jpg",
    "st": "allrecipes"
}