{
    "id": 35411,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 cups all-purpose flour",
        "1 cup shortening",
        "2 (0.6 ounce) cakes compressed fresh yeast",
        "1 cup sour cream",
        "1/2 teaspoon salt",
        "5 eggs",
        "1 tablespoon white sugar",
        "FILLING:",
        "1 cup ground walnuts",
        "2/3 cup white sugar",
        "1 cup milk"
    ],
    "nut": [
        "Calories > 163 kcal",
        "Carbs > 15.8 g",
        "Cholesterol > 29 mg",
        "Fat > 9.8 g",
        "Protein > 3.2 g",
        "Sodium > 49 mg"
    ],
    "n": "Waser Kipfels (Water Lillie's)",
    "a": "Esther",
    "r": "0",
    "s": 36,
    "des": "\"These are from a 125 year old German recipe. Tricky to make but worth the effort. This recipe has been in my family for 65 years. Some measures are not shown in the original, nor is the oven temperature. This takes a lot of time. The filling is much like baklava.\"",
    "ins": "In a large  bowl, combine the flour, salt, and 1 tablespoon sugar. Crumble the  yeast into the flour mixture as finely as possible. Cut in shortening until the mixture resembles coarse crumbs. Make a well in the center, and add the eggs. Mix well while gradually adding sour cream. If the dough is too sticky, more flour can be added depending on the size of your eggs.\nWrap the dough in a clean dish towel, and hang in very very cold water for one hour while you make the filling.\nIn a saucepan over medium heat, stir together the ground walnuts, 2/3 cup sugar, and milk. Heat to between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of the mixture dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface. Stir constantly to prevent burning. Set aside to cool before using.\nPreheat the oven to 375 degrees F (190 degrees C). On a sugared surface, roll the dough out to 1/8 inch thickness. Flour will make the cookies tough. Cut into 3x3 inch squares. Place one teaspoon of filling into each square, then fold in half to make a rectangle. Bend the two long ends around to form a horse shoe shape, and place onto the prepared cookie sheets.\nBake for 10 to 12 minutes in the preheated oven, or until golden brown. Watch the first batch carefully to set the ideal time for your oven, as they do burn quickly. Enjoy a rare treat!",
    "pt": "1 h",
    "ct": "12 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}