{
    "id": 35449,
    "old_rating": "4.41935",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (9 inch) unbaked pie crust",
        "1/2 cup white sugar",
        "1/2 cup brown sugar",
        "2 tablespoons all-purpose flour",
        "1/2 teaspoon ground cinnamon",
        "5 cups Granny Smith apples - peeled, cored and sliced",
        "1 cup HERSHEYÂ®'S Cinnamon Chips",
        "3 tablespoons butter",
        "3/4 cup all-purpose flour",
        "3/4 cup brown sugar",
        "6 tablespoons butter",
        "2/3 cup HERSHEYÂ®'S Cinnamon Chips",
        "2 eggs",
        "1 cup half-and-half cream",
        "1/2 cup white sugar",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 881 kcal",
        "Carbs > 123.2 g",
        "Cholesterol > 94 mg",
        "Fat > 40.4 g",
        "Protein > 9.8 g",
        "Sodium > 364 mg"
    ],
    "n": "Apple Crunch Pie with Vanilla Sauce",
    "a": "Cynthia Clark",
    "r": "0",
    "s": 8,
    "des": "\"Not your typical apple pie - Hershey's Cinnamon Chips are scattered throughout, and in the streusel, giving the apples the cinnamon flavor they deserve.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C.)\nIn a large bowl, Mix together 1/2 cup white sugar, 1/2 cup brown sugar, 2 tablespoons flour and cinnamon. Stir in sliced apples until coated with sugar mixture. Stir in 1 cup cinnamon chips. Pour filling into pie crust, and dot with 3 tablespoons butter. Sprinkle with streusel topping.\nTo make streusel topping:  In a medium bowl, mix together 3/4 cup flour and 3/4 cup brown sugar. Cut in 6 tablespoons butter until mixture resembles coarse crumbs. Stir in remaining 2/3 cup cinnamon chips.\nBake in preheated oven for 10 minutes, then reduce heat to 350 degrees F (175 degrees C) and continue baking for 35 to 40 minutes, or until filling is bubbling and streusel is golden brown. Allow to cool for at least 1 hour.\nWhile the pie is cooling, prepare the vanilla sauce. In the top of a double boiler over medium heat, whisk together eggs, half-and-half and 1/2 cup sugar. Cook, stirring constantly, until sauce has thickened. Remove from heat, and stir in vanilla. Spoon sauce (warm or cooled) over slices of pie.",
    "pt": "15 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "33952.jpg",
    "o": "",
    "st": "allrecipes"
}