{
    "id": 35596,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter, softened",
        "3 1/3 cups white sugar",
        "1/2 cup honey",
        "1/2 cup dark corn syrup",
        "2 eggs",
        "1/2 cup milk",
        "1 teaspoon vanilla extract",
        "2 teaspoons unsweetened cocoa powder",
        "1/8 teaspoon ground cloves",
        "1/8 teaspoon ground allspice",
        "1/8 teaspoon ground cinnamon",
        "1/8 teaspoon ground nutmeg",
        "1 teaspoon salt",
        "1 1/2 teaspoons baking powder",
        "5 cups all-purpose flour",
        "1 (16 ounce) container cream cheese frosting",
        "1/2 cup pecan halves (optional)"
    ],
    "nut": [
        "Calories > 281 kcal",
        "Carbs > 47.3 g",
        "Cholesterol > 24 mg",
        "Fat > 9.7 g",
        "Protein > 2.5 g",
        "Sodium > 164 mg"
    ],
    "n": "Grace's Honey Cakes",
    "a": "redtex",
    "r": "0",
    "s": 36,
    "des": "\"Unbelievable!!!  These are so unique and chewy and spicy... always a hit with everyone!  Honey and spices meld together to make an incredible dessert bar. Topped off with cream cheese icing of course!! Increase or decrease the amount of spices to suit your taste. Just don't over bake!! They will be chewy with a sort of glossy center.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Grease two 9x13 inch pans.\nIn a large bowl, cream together the butter and sugar until smooth. Stir in the honey and corn syrup, then beat in the eggs one at a time until the batter is light and fluffy. Stir in milk and vanilla. Combine the cocoa, cloves, allspice, cinnamon, nutmeg, salt, baking powder and flour; stir into the honey mixture until fully incorporated. Batter will be thick. Divide the batter evenly between the prepared pans, and spread flat.\nBake for 20 to 25 minutes in the preheated oven. Do not over bake, or the cakes will not be chewy. Cut into squares while still warm, remove from the pan, and let cool. Frost with cream cheese frosting, and garnish each piece with a pecan half.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "893538.jpg",
    "o": "",
    "st": "allrecipes"
}