{
    "id": 37333,
    "old_rating": "4.68",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup vegetable oil",
        "1/2 cup soy sauce",
        "1/2 cup light corn syrup",
        "1/4 cup lemon juice",
        "2 tablespoons sesame seeds",
        "1/2 teaspoon garlic powder",
        "garlic salt to taste",
        "4 skinless, boneless chicken breast halves - cut into 1 1/2 inch pieces",
        "1 (8 ounce) package fresh chopped mushrooms",
        "2 onions, quartered",
        "1 green bell pepper, cut into large chunks"
    ],
    "nut": [
        "Calories > 816 kcal",
        "Carbs > 44.9 g",
        "Cholesterol > 68 mg",
        "Fat > 58.5 g",
        "Protein > 32.8 g",
        "Sodium > 1995 mg"
    ],
    "n": "Marinated Chicken Kabobs",
    "a": "D.DETMANN",
    "r": "0",
    "s": 4,
    "des": "\"This great summer recipe was given to me by a friend years ago. You can put any vegetables you want on the skewers. Don't be worried when you see the light corn syrup in the ingredients, it comes together great! It's a great change. You can even skip the vegetables and just skewer the chicken. Enjoy!\"",
    "ins": "In a medium bowl, blend vegetable oil, soy sauce, light corn syrup, lemon juice, sesame seeds, garlic powder, and garlic salt. Place chicken in the mixture. Cover, and marinate in the refrigerator at least 2 hours.\nPreheat an outdoor grill for medium heat, and lightly oil grate. Thread chicken onto skewers alternately with mushrooms, onions, and green bell pepper. Pour marinade into a saucepan, and bring to a boil. Cook for 5 to 10 minutes.\nPlace skewers on the prepared grill. Cook 15 to 20 minutes, turning frequently, until chicken is no longer pink and juices run clear. Baste with the boiled marinade frequently during the last 10 minutes.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "829031.jpg",
    "o": "4536627.jpg,3776881.jpg,1369091.jpg,1226594.jpg,1115988.jpg,1092010.jpg",
    "st": "allrecipes"
}