{
    "id": 38031,
    "old_rating": "4.23077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large eggplant",
        "1 tablespoon minced garlic",
        "1 tablespoon minced fresh ginger root",
        "1/2 cup chopped green onions",
        "1/4 teaspoon red pepper flakes",
        "3 tablespoons soy sauce",
        "3 tablespoons brown sugar",
        "1 teaspoon rice vinegar",
        "1 tablespoon hot water",
        "2 tablespoons peanut oil",
        "1/2 teaspoon sesame oil",
        "1 French baguette, sliced into 1/4 inch rounds"
    ],
    "nut": [
        "Calories > 316 kcal",
        "Carbs > 55.7 g",
        "Cholesterol > 0 mg",
        "Fat > 6.5 g",
        "Protein > 10.5 g",
        "Sodium > 948 mg"
    ],
    "n": "Strange Flavor Eggplant Spread",
    "a": "LAURA NASON",
    "r": "0",
    "s": 6,
    "des": "\"An Eggplant spread used by China Moon Cafe. Delicious!! A smooth roasted eggplant spread flavored with garlic, ginger, sesame oil and green onion. Spread on crusty bread.\"",
    "ins": "Preheat the oven to 450 degrees F (220 degrees C). Prick the eggplant several times with a fork, and remove the leaves. Place on a baking sheet. Bake for 30 minutes in the oven, turning over once, until tender. Remove from the oven, and slit open to cool.\nWhile the eggplant are still warm, remove the stem end and peel. Cut into chunks, and place them in the container of a blender or food processor. Process until smooth.\nIn a small dish, combine the garlic, ginger, green onions, and red pepper flakes. In a separate dish, stir together the soy sauce, brown sugar, rice vinegar, and hot water.\nHeat a wok over high heat until hot enough to evaporate a drop of water. Pour in the peanut oil, and swirl to coat the wok. When the oil is hot, dump in the garlic mixture, and stir-fry for about 15 seconds. Pour in the soy sauce mixture, and bring to a simmer. Stir in the eggplant puree, cooking just until heated through. Remove to a serving dish, and stir in the sesame oil. Allow to cool, and serve at room temperature as a spread for the bread.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}