{
    "id": 38294,
    "old_rating": "3.7619",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup chopped dates",
        "1 cup water",
        "8 cups rolled oats",
        "1/2 cup chopped walnuts",
        "1 cup raisins",
        "1 cup wheat germ",
        "1/2 cup sunflower seeds",
        "1/2 cup slivered almonds",
        "2 cups shredded coconut",
        "1/4 cup vegetable oil",
        "1/4 cup frozen apple juice concentrate, thawed"
    ],
    "nut": [
        "Calories > 405 kcal",
        "Carbs > 53.3 g",
        "Cholesterol > 0 mg",
        "Fat > 19 g",
        "Protein > 9.9 g",
        "Sodium > 10 mg"
    ],
    "n": "Sugar Free Granola",
    "a": "ISADORE",
    "r": "0",
    "s": 16,
    "des": "\"This granola recipe is tried and tested, I bring with me all my camping trips.  It also makes a very filling and delicious breakfast.  The only main ingredient in this recipe is the oatmeal, all the other ingredients can be substituted.  This recipe is made without adding any honey or sugar, although if you don't have any dates at of home you can always add 1/2 cup honey to the other ingredients.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). In a small saucepan over medium heat, combine the dates and water. Cook stirring occasionally until the mixture forms a thick paste. Remove from heat and set aside.\nIn a large bowl, mix together the oats, walnuts, raisins, wheat germ, sunflower seeds, and coconut. Spread out in a thin layer onto a baking sheet. If your baking sheet is small, this can be done in batches.\nBake for 7 minutes in the preheated oven, or until lightly toasted. Transfer the mixture back into the bowl, and mix in the date paste, apple juice concentrate, and oil. Return to the baking sheet and bake for an additional 7 to 10 minutes, stirring occasionally until lightly browned. Granola will become more crispy as it cools. Store in an airtight container.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "344405.jpg",
    "o": "",
    "st": "allrecipes"
}