{
    "id": 38398,
    "old_rating": "4.84848",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "5 1/2 cups all-purpose flour",
        "1/4 teaspoon salt",
        "2 cups shortening",
        "3/4 cup cold water",
        "1 egg",
        "1 tablespoon vinegar",
        "4 cups apples - peeled, cored and chopped",
        "2 cups chopped fresh rhubarb",
        "2 cups sliced fresh strawberries",
        "2 cups fresh blueberries",
        "2 cups fresh raspberries",
        "2 tablespoons lemon juice",
        "2 cups white sugar",
        "2/3 cup all-purpose flour",
        "2 tablespoons tapioca",
        "1 egg yolk, beaten",
        "2 tablespoons water"
    ],
    "nut": [
        "Calories > 554 kcal",
        "Carbs > 73.7 g",
        "Cholesterol > 24 mg",
        "Fat > 27 g",
        "Protein > 6.2 g",
        "Sodium > 44 mg"
    ],
    "n": "Bumbleberry Pie II",
    "a": "TEDDYMOM1",
    "r": "0",
    "s": 16,
    "des": "\"I have made these pies for many years and always get great results and reviews! These pies are not too sweet, and the fresh fruit taste really shines!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine flour and salt. Cut in shortening until mixture resembles coarse crumbs. Whisk together 3/4 cup water, egg, and vinegar. Stir into flour until mixture forms a ball. Divide dough into 4 balls. Wrap in plastic and refrigerate for 4 hours, or overnight. Roll out dough portions to fit a 9 inch pie pan. Place bottom crusts in 2 pie pans. Set aside top crusts.\nIn a large bowl, combine apples, rhubarb, strawberries, blueberries, raspberries, and lemon juice. Mix together 2 cups sugar, 2/3 cup flour, and tapioca; gently toss with fruit mixture. Divide into 2 pastry lined pie pans. Cover with top crusts; trim and crimp edges. Brush tops with egg wash (1 egg yolk beaten with 2 tablespoons water). Cut a few slits in the top to allow steam to vent.\nBake in preheated oven for 50 to 60 minutes, or until filling is bubbly in center and top is golden brown.",
    "pt": "45 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "849467.jpg",
    "o": "2245393.jpg,876944.jpg,836387.jpg,666782.jpg,604704.jpg,257354.jpg",
    "st": "allrecipes"
}