{
    "id": 39304,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 pattypan squash, stem and blossom removed",
        "6 slices bacon",
        "1/2 cup diced onion",
        "1 1/2 cups soft bread crumbs",
        "1/4 cup freshly grated Parmesan cheese",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 187 kcal",
        "Carbs > 8.4 g",
        "Cholesterol > 23 mg",
        "Fat > 14.3 g",
        "Protein > 6.2 g",
        "Sodium > 439 mg"
    ],
    "n": "Stuffed Pattypan Squash",
    "a": "Michele O'Brien",
    "r": "0",
    "s": 6,
    "des": "\"A wonderful way to use the over-abundance of squash from your garden.  Cute pattypan squash are stuffed with a cheesy bacon stuffing, and baked. My children call these 'Squash Volcanoes' and gobble them up!  Enjoy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring one inch of water to a boil in a saucepan over medium-high heat. Add squash, cover, and cook for 10 minutes, or until a fork can pierce the stem with little resistance. Drain, and slice off the top stem of the squash. Use a melon baller to carefully scoop out the centers of the squash. Reserve all of the bits of squash.\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Remove bacon to paper towels, and set aside. Saute onion in bacon drippings. Chop the reserved squash pieces, and saute them with the onion for one minute.\nRemove the skillet from heat, and stir in the breadcrumbs. Crumble the bacon, and stir into the stuffing along with the Parmesan cheese. Season to taste with salt and pepper. Stuff each squash to overflowing with the mixture, and place them in a baking dish. Cover the dish loosely with aluminum foil.\nBake for 15 minutes in the preheated oven, or until squash are heated through.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "661153.jpg",
    "o": "3968890.jpg,3811336.jpg,3578431.jpg,1441835.jpg,1254157.jpg,1044495.jpg",
    "st": "allrecipes"
}