{
    "id": 39501,
    "old_rating": "4.10145",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 skinless, boneless chicken breast halves - cut into cubes",
        "1 tablespoon butter",
        "1 small onion, finely chopped",
        "1 clove garlic, minced",
        "2 cups sliced fresh mushrooms",
        "1/2 cup Italian salad dressing, or as needed",
        "5 tablespoons lemon juice, divided",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "1/4 cup milk",
        "salt and pepper to taste",
        "1 (12 ounce) package wide egg noodles",
        "1 (12 ounce) package frozen broccoli spears, thawed",
        "1 tablespoon butter",
        "2 teaspoons lemon juice"
    ],
    "nut": [
        "Calories > 320 kcal",
        "Carbs > 39.2 g",
        "Cholesterol > 62 mg",
        "Fat > 12.1 g",
        "Protein > 15 g",
        "Sodium > 586 mg"
    ],
    "n": "Attitude Chicken",
    "a": "ELLIEA",
    "r": "0",
    "s": 8,
    "des": "\"I created this recipe when I was 15 years old, which explains the name.  It's actually chicken in a lemon sauce over egg noodles.  Zingy, tasty, and very different!  Everyone loves it. Serve with warm bread and butter.\"",
    "ins": "Melt 1 tablespoon of butter in a large skillet over medium-high heat. Add the cubed chicken, and cook just until it turns white on the outside. Add the onion, garlic, and mushrooms. Saute until onions begin to turn clear. Pour in just enough Italian dressing to coat the chicken mixture, then add 1 tablespoon of lemon juice. Cover, reduce heat to low, and simmer while you make the sauce.\nCombine cream of chicken soup with milk in a small saucepan over medium heat. Heat through, but do not allow it to boil. When the mixture is thoroughly heated, stir in 4 tablespoons of lemon juice, and season with salt and pepper to taste. Be careful with the lemon - if you add it too soon the milk will curdle.  The result of it done correctly will be a shiny smooth sauce.\nMeanwhile, bring a large pot of lightly salted water to a boil. Add noodles, and cook until tender, about 8 minutes. Drain.\nFit a steamer basket into a saucepan, and add one inch of water, 1 tablespoon of butter, and remaining 2 teaspoons of lemon juice. Bring to a boil, and add broccoli. Cover, and allow the broccoli to steam for 5 minutes, or until tender, but still bright green.\nTo finish the dish, mix together the sauce and noodles, and place them on a serving platter. Top with chicken in the center, and arrange broccoli around the outside edge.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "2230.jpg",
    "o": "",
    "st": "allrecipes"
}