{
    "id": 40033,
    "old_rating": "3.72727",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon raw sunflower seeds",
        "1 tablespoon fresh lemon juice",
        "2/3 teaspoon freshly ground black pepper",
        "1/4 teaspoon salt",
        "4 boneless, skinless chicken breast halves",
        "1 (14.5 ounce) can peeled and diced tomatoes, drained",
        "5 ounces shredded Monterey Jack cheese"
    ],
    "nut": [
        "Calories > 285 kcal",
        "Carbs > 4.1 g",
        "Cholesterol > 100 mg",
        "Fat > 12.2 g",
        "Protein > 36.8 g",
        "Sodium > 572 mg"
    ],
    "n": "Kyle's Cheesy Chicken",
    "a": "Kyle",
    "r": "0",
    "s": 4,
    "des": "\"This is a classy dish and easy to make! It includes boneless chicken breast, lemon juice, black pepper and some salt. To top it with some style, I throw on some ready cut tomatoes and shredded Monterey Jack cheese and toasted sunflower seeds.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Place the sunflower seeds on a baking sheet in a single layer. Place them into the oven to toast while the oven is preheating. This should take only about 10 minutes. Keep an eye on them, they burn easily.\nIn a small bowl, mix together the lemon juice, pepper and salt. Place the chicken into an 11x7 inch baking dish, and sprinkle with the lemon juice mixture. Cover with a lid or aluminum foil.\nBake for 25 to 30 minutes in the preheated oven, or until chicken is no longer pink, and the juices run clear. Remove the dish from the oven, and drain off any liquid. Spoon the tomatoes over the chicken. Sprinkle the toasted sunflower seeds and Monterey Jack cheese evenly over the top. Switch the oven to Broil.\nPlace the dish with the chicken back into the oven uncovered, and broil for about 1 or 2 minutes, until the cheese is melted. There you have it!",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "2851621.jpg",
    "o": "",
    "st": "allrecipes"
}