{
    "id": 40374,
    "old_rating": "4.36232",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 pounds beef round roast",
        "salt and pepper to taste",
        "2 tablespoons butter",
        "1/2 cup water",
        "1/2 teaspoon dried sage",
        "1/2 teaspoon dried mint",
        "1 medium onion, sliced (optional)",
        "1 clove garlic, minced (optional)",
        "1/8 teaspoon seasoning salt (optional)",
        "1/8 teaspoon red pepper flakes (optional)",
        "1 tablespoon butter",
        "1 tablespoon all-purpose flour",
        "1/2 cup cold water",
        "1/4 teaspoon dried sage",
        "1/4 teaspoon dried mint"
    ],
    "nut": [
        "Calories > 547 kcal",
        "Carbs > 2.3 g",
        "Cholesterol > 184 mg",
        "Fat > 31 g",
        "Protein > 61.2 g",
        "Sodium > 255 mg"
    ],
    "n": "English Roast Beef",
    "a": "SHADOWS1",
    "r": "0",
    "s": 8,
    "des": "\"A pot roast that can't be beat! A blend of flavors you never would expect. This has become a favorite of my historical interpreter friends. Wine can be substituted for water in the roasting pan if you like.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Season the roast with salt and pepper to taste. Melt 2 tablespoons butter in a Dutch oven over medium-high heat. Brown the outside of the roast on all sides in the butter. After the roast is browned, add 1/2 cup water to the pan, and sprinkle 1/2 teaspoon of sage, and 1/2 teaspoon of mint onto the roast. Place onion and garlic into the pan if desired, and season with seasoning salt and red pepper flakes, if using.\nCover the pot, and place the roast in the oven for 2 to 3 hours depending on how well done you prefer the meat to be. 2 hours for rare, and 3 for well done. Removed finished roast to a pan to keep warm.\nMelt 1 tablespoon of butter in a medium skillet. Whisk flour into melted butter until smooth. Remove from heat, and stir in 1/2 cup cold water. Mix until a smooth paste is formed. Return to medium heat, and season with remaining sage and mint. Stir in the liquid from the roasting pan, and boil, stirring constantly until the gravy is thickened. Remove from heat. Slice the roast and serve with gravy poured over the meat.",
    "pt": "20 m",
    "ct": "3 h",
    "tt": "3 h ",
    "i": "710616.jpg",
    "o": "",
    "st": "allrecipes"
}