{
    "id": 40384,
    "old_rating": "4.10345",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 cups water",
        "4 cubes chicken bouillon",
        "2 cups instant brown rice",
        "2 tablespoons cornstarch",
        "1/4 cup olive oil",
        "4 boneless, skinless chicken breast halves",
        "1 teaspoon dried thyme",
        "1 teaspoon dried sage",
        "2 teaspoons dried basil",
        "1 teaspoon dried parsley",
        "1 teaspoon dried marjoram",
        "1 medium onion, chopped",
        "2 (10 ounce) packages frozen chopped spinach, thawed and drained",
        "2 cups cottage cheese",
        "salt and pepper to taste",
        "1/2 cup Parmesan cheese",
        "1/4 cup margarine"
    ],
    "nut": [
        "Calories > 369 kcal",
        "Carbs > 25.3 g",
        "Cholesterol > 47 mg",
        "Fat > 18.1 g",
        "Protein > 27.8 g",
        "Sodium > 1041 mg"
    ],
    "n": "Chicken Florentine Rice Casserole",
    "a": "CHRIS523",
    "r": "0",
    "s": 8,
    "des": "\"An excellent and easy casserole that I actually made up with what I had one night when I was broke. I even surprised myself!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium saucepan, boil 2 cups water and chicken bouillon. Stir in rice. Remove from heat, and set aside. In a small bowl, mix cornstarch with remaining water.\nHeat olive oil in a medium skillet over medium heat. Place chicken in skillet with thyme, sage, basil, parsley, and marjoram. Cook until chicken is no longer pink and juices run clear. Drain and cube.\nStir onion into the skillet, and cook 5 minutes, or until browned and tender.\nIn a large bowl, thoroughly mix rice, cornstarch mixture, chicken, onion, spinach, and cottage cheese.\nTransfer the mixture to a medium baking dish. Season with salt and pepper. Top with Parmesan cheese, and dot with margarine. Bake, covered, 45 minutes in the preheated oven. Remove cover, and continue baking 15 minutes, until surface is lightly browned.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "65274.jpg",
    "o": "",
    "st": "allrecipes"
}