{
    "id": 40450,
    "old_rating": "4.67104",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup soy sauce",
        "1/4 cup cider vinegar",
        "2 tablespoons honey",
        "2 tablespoons canola oil",
        "10 large mushrooms, cut in half",
        "2 green onions, minced",
        "3 skinless, boneless chicken breast halves - cut into chunks",
        "1/2 pound sliced thick cut bacon, cut in half",
        "1 (8 ounce) can pineapple chunks, drained",
        "skewers"
    ],
    "nut": [
        "Calories > 235 kcal",
        "Carbs > 14.4 g",
        "Cholesterol > 47 mg",
        "Fat > 11.4 g",
        "Protein > 18.9 g",
        "Sodium > 919 mg"
    ],
    "n": "Chicken and Bacon Shish Kabobs",
    "a": "Angie",
    "r": "0",
    "s": 6,
    "des": "\"Tangy marinated chicken and mushrooms, wrapped in bacon and skewered. Excellent for entertaining and trying something new! These are a must-try! (They can also be broiled instead of grilled, if you're low on time.)\"",
    "ins": "In a large bowl, mix the soy sauce, cider vinegar, honey, canola oil, and green onions. Place the mushrooms and chicken into the mixture, and stir to coat. Cover, and marinate in the refrigerator at least 1 hour.\nPreheat grill for high heat.\nRemove the mushrooms and chicken from the marinade and shake off excess. Pour the marinade into a small saucepan and bring to a boil over high heat. Reduce heat to medium-low and simmer for 10 minutes; set aside.\nWrap the chicken chunks with bacon, and thread onto skewers so that the bacon is secured. Alternate with mushroom halves and pineapple chunks.\nLightly oil the grill grate. Arrange skewers on the prepared grill. Cook 15 to 20 minutes, brushing occasionally with remaining soy sauce mixture, until bacon is crisp and chicken juices run clear.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "4528145.jpg",
    "o": "4528145.jpg,4004342.jpg,3679151.jpg,3677554.jpg,3672178.jpg,2611962.jpg",
    "st": "allrecipes"
}