{
    "id": 40573,
    "old_rating": "4.49573",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound fresh shrimp, peeled and deveined",
        "1 tablespoon olive oil",
        "1 tablespoon Cajun seasoning",
        "6 ounces fettuccini pasta",
        "1 tablespoon butter",
        "3 cups fresh mushrooms, sliced",
        "1 tablespoon chopped shallots",
        "2/3 cup chicken broth",
        "1/2 cup sour cream",
        "1 tablespoon cornstarch",
        "1 cup chicken broth",
        "1 (7 ounce) jar roasted red bell peppers",
        "1 tablespoon drained capers"
    ],
    "nut": [
        "Calories > 440 kcal",
        "Carbs > 41.4 g",
        "Cholesterol > 195 mg",
        "Fat > 16.1 g",
        "Protein > 33.1 g",
        "Sodium > 1208 mg"
    ],
    "n": "Blackened Shrimp Stroganoff",
    "a": "Linda Johnson",
    "r": "0",
    "s": 4,
    "des": "\"This recipe is a definite winner.  Especially if all the ingredients appeal to you.  I've gotten many bravos for this recipe.  I hope your family and friends enjoy this recipe as much as mine do.  I've subbed frozen green peas for the roasted red bell peppers.\"",
    "ins": "Combine peeled shrimp, oil, and Cajun seasoning in a medium bowl. Set aside.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nMeanwhile, melt butter over medium heat in a large frying pan. Cook and stir mushrooms and shallot in butter until tender.  Remove from pan.  Add shrimp cook until shrimp turn pink about 2 to 3 minutes.  Remove from pan.  Add 2/3 cup chicken broth to pan, and bring to a boil. Cook, uncovered, until reduced to 1/4 cup (2 to 3 minutes).\nIn a small bowl, stir together sour cream and cornstarch; mix in 1 cup chicken broth. Stir into reduced chicken broth in the frying pan. Cook and stir until thick and bubbly.  Cook 1 minute more.  Stir in shrimp, mushroom mixture, roasted red peppers, and capers.  Heat through, and season to taste.  Serve over pasta.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "4530287.jpg",
    "o": "4530287.jpg,4530285.jpg,4518194.jpg,4484699.jpg,2437977.jpg,1239290.jpg",
    "st": "allrecipes"
}