{
    "id": 41550,
    "old_rating": "4.17021",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds potatoes, peeled and chopped",
        "1/4 cup milk",
        "2 pounds leeks, chopped",
        "1 pound ground beef",
        "1 onion, chopped",
        "1 red bell pepper, chopped",
        "1 green bell pepper, chopped",
        "1 tablespoon finely chopped green chile peppers",
        "soy sauce to taste",
        "1 (8 ounce) package shredded Cheddar cheese",
        "6 ounces cooked ham, cut into thin strips"
    ],
    "nut": [
        "Calories > 515 kcal",
        "Carbs > 39.7 g",
        "Cholesterol > 90 mg",
        "Fat > 28.9 g",
        "Protein > 25 g",
        "Sodium > 554 mg"
    ],
    "n": "Dutch Leek Casserole",
    "a": "BRIGIT",
    "r": "0",
    "s": 8,
    "des": "\"This is a dish my mum used to make at home, and has no added butter or oil. It's a complete meal for those cold winter nights, and best eaten straight from the oven. The chili gives extra zing to the dish.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of salted water to a boil, and cook potatoes until tender but firm, about 15 minutes. Drain potatoes, and transfer to a medium bowl. Mash together with milk.\nPlace leeks in a medium saucepan with enough water to cover, and bring to a boil. Cook 10 minutes, or until tender. Drain, and set aside.\nIn a medium skillet over medium heat, cook and stir the ground beef until evenly brown. Mix in the onion, red bell pepper, and green bell pepper. Season with green chile peppers and soy sauce. Continue to cook and stir until vegetables are tender.\nIn a medium baking dish, mix mashed potatoes, leeks, and ground beef mixture. Sprinkle with Cheddar cheese, and top with ham.\nBake 25 minutes in the preheated oven, until bubbly and lightly browned.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "98043.jpg",
    "o": "",
    "st": "allrecipes"
}