{
    "id": 41605,
    "old_rating": "4.17391",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/3 cup uncooked brown rice",
        "2/3 cup water",
        "2 cups textured vegetable protein",
        "3/4 cup boiling water",
        "2 (10.75 ounce) cans tomato soup",
        "10 3/4 fluid ounces water",
        "1 large head cabbage, cored",
        "1 tablespoon vegetable oil",
        "1 large onion, chopped",
        "1/2 carrot, finely chopped",
        "1/2 red bell pepper, diced",
        "3 cloves garlic, minced",
        "1 tablespoon white wine",
        "1 (14.5 ounce) can whole peeled tomatoes, drained, juice reserved",
        "1 egg, lightly beaten",
        "1/2 cup frozen peas",
        "2 pinches cayenne pepper",
        "1/2 teaspoon onion powder",
        "1 teaspoon garlic powder",
        "1/2 teaspoon dried basil",
        "3 drops hot red pepper sauce",
        "toothpicks",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 215 kcal",
        "Carbs > 23.2 g",
        "Cholesterol > 23 mg",
        "Fat > 3.8 g",
        "Protein > 27.3 g",
        "Sodium > 435 mg"
    ],
    "n": "Vegetarian Cabbage Rolls",
    "a": "Tammy",
    "r": "0",
    "s": 8,
    "des": "\"This is a wonderful recipe -- a little time consuming, but worth the work -- it tastes just like the meat version.\"",
    "ins": "Place the rice and 2/3 cup water in a pot, and bring to a boil. Reduce heat to low, cover, and simmer 40 minutes, until tender. Mix the textured vegetable protein and 3/4 cup boiling water in a medium bowl. Soak 15 minutes, until rehydrated. Mix in the cooked rice.\nPreheat oven to 350 degrees F (175 degrees C). In a bowl, mix the tomato soup and 10 3/4 fluid ounces (1 soup can) water.\nPlace the cabbage in a pot with enough water to cover. Bring to a boil, and cook 15 minutes, until leaves are easily removed. Drain, cool, and separate leaves.\nHeat the oil in a skillet over medium heat. Stir in the onion, carrot, red bell pepper, and garlic. Cook until tender. Mix in wine, and continue cooking until almost all liquid has evaporated. Stir in rice and textured vegetable protein, reserved juice from the tomatoes, egg, and peas. Season with cayenne pepper, onion powder, garlic powder, basil, and hot pepper sauce. Cook and stir until heated through.\nOn 1 cabbage leaf, place about 2 tablespoons skillet mixture and 1 tomato. Roll tightly, and seal with a toothpick. Repeat with remaining filling. Arrange in a casserole dish. Pour the soup and water over cabbage rolls. Season with salt and pepper.\nCover, and bake 35 minutes in the preheated oven, basting occasionally with the tomato sauce. Remove cover, and continue baking 10 minutes.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4427939.jpg",
    "o": "",
    "st": "allrecipes"
}