{
    "id": 42172,
    "old_rating": "4.43704",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "7 pounds boneless chuck roast",
        "1 cup water",
        "3 tablespoons white vinegar",
        "4 tablespoons brown sugar",
        "2 teaspoons dry mustard",
        "4 tablespoons Worcestershire sauce",
        "3 cups ketchup",
        "2 teaspoons salt",
        "3/4 teaspoon ground black pepper",
        "1/4 teaspoon cayenne pepper",
        "6 cloves garlic, minced"
    ],
    "nut": [
        "Calories > 231 kcal",
        "Carbs > 10.7 g",
        "Cholesterol > 60 mg",
        "Fat > 13.7 g",
        "Protein > 16.3 g",
        "Sodium > 594 mg"
    ],
    "n": "Elaine's Sweet and Tangy Loose Beef BBQ",
    "a": "ENGLISHNWOODS2",
    "r": "0",
    "s": 24,
    "des": "\"This recipe is a fly-by-the-seat-of-your-pants creation. I researched several BBQ recipes online and in my cookbooks and combined bits and pieces of different things I liked about them. The result was a wonderful and tangy loose BBQ for sandwiches that is very easy to make and takes little hands-on time. My in-laws who are in their 70s both said it was the best BBQ they had ever had. It was awesome!\"",
    "ins": "Place the roast into a slow cooker along with the water. Cover, and cook on LOW for 2 to 4 hours, or until beef can be easily shredded with a fork.\nShred the beef, removing fat as you go. Remove 1/2 cup of the broth from the slow cooker, and reserve for later. Add the vinegar, brown sugar, dry mustard, Worcestershire sauce and ketchup. Mix in the salt, pepper, cayenne, and garlic. Stir so that the meat is well coated.\nCover, and continue to cook beef on LOW for an additional 4 to 6 hours. Add the reserved broth only if necessary to maintain moisture. Serve on toasted buns. The meat can be frozen for future use.",
    "pt": "15 m",
    "ct": "8 h",
    "tt": "8 h ",
    "i": "249314.jpg",
    "o": "",
    "st": "allrecipes"
}