{
    "id": 42579,
    "old_rating": "4.61839",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups heavy cream",
        "1 cube chicken bouillon",
        "1 tablespoon Asiago Cheese",
        "1 tablespoon cornstarch, mixed with equal parts water",
        "1 cup chopped sun-dried tomatoes",
        "1 (16 ounce) package bow tie pasta",
        "3/4 cup bacon",
        "1/4 cup butter",
        "1 cup diced red onion",
        "2 cloves garlic, chopped",
        "1 cup chopped green onion",
        "1 pound grilled skinless, boneless chicken breast, diced",
        "1 cup heavy cream",
        "2 tablespoons chopped fresh parsley"
    ],
    "nut": [
        "Calories > 733 kcal",
        "Carbs > 51.4 g",
        "Cholesterol > 187 mg",
        "Fat > 47.1 g",
        "Protein > 28.7 g",
        "Sodium > 539 mg"
    ],
    "n": "Asiago Sun-Dried Tomato Pasta",
    "a": "Michelle",
    "r": "0",
    "s": 8,
    "des": "\"This recipe is sooo good and definitely not low fat. The creamy sun-dried tomato Asiago sauce is delicious!\"",
    "ins": "In a large saucepan over medium heat, cook 2 cups cream until just bubbling. Watch carefully, to ensure that it doesn't boil over. Stir in bouillon and Asiago cheese. Stir with a whisk until dissolved. Add cornstarch mixture, and simmer until sauce is thickened, stirring constantly. Mix in the sun-dried tomatoes. Set aside, or cover and refrigerate for later use.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nMelt butter in a large saucepan over medium heat. Saute red onion until soft and translucent. Stir in garlic and cooked bacon, and cook for 2 minutes. Stir in green onions, chicken and 1 cup cream. Cook, stirring, until cream is heated through. Add Asiago cream sauce, and heat through. Toss with cooked pasta until evenly coated, and sprinkle with chopped parsley.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "91853.jpg",
    "o": "4539302.jpg,4531365.jpg,4488909.jpg,4482835.jpg,4482815.jpg,4293916.jpg",
    "st": "allrecipes"
}