{
    "id": 42616,
    "old_rating": "4.55263",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (20 ounce) loaf French bread",
        "1 quart milk",
        "3 egg",
        "2 cups granular sucralose sweetener (such as SplendaÂ®)",
        "2 tablespoons vanilla",
        "3 tablespoons margarine, melted",
        "1 cup raisins",
        "1 cup granular sucralose sweetener (such as SplendaÂ®)",
        "1 egg",
        "1/2 cup margarine, melted",
        "1/4 cup whiskey, or to taste"
    ],
    "nut": [
        "Calories > 175 kcal",
        "Carbs > 20.8 g",
        "Cholesterol > 34 mg",
        "Fat > 7.2 g",
        "Protein > 5.4 g",
        "Sodium > 240 mg"
    ],
    "n": "Sugar-Free Bread Pudding with Whiskey Sauce",
    "a": "KJEPPESE",
    "r": "0",
    "s": 24,
    "des": "\"FANTASTIC bread pudding recipe from the famous Bon Ton Cafe in New Orleans, modified into a sugar-free format, using sucralose sweetener, that tastes AMAZING! For a non-alcoholic version, use vanilla in place of whiskey.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nBreak bread into pieces, and place into a large bowl. Pour milk over bread, and crush with your hands until well blended. Stir in 3 eggs, 2 cups sweetener, vanilla, 3 tablespoons margarine, and raisins until evenly mixed. Transfer to the prepared pan.\nBake for 45 to 60 minutes in the preheated oven, or until very firm.\nTo make the sauce: In a medium bowl, cream together 1 cup sweetener and 1 egg until smooth. Gradually mix in the melted margarine, and continue stirring to dissolve sweetener. If the sauce is difficult to blend, it may be heated gently, but be careful not to curdle the egg. Gradually stir in whiskey which should make the sauce creamy smooth.\nTo serve: Allow pudding to cool completely, then cut into cubes, and place into individual heat-proof serving dishes. Pour sauce over, and heat under the broiler until golden, about 3 minutes.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "190955.jpg",
    "o": "",
    "st": "allrecipes"
}