{
    "id": 43272,
    "old_rating": "4.13402",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup butter",
        "6 tablespoons all-purpose flour",
        "3 cups milk",
        "1/2 cup freshly grated Parmesan cheese, divided",
        "1 egg, beaten",
        "salt and pepper to taste",
        "1 tablespoon butter",
        "2 cups sliced fresh mushrooms",
        "1 tomato, thinly sliced",
        "1 pound thinly sliced cooked turkey",
        "8 slices bread, toasted",
        "8 slices bacon, cooked"
    ],
    "nut": [
        "Calories > 1081 kcal",
        "Carbs > 46.6 g",
        "Cholesterol > 290 mg",
        "Fat > 65.6 g",
        "Protein > 73.4 g",
        "Sodium > 2203 mg"
    ],
    "n": "Kentucky Hot Brown",
    "a": "KLVAUGHN",
    "r": "0",
    "s": 4,
    "des": "\"If you're a southern belle or gentleman at heart you have to try this one!  Hot turkey over hot toast and smothered in a buttery sauce.  There are two things Kentucky does right--horse racing and the hot brown. This is also great for Thanksgiving leftovers!\"",
    "ins": "In a large skillet, melt 1/2 cup butter over medium heat. Stir in enough flour to absorb all of the butter. Slowly whisk in the milk, and 6 tablespoons of Parmesan cheese. Stir in the egg to thicken the sauce, but do not allow to boil. Remove from heat, and season with salt and pepper to taste.\nHeat remaining tablespoon of butter in a small skillet. Saute mushrooms in the butter until soft. Set aside.\nPreheat your oven's broiler. For each Hot Brown, place two slices of toast onto a heatproof plate or dish. Cover the toast with about 1/4 cup sauteed mushrooms and a couple of tomato slices. Place a liberal amount of turkey onto each Hot Brown, and pour an even more liberal amount of sauce over. Smother that baby.  Sprinkle remaining Parmesan cheese over the top. Repeat with remaining ingredients.\nPlace the entire dish under the broiler until the sauce is speckled brown and bubbly. Remove from broiler, criss-cross two slices of bacon on top, and serve!",
    "pt": "25 m",
    "ct": "15 m",
    "tt": "40 m",
    "i": "313774.jpg",
    "o": "",
    "st": "allrecipes"
}