{
    "id": 43294,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "2 tablespoons butter",
        "1 large onion, diced",
        "1 teaspoon brown sugar",
        "4 cloves garlic, halved",
        "1 (1 inch) piece fresh ginger, peeled and coarsely chopped",
        "3 tablespoons dried rubbed sage",
        "1/4 cup unsweetened apple juice",
        "1/4 cup unsweetened peanut butter",
        "1 (14 ounce) can reduced-sodium chicken broth",
        "1 (14 ounce) package frozen cooked squash, thawed",
        "1 teaspoon hot pepper sauce (such as TapatioÂ®), or to taste",
        "1 tablespoon Worcestershire sauce, or to taste",
        "2 1/2 tablespoons cider vinegar, or to taste",
        "water, or as needed",
        "1/4 cup heavy whipping cream",
        "1 teaspoon freshly grated nutmeg",
        "15 shelled pistachios, chopped"
    ],
    "nut": [
        "Calories > 340 kcal",
        "Carbs > 25 g",
        "Cholesterol > 37 mg",
        "Fat > 25.1 g",
        "Protein > 8.4 g",
        "Sodium > 461 mg"
    ],
    "n": "Amanda's Autumn Soup",
    "a": "Amanda Robinson",
    "r": "0",
    "s": 4,
    "des": "\"This is a very rich and delicious squash soup, suitable for a holiday dinner.\"",
    "ins": "Heat olive oil and butter in a saucepan over medium heat. Stir in onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Mix in brown sugar.\nFinely chop ginger and garlic in a food processor. Add them to the onion mixture and cook, stirring frequently, until garlic is beginning to brown, about 10 minutes. Stir in the sage and cook for an additional 5 minutes.\nPour in apple juice and stir to loosen any browned bits in the pan. Add peanut butter, 1 tablespoon at a time, stirring well after each addition. Mix in chicken broth and squash.\nBring the mixture to a boil; reduce the heat and simmer, stirring frequently, for 5 minutes. Season the soup to taste with hot pepper sauce, Worcestershire sauce, and vinegar, tasting frequently until flavors are balanced. Simmer for 15 minutes. If the soup seems too thick, add water 1/2 cup at a time.\nRemove the soup from the heat. Use an immersion blender to partially puree the mixture, leaving some of the onion intact. (If you don't have a handheld stick blender, carefully puree the hot soup in batches in a regular blender.) Pour in cream and blend to lighten the texture.\nLadle soup into warmed bowls and garnish with fresh-grated nutmeg and finely chopped pistachios.",
    "pt": "25 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}