{
    "id": 43415,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup Worcestershire sauce",
        "1 clove garlic, chopped",
        "2 tablespoons red pepper flakes",
        "1 teaspoon distilled white vinegar",
        "1 teaspoon dried oregano",
        "1 teaspoon dried basil",
        "1 teaspoon black pepper",
        "2 tablespoons olive oil",
        "1 tablespoon chili powder, or to taste",
        "2 1/2 pounds beef chuck roast, cubed",
        "1/2 pound fresh hot chilies, cut crosswise into thirds",
        "2 cups chopped fresh tomato",
        "1 red bell pepper, cut into 1 inch pieces",
        "1 (15.5 ounce) can pinto beans, drained",
        "1 teaspoon red pepper flakes, or to taste"
    ],
    "nut": [
        "Calories > 455 kcal",
        "Carbs > 17.9 g",
        "Cholesterol > 101 mg",
        "Fat > 30.1 g",
        "Protein > 28.8 g",
        "Sodium > 357 mg"
    ],
    "n": "Mean Old Chili",
    "a": "ROOKIE_WOOKIE",
    "r": "0",
    "s": 8,
    "des": "\"Have you ever had grilled chili? Think it sounds wicked? Well, you're right! This chili will keep your mouth on fire and howling at the moon...\"",
    "ins": "In a glass baking pan, stir together the Worcestershire sauce, garlic, 2 tablespoons red pepper flakes, vinegar, oregano, basil, black pepper and olive oil. Place the meat into the sauce; cover and marinate overnight in the refrigerator.\nPreheat an outdoor grill for medium-high heat. Remove meat from the marinade, and discard marinade. Thread the marinated beef, chili peppers, and red bell pepper onto skewers.\nGrill the skewers about 4 to 6 minutes on each side, or until the meat is of the desired doneness.\nPlace a large saucepan or Dutch oven over medium heat. Remove meat and peppers from skewers, and place them in the pan. Season with chili powder, and stir in tomatoes and pinto beans. Sprinkle in the remaining red pepper flakes.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "9 h ",
    "i": "859645.jpg",
    "o": "",
    "st": "allrecipes"
}