{
    "id": 43619,
    "old_rating": "3.91667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (10 ounce) marbled beef rib-eye steaks",
        "2 teaspoons garlic powder, or to taste",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "2 (12 fluid ounce) cans cola-flavored carbonated beverage",
        "2 cups barbeque sauce",
        "8 slices bacon"
    ],
    "nut": [
        "Calories > 661 kcal",
        "Carbs > 66.4 g",
        "Cholesterol > 87 mg",
        "Fat > 32.7 g",
        "Protein > 23.4 g",
        "Sodium > 2498 mg"
    ],
    "n": "BBQ Rib-Eye - You Won't Believe It!",
    "a": "DESTAGG",
    "r": "0",
    "s": 4,
    "des": "\"You won't believe it, but a well done steak with the moist, melt-in-your mouth flavor of a medium rare.  All you need is cola, garlic powder, salt, pepper, bbq sauce and bacon.\"",
    "ins": "Score steaks on both sides in a diamond pattern using a sharp knife. Punch the fatty areas with the tip of the knife. Sprinkle a thin coating of garlic powder over both sides of the steaks, then sprinkle with salt and pepper. Rub to get the seasoning into all of the scores.\nPlace steaks in a shallow dish, and pour the cola over them. Cover, and marinate in the refrigerator for 4 hours, turning steaks over every hour or so. During the last hour, coat the steaks with a thin layer of barbeque sauce.\nPreheat an outdoor grill for high heat.\nLightly oil the grilling surface. Place steaks on the grill over high heat, and cook until almost burnt on each side, about 4 minutes per side. Reduce the grill's heat to medium-low, or move steaks to a cooler part, and place the bacon strips on top of them. Cover, and slow cook for 10 minutes per side.\nSpread a thin layer of barbeque sauce over the steaks during the last few minutes of cooking, and allow it to cook until dry for a glazed effect.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "4 h ",
    "i": "20164.jpg",
    "o": "",
    "st": "allrecipes"
}