{
    "id": 43905,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Streusel:",
        "1 cup packed brown sugar",
        "1 cup sliced almonds",
        "1/4 cup all-purpose flour",
        "3 tablespoons butter, melted",
        "1 teaspoon freshly grated orange zest",
        "Cake:",
        "1/2 cup butter, softened",
        "1/2 cup white sugar",
        "3 eggs",
        "1 teaspoon freshly grated orange zest",
        "1/2 teaspoon vanilla extract",
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "2/3 cup orange juice",
        "Glaze:",
        "5 teaspoons orange juice",
        "1 cup confectioners' sugar"
    ],
    "nut": [
        "Calories > 416 kcal",
        "Carbs > 58.9 g",
        "Cholesterol > 74 mg",
        "Fat > 18.1 g",
        "Protein > 6.8 g",
        "Sodium > 233 mg"
    ],
    "n": "Almond Orange Streusel Coffee Cake",
    "a": "JLDC",
    "r": "0",
    "s": 12,
    "des": "\"This is a fabulous coffee cake! It has a crumbly sliced almond and brown sugar streusel topping plus a delicious glaze and a hint of orange throughout the cake. For variety, substitute a different type of nut in the streusel mixture. You can also use a Bundt cake pan if you don't have a tube pan. Absolutely irresistible!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch tube pan.\nIn a medium bowl, mix brown sugar, almonds, and flour. Stir in butter and 1 teaspoon orange zest, and set aside.\nIn a separate medium bowl, thoroughly beat together butter and sugar with an electric mixer. Mix in eggs one at a time. Beat in remaining teaspoon orange zest and vanilla extract.\nIn a large bowl, mix flour, baking powder, and baking soda. With an electric mixer set to Low, alternately mix in egg mixture and 2/3 cups orange juice to make a batter. Spoon 1/2 the batter into the prepared 9 inch tube pan. Top with 1/2 the brown sugar mixture. Cover with remaining batter, and top with remaining brown sugar mixture.\nBake 25 to 35 minutes in the preheated oven, until a toothpick inserted in the center comes out clean. Turn out onto a wire rack to cool.\nMix 5 teaspoons orange juice and confectioner's sugar in a small bowl, and use to glaze the cooled cake.",
    "pt": "30 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "592565.jpg",
    "o": "",
    "st": "allrecipes"
}