{
    "id": 44133,
    "old_rating": "4.44444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 bone-in chicken breast halves, with skin",
        "3 tablespoons chopped fresh ginger root",
        "salt to taste",
        "3 tablespoons all-purpose flour",
        "3 tablespoons olive oil",
        "3 tablespoons olive oil",
        "1 medium onion, finely chopped",
        "1 cup chicken broth",
        "1 cup heavy cream",
        "2 tablespoons sour cream",
        "1/2 cup dry white wine",
        "3 tablespoons chopped fresh tarragon",
        "12 spears thick stemmed asparagus",
        "1 sprig fresh parsley",
        "1 wedge lemon"
    ],
    "nut": [
        "Calories > 868 kcal",
        "Carbs > 14.4 g",
        "Cholesterol > 229 mg",
        "Fat > 64.9 g",
        "Protein > 51.4 g",
        "Sodium > 178 mg"
    ],
    "n": "Poulet aigu de Tarragon",
    "a": "Andy Toh",
    "r": "0",
    "s": 4,
    "des": "\"A personal creation based on basic French methods, with a 'sharp' ginger punch.  Chicken in a ginger cream sauce and arranged over steamed asparagus. Wonderful with a good bottle of Bordeaux wine over dinner.\"",
    "ins": "Rub the chicken breast halves with salt and chopped ginger. Watch the ginger, you just want to flavor the meat, but not overpower the sauce. Discard the ginger. Lightly coat the chicken in flour.\nHeat 3 tablespoons of olive oil in a large skillet over medium-high heat. Brown the chicken in the hot oil skin side first. Chicken should be about 3/4 cooked but the skin should be browned and crisp. Remove from pan and set aside.\nHeat remaining 3 tablespoons of olive oil in the skillet, and saute chopped onion until soft and translucent. Use the chicken broth to deglaze the pan. Stir in the cream and sour cream. Reduce heat to low, and simmer until the mixture has reduced by 1/4. Stir in the white wine until well blended.\nAdd the tarragon to the pan, and place chicken breasts on top of tarragon. Cook over low heat, spooning sauce over chicken, until the sauce has become very thick, the chicken is no longer pink, and its juices run clear.\nHeat one inch of lightly salted water to boiling in a large saucepan. Cut one inch off of the bottom of the asparagus stems. Place asparagus into the pan, cover and steam for 5 to 7 minutes, or until tender but still bright green. Remove from heat, and drain.\nTo serve, place 4 asparagus spears onto each plate with all of the tips facing the same direction. Place one chicken breast skin side up onto each plate so that it covers the stems of the asparagus, but the tips are exposed. Squeeze lemon over the asparagus. Spoon sauce over the chicken, and to the side of the asparagus.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "16414.jpg",
    "o": "",
    "st": "allrecipes"
}