{
    "id": 44239,
    "old_rating": "2.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter or margarine",
        "1 cup brown sugar",
        "1/2 cup white sugar",
        "4 eggs",
        "1 1/2 teaspoons vanilla extract",
        "1 1/2 cups water",
        "1 tablespoon instant coffee granules",
        "4 cups all-purpose flour",
        "1 tablespoon unsweetened cocoa powder",
        "5 teaspoons baking powder",
        "1 teaspoon salt",
        "1 cup coarsely chopped pecans",
        "1 cup heavy cream, chilled",
        "1/8 teaspoon salt",
        "1/2 teaspoon vanilla extract",
        "1/2 cup brown sugar, not packed",
        "10 pecan halves (optional)"
    ],
    "nut": [
        "Calories > 696 kcal",
        "Carbs > 80.4 g",
        "Cholesterol > 156 mg",
        "Fat > 38.7 g",
        "Protein > 9.7 g",
        "Sodium > 619 mg"
    ],
    "n": "Texas Praline Cake",
    "a": "Kat",
    "r": "0",
    "s": 10,
    "des": "\"Howdy Ya'll. Ready for some darn good cake? This tasty pecan cake has the subtle flavors of chocolate and coffee, and is frosted with a rich brown sugar whipped cream. This cake prefers Texas pecans!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Grease just the bottom of a 10 inch tube pan.\nIn a large bowl, cream together the butter, 1 cup brown sugar and white sugar until smooth. Beat in the eggs one at a time, mixing well after each. Stir in vanilla. Dissolve the coffee crystals in water, and stir into the creamed mixture until blended. Stir together the flour, cocoa, baking powder and salt; stir into the batter until just incorporated. Fold in pecans. Transfer the batter to the prepared pan.\nBake for about 55 minutes in the preheated oven, or until a toothpick inserted into the center of the cake comes out clean. Cool cake in pan on a wire rack.\nIn a chilled bowl, stir together the heavy cream, salt, vanilla and remaining 1/2 cup brown sugar so that the sugar is dissolved. Whip using chilled beaters until stiff. Run a knife around the outer edge of the cake in the pan, and tap it out onto a serving plate. Make sure cake is completely cool before frosting. Decorate with pecan halves if you like.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}