{
    "id": 44919,
    "old_rating": "4.55556",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 medium potatoes, peeled and cubed",
        "1 cup reserved potato water",
        "2 pounds all-purpose flour",
        "1 tablespoon salt",
        "1/2 (0.6 ounce) cake compressed fresh yeast",
        "1 (29 ounce) can crushed tomatoes",
        "1 large onion, thinly sliced",
        "salt to taste",
        "1 tablespoon olive oil",
        "1 (2 ounce) can anchovy fillets, chopped",
        "dried oregano to taste"
    ],
    "nut": [
        "Calories > 188 kcal",
        "Carbs > 38.2 g",
        "Cholesterol > 2 mg",
        "Fat > 1.3 g",
        "Protein > 5.8 g",
        "Sodium > 419 mg"
    ],
    "n": "Grandma's Focaccia: Baraise Style",
    "a": "DJK1125",
    "r": "0",
    "s": 24,
    "des": "\"No one else in my family could make focaccia like Grandma did, and when she passed away we thought she took the recipe with her. Then one day I found it in an old recipe box and gave it a try. If Grandpa says it's just like Grandma's, then it must be.\"",
    "ins": "Place potatoes in a medium saucepan with enough water to cover. Bring to a boil, and cook until tender but firm, about 15 minutes. When the potatoes are done, remove from heat, and drain, reserving one cup of potato water.\nPour the flour and 1 tablespoon of salt out onto a clean dry surface. Make a well in the center, and use a ricer to rice the potatoes into the center. Knead the flour and potatoes together as best you can, and then make another well in the center. Dissolve the yeast in the potato water, then pour the mixture into the well. Knead the dough for about 10 minutes, or until dough is smooth, and no longer sticky.\nDivide the dough into halves, and form into balls. Flour heavily, and cover with a few towels to prevent drafts. Let the dough rise until doubled in size, about 2 hours.\nPreheat the oven to 350 degrees F (175 degrees C). Coat two large cookie sheets with olive oil.\nPress the dough out evenly onto the pan. Press indentations into the sheets with your fingers every couple of inches. Divide the can of tomatoes in half, and spread onto each sheet evenly. Place the onion and anchovies onto the sheets, and press in lightly. Sprinkle with salt and oregano to taste. Drizzle lightly with olive oil.\nBake for 35 to 40 minutes in the preheated oven, or until bottom is browned. Let cool to room temperature, then cut into squares using a pizza wheel.",
    "pt": "3 h",
    "ct": "45 m",
    "tt": "3 h ",
    "i": "651538.jpg",
    "o": "",
    "st": "allrecipes"
}