{
    "id": 45128,
    "old_rating": "4.48837",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil",
        "1 small onion, chopped",
        "4 cloves garlic, minced",
        "1/4 teaspoon crushed red pepper flakes",
        "1/2 cup vodka",
        "1 (28 ounce) can crushed tomatoes",
        "1 cup light cream",
        "1/2 cup grated Romano cheese",
        "salt and pepper to taste",
        "1 pound penne pasta"
    ],
    "nut": [
        "Calories > 813 kcal",
        "Carbs > 102.3 g",
        "Cholesterol > 55 mg",
        "Fat > 29 g",
        "Protein > 25.1 g",
        "Sodium > 469 mg"
    ],
    "n": "LJ's Easy Penne with Vodka Sauce",
    "a": "LJ Marinello",
    "r": "0",
    "s": 4,
    "des": "\"This is the best (and easiest) vodka sauce recipe I've found.  I've given it out at least twenty times, and everyone raves about it!\"",
    "ins": "Heat the olive oil in a large saucepan over medium heat.  Stir in the onion and cook and stir until softened, about 5 minutes.  Add the garlic and crushed red pepper flakes and cook, stirring, for an additional minute.\nStir the vodka, crushed tomatoes and light cream into the onion mixture, turn heat to high, and bring sauce to a boil.  Reduce heat to low, stir in the Romano cheese and simmer for 2 hours, stirring occasionally.  Season finished sauce with salt and pepper.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the penne, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 10 minutes. Drain well in a colander set in the sink. Transfer pasta to a large bowl and pour vodka sauce over, tossing to coat pasta with the sauce to serve.",
    "pt": "10 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "2378117.jpg",
    "o": "1975839.jpg,1023341.jpg,640877.jpg,489763.jpg,275160.jpg,249002.jpg",
    "st": "allrecipes"
}