{
    "id": 45145,
    "old_rating": "4.6338",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup blue cornmeal",
        "1 teaspoon salt",
        "1 tablespoon white sugar",
        "1 cup boiling water",
        "1 beaten egg",
        "1/2 cup milk",
        "2 tablespoons butter, melted",
        "3/4 cup unbleached all-purpose flour",
        "2 teaspoons baking powder",
        "1/2 cup pine nuts, toasted"
    ],
    "nut": [
        "Calories > 376 kcal",
        "Carbs > 44.2 g",
        "Cholesterol > 64 mg",
        "Fat > 17.6 g",
        "Protein > 11.4 g",
        "Sodium > 833 mg"
    ],
    "n": "Blue Cornmeal Pancakes",
    "a": "UBERGRRL",
    "r": "0",
    "s": 4,
    "des": "\"This is a recipe from a cafe in Santa Fe, New Mexico. They are good with maple syrup or, if you're ambitious, with homemade peach or raspberry spread. This recipe serves four people, fewer if they're very hungry.\"",
    "ins": "In a medium bowl, mix together the blue cornmeal, salt and sugar. Stir in the boiling water until all of the ingredients are wet. Cover, and let stand for a few minutes.\nIn a measuring cup, combine the milk, egg and melted butter. Stir the milk mixture into the cornmeal mixture. Combine the flour and baking powder; stir into the cornmeal mixture until just incorporated. If the batter is stiff, add a little more milk until it flows off the spoon thickly but smoothly.\nHeat a large cast iron skillet over medium heat, and grease it with a dab of oil or butter.  Use about 2 tablespoons of batter for each pancake. Quickly sprinkle a few pignoli onto each cake. When the entire surface of the pancakes are covered with bubbles, flip them over, and cook the other side until golden. It's hard to tell when blue food is cooked through--so give them a few extra seconds if you're in doubt.\nServe immediately with maple syrup of fruit preserves.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "4525584.jpg",
    "o": "2170107.jpg,1760523.jpg,1488973.jpg,1087547.jpg,622573.jpg,613097.jpg",
    "st": "allrecipes"
}