{
    "id": 45386,
    "old_rating": "4.52033",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "9 New Mexico dry chiles - washed, with stems and seeds removed",
        "3 cups water",
        "5 pounds boneless beef chuck roast, trimmed of fat",
        "1/2 cup all-purpose flour",
        "1 tablespoon kosher salt",
        "1 tablespoon black pepper",
        "3 tablespoons olive oil",
        "1 large yellow onion, chopped",
        "2 cups beef stock or water"
    ],
    "nut": [
        "Calories > 544 kcal",
        "Carbs > 6.3 g",
        "Cholesterol > 136 mg",
        "Fat > 41.6 g",
        "Protein > 33.7 g",
        "Sodium > 624 mg"
    ],
    "n": "Chile Colorado",
    "a": "VARISSUL",
    "r": "0",
    "s": 12,
    "des": "\"I like to make this chile for my Mexican husband, who also doesn't like tomatoes in his chile.  This is a very Mexican chile.  If you decide to add beans, do it after the chile is finished.\"",
    "ins": "Place chiles and 3 cups water into a medium stockpot, and bring to a boil. Remove from heat and steep for 30 minutes to soften. Strain into a bowl, reserving the cooking liquid. Place the chiles and some of the liquid into a blender, and puree until smooth. Add more liquid as necessary to form a smooth sauce. Pass sauce through a fine mesh strainer to remove any seeds and the tough skins; set aside.\nCut the roast into 1 to 2 inch chunks. In a medium bowl, combine flour, salt, and pepper. Dredge the beef chunks in the seasoned flour; set aside.\nHeat olive oil in a large pot over medium heat. Saute onion until tender and translucent, about 5 minutes. Add beef chunks a few at a time, so as not to overcrowd the pot, and cook until evenly brown. Remove cooked meat, and continue browning remaining meat. Return reserved cooked meat to the pot. Stir in pureed chile mixture. Add beef stock to just cover beef chunks, or to personal preference. Bring to a boil over medium heat. Reduce heat to lowest setting, and simmer for 3 hours, or until meat is tender. If necessary, adjust with more stock during cooking.",
    "pt": "20 m",
    "ct": "3 h ",
    "tt": "3 h ",
    "i": "4474073.jpg",
    "o": "3901881.jpg,3560745.jpg,1787980.jpg,510830.jpg,423145.jpg,40025.jpg",
    "st": "allrecipes"
}