{
    "id": 45387,
    "old_rating": "4.13636",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups orange juice",
        "1 cup thousand island salad dressing",
        "1 cup Worcestershire sauce",
        "2 tablespoons vinegar-based hot pepper sauce",
        "2 tablespoons minced fresh garlic",
        "4 (1/2 pound) 1 1/2 inch thick rib-eye steaks",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 987 kcal",
        "Carbs > 42.4 g",
        "Cholesterol > 173 mg",
        "Fat > 72.7 g",
        "Protein > 41.6 g",
        "Sodium > 1563 mg"
    ],
    "n": "Willy's Juicy Steak",
    "a": "W_FONTANEZ",
    "r": "0",
    "s": 4,
    "des": "\"This is recipe that I have perfected over 4 years...this leaves the steak so juicy and tasty that your guests will think you went out to a restaurant and asked for a to-go box. Cook steak to your taste....remember only flip steak once.\"",
    "ins": "In a large resealable plastic bag, combine the orange juice, salad dressing, Worcestershire sauce, hot pepper sauce, and garlic. Squeeze the bag to mix well. You should have a nice brown marinade. Place steaks into the bag with the marinade, and seal. Refrigerate for 2 to 5 hours, turning over occasionally.\nPreheat an outdoor grill for high heat. When the grill is hot, lightly oil the grate.\nPlace steaks onto the grill and season the tops with salt and pepper to taste. Baste with marinade. Cook for about 5 to 7 minutes, then flip over and salt, pepper and baste again. Grill for about 7 or 8 more minutes, or to desired doneness. Do not flip the steaks again. The internal temperature should be at least 145 degrees F (63 degrees C). Let steaks stand for 5 minutes before cutting, to prevent juices from running out.\nHeat the remaining marinade to a boil in a small saucepan. Use as steak sauce.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "5 h ",
    "i": "2218711.jpg",
    "o": "",
    "st": "allrecipes"
}