{
    "id": 45597,
    "old_rating": "4.64444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds venison tenderloin",
        "1/4 cup vegetable oil",
        "2 teaspoons bacon drippings",
        "3/4 cup all-purpose flour",
        "1 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 egg, lightly beaten",
        "2 tablespoons milk",
        "1 cup dry bread crumbs",
        "1/2 cup crushed buttery round cracker crumbs",
        "2 tablespoons lemon juice"
    ],
    "nut": [
        "Calories > 669 kcal",
        "Carbs > 42.9 g",
        "Cholesterol > 242 mg",
        "Fat > 26.7 g",
        "Protein > 60.4 g",
        "Sodium > 988 mg"
    ],
    "n": "Venison Schnitzel",
    "a": "Clint Wigen",
    "r": "0",
    "s": 4,
    "des": "\"I don't have a clue where my Dad got this particular recipe, but he used to build it during hunting season when we had fresh venison (elk, antelope, mule or whitetail deer), 'hanging and aging'. I still make it when the opportunity presents itself.\"",
    "ins": "Cut tenderloin into 1/2 inch steaks. Slice each steak in half horizontally, from the smallest toward the largest side, until there is only a very small section keeping the two halves connected. Slice a few small scores on the outer edges of each steak to prevent them from curling up when frying.\nPreheat oil and bacon drippings in a large heavy skillet over medium high heat. In a large shallow dish, combine flour, salt and pepper. In a separate shallow bowl, beat together egg and milk. In another shallow dish, combine bread crumbs and cracker crumbs.\nDredge the steaks in the seasoned flour, and using a meat mallet, pound them down to just slightly less than their 1/4 inch thickness. Dip the steaks in the egg mixture, then coat each steak on both sides with the crumbs. Set aside on a clean plate. When all steaks are evenly coated, place prepared steaks gently in a single layer into the hot oil.\nFry steaks for 2 to 3 minutes on each side, or until golden brown. Drain on paper towels. Sprinkle each steak lightly with lemon juice.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "3548132.jpg",
    "o": "",
    "st": "allrecipes"
}