{
    "id": 45641,
    "old_rating": "4.82721",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup fresh bread crumbs",
        "2 tablespoons minced garlic",
        "2 tablespoons chopped fresh rosemary",
        "1 teaspoon salt",
        "1/4 teaspoon black pepper",
        "2 tablespoons olive oil",
        "1 (7 bone) rack of lamb, trimmed and frenched",
        "1 teaspoon salt",
        "1 teaspoon black pepper",
        "2 tablespoons olive oil",
        "1 tablespoon Dijon mustard"
    ],
    "nut": [
        "Calories > 481 kcal",
        "Carbs > 5.6 g",
        "Cholesterol > 94 mg",
        "Fat > 40.8 g",
        "Protein > 22.2 g",
        "Sodium > 1369 mg"
    ],
    "n": "Roasted Rack of Lamb",
    "a": "JENNINE1980",
    "r": "0",
    "s": 4,
    "des": "\"I have had this recipe for a long time, and always enjoy making it.  You can also do the same thing with beef or pork.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C). Move oven rack to  the center position.\nIn a large bowl, combine bread crumbs, garlic, rosemary, 1 teaspoon salt and 1/4 teaspoon pepper. Toss in 2 tablespoons olive oil to moisten mixture. Set aside.\nSeason the rack all over with salt and pepper. Heat 2 tablespoons olive oil in a large heavy oven proof skillet over high heat. Sear rack of lamb for 1 to 2 minutes on all sides. Set aside for a few minutes. Brush rack of lamb with the mustard. Roll in the bread crumb mixture until evenly coated. Cover the ends of the bones with foil to prevent charring.\nArrange the rack bone side down in the skillet. Roast the lamb in preheated oven for 12 to 18 minutes, depending on the degree of doneness you want. With a meat thermometer, take a reading in the center of the meat after 10 to 12 minutes and remove the meat, or let it cook longer, to your taste. Let it rest for 5 to 7 minutes, loosely covered, before carving between the ribs.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "4527636.jpg",
    "o": "4527636.jpg,4526127.jpg,4522326.jpg,4509390.jpg,4508747.jpg,4489170.jpg",
    "st": "allrecipes"
}