{
    "id": 46114,
    "old_rating": "3.1",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "3 ancho chiles, stemmed and seeded",
        "4 cloves unpeeled garlic",
        "2 eggs",
        "2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1 bunch chopped fresh cilantro",
        "3 tomatillos, husked and chopped",
        "1/2 jalapeno pepper, seeded and chopped",
        "1/2 cup cream cheese, softened",
        "1/2 cup sour cream",
        "1/4 cup chicken stock",
        "1 tablespoon olive oil",
        "1/2 teaspoon ground cumin",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 540 kcal",
        "Carbs > 59.7 g",
        "Cholesterol > 138 mg",
        "Fat > 27.5 g",
        "Protein > 15.1 g",
        "Sodium > 484 mg"
    ],
    "n": "Ancho Chile Fettuccini with Cilantro-Tomatillo Cream Sauce",
    "a": "Bryce Fegley",
    "r": "0",
    "s": 4,
    "des": "\"Rather than make fettuccine colored with spinach or tomatoes, I wanted to create something with color AND flare. Here is my idea. Try serving with grilled skewered chicken and mushrooms, marinated with lime, garlic, cumin, salt and pepper.\"",
    "ins": "Heat 1 tablespoon olive oil in a skillet over medium high heat. Roast ancho chiles and 4 cloves unpeeled garlic. Press the chiles flat against the pan with a spatula until they begin to pop and smoke, then flip. When done, rehydrate chiles in a bowl of warm water for 30 minutes. Turn garlic until all sides are browned, about 15 minutes. Allow to cool, then peel.\nIn a blender or food processor, combine chiles, 2 cloves roasted garlic, and eggs. Blend until smooth. Place the flour in a mound on a clean surface. Stir in 1/2 teaspoon salt with a fork, then make a well in the center. Pour in egg mixture. Working from the center outward, gradually incorporate the flour with a fork until dough is formed. Knead dough for 5 minutes, adding more flour if necessary. Prepare fettuccini according to your pasta machine's instructions. Lay the fettuccine flat on lightly floured surface for 15 minutes.\nIn a blender or food processor, combine 2 remaining cloves roasted garlic, cilantro, tomatillos, jalapeno, cream cheese, sour cream, chicken stock, 1 tablespoon olive oil, cumin, salt and pepper. Blend until smooth. Pour into a saucepan over low heat, and cook until heated through.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 2 to 3 minutes, or until pasta rises to the surface. Drain, and divide into serving portions; pour sauce over top.",
    "pt": "45 m",
    "ct": "15 m",
    "tt": "1 h",
    "i": "4461861.jpg",
    "o": "",
    "st": "allrecipes"
}