{
    "id": 46286,
    "old_rating": "2.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 pounds small pickling cucumbers, cut into slices or chunks",
        "8 cups pearl onions, peeled",
        "1 head cauliflower, broken into florets",
        "4 red bell peppers, seeded and chopped",
        "1 cup coarse salt",
        "2 cups water",
        "1 cup all-purpose flour",
        "6 tablespoons dry mustard powder",
        "1 1/2 cups white sugar",
        "1 tablespoon ground dried turmeric",
        "8 cups apple cider vinegar"
    ],
    "nut": [
        "Calories > 93 kcal",
        "Carbs > 18.8 g",
        "Cholesterol > 0 mg",
        "Fat > 0.6 g",
        "Protein > 1.8 g",
        "Sodium > 2292 mg"
    ],
    "n": "Grandmother's Mustard Pickles",
    "a": "SWIZZLESTICKS",
    "r": "0",
    "s": 40,
    "des": "\"My grandmother used to make these many years ago and all of us looked forward to dinner at her home where she would serve them. She is now 98 years old and it is up to her grand daughters to make them for her.\"",
    "ins": "In a large bowl, combine the cucumbers, onions, cauliflower and bell pepper. Stir together the salt and water; pour over the vegetables. Cover, and let stand overnight at room temperature.\nSterilize 5 (1 quart) jars with lids and rings. Keep in a hot water bath until needed.\nTransfer the vegetables and brine to a large pot and set over medium heat. Bring just to a simmer, but remove from the heat before they come to a boil. Pour into a colander and drain thoroughly.\nDry out the large pot and stir together the flour, mustard powder, sugar and turmeric in it. Stir in just enough apple cider vinegar to make a smooth paste, then stir in the remaining vinegar. Bring to a boil, stirring frequently, and boil until thick and creamy, 10 to 15 minutes. Add the vegetables and simmer over medium heat until vegetables are tender but not overcooked, 5 to 10 minutes.\nPack into hot 1 quart jars, filling to 1/2 inch of the rim. Seal with lids and rings. Process in a bath of simmering water for 10 minutes, then cool to room temperature. Refrigerate any jars that do not seal properly and consume within two weeks.",
    "pt": "1 h",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "964032.jpg",
    "o": "",
    "st": "allrecipes"
}