{
    "id": 46302,
    "old_rating": "4.11538",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound boneless, skinless chicken breast halves",
        "1 pound boneless pork sirloin, cut into 1/2 inch cubes",
        "1/2 head cabbage",
        "4 carrots, diced",
        "1/2 teaspoon salt, or to taste",
        "1/2 teaspoon ground black pepper, or to taste",
        "2 pinches monosodium glutamate (MSG) (optional)",
        "1/8 cup all-purpose flour",
        "1/8 cup water",
        "30 spring roll wrappers",
        "1 quart oil for frying",
        "1 (8 ounce) package dry pancit (Canton) noodles",
        "1 cup apple cider vinegar",
        "4 cloves chopped garlic"
    ],
    "nut": [
        "Calories > 349 kcal",
        "Carbs > 38.7 g",
        "Cholesterol > 45 mg",
        "Fat > 12 g",
        "Protein > 21.9 g",
        "Sodium > 346 mg"
    ],
    "n": "Grandma Nena's Lumpia and Pancit",
    "a": "LANIBIRD",
    "r": "0",
    "s": 10,
    "des": "\"This is my grandma's lumpia and pancit that she has been making since before the family moved to the U.S. when my dad was a child. This is very popular with both family and friends. As soon as my friends in high school discovered my grandma was in town, my house became THE place for lunch! She serves her lumpia with a garlic and vinegar dipping sauce.  It's very pungent, but oh so tasty. You can make a large batch of the lumpia and freeze it, so you can fry up some when ever you crave it! Spring roll wrappers are the best to use, they are thinner and lighter than egg roll wrappers.\"",
    "ins": "Bring 2 quarts of water of  water to a boil in a saucepan. Add chicken, and cook for 10 to 15 minutes, or until done. Reserve chicken stock, and allow chicken to cool. Cut chicken into small cubes.\nIn a large skillet or wok, saute pork until evenly brown. Stir in chicken, cabbage, and carrots. Cook over medium heat until cabbage is tender. Remove from heat, and allow to cool slightly while you separate the wrappers.\nIn small bowl, combine enough flour and water to make a paste about the consistency of glue. Spoon meat mixture into a thin line on each wrapper, and roll up, using a dab of the flour paste to seal the edge. Keep each lumpia thin; if you over fill them, the wrapper will tear. Save about 1/2 to 1/4 of the filling in the pot for the pancit.\nHeat large skillet with 1/2 to 1 inch of oil. Fry the lumpia one side at a time, until a nice golden brown. Drain, standing each piece upright, in a pot or bowl lined with paper towel.\nReturn the remainder of the filling to the stove, and gently mix in the pancit noodles. Gradually add the chicken stock, and cook until noodles are tender.\nFor the sauce:  With a mortar and pestle or back of a spoon, crush the garlic, then mix into the vinegar. Serve in small bowls with spoons. The sauce can be used as a dip, or to spoon into the lumpia.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "1119338.jpg",
    "o": "",
    "st": "allrecipes"
}