{
    "id": 46627,
    "old_rating": "4.224",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "1/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "2 tablespoons shortening",
        "1 cup ice water",
        "1 (4 pound) whole chicken, cut into 8 pieces",
        "1 tablespoon seasoning salt, or to taste",
        "3 1/2 quarts water",
        "1/2 small onion, chopped",
        "2 stalks celery, chopped",
        "1/4 cup margarine",
        "salt and pepper to taste",
        "1 teaspoon poultry seasoning"
    ],
    "nut": [
        "Calories > 990 kcal",
        "Carbs > 49.4 g",
        "Cholesterol > 227 mg",
        "Fat > 58 g",
        "Protein > 63.1 g",
        "Sodium > 936 mg"
    ],
    "n": "D' Best Chicken N' Dumplings",
    "a": "SIS T",
    "r": "0",
    "s": 6,
    "des": "\"This is the best recipe for OLD TIME TASTE, DOWN HOME COOKING chicken and dumplings. For some of us that like getting our hands dirty when cooking, you will love this recipe. Old fashioned, hands on experience. This recipe won a blue ribbon and 500 dollars in a cooking contest. I hope you enjoy it.\"",
    "ins": "In a large bowl, sift flour, baking soda and salt. Cut in shortening until mixture resembles coarse crumbs. Stir in water until mixture forms a ball. Divide dough in half and shape into balls. Wrap in plastic and refrigerate for 2 hours or overnight.\nRemove the skin from the breast, thigh and back of the chicken, but leave it on the legs and wings. Season chicken with seasoning salt, and place in a large stock pot. Pour in water. Add onion, celery and margarine. Bring to a boil, then reduce heat to simmer. Cook for about 1 1/2 hours, until chicken falls off the bone.\nOn a lightly floured surface, roll one ball of dough to about 1/8 inch thick. Cut into 2 inch squares. Drop into simmering broth, and let cook for about 2 minutes. Stir gently to prevent sticking; add more water if needed. Season broth while dumplings are cooking with salt, pepper and poultry seasoning. Simmer for about 15 minutes, or until dumplings are cooked through.",
    "pt": "25 m",
    "ct": "2 h",
    "tt": "4 h ",
    "i": "922443.jpg",
    "o": "1231886.jpg,1231865.jpg,1104184.jpg,1082426.jpg,1069657.jpg,279865.jpg",
    "st": "allrecipes"
}