{
    "id": 46978,
    "old_rating": "4.30769",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup all-purpose flour",
        "1/2 cup butter, melted",
        "1 tablespoon white sugar",
        "1 cup brown sugar",
        "2 tablespoons all-purpose flour",
        "1 teaspoon baking powder",
        "2 eggs, beaten",
        "1 teaspoon vanilla extract",
        "2/3 cup chopped walnuts",
        "1 cup flaked coconut",
        "1/2 cup chopped maraschino cherries",
        "3 tablespoons butter, softened",
        "1 cup confectioners' sugar",
        "1 tablespoon boiling water",
        "1 tablespoon milk",
        "1/2 teaspoon almond extract",
        "1/2 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 131 kcal",
        "Carbs > 17.2 g",
        "Cholesterol > 22 mg",
        "Fat > 6.6 g",
        "Protein > 1.4 g",
        "Sodium > 53 mg"
    ],
    "n": "Romance Bars",
    "a": "Jeri",
    "r": "0",
    "s": 32,
    "des": "\"Chewy bar cookies with coconut, walnuts and maraschino cherries. This recipe was passed on to me by my mother-in-law.  They are a Christmas tradition in our family, but I think they're perfect for Valentine's Day.\"",
    "ins": "Preheat the oven to 300 degrees F (150 degrees C). In a medium bowl, mix together 1 cup flour and 1 tablespoon white sugar. Stir in melted butter. Spread thinly over the bottom of a 9x13 inch pan.\nBake for 20 minutes in the preheated oven, or until firm. In a medium bowl, stir together the brown sugar , 2 tablespoons flour, and baking powder. Mix in the eggs and 1 teaspoon vanilla until well blended. Stir in the walnuts, coconut and maraschino cherries. Pour the mixture over the prepared crust.\nBake for 20 to 25 minutes in the preheated oven, until the top is light brown. Cool completely before frosting. To make the frosting, mix together 3 tablespoons butter and confectioners' sugar. Beat in water, milk, almond extract and vanilla extract until smooth. Spread over cooled bars. Let stand until firm, then slice into squares.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "3054384.jpg",
    "o": "",
    "st": "allrecipes"
}