{
    "id": 47105,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/2 tablespoons garlic powder",
        "1 1/2 tablespoons white pepper",
        "1 1/2 tablespoons seasoned salt",
        "1 tablespoon onion salt",
        "1 teaspoon dried oregano",
        "4 pounds pork spareribs",
        "1/2 cup distilled white vinegar",
        "12 (12 fluid ounce) cans or bottles premium lager",
        "1 (20 ounce) bottle ketchup",
        "1 (10 fluid ounce) bottle Worcestershire sauce",
        "1 1/2 cups maple syrup",
        "1 cup brown sugar",
        "1 cup liquid smoke flavoring",
        "1/2 cup margarine",
        "1/2 cup apple cider vinegar",
        "1/2 cup honey mustard"
    ],
    "nut": [],
    "n": "Drunken Ribs",
    "a": "CHEF BOOZER",
    "r": "0",
    "s": 8,
    "des": "\"This recipe is one my favorites, it is one I found one day when I was experimenting. My family and friends enjoyed it and I hope you will too!\"",
    "ins": "In a medium bowl, mix garlic powder, white pepper, seasoned salt, onion salt, and oregano.\nPlace ribs in a large roasting pan, and rub evenly with the garlic powder mixture to coat. Pour distilled white vinegar and 1/2 the beer, or enough to cover ribs, into the pan. Cover pan, and marinate ribs in the refrigerator 8 hours, or overnight.\nPrepare an outdoor grill for indirect, medium heat, and lightly oil grate.\nIn a large saucepan, whisk together remaining beer, ketchup, Worcestershire sauce, maple syrup, brown sugar, liquid smoke, margarine, apple cider vinegar, and honey mustard. Bring to boil. Cover, reduce heat, and simmer 15 minutes, or until a thick sauce has formed.\nRemove ribs from the marinade mixture, and coat liberally with the sauce. Place on the prepared grill, and cook 1 1/2 to 2 hours, to an internal temperature of 160 degrees F (70 degrees C). Brush frequently with the sauce while cooking.",
    "pt": "30 m",
    "ct": "2 h",
    "tt": "10 h ",
    "i": "421830.jpg",
    "o": "",
    "st": "allrecipes"
}