{
    "id": 47586,
    "old_rating": "4.22222",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/3 cup seasoned dry bread crumbs",
        "1 teaspoon paprika",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness",
        "1 tablespoon butter",
        "1 cup cola-flavored carbonated beverage",
        "3 ounces thinly sliced fully cooked ham",
        "1 cup sliced fresh mushrooms",
        "1/2 cup cooking sherry",
        "1 tablespoon balsamic vinegar",
        "1/2 cup sour cream"
    ],
    "nut": [
        "Calories > 373 kcal",
        "Carbs > 21.7 g",
        "Cholesterol > 101 mg",
        "Fat > 15 g",
        "Protein > 34.1 g",
        "Sodium > 1032 mg"
    ],
    "n": "Chicken Catch a Cola",
    "a": "Benjamin Lankheet",
    "r": "0",
    "s": 4,
    "des": "\"The idea of using a Cola beverage came to me after fixing 'Red eye gravy' that uses coffee for flavor.  Here you get the cola flavor with a little sweetness. You will be very pleasantly surprised by the great flavor of this dish.  Yum Yum.\"",
    "ins": "Combine the bread crumbs, paprika, salt, and pepper in a plastic bag. Place chicken breasts in the bag, and shake to coat.\nMelt butter in a large skillet over medium heat. Add chicken breasts, and cook for 4 minutes on each side, or until brown. Remove chicken to a plate, and keep warm. Pour the cola into the skillet, and stir to remove any browned chicken bits from the pan. Add ham, mushrooms, sherry, and balsamic vinegar. Reduce heat to medium-low, and simmer, uncovered, until the liquid has reduced by 1/2.\nStir sour cream into the skillet, and return chicken breasts to the pan. Cover, and simmer for 5 more minutes, or until chicken is no longer pink, or the internal temperature is 170 degrees F (75 degrees C). Remove chicken to serving plates, and spoon sauce over.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}