{
    "id": 47705,
    "old_rating": "4.52727",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (3 pound) whole chicken",
        "1 onion, chopped",
        "1 stalk celery, with leaves",
        "1 tablespoon poultry seasoning",
        "1 teaspoon whole allspice",
        "1 teaspoon dried basil",
        "1/2 teaspoon salt",
        "1 teaspoon black pepper",
        "1 teaspoon seasoning salt",
        "1 (10.75 ounce) can condensed cream of chicken soup (optional)",
        "DUMPLINGS:",
        "4 eggs",
        "2 tablespoons olive oil",
        "1 tablespoon salt",
        "1 teaspoon black pepper",
        "2 cups water",
        "4 cups all-purpose flour"
    ],
    "nut": [
        "Calories > 704 kcal",
        "Carbs > 53.1 g",
        "Cholesterol > 224 mg",
        "Fat > 34.4 g",
        "Protein > 42.5 g",
        "Sodium > 1542 mg"
    ],
    "n": "Polish Chicken and Dumplings",
    "a": "SLOEFINGER",
    "r": "0",
    "s": 8,
    "des": "\"This is an old family recipe for the dumplings, which were originally Polish egg noodles (kluski), and over the years I have modified it to make homemade dumplings.\"",
    "ins": "Place chicken, onion, and celery in a large pot, and then fill pot with water.  Season with poultry seasoning, whole allspice, basil, 1/2 teaspoon salt, 1 teaspoon pepper, and seasoning salt. Bring to a boil. Reduce heat, and simmer for approximately 2 hours, or until chicken is done.\nRemove chicken from broth, and strain broth to remove seasonings and any bone. Return broth to pan, stir in cream of chicken soup, and continue simmering. Set chicken aside to cool.\nIn a medium bowl, stir together eggs, olive oil, 1 tablespoon salt, and 1 teaspoon pepper with 2 cups water. Gradually add flour, and stir until thick.\nUsing a large spoon and knife, scoop a spoonful of the dough and cut small pieces into the broth. Repeat until all the dough has been used. Stir, cover, and simmer for about 15 minutes.\nMeanwhile, skin and debone the chicken. Cut the meat into small pieces, add to the broth, and heat through.  Serve.",
    "pt": "30 m",
    "ct": "3 h",
    "tt": "3 h ",
    "i": "2482946.jpg",
    "o": "4528290.jpg,4457846.jpg,4428132.jpg,4015385.jpg,2123812.jpg,860785.jpg",
    "st": "allrecipes"
}