{
    "id": 48765,
    "old_rating": "3.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 whole artichokes",
        "1 cup Italian seasoned bread crumbs",
        "4 ounces provolone cheese, shredded",
        "10 pimento-stuffed green olives, chopped",
        "1/2 bunch fresh parsley, chopped",
        "5 cloves garlic, minced",
        "1 bunch green onions, finely chopped",
        "2 small stalks celery, finely chopped",
        "1/2 green bell pepper, finely chopped",
        "1 teaspoon lemon juice",
        "1 teaspoon hot pepper sauce (e.g. Tabascoâ„¢)",
        "4 (2 ounce) cans anchovy fillets, chopped",
        "1 teaspoon Worcestershire sauce",
        "1 tablespoon olive oil, or as needed",
        "salt to taste"
    ],
    "nut": [
        "Calories > 229 kcal",
        "Carbs > 28.4 g",
        "Cholesterol > 23 mg",
        "Fat > 7.5 g",
        "Protein > 15.8 g",
        "Sodium > 1238 mg"
    ],
    "n": "New Orleans Stuffed Artichokes",
    "a": "Joan",
    "r": "0",
    "s": 10,
    "des": "\"Robust, rich New Orleans tradition. A favorite recipe that my southern dad created. This recipe takes some time and love, but is very much worth the effort! Make sure you have your teeth in for this one!\"",
    "ins": "Prepare the artichokes by slicing off the bottoms of the stems and trimming the tips of the leaves. It is easiest to use scissors for the leaves. Tear off the small leaves around the base and discard.\nPlace the artichokes into a large pot, and fill with enough water to cover. Place a dinner plate on top of them to keep the artichokes from floating out of the water. Cover with a lid and bring to a boil. Boil for 10 to 15 minutes, or until some of the leaves are floating in the water; drain and cool.\nIn a medium bowl, mix together the bread crumbs, cheese, olives, parsley, garlic, green onions, celery and bell pepper. In a small bowl, stir together the lemon juice, hot pepper sauce, anchovies, Worcestershire sauce, olive oil and salt; stir into the bread crumb mixture.\nTear off one large square of aluminum foil for each artichoke. Place an artichoke in the center of a square and tuck about 1/2 teaspoon of the cheese mixture under each leaf. Bring the foil up around the artichoke leaving the top open.\nPlace a wire rack or steamer insert into the bottom of the large pot. fill with about 3 inches of fresh water, or so that the artichokes remain above water level. Set artichokes in the pot upright and bring to a boil. Cover and let artichokes steam for about 3 hours. Remove from the pot and allow to cool to room temperature before serving.",
    "pt": "45 m",
    "ct": "3 h",
    "tt": "3 h ",
    "i": "689767.jpg",
    "o": "",
    "st": "allrecipes"
}