{
    "id": 48992,
    "old_rating": "3.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 3/4 cups cake flour",
        "3 teaspoons baking powder",
        "1 pinch salt",
        "4 teaspoons instant coffee granules",
        "1/2 cup unsweetened cocoa powder",
        "3/4 cup boiling water",
        "1/2 cup butter or margarine, softened",
        "1 cup white sugar",
        "3 eggs",
        "1 1/2 teaspoons rum",
        "1/4 cup milk",
        "3 cups confectioners' sugar",
        "5 tablespoons unsweetened cocoa powder",
        "2 teaspoons instant coffee granules",
        "1/3 cup boiling water",
        "3 tablespoons butter or margarine, softened",
        "1/2 teaspoon vanilla extract",
        "1/2 teaspoon rum"
    ],
    "nut": [
        "Calories > 468 kcal",
        "Carbs > 80.9 g",
        "Cholesterol > 90 mg",
        "Fat > 15.5 g",
        "Protein > 5.6 g",
        "Sodium > 224 mg"
    ],
    "n": "Rum Mocha Chocolate Cake",
    "a": "VIKIZW",
    "r": "0",
    "s": 10,
    "des": "\"Two layers of chocolate cake, flavored with rum and coffee, with mocha rum frosting in the middle. Serve with whipped cream and cherries.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 - 8 inch pans. Sift together the flour, baking powder, and salt. Set aside. Mix together 4 teaspoons instant coffee, 1/2 cup cocoa powder, and 3/4 cup boiling water; set aside.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time, then stir in 1 1/2 teaspoons rum. Mix the milk into cooled cocoa mixture, then beat into the batter alternately with the flour mixture. Pour batter into prepared pans.\nBake in the preheated oven for 35 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\nTo make Mocha Chocolate Frosting:  Sift together confectioners' sugar and 5 tablespoons cocoa powder; set aside. Dissolve 2 teaspoons instant coffee with 1/3 cup boiling water; set aside. In a medium bowl, cream butter until smooth. Beat in sugar/cocoa mixture. Mix in the vanilla extract and rum. Beat until smooth and creamy. Spread between layers of cooled cake.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "357004.jpg",
    "o": "",
    "st": "allrecipes"
}