{
    "id": 49124,
    "old_rating": "4.30508",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons margarine",
        "1/2 pound andouille sausage, diced",
        "2 skinless, boneless chicken breast halves - cut into strips",
        "3 tablespoons Creole seasoning",
        "1 green bell pepper, seeded and sliced into strips",
        "1 red bell pepper, seeded and sliced into strips",
        "8 ounces fresh mushrooms, sliced",
        "4 green onions, chopped",
        "1 (14.5 ounce) can fat-free chicken broth",
        "1 cup 2% milk",
        "2 teaspoons lemon pepper",
        "2 teaspoons garlic powder",
        "1/4 cup cornstarch",
        "1/2 cup cold water",
        "1 (16 ounce) package linguine pasta"
    ],
    "nut": [
        "Calories > 410 kcal",
        "Carbs > 51.5 g",
        "Cholesterol > 36 mg",
        "Fat > 13.4 g",
        "Protein > 21.6 g",
        "Sodium > 1059 mg"
    ],
    "n": "Andouille and Chicken Creole Pasta",
    "a": "Michelle",
    "r": "0",
    "s": 8,
    "des": "\"SPICY..SPICY..SPICY!!! Hope y'all like it hot, cuz that's how you're gettin'it!! Add some cayenne pepper if you like it even spicier!\"",
    "ins": "Melt the margarine in a large skillet over medium-high heat. Cook sausage and chicken with the Creole seasoning until the meat is about halfway done. Add the mushrooms, green onion, green pepper and red pepper. Saute over medium heat until the mushrooms begin to shrink, about 10 minutes.\nStir in the chicken broth and milk, season with lemon pepper and garlic powder, and reduce the heat to medium-low. (Now is a good time to start boiling water for the pasta.) Mix together the cornstarch and cold water until dissolved - I like to use a coffee mug. Stir into the skillet. Cook, stirring gently, until the sauce returns to a boil. Boil for one minute, then remove from heat and set aside. Serve hot over cooked pasta.\nPlace pasta in a large pot of lightly salted water. Boil for 8 to 10 minutes, or until pasta is al dente. Drain.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "392360.jpg",
    "o": "4478273.jpg,4080607.jpg,3632595.jpg,1437113.jpg,610052.jpg,574884.jpg",
    "st": "allrecipes"
}