{
    "id": 49236,
    "old_rating": "4.44615",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "12 slices bacon, cut in half",
        "2 pounds fresh green beans, trimmed and snapped",
        "1 1/2 medium onions, chopped",
        "6 tablespoons apple cider vinegar",
        "6 tablespoons white sugar",
        "1/2 cup blanched slivered almonds"
    ],
    "nut": [
        "Calories > 315 kcal",
        "Carbs > 21.1 g",
        "Cholesterol > 29 mg",
        "Fat > 22.5 g",
        "Protein > 8.6 g",
        "Sodium > 359 mg"
    ],
    "n": "The Most Delicious Green Beans",
    "a": "Vicki L.",
    "r": "0",
    "s": 8,
    "des": "\"A different twist to the usual green bean casserole. Given to me years ago by my ex-mother-in-law, this is a tasty, fresh, sweet and tangy new way to serve green beans and it's sure to become a family favorite! Prepare the night before and marinate overnight for the best results. Enjoy!\"",
    "ins": "In a large deep skillet, cook bacon over medium-high heat until evenly browned. Remove bacon to paper towels, and reserve drippings in the skillet.\nPlace fresh green beans in a large saucepan, and add enough water to cover the bottom by 1 inch. Cover, and bring to a boil over medium-high heat. Cook for 8 to 10 minutes, until bright green and tender. Drain.\nPlace the green beans into a 2 quart casserole dish. Spread the onions in a layer over the green beans. Place bacon strips in a layer over the onions. Sprinkle almonds over the top. Heat the reserved drippings in the skillet over medium heat. Stir in vinegar and sugar, heating just until sugar is dissolved; drizzle over everything in the dish. Cover, and chill for at least one hour, but overnight is best.\nPreheat the oven to 350 degrees F (175 degrees C). Bake uncovered, for 45 minutes, until the onions are tender, and the almonds are toasted. Check after 30 minutes, and cover if necessary.",
    "pt": "2 h",
    "ct": "45 m",
    "tt": "2 h ",
    "i": "1430836.jpg",
    "o": "",
    "st": "allrecipes"
}