{
    "id": 49497,
    "old_rating": "4.06548",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons unsalted butter",
        "1 (8 ounce) package button mushrooms, chopped",
        "2 cups chicken broth",
        "4 bone-in chicken breast halves, skinless",
        "1 (10 ounce) can artichoke hearts, drained and sliced",
        "1/2 cup unsalted butter",
        "1/2 cup all-purpose flour",
        "1 1/2 cups half-and-half cream",
        "1 cup grated Parmesan cheese",
        "1 teaspoon dried rosemary",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper"
    ],
    "nut": [
        "Calories > 697 kcal",
        "Carbs > 26.4 g",
        "Cholesterol > 195 mg",
        "Fat > 48.1 g",
        "Protein > 41.1 g",
        "Sodium > 1130 mg"
    ],
    "n": "Outstanding Chicken Dinner",
    "a": "HABERFAMILY",
    "r": "0",
    "s": 4,
    "des": "\"An excellent taste for chicken - quick and easy to make! Boneless chicken breasts may also be used. My sister gave me this suggestion, and when I tasted the cream sauce she made for the chicken - WOW - I couldn't wait for the whole meal!  If there are any ingredients that you don't like, such as mushrooms, or artichoke, simply omit them.  It is the sauce that is the stunning aspect - and not the traditional 'canned soup' sauce!!  ENJOY!!\"",
    "ins": "Preheat the oven to 325 degrees F (165 degrees C). Melt 2 tablespoons of butter in a large skillet over medium heat. Saute mushrooms in butter until tender. Remove from the skillet, and set aside.\nPlace the chicken into the skillet, and pour the broth over it. Cover, and simmer over medium heat for 20 minutes, or until the chicken is cooked through. Reserve 1/2 cup of broth from the pan, and discard or save remaining broth for other uses. Remove the chicken to a 9x13 inch baking dish, and top with artichokes.\nMelt the remaining 1/2 cup of butter in a skillet over medium heat, and whisk in flour until smooth. Gradually stir in the 1/2 cup of reserved broth, and half and half cream. Cook, stirring constantly, until thickened, about 5 minutes. Turn off the heat, and stir in the Parmesan cheese, rosemary, salt and pepper. Pour sauce over the chicken in the baking dish. Place sauteed mushrooms on the top.\nBake uncovered for 30 minutes in the preheated oven. Let stand for a few minutes before serving to let the sauce thicken.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "3722010.jpg",
    "o": "554942.jpg,66402.jpg,38176.jpg,38041.jpg,27797.jpg,15840.jpg",
    "st": "allrecipes"
}