{
    "id": 49932,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup dry brown lentils",
        "2 1/2 cups water",
        "1/4 cup milk",
        "1 cup wheat and barley nugget cereal (e.g. Grape-Nutsâ„¢)",
        "1 (1 ounce) envelope dry onion soup mix",
        "1/2 teaspoon poultry seasoning",
        "2 eggs, beaten",
        "1/2 cup chopped walnuts",
        "1 cup seasoned dry bread crumbs",
        "2 tablespoons vegetable oil"
    ],
    "nut": [
        "Calories > 289 kcal",
        "Carbs > 37.8 g",
        "Cholesterol > 47 mg",
        "Fat > 11.1 g",
        "Protein > 12.3 g",
        "Sodium > 683 mg"
    ],
    "n": "Lentil Cakes (Patties)",
    "a": "SUSANNE C. SWISHER",
    "r": "0",
    "s": 8,
    "des": "\"These wonderful patties have undergone several transformations since I first tried them. I have used different soup mixes to season them, and added chopped nuts for texture.  They are tasty with a tomato sauce topping or baked in a mushroom sauce for a fancy dinner.  I like them best fixed up like a hamburger with lettuce, tomato, cheese, mayo, ketchup and alfalfa sprouts on a bun or good home-made bread!\"",
    "ins": "Place lentils and water in a saucepan, and bring to a boil. Cover, reduce heat to low, and simmer until tender, about 30 minutes. Drain.\nIn a large bowl, mix together the cooked lentils, milk, wheat and barley cereal, eggs and walnuts. Season with onion soup mix and poultry seasoning. Mix well using your hands, as the mixture will be very thick. Let stand for 30 minutes, or refrigerate overnight.\nHeat oil in a large skillet over medium heat. Use an ice cream scoop to portion out  balls of the lentil mixture. Drop the scoops into bread crumbs, and coat while flattening into patties.  Fry burgers in the hot skillet until nicely browned on both sides, about 5 minutes per side, depending on the thickness of the patties.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "953422.jpg",
    "o": "",
    "st": "allrecipes"
}