{
    "id": 50026,
    "old_rating": "4.52423",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package lasagna noodles",
        "1 pound andouille sausage, quartered lengthwise and sliced",
        "1 pound skinless, boneless chicken breast halves - cut into chunks",
        "2 teaspoons Cajun seasoning",
        "1 teaspoon dried sage",
        "1/2 cup chopped onion",
        "1/2 cup chopped celery",
        "1/4 cup chopped red bell pepper",
        "1 tablespoon finely chopped garlic",
        "2 (10 ounce) containers Alfredo Sauce, divided",
        "1 1/2 cups shredded mozzarella cheese",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 488 kcal",
        "Carbs > 32 g",
        "Cholesterol > 75 mg",
        "Fat > 29 g",
        "Protein > 25.4 g",
        "Sodium > 1045 mg"
    ],
    "n": "Cajun Chicken Lasagna",
    "a": "SAIDANDDUNN",
    "r": "0",
    "s": 12,
    "des": "\"This lasagna has just the right amount of zing to it. The key to this is the andouille sausage...probably not good for anyone counting calories either! The meat mixture would be good served over fettuccine noodles, if you would like to save time\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Bring a large pot of lightly salted water to a boil. Add pasta, and cook for 8 to 10 minutes, or until al dente; drain.\nIn a large skillet over medium-high heat, combine sausage, chicken, Cajun seasoning and sage. Cook until chicken is no longer pink and juices run clear, about 8 minutes. Remove meat from skillet with a slotted spoon, and set aside. Saute onion, celery, bell pepper and garlic until tender. Remove from heat, and stir in cooked meat and one container Alfredo sauce.\nLightly grease a 9x13 inch baking dish. Cover bottom with 4 lasagna noodles. Spread with 1/2 of the meat mixture. Repeat layers, and cover with a layer of noodles. Spread remaining Alfredo sauce over top. Top with mozzarella cheese and sprinkle with Parmesan cheese.\nBake in preheated oven for 1 hour. Let stand 15 minutes before serving.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4499819.jpg",
    "o": "4499819.jpg,4480974.jpg,4465034.jpg,4260637.jpg,2676419.jpg,479338.jpg",
    "st": "allrecipes"
}