{
    "id": 50054,
    "old_rating": "4.62766",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 large cloves garlic, peeled",
        "1 1/2 teaspoons coarse salt",
        "2 tablespoons olive oil",
        "1 tablespoon whole black peppercorns",
        "2 pounds pork tenderloin, cut into 1 inch medallions",
        "2 red bell peppers, julienned",
        "1 cup white wine",
        "2 lemons"
    ],
    "nut": [
        "Calories > 211 kcal",
        "Carbs > 6.7 g",
        "Cholesterol > 74 mg",
        "Fat > 7.6 g",
        "Protein > 24.3 g",
        "Sodium > 423 mg"
    ],
    "n": "Portuguese Pork with Red Peppers",
    "a": "Stuart Miller",
    "r": "0",
    "s": 8,
    "des": "\"One of my favorite flavor combinations ever! This pork dish combines the strength of garlic with the sweetness of red pepper balanced by a tangy lemon garnish.\"",
    "ins": "With a large mortar and pestle, mash the garlic, coarse salt, 1 tablespoon olive oil, and peppercorns into a fine paste. Transfer to a large bowl.\nWith a mallet, flatten the pork medallions to 1/4 inch thick. Place in the bowl with the garlic mixture, tossing to coat. Cover, and marinate 2 to 4 hours in the refrigerator.\nHeat the remaining oil in a large skillet over high heat. Stir in the pork and remaining garlic mixture. Quickly brown pork about 1 minute on each side. Remove from heat, and set aside.\nPlace red peppers into the skillet, and saute 2 to 5 minutes, until tender but firm. Pour white wine into the skillet, and scrape up the browned bits. Reduce heat to low, return pork to skillet, and continue cooking 10 to 15 minutes, to an internal temperature of 180 degrees F (80 degrees C).\nSlice 1 1/2 lemons into thin rounds. Transfer the pork and pepper mixture to a serving platter. Squeeze juice of remaining 1/2 lemon over the pork and peppers, and garnish with the lemon rounds.",
    "pt": "35 m",
    "ct": "25 m",
    "tt": "3 h",
    "i": "572788.jpg",
    "o": "3680890.jpg,2650641.jpg,2151299.jpg,1698141.jpg,1002408.jpg,910823.jpg",
    "st": "allrecipes"
}