{
    "id": 50331,
    "old_rating": "4.17699",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup butter, softened",
        "1/8 teaspoon garlic powder",
        "1 tablespoon chopped fresh parsley",
        "5 cups honey-sweetened corn flake cereal",
        "3 tablespoons chopped fresh parsley",
        "1 1/2 teaspoons garlic powder",
        "1 teaspoon paprika",
        "1 teaspoon salt",
        "6 skinless, boneless chicken breast halves - pounded to 1/4 inch thickness",
        "1/4 cup buttermilk"
    ],
    "nut": [
        "Calories > 331 kcal",
        "Carbs > 30.9 g",
        "Cholesterol > 89 mg",
        "Fat > 9.6 g",
        "Protein > 29.8 g",
        "Sodium > 821 mg"
    ],
    "n": "Delicious Baked Chicken Kiev",
    "a": "Jessica",
    "r": "0",
    "s": 6,
    "des": "\"This is the BEST! I was raised on this, and it is the best chicken Kiev you'll ever have. After you make it a few times it's a snap. I do this by memory. You can adjust the flavors to taste. This recipe tastes great as leftovers also!\"",
    "ins": "In a small bowl, stir together the butter, 1/8 teaspoon garlic powder, and 1 tablespoon of parsley. Spread the butter mixture 1/2 inch thick onto a piece of aluminum foil, and place in the freezer to harden.\nPlace the cereal in a large plastic resealable bag, and crush with a rolling pin. Add the remaining parsley, 1 1/2 teaspoons garlic powder, paprika and salt, seal the bag, and shake to mix.\nPreheat the oven to 375 degrees F (190 degrees C). Grease a 9x13 inch baking dish.\nRemove the slab of butter mixture from the freezer, and slice into 6 strips. Place one strip onto the center of each pounded chicken breast, roll up and secure with toothpicks. Dip rolled chicken breasts into buttermilk, then into the cereal mixture. Place coated breasts into the prepared baking dish.\nBake, uncovered, for 30 to 40 minutes until chicken is no longer pink, and the juices run clear. The outside should be crispy and golden.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "27377.jpg",
    "o": "",
    "st": "allrecipes"
}