{
    "id": 50523,
    "old_rating": "4.72688",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound thick sliced bacon",
        "1 (10 ounce) package frozen chopped spinach, thawed",
        "1 (8 ounce) container sour cream",
        "salt and pepper to taste",
        "2 (9 inch) unbaked pie crusts",
        "2 tablespoons olive oil",
        "1 onion, finely diced",
        "1/2 pound fresh mushrooms, finely diced",
        "2 cups finely diced smoked ham",
        "8 ounces Monterey Jack cheese, shredded",
        "8 ounces Cheddar cheese, shredded",
        "4 ounces Parmesan cheese, grated",
        "8 eggs",
        "1 1/2 cups half-and-half cream",
        "1 tablespoon dried parsley",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 444 kcal",
        "Carbs > 14.6 g",
        "Cholesterol > 156 mg",
        "Fat > 33.6 g",
        "Protein > 21.5 g",
        "Sodium > 1078 mg"
    ],
    "n": "Clark's Quiche",
    "a": "Clark Hamblen",
    "r": "0",
    "s": 16,
    "des": "\"This recipe is excellent served for breakfast with fruit or at lunch or dinnertime with a salad. This recipe makes two 9 inch pies. The reason for this is because if you only make one you will hate yourself the next day when there are no leftovers. The quiche microwaves well the next day. In fact most people say that the flavors have blended better on the second day... If in the strange case that you are filled up with one pie, this is a great gift to give a friend or relative, or if you are stingy...it freezes well with tin foil.\"",
    "ins": "Preheat oven to 375  degrees F (190 degrees C). Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble, and set aside. Cook spinach according to package instructions. Allow to cool, then squeeze dry.\nHeat olive oil in skillet over medium heat. Saute onions until soft and translucent. Stir in mushrooms, and cook for 2 minutes, or until soft. Stir in ham and cooked bacon. Remove from heat.\nIn a large bowl, combine spinach, sour cream, salt and pepper. Divide, and spread into pie crusts. Layer with bacon mixture. Mix together Monterey Jack, Cheddar and Parmesan, and sprinkle over pies. Whisk together eggs, half-and-half and parsley. Season with salt and pepper, and pour over pies.\nPlace pies on baking sheet, and bake on middle shelf  in preheated oven for 40 minutes. The top will be puffed and golden brown. Remove from oven, and let stand for 5 to 10 minutes.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4534609.jpg",
    "o": "4534609.jpg,4529368.jpg,4520586.jpg,4478118.jpg,4467701.jpg,4465468.jpg",
    "st": "allrecipes"
}