{
    "id": 50747,
    "old_rating": "4.67742",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 ounce dried wood ear mushrooms",
        "4 dried shiitake mushrooms",
        "12 dried tiger lily buds",
        "2 cups hot water",
        "1/3 ounce bamboo fungus",
        "3 tablespoons soy sauce",
        "5 tablespoons rice vinegar",
        "1/4 cup cornstarch",
        "1 (8 ounce) container firm tofu, cut into 1/4 inch strips",
        "1 quart vegetable broth",
        "1/4 teaspoon crushed red pepper flakes",
        "1/2 teaspoon ground black pepper",
        "3/4 teaspoon ground white pepper",
        "1/2 tablespoon chili oil",
        "1/2 tablespoon sesame oil",
        "1 green onion, sliced",
        "1 cup Chinese dried mushrooms"
    ],
    "nut": [
        "Calories > 238 kcal",
        "Carbs > 31.3 g",
        "Cholesterol > 0 mg",
        "Fat > 8.8 g",
        "Protein > 12.8 g",
        "Sodium > 1152 mg"
    ],
    "n": "Vegan Hot and Sour Soup",
    "a": "Red West",
    "r": "0",
    "s": 4,
    "des": "\"Vegan version of the Asian restaurant staple. This soup has been a favorite at KZSU barbeques, and will be sure to please crowds at any potlatch. Any extra peas and peppers you may have will go well in this soup. Add near the end if you want to keep their crunch.\"",
    "ins": "In a small bowl, place wood mushrooms, shiitake mushrooms, and lily buds in 1 1/2 cups hot water. Soak 20 minutes, until rehydrated. Drain, reserving liquid. Trim stems from the mushrooms, and cut into thin strips. Cut the lily buds in half.\nIn a separate small bowl, soak bamboo fungus in 1/4 cup lightly salted hot water. Soak about 20 minutes, until rehydrated. Drain, and mince.\nIn a third small bowl, blend soy sauce, rice vinegar, and 1 tablespoon cornstarch. Place 1/2 the tofu strips into the mixture.\nIn a medium saucepan, mix the reserved mushroom and lily bud liquid with the vegetable broth. Bring to a boil, and stir in the wood mushrooms, shiitake mushrooms, and lily buds. Reduce heat, and simmer 3 to 5 minutes. Season with red pepper, black pepper, and white pepper.\nIn a small bowl, mix remaining cornstarch and remaining water. Stir into the broth mixture until thickened.\nMix soy sauce mixture and remaining tofu strips into the saucepan. Return to boil, and stir in the bamboo fungus, chili oil, and sesame oil. Garnish with green onion to serve.",
    "pt": "45 m",
    "ct": "15 m",
    "tt": "1 h",
    "i": "581373.jpg",
    "o": "",
    "st": "allrecipes"
}