{
    "id": 50785,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) can fat-free refried beans",
        "1 (10 ounce) can red enchilada sauce",
        "1 tablespoon cocoa powder",
        "1 tablespoon molasses",
        "cooking spray",
        "2 heads broccoli, chopped",
        "1 white onion, diced",
        "1 red bell pepper, seeded and diced",
        "1 poblano pepper, seeded and diced",
        "1 jalapeno pepper, seeded and diced",
        "salt and ground black pepper to taste",
        "2 cups shredded pepperjack cheese, divided",
        "8 whole-wheat tortillas",
        "1/2 cup shredded reduced-fat Cheddar cheese"
    ],
    "nut": [
        "Calories > 380 kcal",
        "Carbs > 47.3 g",
        "Cholesterol > 50 mg",
        "Fat > 16.7 g",
        "Protein > 18.8 g",
        "Sodium > 775 mg"
    ],
    "n": "QOB Veggie Enchiladas",
    "a": "J. Stewart",
    "r": "0",
    "s": 8,
    "des": "\"Delicious and filling veggie enchiladas inspired by my dad! His recipe used mole sauce, which I can't buy where I live, so I came up with a tasty alternative. Serve hot with Spanish rice and cilantro garnish.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nCombine refried beans, enchilada sauce, cocoa powder, and molasses in a saucepan over low heat; stirring occasionally, simmer until hot, about 5 minutes.\nCoat a large non-stick skillet with cooking spray and place over medium-high heat. Cook and stir broccoli, onion, red bell pepper, poblano pepper, and jalapeno pepper until just soft, 5 to 7 minutes. Season with salt and black pepper.\nSpread a thin layer of bean mixture to cover the bottom of a 9x13-inch baking dish.\nSprinkle about 1/4 cup pepperjack cheese across the center of each tortilla and top with about 2/3 cup vegetable mixture. Fold in two small opposite sides of each tortilla and carefully roll the tortillas around the vegetable filling; arrange in a single layer with the seam-side down in the baking dish.\nPour remaining bean mixture evenly over the filled tortillas in the baking dish and spread to cover evenly.\nBake on the center rack of the preheated oven until sauce is bubbling, about 20 minutes. Sprinkle with Cheddar cheese and bake until cheese is melted, about 5 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "2251149.jpg",
    "o": "",
    "st": "allrecipes"
}