{
    "id": 50816,
    "old_rating": "4.40385",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup all-purpose flour",
        "4 boneless, skinless chicken breast halves",
        "salt and pepper to taste",
        "2 tablespoons butter or margarine",
        "1/2 cup dry white wine",
        "1/2 cup fat-free chicken broth",
        "1 tablespoon Dijon mustard",
        "1 zucchini cut in half lengthwise, then sliced diagonally",
        "5 sun-dried tomatoes, chopped",
        "1 clove garlic",
        "1 teaspoon dill weed",
        "1/3 cup fat-free sour cream"
    ],
    "nut": [
        "Calories > 349 kcal",
        "Carbs > 31.5 g",
        "Cholesterol > 79 mg",
        "Fat > 8.6 g",
        "Protein > 29.3 g",
        "Sodium > 399 mg"
    ],
    "n": "Classy Chicken",
    "a": "MONICA DEREGT",
    "r": "0",
    "s": 4,
    "des": "\"An elegant, easy-to-make chicken dish bursting with flavors of sun dried tomatoes and creamy white wine sauce.  My husband calls it the classiest meal I serve because it's exactly like what you order in a fancy restaurant!  Very low in fat and calories, and it only takes 1/2 hour from start to finish.  Pairs nicely with roasted baby potatoes and steamed broccoli.\"",
    "ins": "Place the flour into a shallow dish. Season chicken with salt and pepper, and then dredge in flour. Shake off excess. Heat the butter in a large skillet over medium-high heat. Brown the chicken breasts on each side, about 3 minutes per side.\nPour the chicken broth and white wine into the skillet, and scrape any chicken residue from the pan for flavor. Stir in the mustard. Cover, and cook for a few minutes until chicken is 'springy', but not cooked through. Add the zucchini and sun-dried tomatoes, then season with garlic and dill weed. Cover, and cook until the zucchini is tender and the chicken is cooked through, about 5 to 10 minutes.\nRemove the chicken to a platter, and remove the pan from the heat. Stir sour cream into the pan liquid. If most of the liquid has evaporated, stir in a bit more wine or broth first. Season with salt to taste, and serve chicken with sauce poured over it.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "35 m",
    "i": "42585.jpg",
    "o": "4082255.jpg,1572405.jpg,169354.jpg,139822.jpg,97744.jpg,9061.jpg",
    "st": "allrecipes"
}