{
    "id": 50994,
    "old_rating": "4.75862",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 oatmeal cookies, crushed",
        "2 tablespoons melted butter, divided",
        "2 large apples, peeled, cored and sliced",
        "3 tablespoons white sugar",
        "1 teaspoon ground cinnamon",
        "3 cups whipping cream",
        "1 1/2 cups half and half",
        "1 cup white sugar",
        "3 eggs, beaten",
        "1 teaspoon vanilla extract",
        "2 teaspoons ground cinnamon",
        "1/4 cup chopped toasted walnuts",
        "1/4 cup dulce de leche or caramel ice cream topping"
    ],
    "nut": [
        "Calories > 780 kcal",
        "Carbs > 63.9 g",
        "Cholesterol > 233 mg",
        "Fat > 56 g",
        "Protein > 9.8 g",
        "Sodium > 270 mg"
    ],
    "n": "Apple Pie Ice Cream",
    "a": "RITANASCIMENTO",
    "r": "0",
    "s": 8,
    "des": "\"This cinnamon ice cream is loaded with fried apples, cookie crust, caramel, and walnuts!  You won't believe this ice cream, it's elegant taste is rich and unique.  It's sure to be everyone's favorite!  Eat it as soon as you have mixed it, or keep it in the freezer for later.  If you freeze it, let it thaw about 15 minutes before eating.\"",
    "ins": "Preheat oven to 375  degrees F (190 degrees C).\nMix the crushed cookies with 1 tablespoon of melted butter, and press onto a baking sheet.  Bake in preheated oven for 5 minutes, then remove, allow to cool completely, then crumble.\nMelt the remaining 1 tablespoon of butter in a skillet over medium heat.  Stir in the apples, 3 tablespoons sugar, and 1 teaspoon cinnamon.  Cook until the apples have lightly browned, and the sugar has begun to caramelize, about 10 minutes.  Remove from the pan, and allow to cool completely.\nCombine cream, half and half, 1 cup sugar, eggs, vanilla, and 2 teaspoons of cinnamon in a large bowl; mix to blend well.  Pour into an ice cream maker and freeze according to manufacturer's instructions.\nWhen the ice cream has finished, stir in the crumbled cookie, caramelized apples, and walnuts.  Add the dulce de leche by the teaspoon while stirring to evenly distribute.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "1 h ",
    "i": "124602.jpg",
    "o": "",
    "st": "allrecipes"
}