{
    "id": 51033,
    "old_rating": "4.02679",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "1/2 cup ketchup",
        "1/2 cup bread crumbs",
        "1 teaspoon onion powder",
        "1/2 teaspoon steak seasoning, or to taste",
        "salt and pepper to taste",
        "2 teaspoons vegetable oil",
        "1 large onion, cut into chunks",
        "1 cup ketchup",
        "1/2 cup water, or as needed"
    ],
    "nut": [
        "Calories > 378 kcal",
        "Carbs > 36.1 g",
        "Cholesterol > 69 mg",
        "Fat > 16.6 g",
        "Protein > 22.8 g",
        "Sodium > 1323 mg"
    ],
    "n": "Hamburgers and Ketchup Gravy",
    "a": "krazi4",
    "r": "0",
    "s": 4,
    "des": "\"This is a homestyle dish handed down from my grandmother to my mother to me. It's very simple but tastes out of this world; it's my husband's favorite dinner! The secret is the simmering. When the gravy simmers for a while, the flavors blend to make a thick sweet gravy. Serve with noodles and biscuits.\"",
    "ins": "In a medium bowl, mix together the ground beef, 1/2 cup ketchup, bread crumbs, onion powder, steak seasoning, salt, and pepper. Form into small fat hamburger patties, or meatballs.\nHeat oil in a large heavy skillet over medium-high heat. Place the patties in the skillet, and cook until browned on both sides. Remove patties to a plate, and drain grease from the skillet.\nIn the same pan, slowly stir together the remaining ketchup and water if the mixture seems thin, add a bit more ketchup, or if it is thick, add more water. Add the onion, and bring to a boil. Reduce heat to medium-low. Return the patties to the pan, cover, and simmer for 30 minutes. Stir after the 30 minutes, and if the gravy is still thin, continue simmering with the lid off until gravy thickens.",
    "pt": "10 m",
    "ct": "45 m",
    "tt": "55 m",
    "i": "1688.jpg",
    "o": "",
    "st": "allrecipes"
}