{
    "id": 51238,
    "old_rating": "4.09677",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup plain nonfat yogurt",
        "4 tablespoons chopped green onions",
        "2 chipotle peppers",
        "4 tablespoons peanut butter",
        "1/4 teaspoon salt",
        "1 pound skinless, boneless chicken breast halves - cut into 1/2 inch strips",
        "1/2 teaspoon salt",
        "1/2 teaspoon pepper",
        "1/2 teaspoon chili powder",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon ground cumin",
        "3 tablespoons vegetable oil, divided",
        "1 medium onion, sliced",
        "1 red bell pepper, julienned",
        "4 (6-inch) pitas",
        "1 cup shredded lettuce",
        "1 cup shredded white Cheddar cheese"
    ],
    "nut": [
        "Calories > 647 kcal",
        "Carbs > 48.2 g",
        "Cholesterol > 97 mg",
        "Fat > 30.3 g",
        "Protein > 46.3 g",
        "Sodium > 1155 mg"
    ],
    "n": "Southwestern Chicken Pitas with Chipotle Sauce",
    "a": "L810C",
    "r": "0",
    "s": 4,
    "des": "\"This is a quick, great tasting sandwich that's a little spicy. This spice mixture is similar to the (great) Philly Steak Sandwich recipe submitted by Wendy L, but modified for the Southwestern flavor. The sauce is best prepared before hand to let flavors blend.\"",
    "ins": "In a blender or food processor, combine yogurt, chopped green onion, chipotle peppers, peanut butter, and 1/4 teaspoon salt. Blend until smooth. Place in a sealed container, and refrigerate.\nPreheat oven to 350 degrees F (175 degrees C).\nPlace chicken in a large bowl. Mix together 1/2 teaspoon salt, pepper, chili powder, oregano, and cumin; sprinkle over chicken. Heat half of oil in a skillet over medium heat. Saute onions and red peppers until tender; transfer to a plate, and set aside. Wrap pitas in foil, and place in oven for about 10 minutes.\nHeat remaining oil in skillet, and saute chicken until no longer pink. Add the onions and red peppers, and cook for 2 more minutes.\nCut pitas in half, and stuff with chicken mixture. Serve with lettuce, cheese, and chipotle sauce.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "358903.jpg",
    "o": "",
    "st": "allrecipes"
}