{
    "id": 52025,
    "old_rating": "3.09091",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 pounds zucchini, cubed",
        "5 tablespoons unsalted butter, divided",
        "1 large onion, chopped",
        "4 garlic cloves, minced",
        "2 eggs, beaten",
        "1/2 cup freshly grated Parmesan cheese",
        "1/2 cup fresh white bread crumbs",
        "1/4 cup chopped fresh basil leaves, packed",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 229 kcal",
        "Carbs > 16.8 g",
        "Cholesterol > 79 mg",
        "Fat > 14.9 g",
        "Protein > 9.5 g",
        "Sodium > 227 mg"
    ],
    "n": "Zucchini Parmesan Appetizer",
    "a": "Jean",
    "r": "0",
    "s": 6,
    "des": "\"This recipe is both easy and tasty. Be sure to use freshly grated Parmesan cheese, and not the kind that comes in a can. It will make all the difference! Serve at room temperature. (Note: 1 tablespoon of dried basil may be substituted for the fresh that is called for.)\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nPlace zucchini in a pot with about 1 inch of water. Bring to a boil, and cook until tender but still firm, about 10 minutes. Drain zucchini and transfer to a large bowl. Mash with a fork, then transfer to a fine mesh strainer or sieve, pressing to release excess water. Return to mixing bowl.\nMelt 4 tablespoons butter in a large skillet over medium-high heat. Add onion and garlic, and cook until lightly browned being careful not to burn the garlic. Remove from heat, stir into the zucchini. Mix in the eggs, Parmesan cheese, bread crumbs, and basil. Season with salt and pepper.\nButter an 8 inch square baking dish with remaining butter. Pour the  zucchini mixture into the dish, and spread evenly. Bake in the preheated oven until firm in the center and lightly browned on top, about 45 minutes. Allow to cool, cut into squares, and serve.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "871929.jpg",
    "o": "",
    "st": "allrecipes"
}