{
    "id": 52237,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons margarine",
        "2 tablespoons sesame oil",
        "1 clove garlic, chopped",
        "1/2 small onion, chopped",
        "1 tablespoon all-purpose flour",
        "1/4 head cauliflower, broken into small florets",
        "2 tablespoons miso paste",
        "2/3 cup nutritional yeast",
        "2 teaspoons apple cider vinegar (optional)",
        "1/4 cup diced roasted red pepper (optional)",
        "2 teaspoons cornstarch",
        "1/4 cup rice milk",
        "1 dash hot pepper sauce (e.g. Tabascoâ„¢), or to taste"
    ],
    "nut": [
        "Calories > 457 kcal",
        "Carbs > 32.9 g",
        "Cholesterol > 0 mg",
        "Fat > 27.7 g",
        "Protein > 25.9 g",
        "Sodium > 904 mg"
    ],
    "n": "Spartan Cheese-Like Sauce",
    "a": "Gurtess Smyrnakins",
    "r": "0",
    "s": 2,
    "des": "\"You can also try a variation of this sauce by adding fermented nut pastes which develop lovely cheese qualities. Summer squash can be used in place of the cauliflower. For a totally vegan meal, try using lentil pasta.\"",
    "ins": "Melt the margarine with the sesame oil in a skillet over medium heat. Add garlic and onion, and cook until it smells good. Stir in flour, and cook for one more minute. Remove from heat, and set aside.\nBring one inch of water to a boil in a saucepan. Add cauliflower, and cook for 10 minutes, or until very tender. Drain, and place in a blender along with the onion and garlic mixture, miso paste, yeast, cider vinegar, and red peppers, if using. Process until smooth, adding a bit of water if necessary to get things moving.\nPour the blender mixture back into the skillet, and turn the heat to medium. Stir together the cornstarch and rice milk; mix into the sauce. Bring to a simmer, and cook to desired thickness. If the sauce becomes too thick, add a bit more milk. Season with hot pepper sauce, and adjust flavorings to suit your taste. More red peppers will make a sweeter sauce, more vinegar will take away some sweetness. Serve over your favorite pasta.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}