{
    "id": 52639,
    "old_rating": "4.27273",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 cup balsamic vinegar",
        "4 skinless, boneless chicken breast halves",
        "4 1/2 ounces sliced mozzarella cheese",
        "salt and pepper to taste",
        "4 slices Parma ham",
        "1 pint cherry tomatoes",
        "1 tablespoon olive oil",
        "1 pound small potatoes",
        "2 tablespoons prepared basil pesto"
    ],
    "nut": [
        "Calories > 473 kcal",
        "Carbs > 31.6 g",
        "Cholesterol > 115 mg",
        "Fat > 18.8 g",
        "Protein > 44.3 g",
        "Sodium > 1177 mg"
    ],
    "n": "Italian Chicken with Pesto Potatoes",
    "a": "Paula Fitzgerald",
    "r": "0",
    "s": 4,
    "des": "\"Filling the pockets of each chicken breast with mozzarella guarantees that the chicken itself is beautifully tender. The chicken can be prepared in advance and then baked at the last minute.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nIn a saucepan, bring the vinegar to a boil. Reduce heat, and simmer 15 minutes, stirring frequently, until thickened.\nCut a pocket in each chicken breast. Fill each pocket with an equal amount of mozzarella cheese, and season with salt and pepper. Wrap each chicken breast with a slice of ham. Arrange the wrapped chicken breasts in a baking dish. Place the tomatoes around the chicken, sprinkle all with olive oil, and season with salt and pepper.\nBake 25 minutes in the preheated oven, or until chicken is no longer pink and juices run clear.\nIn a saucepan with enough lightly salted water to cover, boil the potatoes 15 minutes, or until tender. Drain, return to the pan, and coat with the pesto.\nPlace chicken breasts, tomatoes, and potatoes on serving plates, and drizzle with the reduced balsamic vinegar to serve.",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "42278.jpg",
    "o": "",
    "st": "allrecipes"
}