{
    "id": 52640,
    "old_rating": "4.82609",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons hot red pepper sauce",
        "1/2 cup margarine, melted",
        "2/3 cup brown sugar",
        "1 teaspoon Worcestershire sauce",
        "1 tablespoon lemon juice",
        "1 pinch salt",
        "1 pound coarsely chopped pecans",
        "6 skinless, boneless chicken breast halves",
        "1 tablespoon olive oil",
        "1 tablespoon Greek seasoning",
        "1 pound romaine lettuce, torn",
        "1 cup cherry tomato halves",
        "1/2 cup fresh strawberries",
        "1/2 cup seedless grapes",
        "1/4 cup fresh raspberries",
        "1/4 cup fresh blueberries",
        "1/2 cup honey mustard salad dressing"
    ],
    "nut": [
        "Calories > 983 kcal",
        "Carbs > 39.9 g",
        "Cholesterol > 68 mg",
        "Fat > 80.4 g",
        "Protein > 35.9 g",
        "Sodium > 681 mg"
    ],
    "n": "Chicken Pecan Salad",
    "a": "JRW8",
    "r": "0",
    "s": 6,
    "des": "\"The combination of sweet and spicy pecans and sweet berries in this chicken salad makes it a taste sensation! I have given tins of the pecans alone as gifts at Christmas time; they are delicious. The berries listed are suggestions; substitute whatever kinds you fancy, in whatever quantities! Makes a beautiful summer dinner.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nIn a bowl, mix the hot red pepper sauce, margarine, brown sugar, Worcestershire sauce, lemon juice, and salt. Mix pecans into the bowl, tossing to coat evenly. Spread pecans in a single layer on a baking sheet. Bake 10 minutes in the preheated oven, stirring often and watching carefully, until lightly browned. Remove from heat, and set aside.\nRub chicken with the olive oil, place on a baking sheet, and sprinkle with Greek seasoning. Bake 20 minutes or until juices run clear. Slice into strips.\nIn a salad bowl, toss together romaine lettuce, chicken strips, cherry tomato halves, strawberries, grapes, raspberries, and blueberries. Sprinkle with pecans, and drizzle with dressing.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "412859.jpg",
    "o": "",
    "st": "allrecipes"
}