{
    "id": 52809,
    "old_rating": "4.05263",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 cups black raspberries",
        "1/4 teaspoon lemon juice",
        "4 1/2 cups white sugar",
        "1 cup water",
        "2 cups all-purpose flour",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "3 tablespoons shortening",
        "3/4 cup buttermilk"
    ],
    "nut": [
        "Calories > 646 kcal",
        "Carbs > 147.1 g",
        "Cholesterol > < 1 mg",
        "Fat > 6.2 g",
        "Protein > 4.9 g",
        "Sodium > 177 mg"
    ],
    "n": "Irresistible Raspberry Buttermilk Dumplings",
    "a": "SANDSTEPPER",
    "r": "0",
    "s": 8,
    "des": "\"Wonderful twist on this old fashioned favorite, used for dessert or even breakfast! These buttermilk dumplings are light, fluffy, and full of flavor. The very slight tang of the buttermilk compliments the sweetness of the syrup like raspberry dumpling sauce. We love it warm with vanilla ice cream, or they're even great cold!\"",
    "ins": "In a large pot, combine the raspberries, lemon juice, sugar and water. Bring to a boil, then reduce the heat to low, cover and simmer for about 15 minutes. Stir occasionally, but gently so as not to crush the berries.\nMeanwhile, in a medium bowl, stir together the flour, baking soda and salt. Cut in shortening using a pastry blender or the tines of a fork until the pieces are no larger than peas. Stir in the buttermilk until the dough comes together. If it seems too stiff, add another splash of  buttermilk.\nWhen you lift the lid on the pot, the dumpling sauce should be slightly above the level of the berries. If needed, you can add equal amounts of additional sugar and water to the raspberries. Drop the dumpling dough 1 tablespoon at a time into the boiling sauce. Cover, and simmer for about 5 minutes, then remove the lid, flip the dumplings over and cover again. Cook for another 10 minutes, then remove from the heat and let stand for 10 minutes before serving.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "671616.jpg",
    "o": "",
    "st": "allrecipes"
}