{
    "id": 53075,
    "old_rating": "4.58875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 pound ground beef",
        "1 medium onion, diced",
        "1 clove garlic, minced",
        "1 tablespoon chili powder",
        "1 teaspoon ground cumin",
        "1/2 teaspoon paprika",
        "1/2 teaspoon black pepper",
        "1/2 teaspoon salt",
        "1 (16 ounce) can refried beans",
        "4 (10 inch) flour tortillas",
        "1/2 cup salsa",
        "1 cup shredded Cheddar cheese",
        "1 cup shredded Monterey Jack cheese",
        "2 green onions, chopped",
        "2 roma (plum) tomatoes, diced",
        "1/4 cup thinly sliced jalapeno pepper",
        "1/4 cup sour cream (optional)"
    ],
    "nut": [
        "Calories > 370 kcal",
        "Carbs > 31.6 g",
        "Cholesterol > 55 mg",
        "Fat > 18.6 g",
        "Protein > 19.6 g",
        "Sodium > 848 mg"
    ],
    "n": "Jimmy's Mexican Pizza",
    "a": "Jimmy Simian",
    "r": "0",
    "s": 8,
    "des": "\"Jimmy's specially seasoned ground beef, refried beans, salsa and cheese layered in a deep dish style. A tasty and easy Mexican-style pizza with a flour tortilla crust I whipped up because I had the stuff to make it!!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Coat 2 pie plates with non-stick cooking spray.\nPlace beef, onion and garlic in a skillet over medium heat. Cook until beef is evenly browned. Drain off grease. Season the meat with chili powder, cumin, paprika, salt and pepper.\nLay one tortilla in each pie plate, and cover with a layer of refried beans. Spread half of the seasoned ground beef over each one, and then cover with a second tortilla. Bake for 10 minutes in the preheated oven.\nRemove the plates from the oven, and let cool slightly. Spread half of the salsa over each top tortilla. Cover each pizza with half of the Cheddar and Monterey Jack cheeses. Place half of the tomatoes, half of the green onions, and half of the jalapeno slices onto each one.\nReturn the pizzas to the oven, and bake for 5 to 10 more minutes, until the cheese is melted. Remove from the oven, and let cool slightly before slicing each one into 4 pieces.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "4524605.jpg",
    "o": "4524605.jpg,4139751.jpg,3947301.jpg,3921337.jpg,3857438.jpg,3550535.jpg",
    "st": "allrecipes"
}