{
    "id": 53602,
    "old_rating": "4.41667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 stale raised glazed donuts",
        "1/2 cup raisins or other dried fruit",
        "2 eggs (room temperature)",
        "1 (12 fluid ounce) can evaporated milk",
        "2 tablespoons white sugar (optional)",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon almond extract (optional)",
        "1 teaspoon grated orange zest",
        "2 teaspoons ground cinnamon",
        "1/4 teaspoon ground nutmeg"
    ],
    "nut": [
        "Calories > 329 kcal",
        "Carbs > 44.3 g",
        "Cholesterol > 80 mg",
        "Fat > 13.6 g",
        "Protein > 9.5 g",
        "Sodium > 311 mg"
    ],
    "n": "Doughnut Bread Pudding",
    "a": "EMERALDCITYJEWEL",
    "r": "0",
    "s": 6,
    "des": "\"Don't pass up those day-old doughnuts in the grocery store. They make great bread pudding! Just about any kind of raised yeast doughnuts work except for jelly. Apple fritters are even good. I sometimes use a combination of cinnamon, glazed, sugared doughnuts and apple fritters for an interesting combination. You don't have to add any extra fat and very little (if any) extra sugar depending on taste.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a small glass baking dish.\nTear the donuts into bite-size pieces. Combine donut pieces and raisins in the prepared baking dish. In a medium bowl, use an electric mixer to blend together the eggs, evaporated milk, sugar, vanilla extract and almond extract. Mix in the cinnamon and nutmeg. Pour the milk mixture over the donuts in the dish, and press down lightly to help absorption. Let stand for 15 minutes, or cover and refrigerate overnight.\nPlace the baking dish inside a larger baking dish, and fill the outer dish with enough water to go about halfway up the sides. A dishcloth may also be placed under the bread dish, to prevent drying.\nBake for 35 to 40 minutes in the preheated oven, or until a knife inserted near the center comes out clean. Serve warm.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4011381.jpg",
    "o": "",
    "st": "allrecipes"
}