{
    "id": 53647,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/2 pounds extra lean ground beef",
        "4 cloves roasted garlic, chopped",
        "1 pinch garlic pepper",
        "1 pinch lemon pepper",
        "1 pinch Cajun seasoning",
        "4 slices  sweet onion, 1/2 inch thick",
        "4 large Hawaiian sweet rolls",
        "4 slices American cheese",
        "4 slices smoked Edam cheese",
        "4 green leaf lettuce leaves",
        "3 roma (plum) tomatoes, sliced",
        "8 dill pickle slices",
        "Creole mustard (optional)",
        "creamy salad dressing, e.g. Miracle Whip â„¢ (optional)",
        "ketchup (optional)"
    ],
    "nut": [
        "Calories > 1159 kcal",
        "Carbs > 63.3 g",
        "Cholesterol > 285 mg",
        "Fat > 60.1 g",
        "Protein > 87.9 g",
        "Sodium > 2970 mg"
    ],
    "n": "Bayou Samburgers",
    "a": "JETJOUSTER",
    "r": "0",
    "s": 4,
    "des": "\"Not your everyday backyard burger, but a true celebration of summer! Right from Bayou Sam's Cajun Grill. Serve with Zapp's Cajun Chips Pecos Sweet cantaloupe, and well-chilled Black Diamond watermelon hearts. Enjoy the summer while you can.\"",
    "ins": "Preheat an outdoor grill for high heat.\nMix together the ground beef and roasted garlic. Form the mixture into four balls, and flatten into patties about 3/4 inch thick. Sprinkle the patties with garlic pepper, lemon salt, and Cajun seasoning.\nLightly oil the grilling surface. Place onions on the grill, and toast on both sides. Place beef patties on the grill, and set the onions on top of them. Grill for about 5 minutes on each side, or to desired doneness. If you're lucky (or trashy) enough to still have a coffee can of grease on your stove, brush both sides of the Hawaiian rolls, then toast them on the grill.\nTo assemble, place the patties on buns, and top with slices of American and Edam cheese, lettuce, tomato, pickles, and your choice of condiments such as ketchup, Creole mustard, and salad dressing. These listed are some of mine.",
    "pt": "15 m",
    "ct": "12 m",
    "tt": "27 m",
    "i": "654336.jpg",
    "o": "",
    "st": "allrecipes"
}