{
    "id": 53926,
    "old_rating": "4.40909",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup unsalted butter",
        "4 cups chicken broth, divided",
        "1/2 cup all-purpose flour",
        "1/4 cup dried onion flakes",
        "1 dash hot pepper sauce",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon dried thyme",
        "1 bay leaf",
        "1 (8 ounce) can carrots, drained",
        "1 (8 ounce) can white potatoes",
        "2 cups diced cooked chicken",
        "4 slices Swiss cheese",
        "1 sheet frozen puff pastry, cut into four squares",
        "1 egg, beaten with",
        "1 tablespoon water"
    ],
    "nut": [
        "Calories > 948 kcal",
        "Carbs > 55.9 g",
        "Cholesterol > 193 mg",
        "Fat > 64.8 g",
        "Protein > 35.3 g",
        "Sodium > 1501 mg"
    ],
    "n": "Chicken Pot Pies with Puff Pastry",
    "a": "FlourGirl",
    "r": "0",
    "s": 4,
    "des": "\"For those of us who LOVE pot pies, but don't have all day to make them! This quick pot pie recipe can be altered with as many vegetables and seasonings as your heart desires. Its only crust is a square of puff pastry placed over the top of the bowl, which rises and browns beautifully.  Use leftover chicken, or store-bought prepared chicken breasts if you're in more of a hurry!\"",
    "ins": "Preheat oven to 400 degrees. Spray 4 small oven-proof bowls with cooking spray.\nIn a saucepan over medium heat, melt butter. Stir in 2 cups chicken broth, and whisk in all of the flour, gradually adding the remaining chicken broth until you have a smooth, slightly thick base. Mix in onion flakes, hot pepper sauce, pepper, thyme, bay leaf, and carrots. Cook about 5 minutes. Stir in potatoes and chicken, and cook for another 5 minutes.\nIn the bottom of each prepared bowl, place a slice of Swiss cheese. Divide the chicken mixture equally into the four bowls, over the cheese. Place a puff pastry square over the top of each bowl, pressing lightly around the rim.  Brush the pastry with the egg and water mixture. Place the four bowls on a baking sheet.\nBake until pastry is puffed and golden brown, about 25 minutes. Let rest at least 5 minutes before serving.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "2088554.jpg",
    "o": "4518647.jpg,2146281.jpg,677592.jpg,677591.jpg,677590.jpg",
    "st": "allrecipes"
}