{
    "id": 54004,
    "old_rating": "4.50526",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 tablespoons vegetable oil, divided",
        "1 pound lean boneless pork, cut into thin strips",
        "4 cups shredded cabbage",
        "1 large carrot, shredded",
        "1/2 green bell pepper, cut into thin strips",
        "1 medium onion, chopped",
        "3 cloves garlic, minced",
        "3 teaspoons fresh ginger root, grated",
        "1 tablespoon cornstarch",
        "2 tablespoons soy sauce",
        "1 1/2 tablespoons molasses",
        "2 tablespoons vegetable oil",
        "1 quart oil for frying",
        "1 1/2 (14 ounce) packages egg roll wrappers",
        "1/4 cup water, as needed",
        "1 1/2 cups sweet and sour sauce for dipping"
    ],
    "nut": [
        "Calories > 335 kcal",
        "Carbs > 42.9 g",
        "Cholesterol > 4 mg",
        "Fat > 15.7 g",
        "Protein > 5.8 g",
        "Sodium > 557 mg"
    ],
    "n": "Cindi's Egg Rolls",
    "a": "Domestic Goddess",
    "r": "0",
    "s": 12,
    "des": "\"These are the best-tasting egg rolls you'll ever have. They're even better than the ones served at Asian restaurants. My family just loves them. What's even better is that you can use a variety of different meats--ground beef, pork steak, seasoned ground pork sausage, precooked shrimp--or prepare them without meat for the vegetarians.\"",
    "ins": "Heat 2 tablespoons vegetable oil in large wok over medium-high heat. Stir-fry pork for 3 minutes. Transfer pork to paper towel-lined plate and set aside.\nIn a large bowl, mix the cabbage, carrot, green bell pepper, onion, garlic and ginger. In a small bowl, mix the cornstarch, soy sauce, and molasses until smooth.\nHeat 2 tablespoons oil in wok. Stir in cabbage mixture in batches, cooking each batch 3 to 4 minutes, just until tender. Return vegetables to bowl, and mix in pork. Stir in the cornstarch mixture.\nPrepare a work surface for rolling the egg rolls. Lay several egg roll wrappers in a row. Place the water in a small bowl; you'll use this for sealing.\nPlace about 2 to 3 tablespoons filling on each egg roll wrapper. Dip a finger in the water and run it along the edge of the wrapper. Fold one corner of wrapper over filling. Fold wrapper sides over filling. Roll wrappers to form egg rolls (See Cook's Note).\nHeat 1 quart oil in a deep fryer to 365 degrees F (185 degrees C).\nFry egg rolls in batches in the hot oil until golden brown. Drain on paper towels and serve with sweet and sour sauce.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "1 h ",
    "i": "418266.jpg",
    "o": "4466412.jpg,881471.jpg,881470.jpg,608787.jpg,594206.jpg,279531.jpg",
    "st": "allrecipes"
}