{
    "id": 54081,
    "old_rating": "4.53571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 ear corn, husked and cleaned",
        "1 (15 ounce) can reduced sodium black beans",
        "1 (32 ounce) container 1% fat cottage cheese",
        "1 avocado - peeled, pitted, and diced",
        "2 roma (plum) tomatoes, seeded and diced",
        "2 cups salsa",
        "1 (13.5 ounce) package tortilla chips, if desired"
    ],
    "nut": [
        "Calories > 334 kcal",
        "Carbs > 41.8 g",
        "Cholesterol > 3 mg",
        "Fat > 12.9 g",
        "Protein > 17 g",
        "Sodium > 907 mg"
    ],
    "n": "Cottage Cheese, Avocado, and Black Bean Salsa",
    "a": "David Mengel",
    "r": "0",
    "s": 10,
    "des": "\"This may look and sound sort of bad, but let me tell you, there isn't a tastier, nutritious, salsa-like dip to hold you over while you wait for dinner. Funny enough, this was created as an experiment with leftovers, and now I have over 15 friends making it on a regular basis! This is a great recipe that can be stored in the refrigerator for several days for a quick, anytime snack. (Frozen corn, heated and cooled in the same manner, may be used in place of the corn on the cob.)\"",
    "ins": "Place corn on the cob in a microwave safe dish with 1/4 inch of water. Cover, and microwave on medium high for 4 minutes, or until tender. Cool under running water, and slice kernels from cob. Set aside.\nCook the black beans in a small saucepan over medium heat until warm and tender, about 10 minutes. Strain, and rinse under cold water to remove liquid and excess sodium. Set aside.\nPlace the cottage cheese in a mixing or serving bowl. Peel, pit, and dice the avocado into bite size pieces, and add to the cottage cheese. Cut the tomatoes in half lengthwise, remove seeds, and dice into bite size pieces. Add to the cottage cheese along with the corn, black beans, and salsa. Stir until well blended. Cover and refrigerate until ready to serve. Serve with tortilla chips, if desired.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "4504195.jpg",
    "o": "",
    "st": "allrecipes"
}