{
    "id": 54604,
    "old_rating": "4.36364",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 1/4 cups peeled, cubed pumpkin",
        "1 tablespoon olive oil",
        "4 cups vegetable broth",
        "1/2 teaspoon chopped fresh garlic",
        "1 onion, diced",
        "1 cup baby spinach leaves",
        "6 ounces feta cheese, cubed",
        "salt and pepper",
        "2 cups Arborio rice"
    ],
    "nut": [
        "Calories > 615 kcal",
        "Carbs > 107 g",
        "Cholesterol > 38 mg",
        "Fat > 13.1 g",
        "Protein > 16.1 g",
        "Sodium > 1524 mg"
    ],
    "n": "Roast Pumpkin and Feta Risotto",
    "a": "MEL_JADE",
    "r": "0",
    "s": 4,
    "des": "\"This tasty dish combines the sweetness of roast pumpkin and salty taste of feta cheese to create a sensational risotto.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C). Brush a baking dish with olive oil.\nPlace pumpkin in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm. Transfer pumpkin to baking dish, and brush with oil. Season with salt and pepper.  Bake in preheated oven until golden brown.\nMeanwhile, heat olive oil in a saucepan. Cook onion and garlic until tender. Stir in rice, and cook for 1 to 2 minutes. Slowly add vegetable broth 1/2 cup at a time, stirring frequently and allowing all the liquid to be absorbed before adding more broth. Continue cooking until the rice is tender to the tooth, and then season with salt and pepper to taste.\nWhen the pumpkin is almost done, place feta on a baking sheet, and bake in preheated oven until the cheese is hot, and is beginning to melt along the edges.\nMash 1/2 of the pumpkin, and stir into the risotto with the spinach. Ladle risotto into bowls, and top with remaining pumpkin cubes and heated feta.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "1061412.jpg",
    "o": "1659566.jpg,914931.jpg,567174.jpg,128487.jpg,128484.jpg,46852.jpg",
    "st": "allrecipes"
}