{
    "id": 54616,
    "old_rating": "4.38462",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup butter",
        "6 large Vidalia onions, thinly sliced",
        "1/4 cup butter",
        "2 tablespoons all-purpose flour",
        "1 teaspoon salt, or to taste",
        "1/2 teaspoon ground black pepper",
        "1 teaspoon dry mustard",
        "1 cup milk",
        "2 cups shredded Monterey Jack cheese",
        "1/2 cup seasoned bread crumbs",
        "butter flavored cooking spray"
    ],
    "nut": [
        "Calories > 475 kcal",
        "Carbs > 41.1 g",
        "Cholesterol > 78 mg",
        "Fat > 28.6 g",
        "Protein > 16.1 g",
        "Sodium > 904 mg"
    ],
    "n": "Giovanna's Yummy Cheese Onions",
    "a": "ELIZASMUM",
    "r": "0",
    "s": 6,
    "des": "\"A layered dish of onions, bread crumbs and a velvety Monterey Jack cheese sauce. Given to me by my friend, Giovanna, this recipe has become a staple in our house.  It's great alone for a snack, or as a side dish.\"",
    "ins": "Preheat the oven to 400 degrees F (200 degrees C).\nMelt 1/4 cup of butter in a large skillet over medium-low heat. Add sliced onions, and cook until wilted and soft, but not browned. Set aside.\nMelt the remaining butter in a saucepan over medium heat. Mix in the flour, salt, pepper, and dry mustard. Cook stirring for 2 minutes. Gradually whisk in milk, stirring constantly until thickened. Add cheese, and cook, stirring until melted. Set aside.\nSpread half of the onions into the bottom of a 1 quart casserole dish or 11x7 baking dish. Spoon half of the sauce over the onions, then sprinkle with half of the bread crumbs. Repeat layering, and spray the top layer of bread crumbs with cooking spray.\nBake uncovered for 25 minutes in the preheated oven, then turn on the broiler, and broil for 1 minute, until the top is golden brown.",
    "pt": "30 m",
    "ct": "26 m",
    "tt": "56 m",
    "i": "47339.jpg",
    "o": "",
    "st": "allrecipes"
}