{
    "id": 54657,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (9 inch) refrigerated pie crust",
        "1/2 pound bulk Italian sausage",
        "1 cup chopped onion",
        "1 clove garlic, minced",
        "2 tablespoons Dijon mustard",
        "1 egg",
        "1/2 cup light cream",
        "salt and pepper to taste",
        "2 cups shredded mozzarella cheese, divided",
        "2 pounds tomatoes, sliced",
        "1 teaspoon dried oregano, or to taste",
        "1 teaspoon dried basil, or to taste",
        "2 cups chopped fresh basil",
        "1 egg",
        "1 tablespoon lemon juice",
        "1 cup vegetable oil",
        "salt to taste"
    ],
    "nut": [
        "Calories > 606 kcal",
        "Carbs > 19.2 g",
        "Cholesterol > 96 mg",
        "Fat > 52.6 g",
        "Protein > 15.8 g",
        "Sodium > 623 mg"
    ],
    "n": "Tomato Sausage Tart",
    "a": "DOREENBUCH",
    "r": "0",
    "s": 8,
    "des": "\"Tomatoes and sausage are baked in cheesy layers then served with a home made basil mayonnaise. Delicious and very easy.....great for a brunch or showers.\"",
    "ins": "Preheat the oven to 375 degrees F (190 degrees C). Press the pie crust into the bottom and up the sides of a pie plate.\nCook the sausage in a skillet over medium heat. Add onion and garlic, and cook stirring occasionally until sausage is browned, and onions are translucent. Drain and set aside. In a small bowl, mix together the mustard, 1 egg and light cream until well blended. Stir into the sausage mixture.\nSprinkle 1 cup of the mozzarella cheese over the bottom of the pie crust. Place the sausage mixture over the cheese. Arrange tomato slices over the sausage layer, then top with the remaining cheese. Sprinkle dried basil and oregano over the cheese.\nBake for 35 to 40 minutes in the preheated oven, until heated through and bubbly. Let stand for 20 minutes before slicing. Serve with Basil Mayonnaise.\nTo make Basil Mayonnaise, combine the fresh basil, 1 egg, and lemon juice in a blender or food processor. Blend to mix, then gradually drizzle in oil while blending. Season with salt and pepper to taste.",
    "pt": "35 m",
    "ct": "35 m",
    "tt": "1 h ",
    "i": "253294.jpg",
    "o": "",
    "st": "allrecipes"
}