{
    "id": 54787,
    "old_rating": "4.57934",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package cream cheese, softened",
        "1/4 cup white sugar",
        "1 egg",
        "1 cup semisweet chocolate chips",
        "1/4 cup butter",
        "1 cup semisweet chocolate chips",
        "1/2 cup white sugar",
        "2 eggs",
        "2/3 cup all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon salt"
    ],
    "nut": [
        "Calories > 244 kcal",
        "Carbs > 27.1 g",
        "Cholesterol > 58 mg",
        "Fat > 15 g",
        "Protein > 3.7 g",
        "Sodium > 125 mg"
    ],
    "n": "Chunky Cheesecake Brownies",
    "a": "bakergirl",
    "r": "0",
    "s": 16,
    "des": "\"Wow! Melt-in-your-mouth brownies that are easy and elegant. Chocolate brownies marbled with cheesecake make fabulous squares! This is by far my most requested recipe.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch square baking pan.\nCombine cream cheese with 1/4 cup sugar and 1 egg in a mixing bowl; beat until smooth. Stir 1 cup chocolate chips into the cream cheese mixture. Set aside.\nFill a saucepan with water and bring to a boil. Turn the heat off, and set a  heatproof mixing bowl over the water. In the mixing bowl, combine butter with the remaining cup of chocolate chips; stir until just melted and blended together. Stir in the remaining 1/2 cup sugar and 2 eggs, then sift together flour, baking powder, and salt; stir into chocolate until evenly blended.\nPour half of the batter into the prepared baking pan. Spread the cream cheese mixture over the chocolate layer. Top with remaining chocolate mixture (this doesn't need to completely cover the cream cheese layer). Using a knife, swirl the top chocolate layer into the cream cheese to make a marble pattern.\nBake in preheated oven at 350 degrees F (175 degrees C) for 25 to 30 minutes, or until top is crinkled and edges pull away from sides of the pan. Cool thoroughly. Cut into 12 to 16 squares. Store in the refrigerator or freeze.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "4537283.jpg",
    "o": "4537283.jpg,4484213.jpg,4457475.jpg,4288315.jpg,4016368.jpg,3888180.jpg",
    "st": "allrecipes"
}