{
    "id": 55867,
    "old_rating": "4.34454",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds skinless, boneless chicken breast halves - cut into strips",
        "3 eggs",
        "1 cup water",
        "1/2 cup milk",
        "2 tablespoons salt",
        "2 tablespoons black pepper",
        "6 cups all-purpose flour",
        "1/4 cup salt",
        "5 teaspoons black pepper",
        "2 tablespoons minced garlic",
        "2 tablespoons dry mesquite flavored seasoning mix",
        "4 cups oil for frying, or as needed",
        "1 teaspoon butter",
        "1 (12 ounce) bottle barbecue sauce"
    ],
    "nut": [
        "Calories > 568 kcal",
        "Carbs > 67.5 g",
        "Cholesterol > 113 mg",
        "Fat > 20 g",
        "Protein > 27.6 g",
        "Sodium > 4496 mg"
    ],
    "n": "Baked BBQ Fried Chicken",
    "a": "Jenny Sook",
    "r": "0",
    "s": 12,
    "des": "\"This is a wonderful Southern treat in which everyone will enjoy! Remember, you can also eat the chicken without the BBQ sauce as well.\"",
    "ins": "In a large bowl, whisk together the eggs, water, milk, 2 tablespoons salt, and 2 tablespoons pepper with a fork until smooth. In another large bowl, stir together the flour, 1/4 cup salt, 5 teaspoons pepper, garlic, and mesquite seasoning.\nFill a large heavy skillet or wok halfway full with oil. Heat to 365 degrees F (180 degrees C). Use a fork to pick up one chicken strip at a time, and dip it into the egg mixture, then into the flour mixture, back into the egg mixture, and into the flour mixture again. Place coated strips into the hot oil to fry. Do not over crowd, just cook in batches. Once chicken is browned on one side, flip over, and brown on the other side.\nPreheat the oven to 300 degrees F (150 degrees C). Butter one 12x20 inch glass baking dish, or two 9x13 inch baking dishes. Pour enough barbeque sauce into the dish to coat the bottom. Arrange fried chicken strips in rows in the prepared dish. Pour remaining sauce over the top.\nBake for 10 to 15 minutes in the preheated oven, until the sauce is caramelized onto the chicken.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "462947.jpg",
    "o": "4538713.jpg,4521883.jpg,4309492.jpg,4173210.jpg,3873098.jpg,3776293.jpg",
    "st": "allrecipes"
}