{
    "id": 56248,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (14 ounce) can sweetened condensed milk",
        "3 tablespoons chicken bouillon granules",
        "4 bone-in chicken breast halves",
        "6 tablespoons vegetable oil",
        "1/2 cup diced onion",
        "1/2 cup diced carrot",
        "1/4 cup diced celery",
        "2 fresh red chile peppers, halved and seeded",
        "2 large cloves garlic, peeled",
        "1 shallots, peeled and minced",
        "1 sprig fresh rosemary",
        "2 sprigs fresh thyme",
        "2 bay leaves",
        "5 juniper berries, crushed",
        "10 whole peppercorns",
        "3 whole cloves",
        "1 (2 inch) cinnamon stick",
        "2 1/4 cups Burgundy or other dry red wine",
        "1 cup chicken stock",
        "2 (1 ounce) squares semisweet chocolate, grated"
    ],
    "nut": [],
    "n": "Chocolate Mayan Jungle Bird",
    "a": "MONIBALONI",
    "r": "0",
    "s": 4,
    "des": "\"Chicken breasts, marinated in sweetened condensed milk and pan-fried, are served in a flavorful, chocolate and wine sauce.\"",
    "ins": "In a large bowl, mix together sweetened condensed milk, and 2 tablespoon chicken granules. Place chicken breasts in bowl, and turn to coat all sides of the chicken. Cover, and refrigerate for at least 5 to 6 hours; overnight is best.\nPreheat oven to 425 degrees F (220 degrees C).\nIn a roasting pan, heat 4 tablespoons of the oil on the stove top over medium-high heat.  Cook onion, carrot, celery, chile pepper, garlic, and shallot with rosemary, thyme, bay leaves, juniper berries, peppercorns, cloves and cinnamon stick in oil until vegetables are evenly browned. Stir in 1 cup wine, cover, and cook in the preheated oven for 25 minutes; gradually add remaining wine to the pan during this time. Stir in chicken stock, and continue cooking for 1 hour.\nStrain contents of roasting pan into a saucepan. Cook over medium-low heat to reduce sauce.  Melt chocolate in the sauce, stirring until smooth.\nIn a large skillet, heat the remaining two tablespoons of oil. Season chicken with remaining chicken granules, covering both sides generously. Cook in hot oil until evenly browned and cooked through. Pour sauce over chicken, and heat through.",
    "pt": "40 m",
    "ct": "2 h",
    "tt": "7 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}