{
    "id": 56303,
    "old_rating": "4.42857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup all-purpose flour",
        "3 tablespoons white sugar",
        "1 tablespoon unsweetened cocoa powder",
        "1/2 cup butter",
        "1 (14 ounce) can sweetened condensed milk",
        "2 cups chocolate chips",
        "1 1/2 cups confectioners' sugar",
        "3 tablespoons butter",
        "3 tablespoons maraschino cherry juice",
        "1 (1 ounce) square semisweet chocolate, chopped"
    ],
    "nut": [
        "Calories > 221 kcal",
        "Carbs > 31.2 g",
        "Cholesterol > 19 mg",
        "Fat > 10.9 g",
        "Protein > 2.5 g",
        "Sodium > 58 mg"
    ],
    "n": "Pink Ladies",
    "a": "love to bake",
    "r": "0",
    "s": 25,
    "des": "\"A rich chocolate filling on a chocolate base topped with pink icing and chocolate stripes. These elegant ladies are welcome in anyone's kitchen!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Grease an 8 inch square baking pan. In a medium bowl, stir together flour, white sugar, and cocoa powder. Cut in butter until the texture is mealy. Pat into the bottom of the prepared pan.\nBake for 10 minutes in the preheated oven. In a saucepan over medium-low heat, combine the sweetened condensed milk and chocolate chips. Cook, stirring frequently until chips are melted and the mixture is smooth. Pour over the baked crust.\nReturn to the oven, and bake for 15 minutes. Remove, and cool in the pan over a wire rack.\nIn a medium bowl, mix together the confectioners' sugar, butter, and cherry juice. Spread over the cooled filling in the pan. Melt semisweet chocolate in a small glass dish in the microwave, or in a metal bowl over a pan of simmering water, stirring occasionally until smooth. Place in a plastic bag or piping bag, cut the tip to 1/8 inch, and drizzle the chocolate over the bars in a back and forth motion to make stripes. Cool completely before cutting into squares.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "1084336.jpg",
    "o": "1083929.jpg,662939.jpg,382243.jpg,382162.jpg,337749.jpg,251471.jpg",
    "st": "allrecipes"
}