{
    "id": 56398,
    "old_rating": "4.85714",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 (8-ounce) mirlitons (chayotes)",
        "2 teaspoons olive oil",
        "1 clove garlic, minced",
        "1 medium onion, chopped",
        "1 pound fresh shrimp, peeled and deveined",
        "1 pound cooked, cubed ham",
        "1 egg",
        "1 cup dry bread crumbs",
        "2 tablespoons chopped fresh parsley",
        "1 teaspoon dried thyme",
        "salt and pepper to taste",
        "1/2 cup dry bread crumbs for topping (optional)"
    ],
    "nut": [
        "Calories > 319 kcal",
        "Carbs > 23.1 g",
        "Cholesterol > 141 mg",
        "Fat > 14.1 g",
        "Protein > 24.7 g",
        "Sodium > 1062 mg"
    ],
    "n": "Mirliton",
    "a": "MOUNTMAN",
    "r": "0",
    "s": 8,
    "des": "\"Mirliton (chayote) squash is the vegetable that is used to make this wonderful dressing. It's very popular here in Louisiana around the holidays.\"",
    "ins": "Bring a large pot of water to a boil. Add mirliton, and boil until tender, about 45 minutes. Drain, cool, and peel. Cut in half, remove seeds, and cut into cubes.\nWhen the mirliton are almost done, bring another pot of water to a boil. Add shrimp, and cook for about 5 minutes, until pink. Drain shrimp, reserving the water for later. Preheat the oven to 250 degrees F (120 degrees C).\nHeat olive oil in a large skillet over medium-high heat. Fry onion and garlic in the oil until soft. Transfer to a 9x13 inch baking dish. Add the shrimp, ham, and cubed mirliton. Beat the egg in a small dish with a tablespoon of the water from the shrimp; pour into the baking dish. Mix in the bread crumbs, parsley, thyme, salt and pepper until evenly blended. If it seems a little dry, add a little more water from the shrimp. You have the choice to freeze, refrigerate, or bake at this point. Sprinkle some more breadcrumbs on top if desired.\nBake for 1 hour and 30 minutes in the preheated oven, or until golden brown on top.",
    "pt": "1 h",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "1743852.jpg",
    "o": "",
    "st": "allrecipes"
}