{
    "id": 56733,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups mashed potatoes",
        "1 cup all-purpose flour",
        "2 eggs, beaten",
        "1 1/2 teaspoons salt",
        "1/8 teaspoon black pepper",
        "1 medium onion, chopped",
        "3 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "1 cup light cream",
        "1 cup chicken broth",
        "1/2 cup grated Parmesan cheese",
        "1/2 cup shredded Jarlsberg cheese"
    ],
    "nut": [
        "Calories > 373 kcal",
        "Carbs > 34.2 g",
        "Cholesterol > 121 mg",
        "Fat > 20.7 g",
        "Protein > 12.9 g",
        "Sodium > 1019 mg"
    ],
    "n": "Potato Dumpling Casserole",
    "a": "Sue S.",
    "r": "0",
    "s": 6,
    "des": "\"Yummy potato dumplings baked in a rich cheese sauce. A family favorite, and a great use for leftover mashed potatoes. You can also double the sauce recipe and use it as the base for a terrific macaroni and cheese casserole. If Jarlsberg cheese is not available at your store, you can use Swiss cheese.\"",
    "ins": "In a medium bowl, mix together the mashed potatoes, 1 cup flour, eggs, salt and pepper until well blended. Spoon into a clean plastic bag.\nBring 5 quarts of water to a boil in a large pot. Adjust heat so that water boils very gently. Cut a small opening in the corner of the baggie, and squeeze out dumplings into the water, cutting with scissors at 1 inch intervals. Let the dumplings simmer uncovered until they float to the top. Remove with a slotted spoon, and place in a 2 quart baking dish. Keep warm.\nPreheat the oven to 350 degrees F (175 degrees C). Melt butter in a skillet over medium heat. Saute onion in butter until tender. Blend in 2 tablespoons flour until smooth. Pour in cream and broth, and cook, stirring constantly until thickened. Remove from heat and stir in half of the Parmesan cheese and half of the Jarlsberg until smooth. Pour over the dumplings in the dish. Sprinkle remaining cheeses over the top.\nBake uncovered for 45 minutes in the preheated oven, until the top is golden brown and sauce is bubbly.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "972468.jpg",
    "o": "",
    "st": "allrecipes"
}