{
    "id": 57184,
    "old_rating": "4.82203",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter",
        "3/4 cup sugar",
        "1 egg, room temperature",
        "2 teaspoons anise extract",
        "2 1/2 cups all-purpose flour",
        "1/4 teaspoon baking powder",
        "1/8 teaspoon salt",
        "1/2 cup milk, or as needed",
        "1 cup sesame seeds"
    ],
    "nut": [
        "Calories > 72 kcal",
        "Carbs > 7.1 g",
        "Cholesterol > 11 mg",
        "Fat > 4.4 g",
        "Protein > 1.2 g",
        "Sodium > 31 mg"
    ],
    "n": "Aunt Anne's Sesame Cookies",
    "a": "DianeF",
    "r": "0",
    "s": 60,
    "des": "\"After trying my hand at countless sesame cookie recipes, my Italian girlfriend shared her Aunt Anne's recipe and I knew my search had ended! Basically an anise flavored butter cookie covered in sesame seeds. The smell when removing them from the oven is wonderful!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a large bowl, cream together the butter and sugar until smooth. Beat in the egg and anise extract until well blended. Sift together the flour, baking powder and salt; stir into the butter mixture until well incorporated. If you are using a stand mixer, let the dough mix for another minute to add lightness to the dough. The dough will be soft, but will hand roll easily.\nPinch off pieces of dough slightly smaller than a walnut, and roll them into small logs. Dip in milk, then roll in sesame seeds. Place cookies one inch apart on a cookie sheet. Cookies will not spread very much.\nBake for 17 to 20 minutes in the preheated oven, or until bottom and sides of cookies are lightly toasted. Remove from cookie sheets to cool on wire racks. Store in an airtight container at room temperature.",
    "pt": "15 m",
    "ct": "17 m",
    "tt": "32 m",
    "i": "4482164.jpg",
    "o": "4146049.jpg,2850421.jpg,2357569.jpg,2287509.jpg,2217099.jpg,1069432.jpg",
    "st": "allrecipes"
}