{
    "id": 57632,
    "old_rating": "4.16071",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package small seashell pasta",
        "2 eggs",
        "2 ounces cooked ham, cut into thin strips",
        "1 (10 ounce) package frozen English peas, thawed",
        "1 cup shredded Swiss cheese",
        "1/2 cup mayonnaise",
        "1/4 cup sour cream",
        "green onions, chopped",
        "1 teaspoon prepared mustard",
        "1 teaspoon hot pepper sauce",
        "1 teaspoon paprika"
    ],
    "nut": [
        "Calories > 450 kcal",
        "Carbs > 31.9 g",
        "Cholesterol > 99 mg",
        "Fat > 27.7 g",
        "Protein > 19.5 g",
        "Sodium > 335 mg"
    ],
    "n": "THE Pasta Salad",
    "a": "Angela",
    "r": "0",
    "s": 7,
    "des": "\"This is a wonderful cold pasta salad that has been a family favorite of ours for years.  Wonderful for potlucks, picnics, or any gathering.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes, or until al dente. Rinse under cold water, drain, and set aside.\nMeanwhile, place eggs in a saucepan and cover with cold water. Over medium  heat, bring water to a full boil. Lower heat and simmer for 10 to 15 minutes. Immediately plunge eggs into cold water. Let cool completely, then peel and slice.\nIn a large serving bowl, toss together the pasta, egg, ham, peas, and Swiss cheese. In a separate bowl, mix together the mayonnaise, sour cream, green onion, mustard, mustard, and hot pepper sauce. Stir until well blended.\nPour 3/4 of the dressing over the pasta, and toss to coat thoroughly. Spread the remaining dressing evenly over the top of the pasta salad, all the way to the edge of the bowl. Sprinkle with paprika, cover tightly, and chill 4 hours, or overnight for best flavor.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "8 h ",
    "i": "590573.jpg",
    "o": "4537418.jpg,4517692.jpg,2616043.jpg,2580304.jpg,1216172.jpg,527120.jpg",
    "st": "allrecipes"
}