{
    "id": 57661,
    "old_rating": "4.64706",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup butter",
        "1 small onion, finely chopped",
        "1 stalk celery, finely chopped",
        "1 carrot, finely chopped",
        "2 cloves garlic, minced",
        "3 tablespoons all-purpose flour",
        "3 tablespoons tomato paste",
        "4 cups chicken broth",
        "2 (14.5 ounce) cans fire roasted diced tomatoes, drained",
        "3 tablespoons white sugar",
        "1/4 teaspoon ground nutmeg",
        "1/4 cup heavy cream",
        "salt and black pepper to taste"
    ],
    "nut": [
        "Calories > 297 kcal",
        "Carbs > 32.1 g",
        "Cholesterol > 51 mg",
        "Fat > 17.3 g",
        "Protein > 3.7 g",
        "Sodium > 754 mg"
    ],
    "n": "Tomato Bisque III",
    "a": "SWEETJAM",
    "r": "0",
    "s": 4,
    "des": "\"This is a really fast and easy tomato soup recipe.  My kids even liked it.  I originally got it from a Food and Wine magazine, but I've tweaked it a little to suit my taste. The nutmeg makes the taste a little more complex.\"",
    "ins": "Melt the butter in a large saucepan over medium heat. Stir in the onion, celery, carrot, and garlic. Cook and stir until the vegetables are tender and beginning to brown, about 8 minutes. Stir in the flour and cook 1 minute longer, stirring constantly.\nStir in the tomato paste, chicken broth, tomatoes, sugar, and nutmeg. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer 15 minutes until the vegetables are very tender.\nPour half to three-quarters of the soup into a blender-depending on how chunky you want it-filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Alternately, you can use a stick blender and puree the soup in the saucepan.\nReturn the pureed soup to the saucepan and stir in the cream. Cook over medium heat until the soup is hot. Season with salt and pepper to taste before serving.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "191346.jpg",
    "o": "4458849.jpg,4441998.jpg,3935036.jpg,3910944.jpg,3190631.jpg,3190621.jpg",
    "st": "allrecipes"
}