{
    "id": 57844,
    "old_rating": "4.55072",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 small onion, finely chopped",
        "1 clove garlic, crushed",
        "1 cup uncooked Arborio rice",
        "1/2 cup dry white wine",
        "2 1/2 cups boiling chicken stock",
        "1/2 cup frozen green peas",
        "2 ounces finely chopped ham",
        "salt and pepper to taste",
        "1/2 cup finely grated Parmesan cheese",
        "1 egg, beaten",
        "1 egg",
        "1 tablespoon milk",
        "4 ounces mozzarella cheese, cut into 3/4 inch cubes",
        "1/2 cup all-purpose flour",
        "1 cup dry bread crumbs",
        "1 cup vegetable oil for deep frying"
    ],
    "nut": [
        "Calories > 252 kcal",
        "Carbs > 18.8 g",
        "Cholesterol > 29 mg",
        "Fat > 16.4 g",
        "Protein > 6.3 g",
        "Sodium > 274 mg"
    ],
    "n": "Arancini",
    "a": "DEBMCD",
    "r": "0",
    "s": 18,
    "des": "\"An Italian rice ball made with white wine risotto, and a gooey mozzarella center.  Fantastic for lunch or dinner - can be frozen.\"",
    "ins": "Heat the olive oil in a large saucepan over medium heat. Add onion and garlic, and cook, stirring until onion is soft but not browned. Pour in the rice, and cook stirring for 2 minutes, then stir in the wine, and continue cooking and stirring until the liquid has evaporated. Add hot chicken stock to the rice 1/3 cup at a time, stirring and cooking until the liquid has evaporated before adding more.\nWhen the chicken stock has all been added, and the liquid has evaporated, stir in the peas and ham. Season with salt and pepper. Remove from the heat, and stir in the Parmesan cheese. Transfer the risotto to a bowl, and allow to cool slightly.\nStir the beaten egg into the risotto. In a small bowl, whisk together the remaining egg and milk with a fork. For each ball, roll 2 tablespoons of the risotto into a ball. Press a piece of the mozzarella cheese into the center, and roll to enclose. Coat lightly with flour, dip into the milk mixture, then roll in bread crumbs to coat.\nHeat oil for frying in a deep-fryer or large deep saucepan to 350 degrees F (175 degrees C). Fry the balls in small batches until evenly golden, turning as needed. Drain on paper towels. Keep warm in a low oven while the rest are frying.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "3644955.jpg",
    "o": "",
    "st": "allrecipes"
}