{
    "id": 57880,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup white rice",
        "2 1/2 cups water",
        "2 tablespoons vegetable oil",
        "1 pound skinless, boneless chicken breasts",
        "salt to taste",
        "garlic powder to taste",
        "1 head lettuce - rinsed, dried and torn",
        "3 large cucumbers, seeded and chopped",
        "1 large onion, finely diced",
        "2 tomatoes, diced",
        "1 bell pepper, diced",
        "1 cup chopped fresh cilantro",
        "1 cup freshly squeezed lime juice",
        "1/2 cup fish sauce",
        "1 tablespoon sugar",
        "1 tablespoon crushed red pepper flakes"
    ],
    "nut": [
        "Calories > 399 kcal",
        "Carbs > 55.8 g",
        "Cholesterol > 52 mg",
        "Fat > 8.9 g",
        "Protein > 26.8 g",
        "Sodium > 1822 mg"
    ],
    "n": "Easy Thai Beef or Chicken Salad",
    "a": "ALANE47",
    "r": "0",
    "s": 5,
    "des": "\"A simple Thai salad with fewer ingredients than usual. All my friends beg me to make this recipe for them. Use the taste test method for the dressing, adjusting the heat to your preference. I eat mine extremely hot!!! Also great with beef!\"",
    "ins": "Rinse rice in a fine mesh strainer under cold running water until no longer cloudy. Transfer to a medium saucepan and cover with 2 1/2 cups water. Bring to a boil, cover, and reduce heat to low. Simmer for 15 minutes, remove from heat and let stand for at least 10 minutes, or until all liquid has evaporated.\nPreheat oven to 250 degrees F (120 degrees C).\nSeason chicken with salt and garlic powder. Heat 2 tablespoons vegetable oil in a skillet over medium-high heat. Cook chicken, reducing heat when necessary, until no longer pink in center and juices run clear. Transfer to preheated oven to keep warm.\nPlace lettuce, cucumbers, onions, tomatoes, bell peppers, and cilantro together in a large mixing or serving bowl. Toss to combine. In another bowl, stir together the lime juice, fish sauce, sugar, and crushed red pepper until well blended and sugar is dissolved.\nRemove chicken from oven, slice into thin strips, and drizzle with dressing. Divide salad and rice among serving plates, and top each with chicken slices. Dressing may also be served at the table and each salad dressed individually.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "529507.jpg",
    "o": "",
    "st": "allrecipes"
}