{
    "id": 58367,
    "old_rating": "4.52941",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "10 pounds shortening",
        "10 pounds white sugar",
        "8 pounds brown sugar",
        "40 eggs",
        "10 pounds peanut butter",
        "14 pounds all-purpose flour",
        "3/4 cup baking soda",
        "5 teaspoons salt"
    ],
    "nut": [
        "Calories > 414 kcal",
        "Carbs > 46.2 g",
        "Cholesterol > 25 mg",
        "Fat > 23.6 g",
        "Protein > 6.8 g",
        "Sodium > 271 mg"
    ],
    "n": "School Cafeteria Peanut Butter Cookies",
    "a": "SCHETTIGGIRL",
    "r": "0",
    "s": 300,
    "des": "\"The best sublime peanut butter cookies ever! Relive the best part of the school cafeteria without having to go back to school. This large batch is best suited for institutional cooking using a 40 to 60 quart mixer. Dough may be stored in buckets for up to a week, and baked fresh daily.\"",
    "ins": "Preheat a convection oven to 325 degrees F (165 degrees C). See note for non-convection oven. Line baking sheets with parchment paper.\nIn a large bowl, cream together the shortening, white sugar and brown sugar until smooth. Mix in peanut butter until well blended. Scrape down the sides of the bowl with a plastic scraper between additions. Add eggs 5 or 6 at a time, mixing well after each addition. Scrape down bowl, and mix for a minute. Combine the flour, baking soda and salt; gradually mix into the dough until fully incorporated. Scrape down the sides of the bowl one more time, and be sure the bottom has mixed evenly.\nScoop out dough using an ice cream scoop, or roll into 2 inch balls. Place cookies 3 inches apart on the prepared baking sheets. Press down lightly with a fork to make a criss-cross pattern.\nBake for 7 minutes in the preheated oven, until the edges are lightly toasted. Allow cookies to cool on the baking sheet for at least 5 minutes so they do not crumble.",
    "pt": "15 m",
    "ct": "7 m",
    "tt": "22 m",
    "i": "34732.jpg",
    "o": "",
    "st": "allrecipes"
}