{
    "id": 58425,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1/2 pound pork loin, sliced and cut into thin strips",
        "1/2 red bell pepper, chopped",
        "1/2 yellow bell pepper, chopped",
        "1/2 green bell pepper, chopped",
        "1 carrot, peeled and chopped",
        "5 Brussels sprouts, trimmed and chopped",
        "4 cloves garlic, minced",
        "1/4 cup white onion, chopped",
        "4 sprigs Italian flat leaf parsley, chopped",
        "3 stalks celery, chopped",
        "2 (1/2 inch) pieces fresh ginger root, finely chopped",
        "1/2 (8 ounce) can water chestnuts, drained and chopped",
        "2 sprigs fresh mint, chopped"
    ],
    "nut": [
        "Calories > 423 kcal",
        "Carbs > 30.1 g",
        "Cholesterol > 55 mg",
        "Fat > 24.4 g",
        "Protein > 24.3 g",
        "Sodium > 152 mg"
    ],
    "n": "Mike's Magic",
    "a": "MYWIFESCOOK",
    "r": "0",
    "s": 2,
    "des": "\"This is my own recipe that I have done many times and everyone that has tried it seems to love the many flavors that it delivers. Pork is thinly sliced and stir-fried with bell peppers, celery, and Brussels sprouts. As you are using all fresh herbs there is no need to season with salt or pepper as this will take from the natural flavors.\"",
    "ins": "Heat olive oil in a large skillet over medium-high heat. Add pork strips, and fry until almost browned. Add red, yellow, and green bell peppers, carrot, and Brussels sprouts, and toss to coat with oil. Pour in enough water to coat the bottom of the pan, and cook stirring constantly, until the peppers begin to soften, about 5 minutes.\nReduce the heat to medium, and stir in garlic, onion, parsley, and celery. Simmer for 5 to 7 minutes, add ginger, simmer for a few more minutes, then stir in water chestnuts and mint. Simmer for 2 to 3 more minutes to blend flavors. When done, serve and enjoy. Your tastebuds will love you for this treat!",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "518003.jpg",
    "o": "",
    "st": "allrecipes"
}