{
    "id": 58465,
    "old_rating": "4.55263",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Pudding:",
        "2 tablespoons butter",
        "1 teaspoon white vinegar",
        "1/2 cup milk",
        "1 cup superfine sugar",
        "2 eggs",
        "1 tablespoon apricot jelly",
        "1 1/3 cups cake flour",
        "1 teaspoon baking soda",
        "1 pinch salt",
        "Sauce:",
        "1 cup heavy cream",
        "1/2 cup butter",
        "1/2 cup white sugar",
        "1/2 cup water, orange juice, or sherry"
    ],
    "nut": [
        "Calories > 396 kcal",
        "Carbs > 47.5 g",
        "Cholesterol > 102 mg",
        "Fat > 21.9 g",
        "Protein > 3.8 g",
        "Sodium > 237 mg"
    ],
    "n": "South African Malvapoeding (Marshmallow Pudding)",
    "a": "HYNCH",
    "r": "0",
    "s": 10,
    "des": "\"This rich, South African pudding contains no marshmallows, but probably got its name from its spongy texture! Delicious served hot or cold with cream.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). In a small saucepan over low heat, melt 2 tablespoons butter or margarine together with vinegar and milk. Remove from heat, and set aside.  Meanwhile, sift  flour, baking soda, and salt together into a separate bowl.\nBeat  1 cup sugar and eggs with an electric mixer on high speed until fluffy and light colored, about 5 minutes. Gradually mix in the apricot jam. Fold the dry ingredients into the egg mixture alternately with warmed milk mixture using a spatula. Pour batter into a greased, 1 quart oven-proof baking dish.\nBake approximately 45 minutes, or until a knife inserted into the center comes out clean.\nPlace cream, butter, 1/2 cup sugar, and water in a saucepan and stir over moderate heat until the butter has melted and sugar is dissolved. Do not allow the mixture to boil.\nRemove pudding from the oven, pierce several times with a skewer or fork, and pour the hot cream mixture immediately over the pudding. Serve hot or cold.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "340900.jpg",
    "o": "",
    "st": "allrecipes"
}