{
    "id": 59288,
    "old_rating": "4.64706",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons unsalted butter, divided",
        "2 tablespoons chopped garlic",
        "2 tablespoons finely chopped jalapeno pepper",
        "1/2 cup chicken stock",
        "1/4 cup tequila",
        "3 tablespoons lime juice",
        "3 tablespoons soy sauce",
        "4 skinless, boneless chicken breast halves - cut into cubes",
        "1 tablespoon cooking oil",
        "1/4 medium onion, thinly sliced",
        "1/2 medium red bell pepper, thinly sliced",
        "1 medium green bell pepper, thinly sliced",
        "1 1/2 cups heavy cream",
        "1/4 cup chopped fresh cilantro",
        "1/3 cup freshly grated Romano cheese"
    ],
    "nut": [
        "Calories > 430 kcal",
        "Carbs > 6.2 g",
        "Cholesterol > 149 mg",
        "Fat > 32.9 g",
        "Protein > 22.6 g",
        "Sodium > 608 mg"
    ],
    "n": "Texas Style Chicken Tequila",
    "a": "BRENDA BROADWAY",
    "r": "0",
    "s": 6,
    "des": "\"This dish is colorful and the ingredients prepared ahead of time. Your family and friends will love this recipe!   Note: the most time consuming part of this recipe is making the paste for the sauce (it gives an unique flavor and is worth the effort). The paste can be made ahead of time and stored in the fridge. Bring to room temperature before adding to the sauce.   Serve with your favorite noodles (1b of dry) or with mashed potatoes (5 medium.)\"",
    "ins": "Heat 2 tablespoons of butter in a small saucepan over medium heat. Add garlic and jalapeno, and saute until soft. Pour in chicken stock, tequila, and lime juice. Bring to a boil, then lower the heat and simmer until the mixture is reduced to a paste, about 15 minutes. Stir occasionally to make sure it is not sticking.\nWhile the sauce is cooking, place the chicken in a bowl, and pour soy sauce over it. Melt remaining butter in a skillet, and saute the onion, red bell pepper and green bell pepper until soft. Remove vegetables, and set aside.\nAdd oil to the skillet, and cook the chicken over medium-high heat until lightly browned. Pour in the sauce and heavy cream, and add the peppers. Bring to a boil, and simmer until chicken is cooked through, about 5 minutes. Remove from heat, and stir in Romano cheese and cilantro. Taste and adjust seasonings if desired. Serve immediately.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "50 m",
    "i": "67837.jpg",
    "o": "",
    "st": "allrecipes"
}