{
    "id": 59507,
    "old_rating": "4.46296",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "1 medium onion, finely chopped",
        "1 medium green bell pepper, finely chopped",
        "2 cloves garlic, minced",
        "1 cup salsa",
        "1 (15.25 ounce) can whole kernel corn, drained",
        "1 pound ground turkey",
        "1 (1.25 ounce) package taco seasoning mix",
        "1/3 cup dry bread crumbs",
        "6 (10 inch) flour tortillas",
        "6 tablespoons sour cream",
        "2 cups shredded lettuce"
    ],
    "nut": [
        "Calories > 509 kcal",
        "Carbs > 64.5 g",
        "Cholesterol > 62 mg",
        "Fat > 17.5 g",
        "Protein > 25.2 g",
        "Sodium > 1445 mg"
    ],
    "n": "Mexican Turkey Burgers",
    "a": "Daniel den Hoed",
    "r": "0",
    "s": 6,
    "des": "\"Inspired by Mexican tortillas, American burgers, and delicious breadcrumb coatings, I created this recipe. The whole family loves it, and whoever gets this recipe in hand passes it on. So I thought it was time to share it with you.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C). Coat a medium baking dish with cooking spray.\nHeat the olive oil in a skillet over medium heat, and saute the onion, green pepper, and garlic 5 minutes. Remove from heat, and cool slightly.\nIn a small bowl, mix the salsa and 1/2 the corn. In a large bowl, mix the onion mixture with the turkey, taco seasoning, and 2 tablespoons of the salsa mixture. Divide into 6 patties, and press into the breadcrumbs to lightly coat on all sides. Arrange coated patties in the prepared baking dish.\nBake the patties 10 minutes in the preheated oven. Drain any liquid from the dish, turn patties, and spread with the remaining salsa mixture. Continue baking 10 minutes, to an internal temperature of 165 degrees F (75 degrees C).\nWarm the tortillas in the microwave, about 30 seconds on High. Wrap the cooked turkey patties in the  warmed tortillas with sour cream and lettuce. Sprinkle with remaining corn to serve.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "37339.jpg",
    "o": "990443.jpg,970470.jpg,231691.jpg,213351.jpg,42236.jpg,18721.jpg",
    "st": "allrecipes"
}