{
    "id": 60264,
    "old_rating": "3.98077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 cups water",
        "2 cups uncooked long grain white rice",
        "6 slices bacon",
        "1 1/2 pounds ground beef",
        "1 onion, chopped",
        "1/2 green bell pepper, seeded and chopped",
        "1 (28 ounce) can peeled and diced tomatoes",
        "1 1/2 teaspoons salt",
        "1/4 teaspoon ground black pepper",
        "1 1/2 cups shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 391 kcal",
        "Carbs > 33.9 g",
        "Cholesterol > 69 mg",
        "Fat > 17.4 g",
        "Protein > 22 g",
        "Sodium > 771 mg"
    ],
    "n": "Texas Rice",
    "a": "WGADSTAR",
    "r": "0",
    "s": 10,
    "des": "\"It is not known where this recipe originated, but it has been used as a hot dish on outings and potlucks for at least 30 years. Rice and ground beef in tomato sauce, baked under a layer of shredded cheese. A great way to feed several with hamburger, and easy to keep on hand ingredients. Leftovers can be made into quick roll-ups by microwaving in a tortilla.\"",
    "ins": "Combine rice and water in a saucepan, and bring to a boil. Reduce heat, cover and simmer for 20 minutes.\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, reserving 2 tablespoons of drippings, crumble and set aside. Add ground beef, green pepper, and onion to the skillet; cook over medium-high heat until the beef is evenly browned. Drain excess grease, and season with salt and pepper.\nPreheat the oven to 400 degrees F (200 degrees C).\nPlace beef and cooked rice into a 9x13 inch baking dish. Stir in the tomatoes, bacon and reserved drippings, mixing until everything is well blended. Spread the shredded cheese over the top.\nBake for 30 minutes in the preheated oven, until cheese is bubbly, and the center is heated through.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "1069142.jpg",
    "o": "3480681.jpg,3401357.jpg,2644502.jpg,2212764.jpg,1986265.jpg,883069.jpg",
    "st": "allrecipes"
}