{
    "id": 60347,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (2 to 3 pound) whole chicken",
        "2 (14.5 ounce) cans chicken broth",
        "2 medium yellow onions, quartered",
        "1 bunch celery with leaves, cut into pieces",
        "1 (16 ounce) package baby carrots",
        "salt and ground black pepper to taste",
        "1/2 teaspoon garlic salt, or to taste",
        "5 eggs",
        "1/2 cup water",
        "1 teaspoon salt",
        "3 cups all-purpose flour",
        "1/2 teaspoon parsley flakes"
    ],
    "nut": [
        "Calories > 562 kcal",
        "Carbs > 45.3 g",
        "Cholesterol > 223 mg",
        "Fat > 25.2 g",
        "Protein > 36.3 g",
        "Sodium > 648 mg"
    ],
    "n": "Spaetzle and Chicken Soup",
    "a": "CARLY819",
    "r": "0",
    "s": 8,
    "des": "\"This recipe is from my grandma and I have loved it ever since I was a child. I could eat it EVERY day. The homemade noodles are simple, and you can use frozen chicken breast if you don't have time to use a whole chicken.\"",
    "ins": "Place chicken in a stock pot, and add enough water to cover. Pour in the chicken broth, and add celery and onions. Season with salt, pepper and garlic salt. Bring to a boil, and cook for about 1 hour to get a good broth.\nWhen the chicken is cooked through and tender, remove it to a platter and let sit until it is cool enough to handle. Strain broth, and discard celery and onions. Return the broth to the stock pot. Remove chicken meat from the bones, chop or tear into pieces, then return it to the pot also. Bring the broth to a boil, and add carrots.\nIn a medium bowl, stir together the eggs, water and salt. Gradually add flour until the dough is firm enough to form a ball. You may need more or less flour.  Pat the dough out on a flat plate. Using a butter knife, cut slices of dough off the edge of the plate so they are about 2 to 3 inches long. Allow them to fall directly into the boiling broth.\nOnce the carrots are tender, the soup is ready. Sprinkle with parsley flakes and serve.",
    "pt": "20 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "716099.jpg",
    "o": "1765471.jpg,1657800.jpg,539759.jpg,427567.jpg,340301.jpg,340300.jpg",
    "st": "allrecipes"
}