{
    "id": 60368,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/2 gallons water",
        "1 1/2 cups fish soup base",
        "2 pounds butter",
        "6 cups all-purpose flour",
        "6 1/2 cups marinara sauce",
        "1/4 cup OLD BAYÂ® Seasoning",
        "4 teaspoons ground white pepper",
        "1 cup lemon juice",
        "1/4 cup Worcestershire sauce",
        "3 tablespoons hot pepper sauce (e.g. Tabascoâ„¢)",
        "6 cups fresh Dungeness crabmeat",
        "1 cup heavy cream",
        "2/3 cup cooking sherry",
        "5 fluid ounces whiskey"
    ],
    "nut": [
        "Calories > 188 kcal",
        "Carbs > 13.2 g",
        "Cholesterol > 39 mg",
        "Fat > 12.5 g",
        "Protein > 4.5 g",
        "Sodium > 918 mg"
    ],
    "n": "Whiskey Crab Soup for a Big Party",
    "a": "TBONIKOW",
    "r": "0",
    "s": 72,
    "des": "\"Spicy Red Crab Soup for a big party like New Year's Eve! This makes a lot, so be sure to invite the whole neighborhood.\"",
    "ins": "Bring the water to a boil in a large stock pot. Stir in soup base, and lower heat to a simmer. Melt the butter in a skillet over low heat. Gradually whisk in the flour so as not to form any lumps. Pour this mixture into the broth. Cover, and simmer over low heat for 5 to 7 minutes.\nPour the marinara sauce into the thickened broth, and season with OLD BAY(R), white pepper, lemon juice and hot pepper sauce. Stir until blended, making sure to scrape the bottom and sides of the pot. Add the crabmeat, and stir vigorously to break into pieces.\nStir in the heavy cream until blended, then mix in the sherry and whiskey. Taste and adjust the seasoning as needed. If the soup is too salty, add more heavy cream.  Add more lemon if there is no tang; more white pepper if not spicy enough. Remove from the heat. Pour into hotel pans to a depth of 4 inches or less, and refrigerate if making ahead of time. Reheat to 140 degrees F (62 degrees C) before serving.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}