{
    "id": 60863,
    "old_rating": "4.18182",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "4 skinless, boneless chicken breast halves - pounded thin",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "3 potatoes, peeled and quartered",
        "2 green bell peppers, cut into strips",
        "2 teaspoons dried oregano",
        "1 teaspoon onion powder",
        "1/4 teaspoon crushed red pepper flakes",
        "1 (14.5 ounce) can diced tomatoes",
        "3 tablespoons tomato paste",
        "1 (14.5 ounce) can chicken broth"
    ],
    "nut": [
        "Calories > 316 kcal",
        "Carbs > 37.4 g",
        "Cholesterol > 59 mg",
        "Fat > 6.1 g",
        "Protein > 27.3 g",
        "Sodium > 461 mg"
    ],
    "n": "Chicken Pizzaiola",
    "a": "KXR173",
    "r": "0",
    "s": 4,
    "des": "\"This mouth-watering chicken and potato dish satisfies all your taste buds!\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Prepare a 9x13 inch baking dish with cooking spray.\nHeat the oil in a large skillet over medium heat. Season the chicken breasts on both sides with the salt and pepper. Cook the chicken in the hot oil until completely browned, 2 to 3 minutes per side. Transfer the chicken to the prepared baking dish; cover tightly with aluminum foil.\nPlace the potatoes and bell peppers in the skillet. Season with oregano, onion powder, and red pepper flakes. Cook and stir until the vegetables soften, 10 to 15 minutes. Add the tomatoes, tomato paste, and chicken broth to the skillet; bring to a boil. Remove from heat and pour over the chicken breasts; tightly cover again with the aluminum foil.\nBake in the preheated oven until the chicken is no longer pink in the center and the juices run clear, about 45 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "563733.jpg",
    "o": "",
    "st": "allrecipes"
}