{
    "id": 60861,
    "old_rating": "4.36364",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups warm water",
        "1 (.25 ounce) envelope active dry yeast",
        "1 tablespoon white sugar",
        "4 cups all-purpose flour",
        "1 1/4 teaspoons salt, or to taste",
        "1/4 cup corn oil",
        "1 egg",
        "1 tablespoon water",
        "1 tablespoon caraway seed (optional)"
    ],
    "nut": [
        "Calories > 309 kcal",
        "Carbs > 50.1 g",
        "Cholesterol > 23 mg",
        "Fat > 8.3 g",
        "Protein > 7.7 g",
        "Sodium > 375 mg"
    ],
    "n": "Noni Afghani",
    "a": "ladyheather06",
    "r": "0",
    "s": 8,
    "des": "\"This is an easy bread recipe that results in a soft, tender flatbread. My native Afghani friend says that this bread tastes better than the traditional bread she buys at the store. Enjoy!\"",
    "ins": "In a small bowl, stir together 1/2 cup warm water and sugar. Sprinkle the yeast over the top, and let stand for about 10 minutes, until foamy.\nPlace flour in a large bowl, and stir in salt. Make a well in the center, and pour in the corn oil and yeast mixture. Add the remaining water in small amounts until you have a soft moist dough that can be handled.  Turn out onto a floured surface, and knead for at least 5 minutes. Return to the bowl, cover with a towel, and let rise until doubled in size, about 1 1/2 hours.\nPreheat the oven to 350 degrees F (175 degrees C). Deflate the risen dough, and divide into 8 pieces. Roll each piece into a ball.\nOn a lightly floured surface, roll each ball with a rolling pin so it is oval shaped, about 6 inches long, and 1/2 inch thick. Use a fork or dull knife to draw three lines on the top of each loaf. Place the loaves on a baking sheet. Mix together the egg and remaining tablespoon of water; brush the tops of the loaves with the mixture. Sprinkle caraway seeds over the tops, if using.\nBake for 20 to 25 minutes in the preheated oven, until the loaves are shiny and golden brown.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "2 h ",
    "i": "2091981.jpg",
    "o": "3701176.jpg,3453255.jpg,492712.jpg,200929.jpg,23374.jpg,12621.jpg",
    "st": "allrecipes"
}