{
    "id": 60908,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 small unripe (green) bananas",
        "2 tablespoons olive oil, divided",
        "1 green bell pepper, sliced into thin rings",
        "1 cup small shrimp - peeled and deveined",
        "1 cup crabmeat",
        "1 sweet onion, chopped",
        "1 pinch salt and pepper to taste",
        "1 teaspoon white sugar",
        "3/4 cup red wine vinegar",
        "2 slices crisp cooked bacon, crumbled",
        "1 hard-cooked egg, peeled and sliced (optional)"
    ],
    "nut": [
        "Calories > 227 kcal",
        "Carbs > 31.1 g",
        "Cholesterol > 83 mg",
        "Fat > 7.4 g",
        "Protein > 11.8 g",
        "Sodium > 182 mg"
    ],
    "n": "Joy's Green Banana Salad",
    "a": "Joy",
    "r": "0",
    "s": 6,
    "des": "\"A recipe from my kitchen when I was in Puerto Rico made with green bananas, sweet onion and bacon in a vinegar dressing. I have served it to my North American friends and they love it as well. It is great to serve instead of the same ol' potato salad. Dare to try something new?\"",
    "ins": "Bring a large pot of water to a boil. Cut the ends off of the bananas, and make a slit lengthwise down the peel. Cook bananas in boiling water until tender (similar to a potato).  Drain, cool, and remove peels. Cut into small chunks and place in a serving bowl. Drizzle 1 tablespoon of olive oil over the pieces, and stir to coat.\nMeanwhile, heat the remaining tablespoon of oil in a skillet over medium-high heat. Add shrimp and crab, and fry until cooked through, about 5 minutes. Set aside to cool.\nAdd onions, green pepper and seafood to the bananas in the bowl. In a separate bowl, whisk together the red wine vinegar, sugar and bacon pieces. Pour this mixture over the bananas, and toss lightly to coat. Season with salt and pepper. Garnish with slices of hard-cooked egg if desired.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "1061331.jpg",
    "o": "",
    "st": "allrecipes"
}