{
    "id": 61410,
    "old_rating": "4.30872",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup crushed chocolate cookies",
        "1/4 cup butter, softened",
        "2 tablespoons white sugar",
        "1/4 teaspoon unsweetened cocoa powder",
        "3 (8 ounce) packages cream cheese, softened",
        "1 cup white sugar",
        "3 eggs",
        "1/2 pound semisweet chocolate chips",
        "2 tablespoons heavy cream",
        "1 cup sour cream",
        "1 pinch salt",
        "3/4 cup Irish stout beer (e.g. GuinnessÂ®)",
        "2 teaspoons vanilla extract",
        "1 (1 ounce) square semisweet chocolate"
    ],
    "nut": [
        "Calories > 521 kcal",
        "Carbs > 41.9 g",
        "Cholesterol > 130 mg",
        "Fat > 37.3 g",
        "Protein > 8.2 g",
        "Sodium > 278 mg"
    ],
    "n": "GuinnessÂ® and Chocolate Cheesecake",
    "a": "M. Wassenaar",
    "r": "0",
    "s": 12,
    "des": "\"A close friend is a cheesecake and Guinness fanatic. He requested a Guinness cheesecake for his 25th birthday; this is the result. It is quite smooth and very rich.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Prepare a 9 inch springform pan with butter.\nCombine the crushed cookies, butter, 2 tablespoons sugar, and cocoa in a small bowl; mix; press into the bottom of the prepared springform pan.\nPlace the cream cheese in a large bowl and beat with an electric mixer set to low speed until smooth. While beating, slowly add 1 cup sugar and then the eggs, one at a time. Continue beating until smooth.\nCombine the chocolate chips and heavy cream in a microwave-safe bowl. Heat in the microwave until the chocolate is completely melted, stirring every 30 seconds. Beat the chocolate into the cream cheese mixture. Add the sour cream, salt, beer, and vanilla; blend until smooth. Pour the mixture over the crust. Place the pan into a large, deep baking dish. Fill the dish with water to cover the bottom half of the springform pan.\nBake the cheesecake in the water bath in the preheated oven for 45 minutes; turn oven off; leave the cheesecake in the oven with oven door slightly ajar another 45 minutes; remove from oven. Run a knife along the edge of the cheesecake to loosen from pan. Chill in refrigerator at least 4 hours.\nMelt the semisweet chocolate in a small bowl using the microwave. Make chocolate clovers by dropping 3 small drops of melted chocolate close to one another on waxed paper. Drag a toothpick from between two dots outward to make the stem; chill until hardened. Arrange the chocolate clovers on top of the chilled cheesecake for decoration.",
    "pt": "35 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "2187266.jpg",
    "o": "4487052.jpg,1127432.jpg,1113782.jpg,995951.jpg,808977.jpg,808192.jpg",
    "st": "allrecipes"
}