{
    "id": 63250,
    "old_rating": "4.42222",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 green bell pepper, thinly sliced",
        "1 red bell pepper, thinly sliced",
        "1 yellow bell pepper, thinly sliced",
        "3 medium fresh tomatoes - cored, quartered, and sliced as thin as possible",
        "1 large cucumber - peeled, seeded, and thinly sliced",
        "1 Spanish onion - peeled, cut in half, and thinly sliced",
        "Dressing:",
        "1/3 cup red wine vinegar",
        "3/4 cup extra-virgin olive oil",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 teaspoon white sugar",
        "1/4 teaspoon dried oregano",
        "1/4 teaspoon dried basil",
        "1/4 teaspoon dried marjoram",
        "chopped fresh parsley"
    ],
    "nut": [
        "Calories > 300 kcal",
        "Carbs > 11.1 g",
        "Cholesterol > 0 mg",
        "Fat > 28.3 g",
        "Protein > 1.7 g",
        "Sodium > 395 mg"
    ],
    "n": "Basque Salad",
    "a": "MARILYN PERZIK",
    "r": "0",
    "s": 6,
    "des": "\"This recipe is inspired by Woolgrowers Restaurant in Bakersfield, California.  Among the many appetizers they give, there is one that is very much like this salad which is handy to have in the refrigerator.  It is very good and close to my inspiration.\"",
    "ins": "In a large bowl, toss together the green, red, and yellow peppers with the tomatoes, cucumber, and onion.\nIn a medium bowl, whisk together the vinegar and olive oil. Season with salt, pepper, and sugar. Whisk in oregano, basil, and marjoram. Continue whisking until ingredients are well blended and the oil and vinegar are emulsified.\nPour dressing over vegetables, and toss gently with a wooden spoon. Cover, and marinate at room temperature for 1 to 2 hours, stirring frequently. Refrigerate until 1 hour before serving; then remove from the refrigerator, and let sit at room temperature. Garnish with chopped parsley.",
    "pt": "40 m",
    "ct": "",
    "tt": "",
    "i": "2467214.jpg",
    "o": "2417165.jpg,1485329.jpg,1226816.jpg,943706.jpg,760535.jpg,461016.jpg",
    "st": "allrecipes"
}