{
    "id": 64376,
    "old_rating": "4.2381",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package tempeh, cut into 1/2 inch squares",
        "16 fresh white mushrooms",
        "1 medium eggplant, cut into 1 inch cubes",
        "1 large red bell pepper, cut into 1 inch pieces",
        "16 cherry tomatoes",
        "8 tablespoons olive oil",
        "4 tablespoons soy sauce",
        "4 tablespoons teriyaki sauce",
        "3 tablespoons honey",
        "1 tablespoon grated fresh ginger root",
        "1 tablespoon chopped fresh garlic",
        "salt and pepper to taste",
        "2 cups vegetable broth",
        "1 tablespoon grated fresh ginger root",
        "1 teaspoon ground cumin",
        "salt to taste",
        "1 cup dry couscous",
        "3/4 cup raisins",
        "3/4 cup drained canned chick-peas (garbanzo beans)",
        "1 lemon"
    ],
    "nut": [
        "Calories > 820 kcal",
        "Carbs > 110.1 g",
        "Cholesterol > 0 mg",
        "Fat > 35.3 g",
        "Protein > 26.8 g",
        "Sodium > 2132 mg"
    ],
    "n": "Tempeh Kabobs with Moroccan Couscous",
    "a": "TRUCKERDOO",
    "r": "0",
    "s": 4,
    "des": "\"Soaked in a delectable honey soy marinade, and paired with grilled vegetables and a Moroccan-style couscous, both meat eaters and vegetarians will enjoy this dinner.\"",
    "ins": "Place tempeh, mushrooms, eggplant, red bell pepper, and cherry tomatoes in a large resealable plastic bag. In a mixing bowl, whisk together olive oil, soy sauce, teriyaki sauce, and honey; season with 1 tablespoon ginger, 1 tablespoon garlic, and salt and pepper to taste. Pour mixture over tempeh and veggies, seal, and shake to coat.  Refrigerate for 2 hours.\nPreheat grill for medium-high heat. Thread tempeh and veggies on skewers. Reserve remaining marinade.\nGrill skewers, turning often to make sure everything is cooked evenly. These can also be done in the broiler.\nWhile grilling kabobs, combine vegetable stock, 1 tablespoon grated ginger, cumin, and salt. Bring to a light boil. Stir in couscous, raisins, and garbanzo beans; cover, and remove from heat.  Let sit for five minutes, or until fluffy. Just before serving, squeeze lemon over couscous and stir. Serve kabobs with reserved marinade.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "2 h ",
    "i": "1175173.jpg",
    "o": "",
    "st": "allrecipes"
}