{
    "id": 64538,
    "old_rating": "4.27027",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 fresh bratwurst sausages",
        "1 green bell pepper, sliced into long strips",
        "1 red bell pepper, sliced into long strips",
        "1 large sweet onion, sliced into rings and separated",
        "2 cloves garlic, sliced",
        "2 bay leaves",
        "1 teaspoon liquid smoke flavoring",
        "2 cups honey mustard barbecue sauce",
        "1 (12 fluid ounce) can beer, or as needed",
        "10 hoagie rolls, split lengthwise"
    ],
    "nut": [
        "Calories > 787 kcal",
        "Carbs > 96.6 g",
        "Cholesterol > 63 mg",
        "Fat > 32.2 g",
        "Protein > 23.7 g",
        "Sodium > 2022 mg"
    ],
    "n": "Honey Mustard Beer Brats",
    "a": "RICOCHETRABBIT",
    "r": "0",
    "s": 10,
    "des": "\"This recipe is very easy and makes delicious bratwurst.  My guests always ask for these during football season.  You won't be able to get enough onions and peppers in the slow cooker because every time we make them, we run out!  This recipe is for 10.  If you have a very large slow cooker, you can get 15 in, but most can only hold 10 (you may need another slow cooker if making more).\"",
    "ins": "Place half of the bratwurst in the bottom of a 5 quart slow cooker. Arrange half of the green pepper, red pepper, and onion over them. Layer the remaining bratwurst over the top, and top with the remaining red and green bell peppers and onion. Throw in the garlic and bay leaves. In a separate bowl, mix together HALF of the  honey mustard sauce, liquid smoke and beer. Pour into the slow cooker. Add more beer if necessary to cover everything in the pot. Cover, and cook on Low for 4 to 5 hours.\nPreheat an outdoor grill for high heat, and lightly oil grate. Remove bratwurst from the slow cooker, but leave onions and peppers inside. Place bratwurst on the grill and baste with some of the remaining honey mustard sauce. Turn occasionally until slightly charred.\nPlace bratwurst on rolls, and use tongs to pull out a few of the onions and peppers from the slow cooker and drape them over the sausage. The onions and peppers are very tasty so don't forget this part!",
    "pt": "15 m",
    "ct": "5 h",
    "tt": "5 h ",
    "i": "803514.jpg",
    "o": "4031968.jpg,1049533.jpg,803513.jpg,796241.jpg,796239.jpg,223243.jpg",
    "st": "allrecipes"
}