{
    "id": 64646,
    "old_rating": "4.09677",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 ounces penne pasta",
        "1/4 cup Parmesan cheese",
        "1/2 cup crushed saltine crackers",
        "1 tablespoon olive oil",
        "1/2 onion, chopped",
        "2 cups chopped zucchini",
        "1 tomato, chopped",
        "2 cloves garlic, minced",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon dried basil",
        "1 pinch dried celery flakes",
        "salt and pepper to taste",
        "1 cup shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 271 kcal",
        "Carbs > 37.2 g",
        "Cholesterol > 15 mg",
        "Fat > 7.9 g",
        "Protein > 12.7 g",
        "Sodium > 336 mg"
    ],
    "n": "Zucchini Pasta Bake",
    "a": "RUTH GOOCH",
    "r": "0",
    "s": 6,
    "des": "\"The crunchy Parmesan on top and the gooey melted mozzarella mixed throughout make this baked pasta dish a real treat! It's great at the height of summer when the tomatoes and zucchini come straight from the garden!\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Add penne pasta, cook for 10 to 12 minutes, until al dente, and drain. Lightly grease a medium casserole dish.\nPreheat oven to 350 degrees F (175 degrees C). In a blender or food processor, thoroughly mix the Parmesan cheese and crackers.\nHeat the oil in a skillet over medium heat. Place the onion in the skillet, and cook and stir until tender. Mix in the zucchini, tomato, and garlic, and season with oregano, basil, celery, salt, and pepper. Continue to cook and stir until the zucchini is tender.\nIn the prepared casserole dish, mix the pasta with the vegetable mixture and mozzarella cheese. Top evenly with the Parmesan cheese mixture.\nBake 25 minutes in the preheated oven, or until the topping is lightly browned. Allow to sit 5 minutes before serving.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "4539914.jpg",
    "o": "4539898.jpg,3880730.jpg,3646129.jpg,1493600.jpg,715418.jpg,130404.jpg",
    "st": "allrecipes"
}