{
    "id": 64780,
    "old_rating": "4.58537",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup all-purpose flour",
        "1/2 cup butter, softened",
        "2 tablespoons water",
        "1/2 cup butter",
        "1 cup water",
        "1 teaspoon almond extract",
        "3 eggs, beaten",
        "1 cup all-purpose flour",
        "1 cup confectioners' sugar",
        "1 teaspoon almond extract",
        "1 tablespoon milk, or as needed",
        "candy sprinkles (optional)"
    ],
    "nut": [
        "Calories > 424 kcal",
        "Carbs > 42 g",
        "Cholesterol > 131 mg",
        "Fat > 25.9 g",
        "Protein > 5.9 g",
        "Sodium > 193 mg"
    ],
    "n": "Danish Almond Puff",
    "a": "WarringEagle",
    "r": "0",
    "s": 8,
    "des": "\"My mom used to make this Almond Puff every year for Christmas. It is very elegant and pretty--and surprisingly easy to make. I almost always have every ingredient already in my cupboard. I made it myself for the first time and my husband loved it. I'm planning to make it for his mom when she comes to visit. This is a fun one to share.\"",
    "ins": "Place 1 cup of flour in a medium bowl. Mix in butter using a fork or a pastry blender. Sprinkle 2 tablespoons of water over, and stir with a fork until dough comes together. Divide into two balls. Pat dough into two long strips on an ungreased baking sheet, about 14 inches long and 3 inches wide. Set aside.\nPreheat the oven to 350 degrees F (175 degrees C).\nIn a saucepan, combine 1/2 cup of butter and 1 cup of water. Bring to a rolling boil. Add 1 teaspoon of almond extract and remove from the heat. Immediately stir in 1 cup of flour until the mixture pulls away from the sides of the pan. Gradually stir in the eggs until well blended. Divide evenly, and spread over the two crusts on the baking sheet.\nBake in the preheated oven until golden, about 1 hour. Allow to cool almost to room temperature before frosting.\nTo make the frosting, mix together the confectioners' sugar, 1 teaspoon of almond extract and a splash of milk in a small bowl until smooth. Add more milk if necessary to make a pourable glaze. Drizzle over the Danish, and decorate with candy sprinkles if desired.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "2 h",
    "i": "199258.jpg",
    "o": "",
    "st": "allrecipes"
}