{
    "id": 65016,
    "old_rating": "4.50538",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "1/8 yellow onion, minced",
        "1 Granny Smith apple - peeled, cored and diced",
        "2 stalks celery ribs, finely chopped",
        "1/4 cup dried cranberries",
        "1 teaspoon kosher salt",
        "5 (1 inch thick) boneless pork chops",
        "1 cup apple juice",
        "1 tablespoon cornstarch",
        "2 tablespoons brown sugar",
        "1 teaspoon freshly ground black pepper"
    ],
    "nut": [
        "Calories > 314 kcal",
        "Carbs > 22 g",
        "Cholesterol > 73 mg",
        "Fat > 15 g",
        "Protein > 22.8 g",
        "Sodium > 467 mg"
    ],
    "n": "Apple Cranberry Stuffed Pork Chops",
    "a": "JNODWELL",
    "r": "0",
    "s": 5,
    "des": "\"These savory pork chops are stuffed with a sumptuous apple-cranberry mixture and served with an apple reduction glaze. They are excellent served with rosemary potatoes and tender whole green beans.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nIn a Dutch oven, melt 1 tablespoon butter over medium heat. Cook onion in butter until the onions are very soft and begin to brown. Remove from heat. Stir in apple, celery, and dried cranberries. Season with salt.\nLay each chop flat on cutting board, and with a sharp knife held parallel to the board, cut a pocket into the pork, leaving three sides intact. Stuff each chop with apple-cranberry mixture.\nMelt remaining butter in the Dutch oven over medium heat. Pan-fry chops in butter for two minutes on each side. Cover, and bake in preheated oven for 45 minutes.\nTransfer chops from pan to a plate, and cover with foil. Place the Dutch oven back on the stovetop over medium heat. In a small bowl or measuring cup, stir together apple juice, cornstarch, and brown sugar; pour into Dutch oven. Reduce liquid volume by half, stirring frequently. Season to taste with black pepper. Serve this apple glaze over pork chops.",
    "pt": "45 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "2114029.jpg",
    "o": "3983172.jpg,3548007.jpg,1578650.jpg,1578619.jpg,922006.jpg,67614.jpg",
    "st": "allrecipes"
}