{
    "id": 65217,
    "old_rating": "3.7",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup yellow split peas (tuvar dal)",
        "2 cups water",
        "1/2 cup tamarind pulp",
        "1/2 cup water",
        "1 green bell pepper, sliced",
        "1 tomato, chopped",
        "1 1/2 teaspoons coriander seeds",
        "1 teaspoon yellow lentils (chana dal)",
        "1 tablespoon unsweetened flaked coconut",
        "2 dried red chile peppers",
        "2 teaspoons vegetable oil",
        "1 teaspoon mustard seed",
        "1 teaspoon cumin seed",
        "1/4 teaspoon asafoetida powder"
    ],
    "nut": [
        "Calories > 306 kcal",
        "Carbs > 55.9 g",
        "Cholesterol > 0 mg",
        "Fat > 3.9 g",
        "Protein > 15.4 g",
        "Sodium > 10 mg"
    ],
    "n": "Sambar",
    "a": "NAGARAM",
    "r": "0",
    "s": 4,
    "des": "\"Lightly spiced lentils in a tamarind and coconut sauce, tempered with Indian spices. Serve hot with rice. Try it with other vegetables too, such as potato, cauliflower or okra. The ingredients should be available at any Indian market or at specialty stores. The tamarind pulp may be substituted with reconstituted tamarind paste.\"",
    "ins": "Place yellow split peas in a saucepan with 2 cups  water and bring to a boil. Reduce heat to medium-low, and cook until soft, about 15 minutes. In another saucepan, mix together the tamarind pulp stir in 1/2 cup water to make a watery juice. Bring to a boil over medium-high heat. Add the bell pepper and tomato to the tamarind juice, and continue to boil until the vegetables are soft, and the liquid has reduced to almost half.\nMeanwhile, grind the coriander seeds, yellow lentils, coconut and chilies to a paste using a mortar and pestle or food processor. Add this paste to the tamarind sauce, then stir in the yellow lentils until everything is well blended. Bring to a boil once again, then remove from the heat and set aside.\nHeat oil in a small skillet over medium heat, and add the mustard seed, cumin seed, and asafoetida powder. Once the mustard seeds start to sputter and the mixture is fragrant, remove from heat and stir into sambar. Serve hot.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "199441.jpg",
    "o": "",
    "st": "allrecipes"
}