{
    "id": 65892,
    "old_rating": "3.35484",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large butternut squash - halved lengthwise, peeled and seeded",
        "2 teaspoons butter",
        "salt and ground black pepper to taste",
        "1/2 teaspoon allspice",
        "1/2 teaspoon ground nutmeg",
        "2 teaspoons ground cinnamon",
        "1/2 cup Parmesan cheese",
        "50 wonton wrappers",
        "1 teaspoon egg white, lightly beaten",
        "Sauce",
        "1/4 cup unsalted butter",
        "1/4 cup chopped fresh sage leaves",
        "salt and freshly ground black pepper to taste"
    ],
    "nut": [
        "Calories > 271 kcal",
        "Carbs > 40.2 g",
        "Cholesterol > 27 mg",
        "Fat > 9.2 g",
        "Protein > 7.9 g",
        "Sodium > 512 mg"
    ],
    "n": "Butternut Squash Ravioli with Sage-Brown Butter Sauce",
    "a": "Lorna",
    "r": "0",
    "s": 8,
    "des": "\"This is an easy recipe that will amaze your guests with its elegance and complex flavors.  The secret is using won-ton wrappers instead of pasta. This raviolis can also be prepared ahead and frozen, which makes it even more versatile! Try experimenting with acorn, pumpkin or another winter squash.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nPlace the squash cut side up on a baking sheet. Place 1 tablespoon butter in the hollow of each half. Sprinkle with salt and pepper to taste. Cover the squash with a sheet of aluminum foil tucking in the edges.\nBake squash in preheated oven until tender and easily pierced with a fork, 45 to 65 minutes.\nScoop the cooked squash into a bowl, and mash until smooth. Mix in the allspice, nutmeg, cinnamon, and Parmesan cheese until well blended. Season to taste with salt and pepper.\nFill a deep pot with lightly salted water and bring to a boil.\nTo make the ravioli, place a wonton wrapper on a clean, flat surface. Brush edges with the egg white. Place about 1 tablespoon of the squash mixture in the middle of the wonton. Cover with a second wonton wrapper. Repeat with remaining wonton wrappers and squash mixture until all have been used.\nDrop the ravioli into the boiling water, and cook for 3 to 5 minutes, or until tender. Remove, drain, and keep warm until sauce is prepared.\nTo make the sauce, melt the butter in a skillet over medium heat. Stir in the sage. Continue to cook and stir until the sage is crispy but not browned. Add salt and pepper to taste. Place 6 to 8 raviolis on serving plates, and drizzle with sauce.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "2734547.jpg",
    "o": "4181646.jpg,704848.jpg,704847.jpg,491809.jpg,491807.jpg,418573.jpg",
    "st": "allrecipes"
}