{
    "id": 66357,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 fresh jalapeno pepper, seeded and minced",
        "6 cloves garlic, minced",
        "1/2 cup lemon juice",
        "1 (3 1/2) pound fryer or boiler chicken, cut into pieces",
        "1 large onion, diced",
        "1 tablespoon ground allspice",
        "2 bay leaves",
        "1 teaspoon cardamom",
        "1/2 teaspoon crushed dried rosemary",
        "salt and pepper to taste",
        "1 teaspoon allspice",
        "3 (7-inch) pita flat breads",
        "3 cups cooked white or brown rice",
        "2 tablespoons chopped fresh parsley for garnish"
    ],
    "nut": [
        "Calories > 580 kcal",
        "Carbs > 73 g",
        "Cholesterol > 87 mg",
        "Fat > 15 g",
        "Protein > 35.2 g",
        "Sodium > 250 mg"
    ],
    "n": "Fetat Jaj with Deaa",
    "a": "IMANKAY",
    "r": "0",
    "s": 8,
    "des": "\"This Arabic casserole starts out with cut up bread on the bottom soaked with chicken broth and then topped with rice and chicken.\"",
    "ins": "To make the deaa, mix together the jalapeno, garlic, and lemon juice. Cover and refrigerate until ready to serve. This spicy relish should be offered on the side of the casserole, so that your guests can add spice to their taste.\nPlace the chicken in a Dutch oven and fill with enough water to cover; stir in the onion, 1 tablespoon of allspice, bay leaves, cardamom, rosemary, salt, and pepper.\nBring to a boil over high heat, then reduce to medium-low and simmer for 1 hour.\nPreheat oven for broil.\nRemove the chicken pieces from the Dutch oven and place on a baking sheet; season each piece with salt and pepper and  the remaining allspice. Reserve the chicken stock.\nBroil the chicken pieces on the top rack of the oven until the chicken starts to crisp and turns golden brown.\nCut the pita bread into large chunks, and arrange the pieces in layer across the bottom of a casserole dish, then spread the rice over the pita. Pour 4 cups of the reserved stock over the pita and rice, allow to stand for 5 minutes to soak in the stock. If necessary, add more stock to make the dish moist. Place the chicken  on top of the rice and garnish with parsley.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}