{
    "id": 67432,
    "old_rating": "4.68144",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 (6 ounce) filet mignon steaks",
        "seasoned salt to taste",
        "cracked black pepper to taste",
        "1/4 cup extra virgin olive oil",
        "1/4 cup balsamic vinegar",
        "1 tablespoon Dijon mustard",
        "2 teaspoons dried rosemary",
        "1 tablespoon butter",
        "2 cups onion slices",
        "1 teaspoon white sugar",
        "4 ounces blue cheese, crumbled"
    ],
    "nut": [
        "Calories > 590 kcal",
        "Carbs > 13.4 g",
        "Cholesterol > 125 mg",
        "Fat > 43.4 g",
        "Protein > 35.3 g",
        "Sodium > 689 mg"
    ],
    "n": "Smothered Filet Mignon",
    "a": "JDVMD",
    "r": "0",
    "s": 4,
    "des": "\"A great combination of flavors. Serve with some mashed garlic red potatoes and sweetened green beans for a fabulous special occasion meal. Don't forget to serve a bottle of Cabernet or Zinfandel.\"",
    "ins": "Season steaks with seasoned salt and black pepper, and arrange in a single layer in a large baking dish. In a bowl, whisk together olive oil, balsamic vinegar, mustard, and rosemary. Pour mixture over filets, and turn to coat. Marinate for up to 30 minutes.\nWhile you are marinating the meat, melt the butter in a skillet over medium heat. Cook onion slices in butter until soft, then stir in sugar. Continue cooking until onions are caramelized. Set aside.\nPreheat grill for high heat on one side, and medium heat on the other side.\nLightly oil the grill grate. Place steaks on the hot side of the grill, and cook for 10 minutes, turning once. When the steaks are almost done, move to the cooler side of the grill. Top each filet with a quarter of the caramelized onions and blue cheese. Close the lid, and continue cooking until the cheese is melted.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "1 h",
    "i": "1335503.jpg",
    "o": "4389597.jpg,4373308.jpg,3683467.jpg,3169694.jpg,2613743.jpg,2433467.jpg",
    "st": "allrecipes"
}