{
    "id": 67630,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 ounces chestnuts",
        "3 tablespoons butter",
        "1/2 cup chopped onions",
        "1/2 cup chopped carrots",
        "3 tablespoons all-purpose flour",
        "1 1/2 cups beef broth",
        "1/2 bay leaf, crumbled",
        "1 teaspoon coarsely ground black pepper",
        "1 teaspoon salt",
        "4 tablespoons Madeira wine",
        "2 (6 ounce) venison steaks (about 1 1/4 inches thick)"
    ],
    "nut": [
        "Calories > 311 kcal",
        "Carbs > 29.2 g",
        "Cholesterol > 83 mg",
        "Fat > 11.2 g",
        "Protein > 19 g",
        "Sodium > 982 mg"
    ],
    "n": "Big Joe's Venison Steak in Chestnut Sauce",
    "a": "ELVISLIVES56",
    "r": "0",
    "s": 4,
    "des": "\"My uncle, Big Joe, had a Thanksgiving tradition of showing the kids 'Bambi' and then serving us this venison. However, it is truly delicious.\"",
    "ins": "Preheat oven to 425 degrees F (200 degrees C). Slice the skin to allow steam to escape. Place the chestnuts in a baking pan, and bake in the preheated oven for 15 minutes.  Remove from oven, and cool. Peel off the shell, and chop. You should have about 1 cup chopped chestnuts.\nMelt butter in a large skillet over medium heat. Cook, stirring often, the onions and carrots in the butter until soft. Stir in the flour, and cook until the flour browns. Mix in the broth, and season with bay leaf, and salt and pepper. Simmer for 15 minutes.\nPreheat broiler, and position a rack 5 inches below the broiler element.  Place the venison steaks in a broiling pan. Cook 5 minutes on each side. Transfer to a hot platter.\nStrain the solids from the broth, and return the broth to the pan. Stir in Madeira and chestnuts. Pour hot chestnut sauce over venison steaks, and serve.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h",
    "i": "525647.jpg",
    "o": "",
    "st": "allrecipes"
}