{
    "id": 67753,
    "old_rating": "4.41176",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds small round red potatoes",
        "4 slices bacon",
        "1 cup sour cream",
        "1/2 teaspoon seasoned salt",
        "1/4 teaspoon black pepper",
        "1 tablespoon chopped fresh chives",
        "1/2 cup shredded Cheddar cheese",
        "parsley"
    ],
    "nut": [
        "Calories > 36 kcal",
        "Carbs > 3 g",
        "Cholesterol > 5 mg",
        "Fat > 2.2 g",
        "Protein > 1.3 g",
        "Sodium > 47 mg"
    ],
    "n": "Red Potato Bites",
    "a": "MADDIECAT",
    "r": "0",
    "s": 40,
    "des": "\"These wonderful sour cream, bacon and chive-stuffed red potatoes are a perfect appetizer for any occasion. Easy to prepare ahead of time, top off with Cheddar cheese, and broil as your guests arrive. A friend forwarded me this recipe and I cherish it.\"",
    "ins": "Preheat the oven to 375 degrees F (190 degrees C). Place potatoes in a saucepan, and add enough water to cover. Bring to boil, and cook until tender but still firm, about 10 minutes. Drain, and cool in a bowl of cold water.\nCook bacon in a skillet over medium-high heat until evenly browned. Drain, crumble, and set aside.\nRemove cooled potatoes from water. Pat dry with a paper towel, and cut in half.  Using a small spoon, carefully remove a small amount from center, leaving approximately 1/4 inch rim around each potato. Set reserved potato aside.\nIn a bowl, mix together reserved potato, sour cream, bacon, seasoned salt, pepper, and chives. Spoon a small amount of mixture into each potato half and place on a baking sheet. Top each potato off with some shredded cheese.\nBake for 10 minutes in the preheated oven, or until cheese is melted and potatoes are warmed through. Garnish with parsley, and serve.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "45 m",
    "i": "306695.jpg",
    "o": "4498296.jpg,3976435.jpg,3051516.jpg,1019490.jpg,1019488.jpg,766938.jpg",
    "st": "allrecipes"
}