{
    "id": 67937,
    "old_rating": "4.69002",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1 teaspoon salt",
        "2 teaspoons baking soda",
        "1 cup butter or margarine",
        "2 cups white sugar",
        "2 cups mashed overripe bananas",
        "4 eggs, beaten",
        "1 cup chopped walnuts"
    ],
    "nut": [
        "Calories > 232 kcal",
        "Carbs > 29.7 g",
        "Cholesterol > 51 mg",
        "Fat > 11.9 g",
        "Protein > 3.2 g",
        "Sodium > 268 mg"
    ],
    "n": "Extreme Banana Nut Bread 'EBNB'",
    "a": "SASEIGEL",
    "r": "0",
    "s": 24,
    "des": "\"This is my mom's dense, excellent, and definitely unhealthy banana nut bread recipe.  It's always completely gone in minutes.  This is great at parties, but hazardous at home.  HEALTH WARNINGS: EBNB may be habit forming. A very flexible recipe that will accommodate changes based on what you have on hand.  Use any type of fat in place of the butter, such as shortening or oil. It works with either brown or white sugar too.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9x5 inch loaf pans.\nSift the flour, salt and baking soda into a large bowl. In a separate bowl, mix together the butter or margarine and sugar until smooth. Stir in the bananas, eggs, and walnuts until well blended. Pour the wet ingredients into the dry mixture, and stir just until blended. Divide the batter evenly between the two loaf pans.\nBake for 60 to 70 minutes in the preheated oven, until a knife inserted into the crown of the loaf comes out clean. Let the loaves cool in the pans for at least 5 minutes, then turn out onto a cooling rack, and cool completely. Wrap in aluminum foil to keep in the moisture. Ideally, refrigerate the loaves for 2 hours or more before serving.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4538726.jpg",
    "o": "4538726.jpg,4538723.jpg,4537558.jpg,4537557.jpg,4537554.jpg,4535619.jpg",
    "st": "allrecipes"
}