{
    "id": 6811,
    "old_rating": "4.35",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (.25 ounce) package active dry yeast",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "1/4 cup white sugar",
        "2 eggs",
        "1/2 cup nonfat plain yogurt",
        "1 teaspoon vanilla extract",
        "1 tablespoon grated lemon zest",
        "1/4 teaspoon salt",
        "4 cups unbleached all-purpose flour",
        "1/4 cup dried currants",
        "1/4 cup raisins",
        "1 tablespoon confectioners' sugar",
        "1 tablespoon butter, melted (optional)"
    ],
    "nut": [
        "Calories > 210 kcal",
        "Carbs > 40.7 g",
        "Cholesterol > 34 mg",
        "Fat > 2.3 g",
        "Protein > 6.3 g",
        "Sodium > 76 mg"
    ],
    "n": "Panettone I",
    "a": "Lacey Lynn",
    "r": "0",
    "s": 12,
    "des": "\"This traditional Italian Christmas bread is suited for dessert, afternoon tea or breakfast.  Enjoy!\"",
    "ins": "In a medium bowl, combine yeast, water and sugar. Cover and let stand 10 minutes, or until foamy. Add eggs, yogurt, vanilla, lemon zest, and salt.  Mix well. Stir in flour 1/2 cup at a time until dough forms into a manageable ball.  Turn out onto a lightly floured surface and knead for 5 to 10 minutes, adding flour as necessary, until dough is soft and pliable, but not sticky.   (May need up to 5 cups flour.)  Place dough in a large, lightly pan-sprayed bowl, cover, and let rise in a warm place until doubled, about 1 hour.\nPreheat oven to 350 degrees F (175 degrees C) and spray a round 8-inch cake pan with non-stick spray. In a small bowl, toss dried fruit with confectioners' sugar. Punch down dough in bowl, transfer to floured surface, and knead in the fruit.\nForm dough into a ball, place in prepared cake pan, cover loosely with dish towel, and let rise 30 minutes.   (Loaf will rise above the pan sides.)  Brush with melted butter, if desired.   Bake for 45 minutes, or until loaf is golden brown and a toothpick inserted in the center comes out clean.   Makes 10 wedges.",
    "pt": "25 m",
    "ct": "45 m",
    "tt": "2 h ",
    "i": "1068930.jpg",
    "o": "4376535.jpg,4376527.jpg,4286176.jpg,4286175.jpg,2487526.jpg,1852460.jpg",
    "st": "allrecipes"
}