{
    "id": 68122,
    "old_rating": "4.79167",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 cardamom seeds",
        "1/2 nutmeg seed",
        "2 teaspoons caraway seed",
        "10 whole cloves",
        "10 whole allspice berries",
        "4 (3 inch) cinnamon sticks",
        "2 teaspoons whole peppercorns",
        "1 pinch crushed saffron threads (optional)",
        "2 (1 inch) pieces fresh ginger root",
        "2 (1 inch) pieces fresh turmeric (yellow ginger)",
        "3 large strips of orange zest",
        "3 large strips of lemon zest",
        "4 cups water",
        "1 tablespoon vanilla extract",
        "2 pounds honey",
        "1 quart 190 proof grain alcohol"
    ],
    "nut": [],
    "n": "Lithuanian Krupnikas",
    "a": "JOENAUJOKAS",
    "r": "0",
    "s": 8,
    "des": "\"Lithuanian spiced honey liqueur.  Serve warm as a traditional Eastern European cold remedy - a quick heat-up in the microwave works great.\"",
    "ins": "Crack the cardamom seeds and nutmeg with a heavy skillet on a cutting board. Toss them into a saucepan with the caraway seed, cloves, allspice berries, cinnamon sticks, peppercorns, saffron, ginger, turmeric, orange zest and lemon zest. Pour in the water, and bring to a boil. Cover, and simmer until the liquid is reduced by 1/2. Strain out spices, and set the liquid aside.\nPour honey into a large pot, and bring to a boil over medium heat. Skim off any foam from the top. Stir in the strained liquid from the spices and vanilla extract. Remove from heat and place far from the stove to avoid any flare-ups from the grain alcohol. Slowly stir in the grain alcohol. Place the pot back onto the burner over low heat and cover. Heat through, being careful not to boil or even simmer. Remove from heat and let stand overnight with the lid on.\nThe following day, pour the liquid into sterile bottles, seal, and allow to settle for 2 weeks. The longer you let it sit, the clearer it will become and the better it tastes. Serve warm.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "14 d ",
    "i": "192934.jpg",
    "o": "4106046.jpg,1645573.jpg,1645572.jpg,1645569.jpg,1645568.jpg,203604.jpg",
    "st": "allrecipes"
}