{
    "id": 6832,
    "old_rating": "4.52703",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 tablespoons active dry yeast",
        "2/3 cup warm water (110 degrees F/45 degrees C)",
        "1 cup butter, diced",
        "1/2 cup white sugar",
        "2 teaspoons salt",
        "2 cups scalded milk",
        "2 egg, lightly beaten",
        "6 cups all-purpose flour",
        "14 tablespoons butter, softened",
        "1 cup white sugar",
        "3 tablespoons grated orange zest"
    ],
    "nut": [
        "Calories > 155 kcal",
        "Carbs > 19 g",
        "Cholesterol > 28 mg",
        "Fat > 7.8 g",
        "Protein > 2.6 g",
        "Sodium > 156 mg"
    ],
    "n": "Carolyn's Orange Rolls",
    "a": "Heidi",
    "r": "0",
    "s": 48,
    "des": "\"Orange rolls - very soft white flour dough with grated orange rind, butter and sugar filling.  Excellent recipe for parties, always a crowd pleaser!\"",
    "ins": "In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes. Combine the diced butter, 1/2 cup sugar, and salt in a large bowl.  Stir in the hot milk, and mix to dissolve the butter.  Let stand until lukewarm.\nMix the yeast, eggs, and flour into the milk mixture to form a sticky dough. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth, and let rise in the refrigerator for 8 hours or overnight.\nRemove dough from the refrigerator 2 to 2 1/2 hours before baking.  Divide the dough into halves.  Roll each half out on a lightly floured surface to 1/4 inch thick rectangle.\nMix the softened butter, one cup sugar, and orange peel in a bowl.  Spread over the dough.  Roll up the dough along the long edge. Cut the rolls into one inch slices with dental floss.  Place in greased muffin cups.  Let rise until doubled in bulk.\nBake in a preheated 400 degree F (205 degree C) oven for 10 to 15 minutes, or until golden brown.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "14 h ",
    "i": "36374.jpg",
    "o": "3670165.jpg,2954169.jpg,935324.jpg,802812.jpg,367223.jpg,342198.jpg",
    "st": "allrecipes"
}