{
    "id": 68380,
    "old_rating": "4.60675",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "oil, for greasing pan",
        "8 boneless, skinless chicken breast halves",
        "1 (8 ounce) package cream cheese, cut into 1/2 inch slices",
        "1 (8 ounce) package Cheddar cheese, cut into 1/2 inch slices",
        "1 cup milk",
        "1 1/2 cups Italian seasoned bread crumbs",
        "1/2 cup grated Romano cheese",
        "1 tablespoon minced garlic",
        "3/4 cup butter, melted",
        "2 tablespoons lemon juice",
        "1/2 teaspoon garlic salt, or to taste",
        "1/2 teaspoon paprika (optional)"
    ],
    "nut": [
        "Calories > 642 kcal",
        "Carbs > 19 g",
        "Cholesterol > 184 mg",
        "Fat > 44.7 g",
        "Protein > 40.4 g",
        "Sodium > 1049 mg"
    ],
    "n": "Garlic-Lemon Double Stuffed Chicken",
    "a": "CHRCAMILLO",
    "r": "0",
    "s": 8,
    "des": "\"Not your everyday chicken dish! Stuffed with Cheddar and cream cheeses, then drenched with a garlic-lemon-butter sauce, your friends and family will be begging you to make this recipe - believe me, I know!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly coat a large, shallow baking dish with oil.\nButterfly each breast by slicing in half horizontally through the center, cutting almost but not completely through. Place one slice each of Cheddar and cream cheese in the center of each breast. Close again as if placing between the pages of a book. Set aside.\nPour milk into a shallow bowl. In a separate bowl, combine breadcrumbs and Romano cheese. Carefully dip each breast first in milk, then in breadcrumb mixture, patting lightly to firmly coat. Place breasts side by side in a single layer in pre-oiled baking dish, tucking edges under to seal.\nMelt butter in a small saucepan over medium heat. Stir in lemon juice and garlic, and drizzle evenly over chicken. Season breasts with garlic salt and paprika, if using.\nBake in preheated oven for 30 minutes, or until no longer pink in center and juices run clear.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "4484653.jpg",
    "o": "4484653.jpg,4470482.jpg,4467027.jpg,4460477.jpg,4425270.jpg,4419101.jpg",
    "st": "allrecipes"
}