{
    "id": 68417,
    "old_rating": "3.19231",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups cubed cooked ham",
        "1 (11 ounce) can whole kernel corn, drained",
        "1 (10.75 ounce) can condensed cream of asparagus soup",
        "3 eggs, beaten",
        "2 tablespoons prepared yellow mustard",
        "2 tablespoons butter",
        "3/4 cup chopped onion",
        "3/4 cup chopped celery, with leaves",
        "2 tablespoons garlic salt",
        "1/2 cup seasoned bread crumbs",
        "1/4 cup grated Parmesan cheese",
        "3/4 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 612 kcal",
        "Carbs > 35.7 g",
        "Cholesterol > 228 mg",
        "Fat > 38.4 g",
        "Protein > 32.5 g",
        "Sodium > 5027 mg"
    ],
    "n": "Ham and Corn Bake - Easy and Yummy!",
    "a": "RACERWIDOW",
    "r": "0",
    "s": 4,
    "des": "\"A simple casserole made with ham, corn and cheese. Works well as a main dish or side dish. If you like less salty food, use garlic powder in place of the garlic salt.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Coat a 1 1/2 quart casserole dish with vegetable oil cooking spray.\nIn a medium bowl, mix together the cubed ham, corn, cream of asparagus soup (undiluted), eggs and mustard. Melt butter in a skillet over medium heat. Add onions, celery and garlic salt; cook, stirring until tender. Stir the onion mixture into the egg mixture. Transfer to the prepared casserole dish. Sprinkle a layer of bread crumbs over the top, then cover with a layer of Parmesan cheese.\nCover the dish, and bake for 40 minutes in the preheated oven. Uncover, sprinkle Cheddar cheese over the top and return to the oven for an additional 20 minutes, or until cheese is melted and the top is golden brown. Let stand for 5 to 10 minutes before serving.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4439574.jpg",
    "o": "",
    "st": "allrecipes"
}