{
    "id": 68482,
    "old_rating": "4.38889",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (11.5 fl oz) can spicy vegetable juice cocktail",
        "1/2 lime, juiced",
        "1 stalk celery",
        "4 dashes pepper sauce (such as Frank's Red HotÂ®)",
        "2 dashes Worcestershire sauce",
        "1 teaspoon prepared horseradish",
        "4 (1.5 fluid ounce) jiggers vodka, or to taste",
        "1/2 cup crushed ice",
        "salt and ground black pepper to taste",
        "1 cup ice cubes",
        "4 marinated cocktail onions",
        "1/2 carrot (optional)",
        "2 short stalks of celery with leaves",
        "2 stuffed green olives",
        "1/2 lime, cut into wedges",
        "2 thin strips of green bell pepper (optional)",
        "2 small sprigs of mint (optional)"
    ],
    "nut": [],
    "n": "Bloody Mary Deluxe",
    "a": "DJCHINITA",
    "r": "0",
    "s": 2,
    "des": "\"Very, very, very SPICY!!! This recipe includes HORSERADISH... Along with other hot peppers and sauces! Weak tongues BE-WARE!!! Be creative with your garnishes and enjoy!\"",
    "ins": "In a blender, combine the vegetable juice, lime juice, 1 celery stalk, hot pepper sauce, Worcestershire sauce, horseradish, vodka, and crushed ice. Season with salt and pepper. Cover, and blend until smooth.\nUse two large frozen beer mugs, highball or pint glasses. Place one cocktail onion at the bottom of each glass. Put 1/2 cup of ice cubes into each glass. Use a vegetable peeler to pull a few strips off of the carrot for each glass. Put in a slice of green pepper. Divide the blended mixture evenly between the two glasses.\nOn cocktail toothpicks, place a green olive, a cocktail onion, and a lime wedge. Attach each one to a celery stalk so that when inserted, this garnish is on the top of the drink. Sprinkle on a few more carrot strips, and garnish each drink with a sprig of mint.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "108580.jpg",
    "o": "",
    "st": "allrecipes"
}