{
    "id": 68542,
    "old_rating": "4.40816",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Rolls",
        "1/2 pound medium shrimp",
        "1/2 pound pork loin",
        "1 (8 ounce) package rice noodles",
        "12 round rice wrapper sheets",
        "1 bunch fresh Thai basil - leaves picked from stems",
        "1 cup chopped fresh cilantro",
        "1 cup chopped fresh mint",
        "2 cups bean sprouts",
        "Sauce",
        "1 cup hoisin sauce",
        "1 tablespoon creamy peanut butter",
        "1 tablespoon water",
        "chopped roasted peanuts"
    ],
    "nut": [
        "Calories > 195 kcal",
        "Carbs > 29.2 g",
        "Cholesterol > 38 mg",
        "Fat > 4.3 g",
        "Protein > 9.6 g",
        "Sodium > 448 mg"
    ],
    "n": "Thai Basil Rolls with Hoisin-Peanut Sauce",
    "a": "ALONGENECKER",
    "r": "0",
    "s": 12,
    "des": "\"Shrimp and pork - layered with rice noodles, bean sprouts, and herbs - all rolled together in a fresh rice wrapper and served with a hoisin-peanut sauce for dipping. Great for an appetizer or lunch!\"",
    "ins": "Bring a medium stockpot of lightly salted water to a low boil. Cook shrimp 2 to 3 minutes, or until opaque. Drain, allow to cool slightly, and pat dry with paper towel. Peel, devein, and slice in half.\nBring another stockpot of lightly salted water to a boil. Cook pork at a low boil for approximately 10 minutes, to an internal temperature of 145 degrees F (63 degrees C). Allow to cool, and slice into thin strips.\nAgain, bring a stockpot of water to a boil. Cook noodles until tender, stirring occasionally, approximately 7 to 8 minutes. Strain, and rinse to prevent sticking.\nFill a medium bowl with warm water. Dip each wrapper in water for about 30 seconds until soft and flexible. Lay wrapper on a flat surface, and place 2 basil leaves in center, side by side, about 2 inches from edge of wrapper. Lay 4 to 5 shrimp halves on basil, followed by a small amount of pork, then a small amount of noodles. Sprinkle with cilantro, mint, and top with bean sprouts. Starting at one end, roll the wrapper over once, fold both sides in toward center, and continue rolling as tightly as possible without tearing. The end result should be a roll approximately 1 to 1 1/2 inches thick.\nWarm hoisin sauce, peanut butter, and water in a saucepan over medium-high heat. Bring to a boil, and immediately remove from heat. Garnish sauce with chopped peanuts, if desired, and serve with rolls for dipping.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "65779.jpg",
    "o": "",
    "st": "allrecipes"
}