{
    "id": 68578,
    "old_rating": "4.40964",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds cubed beef stew meat",
        "1/4 cup all-purpose flour",
        "1/4 cup butter",
        "1 cup sliced onion",
        "2 cloves garlic, minced",
        "2 cups water",
        "1/4 cup chopped fresh parsley",
        "1 teaspoon salt",
        "1/8 teaspoon pepper",
        "1 bay leaf",
        "2 cups cubed potatoes",
        "1 1/2 cups diced carrots",
        "1 cup sliced celery",
        "1/2 cup chopped green pepper",
        "1 cup sliced fresh mushrooms",
        "1 1/2 cups biscuit baking mix",
        "1/2 cup milk",
        "3 tablespoons butter, melted"
    ],
    "nut": [
        "Calories > 830 kcal",
        "Carbs > 48.3 g",
        "Cholesterol > 164 mg",
        "Fat > 51.8 g",
        "Protein > 42.5 g",
        "Sodium > 1181 mg"
    ],
    "n": "Beef Stew with Dumplings",
    "a": "carolj",
    "r": "0",
    "s": 5,
    "des": "\"I was given this recipe when my husband and I were first married. I've been making this wonderful beef stew recipe for 35 years and have never found a better one.\"",
    "ins": "In a bowl, toss cubed beef with flour to coat.\nHeat 4 tablespoons butter in a heavy skillet over medium-high heat. Place flour in a bag or bowl, and add beef cubes. Toss to coat with flour.  Place coated cubes in the skillet and fry until well-browned on all sides; remove from pan and set aside.\nCook onion and garlic in same pan until tender. Return meat to pan with water, parsley, salt, pepper, and bay leaf. Reduce heat to low, cover, and simmer 1 hour, stirring occasionally and adding more water if needed. Stir in potatoes, carrots, celery, and green pepper, and continue cooking another 15 minutes. Remove the bay leaf, and stir in mushrooms.\nIn a small bowl, mix together baking mix, 3 tablespoons melted butter, and milk until just blended. Drop dough by the tablespoonful into stew. Simmer, uncovered, approximately 10 minutes. Cover, and simmer 10 minutes more, or until dumplings are cooked through, but not dry.",
    "pt": "20 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "120184.jpg",
    "o": "",
    "st": "allrecipes"
}