{
    "id": 6859,
    "old_rating": "4.54286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups sourdough starter",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "1 (.25 ounce) package active dry yeast",
        "1 cup warm tomato juice",
        "2 teaspoons white sugar",
        "1 teaspoon salt",
        "7 cups all-purpose flour"
    ],
    "nut": [
        "Calories > 127 kcal",
        "Carbs > 26.5 g",
        "Cholesterol > < 1 mg",
        "Fat > 0.4 g",
        "Protein > 4 g",
        "Sodium > 82 mg"
    ],
    "n": "Sourdough Tomato Bread",
    "a": "Esther Nelson",
    "r": "0",
    "s": 30,
    "des": "\"This is very good lightly toasted for BLT's or made into hamburger buns! If you want to up the nutritional value of the bread, just substitute vegetable juice cocktail for tomato juice. Want a zippier bread? Try the spicy vegetable juice cocktail!\"",
    "ins": "Dissolve yeast in 1 cup warm water, set aside.\nIn large bowl; mix starter and tomato juice.  Add yeast mixture, salt, sugar and stir well.\nAdd 1 cup of flour at a time and beat well to develop the gluten. When a stiff dough forms, turn out onto a floured surface and knead until smooth and elastic, adding the last 1 cup of flour as you go.\nTurn into greased bowl and lightly grease top, cover with towel  and place in draft free area for 2 hours. Will double in bulk.\nPunch down and divide dough in two, form into rounds and place each on a baking sheet that has been sprinkled generously with cornmeal.\nLet rise 1/2 hour, rub top lightly with flour and slash with sharp knife. Bake at 350 degrees F (175 degrees C ) for 45-60 minutes or until bottoms are lightly browned when checked.\nFor a soft crust, cool under a clean dishtowel. For a harder European type crust, cool without.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "4 h",
    "i": "625.jpg",
    "o": "505387.jpg,283009.jpg,140545.jpg,86206.jpg,62527.jpg,56592.jpg",
    "st": "allrecipes"
}