{
    "id": 68739,
    "old_rating": "3.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/3 cup guava nectar",
        "1/3 cup rice wine vinegar",
        "1/4 cup white sugar",
        "2 teaspoons oyster sauce",
        "1 teaspoon soy sauce",
        "1/2 teaspoon salt",
        "2 skinless, boneless chicken breast halves - pounded thin and cut into bite-size pieces",
        "1/3 cup cornstarch",
        "1/4 cup vegetable oil",
        "1/2 head broccoli, cut into florets",
        "1 orange, zested and sliced",
        "2 cloves garlic, minced"
    ],
    "nut": [
        "Calories > 332 kcal",
        "Carbs > 33.7 g",
        "Cholesterol > 36 mg",
        "Fat > 15.7 g",
        "Protein > 14.9 g",
        "Sodium > 429 mg"
    ],
    "n": "Citrusy Chicken and Broccoli",
    "a": "JORDANALI",
    "r": "0",
    "s": 4,
    "des": "\"This is reminiscent of lemon or orange chicken found in Chinese restaurants.  This was so yummy, the first time I made it, my husband ate the whole thing by himself! Serve with steamed white rice.\"",
    "ins": "In a large bowl, mix the guava nectar, rice wine vinegar, sugar, oyster sauce, soy sauce, and salt. Place the chicken in the bowl, cover, and marinate 30 minutes in the refrigerator.\nDrain the chicken, reserving remaining marinade. Place cornstarch on a plate. Dip the chicken in the cornstarch to coat.\nHeat the oil in a skillet over medium heat. Cook and stir the chicken until no longer pink and juices run clear. Remove chicken from the skillet, and set aside, reserving remaining oil and juices.\nPlace a steamer basket in a pot over boiling water, and steam the broccoli 2 minutes, or until tender.\nIn the skillet with the reserved oil and juices, cook and stir the orange zest and garlic for about 1 minute. Pour in the remaining marinade, and bring to a boil. Cook 5 minutes, or until thickened. Toss the chicken and broccoli in the skillet, and cook until heated through and coated with the marinade. Place chicken in the center of a platter. Arrange orange slices and broccoli around the chicken to serve.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "966994.jpg",
    "o": "",
    "st": "allrecipes"
}