{
    "id": 68768,
    "old_rating": "4.49587",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 boneless, skinless chicken breast halves",
        "Italian dressing",
        "1 tablespoon Greek seasoning, or to taste (optional)",
        "1 tablespoon butter",
        "1 tablespoon white cooking wine",
        "1 tablespoon Worcestershire sauce",
        "1/2 teaspoon garlic salt",
        "1 (8 ounce) package sliced fresh mushrooms",
        "salt to taste",
        "2 (4 ounce) cans whole green chili peppers, drained, and sliced lengthwise",
        "4 ounces sliced Havarti cheese with dill"
    ],
    "nut": [
        "Calories > 483 kcal",
        "Carbs > 12.7 g",
        "Cholesterol > 110 mg",
        "Fat > 33.7 g",
        "Protein > 33.2 g",
        "Sodium > 2613 mg"
    ],
    "n": "Baked Havarti Chicken",
    "a": "BCWEBB",
    "r": "0",
    "s": 4,
    "des": "\"Baked chicken breasts marinated in Italian dressing and Greek seasoning, topped with Havarti cheese, green chili pepper, and sauteed mushrooms. Pairs beautifully with long grain rice and steamed vegetables.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nMarinate chicken in Italian dressing and Greek seasoning in a bowl, at least 30 minutes.\nPlace chicken in a 9x13-inch baking dish. Sprinkle top with additional Greek seasoning.\nBake in preheated oven until no longer pink in center and juices run clear, about 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nMelt butter in a skillet over medium-high heat until bubbling. Pour in wine, Worcestershire sauce, and garlic salt; bring to a boil. Stir in mushrooms; reduce to a simmer, cover, and cook until mushrooms are tender, about 3 to 5 minutes. Seasoning mixture with salt.\nArrange green chili peppers lengthwise and Havarti cheese on top of chicken. Return to the oven and bake until cheese has melted, about 5 minutes. Top chicken with mushrooms and pan juices.",
    "pt": "20 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "2742215.jpg",
    "o": "",
    "st": "allrecipes"
}