{
    "id": 68804,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 quarts chicken broth",
        "4 boneless, skinless chicken thighs",
        "1 cup dry adzuki beans",
        "1 cup uncooked wild rice",
        "2 onions, cut into large chunks",
        "1 tablespoon bottled minced garlic",
        "1 teaspoon dried sage",
        "1 tablespoon dried thyme",
        "1 tablespoon dried rosemary",
        "1 large sweet potato, peeled and cubed",
        "1 zucchini, cubed",
        "1 yellow squash, cubed",
        "1/3 medium head escarole, coarsely chopped"
    ],
    "nut": [
        "Calories > 169 kcal",
        "Carbs > 29.1 g",
        "Cholesterol > 14 mg",
        "Fat > 1.9 g",
        "Protein > 9.9 g",
        "Sodium > 41 mg"
    ],
    "n": "Chicken Soup with Adzuki Beans, Escarole, and Sweet Potato",
    "a": "BFHAWKINS",
    "r": "0",
    "s": 12,
    "des": "\"This absolutely delicious soup was created to help use up the Adzuki beans, wild rice, and sweet potatoes in my pantry. I decided to use the sweet potato instead of regular potatoes, and was delightfully surprised by the wonderful flavor blend it created with the sweetness of the onions, garlic, and Adzuki beans. I also wanted to try escarole in a soup, and the result was fantastic. Adzuki beans are found in any health food or specialty store, and in many national grocery chains. They have a great nutty, slightly sweet taste, and are especially tasty added to chicken soups of any kind.\"",
    "ins": "Place the chicken broth in a large pot. Mix in the chicken thighs, adzuki beans, wild rice, onions, and garlic. Season with sage, thyme, and rosemary. Bring to a boil, reduce heat, and cook 1 hour.\nRemove chicken from the pot, shred with a fork, and set aside.\nStir the sweet potato into the pot. Continue cooking about 5 minutes, until sweet potato is slightly tender. Mix in the zucchini, yellow squash, and escarole. Continue cooking 15 minutes.\nReturn the shredded chicken to the pot. Cook until heated through. Increase the amount of broth if the soup seems too thick.",
    "pt": "15 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "26732.jpg",
    "o": "",
    "st": "allrecipes"
}