{
    "id": 68837,
    "old_rating": "4.11765",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 gallons water, divided",
        "2 1/2 pounds beef tripe, cut into 1-inch pieces",
        "6 cloves garlic, finely chopped",
        "1 large white onion, finely chopped",
        "1 1/2 tablespoons salt",
        "1 tablespoon ground black pepper",
        "1 1/2 tablespoons dried oregano",
        "2 tablespoons ground red pepper",
        "5 de arbol chile peppers",
        "6 japones chile peppers, seeds removed",
        "6 cups canned white or yellow hominy, drained",
        "1/2 white onion, chopped",
        "1/4 cup chopped fresh cilantro",
        "2 limes, juiced"
    ],
    "nut": [
        "Calories > 225 kcal",
        "Carbs > 31.8 g",
        "Cholesterol > 139 mg",
        "Fat > 5.3 g",
        "Protein > 14.3 g",
        "Sodium > 1679 mg"
    ],
    "n": "Menudo Rojo (Red Menudo)",
    "a": "GUSTAVO6",
    "r": "0",
    "s": 8,
    "des": "\"Inexpensive to make, and fully authentic, this menudo will have your Latin lovers swooning! This recipe uses a combination of chiles to deliver its trademark red color, and packs a mildly spicy punch. And it is really quite easy to make - my husband absolutely devoured it the first time I made it.\"",
    "ins": "In a large pot, bring 1 gallon water to a boil. Place tripe in the pot, reduce heat, and simmer 2 hours. Periodically skim off fat with a spoon. Drain water, reduce heat, and pour in a fresh gallon of water. Continue to simmer tripe for 2 hours; drain.\nPour remaining 1 gallon water into the pot with tripe, and bring to a boil. Stir in garlic and 1 white onion. Season with salt, pepper, oregano, and red pepper. Reduce heat, and simmer 1 hour.\nPreheat the broiler.\nArrange the de arbol chile peppers on a baking sheet, and broil about 2 minutes, just until they begin to scorch. Remove from heat, slit lengthwise, and remove seeds. In a blender or food processor, blend the de arbol chile peppers and japones chile peppers until very finely chopped. Mix into the pot, and continue cooking 2 hours over low heat.\nMix the hominy into the pot. Continue cooking 1 hour. Serve with remaining onion, cilantro, and lime juice.",
    "pt": "30 m",
    "ct": "8 h",
    "tt": "8 h ",
    "i": "4441688.jpg",
    "o": "3838959.jpg,2593807.jpg,2005076.jpg,1915302.jpg,1915257.jpg,1101281.jpg",
    "st": "allrecipes"
}