{
    "id": 68868,
    "old_rating": "4.42532",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 skinless, boneless chicken breast halves",
        "1/4 cup butter",
        "3 teaspoons minced garlic",
        "1 tablespoon lemon juice",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1 tablespoon Italian seasoning",
        "1/2 cup half-and-half",
        "1/2 cup grated Parmesan cheese",
        "2 (13.5 ounce) cans spinach, drained",
        "4 ounces fresh mushrooms, sliced",
        "2/3 cup bacon bits",
        "2 cups shredded mozzarella cheese"
    ],
    "nut": [
        "Calories > 647 kcal",
        "Carbs > 17.6 g",
        "Cholesterol > 168 mg",
        "Fat > 38 g",
        "Protein > 61.6 g",
        "Sodium > 1806 mg"
    ],
    "n": "Chicken Florentine Casserole",
    "a": "BRYAN0320",
    "r": "0",
    "s": 4,
    "des": "\"Chicken Florentine casserole, which can also be adapted with either fish or shrimp, lies on a bed of spinach leaves and mushrooms, has a creamy white sauce mixed with garlic, Parmesan cheese, and Italian seasonings, and is topped with baked mozzarella.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Place the chicken breast halves on a baking sheet; bake 20 to 30 minutes, until no longer pink and juices run clear. Remove from heat, and set aside.\nIncrease the oven temperature to 400 degrees F (200 degrees C).\nMelt the butter in a medium saucepan over medium heat. Stirring constantly, mix in the garlic, lemon juice, cream of mushroom soup, Italian seasoning, half-and-half, and Parmesan cheese.\nArrange the spinach over the bottom of a 9x9 inch baking dish. Cover the spinach with the mushrooms. Pour half the mixture from the saucepan over the mushrooms. Arrange chicken breasts in the dish, and cover with the remaining sauce mixture. Sprinkle with bacon bits, and top with mozzarella cheese.\nBake 20 to 25 minutes in the 400 degrees F (200 degrees C) oven, until bubbly and lightly browned.",
    "pt": "25 m",
    "ct": "25 m",
    "tt": "50 m",
    "i": "4537642.jpg",
    "o": "4537642.jpg,4531758.jpg,4499161.jpg,4481830.jpg,4481061.jpg,4476881.jpg",
    "st": "allrecipes"
}