{
    "id": 69003,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (9 inch) unbaked pie crusts",
        "1/2 cup blanched almonds",
        "1 1/4 cups cold water",
        "1 cup half-and-half cream",
        "1 pinch saffron powder",
        "1 teaspoon ground cinnamon",
        "5 eggs",
        "3/4 cup white sugar",
        "1 teaspoon rose water"
    ],
    "nut": [
        "Calories > 142 kcal",
        "Carbs > 14.2 g",
        "Cholesterol > 42 mg",
        "Fat > 8.3 g",
        "Protein > 3 g",
        "Sodium > 98 mg"
    ],
    "n": "Medieval Custard Pie (Daryoles)",
    "a": "BELLAGIA",
    "r": "0",
    "s": 24,
    "des": "\"A medieval egg custard pie flavored with almond milk, saffron, cinnamon, and rosewater. This version has won a first place in a cooking competition, and is highly popular at feasts in the SCA. Like a sugar cream pie...only better. It can be eaten warm or cool. It takes some careful attention in cooking but is worth the time and trouble. This is a very rich pie...we often cut sixteen slices to the average pie plate, like a cheesecake.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Press pie crusts into the bottom and up the sides of two 9 inch pie pans. Prick with a fork all over to keep them from bubbling up. Bake pie crusts for about 10 minutes in the preheated oven, until set but not browned. Set aside to cool.\nMake an almond milk by placing almonds in the container of a food processor. Process until finely ground, then add water, and pulse just to blend. Let the mixture sit for 10 minutes, then strain through a cheesecloth. Measure out 1 cup of the almond milk, and mix with half and half. Stir in the saffron and cinnamon, and set aside.\nPlace the eggs and sugar in a saucepan, and mix until well blended. Place the pan over low heat, and gradually stir in the almond milk mixture and cinnamon. Cook over low heat, stirring constantly until the mixture begins to thicken. When the mixture is thick enough to evenly coat the back of a metal spoon, stir in rose water and remove from heat. Pour into the cooled pie shells.\nBake for 40 minutes in the preheated oven, or until the center is set, but the top is not browned. Cool to room temperature, then refrigerate until serving.",
    "pt": "50 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}