{
    "id": 6929,
    "old_rating": "2.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups warm water (110 degrees F/45 degrees C)",
        "1/2 cup margarine",
        "6 cups all-purpose flour",
        "2 tablespoons active dry yeast",
        "1/2 cup white sugar",
        "2 teaspoons salt",
        "3 eggs",
        "1 tablespoon vegetable oil"
    ],
    "nut": [
        "Calories > 180 kcal",
        "Carbs > 28.5 g",
        "Cholesterol > 23 mg",
        "Fat > 5.3 g",
        "Protein > 4.4 g",
        "Sodium > 247 mg"
    ],
    "n": "Flower Pot Challah Bread",
    "a": "Laura",
    "r": "0",
    "s": 24,
    "des": "\"This good bread is baked in a flower pot. Buy unpainted clay pots and test them to make sure that they are lead-free. There are inexpensive lead test kits available for sale at most hardware stores. You will also need to prepare the pots before baking in them.\"",
    "ins": "Scrub the pots in hot soapy water and rinse well. Let them dry overnight. Oil the inside of the pots with vegetable oil, including the rim, until the pot will not absorb any more. Set the pots in a cold oven. Heat the oven to 400 degrees then turn off the heat and leave the pots in the oven to cool. When completely cool, oil them again, and heat them again, using the same process. The pots are now ready for use. Be sure to grease them well before each use, especially around the rim.\nIn a small bowl, melt butter in the warm water.\nIn a separate bowl, mix 4 cups flour, yeast, sugar, and salt. Add eggs and melted butter mixture to form dough. Knead for 5 to 10 minutes, slowly adding more flour. Watch for blisters on the dough, and do not knead too much. Oil top of the bread. Let it rest in a warm place for 2 to 3 hours.\nPush dough down, and let it rise again. Don't let the bread rise too high, or the bread will be tough.\nShape the dough and put it into 2 clean, greased terracotta flower pots. Let loaves rise for 30 minutes more.\nBake in a preheated 350 degree F (175 degree C) oven for 35 minutes.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "3 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}