{
    "id": 6947,
    "old_rating": "4.49738",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup milk",
        "2 tablespoons white sugar",
        "1 (.25 ounce) package active dry yeast",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "1/4 cup melted shortening",
        "6 cups all-purpose flour",
        "1 teaspoon salt"
    ],
    "nut": [
        "Calories > 190 kcal",
        "Carbs > 34 g",
        "Cholesterol > 1 mg",
        "Fat > 3.5 g",
        "Protein > 4.9 g",
        "Sodium > 136 mg"
    ],
    "n": "English Muffins",
    "a": "LindaPinda",
    "r": "0",
    "s": 18,
    "des": "\"I've used this delicious recipe for about 29 years. They are very good . . . much better than any store-bought English Muffins I've ever had.\"",
    "ins": "Warm the milk in a small saucepan until it bubbles, then remove from heat. Mix in the sugar, stirring until dissolved. Let cool until lukewarm. In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, combine the milk, yeast mixture, shortening and 3 cups flour. Beat until smooth. Add salt and rest of flour, or enough to make a soft dough. Knead. Place in greased bowl, cover, and let rise.\nPunch down. Roll out to about 1/2 inch thick. Cut rounds with biscuit cutter, drinking glass, or empty tuna can. Sprinkle waxed paper with cornmeal and set the rounds on this to rise. Dust tops of muffins with cornmeal also. Cover and let rise 1/2 hour.\nHeat greased griddle. Cook muffins on griddle about 10 minutes on each side on medium heat. Keep baked muffins in a warm oven until all have been cooked. Allow to cool and place in plastic bags for storage. To use, split and toast. Great with orange butter, or cream cheese and jam.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "4536507.jpg",
    "o": "4536507.jpg,4535399.jpg,4527211.jpg,4517609.jpg,4513682.jpg,4510736.jpg",
    "st": "allrecipes"
}