{
    "id": 69516,
    "old_rating": "4.40741",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "3 large baking potatoes, peeled and diced",
        "1/2 cup chopped red bell pepper",
        "2 cloves garlic, chopped",
        "1/2 cup chopped onion",
        "salt and pepper to taste",
        "10 slices bacon",
        "4 eggs",
        "1 teaspoon milk",
        "1 cup shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 553 kcal",
        "Carbs > 43.5 g",
        "Cholesterol > 242 mg",
        "Fat > 31 g",
        "Protein > 25.7 g",
        "Sodium > 715 mg"
    ],
    "n": "Breakfast Upside Down Cake",
    "a": "MOTMIK",
    "r": "0",
    "s": 4,
    "des": "\"A mixture of all things good about breakfast.  Potatoes, bacon, cheese and eggs are baked into one easy to make dish. It presents beautifully and is excellent for company.\"",
    "ins": "Heat olive oil in a large skillet over medium heat. Add potatoes, red bell pepper, garlic and onion, and cook, stirring occasionally until potatoes are tender. Cover the pan with a lid for faster cooking.\nPreheat the oven to 350 degrees F (175 degrees C). Line the bottom of an 8 or 9 inch cake pan with parchment paper. Set aside.\nFry bacon in a skillet over medium heat, or cook in the microwave, until crisp. Drain, crumble and set aside. Sprinkle the cheese in the bottom of the prepared pan. Sprinkle bacon crumbles evenly over the cheese. Scoop the potato mixture into the pan so it is evenly distributed. Whisk together eggs and milk with a fork, and season with a little salt and pepper. Pour evenly over the food in the pan.\nBake for 20 minutes in the preheated oven, just until the egg is set. Remove from the oven and run a knife around the outer edge. Flip onto a serving plate, and remove the parchment paper. Serve and enjoy.",
    "pt": "30 m",
    "ct": "20 m",
    "tt": "50 m",
    "i": "4466962.jpg",
    "o": "776021.jpg,599185.jpg,589451.jpg,409532.jpg,150807.jpg,123592.jpg",
    "st": "allrecipes"
}