{
    "id": 69792,
    "old_rating": "4.58583",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup finely chopped pecans",
        "1/2 cup dry bread crumbs",
        "8 skinless, boneless chicken breast halves",
        "1/4 cup clarified butter, melted",
        "1/4 cup Dijon mustard",
        "1/4 cup dark brown sugar",
        "2 2/3 tablespoons bourbon whiskey",
        "2 tablespoons soy sauce",
        "1 teaspoon Worcestershire sauce",
        "3/4 cup unsalted butter, chilled and cut into small cubes",
        "1/2 cup sliced green onions"
    ],
    "nut": [
        "Calories > 486 kcal",
        "Carbs > 15.5 g",
        "Cholesterol > 134 mg",
        "Fat > 33.1 g",
        "Protein > 28.6 g",
        "Sodium > 537 mg"
    ],
    "n": "Bourbon Pecan Chicken",
    "a": "PGRAFF",
    "r": "0",
    "s": 8,
    "des": "\"Chicken breasts are coated in a pecan breading, and fried in a skillet. Then a rich bourbon sauce is poured over them before serving. This is a fabulous recipe that my Mother gave me from a upscale restaurant in New York. It is to die for. ENJOY!!\"",
    "ins": "Stir together the pecans, bread crumbs, and 2 tablespoons of clarified butter. Spread the mixture out on a plate. Press the chicken breasts into the mixture to coat on both sides.  Heat the remaining 2 tablespoons of clarified butter in a large skillet over medium heat. Place the coated chicken breasts in the pan, and fry on both sides until nicely browned and chicken meat is cooked through, about 10 minutes per side.\nIn a small saucepan, whisk together the Dijon mustard, brown sugar, bourbon, soy sauce, and Worcestershire sauce until smooth. Bring to a simmer over medium-low heat, then remove from the burner, and whisk in the 3/4 cup of unsalted butter one piece at a time. Do not return to the heat.\nArrange the chicken breasts on a large serving plate. Pour the sauce over the chicken, and sprinkle with green onion.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "129380.jpg",
    "o": "4518390.jpg,4501235.jpg,4476399.jpg,4475952.jpg,4435539.jpg,4042912.jpg",
    "st": "allrecipes"
}