{
    "id": 6988,
    "old_rating": "4.63043",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (.25 ounce) package active dry yeast",
        "1 3/4 cups warm milk (110 degrees F/45 degrees C)",
        "1 egg yolk",
        "2 eggs",
        "2 tablespoons white sugar",
        "2 teaspoons salt",
        "5 cups all-purpose flour",
        "1 tablespoon poppy seeds",
        "1 egg, beaten"
    ],
    "nut": [
        "Calories > 245 kcal",
        "Carbs > 44.1 g",
        "Cholesterol > 73 mg",
        "Fat > 3.2 g",
        "Protein > 8.7 g",
        "Sodium > 420 mg"
    ],
    "n": "Hungarian Braided White Bread",
    "a": "J.P.K.",
    "r": "0",
    "s": 12,
    "des": "\"A beautiful loaf to see and even more wonderful to eat.\"",
    "ins": "In a small mixing bowl, dissolve yeast in warm milk. Let stand until creamy, about 15 minutes.\nMix the egg, egg yolks, sugar, and salt. In a large mixing bowl, combine the yeast mixture with the egg, egg yolks, sugar, salt and 3 cups of the flour; stir until well combined. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes.\nTurn out onto a floured bread board, and cut into 2 equal parts. Form into cylindrical loaves; let rest for 20 minutes. Divide each loaf in half and roll into a long rope for braiding. Fasten the 4 ends together. Braid. End by fastening the ends, and turning each end under the loaf. Place on cookie sheet, and cover with a towel until doubled in size, about 40 minutes.\nBrush risen loaf with a beaten egg and sprinkle with poppy seeds. Bake at 400 degrees F (200 degrees C) for 15 minutes. Reduce heat to 350 degrees F (175 degrees C) and bake for an additional 45 minutes, or until golden brown.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "2 h ",
    "i": "3749.jpg",
    "o": "3443745.jpg,2697254.jpg,1096800.jpg,864141.jpg,301318.jpg,271945.jpg",
    "st": "allrecipes"
}