{
    "id": 6996,
    "old_rating": "4.54113",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup milk",
        "1/2 cup water",
        "2 tablespoons butter",
        "3/4 teaspoon salt",
        "3 cups all-purpose flour",
        "2 1/4 teaspoons active dry yeast",
        "1/4 cup white sugar",
        "1 egg",
        "3 tablespoons softened butter",
        "3/4 teaspoon ground cinnamon",
        "1/3 cup white sugar",
        "1/3 cup raisins (optional)",
        "1/3 cup chopped walnuts (optional)",
        "1 cup confectioners' sugar",
        "1 1/2 tablespoons melted butter",
        "1/4 teaspoon vanilla extract",
        "1 1/2 tablespoons milk"
    ],
    "nut": [
        "Calories > 295 kcal",
        "Carbs > 48.6 g",
        "Cholesterol > 33 mg",
        "Fat > 9.4 g",
        "Protein > 5.1 g",
        "Sodium > 202 mg"
    ],
    "n": "Cinnamon Rolls II",
    "a": "Stephanie Knewasser",
    "r": "0",
    "s": 12,
    "des": "\"These are gobbled up as soon as family sees them. I'll never try another cinnamon roll recipe, because I think these are the best. Note: These are wonderful fresh, but they don't freeze well.\"",
    "ins": "In saucepan, heat 1/2 cup milk, water, and 2 tablespoons butter until very warm. Place milk mixture, salt, flour, yeast, sugar, and eggs in the pan of the bread machine in the order suggested by the manufacturer. Select the Dough cycle. Press Start.\nOnce Dough cycle is complete, remove the dough from the bread machine and punch down. On a floured surface, roll into a large rectangle. Smear with the softened butter. Combine the cinnamon and 1/3 cup sugar. Sprinkle over the rectangle. Generously sprinkle the raisins and/or chopped nuts over the top.\nRoll the dough up into a log starting at the long side. Cut into 12 slices. Place the rolls cut side down into a 9x13-inch greased baking pan. Cover, and let rise in a warm place until almost doubled, about 30 minutes.\nPreheat an oven to 375 degrees F (190 degrees C). Combine the confectioners' sugar, 1.5 tablespoons melted butter, vanilla extract, and 1.5 tablespoons milk into a thick frosting; set aside.\nBake rolls in preheated oven until golden, 20 to 25 minutes. Remove and allow to cool 10 minutes. Spread frosting over baked rolls and enjoy.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "3 h ",
    "i": "4533545.jpg",
    "o": "4533545.jpg,4485550.jpg,4478437.jpg,4406629.jpg,4172775.jpg,4071446.jpg",
    "st": "allrecipes"
}