{
    "id": 70006,
    "old_rating": "4.21053",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup warm water",
        "1 (.25 ounce) package active dry yeast",
        "1 tablespoon molasses",
        "1 teaspoon salt",
        "1 1/2 cups whole wheat flour",
        "1 1/2 cups soy flour",
        "cooking spray",
        "cornmeal for dusting"
    ],
    "nut": [
        "Calories > 101 kcal",
        "Carbs > 17.1 g",
        "Cholesterol > 0 mg",
        "Fat > 1.1 g",
        "Protein > 7.4 g",
        "Sodium > 197 mg"
    ],
    "n": "Whole Wheat Pita Bread",
    "a": "Charlotte's Mom",
    "r": "0",
    "s": 12,
    "des": "\"I came up with this recipe after a search for a whole wheat pita bread left me frustrated. I used soy flour to totally eliminate white flour. What resulted was a hearty pita with a nice nutty flavor. It tastes great with sandwich fillings, peanut butter, or dipped in hummus. This is my first recipe, so I hope you enjoy it.\"",
    "ins": "In a bowl mix the water, yeast, molasses, and salt. Let sit 5 to 10 minutes, then gradually mix in the whole wheat flour and soy flour. Turn out onto a floured surface, and knead until smooth. Place in a large bowl lightly coated with cooking spray. Cover with a towel, and let rise in a warm place for 1 hour.\nPunch down the dough, and knead for 5 to 10 minutes. Divide into 6 pieces. On a lightly floured surface, flatten each piece to about 1/8 inch thick with a rolling pin. Cover with a towel, and let rise 30 minutes.\nPreheat oven to 450 degrees F (230 degrees C). Warm a baking sheet in the preheating oven for about 2 minutes, then remove from heat and sprinkle with cornmeal.\nArrange the dough rounds on the prepared baking sheet, and bake 6 minutes in the preheated oven. Remove from heat and cover the bread with a moist towel to soften. When cooled, slice in half and use a knife to cut pockets in the bread.",
    "pt": "30 m",
    "ct": "6 m",
    "tt": "2 h ",
    "i": "651231.jpg",
    "o": "4531997.jpg,2084777.jpg,1029840.jpg,964368.jpg,651233.jpg,596495.jpg",
    "st": "allrecipes"
}