{
    "id": 70250,
    "old_rating": "4.47312",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 skinless, boneless chicken breast halves",
        "1 teaspoon dried Italian seasoning",
        "2 tablespoons grated Parmesan cheese",
        "1 (6 ounce) jar roasted red bell peppers, drained",
        "1/4 cup chopped fresh chives",
        "4 tablespoons shredded mozzarella cheese",
        "salt and pepper to taste",
        "2 tablespoons olive oil"
    ],
    "nut": [
        "Calories > 234 kcal",
        "Carbs > 2.9 g",
        "Cholesterol > 75 mg",
        "Fat > 10.4 g",
        "Protein > 30.6 g",
        "Sodium > 602 mg"
    ],
    "n": "Stuffed Chicken Valentino",
    "a": "Emily Compson Trenbeath",
    "r": "0",
    "s": 4,
    "des": "\"This is a dish to serve guests--be ready to impress! Good enough to be served at a high-priced restaurant, but easy enough to make yourself. Creamy mozzarella and roasted red peppers make the dish really special. Serve over pasta with Alfredo sauce.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).   Slice a chicken breast in half lengthwise, leaving the halves attached on one side: opened and laid flat, the chicken breast should resemble a butterfly. Place between two sheets of plastic wrap, and pound flat. Repeat with remaining chicken breasts.\nCombine Parmesan cheese with Italian seasoning and chives, and sprinkle over chicken breasts. At one end of each breast, place 3 strips of roasted pepper.  Top with 1 tablespoon shredded cheese. Roll each breast up, starting on the side with the peppers and cheese. Insert a toothpick in each roll to prevent unrolling.  Place in prepared baking dish. Season rolls with salt and pepper to taste, and drizzle with olive oil.\nBake in preheated oven for 15 minutes. Set oven to broil, and continue cooking for 5 to 10 minutes.  Remove from oven, slice to display the colorful filling, and serve.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "1399.jpg",
    "o": "4457421.jpg,4395241.jpg,4341071.jpg,4286351.jpg,4228122.jpg,3485205.jpg",
    "st": "allrecipes"
}