{
    "id": 7027,
    "old_rating": "4.62195",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 potato, peeled and diced",
        "1 1/2 cups water",
        "2 (.25 ounce) packages active dry yeast",
        "6 1/2 cups all-purpose flour",
        "3 tablespoons white sugar",
        "2 tablespoons shortening",
        "1 tablespoon salt",
        "2 tablespoons all-purpose flour"
    ],
    "nut": [
        "Calories > 150 kcal",
        "Carbs > 29.7 g",
        "Cholesterol > 0 mg",
        "Fat > 1.4 g",
        "Protein > 3.9 g",
        "Sodium > 292 mg"
    ],
    "n": "Potato Bread III",
    "a": "Judy Taubert",
    "r": "0",
    "s": 24,
    "des": "\"A moist, heavy loaf.  Perfect accompaniment to a rich, thick stew.\"",
    "ins": "In a medium saucepan cook potato cubes in water for about 12 minutes, or until tender.  Do not drain.  Cool mixture to 110 degrees F (43 degrees C).  Set aside 1/2 cup of the cooking liquid.  Mash potato and remaining liquid; if necessary add warm water to make 2 cups potato mixture.\nIn a large mixing bowl, sprinkle yeast on reserved 1/2 cup potato water.  Add mashed potato mixture, 2 cups of the flour, sugar, shortening, and salt.  Beat with an electric mixer on low speed  for 1/2 minute, scraping sides of bowl constantly.  Beat 3 minutes at high speed.  Stir in as much of the remaining flour as you can mix in by hand.\nTurn dough out onto a lightly floured surface.  Knead in enough of the remaining flour to make a moderately stiff dough. Knead for 6 to 8 minutes, or until dough is smooth and elastic.  Place in a lightly greased bowl; turn once to grease surface.  Cover.  Let rise in warm place until doubled in bulk, about 1 hour.\nPunch down, and turn out onto a lightly floured surface.  Divide dough in half.  Cover, and  let rest for 10 minutes.  Shape each half into a loaf.  Place in greased 8 x 4 x 2 inch loaf pans.  Cover.  Let rise until nearly double, about 35 minutes.  Before baking, brush tops with a little water and dust with additional flour.\nBake at 375 degree F (190 degrees C) for 40 to 45 minutes.  Cover with foil for the last 15 minutes of baking to prevent over-browning.  Remove from pan; cool on wire rack.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "2 h ",
    "i": "1563656.jpg",
    "o": "4540476.jpg,4476220.jpg,4394369.jpg,3244481.jpg,3244471.jpg,3175038.jpg",
    "st": "allrecipes"
}