{
    "id": 7042,
    "old_rating": "4.62264",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "For the Sponge:",
        "2 (.25 ounce) packages active dry yeast",
        "1/2 cup warm water (110 degrees F/45 degrees C)",
        "1/2 cup white sugar",
        "3 cups warm milk",
        "4 cups all-purpose flour",
        "For the Dough:",
        "6 eggs, beaten",
        "1/2 cup white sugar",
        "1 cup butter, softened",
        "1/4 teaspoon salt",
        "1/4 teaspoon lemon zest",
        "12 cups all-purpose flour",
        "1 egg",
        "1 tablespoon water",
        "2 tablespoons butter, melted"
    ],
    "nut": [
        "Calories > 600 kcal",
        "Carbs > 98.3 g",
        "Cholesterol > 106 mg",
        "Fat > 15.4 g",
        "Protein > 15.7 g",
        "Sodium > 161 mg"
    ],
    "n": "Paska Bread",
    "a": "Tiffany Leyda",
    "r": "0",
    "s": 18,
    "des": "\"This traditional Polish egg bread is  wonderfully light with a slightly sweet flavor.\"",
    "ins": "Proof the yeast in 1/2 cup warm water in a large bowl until slightly frothy.\nIn the meantime, dissolve 1/2 cup sugar in the warm milk; allow to cool to lukewarm. Once cooled, add the milk mixture to the yeast mixture along with 4 cups of flour. Mix well with a wooden spoon. Cover and put in a dark, warm place until the mixture is bubbly and doubled in size, about 2 hours.\nStir in the beaten eggs, 1/2 cup sugar, 1 cup butter, salt, and lemon peel. Stir well to blend. Begin adding the remaining flour a cup at a time to form a very soft dough.\nKnead the dough on a floured board until soft and elastic, about 10 minutes. Place the dough in a greased bowl, turning to coat all sides. Cover bowl with plastic wrap and allow to rise in a warm place until doubled, about 2 hours. Punch dough down, and allow to rise again for 30 minutes.\nDivide dough into three parts (see Cook's Note). Shape into slightly rounded loaves, and place on greased baking sheets. Let rise until doubled, about 45 minutes to 1 hour. Beat 1 egg with 1 tablespoon water; brush onto loaves.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven until loaves are deep brown, 45 to 50 minutes.  Once they are done, brush the tops with melted butter for a soft crust.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "6 h ",
    "i": "994982.jpg",
    "o": "3422424.jpg,2191432.jpg,1009790.jpg,1009789.jpg,994986.jpg,994984.jpg",
    "st": "allrecipes"
}