{
    "id": 70433,
    "old_rating": "4.26277",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 ounces uncooked rigatoni pasta",
        "1 tablespoon olive oil, divided",
        "2 skinless, boneless chicken breast halves - cubed",
        "1 onion, sliced and separated into rings",
        "1 green bell pepper, cut into thin strips",
        "3 cloves garlic, minced",
        "1 teaspoon fresh ginger, minced",
        "1 mango - peeled, seeded, and chopped",
        "1 cup heavy cream",
        "salt and pepper to taste",
        "1 tablespoon grated Parmesan cheese",
        "4 sprigs fresh parsley, for garnish"
    ],
    "nut": [
        "Calories > 600 kcal",
        "Carbs > 60.5 g",
        "Cholesterol > 119 mg",
        "Fat > 29.4 g",
        "Protein > 24.8 g",
        "Sodium > 675 mg"
    ],
    "n": "Chicken and Pasta in a Mango Cream Sauce",
    "a": "SHAGGYDEE",
    "r": "0",
    "s": 4,
    "des": "\"This creamy, cheesy pasta dish is very rich and has a subtle, fruity flavour. It was an experiment that turned out to be delicious. Enjoy.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Add rigatoni pasta, cook for 8 minutes, until almost done, and drain.\nHeat 1/2 the olive oil in a large skillet over medium heat. Place chicken in the skillet, and cook 10 minutes, or until juices run clear. Remove from heat, and set aside.\nHeat the remaining olive oil in the skillet, and cook the onion and green pepper until tender. Mix in the garlic, ginger, and mango, and continue to cook and stir 5 minutes, or until mango is soft. Gradually mix the heavy cream into the skillet, and cook 5 minutes, until thickened.\nReturn the chicken to the skillet. Stir in the partially cooked pasta, and season with salt and pepper. Cook and stir 2 minutes, until ingredients are well blended and pasta is al dente. Mix in the cheese. Garnish with parsley to serve.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "50 m",
    "i": "2346.jpg",
    "o": "1031764.jpg,800100.jpg,559632.jpg,186404.jpg,185532.jpg,169400.jpg",
    "st": "allrecipes"
}