{
    "id": 70628,
    "old_rating": "3.76562",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 slices Canadian bacon",
        "1 teaspoon white vinegar",
        "4 eggs",
        "1 cup butter",
        "3 egg yolks",
        "1 tablespoon heavy cream",
        "1 dash ground cayenne pepper",
        "1/2 teaspoon salt",
        "1 tablespoon lemon juice",
        "4 English muffins, split and toasted"
    ],
    "nut": [
        "Calories > 690 kcal",
        "Carbs > 27.4 g",
        "Cholesterol > 475 mg",
        "Fat > 58 g",
        "Protein > 17 g",
        "Sodium > 1120 mg"
    ],
    "n": "Quick and Easy Eggs Benedict",
    "a": "INDRIANI",
    "r": "0",
    "s": 4,
    "des": "\"This is a no-fuss, easy recipe. The sauce is simply put together in a blender - no double boiling necessary. Assemble eggs with sauce over hot buttered English muffins with Canadian bacon, or if you prefer, Serrano ham. Yum!\"",
    "ins": "In a skillet over medium-high heat, fry the Canadian bacon on each side until evenly browned.\nFill a large saucepan with about 3 inches water, and bring to a simmer. Pour in the vinegar. Carefully break the 4 eggs into the water, and cook 2 to 3 minutes, until whites are set but yolks are still soft. Remove eggs with a slotted spoon.\nMeanwhile, melt the butter until bubbly in a small pan or in the microwave. Remove from heat before butter browns.\nIn a blender or large food processor, blend the egg yolks, heavy cream, cayenne pepper, and salt until smooth. Add half of the hot butter in a thin steady stream, slow enough so that it blends in at least as fast as you are pouring it in. Blend in the lemon juice using the same method, then the remaining butter.\nPlace open English muffins onto serving plates. Top with 1 slice Canadian bacon and 1 poached egg. Drizzle with the cream sauce, and serve at once.",
    "pt": "15 m",
    "ct": "8 m",
    "tt": "25 m",
    "i": "2593654.jpg",
    "o": "2481664.jpg,1448434.jpg,1359071.jpg,682392.jpg,682391.jpg,111822.jpg",
    "st": "allrecipes"
}