{
    "id": 70763,
    "old_rating": "3.86047",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup uncooked white rice",
        "2 cups water",
        "1/2 cup diced carrots",
        "1/2 cup diced onion",
        "4 tablespoons butter or margarine, divided",
        "4 eggs",
        "2 tablespoons milk",
        "1 cup ketchup",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 431 kcal",
        "Carbs > 58.5 g",
        "Cholesterol > 217 mg",
        "Fat > 17.3 g",
        "Protein > 11.8 g",
        "Sodium > 837 mg"
    ],
    "n": "Home Rice",
    "a": "KCBLUEGAL",
    "r": "0",
    "s": 4,
    "des": "\"A surprising mix of flavors, this dish can be served as a breakfast or brunch. Originally received from my Japanese mother, I simplified both the recipe and the name. I believe the original name was 'Om Rice' but my family just calls it 'Home Rice'!\"",
    "ins": "Combine the rice and water in a small saucepan. Bring to a boil, then cover, reduce heat to low, and simmer for 15 to 20 minutes, until tender.\nMelt one tablespoon of butter in a large skillet over medium heat. Add carrots and onion. Cook, stirring frequently until onions are tender and lightly browned, about 5 minutes. Add the cooked rice, and stir to blend well. Mix in the remaining butter. Reduce heat to medium-low, and stir in ketchup. Simmer for about 5 minutes to blend flavors, then remove from heat.\nIn a small bowl, whisk together the eggs and milk. Heat a nonstick skillet over medium heat. Pour half of the egg mixture into the skillet. Cook until firm, turning over once halfway through. Remove from the skillet and cut in half. Repeat with the remaining eggs.\nFor each serving, place a scoop of rice onto a plate, and form into a flattened log shape. Top with one of the egg halves. Ketchup, salt and pepper may be added on top of the eggs at the table.",
    "pt": "10 m",
    "ct": "30 m",
    "tt": "40 m",
    "i": "276833.jpg",
    "o": "",
    "st": "allrecipes"
}