{
    "id": 70907,
    "old_rating": "4.29268",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Pico de Gallo",
        "3 medium tomatoes, chopped",
        "1/3 cup chopped onion",
        "2 cloves garlic, minced",
        "1 serrano chile pepper, seeded and minced",
        "1 lime, juiced",
        "1/2 cup chopped fresh cilantro",
        "salt and pepper to taste",
        "Turkey Burgers",
        "1 pound ground turkey",
        "1 egg",
        "1/2 onion, minced",
        "2 cloves garlic, minced",
        "1 teaspoon ground coriander",
        "1/2 teaspoon celery salt",
        "1 teaspoon chili powder",
        "1/2 teaspoon cumin",
        "1 tablespoon chopped fresh parsley"
    ],
    "nut": [
        "Calories > 233 kcal",
        "Carbs > 10.4 g",
        "Cholesterol > 118 mg",
        "Fat > 10.7 g",
        "Protein > 25.7 g",
        "Sodium > 576 mg"
    ],
    "n": "Mexican Turkey Burgers with Pico de Gallo",
    "a": "Peach822",
    "r": "0",
    "s": 4,
    "des": "\"I serve this without the roll for a great low-carb meal. If you decide to use a roll, drain the Pico de Gallo before placing on top of the burger to prevent the bun from getting wet. Fresh cilantro is a must for the Pico de Gallo. While you may choose to use a little cooking spray, it is not necessary as the burgers, at first a little sticky, will firm up as they cook.\"",
    "ins": "In a bowl, mix together the tomatoes, the 1/3 cup chopped onion, 2 of the 4 cloves of minced garlic, serrano chile pepper, lime juice, and cilantro. Stir in salt and pepper to taste, and set aside.\nPlace the ground turkey in a bowl. Add the egg, the 1/2 onion, minced, remaining 2 cloves minced garlic, coriander, celery salt, chili powder, cumin, and chopped parsley. Using your hands, work the mixture until all ingredients are evenly blended. Form mixture into 4 patties.\nHeat a large, non-stick skillet for medium-high heat. Cook the turkey burgers for 5 minutes per side, or until no longer pink in the center and juices run clear. Reduce the heat as necessary during cooking. Serve with Pico de Gallo salsa.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "222969.jpg",
    "o": "",
    "st": "allrecipes"
}