{
    "id": 7093,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 boiling potatoes, peeled and chopped",
        "3 cups milk",
        "1 cup white sugar",
        "1 cup shortening",
        "1 teaspoon salt",
        "6 cups all-purpose flour",
        "1 tablespoon grated lemon zest",
        "3 tablespoons lemon juice",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "4 1/2 teaspoons active dry yeast",
        "6 eggs",
        "1/2 teaspoon ground nutmeg"
    ],
    "nut": [
        "Calories > 86 kcal",
        "Carbs > 12.1 g",
        "Cholesterol > 15 mg",
        "Fat > 3.2 g",
        "Protein > 2 g",
        "Sodium > 39 mg"
    ],
    "n": "Spudnuts",
    "a": "Robyn",
    "r": "0",
    "s": 80,
    "des": "\"This is an old family favorite, handed down for years, the outside of the doughnut is crisp and the inside is light and chewy. This does make a HUGE batch, first timers may want to half it. These are worth the effort.\"",
    "ins": "In a small saucepan, cover peeled potatoes with water. Bring water to a boil and cook until tender, about 15 minutes. Let cool and mash.\nScald the milk and add the sugar, shortening, 2 cups mashed potatoes and salt. Mix well.\nIn an upright mixer with a dough hook attachment. Add the potato mixture, flour, lemon juice, lemon zest, water, yeast eggs and nutmeg. Mix until well mixed, dough will be a bit sticky. Cover and let rise until doubled in size.\nRoll dough out on a lightly floured surface and cut with a doughnut cutter. Place the cut doughnuts on a greased baking sheet, cover and let rise until doubled in size.\nIn a hot fryer or deep fry pan heat shortening or canola oil to 375 degrees F (190 degrees C). Carefully place 2 to 3 doughnuts in pan. Turn when lightly golden. Lift out when done and drain on paper towels. Glaze or roll in sugar.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "2082932.jpg",
    "o": "",
    "st": "allrecipes"
}