{
    "id": 7098,
    "old_rating": "3.83333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons raisins",
        "3 tablespoons dried currants",
        "3 ounces candied mixed citrus peel",
        "3 tablespoons chopped candied cherries",
        "4 tablespoons rum",
        "3/4 tablespoon active dry yeast",
        "6 tablespoons white sugar",
        "1 1/2 tablespoons warm water (110 degrees F/45 degrees C)",
        "4 cups all-purpose flour",
        "1/2 cup blanched slivered almonds",
        "1/2 cup milk",
        "1/4 teaspoon almond extract",
        "1/2 tablespoon grated lemon zest",
        "1/2 teaspoon salt",
        "1 egg",
        "6 tablespoons butter, diced and softened",
        "1/4 cup butter, melted",
        "2 tablespoons confectioners' sugar"
    ],
    "nut": [
        "Calories > 213 kcal",
        "Carbs > 30.4 g",
        "Cholesterol > 25 mg",
        "Fat > 7.8 g",
        "Protein > 4 g",
        "Sodium > 107 mg"
    ],
    "n": "Christmas Stollen II",
    "a": "Michelle Chen",
    "r": "0",
    "s": 20,
    "des": "\"This fruity, yeast bread is very addictive. It is good for breakfast, tea time, and after dinner snacks.\"",
    "ins": "Place the fruit in a bowl with the rum, and soak for at least 1 hour.  Sprinkle 1 1/2 tablespoons flour into the fruit, together with the almonds.  Stir until the flour is completely absorbed.\nIn a small bowl, stir the yeast and 1 teaspoon sugar into the water.  Let stand for 15 minutes.\nWarm the milk until it is lukewarm, and stir in the remaining sugar until it has dissolved.  Stir in the almond extract and lemon rind.\nPlace all but 1/4 cup of the flour in a large bowl with the salt, and make a well in the center.  Pour in the yeast mixture, and stir in a little of the flour from the edge of the well.  Add egg and the milk and sugar mixture.  Beat in softened butter.  Mix together to form a dough.\nTurn dough onto a floured work surface.  Knead, using the rest of the flour, for 15 minutes, or until  no longer sticky.  Knead in fruit and almonds.  Clean and dry the bowl, and brush the inside with 1 tablespoon melted butter.  Brush the top of the dough with another 2 teaspoons melted butter or margarine, and place it in the bowl.  Cover the dough with a clean cloth.  Let rise for 2 hours, or until  doubled in size.\nPunch down the dough, and let it rest for 10 minutes.  Roll it out into a 8 x 12 inch rectangle.  Brush with remaining melted butter or margarine.  Bring one long side across it, overlapping it in place with seam by about 1 inch.  Press the edge gently to keep it in place.  With floured hands, taper the ends of the loaf slightly and push the sides gently together to mound it in the center.  The finished loaf should be about 3 1/2 inches wide and 14 inches long.  Place the loaf on a floured baking sheet, and brush it with any remaining melted butter or margarine.  Leave it in a warm place for 1 hour, or until  doubled in size.\nBake at 375 degrees F (190 degrees C) for 45 minutes, or until golden and crusty.  Cool on a wire rack.  Just before serving the stollen, sift the confectioners' sugar over the top.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "523523.jpg",
    "o": "",
    "st": "allrecipes"
}