{
    "id": 7107,
    "old_rating": "4.45",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/2 teaspoons active dry yeast",
        "1/2 cup warm water (110 degrees F/45 degrees C)",
        "1 1/4 cups buttermilk",
        "2 eggs",
        "5 1/2 cups all-purpose flour",
        "1/2 cup margarine, softened",
        "1/2 cup white sugar",
        "2 teaspoons baking powder",
        "2 teaspoons salt",
        "2 tablespoons margarine, softened",
        "1/2 cup white sugar",
        "2 teaspoons ground cinnamon",
        "1/2 cup melted butter",
        "1/2 cup packed brown sugar",
        "1/3 cup raisins",
        "2/3 cup chopped pecans"
    ],
    "nut": [
        "Calories > 270 kcal",
        "Carbs > 37.8 g",
        "Cholesterol > 26 mg",
        "Fat > 11.6 g",
        "Protein > 4.5 g",
        "Sodium > 347 mg"
    ],
    "n": "Sticky Buns I",
    "a": "Holly",
    "r": "0",
    "s": 24,
    "des": "\"Yum!  What can be better than a hot sticky bun for breakfast-or a late night snack? Pop one (leftover) into the microwave for a few seconds to make them taste fresh from the oven.\"",
    "ins": "Dissolve yeast in warm water in a large mixing bowl. Add buttermilk, eggs,  2 1/2 cups flour, 1/2 cup margarine, 1/2 cup white sugar, baking powder and salt. Blend 30 seconds with mixer on low speed, scraping sides and bottom of bowl. Beat 2 minutes on medium speed.\nStir in remaining 3 cups flour. Dough should remain soft and slightly sticky. Knead for 5 minutes, or about 200 turns on a lightly floured board.\nForm dough into a round and place it in an oiled bowl. Cover it with a damp cloth and leave it in a warm place to rise until doubled.\nDivide dough in half and roll each half into a 12x7 inch rectangle. Spread each half with 1 tablespoon soft margarine, and sprinkle with 1/4 cup white sugar and 1 teaspoon cinnamon. Roll up halves, beginning at wide side. Seal well by pinching the seams. Cut each roll into 12 slices.\nCoat two 9 inch round cake pans with 1/4 cup melted butter, 1/4 cup brown sugar, and 1/2 cup chopped pecans in each pan. Place 12 dough slices in each pan, leaving a small space between slices. Let rise until doubled.\nBake in a preheated 375 degrees F (190 degrees C) oven for about 30 minutes. Invert pans onto serving plate.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "1838806.jpg",
    "o": "",
    "st": "allrecipes"
}