{
    "id": 71113,
    "old_rating": "3.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "3/4 pound lamb shoulder with bones, cut into pieces",
        "1 small onion, diced",
        "2 cloves garlic, chopped",
        "2 cinnamon sticks",
        "1 cup canned garbanzo beans, drained",
        "1 (14.5 ounce) can whole peeled tomatoes with juice",
        "1/4 cup bulgur (cracked wheat), uncooked",
        "7 cups water",
        "salt and pepper to taste",
        "1/4 cup chopped fresh parsley",
        "1/2 teaspoon dried mint"
    ],
    "nut": [
        "Calories > 194 kcal",
        "Carbs > 18.6 g",
        "Cholesterol > 29 mg",
        "Fat > 9 g",
        "Protein > 10.7 g",
        "Sodium > 238 mg"
    ],
    "n": "Lamb and Bulgur Soup (Shorba Freek)",
    "a": "Maryam",
    "r": "0",
    "s": 6,
    "des": "\"This tasty soup begins with lamb shoulder, cinnamon, onions, garlic and chickpeas. Finished with tomatoes, bulgur and some fresh parsley and mint. Wonderful on cool nights!!\"",
    "ins": "Heat oil in a stock pot over medium-high heat. Add the lamb, onion, garlic, and cinnamon. Season lightly with salt and pepper. Cook stirring frequently, until meat is browned and onions are almost tender. Pour in water and garbanzo beans, and bring to a boil.\nSimmer over low heat for 45 minutes to an hour, skimming the scum from the top occasionally. Meanwhile, pour the tomatoes into a blender or food processor, and puree until smooth.\nWhen the meat is tender, remove the pieces with a slotted spoon. Remove the fat and bones from the meat, and return it to the pot. Discard the fat and bones. Remove cinnamon sticks. Add the tomato puree and bulgur wheat. Simmer for about 10 minutes, or until the bulgur is puffed and tender.\nTransfer to a soup tureen, and garnish with parsley and mint before serving.",
    "pt": "10 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}