{
    "id": 71111,
    "old_rating": "4.45238",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 pounds frozen cleaned chitterlings, thawed",
        "1 onion, roughly chopped",
        "2 teaspoons salt",
        "1 teaspoon crushed red pepper flakes",
        "1 teaspoon minced garlic"
    ],
    "nut": [
        "Calories > 312 kcal",
        "Carbs > 1.1 g",
        "Cholesterol > 365 mg",
        "Fat > 26.9 g",
        "Protein > 16.6 g",
        "Sodium > 412 mg"
    ],
    "n": "Down Home Chitterlings",
    "a": "KERYNE",
    "r": "0",
    "s": 12,
    "des": "\"Chitterlings or pork intestines are a favorite among Southern families. Traditionally, they are prepared during the holiday season, but deep freezing makes them available year round.  Be sure to wash any surface and your hands thoroughly with a bleach solution to avoid contamination while handling raw chitterlings. Chitterlings are very good and are allowed, in moderation, under some popular Low Carb Diets. Be certain to pass the vinegar and hot sauce. Enjoy!!!\"",
    "ins": "Soak the chitterlings in cold water throughout the cleaning stage.  Each chitterling should be examined and run under cold water, all foreign materials should  be removed and discarded.  Chitterlings should retain some fat, so be careful to leave some on.  After each chitterling has been cleaned, soak in two cold water baths for a few minutes.  The second water should be clearer. If not, soak in one more bath.\nPlace the chitterlings in a 6 quart pot, and fill with cold water. Bring to a boil, then add the onion and season with salt, garlic and red pepper flakes. Be sure the water is at a full boil before adding seasonings, or the chitterlings could become tough. Continue to simmer for 3 to 4 hours, depending on how tender you like them. Serve with spaghetti or turnip greens. Be certain to pass the vinegar and hot sauce.",
    "pt": "2 h",
    "ct": "6 h",
    "tt": "8 h",
    "i": "2815936.jpg",
    "o": "",
    "st": "allrecipes"
}