{
    "id": 71134,
    "old_rating": "4.55696",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil",
        "1 stalk celery, finely chopped",
        "3 green onions, finely chopped",
        "1 teaspoon minced garlic",
        "1 (6 ounce) can lump crabmeat, drained",
        "3 slices dry white bread, crusts removed and cubed",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 egg, beaten",
        "1/2 cup grated Romano cheese",
        "2 tablespoons lemon juice",
        "1 tomato, seeded and diced",
        "1/8 teaspoon ground black pepper",
        "5 tablespoons butter, melted",
        "6 (4 ounce) haddock fillets"
    ],
    "nut": [
        "Calories > 365 kcal",
        "Carbs > 9 g",
        "Cholesterol > 157 mg",
        "Fat > 21.5 g",
        "Protein > 32.9 g",
        "Sodium > 559 mg"
    ],
    "n": "Crab Stuffed Haddock",
    "a": "JELLYKO",
    "r": "0",
    "s": 6,
    "des": "\"An awesome meal for anytime, and especially impressive to guests yet so simple to make.  Haddock fillets are stuffed with a crab and cheese stuffing then baked. A must try - it will be a keeper. Great with salad and rice or potato! Enjoy.\"",
    "ins": "Preheat the oven to 375 degrees F (190 degrees C). Lightly grease a 9x13 inch baking dish.\nHeat olive oil in a skillet over medium heat. Add celery, green onion and garlic, and cook and stir for a few minutes until soft. Remove from heat, and stir in the crabmeat, bread cubes, egg, Romano cheese, lemon juice, and tomato. Season with salt and 1/4 teaspoon of pepper, and mix until well blended.\nLay the haddock fillets in the prepared baking dish. Brush each one with melted butter. Place a heaping tablespoon of the crab mixture onto half of each fillet, and fold the other half over to cover. Secure with toothpicks if desired. Sprinkle on any remaining stuffing, and drizzle with any leftover melted butter. Cover the dish with a lid or aluminum foil. (The dish may be also made ahead of time and refrigerated at this point.)\nBake for 20 minutes in the preheated oven, then remove the cover and bake for an additional 10 minutes, until the top has browned and the fish flakes easily with a fork.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "769381.jpg",
    "o": "4093118.jpg,2168390.jpg,2163045.jpg,1972338.jpg,1388327.jpg,1305271.jpg",
    "st": "allrecipes"
}