{
    "id": 71160,
    "old_rating": "4.38462",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup uncooked short-grain white rice",
        "2 cups water",
        "1 cup chicken stock",
        "1/4 cup soy sauce",
        "2 tablespoons brown sugar",
        "1/2 onion, thinly sliced",
        "1/2 cup shiitake mushrooms, thinly sliced",
        "1 skinless, boneless chicken breast half - cut into strips",
        "4 green onions, cut into 1-inch pieces",
        "2 eggs, beaten",
        "6 snow peas, thinly sliced"
    ],
    "nut": [
        "Calories > 619 kcal",
        "Carbs > 106.1 g",
        "Cholesterol > 221 mg",
        "Fat > 6.7 g",
        "Protein > 31 g",
        "Sodium > 2283 mg"
    ],
    "n": "Quick Oyakodon",
    "a": "BINGADING",
    "r": "0",
    "s": 2,
    "des": "\"This dish is very easy to make and very Japanese. It reminds me of dishes I've ordered in Japanese restaurants. You can add Korean hot sauce if you like it a little spicy.\"",
    "ins": "Bring the rice and water to a boil in a saucepan; reduce heat to medium-low, cover, and simmer until the rice is tender and the liquid has been absorbed, 20 to 25 minutes.\nBring the chicken stock to a boil in a small saucepan. Stir in the soy sauce and brown sugar until the sugar has dissolved. Reduce heat to low; keep warm.\nHeat several tablespoons of the chicken sauce in a skillet over medium heat. Cook and stir the onion and shiitake mushrooms in the sauce until the onion has softened, about 3 minutes. Add the chicken, green onions, and a few more tablespoons of the sauce; continue cooking until the chicken is no longer pink in the center, about 5 minutes more. Spread the chicken mixture evenly over the skillet; pour the beaten egg overtop. Reduce heat to medium-low and sprinkle with the snow peas. Cook and stir until the egg has firmed and is no longer runny, about 3 minutes.\nDivide the rice between two bowls and spoon the egg mixture evenly overtop. Pour additional chicken sauce over the rice to serve.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "712228.jpg",
    "o": "",
    "st": "allrecipes"
}