{
    "id": 71161,
    "old_rating": "4.5814",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 pounds dried salted cod fish",
        "4 Yukon Gold potatoes",
        "3 tablespoons butter",
        "2 yellow onions, thinly sliced",
        "2 cloves garlic, chopped, divided",
        "1/2 cup chopped fresh parsley, divided",
        "3/4 cup olive oil",
        "1 1/2 teaspoons red pepper flakes",
        "freshly ground pepper to taste",
        "4 hard cooked eggs, chopped",
        "10 pitted green olives",
        "10 pitted black olives"
    ],
    "nut": [
        "Calories > 701 kcal",
        "Carbs > 25.2 g",
        "Cholesterol > 277 mg",
        "Fat > 31.3 g",
        "Protein > 77.1 g",
        "Sodium > 8223 mg"
    ],
    "n": "Maria's Portuguese Bacalau",
    "a": "BINGADING",
    "r": "0",
    "s": 8,
    "des": "\"This is a traditional Portuguese dish that brings back memories of mom. It is not only tasty but it is always a hit at parties. Plan ahead, because the salted cod needs to soak for 24 hours.\"",
    "ins": "Soak the dried salted cod in cold water for 24 hours, changing the water several times.\nBring a large pot of water to a boil. Add the soaked cod, and boil for about 5 minutes, or until fish flakes easily with a fork. Remove cod from water, and save water for cooking potatoes. Remove skin and bones from the cod, and flake the meat into pieces using a fork. Set fish aside in a large bowl.\nIn a small bowl, stir together the olive oil, 1 clove of garlic, 1 tablespoon of parsley, red pepper flakes, and black pepper. Pour over the fish, and toss lightly to coat.\nPreheat the oven to 350 degrees F (175 degrees C). Place the potatoes into the fish water, and bring to a boil. Cook for 20 minutes, or until tender. Drain under cool water, peel and cut into 1/4 inch slices.\nWhile the potatoes are cooking, melt the butter in a large skillet over medium heat. Add the onions, and saute until golden and caramelized. Stir one clove of garlic into the onions. Set aside.\nLayer half of the potato slices in the bottom of a greased 8x11 inch baking dish. Cover with half of the cod, then half of the onions. Repeat layers, ending with onion.\nBake for 15 minutes in the preheated oven, until lightly browned. Before serving, garnish the top with green and black olives, and hard-cooked eggs. Sprinkle with remaining parsley.",
    "pt": "1 d ",
    "ct": "1 h",
    "tt": "1 d ",
    "i": "36172.jpg",
    "o": "",
    "st": "allrecipes"
}