{
    "id": 7122,
    "old_rating": "3.81465",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 cups all-purpose flour",
        "2 teaspoons baking powder",
        "2 teaspoons salt",
        "3/4 cup shortening",
        "3/4 cup hot water"
    ],
    "nut": [
        "Calories > 227 kcal",
        "Carbs > 24.1 g",
        "Cholesterol > 0 mg",
        "Fat > 13.1 g",
        "Protein > 3.2 g",
        "Sodium > 470 mg"
    ],
    "n": "Authentic Mexican Tortillas",
    "a": "Jamie Mikall Martinez",
    "r": "0",
    "s": 12,
    "des": "\"I learned how to make these growing up watching my mother Alma. We have never used an actual recipe, but for your convenience I came up with one.\"",
    "ins": "Combine the flour, baking powder, and salt. Either by hand or with a pastry cutter, cut in the shortening till the mixture is crumbly. If the mixture looks more floury than crumbly, be sure to add just one or two more tablespoons of shortening till it is crumbly. Add about 3/4 cup hot water to the mixture, or just enough to make the ingredients look moist.\nWith your hand or a large fork, knead the mixture making sure to rub the dough against the sides of the large mixing bowl to gather any clinging dough. If the dough still sticks to the side of  the bowl, add a couple more tablespoons of flour until the dough forms a soft round shape. The dough is ready to roll out now, but it is best to let it rest. Cover it with a dish towel, and let it sit for about an hour or so.\nTake the dough, and pull it apart into 10 to 12 balls. Lightly flour your rolling area, and roll each ball with a rolling pin to about 1/8 inch thickness.\nPlace each tortilla on a medium hot cast iron skillet. Cook for about 1 to 2 minutes on each side, or until the tortilla does not look doughy.",
    "pt": "30 m",
    "ct": "25 m",
    "tt": "55 m",
    "i": "3620460.jpg",
    "o": "3620460.jpg,1501715.jpg,840325.jpg,562346.jpg,502968.jpg,467684.jpg",
    "st": "allrecipes"
}