{
    "id": 7139,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (0.6 ounce) cake compressed fresh yeast",
        "2 cups milk",
        "1/2 cup raisins, finely chopped",
        "1/2 cup warm water",
        "4 egg yolks",
        "1 egg",
        "1/2 cup white sugar",
        "1/4 cup butter, melted",
        "1/2 teaspoon vanilla extract",
        "1/2 cup orange zest",
        "1 teaspoon salt",
        "6 cups all-purpose flour",
        "2 quarts vegetable oil for frying"
    ],
    "nut": [
        "Calories > 123 kcal",
        "Carbs > 16.2 g",
        "Cholesterol > 24 mg",
        "Fat > 5.5 g",
        "Protein > 2.4 g",
        "Sodium > 62 mg"
    ],
    "n": "Ponczki",
    "a": "Karen Gibson",
    "r": "0",
    "s": 48,
    "des": "\"This is the 'traditional' ponczki made by most Polish Grandmothers, like mine.  These take time and patience, but the product is worth it. Preferred, traditional frying method is with lard but oil will work fine.  I usually mix equal portions.  Grandma used a large paper bag, and dropped them in immediately after removing from the fryer.  The bag absorbs a lot of the oil.  Then, she transferred them to another clean bag, added her choice of coating, and shook the bag.\"",
    "ins": "In a large bowl, dissolve yeast in lukewarm, scalded milk.  Add 2 cups flour.  Stir well, and allow to rest 1 hour in a warm place. Warm the milk in a small saucepan until it bubbles, then remove from heat and let cool until lukewarm.\nSoften chopped raisins in warm water for 30 minutes.\nBeat egg, egg yolks, sugar, vanilla, melted butter or margarine, salt, and orange rind.  Add to yeast sponge. Stir in raisins. Stir in egg mixture.  Blend well.  Add 4 cups flour.   Mix well, forming smooth ball.  Dough will be somewhat soft, but not \"batter-like.\"  Cover dough, and allow to rise until fully doubled.  Punch down, let rise until double again.\nRoll dough into 1/2 inch balls, set aside to rise until doubled in bulk. In a deep-fryer, heat oil to 375 degrees F (190 degrees C).\nDrop 2 or 3 at a time into hot fat, turn when deep golden brown.  If removed too soon, dough will be undone inside. When done drain briefly and dust with confectioners' sugar before serving.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}