{
    "id": 71441,
    "old_rating": "4.8",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups fully cooked ground ham",
        "1/2 cup creamy salad dressing (e.g. Miracle Whip)",
        "3 tablespoons sweet pickle relish",
        "1 tablespoon grated onion",
        "2 cups ground bologna",
        "3 tablespoons sweet pickle relish",
        "1/2 cup creamy salad dressing (e.g. Miracle Whip)",
        "1 (8 ounce) package cream cheese, softened",
        "1/3 cup finely chopped walnuts",
        "3 tablespoons pimento-stuffed green olives, chopped",
        "2 tablespoons milk",
        "2 cups shredded Cheddar cheese",
        "1 (8 ounce) package cream cheese, softened",
        "3 tablespoons creamy salad dressing (e.g. Miracle Whip)",
        "1/8 teaspoon onion salt",
        "1/8 teaspoon garlic salt",
        "1/8 teaspoon celery salt",
        "2 (8 ounce) packages cream cheese, softened",
        "3 tablespoons milk, or as needed",
        "1 (1 pound) loaf white bread, sliced horizontally",
        "4 medium sweet pickles, chopped",
        "1 (2 ounce) bottle diced pimento, drained"
    ],
    "nut": [
        "Calories > 352 kcal",
        "Carbs > 15.1 g",
        "Cholesterol > 74 mg",
        "Fat > 27.3 g",
        "Protein > 11.8 g",
        "Sodium > 654 mg"
    ],
    "n": "Frosted Sandwich Loaf",
    "a": "EWEDIN31",
    "r": "0",
    "s": 24,
    "des": "\"This recipe is very versatile as you can use many different fillings, including thin sliced meats, seafood salad--or make up one of your own. You may use less salad dressing, if you like, in the spreads.\"",
    "ins": "In a small bowl, mix together the ground ham, 1/2 cup of salad dressing, 3 tablespoons of relish, and onion. Set aside in the refrigerator.\nIn another bowl, mix together the ground bologna, 3 tablespoons of relish, and 1/2 cup of salad dressing. Set aside in the refrigerator.\nIn a third bowl, stir together 1 package of cream cheese, walnuts, green olives, and 2 tablespoons of milk. Set aside in the refrigerator.\nIn a fourth bowl, mix together the Cheddar cheese, 1 package of cream cheese, 3 tablespoons of salad dressing, onion salt, garlic salt, and celery salt. Set aside in the refrigerator.\nSpread the ham spread onto the bottom slice of bread, then top with another slice. Cover the next slice with bologna spread, and top with another slice. Spread the next slice with the nut spread, and then top with another slice of bread. Top this slice with the Cheddar cheese spread. Top with one more slice of the bread. Smooth the sides with a large spatula or knife, and refrigerate for about 30 minutes before 'frosting' to make it easier.\nMix together the 2 remaining packages of cream cheese, and enough milk to make it spreadable. Frost the sides of the loaf first, then the top. Decorate with sweet pickles and pimentos to your liking.",
    "pt": "1 h",
    "ct": "",
    "tt": "",
    "i": "1112580.jpg",
    "o": "",
    "st": "allrecipes"
}