{
    "id": 7160,
    "old_rating": "4.27907",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 1/4 teaspoons active dry yeast",
        "2 cups warm water (110 degrees F/45 degrees C)",
        "2 cups all-purpose flour",
        "1/4 cup white sugar",
        "1 cup white sugar, divided",
        "2 cups all-purpose flour, divided",
        "2 cups milk, divided"
    ],
    "nut": [
        "Calories > 382 kcal",
        "Carbs > 82.2 g",
        "Cholesterol > 5 mg",
        "Fat > 1.9 g",
        "Protein > 8.9 g",
        "Sodium > 29 mg"
    ],
    "n": "Herman Sourdough Starter",
    "a": "Sue",
    "r": "0",
    "s": 8,
    "des": "\"This is a recipe for a sweet sourdough starter known as Herman. There are a number of things that can be made from it. It's very important to NOT use metal utensils or bowls! It will take 15 days for the starter to mature and be ready to use the first time you make it. After that it can be ready for use every 10 days.\"",
    "ins": "In a large glass or plastic container, dissolve the yeast in warm water. Stir in the flour and sugar, mix until smooth. (DO NOT USE A METAL SPOON)! Cover loosely and store in a warm place overnight.\nThe next day, stir and refrigerate.\nStir once each day for the next four days. On the fifth day, stir, then divide in half. Give half away with feeding instructions.\nFeed starter with 1/2 cup white sugar, 1 cup flour, and 1 cup milk. Stir until smooth. Cover and place in refrigerator. Stir once each day for next four days.\nOn the tenth day feed again with 1/2 cup white sugar, 1 cup flour, and 1 cup milk. Return to refrigerator and stir once each day for the next four days.\nOn the fifteenth day it is ready to be used for baking. Reserve one cup of the starter in the refrigerator and continue to follow the stir and feed cycle (Stir once a day for four days, stir and feed on the fifth day, ready for use on the tenth day.)",
    "pt": "30 m",
    "ct": "",
    "tt": "",
    "i": "895963.jpg",
    "o": "",
    "st": "allrecipes"
}