{
    "id": 71809,
    "old_rating": "4.54762",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons vegetable oil",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "3 cups finely shredded napa cabbage",
        "1 (8 ounce) can sliced water chestnuts, drained",
        "1 pound ham hocks",
        "1/8 teaspoon cayenne pepper",
        "2 bay leaves",
        "1/2 teaspoon Cajun seasoning",
        "salt to taste",
        "1 quart chicken stock",
        "1 (10 ounce) package frozen black-eyed peas",
        "1 1/2 cups basmati rice, well rinsed",
        "3 cups water"
    ],
    "nut": [
        "Calories > 815 kcal",
        "Carbs > 89.2 g",
        "Cholesterol > 82 mg",
        "Fat > 36.2 g",
        "Protein > 34.1 g",
        "Sodium > 1141 mg"
    ],
    "n": "Lucky New Year's Black-Eyed Pea Stew",
    "a": "CRVGRL",
    "r": "0",
    "s": 4,
    "des": "\"This recipe is a wonderful combination of all things bringing good luck for the New Year. Black-eyed peas bring luck and the cabbage brings money. Don't worry! Napa cabbage has such a subtle flavor that you won't even know it's there. Eat this on New Years Day to bring luck all year long!\"",
    "ins": "Heat the oil in a deep pan or stockpot set over medium-high heat. Stir in the onions and garlic, and cook until transparent, about 5 minutes. Mix in the Napa cabbage; toss and cook until wilted, about 2 minutes. Add the ham hocks, cayenne pepper, bay leaf, Cajun seasoning, and salt, stirring for 2 minutes more. Pour in the chicken stock and black-eyed peas. Bring the mixture to a boil, then reduce heat to low and cook uncovered for 2 hours.\nMeanwhile, place the rice and water into a saucepan. Bring to a boil, reduce heat to low, cover, and simmer until all liquid is absorbed and rice is light and fluffy, about 20 minutes.\nBefore serving, remove the ham hocks from the pot. Coarsely chop the meat, and return to the black-eyed pea mixture. Serve hot over Basmati rice.",
    "pt": "15 m",
    "ct": "2 h ",
    "tt": "3 h",
    "i": "1911853.jpg",
    "o": "3060950.jpg,1082464.jpg,946873.jpg,946811.jpg,862298.jpg,162261.jpg",
    "st": "allrecipes"
}