{
    "id": 7196,
    "old_rating": "4.22222",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 cups boiling water",
        "1/2 cup butter flavored shortening",
        "1 cup evaporated milk",
        "1 teaspoon salt",
        "2 teaspoons white sugar",
        "3 cups dry potato flakes",
        "3 cups all-purpose flour",
        "3/4 cup all-purpose flour"
    ],
    "nut": [
        "Calories > 221 kcal",
        "Carbs > 31.8 g",
        "Cholesterol > 5 mg",
        "Fat > 8.2 g",
        "Protein > 4.8 g",
        "Sodium > 172 mg"
    ],
    "n": "Lefse I",
    "a": "Helen H.",
    "r": "0",
    "s": 16,
    "des": "\"A special Scandinavian treat. Beginner lefse makers might want to make only a third of the portion the first time through!  Serve any number of ways. A favorite is with butter or margarine and sugar. Some people like cinnamon with this, too. Jellies make an excellent topping as do thinly sliced fried sandwich meat.\"",
    "ins": "In a large bowl mix together the boiling water, shortening, milk, salt, sugar, and potato flakes. Place in the refrigerator until thoroughly chilled.\nAfter dough is thoroughly chilled, add the flour, using a pastry blender to cut in.\nDivide dough into 3 equal size portions. Form into 3 logs. Chill thoroughly in the refrigerator.\nHeat an electric griddle to 375 degree F (190 degrees C).\nDivide logs into 8 pieces. Roll to about the size of a 10 inch tortilla. Work additional flour into rounds as needed. Use care to press lightly with rolling pin when forming into rounds as they are much more tender than pie dough. The weight of a large rolling pin is nearly enough.\nBake on the griddle until each round feels dry but not crisp. Turn frequently.\nCool on cloth. Cover with an additional cloth. Stack pieces on top of each other as they are baked. The steam will create a more tender product.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "718904.jpg",
    "o": "",
    "st": "allrecipes"
}