{
    "id": 7198,
    "old_rating": "4.47458",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 1/4 teaspoons active dry yeast",
        "1 1/2 cups warm water (110 degrees F/45 degrees C)",
        "4 cups all-purpose flour",
        "1 teaspoon salt",
        "1 1/2 teaspoons white sugar",
        "1 tablespoon olive oil",
        "1 teaspoon salt",
        "1 1/2 heads fresh broccoli",
        "2/3 cup shredded provolone cheese",
        "1/3 cup shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese",
        "1 clove garlic, minced",
        "1 cup diced pepperoni",
        "1/4 cup olive oil",
        "salt and pepper to taste",
        "1 egg, beaten",
        "1 tablespoon water",
        "2 tablespoons cornmeal"
    ],
    "nut": [
        "Calories > 732 kcal",
        "Carbs > 73.3 g",
        "Cholesterol > 89 mg",
        "Fat > 36.2 g",
        "Protein > 27.6 g",
        "Sodium > 1660 mg"
    ],
    "n": "Broccoli, Pepperoni and Three Cheese Calzones",
    "a": "MARBALET",
    "r": "0",
    "s": 6,
    "des": "\"These Italian breads remind me of a folded-over pizza. They are filled with such yummy ingredients!\"",
    "ins": "In a large bowl, proof the yeast by blending it with 1/4 cup of the warm water. Let stand until it bubbles.\nIn a large bowl combine the flour, salt, and sugar. Blend in the one tablespoon of olive oil by rubbing the mixture between the palms of your hands. Make a well in the dry ingredients. Add proofed yeast mixture and work in by hand. Gradually add the remaining warm water. Blend well and gather into a ball.\nPlace one teaspoon of olive oil on a wooden board. Knead dough on board until smooth. Place dough in a greased bowl and cover with plastic wrap and a towel. Let rise in a warm place for 1 1/2 hours or until doubled in bulk.\nMeanwhile, prepare calzone filling: separate the broccoli tops from the stalks. Soak in cool water with 1 teaspoon salt for 15 minutes. Rinse in cool water. Cook in a large pot of boiling water for 5 minutes. Drain well and chop into small pieces. Place in large bowl with provolone cheese, mozzarella cheese, Parmesan cheese, garlic, pepperoni, olive oil, salt, and ground black pepper.\nPunch down dough and knead for one minute. Divide into six equal pieces. On a floured board, roll each section into a 8x10 inch rectangle.\nIn a small bowl combine the beaten egg and water. On the long side of the dough, place 2/3 cup filling in a strip one inch away from the edges of the dough. Flatten the filling with a spoon. Brush egg mixture over edges of dough. Fold the dough over the filling. Fold edges under 1/4 inch. Seal edges.\nSprinkle two 12x16 inch baking pans with cornmeal. Place three calzones on each baking pan. Brush remaining egg mixture on top of calzones. Prick tops of calzones with toothpick, making holes 1/2 inch apart on top of dough.\nBake in a preheated 375 degree F (190 degrees C) oven for 30 minutes, or until golden brown. Serve hot or cold.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2866.jpg",
    "o": "3563675.jpg,1289414.jpg,697793.jpg,683067.jpg,261398.jpg,76963.jpg",
    "st": "allrecipes"
}