{
    "id": 72167,
    "old_rating": "4.10526",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 skinless, boneless chicken breast halves",
        "1 cup milk",
        "1 cup dry bread crumbs",
        "1 cup grated Parmesan cheese",
        "2 tablespoons chopped fresh parsley",
        "1 cup olive oil",
        "1 orange, sliced into rounds",
        "1 cup dry white wine",
        "1/2 cup orange juice",
        "1 (10.5 ounce) can chicken broth",
        "1/4 cup brandy-based orange liqueur (such as Grand MarnierÂ®)"
    ],
    "nut": [
        "Calories > 981 kcal",
        "Carbs > 37.9 g",
        "Cholesterol > 96 mg",
        "Fat > 66.4 g",
        "Protein > 40.7 g",
        "Sodium > 959 mg"
    ],
    "n": "Grand Marnier Chicken",
    "a": "NURSE24HR",
    "r": "0",
    "s": 4,
    "des": "\"Absolutely the BEST Chicken recipe ever.  Nothing more to say!\"",
    "ins": "Slice chicken breasts in thirds horizontally to make 12 thin chicken fillets. Lightly pound each piece. Place in a dish, and pour milk over them. Soak for 10 minutes. In a shallow bowl, stir together the bread crumbs, Parmesan cheese and parsley. Set aside.\nHeat olive oil in a large heavy skillet over medium-high heat. Dredge chicken pieces in the bread crumb mixture, and place in the hot oil. Quickly brown on both sides, then remove to a buttered 9x13 inch baking dish, or similar size. Season with salt and pepper to taste. Place orange slices over the top of the chicken.\nPreheat the oven to 350 degrees F (175 degrees C). Drain the oil from the skillet, reserving 1/4 cup. Heat the reserved oil with the wine over medium heat until reduced by 1/2. Add broth and orange juice, and reduce by 1/2 again. Pour the sauce over the chicken, then drizzle with Grand Marinier.\nBake for 20 to 25 minutes in the preheated oven, until bubbly.",
    "pt": "15 m",
    "ct": "25 m",
    "tt": "40 m",
    "i": "110355.jpg",
    "o": "",
    "st": "allrecipes"
}