{
    "id": 72381,
    "old_rating": "4.21918",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 oranges, sliced into rounds",
        "1 onion, thinly sliced",
        "1 1/2 tablespoons olive oil",
        "5 (6 ounce) salmon fillets",
        "1 tablespoon lemon pepper",
        "1 1/2 teaspoons garlic powder",
        "1 tablespoon dried parsley",
        "1/2 cup orange juice",
        "1 1/2 tablespoons lemon juice",
        "1 tablespoon honey"
    ],
    "nut": [
        "Calories > 345 kcal",
        "Carbs > 17.4 g",
        "Cholesterol > 93 mg",
        "Fat > 14.9 g",
        "Protein > 34.7 g",
        "Sodium > 353 mg"
    ],
    "n": "Orange Roasted Salmon",
    "a": "KBURIE",
    "r": "0",
    "s": 5,
    "des": "\"I like to make this for company since you can get it ready ahead of time up until the final baking step. It looks both pretty and impressive, and the orange flavor is more subtle than you'd expect. This is a healthy and elegant meal (not to mention delicious) when served with a leafy salad, brown rice, and asparagus.\"",
    "ins": "Preheat the oven to 400 degrees F (200 degrees C).\nIn a small bowl or cup, stir together the lemon pepper, garlic powder, and dried parsley. Place the slices from one of the oranges in a single layer in the bottom of a 9x13 inch baking dish. Place a layer of onion slices over the orange. Drizzle with a little bit of olive oil, and sprinkle with half of the herb mixture.\nPlace the dish in the preheated oven, and roast for about 25 minutes, or until the onions are browned and tender. Remove the dish from the oven, and increase the temperature to 450 degrees F (220 degrees C).\nPush the onion and orange slices to the outer edge of the baking dish, and place the salmon fillets in the center. Season with the remaining half of the herb mixture. Whisk together the orange juice, lemon juice and honey in a small bowl. Pour evenly over the salmon.\nBake for 12 to 15 minutes in the preheated oven, or until the salmon is opaque in the center. Remove fillets to a serving dish, and discard the roasted orange. Garnish fillets with roasted onions and fresh orange slices.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "65359.jpg",
    "o": "4482781.jpg,4473947.jpg,4271973.jpg,4023190.jpg,4020376.jpg,3401099.jpg",
    "st": "allrecipes"
}