{
    "id": 72463,
    "old_rating": "4.07143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "4 (8 ounce) salmon fillets",
        "4 medium potatoes, peeled and sliced",
        "2 large red onions, sliced into rings",
        "1 jarred roasted red pepper, drained and cut into strips",
        "8 ounces portobello mushrooms",
        "1 tablespoon fresh lemon juice",
        "salt and pepper to taste",
        "1 teaspoon sesame oil"
    ],
    "nut": [
        "Calories > 325 kcal",
        "Carbs > 24.4 g",
        "Cholesterol > 55 mg",
        "Fat > 15.1 g",
        "Protein > 22.9 g",
        "Sodium > 114 mg"
    ],
    "n": "Earth, Sea and Fire Salmon",
    "a": "CynthiaRussell",
    "r": "0",
    "s": 8,
    "des": "\"This dish is amazingly easy to make and the end result will just make you look super good! The secret of its great flavor is in the quality of the ingredients. It doesn't need much seasoning, for it would only disguise the flavor of this great combination of ingredients. Earth (potatoes, onions, roasted peppers), Sea (fresh salmon) and Fire (your favorite oven) make this a winning recipe that you all will love to try!\"",
    "ins": "Preheat the oven to 350 degrees. Coat the bottom of a 9x13 inch baking dish generously with olive oil.\nArrange potato slices in a layer on the bottom of the baking dish. Season with a little salt and pepper. Place a layer of onions over the potatoes, then a layer of roasted peppers, seasoning each layer with salt and pepper as desired. Place salmon fillets over the vegetables in the dish, and season with lemon juice, salt and pepper. Place whole mushrooms over the fillets, and drizzle them with sesame oil.\nBake for 45 minutes in the preheated oven. Fish should flake easily with a fork, and potatoes should be tender.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "1178084.jpg",
    "o": "",
    "st": "allrecipes"
}