{
    "id": 72551,
    "old_rating": "4.45833",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 fresh poblano chile peppers",
        "2 cups oil for frying, or as needed",
        "8 ounces queso asadero",
        "1/2 cup all-purpose flour for coating"
    ],
    "nut": [
        "Calories > 368 kcal",
        "Carbs > 16 g",
        "Cholesterol > 60 mg",
        "Fat > 27.4 g",
        "Protein > 15.2 g",
        "Sodium > 378 mg"
    ],
    "n": "Miguelina's Poblanos and Cheese",
    "a": "Holly B.",
    "r": "0",
    "s": 4,
    "des": "\"These are a delicious side dish (but a rich one), if you don't mind a mildly chiloso (hot) pepper - less than jalapenos.  The mellow cheese is the perfect accompaniment!  Double or triple the recipe, as you please. These are not volcanic, but not for people who can't eat nachos with at least some jalapenos on them. Use Mexican cheeses if they are available in your area.\"",
    "ins": "Rinse the poblano peppers, and remove the stem and core. Remove any remaining seeds. Heat a heavy skillet over high heat. Place peppers in the skillet, and cook until blistered and blackened. Turn frequently to blacken all of the skin. You want to make sure that no part of the pepper remains crispy. Place the peppers into a paper bag, fold the top closed, and let the peppers steam for a few minutes to loosen the skin.\nHeat about 1/2 inch of oil in a large heavy skillet over medium-high heat.\nRinse the peppers under cold running water to remove as much of the black skin as possible. Don't get prissy about it; you can eat the skins, even if they're black - most people like some of the black skin.  Next, WASH your hands well with soap and water, or you'll be sorry later when you touch your eyes or mouth.\nInsert a nice thick piece of cheese into each pepper, and secure the opening with a toothpick. Coat the peppers in flour. Gently place the peppers into the hot oil, and reduce the heat to medium. Fry for 3 to 5 minutes per side. Don't try to turn them over until the bottom has a firm crust on it. Try to avoid letting the cheese run out. When both sides are slightly browned and the coating is firm, remove from the pan, and drain on paper towels.",
    "pt": "20 m",
    "ct": "15 m",
    "tt": "35 m",
    "i": "667154.jpg",
    "o": "",
    "st": "allrecipes"
}