{
    "id": 72712,
    "old_rating": "4.39731",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "7 cups vegetable or chicken stock",
        "1 tablespoon butter",
        "1 medium onion, chopped",
        "2 cups Arborio rice, uncooked",
        "1/2 medium zucchini, thinly sliced with a vegetable peeler",
        "10 sun-dried tomatoes, softened and chopped",
        "1 teaspoon dried thyme, crushed",
        "6 tablespoons freshly grated Parmesan (or mozzarella) cheese",
        "1 tablespoon chopped fresh basil leaves, or to taste (optional)",
        "freshly ground black pepper to taste"
    ],
    "nut": [
        "Calories > 363 kcal",
        "Carbs > 71.2 g",
        "Cholesterol > 9 mg",
        "Fat > 4.1 g",
        "Protein > 9.1 g",
        "Sodium > 699 mg"
    ],
    "n": "Zucchini Risotto",
    "a": "LitleLisa1",
    "r": "0",
    "s": 6,
    "des": "\"This creamy main dish gets a splash of color with the addition of zucchini, sun-dried tomatoes, and basil. With much less butter than in a typical risotto recipe and no wine, there's no running around for ingredients you don't have on hand! The result is a lovely, light flavor in a very filling meal.\"",
    "ins": "Bring vegetable or chicken stock to a boil in a medium stock pot, then reduce heat to a low simmer.\nMelt butter in a large, heavy bottomed stock pot over medium heat. Stir in onions and cook for 2 minutes, or until softened. Add the rice and cook for another 2 minutes, stirring constantly, until lightly toasted. Gradually ladle in simmering vegetable stock, stirring continuously. Risotto will become \"creamy\" and slightly sticky, yet still firm in the center, or al dente.\nWhen almost finished, stir in the zucchini, sun-dried tomatoes, and thyme, adding stock as needed and stirring continuously. Stir in basil and 3 tablespoons cheese just before serving. Divide risotto among 6 bowls, sprinkle with remaining cheese, and season with pepper to taste.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "4224063.jpg",
    "o": "4224063.jpg,4041686.jpg,3992886.jpg,3931848.jpg,3922788.jpg,3652459.jpg",
    "st": "allrecipes"
}