{
    "id": 73164,
    "old_rating": "2.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup buttermilk",
        "1/2 cup coconut milk",
        "1/2 cup milk",
        "1 cup water",
        "4 eggs",
        "1/4 cup white sugar",
        "1/4 cup brown sugar",
        "1/4 teaspoon salt",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon almond extract",
        "1/4 teaspoon coconut extract",
        "1 dash ground nutmeg"
    ],
    "nut": [
        "Calories > 131 kcal",
        "Carbs > 15.2 g",
        "Cholesterol > 95 mg",
        "Fat > 6 g",
        "Protein > 4.5 g",
        "Sodium > 134 mg"
    ],
    "n": "Three Milks Coconut Custard",
    "a": "EMERALDCITYJEWEL",
    "r": "0",
    "s": 8,
    "des": "\"I needed to use up some milk and eggs one day and came up with this custard. I tried replacing the almond extract with amaretto liquor and it was mighty good too. You can adjust the flavorings to suit your taste but don't go over board on the almond - it is a pretty strong flavoring. And don't skip the water bath!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine the buttermilk, coconut milk, milk, water, and eggs. Blend with an electric mixer just until smooth. If you over mix, bubbles will form on the surface of the custard. Stir in the white sugar, brown sugar, salt, vanilla extract, coconut extract, and almond extract. Pour into 8 custard cups or ramekins.\nPlace the custard filled dishes onto a baking sheet with tall sides, or in a casserole dish. Place the dish in the oven, and fill with hot water so that it comes halfway up the sides of the custard dishes.\nBake for about 40 minutes in the preheated oven, checking the water level occasionally so it doesn't dry out. The custard is done when a knife inserted into the center comes out clean. Remove ramekins from the water bath as soon as they are done, or they will continue to cook. You can leave the water bath in the oven until it cools off for safer removal.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "50 m",
    "i": "203925.jpg",
    "o": "",
    "st": "allrecipes"
}