{
    "id": 73456,
    "old_rating": "4.57428",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Marinara Sauce:",
        "1 tablespoon olive oil",
        "2 cloves garlic, peeled and coarsely chopped",
        "1 pinch crushed red pepper flakes",
        "1 tablespoon chopped fresh basil",
        "1 teaspoon red wine vinegar",
        "1 teaspoon white sugar",
        "1 (14.5 ounce) can diced tomatoes",
        "salt and pepper to taste",
        "Grinders:",
        "1 tablespoon butter",
        "2 medium zucchini, cubed",
        "1 pinch red pepper flakes",
        "salt and pepper to taste",
        "1 1/2 cups shredded mozzarella cheese",
        "4 (6 inch) French or Italian sandwich rolls, split"
    ],
    "nut": [
        "Calories > 339 kcal",
        "Carbs > 37.3 g",
        "Cholesterol > 35 mg",
        "Fat > 15.1 g",
        "Protein > 16.9 g",
        "Sodium > 729 mg"
    ],
    "n": "Fabulous Zucchini Grinders",
    "a": "your mom",
    "r": "0",
    "s": 4,
    "des": "\"I made this up one day out of things I had on hand, and it turned out to be one of my favorite sandwiches ever. Sauteed zucchini pieces are coated with a zesty marinara sauce and topped with a generous helping of mozzarella cheese. These baked sandwiches are a great vegetarian version of the Italian grinder. They can also be made ahead of time, and heated just before serving.\"",
    "ins": "To make marinara sauce, heat olive oil in a saucepan over medium heat (see Cook's Note). Add garlic, basil and red pepper flakes; cook and stir for a minute or two until fragrant. Stir in sugar, vinegar, salt, and pepper. Pour in tomatoes with their juices and simmer over low heat for 15 minutes. Remove from heat and puree until smooth in food processor or blender.\nPreheat the oven to 350 degrees F (175 degrees C).\nMelt butter in a skillet over medium heat. Cook the zucchini in butter until browned and slightly tender. Season with red pepper flakes, salt, and pepper.\nSpoon a generous amount of the zucchini mixture into each sandwich roll. Cover zucchini with about 1/4 cup marinara sauce per roll. Top with a handful of shredded mozzarella. Close the rolls, and wrap individually in aluminum foil.\nBake for 15 minutes in the preheated oven, until bread is heated through, rolls are soft, and cheese is melted.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "613552.jpg",
    "o": "4538157.jpg,4500539.jpg,3944440.jpg,2389936.jpg,2203722.jpg,864326.jpg",
    "st": "allrecipes"
}