{
    "id": 7347,
    "old_rating": "4.36478",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3/4 cup butter",
        "3/4 cup packed dark brown sugar",
        "3/4 cup unsweetened pineapple juice",
        "1 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/2 cup white sugar",
        "3 eggs",
        "1/2 teaspoon vanilla extract",
        "1 fresh pineapple - peeled, cored and cut into rings"
    ],
    "nut": [
        "Calories > 290 kcal",
        "Carbs > 41.3 g",
        "Cholesterol > 77 mg",
        "Fat > 13 g",
        "Protein > 3.6 g",
        "Sodium > 282 mg"
    ],
    "n": "Fresh Pineapple Upside Down Cake",
    "a": "Veruschka",
    "r": "0",
    "s": 12,
    "des": "\"The classic pineapple upside down cake made with fresh pineapple. Serve with dollops of creme fraiche.\"",
    "ins": "Preheat oven to 400 degrees F (205 degrees C).\nMelt the butter. Brush a little bit of the butter on the inside of a 9-inch cake pan.\nMix 5 tablespoons of the butter with the dark brown sugar and 1/4 cup of the pineapple juice. Place this mixture in the bottom of the cake pan. Arrange the pineapple rings on the brown sugar mixture in a decorative pattern (be creative). Set pan aside.\nStir together the flour, salt, white sugar, and baking powder.\nSeparate the eggs. Beat the whites until stiff but not dry.\nBeat two of the egg yolks until lemony yellow. Stir in the remaining 1/2 cup pineapple juice, vanilla, and remaining melted butter. Add this mixture to the flour mixture. Gently fold in the egg whites. Pour batter over the top of the brown sugar and pineapple rings.\nBake in the preheated oven until cake springs back when lightly touched with a finger, about 30 minutes. Let cake cool in pan for 10 minutes then cover pan tightly with a serving dish and invert so that the pineapple side is up.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "3870900.jpg",
    "o": "4541071.jpg,4535709.jpg,4535708.jpg,4501225.jpg,4458454.jpg,4438866.jpg",
    "st": "allrecipes"
}