{
    "id": 7355,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup butter",
        "3/4 cup white sugar",
        "2 eggs",
        "2 cups all-purpose flour",
        "1/2 cup sour cream",
        "1/2 teaspoon salt",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon almond extract",
        "1 (16 ounce) can whole cranberry sauce",
        "1/2 cup blanched slivered almonds",
        "3/4 cup confectioners' sugar",
        "1 tablespoon warm water",
        "1/2 teaspoon almond extract"
    ],
    "nut": [
        "Calories > 288 kcal",
        "Carbs > 43.9 g",
        "Cholesterol > 48 mg",
        "Fat > 11.2 g",
        "Protein > 3.9 g",
        "Sodium > 277 mg"
    ],
    "n": "Cranberry Swirl Coffeecake",
    "a": "IRENED",
    "r": "0",
    "s": 14,
    "des": "\"This was a favorite of my family's when growing up - my Mom's specialty.  I have entered this cake in several local agricultural fairs and it has won the blue ribbon three times and a best in show!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9 inch tube pan.\nCream butter or margarine adding sugar gradually. Add eggs one at time. Beating with an electric mixture on medium speed.\nMix together flour, baking soda, baking powder, and salt. With electric beaters on low speed add flour mixture alternately with sour cream to butter mixture, ending with flour mix (do not overbeat). Stir in 1 teaspoon of almond extract.\nPut a layer of half the batter in the pan the bottom of the pan, than a layer of whole cranberry sauce (1/2 the can). Repeat once more with the remaining batter and cranberry sauce. Sprinkle slivered almonds on top.\nBake at 350 degrees F (175 degrees C) for 50 minutes. Remove from pan after slightly cooling. Drizzle glaze on top.\nTo Make Glaze: Mix together confectioners' sugar, warm water, and 1/2 teaspoon almond extract.  Drizzle over top of cake.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}