{
    "id": 7357,
    "old_rating": "4.44444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (9 ounce) package thin chocolate wafers",
        "3 (1 ounce) squares bittersweet chocolate",
        "3 tablespoons white sugar",
        "7 tablespoons butter",
        "12 (1 ounce) squares bittersweet chocolate",
        "4 (8 ounce) packages cream cheese",
        "1 3/4 cups white sugar",
        "4 eggs",
        "1/2 cup heavy whipping cream",
        "1/2 cup unsweetened cocoa powder",
        "1 tablespoon vanilla extract",
        "1 1/2 cups sour cream",
        "1/4 cup white sugar",
        "1/2 cup heavy whipping cream",
        "1 tablespoon butter",
        "6 (1 ounce) squares bittersweet chocolate",
        "1 teaspoon peppermint extract"
    ],
    "nut": [
        "Calories > 750 kcal",
        "Carbs > 64.2 g",
        "Cholesterol > 155 mg",
        "Fat > 51.5 g",
        "Protein > 10.9 g",
        "Sodium > 335 mg"
    ],
    "n": "Chocolate Mint Cheesecake",
    "a": "Bonny",
    "r": "0",
    "s": 16,
    "des": "\"This cheesecake is made with bittersweet chocolate. Beautiful garnished with fresh mint leaves.\"",
    "ins": "Grind the chocolate wafers and 3 ounces of chocolate in a food processor; the crumbs should be small.  Mix in 3 tablespoons of sugar.  Melt 7 tablespoons of butter or margarine, and add it to the chocolate crumbs.  Press into the bottom of a 9 inch springform pan.\nMelt 12 ounces of chocolate, and cool slightly.  Blend in cream cheese, 1 3/4 cups sugar, eggs, 1/2 cup cream, cocoa, vanilla, and peppermint extract.  Pour this in crust.  Bake for one hour at 350 degrees F (175 degrees C).  Cool overnight.\nIn a small bowl, mix together the sour cream and 1/4 cup sugar.  Pour on top of cooled cheesecake.  Bake for 20 minutes at 350 degrees F ( 175 degrees C).  Chill for 6 to 8 hours.\nTo decorate the cheesecake make a chocolate icing.  In a small saucepan, simmer 1/2 cup cream and 1 tablespoon butter.  Add to this 6 ounces of chocolate, and stir until melted.  Remove from heat.  Freeze until the mixture is piping consistency (stir occasionally).  Using a pastry bag, pipe a lattice on the top.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "802333.jpg",
    "o": "",
    "st": "allrecipes"
}