{
    "id": 73751,
    "old_rating": "4.6145",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups white sugar",
        "1 1/2 cups vegetable oil",
        "2 teaspoons vanilla extract",
        "3 eggs",
        "3 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon ground cinnamon",
        "1 teaspoon salt",
        "2 medium Granny Smith apples - peeled, cored and chopped",
        "1 cup chopped walnuts",
        "1/2 cup butter or margarine",
        "2 teaspoons milk",
        "1/2 cup brown sugar"
    ],
    "nut": [
        "Calories > 682 kcal",
        "Carbs > 71.1 g",
        "Cholesterol > 67 mg",
        "Fat > 42.8 g",
        "Protein > 6.5 g",
        "Sodium > 375 mg"
    ],
    "n": "Apple Harvest Pound Cake with Caramel Glaze",
    "a": "DaniBanani",
    "r": "0",
    "s": 12,
    "des": "\"This is a fantastic Bundt cake that my grandmother used to make for Thanksgiving. It has been a family favorite for years!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9 inch Bundt pan.\nIn a large bowl, beat the sugar, oil, vanilla and eggs with an electric mixer until light and fluffy. Combine the flour, baking soda, cinnamon and salt; stir into the batter just until blended. Fold in the apples and walnuts using a spoon. Pour into the prepared pan.\nBake for 1 hour and 20 minutes in the preheated oven, until a toothpick inserted into the crown or the cake comes out clean. Allow to cool for about 20 minutes then invert on to a wire rack.\nMake the glaze by heating the butter, milk and brown sugar in a small saucepan over medium heat. Bring to a boil, stirring to dissolve the sugar, then remove from the heat. Drizzle over the warm cake. I like to place a sheet of aluminum foil under the cooling rack to catch the drips for easy clean up.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "2614991.jpg",
    "o": "4465732.jpg,4352480.jpg,4275821.jpg,4273064.jpg,4204264.jpg,4148374.jpg",
    "st": "allrecipes"
}