{
    "id": 73754,
    "old_rating": "4.68571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 envelopes microwave popcorn without butter, popped",
        "4 cups corn cereal puffs (e.g. Kixâ„¢)",
        "1 (10.5 ounce) bag extruded corn chips (e.g. Fritosâ„¢)",
        "2 (2.25 ounce) packages blanched slivered almonds",
        "2 cups thin pretzel sticks",
        "1 pound vanilla flavored confectioners' coating"
    ],
    "nut": [
        "Calories > 317 kcal",
        "Carbs > 36.5 g",
        "Cholesterol > 5 mg",
        "Fat > 16.8 g",
        "Protein > 5.6 g",
        "Sodium > 323 mg"
    ],
    "n": "Lip-Smacking Popcorn Concoction",
    "a": "DaniBanani",
    "r": "0",
    "s": 20,
    "des": "\"This is an easy and extremely tasty recipe! Every time I make this, I have people lined up to get the recipe! Cereal, corn chips, pretzels and nuts are coated with a vanilla confectioner's coating (also known as almond bark). This recipe makes a LOT--enough to fill an entire punch bowl and then some! Great for get-togethers.\"",
    "ins": "Cover a large flat surface with waxed paper.  In a large bowl, stir together the popcorn, cereal, corn chips, almonds, and pretzels.\nMelt the confectioners' coating in a glass bowl in the microwave for 1 minute. Continue to cook at 30 second intervals, stirring between each one, until the coating is smooth.\nPour melted coating over the cereal mixture. It's best to use a large metal spoon, and pour 1 or 2 spoonfuls at a time then mix to ensure even distribution. (A second person can be useful here - one to pour, one to mix.) Once everything is coated, spread the mixture out onto waxed paper in a thin layer. Let stand for about 1/2 hour, or until coating is dry. Transfer to a bowl to serve, or store in an airtight container.",
    "pt": "20 m",
    "ct": "3 m",
    "tt": "23 m",
    "i": "11115.jpg",
    "o": "",
    "st": "allrecipes"
}