{
    "id": 73855,
    "old_rating": "3.45946",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (1 pound) sweet potato",
        "2 cups rolled oats",
        "2 tablespoons olive oil (optional)",
        "1 tablespoon dark molasses (optional)",
        "4 eggs",
        "1 egg white",
        "2 teaspoons vanilla extract",
        "2 teaspoons ground cinnamon",
        "1 cup plain yogurt"
    ],
    "nut": [
        "Calories > 179 kcal",
        "Carbs > 24 g",
        "Cholesterol > 76 mg",
        "Fat > 6.2 g",
        "Protein > 7 g",
        "Sodium > 78 mg"
    ],
    "n": "Sweet Potato Pancakes",
    "a": "Kendra M.",
    "r": "0",
    "s": 10,
    "des": "\"Super healthy and really delicious, Sweet Potato Pancakes will keep the simple carbohydrates out of your breakfast!  Make sure you serve the pancakes before you reveal their ingredients.  These are such a treat that even kids will eat them! I keep them in my fridge so I only have to go to the effort once a week.\"",
    "ins": "Pierce the sweet potato a few times with a fork. Wrap in a paper towel and cook in the microwave for 5 minutes at full power, or until tender. Cool slightly, and remove the skin with a small knife.\nMeanwhile, process the oats in a blender or food processor until powdery. Transfer the oats to a large bowl. Break the sweet potato into chunks, and place in the food processor. Blend until smooth. Transfer to the bowl with the oats, and stir in the olive oil, molasses, eggs, egg white, vanilla, cinnamon and yogurt. Adjust the thickness to your liking by adding more yogurt if necessary.\nHeat a lightly greased skillet over medium heat. Pour 1/4 cupfuls of batter onto the skillet when hot, and cook until bubbles appear on the surface. Flip, and cook on the other side until browned. Continue with remaining batter.",
    "pt": "20 m",
    "ct": "10 m",
    "tt": "30 m",
    "i": "4517266.jpg",
    "o": "",
    "st": "allrecipes"
}