{
    "id": 73873,
    "old_rating": "4.51923",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup margarine",
        "1 1/4 cups white sugar",
        "1 teaspoon salt",
        "2 eggs",
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "2 cups fresh blueberries",
        "1/2 cup soy milk",
        "1 tablespoon vanilla extract",
        "1 tablespoon lime juice",
        "1 tablespoon white sugar for decoration"
    ],
    "nut": [
        "Calories > 175 kcal",
        "Carbs > 28.3 g",
        "Cholesterol > 21 mg",
        "Fat > 5.8 g",
        "Protein > 2.5 g",
        "Sodium > 239 mg"
    ],
    "n": "Best Lactose Free Blueberry Muffins",
    "a": "GINBLAKE",
    "r": "0",
    "s": 18,
    "des": "\"You won't miss the dairy in these tangy blueberry muffins!  They have great flavor and a moist texture that produces muffins that no one will believe came from a dairy-free recipe. Be sure to check the label on your margarine for milk solids. Some margarines will contain some milk product.\"",
    "ins": "Preheat the oven to 375 degrees F (190 degrees C). Line muffin pans with paper liners, and spray the tops with cooking spray.\nIn a large bowl, mix together the margarine, 1 1/4 cups of sugar, and salt until smooth. Beat in the eggs one at a time until well blended. In a separate bowl, stir together the flour and baking powder. Spoon some of this mixture onto the blueberries, and toss to coat. This will keep them from sinking to the bottom. Stir the remaining flour mixture into the bowl with the eggs, alternating with the soy milk, vanilla extract, and lime juice. Gently fold in the blueberries. Spoon the batter into the muffin cups, filling to the top. Sprinkle a little sugar over the tops of the muffins.\nBake for 25 minutes in the preheated oven, or until muffin tops are golden brown, and the tops spring back when pressed lightly. Cool for at least 10 minutes before removing from pan.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "35 m",
    "i": "4436435.jpg",
    "o": "",
    "st": "allrecipes"
}