{
    "id": 74037,
    "old_rating": "4.75182",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 teaspoon dried rosemary",
        "1/4 teaspoon dried basil",
        "1/2 teaspoon dried thyme",
        "salt and pepper to taste",
        "4 lamb chops (3/4 inch thick)",
        "1 tablespoon olive oil",
        "1/4 cup minced shallots",
        "1/3 cup aged balsamic vinegar",
        "3/4 cup chicken broth",
        "1 tablespoon butter"
    ],
    "nut": [
        "Calories > 257 kcal",
        "Carbs > 5.2 g",
        "Cholesterol > 65 mg",
        "Fat > 19.4 g",
        "Protein > 14.7 g",
        "Sodium > 250 mg"
    ],
    "n": "Lamb Chops with Balsamic Reduction",
    "a": "PGRAYMENDOZA",
    "r": "0",
    "s": 4,
    "des": "\"This recipe for lamb chops is a favorite in my house.  It is an easy and quick recipe for two people (we eat two chops each). Rosemary and thyme give it great flavor.  If you double the recipe, remember that the sauce will take longer to reduce.\"",
    "ins": "In a small bowl or cup, mix together the rosemary, basil, thyme, salt and pepper. Rub this mixture onto the lamb chops on both sides. Place them on a plate, cover and set aside for 15 minutes to absorb the flavors.\nHeat olive oil in a large skillet over medium-high heat. Place lamb chops in the skillet, and cook for about 3 1/2 minutes per side for medium rare, or continue to cook to your desired doneness. Remove from the skillet, and keep warm on a serving platter.\nAdd shallots to the skillet, and cook for a few minutes, just until browned. Stir in vinegar, scraping any bits of lamb from the bottom of the skillet, then stir in the chicken broth. Continue to cook and stir over medium-high heat for about 5 minutes, until the sauce has reduced by half. If you don't, the sauce will be runny and not good. Remove from heat, and stir in the butter. Pour over the lamb chops, and serve.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "40 m",
    "i": "4539654.jpg",
    "o": "4539654.jpg,4539138.jpg,4536339.jpg,4500692.jpg,4489408.jpg,4486517.jpg",
    "st": "allrecipes"
}