{
    "id": 74086,
    "old_rating": "4.50641",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (9 ounce) package cheese tortellini",
        "1 pound flank steak",
        "garlic powder to taste",
        "salt and pepper to taste",
        "1 tablespoon olive oil",
        "2 heads romaine lettuce, torn into bite-size pieces",
        "2 (2.25 ounce) cans small pitted black olives, drained",
        "1 cup Caesar-style croutons",
        "2 small fresh tomatoes, chopped",
        "1 (8 ounce) bottle Caesar salad dressing"
    ],
    "nut": [
        "Calories > 671 kcal",
        "Carbs > 46.6 g",
        "Cholesterol > 83 mg",
        "Fat > 42.1 g",
        "Protein > 27.8 g",
        "Sodium > 1450 mg"
    ],
    "n": "Tortellini, Steak, and Caesar",
    "a": "LROHNER",
    "r": "0",
    "s": 4,
    "des": "\"A well-balanced meal in a bowl! Goes well with a nice slice of Italian or French bread. This is a FAVE to take to work or school for lunch with both my teenaged daughters and son! I vary how much meat, pasta, and salad I use depending on how many servings I need. If you want to make it in advance or have leftovers, don't add the dressing and croutons beforehand.  Mix croutons right before packaging and send dressing on the side. I make this whenever I have leftover steak!\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Place pasta in the pot, cook for 7 to 9 minutes, until al dente, and drain.\nPreheat the oven broiler. Season steak with garlic powder, salt, and pepper; rub with olive oil. Place steak in a baking dish, and broil 5 minutes on each side, or to desired doneness. Slice diagonally into thin strips.\nIn a bowl, toss the cooked tortellini, lettuce, olives, croutons, tomatoes, and dressing. Top with steak strips to serve.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "643726.jpg",
    "o": "4503980.jpg,3472264.jpg,3291559.jpg,2521390.jpg,474371.jpg,474370.jpg",
    "st": "allrecipes"
}