{
    "id": 74101,
    "old_rating": "4.875",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 tablespoons chopped fresh marjoram",
        "3 tablespoons chopped fresh rosemary",
        "3 tablespoons chopped fresh thyme",
        "3 tablespoons chopped fresh basil",
        "3 tablespoons garlic, minced",
        "1 pinch ground black pepper to taste",
        "1 (12 pound) whole turkey, neck and giblets removed",
        "1/4 cup olive oil",
        "2 large lemons, juiced, lemon halves reserved",
        "1 tablespoon all-purpose flour",
        "1 turkey-size oven roasting bag"
    ],
    "nut": [
        "Calories > 722 kcal",
        "Carbs > 3.6 g",
        "Cholesterol > 264 mg",
        "Fat > 36 g",
        "Protein > 91.2 g",
        "Sodium > 221 mg"
    ],
    "n": "Lemon-Herb Turkey",
    "a": "MISSJEN",
    "r": "0",
    "s": 12,
    "des": "\"Your mouth will water as this easy, flavorful turkey roasts in your oven all afternoon!\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C). Mix the marjoram, rosemary, thyme, basil, garlic, and black pepper in a small dish; set aside.\nGently lift the skin of the turkey away from the meat, and lightly brush the meat with olive oil. Sprinkle the meat evenly with lemon juice, then sprinkle the meat with 2/3 of the mixed herbs. Pat the turkey skin onto the meat; sprinkle the remaining herbs into the turkey cavity, and add the squeezed lemon halves. Place the flour into the turkey roasting bag, and shake to evenly coat. Place the turkey into the bag, close the end with a nylon tie, and place into a deep roasting pan. Cut 6 half-inch slits in the top of the bag.\nBake the turkey in the preheated oven until no longer pink at the bone and the juices run clear, 2 to 2 1/2 hours.  An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). Remove the turkey from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area 10 to 15 minutes before slicing.",
    "pt": "30 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "637193.jpg",
    "o": "",
    "st": "allrecipes"
}