{
    "id": 74151,
    "old_rating": "3.92857",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1 teaspoon salt",
        "3/4 cup butter flavored shortening",
        "5 tablespoons ice water",
        "6 fresh peaches - peeled, pitted and halved",
        "1/4 cup butter, softened",
        "1 egg",
        "1/4 teaspoon ground nutmeg",
        "1 teaspoon vanilla extract",
        "1 pinch salt",
        "2 cups confectioners' sugar"
    ],
    "nut": [
        "Calories > 658 kcal",
        "Carbs > 79.6 g",
        "Cholesterol > 51 mg",
        "Fat > 35.8 g",
        "Protein > 5.5 g",
        "Sodium > 459 mg"
    ],
    "n": "Fresh Peach Dumplings Served with Hard Sauce",
    "a": "MARYBAKEWELL",
    "r": "0",
    "s": 6,
    "des": "\"This is fresh peaches wrapped in a rich flakey dough, and topped with a teaspoon of hard sauce after baked. No sugar is used on the peaches, just the sauce. Sugar free ice cream could be used instead of hard sauce.\"",
    "ins": "In a medium bowl, stir together the flour and salt. Cut in the butter flavored shortening using your hands or a pastry blender until the mixture resembles coarse crumbs. Sprinkle the ice water over the dough, and stir until the mixture comes together. Knead the dough briefly, then divide into 6 pieces.\nPreheat the oven to 375 degrees F (190 degrees C).\nOn a lightly floured surface roll out each piece of dough into a thin circle. Place two peach halves together, and wrap in each circle of dough, sealing at the top. Place the dumplings onto an ungreased baking sheet.\nBake dumplings for 30 minutes in the preheated oven, or until golden brown. While the dumplings are baking, make the sauce. In a medium bowl, mix together the butter, egg, nutmeg, vanilla and salt using an electric mixer on low speed. Gradually mix in the confectioners' sugar. Spoon over warm dumplings.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "102878.jpg",
    "o": "",
    "st": "allrecipes"
}