{
    "id": 7425,
    "old_rating": "3.89509",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons unsweetened cocoa powder",
        "2 ounces red food coloring",
        "1 cup buttermilk",
        "1 teaspoon salt",
        "1 teaspoon vanilla extract",
        "1/2 cup shortening",
        "1 1/2 cups white sugar",
        "2 eggs",
        "2 1/2 cups all-purpose flour, sifted",
        "1 1/2 teaspoons baking soda",
        "1 teaspoon white vinegar",
        "1 cup milk",
        "5 tablespoons all-purpose flour",
        "1 cup white sugar",
        "1 cup butter",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 513 kcal",
        "Carbs > 66.6 g",
        "Cholesterol > 74 mg",
        "Fat > 25.7 g",
        "Protein > 5.8 g",
        "Sodium > 502 mg"
    ],
    "n": "Red Velvet Cake I",
    "a": "JJOHN32",
    "r": "0",
    "s": 12,
    "des": "\"A family favorite -- great for the Christmas holiday.\"",
    "ins": "Grease two 9 inch round pans. Preheat oven to 350 degrees F (175 degrees C). Make a paste of cocoa and food coloring.  Set aside.\nCombine the buttermilk, salt and 1 teaspoon vanilla.  Set aside.  In a large bowl, cream together the shortening and 1 1/2 cups sugar until light and fluffy. Beat in the eggs one at a time, then stir in the cocoa mixture.  Beat in the buttermilk mixture alternately with the flour, mixing just until incorporated.  Stir together baking soda and vinegar, then gently fold into the cake batter.\nPour batter into prepared pans. Bake in the preheated oven for 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool completely before frosting.  Refrigerate until ready to serve.\nTo Make Icing:   In a saucepan, combine the milk and 5 tablespoons flour.  Cook over low heat, stirring constantly, until mixture thickens.  Set aside to cool completely.  Cream together butter, 1 cup sugar and 1 teaspoon vanilla until light and fluffy, then stir in the cooled milk and flour mixture, beating until icing reaches spreading consistency.",
    "pt": "15 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "4439588.jpg",
    "o": "4439588.jpg,4327945.jpg,3947977.jpg,3658453.jpg,3658448.jpg,2873119.jpg",
    "st": "allrecipes"
}