{
    "id": 74360,
    "old_rating": "4.45037",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon butter",
        "1/4 cup minced onion",
        "2 cloves garlic, minced",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons freshly ground black pepper",
        "2 pounds extra-lean ground beef",
        "3 slices bread, toasted and crumbled",
        "7 buttery round crackers, crushed",
        "1 egg, lightly beaten",
        "3 1/2 tablespoons sour cream",
        "1 1/2 tablespoons Worcestershire sauce",
        "1 (15 ounce) can tomato sauce, divided",
        "1/4 cup milk (optional)",
        "3 tablespoons ketchup"
    ],
    "nut": [
        "Calories > 213 kcal",
        "Carbs > 8.7 g",
        "Cholesterol > 76 mg",
        "Fat > 11.6 g",
        "Protein > 17.9 g",
        "Sodium > 649 mg"
    ],
    "n": "The Best Meatloaf I've Ever Made",
    "a": "sillyliltracy",
    "r": "0",
    "s": 12,
    "des": "\"When I was growing up, my mom never ever made meatloaf and I always wanted to try it - I finally tried it at a restaurant and loved it. When I moved out on my own I started experimenting with different recipes and creating my own version. I finally came up with the best meatloaf I have ever made, and I wanted to share it.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nMelt the butter in a skillet over medium heat, and cook the onion and garlic 5 minutes, until onion is tender. Remove from heat, and season with salt and pepper.\nIn a large bowl, mix the onion and garlic, beef, crumbled bread, crushed crackers, egg, sour cream, Worcestershire sauce, and 1/2 can tomato sauce. Gradually stir in the milk 1 teaspoon at a time until mixture is moist, but not soggy. Transfer the mixture to a 5x9 inch loaf pan.\nBake uncovered in the preheated oven 40 minutes. Increase oven temperature to 400 degrees F (200 degrees C), and continue baking 15 minutes, to an internal temperature of 160 degrees F (70 degrees C).\nIn a small bowl, mix the remaining tomato sauce and ketchup. Pour over the top of the meatloaf, and continue baking 10 minutes.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4516918.jpg",
    "o": "4516918.jpg,4510615.jpg,4510251.jpg,4508515.jpg,4504112.jpg,4503408.jpg",
    "st": "allrecipes"
}