{
    "id": 7455,
    "old_rating": "1.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "4 eggs",
        "3/4 teaspoon baking soda",
        "16 fun size bars chocolate-coated caramel-peanut nougat candy",
        "1/4 teaspoon salt",
        "1 cup unsalted butter",
        "1/4 cup water",
        "2 cups white sugar",
        "2 tablespoons peanut butter",
        "3 teaspoons vanilla extract",
        "2 cups all-purpose flour",
        "1 1/4 cups buttermilk"
    ],
    "nut": [
        "Calories > 259 kcal",
        "Carbs > 33.5 g",
        "Cholesterol > 54 mg",
        "Fat > 12.5 g",
        "Protein > 4 g",
        "Sodium > 128 mg"
    ],
    "n": "Chocolate Caramel Nut Cake II",
    "a": "Stephanie",
    "r": "0",
    "s": 24,
    "des": "\"This cake is excellent with a big scoop of vanilla ice cream on top!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease and flour two 9 inch square cake pans.\nIn the top of a double boiler, combine the cut up candy bars, water, and peanut butter. Heat and a stir until well melted and blended. Set mixture aside to cool.\nMix together the flour, baking soda, and salt. Set aside.\nSeparate the egg whites from the yolks. Beat the egg whites until stiff peaks are formed. Set aside.\nIn a large bowl, cream butter or margarine thoroughly. Gradually add the sugar and beat in the 4 unbeaten egg yolks, vanilla, and cooled candy bar mixture. Mix until smooth and add 1/4 cup of the buttermilk. Stir in the flour mixture alternately with the remaining 1 cup of buttermilk, mix only until just blended. Gently fold in the stiffly beaten egg whites. Pour batter into prepared pans.\nBake at 350 degrees F (175 degrees C) for 45 minutes. Let cakes cool in pans for 5 minutes then turn out onto a cake rack to finish cooling. Serve with ice cream or whipped cream, if desired.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}