{
    "id": 74576,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 medium russet potatoes",
        "4 green onions, chopped",
        "1 cup sour cream",
        "1/2 cup cubed processed cheese",
        "1/4 cup shredded Cheddar cheese",
        "garlic powder to taste",
        "seasoned salt to taste",
        "ground black pepper to taste",
        "1 tablespoon chopped green onion (optional)",
        "1/4 cup shredded Cheddar cheese (optional)"
    ],
    "nut": [
        "Calories > 170 kcal",
        "Carbs > 20 g",
        "Cholesterol > 20 mg",
        "Fat > 7.9 g",
        "Protein > 5.6 g",
        "Sodium > 167 mg"
    ],
    "n": "Twice Microwaved Potatoes",
    "a": "GENELLEB",
    "r": "0",
    "s": 12,
    "des": "\"If you like twice-baked potatoes, but not the time involved, or the heat of an oven in the summertime, this recipe is for you. Russet potatoes, cheese, green onions, and sour cream star in this hearty side dish.\"",
    "ins": "Poke potatoes with the tines of a fork, and place them in the microwave oven. The more holes, the better. Cook on high power for about 4 minutes per potato. Check about halfway through, and turn potatoes over for even cooking. Potatoes are done when they can be easily poked with a fork.\nRemove potatoes from the microwave, and cut each one in half lengthwise. Use a large spoon to scoop out the inside of the potatoes, leaving the skins intact. Place the scoopings into a large microwave safe bowl, and stir in the 4 green onions, sour cream, processed cheese, and 1/4 cup Cheddar cheese. Season with garlic powder, seasoned salt, and black pepper; mix well.\nPlace the bowl in the microwave, and cook for 2 to 3 minutes, or until heated through. Scoop the mixture back into the potato skins to serve, or serve from the bowl. Garnish with additional green onion and shredded cheese if desired.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "805857.jpg",
    "o": "",
    "st": "allrecipes"
}