{
    "id": 74580,
    "old_rating": "4.57613",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup olive oil",
        "1/4 cup soy sauce",
        "1/4 cup red wine",
        "1/4 cup Worcestershire sauce",
        "1 tablespoon Dijon mustard",
        "1 tablespoon lemon juice",
        "1 clove garlic, minced",
        "1 teaspoon Italian seasoning",
        "1/2 teaspoon ground black pepper",
        "1 1/2 pounds flank steak, pounded to 1/2 inch thickness",
        "1 clove garlic, peeled",
        "1/4 teaspoon salt",
        "1/4 cup chopped onion",
        "1/4 cup fine dry bread crumbs",
        "1 cup frozen chopped spinach, thawed and squeezed dry",
        "1/2 cup crumbled feta cheese"
    ],
    "nut": [
        "Calories > 300 kcal",
        "Carbs > 10.1 g",
        "Cholesterol > 47 mg",
        "Fat > 20.3 g",
        "Protein > 17.6 g",
        "Sodium > 1099 mg"
    ],
    "n": "Flank Steak Pinwheels",
    "a": "Linda",
    "r": "0",
    "s": 6,
    "des": "\"The combination of the marinade, spinach, onion and feta make this a delicious and impressive flank steak recipe that is always a huge hit for guests! Easy to prepare (but it doesn't look like it is), great tasting and pretty to look at too!\"",
    "ins": "In a large resealable bag, combine the olive oil, soy sauce, red wine, Worcestershire sauce, mustard, lemon juice, 1 clove of garlic, Italian seasoning and pepper. Squeeze the bag to blend well. Pierce the flank steak with a knife, making small slits about 1 inch apart. Place the steak into the bag, and seal. Refrigerate overnight to marinate.\nPreheat the oven to 350 degrees F (175 degrees C).\nCrush the remaining clove of garlic on a cutting board with a large chef's knife. Sprinkle the salt over the garlic, and scrape with the blunt side of the knife to make a paste.\nRemove the steak from the bag, and discard marinade. Spread the garlic paste over the top side of the steak. Place layers of chopped onion, bread crumbs, spinach, and cheese over the garlic. Roll the steak up lengthwise, and secure with kitchen twine or toothpicks. Place the roll in a shallow glass baking dish.\nBake uncovered for 1 hour in the preheated oven, or until the internal temperature of the roll is at least 145 degrees F (63 degrees F) in the center. Let stand for 5 minutes to set, then slice into 1 inch slices to serve.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "9 h ",
    "i": "820481.jpg",
    "o": "4497592.jpg,4263373.jpg,3305678.jpg,2116320.jpg,2116319.jpg,2020121.jpg",
    "st": "allrecipes"
}