{
    "id": 7461,
    "old_rating": "4.26316",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups white sugar",
        "1 cup unsalted butter",
        "3 eggs",
        "1/4 teaspoon salt",
        "1/4 teaspoon baking soda",
        "2 teaspoons vanilla extract",
        "2 3/4 cups all-purpose flour",
        "1 cup buttermilk",
        "2 cups packed brown sugar",
        "1/2 cup butter",
        "1/2 cup evaporated milk",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 619 kcal",
        "Carbs > 93.4 g",
        "Cholesterol > 111 mg",
        "Fat > 25.5 g",
        "Protein > 6.2 g",
        "Sodium > 192 mg"
    ],
    "n": "Mary Oppenhiemer's Butter Cake",
    "a": "S. Helms",
    "r": "0",
    "s": 12,
    "des": "\"This is an old family recipe from my deceased grandmother, whom I am honoring today by placing her recipe on your site for Mother's Day.  I used this recipe to win a cooking contest in 1983 for Pet Dairy, INC. in Sarasota, FL where I worked.  I was so surprised and honored to win and I want to share her recipe with all of you.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour one 10 inch bundt pan.\nCream together the white sugar and 1 cup of the butter. Add the eggs one at time, beating mixture well after each. Mix the baking soda with the buttermilk. Add to butter mixture and beat.\nSift flour three times before measuring. Add sifted flour and 1/4 teaspoon salt to the butter mixture. Stir in the 2 teaspoons vanilla. Pour batter into prepared pan.\nBake at 325 degrees F (165 degrees C) for one hour. Let cake cool and top with Caramel Icing.\nTo Make Caramel Icing: In a saucepan over medium heat cook the brown sugar, remaining 1/2 cup butter, and the evaporated milk. Stirring frequently bring mixture to a boil and let boil for 3 minutes. Remove from heat and stir in the 1 teaspoon vanilla, beat until thick. Pour over top of cooled bundt cake.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "1121593.jpg",
    "o": "",
    "st": "allrecipes"
}