{
    "id": 7474,
    "old_rating": "4.07692",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3/4 pound carrots, cut into 2 inch pieces",
        "2/3 cup finely ground graham cracker crumbs",
        "2/3 cup gingersnap cookie crumbs",
        "2/3 cup ground pecans",
        "1/3 cup white sugar",
        "4 tablespoons unsalted butter, softened",
        "1/2 cup packed brown sugar",
        "1 tablespoon lemon juice",
        "1 teaspoon orange zest",
        "1 teaspoon minced fresh ginger root",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground mace",
        "1/4 teaspoon ground allspice",
        "2 (8 ounce) packages cream cheese, diced and softened",
        "4 eggs",
        "1/4 cup chopped pecans"
    ],
    "nut": [
        "Calories > 347 kcal",
        "Carbs > 26.8 g",
        "Cholesterol > 113 mg",
        "Fat > 24.9 g",
        "Protein > 6.4 g",
        "Sodium > 203 mg"
    ],
    "n": "Carrot Cheesecake with Crumb Crust",
    "a": "Suzanne Stull",
    "r": "0",
    "s": 12,
    "des": "\"Pureed carrot mixes with cream cheese in this very elegant cheesecake that also has a gingersnap and graham cracker crust.\"",
    "ins": "Bring 4 cups of water to a boil, and cook carrots until very tender about 45 minutes.  Drain cooked carrots.  Return them to a moderate heat for a minute or so to cook off excess moisture.\nPreheat oven to 400 degrees F (205 degrees C).  In a medium bowl, combine graham cracker crumbs, gingersnap crumbs, 2/3 cup ground nuts, and sugar; toss well.  Work in butter until mixture is crumbly.  Pat over bottom and up sides of a buttered 9 inch springform pan.  Bake the crust for 7 minutes.  Turn oven down to 350 degrees F (175 degrees C).\nTransfer carrots to food processor and puree for 30 seconds.  Scrape down side, and puree again until absolutely smooth.  Add brown sugar, ginger, lemon juice, orange zest, cinnamon, mace and allspice to the processor, and puree for 30 seconds.  Scrape down sides, and repeat.  Let mixture stand until cool.\nAdd cream cheese to cooled carrot mixture, and puree for 1 minute; scrape down sides every 20 seconds.  Beat in eggs, one at a time.  Pour batter into crust, and sprinkle with remaining 1/4 cup chopped nuts.\nBake for about 50 minutes; cake tester will come out clean.  Let cool.  Cover loosely, and refrigerate at least 4 hours before serving.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "817222.jpg",
    "o": "",
    "st": "allrecipes"
}