{
    "id": 75086,
    "old_rating": "4.58511",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil",
        "1 small onion, diced",
        "2 pounds cubed beef stew meat",
        "5 carrots, peeled and diced",
        "8 medium baking potatoes, peeled and cubed",
        "2 cubes beef bouillon",
        "2 cups water",
        "2 teaspoons cornstarch",
        "2 teaspoons salt, or to taste"
    ],
    "nut": [
        "Calories > 487 kcal",
        "Carbs > 42.4 g",
        "Cholesterol > 76 mg",
        "Fat > 23.8 g",
        "Protein > 25.6 g",
        "Sodium > 900 mg"
    ],
    "n": "Pressure Cooker Beef Stew",
    "a": "MISSCANADA",
    "r": "0",
    "s": 8,
    "des": "\"This beef stew was made for us when we were just infants, my mother used to put it in the blender for us as babies. To this day it reminds me of home. The pressure cooker makes the meat fall apart tender and cooks up in 20 minutes.\"",
    "ins": "Heat the oil in the bottom of the pressure cooker over medium-high heat. If your cooker has an insert, remove it and cook directly in the bottom of the pot. Add the onion and beef, and cook until browned on the outside.\nStir in the water, bouillon cubes and carrots, close the lid, and secure the pressure regulator. Heat until you start to hear sizzling, then reduce the heat to medium, and set your timer for 20 minutes. If you have an adjustable pressure regulator, set it for 10 pounds of pressure.\nMeanwhile, place the potatoes in a saucepan with enough water to cover. Bring to a boil, and cook until tender, about 10 minutes. Drain. This whole process should take about the same amount of time as the rest of the stew.\nWhen the 20 minutes are up, release the pressure from the pot according to the manufacturer's instructions - mine needs to sit under cold running water for 5 minutes until the lid can be released.\nRemove the lid, and place the pot over medium heat. Bring to a boil. Stir the cornstarch into a small amount of cold water to make a slurry. Stir this into the stew, and cook for a few minutes. Add the potatoes to the stew, or place them in serving dishes, and ladle the stew over them.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "1881119.jpg",
    "o": "",
    "st": "allrecipes"
}