{
    "id": 7517,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups butter",
        "4 cups all-purpose flour",
        "1 pound chopped pecans",
        "1 pound candied cherries",
        "1 teaspoon baking powder",
        "2 teaspoons vanilla extract",
        "2 cups white sugar",
        "6 eggs",
        "1 pound candied pineapple",
        "1 1/2 cups golden raisins",
        "1/4 teaspoon salt",
        "1 Golden Delicious apple - peeled, cored and sliced"
    ],
    "nut": [
        "Calories > 893 kcal",
        "Carbs > 117.9 g",
        "Cholesterol > 132 mg",
        "Fat > 45.6 g",
        "Protein > 10.1 g",
        "Sodium > 292 mg"
    ],
    "n": "Cherry Nut Cake II",
    "a": "Nancy Reeves",
    "r": "0",
    "s": 14,
    "des": "\"I make this one cake every Christmas. It stays moist and delicious  throughout the Holidays.\"",
    "ins": "Preheat oven to 250 degrees F (120 degrees C). Grease one 10 inch tube pan. Line the bottom of the pan with parchment paper and dust pan with flour.\nCream the light butter together with the white sugar. Add eggs one at a time mixing well after each one. Mix in the vanilla extract. Stir in 3 cups of the flour, baking powder, and salt and blend well.\nToss candied cherries, chopped pecans, candied pineapple, and white raisins with the remaining 1 cup flour. Stir fruit and nut mixture into the batter and pour into prepared pan.\nBake at 250 degrees F (120 degrees C) for 3 hours. Let cake cool for 20 minutes before removing from pan.\nAfter cake is cold, cut a piece of waxed paper to fit the top of the cake. Put the apple slices on top of the waxed paper and put cake into a closed container. Store cake in a cool dry area for about 3 days or until the cake takes up the juice from the apple slices. Remove apple slice and waxed paper and serve.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}