{
    "id": 7525,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cake:",
        "3 1/2 cups sifted all-purpose flour",
        "1/4 teaspoon salt",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "2 teaspoons ground cinnamon",
        "1 1/2 teaspoons ground allspice",
        "4 eggs",
        "3/4 cup white sugar",
        "4 tablespoons vegetable oil",
        "2 cups honey",
        "1/2 cup strong brewed coffee",
        "1/2 cup blanched slivered almonds",
        "1/2 cup raisins",
        "2 tablespoons slivered almonds for topping",
        "Glaze (Optional):",
        "1 1/2 cups honey",
        "2 tablespoons lemon juice",
        "1/2 cup water",
        "1/2 teaspoon lemon zest"
    ],
    "nut": [
        "Calories > 452 kcal",
        "Carbs > 97 g",
        "Cholesterol > 46 mg",
        "Fat > 7.2 g",
        "Protein > 5.7 g",
        "Sodium > 183 mg"
    ],
    "n": "Honey Cake II",
    "a": "Sandy in Baltimore",
    "r": "0",
    "s": 16,
    "des": "\"This honey cake is a great dessert for dinners surrounding the Jewish holiday of Rosh Hashanah, but also just for a tasty honey cake any time you want one.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Oil two loaf pans and line bottoms with parchment paper; grease the parchment as well.\nSift together the flour, salt, baking powder, baking soda, cinnamon and allspice. In a separate bowl, beat the eggs, gradually adding the sugar. Beat until thick and light in color, about 5 minutes. Beat in the oil, honey and coffee.  Stir flour mixture into egg mixture. Chop the almonds coarsely and mix with raisins; stir into batter.\nDivide batter between the two prepared loaf pans. Sprinkle with reserved slivered almonds.\nBake in preheated oven until a tester inserted in the center of each cake comes out clean, 65 to 75 minutes.  Let cool 10 minutes and remove from pan.\nTo Make Glaze: combine 1 1/2 cups honey, lemon juice, lemon zest and water in a saucepan. Bring to a boil over medium-high heat. When glaze reaches a thick consistency, remove from heat and drizzle over warm cake.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}