{
    "id": 75289,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/3 cup balsamic vinegar",
        "2/3 cup extra virgin olive oil",
        "2 tablespoons Dijon mustard",
        "salt and pepper to taste",
        "1/4 cup pine nuts",
        "1 pound thickly sliced honey-smoked bacon",
        "2 bunches baby spinach leaves",
        "1/4 cup crumbled Gorgonzola cheese",
        "1 medium red onion, quartered and thinly sliced"
    ],
    "nut": [
        "Calories > 695 kcal",
        "Carbs > 15.1 g",
        "Cholesterol > 52 mg",
        "Fat > 61 g",
        "Protein > 23.4 g",
        "Sodium > 1395 mg"
    ],
    "n": "Spinach-Gorganzola Salad",
    "a": "MRSMAC1993",
    "r": "0",
    "s": 4,
    "des": "\"A delicious family recipe that serves up well with BBQ'd dishes. A spinach salad with a hot bacon dressing goes will with crumbled gorgonzola cheese and pine nuts.  Well worth the effort to make.\"",
    "ins": "In a small bowl, whisk together the balsamic vinegar, olive oil, mustard, salt and pepper to make the dressing. Set aside.\nPlace the pine nuts in a dry skillet over medium heat. Cook and stir for a few minutes, just until they are fragrant and lightly toasted. Set aside to cool.\nCook bacon in a large skillet over medium-high heat until evenly browned and crisp. Remove bacon to paper towels to drain. Reserve a thin layer of bacon grease in the pan. Stir in about 1/4 cup of the dressing, and turn the heat to medium. Add the onions; cook, stirring occasionally, until caramelized, about 20 minutes.\nReduce the heat to low, and crumble the bacon into the pan. Stir in the remaining dressing, and heat through.\nPlace the spinach in a large bowl. Pour the warmed dressing with bacon and onion over the spinach, then sprinkle with pine nuts and gorgonzola cheese.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "967392.jpg",
    "o": "",
    "st": "allrecipes"
}