{
    "id": 7538,
    "old_rating": "4.38596",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup Dutch process cocoa powder",
        "3/4 cup boiling water",
        "1/2 teaspoon baking soda",
        "1 cup sour cream",
        "1/2 cup butter",
        "2 cups white sugar",
        "2 cups sifted cake flour",
        "3 egg whites",
        "1 1/2 teaspoons vanilla extract",
        "6 tablespoons butter, softened",
        "3/4 cup Dutch process cocoa powder",
        "2 2/3 cups confectioners' sugar",
        "1/2 cup milk",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 340 kcal",
        "Carbs > 56.6 g",
        "Cholesterol > 30 mg",
        "Fat > 12.7 g",
        "Protein > 3.7 g",
        "Sodium > 119 mg"
    ],
    "n": "Mafioso Chocolate Cake",
    "a": "The Pellettiere's",
    "r": "0",
    "s": 18,
    "des": "\"This is an old Italian family recipe for a cake we make at every big holiday. We actually lost the recipe for a while, and holidays just weren't the same. Then were overjoyed to recover it after a friend reminded us we had given it to her! We call it The Cake That Saved Christmas. A chocolate delight any gangster would love.\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C). Grease a 9x13 inch pan.\nIn a small bowl, mix together 1/2 cup cocoa and 3/4 cup boiling water; set aside.\nIn another small bowl, dissolve baking soda in the sour cream by stirring them together.\nIn a large bowl, cream the 1/2 cup butter and 2 cups sugar. To the butter and sugar mixture, alternately add the sifted flour and the cocoa mixture with the sour cream mixture. Beat until fluffy. Beat the egg whites until stiff and fold in the egg whites and 1 1/2 teaspoons of vanilla.\nBake in the preheated oven until a toothpick inserted near the center comes out clean, about 50 minutes. Frost with La Famiglia Chocolate Frosting (below).\nTo Make La Famiglia Chocolate Frosting:  Cream 6 tablespoons butter or margarine in a small bowl.   Add 3/4 cup cocoa and confectioner's sugar alternately with milk; beat until spreading consistency. More or less milk can be used depending on the texture you want. Blend in 1 teaspoon vanilla. This yields about 2 cups of frosting.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "173233.jpg",
    "o": "",
    "st": "allrecipes"
}