{
    "id": 75596,
    "old_rating": "4.56364",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (12 fluid ounce) can evaporated milk",
        "1 (14 ounce) can sweetened condensed milk",
        "2 cups milk",
        "2/3 cup heavy cream",
        "2 egg yolks, beaten",
        "1 cup white sugar",
        "1 cup lime juice",
        "2 teaspoons lemon extract (optional)",
        "1 (3 ounce) package lime flavored Jell-OÂ® mix",
        "6 whole graham crackers"
    ],
    "nut": [
        "Calories > 174 kcal",
        "Carbs > 26.6 g",
        "Cholesterol > 38 mg",
        "Fat > 6.2 g",
        "Protein > 4 g",
        "Sodium > 86 mg"
    ],
    "n": "Truly Key Lime Pie Ice Cream",
    "a": "Celiac_family_mom",
    "r": "0",
    "s": 24,
    "des": "\"I searched everywhere for a recipe like this on the 'net. Lots of looking but no success, so here's one I came up with.  My family loves this, and it's much more versatile than the 'real thing'(I'm making it into popsicles next)!\"",
    "ins": "In a saucepan over low heat, combine the evaporated milk, sweetened condensed milk, milk, and heavy cream. Cook until warm, whisking frequently. Once the mixture is hot to the touch, whisk in the gelatin mix and sugar, stirring constantly until sugar and gelatin are completely dissolved. Whisk in the egg yolks, and remove from the heat. Stir in the lime juice and lemon extract.\nPour the mixture into an ice cream maker, and freeze according to the manufacturer's instructions. This recipe takes a bit longer to set up than the usual ice cream.\nOnce the ice cream is thick, open the canister, and place large pieces of graham cracker evenly on each side. They will break into smaller pieces as the machine churns. Mix for about 5 more minutes. Transfer to a freezer container, seal, and freeze until solid. I like to use 1 gallon resealable freezer bags.",
    "pt": "7 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "4541430.jpg",
    "o": "",
    "st": "allrecipes"
}