{
    "id": 75631,
    "old_rating": "4.12209",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup chopped onion",
        "2 tablespoons olive oil",
        "1/2 cup dried lentils",
        "2 cups water",
        "2 cups broccoli florets",
        "1 cup chopped fresh tomatoes",
        "4 eggs, beaten",
        "1 cup milk",
        "1 teaspoon salt",
        "ground black pepper to taste",
        "2 teaspoons Italian seasoning",
        "1/2 cup shredded Cheddar cheese (optional)"
    ],
    "nut": [
        "Calories > 165 kcal",
        "Carbs > 12.4 g",
        "Cholesterol > 103 mg",
        "Fat > 9.1 g",
        "Protein > 9.7 g",
        "Sodium > 392 mg"
    ],
    "n": "Lentil Quiche",
    "a": "WONDER79",
    "r": "0",
    "s": 8,
    "des": "\"This is a tasty, protein-filled vegetarian meal. The recipe is really quite quick. Get the onions in, put the lentils on, then prep the rest of the ingredients. Once you've got the quiche in the oven, you've got 45 minutes of spare time!\"",
    "ins": "Preheat the oven to 375 degrees F (190 degrees C). Place the onion and olive oil into a 9 inch deep-dish pie plate. Bake for about 15 minutes, or until onion is tender.\nPlace the lentils and water into a saucepan, and bring to a boil. Cook for about 20 minutes, or until lentils are tender. Drain most of the water off, then place the broccoli florets on top of the lentils. Cover and cook for about 5 minutes. This will dry the lentils, and cook the broccoli.\nTransfer the lentils, broccoli and tomatoes to the pie plate with the onions, and stir to evenly distribute each item. Stir in cheese at this time if using. In a medium bowl, whisk together the eggs, milk, salt, pepper, and Italian seasoning. Pour over the ingredients in the pie plate.\nBake for 45 minutes in the preheated oven, or until the center is firm when the quiche is jiggled. Cool for a few minutes before slicing and serving.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "468512.jpg",
    "o": "4366646.jpg,2689999.jpg,1715165.jpg,1409136.jpg,1105096.jpg,868164.jpg",
    "st": "allrecipes"
}