{
    "id": 75645,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Crust",
        "1 1/2 cups all-purpose flour",
        "2 tablespoons cocoa powder",
        "3 tablespoons sugar",
        "1/2 cup vegetable oil",
        "1/4 cup ice water",
        "2 ounces unsweetened baking chocolate, chopped",
        "4 tablespoons sugar",
        "3 tablespoons butter or margarine",
        "Filling",
        "16 ounces cream cheese, at room temperature",
        "1/2 cup white chocolate flavored syrup",
        "1/4 cup all-purpose flour",
        "2 egg, beaten",
        "2 tablespoons mint jelly"
    ],
    "nut": [
        "Calories > 312 kcal",
        "Carbs > 26.6 g",
        "Cholesterol > 54 mg",
        "Fat > 21.7 g",
        "Protein > 4.9 g",
        "Sodium > 113 mg"
    ],
    "n": "Minty Middle Cheesecake",
    "a": "HANASAKU",
    "r": "0",
    "s": 16,
    "des": "\"I was thinking of ways I could use up the mint jelly that had been sitting in my fridge for a while, so I decided, why not make a cheesecake! It turned out though, that after baking the jelly, it has trouble re-setting in the fridge, keeping the middle nice and creamy.\"",
    "ins": "Preheat oven to 400 degrees F (205 degrees C).\nFor the crust, mix flour, cocoa, and 3 tablespoons sugar together in a bowl. Stir in oil and water until well blended. Press dough into the bottom and up the sides of a well-greased 8 inch springform cake pan.\nPlace baking chocolate and 4 tablespoons sugar in a microwave safe bowl. Microwave for 1 minute, stir, and continue heating until chocolate is completely melted. Add butter, and heat for another 30 seconds. Stir, and spread over bottom of the crust. Refrigerate or freeze crust while preparing filling.\nIn a large bowl, beat cream cheese to soften. Add white chocolate syrup and flour, and stir until well blended. Add one egg at a time until all are just incorporated into the mixture. Set aside.\nPour 1/2 cup of filling into a small bowl, and stir in mint jelly. Pour half of original filling into prepared pan, spreading evenly over crust. Pour in mint filling, spreading as evenly as possible without blending into bottom layer, then top with remaining filling.\nBake cake in the preheated oven at 400 degrees F (205 degrees C) for 10 minutes. Reduce heat to 200 degrees F (95 degrees C), and continue baking for another 30 minutes. When done baking, open oven door and allow cake to cool completely to prevent cracking, about 3 hours. Cover and refrigerate until ready to serve.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "4 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}