{
    "id": 7570,
    "old_rating": "4.65",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter, softened",
        "1 cup white sugar",
        "3 eggs",
        "1/4 teaspoon vanilla extract",
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/8 teaspoon salt",
        "2 drops red food coloring",
        "1 cup apricot preserves",
        "2 cups ground almonds",
        "3 cups confectioners' sugar",
        "1 egg, room temperature",
        "1 1/2 teaspoons lemon juice",
        "1/4 teaspoon almond extract"
    ],
    "nut": [
        "Calories > 646 kcal",
        "Carbs > 85.5 g",
        "Cholesterol > 103 mg",
        "Fat > 31.6 g",
        "Protein > 10.6 g",
        "Sodium > 209 mg"
    ],
    "n": "Battenburg Cake",
    "a": "Carol",
    "r": "0",
    "s": 12,
    "des": "\"This fancy almond-flavored tea cake, also called 'Battenberg/Battenburg Cake' or 'Battenberg/Battenburg Square' features a homemade marzipan.\"",
    "ins": "Cream butter and 1 cup sugar together.  Beat in 3 eggs, one at a time.  Mix in vanilla.  Stir in flour, baking powder and salt gently.  Add milk if needed.\nDivide batter into 2 equal parts.  Add food coloring to 1 part to make a deep pink color.  Grease two 7 inch square pans.  Spread batters into pans.\nBake at 350 degrees F (175 degrees C) until an inserted wooden pick comes out clean, about 25 to 30 minutes.  Let stand in pans 5 minutes.  Turn out on racks to cool.\nTrim edges from both cakes.  Cut each cake lengthwise into 4 strips as wide as the cake is thick.  Trim to make strips match.  Heat jam slightly.  Spread on sides to glue 2 pink and 2 white strips together checkerboard fashion.  Spread all 4 sides of completed cake with jam. Repeat with remaining pink and white stripes.  Makes two cakes.\nTo Make Almond Paste:  Mix almonds, confectioners' sugar, egg, lemon juice, and almond extract together.  Knead until smooth, adding a bit of lemon juice or water if too dry to roll.   Add only 1/2 teaspoon at a time.  It will be stiff.  Divide into 2 equal parts.\nRoll 1/2 of paste 1/8 inch or so thick on a surface lightly dusted with confectioners' sugar.  Cut to fit length of cake, and long enough to cover 4 sides leaving ends uncovered.  Lay cake on one end of paste.  Wrap to completely enclose all 4 sides of cake pinching paste to seal.  Roll in granulated sugar.  Place with seal underneath on serving plate, or store in plastic bag.  Repeat for second cake.  Chill.  Slice thinly to serve.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "605565.jpg",
    "o": "3449086.jpg,3422889.jpg,3422875.jpg,2692736.jpg,605571.jpg,23569.jpg",
    "st": "allrecipes"
}