{
    "id": 7573,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup butter",
        "1/4 cup shortening",
        "1 cup white sugar",
        "1 3/4 cups sifted cake flour",
        "2 1/2 teaspoons baking powder",
        "1/3 cup milk",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon almond extract",
        "5 egg whites, stiffly beaten",
        "1 cup white sugar",
        "2 tablespoons water",
        "1/2 teaspoon vanilla extract",
        "1/8 teaspoon cream of tartar",
        "2 egg whites",
        "2 drops red food coloring",
        "1/2 cup candy-coated milk chocolate eggs",
        "1 cup flaked coconut",
        "4 drops green food coloring"
    ],
    "nut": [
        "Calories > 466 kcal",
        "Carbs > 68.7 g",
        "Cholesterol > 16 mg",
        "Fat > 19.4 g",
        "Protein > 6.1 g",
        "Sodium > 209 mg"
    ],
    "n": "Easter Party Cake",
    "a": "Carol",
    "r": "0",
    "s": 10,
    "des": "\"This cake is a great holiday treat. Hope that you will enjoy it.\"",
    "ins": "Cream butter or margarine and shortening.  Add  1 cup sugar gradually, beating until mixture resembles whipped cream.\nSift flour and baking powder together 3 times; add to creamed mixture alternately with milk.  Stir in 1 teaspoon vanilla extract and almond extract.  Fold in stiffly beaten egg whites carefully.  Pour batter into two greased 8 inch round pans.\nBake for 20 to 30 minutes at 375 degrees F (190 degrees C).  Cool layers on wire racks.\nTo Make Boiled Icing:  Place 1 cup sugar, water, 1/2 teaspoon vanilla, cream of tartar, 2 egg whites, and red food colouring in top of double boiler.  Cook, beating constantly, until frosting  is thick and creamy.\nFrost cake with icing.  Make a  nest of green coconut on top of cake, and fill nest with candy eggs.  Sprinkle a border of coconut around base of cake.  Makes 15-20 servings.\nTo make green tinted coconut, Place coconut in a large plastic bag, put a few drops of green food color in the bag and shake until desired consistency is achieved.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}