{
    "id": 7587,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup graham cracker crumbs",
        "3 tablespoons white sugar",
        "3 tablespoons melted butter",
        "3 (8 ounce) packages cream cheese",
        "1 cup white sugar",
        "2 teaspoons vanilla extract",
        "1 cup sour cream",
        "1/3 cup Irish cream liqueur",
        "4 eggs",
        "1 cup sour cream",
        "1/4 cup white sugar"
    ],
    "nut": [
        "Calories > 476 kcal",
        "Carbs > 35.8 g",
        "Cholesterol > 148 mg",
        "Fat > 32.8 g",
        "Protein > 8 g",
        "Sodium > 273 mg"
    ],
    "n": "Irish Cream Cheesecake",
    "a": "v monte",
    "r": "0",
    "s": 12,
    "des": "\"A friend made this at a Christmas cookie exchange party and is was wonderful!  When in season serve with 1 pint strawberries, 1 1/2 pints raspberries, and 1 1/2 pints blackberries.\"",
    "ins": "Mix together cracker crumbs, 3 tablespoons sugar, and melted butter.  Press this crumb mixture into bottom of 9 inch springform pan with 2 3/4 inch high sides.  Bake at 350 degrees F (175 degrees) until brown - about 8 minutes. Transfer crust to rack and cool.  Maintain oven temperature.\nUsing electric mixer, beat cream cheese, 1 cup sugar and vanilla in large bowl until blended.  Beat in 1 cup sour cream and liqueur.  Add eggs one at a time, beating just until combined.  Pour filling over crust in pan.  Bake until edges are puffed, and center no longer moves when pan is shaken, about 1 to 1/2 hours.  Transfer cheesecake to rack, and cool 10 minutes.  Maintain oven temperature.\nMix 1 cup sour cream and 1/4 cup sugar in a small bowl until smooth. Press down edges of cheesecake, and spread mixture on top.  Bake 10 minutes. Transfer cheesecake to rack and cool.  Cover and refrigerate overnight.  Release pan from cheesecake.  Cut and serve.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "36429.jpg",
    "o": "",
    "st": "allrecipes"
}