{
    "id": 75936,
    "old_rating": "4.41532",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 pounds butternut squash, halved and seeded",
        "2 tablespoons butter",
        "1 medium onion, sliced",
        "1 leek, sliced",
        "2 cloves garlic, sliced",
        "2 (49.5 fluid ounce) cans chicken broth",
        "2 large russet potatoes, peeled and quartered",
        "1/8 teaspoon cayenne pepper",
        "1/8 teaspoon ground allspice",
        "1/8 teaspoon ground nutmeg",
        "1/8 teaspoon ground ginger",
        "salt and pepper to taste",
        "1/2 cup sherry wine",
        "1 cup half-and-half cream",
        "1/2 cup sour cream (optional)"
    ],
    "nut": [
        "Calories > 298 kcal",
        "Carbs > 45.2 g",
        "Cholesterol > 34 mg",
        "Fat > 10.6 g",
        "Protein > 7.1 g",
        "Sodium > 1855 mg"
    ],
    "n": "Spiced Butternut Squash Soup",
    "a": "LuvMyFamily",
    "r": "0",
    "s": 8,
    "des": "\"My boys LOVE this soup! It's a 'stick to your ribs' soup that everyone will enjoy. Sherry helps to deepen the flavor while half-and-half cream gives an added richness to the soup.\"",
    "ins": "Preheat the oven to 375 degrees F (190 degrees C). Pour a thin layer of water in a baking dish, or a cookie sheet with sides. Place the squash halves cut side down on the dish. Bake for about 40 minutes, or until a fork can easily pierce the flesh. Cool slightly, then remove the peel. Set aside.\nMelt the butter in a large pot over medium heat. Add the onion, leek and garlic, and saute for a few minutes, until tender. Pour the chicken broth into the pot. Add the potatoes, and bring to a boil. Cook for about 20 minutes, or until soft. Add the squash, and mash with the potatoes until chunks are small. Use an immersible hand blender to puree the soup, or transfer to a blender or food processor in batches, and puree until smooth. Return to the pot.\nSeason the soup with cayenne pepper, allspice, nutmeg, ginger, salt and pepper, then stir in the sherry and half-and-half cream. Heat through, but do not boil. Ladle into bowls, and top with a dollop of sour cream.",
    "pt": "45 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "104761.jpg",
    "o": "4460227.jpg,3262453.jpg,516609.jpg,500991.jpg,128278.jpg,126058.jpg",
    "st": "allrecipes"
}