{
    "id": 75947,
    "old_rating": "4.28879",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon butter",
        "1 clove garlic, pressed",
        "6 pork chops",
        "salt and pepper to taste",
        "1 (8 ounce) can mushrooms, drained",
        "1 cup dry sherry",
        "1 (10.5 ounce) can beef broth",
        "2 tablespoons cornstarch",
        "2 tablespoons water"
    ],
    "nut": [
        "Calories > 209 kcal",
        "Carbs > 10.7 g",
        "Cholesterol > 59 mg",
        "Fat > 8.1 g",
        "Protein > 19.2 g",
        "Sodium > 609 mg"
    ],
    "n": "Grandma's Pork Chops in Mushroom Gravy",
    "a": "HEIDIHELM",
    "r": "0",
    "s": 6,
    "des": "\"This is my Grandma's recipe that she gave me when I got married. Pork chops are baked then served with a rich mushroom sauce. It takes a little bit of work, but is great for a special dinner - my husband loves it!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nMelt the butter in a large skillet over medium heat. Add garlic, and saute until fragrant. Season pork chops with salt and pepper, then fry them in the skillet just until browned on both sides, about 3 minutes per side. Remove the pork chops to a baking pan or Dutch oven.\nPour the mushrooms into the skillet with the pork drippings and garlic, and stir in the sherry and beef broth, scraping any bits of pork that are stuck to the pan. Bring to a boil, then pour over the pork chops in the baking pan. Cover with a lid, or aluminum foil.\nBake for 45 minutes in the preheated oven, then remove the lid or foil, and continue to bake for another 15 minutes. Remove the chops from the pan to a serving platter, and place the dish on the stove over medium heat. Stir together the cornstarch and water. When the juices in the pan come to a boil, slowly stir in the cornstarch mixture and cook until thickened, about 2 minutes. Spoon sauce over the chops, and serve.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "800600.jpg",
    "o": "4254437.jpg,3360508.jpg,3346445.jpg,3339439.jpg,3338735.jpg,1289626.jpg",
    "st": "allrecipes"
}