{
    "id": 7631,
    "old_rating": "4.51572",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Crust:",
        "1 1/2 cups finely crushed chocolate wafer cookies",
        "2 tablespoons white sugar",
        "1/4 cup melted butter",
        "Cake:",
        "2 (8 ounce) packages cream cheese, cut into chunks",
        "3/4 cup white sugar",
        "2 tablespoons white sugar",
        "1 cup sour cream",
        "3 large eggs",
        "1 teaspoon vanilla extract",
        "Cookie Dough:",
        "1/4 cup butter, softened",
        "1/4 cup firmly packed brown sugar",
        "1/4 cup white sugar",
        "2 tablespoons water",
        "1 teaspoon vanilla extract",
        "1 cup semisweet chocolate chips",
        "1/2 cup all-purpose flour",
        "Topping:",
        "1 cup sour cream",
        "2 teaspoons white sugar",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 549 kcal",
        "Carbs > 51.8 g",
        "Cholesterol > 125 mg",
        "Fat > 36.2 g",
        "Protein > 7.7 g",
        "Sodium > 287 mg"
    ],
    "n": "Chocolate Chip Cookie Dough Cheesecake",
    "a": "Star Pooley",
    "r": "0",
    "s": 12,
    "des": "\"If you love chocolate chip cookie dough straight out of the batter bowl or in ice cream, you'll love this next recipe! A small piece goes a long way! It's well worth the work!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nMix the chocolate wafer cookie crumbs, 2 tablespoons white sugar, and melted butter together in a bowl. Press firmly into the bottom and 1/2-inch up the sides of a 9-inch springform pan.\nBake crust in the preheated oven until set, about 8 minutes.\nBeat cream cheese and 3/4 cup plus 2 tablespoons white sugar together in a bowl until creamy. Add 1 cup sour cream, eggs, and 1 teaspoon vanilla extract; beat until batter is smooth. Pour batter over crust into springform pan.\nBeat 1/4 cup butter, brown sugar, and 1/4 cup white sugar together in a bowl. Stir water and 1 teaspoon vanilla extract into brown sugar mixture. Add chocolate chips and flour; stir until cookie dough is well-combined. Drop cookie dough in 2 tablespoon portions evenly over the top of the cheesecake, pushing dough beneath the surface of the batter.\nBake in the preheated oven until cheesecake is almost completely set and jiggles slightly in center when shaken, about 40 minutes.\nStir 1 cup sour cream, 2 teaspoons white sugar, and 1 teaspoon vanilla together in a bowl until smooth. Spread sour cream mixture over hot cheesecake. Cool cake to room temperature and refrigerate until cold, at least 4 hours.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "5 h ",
    "i": "51988.jpg",
    "o": "3604566.jpg,3546368.jpg,2964836.jpg,2873125.jpg,2206548.jpg,965556.jpg",
    "st": "allrecipes"
}