{
    "id": 7636,
    "old_rating": "3.75",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 3/4 cups cake flour",
        "1 teaspoon baking soda",
        "1 teaspoon salt",
        "1 1/2 cups white sugar",
        "1/3 cup shortening",
        "1 cup buttermilk",
        "3 egg whites",
        "4 (1 ounce) squares unsweetened chocolate, melted",
        "1 teaspoon butter",
        "1/3 cup butter, softened",
        "1 1/2 tablespoons orange zest",
        "1 teaspoon lemon zest",
        "1/4 teaspoon salt",
        "1 egg yolk",
        "4 cups sifted confectioners' sugar",
        "1 tablespoon orange juice",
        "2 teaspoons lemon juice"
    ],
    "nut": [
        "Calories > 249 kcal",
        "Carbs > 43.6 g",
        "Cholesterol > 16 mg",
        "Fat > 8.4 g",
        "Protein > 2.4 g",
        "Sodium > 212 mg"
    ],
    "n": "Halloween Layer Cake",
    "a": "Carol",
    "r": "0",
    "s": 24,
    "des": "\"Halloween is celebrated by young and old and I am enclosing a good cake recipe for such a festive occasion.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Line the bottoms of two 8 or 9 inch round cake pans with parchment paper.\nSift together the flour, baking soda, salt, and white sugar.\nBeat shortening until light and fluffy.  Mix in dry ingredients.  Add 3/4 cup of buttermilk and mix until all flour is dampened.  Then beat with electric mixer.  Add egg whites, melted chocolate, and remaining buttermilk, beat well and pour batter into prepared pans.\nBake at 350 degrees F (175 degrees C) for 30 minutes. When cake is cool frost between layer and over top and sides with Golden Orange Frosting. Mark outlines of Halloween cats and bats by lightly pressing paper cut-outs into frosting, then removing paper. Melt 1 square unsweetened chocolate with 1 tsp. butter.  Using a brush, fill in the outlines with the chocolate mixture.\nTo Make Golden Orange Frosting: Cream together butter, orange rind, lemon rind, and salt.  Add egg yolk and mix well.  Add confectioners sugar, alternately with orange juice and lemon juice, beating well after each addition.  Makes 2 cups frosting, or enough to cover tops and sides of two 9 inch layers.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}