{
    "id": 7639,
    "old_rating": "4.57447",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 tablespoons butter",
        "1/2 cup graham cracker crumbs",
        "12 ounces cream cheese",
        "3/4 cup white sugar",
        "4 eggs",
        "2 tablespoons all-purpose flour",
        "1 1/2 teaspoons vanilla extract",
        "1/2 teaspoon salt",
        "2 cups heavy whipping cream"
    ],
    "nut": [
        "Calories > 410 kcal",
        "Carbs > 21.9 g",
        "Cholesterol > 182 mg",
        "Fat > 33.6 g",
        "Protein > 6.5 g",
        "Sodium > 301 mg"
    ],
    "n": "Philly Cheesecake",
    "a": "Maureen",
    "r": "0",
    "s": 10,
    "des": "\"Just plain-old, extra good cheesecake like the ones from New York and Philly. You may cover the cake with a layer of strawberries, cherries, etc. but, in my opinion, this cake is very, very good and easily stands on its own.  The fruit just distracts from its great flavor and texture.\"",
    "ins": "Grease an 8 inch springform pan thickly with butter.  Turn pan on its side, place a few graham cracker crumbs in pan and shake so crumbs stick to sides.  Keep turning and add crumbs as needed until sides are well coated.  Set pan upright and coat bottom of pan.  Put pan into freezer for 30 minutes or refrigerator for 2 hours.\nPreheat oven to 300 degrees F (150 degrees C).\nWith electric beater, mix cream cheese, sugar, egg yolks, flour, vanilla, and salt.  Beat thoroughly and then turn mixer to slowest speed and slowly pour in the cream.\nBeat the egg whites until stiff but not dry.  Add to the above mixture and fold the whites in by hand, lightly but thoroughly.  Pour mixture into the crumb-lined pan.\nSet pan into shallow pan containing 1 inch hot water and bake at 300 degrees F (150 degrees C) for 1 1/2 hours.  Refrigerate for at least 6 hours before serving.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "35865.jpg",
    "o": "",
    "st": "allrecipes"
}