{
    "id": 76930,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons very soft butter",
        "3/4 cup sugar, divided",
        "1 1/2 teaspoons finely grated orange zest",
        "1/4 cup juice from a large orange",
        "4 eggs, separated",
        "1/4 cup instant flour (Wondra)",
        "4 tablespoons fresh lemon juice, divided",
        "1 cup milk",
        "6 tablespoons orange marmalade",
        "2 tablespoons orange-flavored liqueur"
    ],
    "nut": [
        "Calories > 220 kcal",
        "Carbs > 36.9 g",
        "Cholesterol > 103 mg",
        "Fat > 6 g",
        "Protein > 4.7 g",
        "Sodium > 77 mg"
    ],
    "n": "Orange Pudding Cakes With Marmalade Drizzle",
    "a": "USA WEEKEND columnist Pam Anderson",
    "r": "0",
    "s": 8,
    "des": "\"For a light, elegant dessert, your guests will love Orange Pudding Cakes. Just measure the ingredients early in the day. As the roast rests, whip up the cakes; let them bake during dinner, and serve warm.\"",
    "ins": "Spray eight 6-ounce ovenproof custard cups (such as Pyrex) with vegetable cooking spray. Set them in two 9-inch round or square baking pans. Bring 1 1/2 quarts of water to boil in a tea kettle. Heat oven to 325 degrees.\nWhisk butter, 1/2 cup sugar and zest until smooth. Whisk in egg yolks, then flour, until smooth. Next whisk in 1/4 cup orange juice and 2 Tbs. lemon juice, then the milk, to form a thin batter.\nIn a separate bowl, beat egg whites with a hand mixer until foamy. Gradually add remaining 1/4 cup sugar, until the whites are stiff enough to hold a peak. Gently fold the whites into the batter until just smooth.\nPour batter into each custard cup. Place pans on oven rack, then carefully pour hot water into each pan, being sure to avoid getting any water on the cakes. Bake until tops are golden brown and spring back to the touch, about 25 to 35 minutes. Remove pans from oven; let custard cups stand in the water until just warm. Place a dessert plate over each custard cup; invert cake onto plate. Mix marmalade, liqueur and remaining 2 Tbs. lemon juice. Spoon sauce over cakes.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "4385376.jpg",
    "o": "",
    "st": "allrecipes"
}