{
    "id": 7693,
    "old_rating": "3.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Cake:",
        "2 1/4 cups all-purpose flour",
        "1 1/2 teaspoons baking soda",
        "1/3 cup instant coffee granules",
        "1 1/3 cups water",
        "1 2/3 cups white sugar",
        "3 eggs",
        "1 teaspoon vanilla extract",
        "1 cup mayonnaise",
        "3 (1 ounce) squares unsweetened chocolate, melted",
        "4 (1 ounce) squares unsweetened chocolate",
        "1/2 cup milk",
        "2 tablespoons instant coffee powder",
        "1 egg, beaten",
        "1 cup butter",
        "3 cups confectioners' sugar"
    ],
    "nut": [
        "Calories > 692 kcal",
        "Carbs > 82.3 g",
        "Cholesterol > 110 mg",
        "Fat > 40.6 g",
        "Protein > 7.5 g",
        "Sodium > 404 mg"
    ],
    "n": "Mocha Magic Torte",
    "a": "Carol",
    "r": "0",
    "s": 12,
    "des": "\"This is a rich cake and very delicious. You may be surprised by the thought of mayonnaise in the cake, but it is the ingredient that helps make it nice and moist.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch round pans, and line them with wax paper or parchment.\nSift flour with baking soda. Dissolve 1/3 cup instant coffee in the water.\nIn a large bowl, beat white sugar, 3 eggs, and vanilla until light and fluffy. Blend in mayonnaise and the melted chocolate. Add flour mixture alternately with the coffee to the batter, one-third at a time; mix with electric mixer on low speed after each addition. Pour batter into prepared pans.\nBake in preheated oven until cake tester inserted in center comes out clean, about 35 minutes. Cool cake in pans for 10 minutes. Remove, and cool completely on wire racks.\nMelt 4 squares chocolate with milk and 2 tablespoons instant coffee in a double boiler; blend until smooth. Pour hot chocolate mixture into the beaten egg, whisking constantly. Allow to cool.\nIn a mixing bowl, cream butter and confectioners' sugar until light and fluffy. Add chocolate mixture to butter mixture, and blend frosting well.\nWhen layers have cooled, cut each horizontally to make 4 layers. Fill and frost the cake with the frosting.",
    "pt": "30 m",
    "ct": "35 m",
    "tt": "2 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}