{
    "id": 76963,
    "old_rating": "4.61268",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons olive oil",
        "1 1/2 pounds sweet or hot Italian sausage, in the casing",
        "2 ounces thinly sliced prosciutto ham, minced",
        "2 medium onions, in medium dice",
        "2 medium carrots, peeled and in medium dice",
        "2 medium celery stalks, in medium dice",
        "1 teaspoon dried thyme leaves",
        "3 (15.8 ounce) cans great Northern or other white beans, undrained",
        "1 quart chicken broth (carton or can)"
    ],
    "nut": [
        "Calories > 561 kcal",
        "Carbs > 40.3 g",
        "Cholesterol > 71 mg",
        "Fat > 33 g",
        "Protein > 26.4 g",
        "Sodium > 786 mg"
    ],
    "n": "Sausage & White Bean Soup",
    "a": "USA WEEKEND columnist Pam Anderson",
    "r": "0",
    "s": 8,
    "des": "\"Instead of starting with a hambone (which you won't have unless you've just eaten a baked ham) and dried beans (which require significant soaking and simmering time), simply open cans of chicken broth and beans. Minced prosciutto instantly transforms commercial chicken broth into a ham-flavored soup base. Italian sausage reinforces the pork flavor and makes the soup substantial and satisfying. Mashing some of the canned beans thickens the soup and gives it the body of one that's been long simmered. Sauteed onions, carrots and celery add depth of flavor and ensure the soup's homemade feel.\"",
    "ins": "Heat oil in a large, deep saute pan or soup kettle over medium-high heat. When pan is hot, add sausages; cook, turning once or twice, until well-browned on all sides, about 5 minutes. (Sausage will not be fully cooked at this point.) Remove from pan. When cool enough to handle, cut into slices 1/4-inch thick.\nAdd prosciutto, onions, carrots, celery and thyme to the empty skillet; cook, stirring often, until well browned, 8 to 10 minutes. In a small bowl, mash one can of beans with a fork into a chunky puree. Add broth, whole and mashed beans, and sausage; cover and bring to a simmer. Reduce heat to medium-low; simmer, partially covered, to blend flavors, 20 minutes. Let rest 10 minutes; serve.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "711080.jpg",
    "o": "4461400.jpg,2509518.jpg,1514595.jpg,1482443.jpg,925402.jpg,786761.jpg",
    "st": "allrecipes"
}