{
    "id": 7697,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1 cup butter, room temperature",
        "1 2/3 cups white sugar",
        "5 eggs, room temperature",
        "1 teaspoon almond extract",
        "3 tablespoons ground almonds",
        "1 teaspoon rosewater",
        "2 drops red food coloring",
        "1 tablespoon confectioners' sugar, for dusting"
    ],
    "nut": [
        "Calories > 359 kcal",
        "Carbs > 45 g",
        "Cholesterol > 118 mg",
        "Fat > 18 g",
        "Protein > 5.6 g",
        "Sodium > 236 mg"
    ],
    "n": "Rose Petal Pound Cake",
    "a": "Carol",
    "r": "0",
    "s": 12,
    "des": "\"This cake is very different to the usual recipes and calls for rosewater which you can obtain in Middle Eastern grocery stores. You could also substitute orange water for the rosewater. Rosewater and orange water are used in Middle Eastern pastries. Both are very sweet and they are clear liquids found in bottles.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease one 9-inch tube pan.\nSift together flour and salt; set aside.\nBeat butter in a mixing bowl until light and fluffy; it should be noticeably lighter in color. In a separate bowl, beat sugar and eggs together until doubled in volume. Mixture should be thick and lemon-colored.\nAdd sifted flour and salt gradually to the egg mixture, mixing until fully combined. Fold in creamed butter and mix thoroughly.\nDivide batter into two equal parts. Into one part, add the almond extract and the ground almonds. To the other part, add the rosewater and the red food coloring. Spoon batters alternately into the prepared pan.\nBake in preheated oven until a cake tester comes out clean, 50 to 60 minutes. Let cake cool for 15 minutes; then remove from pan to cool completely. Dust with confectioner's sugar before serving.",
    "pt": "30 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "943319.jpg",
    "o": "",
    "st": "allrecipes"
}