{
    "id": 76989,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 pounds spicy or mild Italian pork sausage",
        "1/4 cup olive oil",
        "3 tablespoons ground cumin",
        "1 tablespoon curry powder",
        "1 1/2 teaspoons garlic powder",
        "3/4 teaspoon ground ginger",
        "3/4 teaspoon salt",
        "1/2 teaspoon cayenne pepper",
        "8 lamb loin chops",
        "1/2 cup plain yogurt",
        "3 tablespoons red wine vinegar",
        "12 chicken drumsticks, skin removed"
    ],
    "nut": [
        "Calories > 743 kcal",
        "Carbs > 4.7 g",
        "Cholesterol > 214 mg",
        "Fat > 52.5 g",
        "Protein > 59.8 g",
        "Sodium > 1093 mg"
    ],
    "n": "Mixed Grill of Sausage, Chicken and Lamb With Tandoori Flavorings",
    "a": "USA WEEKEND columnist Pam Anderson",
    "r": "0",
    "s": 8,
    "des": "\"The Indian-flavored main course uses one basic spice rub. Half is rubbed on the lamb chops, and the other half is mixed with yogurt to marinate the chicken. If you want the chicken, lamb and sausage to come off the grill at the same time, stagger them, starting with the chicken, then the lamb and finally the pre-steamed sausages, which simply need to be browned. Grill in batches for a larger crowd, cooking all the drumsticks, then all the sausages and finally the chops. The drumsticks are fine at room temperature, but the sausage and chops should be at least warm.\"",
    "ins": "Place sausage and 1/2 cup water in a large (12-inch) skillet. Cover and bring to a simmer. Steam until sausage loses its raw color throughout, about 8 minutes. Drain and set aside.\nIn a medium bowl, mix oil, cumin, curry powder, garlic powder, ginger, salt and cayenne. Scrape half the spice mixture into another medium bowl. Add lamb chops to one bowl; toss to coat well. Stir yogurt and vinegar into other bowl; add chicken legs and toss to coat well. Set both aside to marinate.\nAbout 30 minutes before serving, fully preheat gas grill (10 to 15 minutes with all burners on high). Use a wire brush to clean grill rack, then use tongs to wipe an oil-soaked rag over rack. Close lid and return grill to temperature. Make sure to have water close by to extinguish any flare-ups.\nStaggering meat additions so they all get done about the same time, place chicken on grill; close lid and grill-roast for a total of 20 minutes - 8 minutes on the first side, 8 minutes on the second side and 4 minutes longer, turning as needed toward the end to ensure doneness. Add lamb; grill-roast for a total of 8 minutes - 4 minutes on the first side and 4 minutes on the second side. Add sausage and grill-roast for a total of 4 minutes - 2 minutes on the first side and 2 minutes on the second side.\nArrange on a large platter and serve warm with couscous.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "3834773.jpg",
    "o": "",
    "st": "allrecipes"
}