{
    "id": 76981,
    "old_rating": "4.45882",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups shredded rotisserie chicken",
        "1 (15.5 ounce) can small red or pinto beans, drained",
        "2 cups grated pepper Jack cheese",
        "1 medium-large onion",
        "2 tablespoons olive oil",
        "1 (15 ounce) can tomato sauce",
        "1 (14.5 ounce) can chicken broth",
        "3 tablespoons sour cream",
        "12 corn tortillas (about 5 1/2 inches in diameter)",
        "Optional garnish:",
        "chopped fresh cilantro",
        "hot red pepper sauce"
    ],
    "nut": [
        "Calories > 512 kcal",
        "Carbs > 41.8 g",
        "Cholesterol > 93 mg",
        "Fat > 24.2 g",
        "Protein > 32.9 g",
        "Sodium > 937 mg"
    ],
    "n": "Chicken and Red Bean Enchiladas",
    "a": "USA WEEKEND columnist Pam Anderson",
    "r": "0",
    "s": 6,
    "des": "\"With rotisserie, whole roasted chickens so readily available from carryout shops to grocery stores, otherwise labor intensive dishes can now be prepared on the fly for any weeknight supper. Use what's needed for your recipe, and get creative with the endless possible uses for the leftovers.\"",
    "ins": "Adjust oven rack to middle position; heat oven to 375 degrees. In a medium bowl, mix chicken, beans and 1 cup cheese; set aside. Thinly slice 1/2 cup onion; set aside. Finely chop remaining onion.\nHeat oil in a 12-inch skillet over medium-high heat. Add chopped onions and saute until golden, about 5 minutes. Add tomato sauce; simmer until very thick, about 12 minutes. (Stir frequently; reduce heat if sputtering dramatically.) Add broth; bring to simmer. Remove from heat; whisk in sour cream. Stir 1/2 cup sauce into chicken mixture.\nSpread 1/2 cup sauce in a 13-by-9-inch ovenproof glass dish. Microwave tortillas on high power in a microwave-safe plastic bag until warm, about 1 minute. Fill each tortilla with a heaping 1/4 cup chicken mixture; roll and place in baking dish. Top with remaining sauce and cheese.\nBake until bubbly, about 20 minutes. Top with sliced onions and the optional cilantro. Serve hot. Pass pepper sauce separately.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "619043.jpg",
    "o": "4467056.jpg,719121.jpg,392232.jpg,360937.jpg,178542.jpg,178540.jpg",
    "st": "allrecipes"
}