{
    "id": 76998,
    "old_rating": "4.13333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons vegetable or olive oil",
        "1 large onion, cut into 1/2-inch dice",
        "1 pound Mild or hot Italian sausage, removed from its casing, crumbled",
        "1 pound starchy potatoes (such as Idaho), cut into 1/2-inch dice ",
        "1/2 pound firm apples (e.g., Granny Smith), cut into 1/2-inch dice",
        "2 tablespoons vegetable or olive oil",
        "2 tablespoons ketchup",
        "1 tablespoon Dijon mustard",
        "1/2 teaspoon rubbed sage or thyme leaves",
        "2 tablespoons chopped fresh parsley",
        "Salt and freshly ground black pepper"
    ],
    "nut": [
        "Calories > 653 kcal",
        "Carbs > 34 g",
        "Cholesterol > 86 mg",
        "Fat > 49.4 g",
        "Protein > 19.2 g",
        "Sodium > 1598 mg"
    ],
    "n": "Sausage Hash With Apples & Sage",
    "a": "USA WEEKEND columnist Pam Anderson",
    "r": "0",
    "s": 4,
    "des": "\"One of my favorite things to order when I go out to breakfast is hash - corned beef, roast beef or any other variation - which got me to thinking about trying to make it at home. After all, the ingredients are simple: As long as you've got some kind of protein, potatoes and onions, you're in business. And it makes a fast brunch or even light supper dish, with or without poached eggs.\"",
    "ins": "Heat 2 Tbs. oil over low heat in a 12-inch non-stick skillet (so potatoes don't stick). While skillet heats, prepare onion and Italian sausage as directed above. A few minutes before cooking, increase heat to medium-high. When oil starts to send up wisps of smoke, add onion and sausage; cook, stirring often, until golden brown. Meanwhile, dice potatoes and apples and toss with remaining oil. Transfer sausage mixture to a bowl and reserve.\nAdd potato mixture to empty skillet; cook, stirring only occasionally so they form a golden-brown crust, about 10 minutes. As potatoes cook, mix ketchup, mustard, dried sage and fresh parsley and 2 Tbs. of water. (Recipe can be prepared to this point up to 2 hours ahead. Spread hot potatoes on a large lipped cookie sheet; cover when cool. Return skillet to medium-high; add potatoes and re-crisp.)\nReturn reserved sausage mixture to skillet; stir in ketchup mixture, then season with salt and pepper. Cook, stirring frequently, until hash has nicely browned, about 5 minutes longer.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "946191.jpg",
    "o": "",
    "st": "allrecipes"
}