{
    "id": 7713,
    "old_rating": "4.35458",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (9 ounce) package brownie mix",
        "1 egg",
        "1 tablespoon cold water",
        "1 (14 ounce) package individually wrapped caramels, unwrapped",
        "1 (5 ounce) can evaporated milk",
        "2 (8 ounce) packages cream cheese, softened",
        "1/2 cup white sugar",
        "1 teaspoon vanilla extract",
        "2 eggs",
        "1 cup chocolate fudge topping"
    ],
    "nut": [
        "Calories > 512 kcal",
        "Carbs > 68.9 g",
        "Cholesterol > 93 mg",
        "Fat > 24.1 g",
        "Protein > 8.2 g",
        "Sodium > 355 mg"
    ],
    "n": "Brownie Caramel Cheesecake",
    "a": "JACKIE MEIBORG",
    "r": "0",
    "s": 12,
    "des": "\"This is a great recipe that gets compliments when ever I make it. It is very rich, and worth the time and calories.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).  Grease the bottom of a 9 inch springform pan.\nIn a small bowl, mix together brownie mix, 1 egg and water.  Spread into the greased pan. Bake for 25 minutes.\nMelt the caramels with the evaporated milk over low heat in a heavy saucepan.  Stir often, and heat until mixture has a smooth consistency. Reserve 1/3 cup of this caramel mixture, and pour the remainder over the warm, baked brownie crust.\nIn a large bowl, beat the cream cheese, sugar and vanilla with an electric mixer until smooth.  Add eggs one at a time, beating well after each addition. Pour cream cheese mixture over caramel mixture.\nBake cheesecake for 40 minutes.  Chill in pan.  When cake is thoroughly chilled, loosen by running a knife around the edge, and then remove the rim of the pan.  Heat reserved caramel mixture, and spoon over cheesecake.  Drizzle with the chocolate topping.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "4 h ",
    "i": "446230.jpg",
    "o": "4486057.jpg,4479405.jpg,4219070.jpg,2655222.jpg,2610448.jpg,2559843.jpg",
    "st": "allrecipes"
}