{
    "id": 77132,
    "old_rating": "4.5122",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (8 ounce) package uncooked elbow macaroni",
        "1 pound ground beef",
        "1 cup diced onion",
        "1 cup sliced celery",
        "1 tablespoon minced garlic",
        "1 (14.5 ounce) can diced tomatoes",
        "1 (10 ounce) can tomato sauce",
        "1 tablespoon sugar",
        "1 tablespoon paprika",
        "1 teaspoon dried oregano",
        "1/4 teaspoon caraway seed",
        "1 pinch cayenne pepper, or to taste",
        "1 teaspoon salt"
    ],
    "nut": [
        "Calories > 327 kcal",
        "Carbs > 39.2 g",
        "Cholesterol > 46 mg",
        "Fat > 9.8 g",
        "Protein > 19.4 g",
        "Sodium > 803 mg"
    ],
    "n": "Mom's Goulash in the Microwave",
    "a": "Terry McIntire",
    "r": "0",
    "s": 6,
    "des": "\"There were no microwaves when my mom made this, so she did it on the stove top. She never gave us the recipe and I have discovered it through trial and error. You never forget the taste! I started with a recipe in a microwave cookbook and have adjusted the ingredients over time. If anyone is home when you are cooking, you will have company in the kitchen! Serve with Caesar salad, oven-baked garlic butter French bread and red wine. Microwave temperatures vary, so keep checking to see if these power levels work for you.\"",
    "ins": "Bring a pot of lightly salted water to a boil. Add the macaroni, and cook until tender, about 8 minutes. Drain.\nMeanwhile, crumble the ground beef into a 2 quart or larger casserole dish. Add the onion, celery and garlic. Cook in the microwave on High for 5 to 6 minutes, or until beef is no longer pink. Stir once during cooking. Drain off the grease.\nStir the tomatoes, tomato sauce and sugar into the beef, and season with paprika, oregano, caraway seed, cayenne pepper and salt. Cover, and cook in the microwave on power level 8 for about 14 minutes, or until celery is tender and the flavors have blended.\nRemove from the microwave, and mix in the cooked macaroni. Cook for 2 to 3 more minutes, until heated through. Serve.",
    "pt": "10 m",
    "ct": "25 m",
    "tt": "35 m",
    "i": "39184.jpg",
    "o": "",
    "st": "allrecipes"
}