{
    "id": 77284,
    "old_rating": "4.50427",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups crushed corn flakes",
        "1 tablespoon chili powder",
        "1 (1.27 ounce) packet dry fajita seasoning",
        "1/4 cup chopped red bell pepper",
        "1/4 cup chopped yellow bell pepper",
        "1/4 cup chopped orange bell pepper",
        "1/3 cup chopped fresh mushrooms",
        "1/2 medium red onion, diced",
        "4 skinless, boneless chicken breast halves - pounded thin",
        "1 cup shredded Cheddar cheese, divided",
        "1/4 cup salsa",
        "toothpicks"
    ],
    "nut": [
        "Calories > 368 kcal",
        "Carbs > 24.6 g",
        "Cholesterol > 103 mg",
        "Fat > 14.8 g",
        "Protein > 35.2 g",
        "Sodium > 1105 mg"
    ],
    "n": "Bob's Mexican Stuffed Chicken",
    "a": "Kathy",
    "r": "0",
    "s": 4,
    "des": "\"My boyfriend made me the best stuffed chicken last evening. It was so good that I crowned him a better cook than me. Serve with a small side of salsa and sour cream on the side.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a baking dish.\nIn a shallow bowl, mix the corn flakes, chili powder, and fajita seasoning. In a separate bowl, mix the red bell pepper, yellow bell pepper, orange bell pepper, mushrooms, and onion.\nDredge the chicken in the corn flakes mixture to evenly coat. Sprinkle one side of each breast with 2 tablespoons Cheddar cheese, and layer with 1/4 the vegetable mixture. Top with equal amounts salsa. Carefully roll the breast halves over the filling. Seal seams with toothpicks, then dredge again in the corn flakes mixture.\nArrange the rolled chicken breasts in the prepared baking dish. Bake 30 minutes in the preheated oven. Top with remaining cheese, and continue baking 10 minutes, or until chicken juices run clear and cheese is melted.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "620804.jpg",
    "o": "4283341.jpg,3628279.jpg,3536449.jpg,801612.jpg,774675.jpg,700781.jpg",
    "st": "allrecipes"
}