{
    "id": 77485,
    "old_rating": "3.77778",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "salt and pepper to taste",
        "1 1/2 teaspoons ground cumin",
        "2 teaspoons poultry seasoning",
        "2 teaspoons minced garlic",
        "2 teaspoons dried thyme",
        "2 tablespoons butter",
        "1 small onion, sliced into thin rings",
        "2 cups sliced fresh mushrooms",
        "3 large potatoes, thinly sliced",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "20 saltine crackers, crushed",
        "1 pinch paprika, for garnish"
    ],
    "nut": [
        "Calories > 500 kcal",
        "Carbs > 55.6 g",
        "Cholesterol > 72 mg",
        "Fat > 20.7 g",
        "Protein > 23.9 g",
        "Sodium > 631 mg"
    ],
    "n": "Empty Wallet Casserole",
    "a": "JESLYNN",
    "r": "0",
    "s": 5,
    "des": "\"I came up with this the day before payday, trying to come up with something using only the ingredients I had on hand.  Turns out, it's now a favorite anyone who tries it.  You can also adjust the ingredients according to what you have in the cabinet and your family's personal tastes.  Enjoy!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nCrumble the ground beef into a large skillet over medium heat. Season with salt, pepper, cumin, garlic, poultry seasoning, and thyme. Cook, stirring to crumble, until evenly browned. Drain, and transfer to a 9x13 inch baking dish, or large casserole dish.\nArrange 2 layers of sliced potato over the ground beef, seasoning each layer with salt and pepper. Melt butter in the skillet over medium heat, and saute the onions and mushrooms until tender. Spread over the top of the potatoes.\nStir just enough water into the soup to make it pourable, and spoon over the top of the casserole, making sure to spread out evenly. Scatter the cracker crumbs over the top, and sprinkle with paprika. Cover the dish with aluminum foil.\nBake for about 1 hour in the preheated oven, until the potatoes are soft. Remove the aluminum foil, and return to the oven to brown the top, about 10 minutes.",
    "pt": "20 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "154873.jpg",
    "o": "",
    "st": "allrecipes"
}