{
    "id": 77656,
    "old_rating": "3.94118",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup all-purpose flour",
        "salt and pepper to taste",
        "4 skinless, boneless chicken breast halves - cut into 1 inch cubes",
        "3 tablespoons olive oil",
        "1 pound hot Italian sausage",
        "2 medium baking potatoes, peeled and cubed",
        "1/2 large red onion, diced",
        "1 green bell pepper, seeded and diced",
        "3 cloves garlic, chopped",
        "1 (12 ounce) jar sliced jalapeno peppers",
        "1 1/2 cups dry white wine",
        "2 tablespoons cornstarch",
        "1 (12 ounce) package rotini pasta",
        "1/4 cup freshly grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 1200 kcal",
        "Carbs > 104.5 g",
        "Cholesterol > 160 mg",
        "Fat > 50.6 g",
        "Protein > 61.3 g",
        "Sodium > 1138 mg"
    ],
    "n": "Chicken Murphy II",
    "a": "KEEPERROX",
    "r": "0",
    "s": 4,
    "des": "\"So this is my favorite Italian dish.  I would take this any time over anything with red sauce.  I could get this whenever I wanted when I lived in NJ, but now that I'm in PA, it's not so easy.  So this is what I came up with as a replacement.  I'm not sure how authentic it is, but it's good!\"",
    "ins": "Mix together the flour, salt and pepper in a medium bowl. Dredge the cubed chicken breast in the flour to coat. Heat olive oil in a large skillet over medium-high heat. Fry the chicken cubes until browned on the outside. Remove chicken, and set aside.\nIn a separate pan, or indoor grill, fry the Italian sausage links until cooked through. Cut into 1/4 inch slices.\nPlace potatoes into a saucepan with enough water to cover. Bring to a boil, and cook until fork tender, but not mushy, about 15 minutes. Drain and set aside.\nHeat the skillet from cooking the chicken over medium heat. Add more oil if necessary. Saute onion and bell pepper until soft. Stir in garlic, and cook for about 1 minute. Pour in the whole jar of jalapenos, and the wine. Scrape any bits of food from the bottom of the pan, and bring to a simmer. Return the chicken to the pan, and add the sliced sausage and potatoes. Simmer for 5 minutes.\nBring a large pot of lightly salted water to a boil. Add pasta, and cook for 8 to 10 minutes, or until tender. Drain.\nMix cornstarch with a small amount of water, and stir into the skillet with the sauce. Cook over medium heat, stirring occasionally, until thick enough to coat the pasta. Serve sauce over pasta with freshly grated Parmesan cheese.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "2698981.jpg",
    "o": "",
    "st": "allrecipes"
}