{
    "id": 77752,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound small potatoes, scrubbed",
        "1/2 (3 ounce) fillet skinless, boneless halibut fillets",
        "1/2 pound skinless, boneless salmon fillets",
        "2 cups milk",
        "2 eggs, divided",
        "2 tablespoons butter",
        "1 pinch ground nutmeg",
        "1 dash Worcestershire sauce",
        "salt and pepper to taste",
        "1 cup dried bread crumbs, seasoned",
        "1 cup oil for frying"
    ],
    "nut": [
        "Calories > 515 kcal",
        "Carbs > 46.4 g",
        "Cholesterol > 155 mg",
        "Fat > 24.4 g",
        "Protein > 27.3 g",
        "Sodium > 701 mg"
    ],
    "n": "Manuela's Fish Cakes",
    "a": "REBOLLODAVIES",
    "r": "0",
    "s": 4,
    "des": "\"Salmon and halibut fish cakes, messy to make but worth it.\"",
    "ins": "Place the potatoes into a saucepan with enough water to cover. Bring to a boil, and cook until tender, about 15 minutes.\nMeanwhile, place the halibut and salmon into a skillet or large saucepan, and pour in the milk. Bring to a simmer, cover, and cook until fish flakes easily with a fork, about 5 minutes depending on the thickness of your fillets. Drain off milk, and set fish aside.\nWhen potatoes are done, drain, and place in a large bowl. Mash potatoes with one of the eggs and the butter until fairly smooth. Season with nutmeg, Worcestershire sauce, salt and pepper. Mix in the fish, taking care not to break into too small of pieces.\nBeat the remaining egg, and place on a plate. Place bread crumbs on a separate plate. Lightly flour your hands, and form the fish mixture into patties. Dip each patty into the egg, then coat with breadcrumbs. Place the fish cakes on a plate, and refrigerate for 30 minutes.\nHeat 1/4 inch of oil in a large heavy skillet over medium to medium-high heat. Fry the fish cakes for about 3 minutes per side, or until golden brown. Drain on paper towels, and serve fresh and hot.",
    "pt": "25 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "636068.jpg",
    "o": "",
    "st": "allrecipes"
}