{
    "id": 77942,
    "old_rating": "4.57868",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup vegetable oil",
        "10 cloves garlic, finely chopped",
        "1 (12 ounce) package uncooked linguine pasta",
        "salt to taste",
        "1/2 cup chopped broccoli",
        "1/2 cup chopped cabbage",
        "1/2 cup shredded carrots",
        "1/2 cup chopped cauliflower",
        "2 tablespoons diced green onions",
        "1 pound chicken tenders, cut into bite-size pieces",
        "3 1/2 tablespoons soy sauce",
        "salt and pepper to taste",
        "1 cup chopped cilantro",
        "4 lime wedges"
    ],
    "nut": [
        "Calories > 480 kcal",
        "Carbs > 45.5 g",
        "Cholesterol > 46 mg",
        "Fat > 21.6 g",
        "Protein > 25.3 g",
        "Sodium > 586 mg"
    ],
    "n": "Linguine with Chicken and Sauteed Vegetables",
    "a": "JOSIE",
    "r": "0",
    "s": 6,
    "des": "\"I've been making this recipe for a long time and I usually don't make it the same way twice.  I like to use cabbage, shredded carrots, broccoli, cauliflower and green onions, but use any combination of vegetables you like. Add as much garlic oil as you need to prevent the noodles from sticking together.\"",
    "ins": "Heat oil in a skillet over medium heat. Mix in garlic. Cook and stir until golden. Remove from heat and allow to cool.\nBring a large pot of lightly salted water to a boil. Place linguine in pot and cook 8 to 10 minutes, until al dente. Drain and transfer to a large bowl. Set aside 1 tablespoon garlic oil and toss remainder with pasta to coat. Season pasta with salt.\nBring a pot of water to a boil. Immerse broccoli, cabbage, carrots, cauliflower and green onions in water for about 30 seconds. Drain and set aside.\nHeat reserved garlic oil in skillet over medium heat. Mix in chicken and 2 tablespoons soy sauce. Cook until chicken juices run clear. Mix in vegetables and remaining soy sauce. Season with salt and pepper. Toss with linguine, and garnish with cilantro and lime to serve.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "40 m",
    "i": "1083708.jpg",
    "o": "4479564.jpg,4135047.jpg,3920510.jpg,2337806.jpg,1298946.jpg,1298935.jpg",
    "st": "allrecipes"
}