{
    "id": 78138,
    "old_rating": "4.77778",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 (15 ounce) packages refrigerated pie crusts",
        "2 cups chopped rhubarb",
        "1/2 cup white sugar",
        "1/4 cup cornstarch",
        "2 tablespoons lemon juice",
        "1 cup white sugar",
        "4 cups fresh serviceberries"
    ],
    "nut": [
        "Calories > 468 kcal",
        "Carbs > 65.2 g",
        "Cholesterol > 0 mg",
        "Fat > 21.8 g",
        "Protein > 4.5 g",
        "Sodium > 339 mg"
    ],
    "n": "Saskatoon (Serviceberry) Rhubarb Pie",
    "a": "STACYSUBSCR",
    "r": "0",
    "s": 12,
    "des": "\"This is an amazingly delicious pie that gets its rich red color and juiciness from the rhubarb and delicious Saskatoon berry flavor and depth from the saskatoon berries.  This pie has a flavor that is just to die for. Not bland at all. You will NOT go wrong with this pie.  Everyone begs for more when I bring this pie out.  Enjoy!!\"",
    "ins": "Preheat the oven to 400 degrees F (200 degrees C). Press two of the pie crusts into the bottom and up the sides of two 8 inch pie plates.\nIn a microwave-safe dish, combine the rhubarb and 1/2 cup of sugar. Heat at full power in the microwave until rhubarb is soft and juice is pooling in the bottom of the dish, 4 to 5 minutes. Drain off the juice into a measuring cup and add enough water to make 2 cups. Dissolve the cornstarch in the liquid.\nIn a saucepan, stir together the 2 cups of liquid, lemon juice and remaining 1 cup of sugar. Add the saskatoon berries and rhubarb; cook over medium-high heat until thick and bubbling, about 5 minutes. Pour into the two pie crusts. Top with the remaining crusts and cut holes in the top to vent steam. Pinch the edges together to seal.\nBake for 15 minutes in the preheated oven, then reduce the temperature to 350 degrees F (175 degrees C). Bake until crust is golden brown and filling is bubbling, about 30 more minutes.",
    "pt": "20 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "453282.jpg",
    "o": "",
    "st": "allrecipes"
}