{
    "id": 7831,
    "old_rating": "4.15385",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 teaspoon active dry yeast",
        "1 fluid ounce warm water",
        "1 tablespoon white sugar",
        "1 tablespoon distilled white vinegar",
        "1/2 teaspoon salt",
        "3 cups all-purpose flour",
        "3 cups milk",
        "1 cup sourdough starter",
        "2/3 cup vegetable oil",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon baking soda",
        "3 eggs",
        "1 cup white sugar",
        "2 cups all-purpose flour",
        "1/4 teaspoon salt",
        "2 teaspoons vanilla extract",
        "1 cup chopped walnuts"
    ],
    "nut": [
        "Calories > 256 kcal",
        "Carbs > 33.9 g",
        "Cholesterol > 26 mg",
        "Fat > 10.8 g",
        "Protein > 6 g",
        "Sodium > 141 mg"
    ],
    "n": "Amish Friendship Cake",
    "a": "Sally",
    "r": "0",
    "s": 24,
    "des": "\"Always save 1 cup of starter for your next cakes, then start with day 2 of the starter instructions instead of having to start a new starter each time.  You can also give some starter to friends, or sourdough starter can be used in place of the Friendship Starter.\"",
    "ins": "To Make Starter: Dissolve yeast in warm water.  Add 1 tablespoon white sugar, 1 tablespoon vinegar, 1/2 teaspoon salt, 1 cup of the flour, and 1 cup of the milk in a non-metal bowl and stir with a non-metal spoon until creamy.  Cover bowl with plastic wrap and let stand in a warm place for two days to ferment.  It will become bubbly and have a sour odor.  Do not place in refrigerator.  On second day, third day, and fourth day: stir.  On fifth day, add 1 cup flour, 1 cup sugar, 1 cup milk, and stir.  On sixth, seventh, eighth, and ninth day: stir.  On tenth day add 1 cup flour, 1 cup sugar, and 1 cup milk.  Reserve 1 cup starter; pour remaining starter, 1 cup each, into 3 containers to give away to friends if desired. Starter is enough for 8 loaves.\nTo Make Cakes: Preheat oven to 350 degrees F (175 degrees C). Grease two 8 or 9 inch loaf pans.\nMix 1 cup of the starter, oil, baking powder, eggs, 1 cup of the sugar, 2 cups of the flour, 1/4 teaspoon of the salt, vanilla, and chopped nuts. Stir in the baking soda just before pouring the batter into the prepared pans.\nBake at 350 degrees F (175 degrees C) for 45 minutes to 1 hour. Bananas, dates, or raisins can be added for variety.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "425907.jpg",
    "o": "",
    "st": "allrecipes"
}