{
    "id": 7864,
    "old_rating": "4.51042",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 3/4 cups cake flour",
        "1 tablespoon baking powder",
        "1 teaspoon salt",
        "1/2 cup white sugar",
        "1/2 cup vegetable oil",
        "6 egg yolks",
        "3/4 cup water",
        "1 tablespoon lemon zest",
        "6 egg whites",
        "1/2 teaspoon cream of tartar",
        "3/4 cup white sugar",
        "1 cup heavy whipping cream",
        "2 1/2 cups lemon pie filling",
        "8 slices lemon"
    ],
    "nut": [
        "Calories > 459 kcal",
        "Carbs > 66.9 g",
        "Cholesterol > 173 mg",
        "Fat > 19.4 g",
        "Protein > 6.9 g",
        "Sodium > 344 mg"
    ],
    "n": "Lemon Chiffon Cake",
    "a": "Carol",
    "r": "0",
    "s": 14,
    "des": "\"This cake recipe makes lemony, light, and luscious lemon-flavored chiffon cake with a creamy filling made with lemon pie filling.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine flour, baking powder, salt, and 1/2 cup sugar. Add oil, egg yolks, water and lemon rind. Beat with an electric mixer until smooth.\nIn a small bowl, beat egg whites and cream of tartar until peaks form. Gradually add 3/4 cup sugar, and beat until very stiff and shiny peaks form. Fold 1/3 of the whites into the batter, then quickly fold in remaining whites until no streaks remain. Turn batter into ungreased 10-inch tube pan.\nBake at 350 degrees F (175 degrees C) for 60 minutes or until a toothpick inserted in the center comes out clean. Invert cake and cool completely in pan. When cool, loosen edges and shake pan to remove cake.\nTo Make Filling: Beat cream to stiff peaks. Fold in lemon filling. Chill until stiff.\nTo Assemble Cake: Slice cake horizontally into 3 equal layers. Fill layers with 1/3 cup of filling. Spread remaining filling on top layer. Decorate with lemon slices.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "3 h",
    "i": "3607903.jpg",
    "o": "3873084.jpg,3443575.jpg,3427077.jpg,2989850.jpg,782758.jpg,771501.jpg",
    "st": "allrecipes"
}