{
    "id": 78753,
    "old_rating": "4.11628",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup pomegranate juice",
        "1/4 cup fresh orange juice",
        "1 1/2 tablespoons Dijon mustard",
        "1 tablespoon honey",
        "1 teaspoon minced garlic",
        "1 teaspoon orange zest",
        "1 dash cayenne pepper",
        "1 (1 1/2 pound) pork tenderloin",
        "4 tablespoons pomegranate seeds"
    ],
    "nut": [
        "Calories > 216 kcal",
        "Carbs > 17.4 g",
        "Cholesterol > 74 mg",
        "Fat > 4.1 g",
        "Protein > 26.6 g",
        "Sodium > 199 mg"
    ],
    "n": "Mustard Pomegranate Pork Tenderloin",
    "a": "LINDA W.",
    "r": "0",
    "s": 4,
    "des": "\"A new use for pomegranate juice!  Try using fresh pomegranates, de-seeding them, and whirling the arils in a small food processor, and then straining to remove the pith.  Fresh pomegranate juice is sweeter than the store-bought in a bottle.\"",
    "ins": "In a clean jar with a tight-fitting lid, combine pomegranate juice, orange juice, mustard, honey, garlic, orange zest, and cayenne pepper.  Tighten lid, and shake until everything is mixed well.  Pour over pork tenderloin in a large resealable plastic bag. Seal bag, and refrigerate for at least one hour and up to 3 hours.\nPreheat oven to 350 degrees F (175 degrees C). Coat a large roasting pan with cooking spray. Remove tenderloin from marinade, reserving the marinade. Place meat in roasting pan, and arrange pan on center rack in oven.\nPour marinade into a small saucepan. Bring to a boil, reduce heat to simmer, and reduce volume by half.  Remove from heat. Place 1/2 of liquid in a cup for basting, and reserve to use as a sauce.\nRoast tenderloin in oven for 30 to 40 minutes, basting lightly with reduced marinade until internal temperature is 145 degrees F (63 degrees C) when measured in the thickest part of the tenderloin.  Remove tenderloin from oven, cover with foil, and let rest for 5 to 10 minutes before slicing. Serve each portion with reserved sauce drizzled over top, and a sprinkle of pomegranate seeds.",
    "pt": "15 m",
    "ct": "40 m",
    "tt": "55 m",
    "i": "63216.jpg",
    "o": "",
    "st": "allrecipes"
}