{
    "id": 7916,
    "old_rating": "4.71204",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (18.25 ounce) package yellow cake mix",
        "1 (3.5 ounce) package instant vanilla pudding mix",
        "4 eggs",
        "1/2 cup water",
        "1/2 cup vegetable oil",
        "1/2 cup rum",
        "1/2 cup chopped pecans",
        "3 tablespoons butter",
        "1/4 cup water",
        "1 cup white sugar",
        "1/2 cup rum"
    ],
    "nut": [
        "Calories > 416 kcal",
        "Carbs > 50.3 g",
        "Cholesterol > 60 mg",
        "Fat > 18.9 g",
        "Protein > 3.8 g",
        "Sodium > 381 mg"
    ],
    "n": "Mom's Rum Cake",
    "a": "Laura",
    "r": "0",
    "s": 14,
    "des": "\"I got this from my mom.  When she makes it, we all fight over it.  It's delicious and easy to make.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour one 10 inch tube pan.\nCombine cake mix and pudding mix.\nIn another bowl beat eggs, water, oil and rum until frothy.  Add cake mix/pudding mixture  and beat until well mixed. Spread pecans evenly over the bottom of the prepared pan and pour batter over pecans.\nBake cake at 325 degrees F (165 degrees C) for 60 minutes or until a toothpick comes out dry when inserted in the center. Allow to cool in pan for 5 minutes and remove from pan.  Place in serving dish immediately, right side up. (Pecans should be on the bottom)\nTo Make Glaze: During the last 15 to 20 minutes of baking time, combine butter or margarine, water and sugar in a sauce pan and bring to boil over high heat.  Reduce heat to medium and boil rapidly until it's very thick and syrupy stirring very frequently. The syrup must be reduced quite a bit and very thick otherwise it will make the cake mushy.  Remove from heat and add rum. While cake is still hot, poke holes all over top of cake with a toothpick and spoon glaze over top of cake.  Allow cake to sit at room temperature for one day then refrigerate.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "281049.jpg",
    "o": "4087101.jpg,3386652.jpg,2848713.jpg,467434.jpg,395598.jpg,344697.jpg",
    "st": "allrecipes"
}