{
    "id": 79253,
    "old_rating": "4.28571",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 3/4 cups all-purpose flour",
        "1 tablespoon ground ginger",
        "2 teaspoons ground cinnamon",
        "1 teaspoon ground cloves",
        "1 teaspoon ground nutmeg",
        "3/4 teaspoon salt",
        "3/4 teaspoon baking soda",
        "3/4 cup molasses",
        "1/4 cup water",
        "12 tablespoons softened butter",
        "1 cup light or dark brown sugar, firmly packed",
        "1/4 cup granulated sugar"
    ],
    "nut": [
        "Calories > 84 kcal",
        "Carbs > 14.6 g",
        "Cholesterol > 7 mg",
        "Fat > 2.6 g",
        "Protein > 0.9 g",
        "Sodium > 69 mg"
    ],
    "n": "Gingerbread Straws",
    "a": "USA WEEKEND columnist Pam Anderson",
    "r": "0",
    "s": 56,
    "des": "\"These snappy gingerbread straws add an eye-catching twist to the usual gingerbread cookies.\"",
    "ins": "Mix flour, ginger, cinnamon, cloves, nutmeg, salt and baking soda in a bowl. In a separate bowl, mix molasses and water.\nIn a large bowl, beat butter and brown sugar with a hand mixer until light and fluffy. Beat in molasses mixture, then dry ingredients, to form stiff dough; if dough is sticky, add up to 1/4 cup more flour.\nQuarter the dough, form each portion into a disc, wrap in plastic and refrigerate until firm, about 1 hour. (Can be refrigerated up to 1 week or frozen up to 1 month.)\nHeat oven to 350 degrees.\nOn a heavily floured work surface, roll 1 portion of dough into a 9-by-7-inch rectangle. Sprinkle dough with 1 Tb. sugar; use rolling pin to press sugar into dough. Cut dough (preferably with a fluted-edge pastry cutter) into 9-by-1/2-inch sticks. Place sticks about 1/2-inch apart on a cookie sheet lined with parchment paper. Bake on middle rack until done, 18 to 22 minutes; after 10 minutes, rotate sheet from back to front. Repeat with remaining dough in batches.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}