{
    "id": 79281,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (4 pound) center cut pork roast, bone-in",
        "1/4 cup packed baby spinach",
        "7 dried pineapple pieces",
        "1 sprig fresh rosemary, chopped",
        "1 teaspoon chopped fresh parsley",
        "1 teaspoon poultry seasoning",
        "1 clove garlic, chopped",
        "1 tablespoon garlic powder",
        "1 tablespoon onion powder",
        "1 teaspoon kosher salt",
        "1 teaspoon cracked black pepper",
        "1/4 cup butter, melted",
        "3 tablespoons olive oil, divided",
        "4 carrots, quartered",
        "3 Yukon Gold potatoes, peeled and quartered",
        "1 onion, quartered"
    ],
    "nut": [
        "Calories > 635 kcal",
        "Carbs > 48.1 g",
        "Cholesterol > 126 mg",
        "Fat > 33.5 g",
        "Protein > 38.1 g",
        "Sodium > 495 mg"
    ],
    "n": "Jenn's Stuffed Pork Roast and Veggies",
    "a": "JENN_77",
    "r": "0",
    "s": 6,
    "des": "\"Impress your family and friends with this delicious eye catching dish.  The meat comes out very moist and delicious.  Serve with pan gravy or applesauce.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nWith a kitchen towel or paper towels, pat dry the pot roast. Turn roast fat side up. With a paring knife, cut deep slits between each rib. Stuff each slit with spinach and dried pineapple. Wrap the roast with butchers' twine to hold the meat together.\nIn a large bowl, stir together rosemary, parsley, poultry seasoning, garlic, garlic powder, onion powder, salt, cracked pepper, butter, and 1 1/2 tablespoons oil. Rub half of the mixture over the roast and inside the slits.\nHeat 1 1/2 tablespoons oil over high heat. Sear the roast, turning to brown on all sides, about 5 minutes.\nTransfer roast to a roasting pan fat side up; scatter carrots, potatoes, and onion around the roast. Pour remaining rub mixture over vegetables.\nRoast, uncovered, in a preheated oven for 2 1/2 hours, until the internal temperature of the roast reads 145 degrees F (63 degrees C). Remove roast, cover with an aluminum foil tent, and let rest 20 minutes to 1/2 hour to ensure moistness. Slice along each rib, and serve with pan gravy.",
    "pt": "15 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "2484191.jpg",
    "o": "",
    "st": "allrecipes"
}