{
    "id": 7931,
    "old_rating": "4.14286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups self-rising flour",
        "2 cups white sugar",
        "1 cup water",
        "1/2 cup butter",
        "1/2 cup shortening",
        "4 tablespoons unsweetened cocoa powder",
        "1/2 cup buttermilk",
        "1 teaspoon baking soda",
        "1 teaspoon vanilla extract",
        "2 eggs",
        "1/2 cup butter",
        "1/3 cup buttermilk",
        "3 tablespoons unsweetened cocoa powder",
        "4 cups confectioners' sugar",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 398 kcal",
        "Carbs > 60.9 g",
        "Cholesterol > 48 mg",
        "Fat > 17 g",
        "Protein > 3 g",
        "Sodium > 339 mg"
    ],
    "n": "Secret Cake",
    "a": "Patti Roberson",
    "r": "0",
    "s": 18,
    "des": "\"This recipe was given to me by my mom's neighbor, Sharon Kelley.  It is the very best chocolate cake recipe I have ever tasted.\"",
    "ins": "Combine flour and white sugar in a large bowl and set aside.\nPut 1/2 cup buttermilk into a large glass and add baking soda, stir until combined, set aside.\nIn medium sauce pan over medium heat combine water, shortening, 1/2 cup butter and 4 tablespoons cocoa.  Stir until shortening and butter are melted.  Allow to boil over medium heat for 5 minutes.\nAdd chocolate mixture to dry ingredients mix until well combined.  Add buttermilk baking soda mixture, stir until blended.  Add eggs and mix at medium speed of electric mixer until well blended. Add 1 teaspoon vanilla and mix well.  Pour into a 9 x 13 inch pan that has been sprayed with cooking spray.  Bake at 350 degrees F (175 degrees C) for 25 minutes.\nTo Make Frosting:  Combine 1/2 cup butter, 1/3 cup buttermilk, and 3 tablespoons cocoa in medium sauce pan, allow to come to a boil over medium heat.  Remove from heat and add confectioners' sugar and mix well, add 1 teaspoon vanilla and chopped nuts.  Pour over hot cake.  Allow cake to cool.  The longer this sets the better it gets!",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "809967.jpg",
    "o": "",
    "st": "allrecipes"
}