{
    "id": 79310,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cloves garlic, crushed",
        "1/2 onion, thinly sliced",
        "1/4 teaspoon freshly ground black pepper",
        "2 1/2 cups heavy cream",
        "1 sheet frozen puff pastry, thawed",
        "1 tablespoon Worcestershire sauce",
        "3 (4 ounce) beef tenderloin filets",
        "salt to taste",
        "3 fresh thyme leaves"
    ],
    "nut": [
        "Calories > 1333 kcal",
        "Carbs > 45.9 g",
        "Cholesterol > 336 mg",
        "Fat > 116.2 g",
        "Protein > 29.1 g",
        "Sodium > 371 mg"
    ],
    "n": "Beef Wellingtons",
    "a": "CHRIS fARQUHAR",
    "r": "0",
    "s": 3,
    "des": "\"This is great for a nice evening meal. I make it every year and its always a hit!\"",
    "ins": "Combine the garlic, onion and pepper in a saucepan over medium-low heat. Whisk in cream 1/2 cup at a time while stirring constantly. Cook and stir until cream has thickened slightly and vegetables are warm. Cover, and set aside. Keep warm.\nPreheat a grill for high heat. It can be an indoor grill, or your oven's broiler. Make a 1 inch slit in the center of each beef fillet. Grill each fillet for 1 to 2 minutes per side just to sear.\nPreheat the oven to 350 degrees F (175 degrees C). Roll out the puff pastry sheet to 1/3 inch thickness, and cut into three 8 inch squares. You may have some scraps left over. Place a fillet onto the center of each square, and spoon some of the cream mixture over the top. Pull pastry up around the sides, and pinch together at the top. Place onto a baking sheet.\nBake for about 40 minutes in the preheated oven, until the pastry is nicely browned. The beef should be medium well by then, you may check with a meat thermometer to see that it is 145 to 150 degrees F (62 to 65 degrees C) for medium rare or medium doneness. Halfway through baking, drizzle the Worcestershire sauce over the pastries.\nTo serve, place each pastry on a serving plate. Cut a 1 inch slit through the top of each one, and insert a thyme leaf.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "4459126.jpg",
    "o": "",
    "st": "allrecipes"
}