{
    "id": 7932,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "Crust:",
        "1 1/4 cups graham cracker crumbs",
        "1/3 cup white sugar",
        "1/4 cup ground walnuts",
        "1 teaspoon ground cinnamon",
        "6 tablespoons melted butter",
        "Filling:",
        "2 cups cottage cheese",
        "1 (8 ounce) package cream cheese, softened",
        "8 ounces finely shredded Swiss cheese",
        "1 cup white sugar",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon almond extract",
        "1/4 teaspoon salt",
        "6 eggs, separated",
        "1/3 cup all-purpose flour",
        "Topping:",
        "2 pears - peeled, cored and sliced",
        "3/4 cup currant jelly"
    ],
    "nut": [
        "Calories > 480 kcal",
        "Carbs > 53.9 g",
        "Cholesterol > 141 mg",
        "Fat > 23.5 g",
        "Protein > 15.4 g",
        "Sodium > 417 mg"
    ],
    "n": "Swiss Cheesecake",
    "a": "JJOHN32",
    "r": "0",
    "s": 12,
    "des": "\"A different cheesecake--made with Swiss cheese.\"",
    "ins": "For crust, combine graham cracker crumbs, 1/3 cup sugar, ground walnuts, cinnamon, and melted butter. Press onto bottom and part way up the sides of a 9-inch springform pan. Chill crust while preparing filling.\nPreheat oven to 350 degrees F (175 degrees C).\nBeat cottage cheese in small mixing bowl with an electric mixer on high speed until almost smooth, about 5 minutes; set aside. Beat cream cheese in large mixing bowl until light and fluffy. On medium speed, beat in Swiss cheese and cottage cheese until well-blended, about 3 minutes. Mix in 1 cup sugar, vanilla, almond extract, and salt. Beat in egg yolks, one at a time, beating well after each addition. Gradually blend in flour.\nWash egg beaters well, so no trace of batter remains. In a separate bowl, beat egg whites until medium-stiff peaks form. Lift the beater straight up: the tip of the peak formed by the egg whites should curl over slightly. Fold 1/3 of the egg white mixture into the cheesecake batter to lighten; fold in remaining egg whites. Pour batter into prepared crust.\nBake in preheated oven until center is set and doesn't jiggle when pan is shaken gently, 60 to 65 minutes.\nTurn oven heat off. Open oven door and let cheesecake cool in oven. It is normal for the cake to sink slightly in center. Refrigerate several hours or overnight.\nPlace cake on serving plate; carefully remove sides of pan.\nFor glaze, place pear slices in a decorative pattern on top of cheesecake. Heat currant jelly in small saucepan over low heat, stirring constantly, until melted. Spoon small amount over pear slices until all slices are coated; reserve remaining jelly. Refrigerate glazed cake at least one hour. To serve, reheat jelly and spoon a small amount over each slice of cheesecake.",
    "pt": "45 m",
    "ct": "1 h",
    "tt": "1 d ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}