{
    "id": 79518,
    "old_rating": "4.23131",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (8 ounce) baking potatoes",
        "2 tablespoons butter, melted",
        "salt and pepper to taste",
        "2 tablespoons finely grated fresh Romano cheese",
        "1 tablespoon seasoned dry bread crumbs"
    ],
    "nut": [
        "Calories > 247 kcal",
        "Carbs > 41.1 g",
        "Cholesterol > 19 mg",
        "Fat > 7.1 g",
        "Protein > 6.1 g",
        "Sodium > 171 mg"
    ],
    "n": "Hasselback Potatoes",
    "a": "POMPIER850",
    "r": "0",
    "s": 4,
    "des": "\"This Swedish dish takes its name from Hasselbacken, the Stockholm restaurant where it was first served. The seasoned potatoes turn out crisp on the outside and tender on the inside.\"",
    "ins": "Preheat the oven to 425 degrees F (220 degrees C).\nPeel the potatoes, and place in bowl of cold water to prevent browning. Place potatoes into a large wooden or metal spoon. Using a sharp knife, make slices across the potato the short way about 1/8 to 1/4 inch apart, making sure to cut down to the lip of the spoon, not all the way through the potato. The slices should stay connected at the bottom, and the spoon helps keep the depth even. Return the potato to the bowl of water, and proceed with the remaining potatoes.\nWhen all of the potatoes are cut, place them cut side up in a shallow baking dish or small roasting pan. Drizzle with half of the butter, then season with salt and pepper.\nBake for 35 to 40 minutes in the preheated oven. Remove from the oven, and drizzle with the remaining butter. Sprinkle Romano cheese and bread crumbs onto the tops of the potatoes, and season with a little more salt and pepper. Return to the oven, and bake for an additional 20 minutes, or until nicely browned.",
    "pt": "20 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "4524213.jpg",
    "o": "4524213.jpg,4473974.jpg,4293996.jpg,3926656.jpg,3875403.jpg,3865246.jpg",
    "st": "allrecipes"
}