{
    "id": 79566,
    "old_rating": "3.84615",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup uncooked long grain white rice",
        "2 cups water",
        "1/2 cup chopped walnuts",
        "1 tablespoon butter",
        "1 large red onion, sliced, separated into rings",
        "2 cloves garlic, minced",
        "1 cup vegetable broth",
        "1/2 teaspoon dried sage",
        "1/2 teaspoon dried tarragon",
        "salt and pepper to taste",
        "1 tablespoon olive oil",
        "1 (14 ounce) package firm tofu, drained and cut into 1/2 inch strips",
        "1 cup crumbled blue cheese"
    ],
    "nut": [
        "Calories > 415 kcal",
        "Carbs > 34.4 g",
        "Cholesterol > 22 mg",
        "Fat > 23.3 g",
        "Protein > 19.8 g",
        "Sodium > 416 mg"
    ],
    "n": "Tofu, Red Onions, Walnuts, and Blue Cheese",
    "a": "KAZOOT",
    "r": "0",
    "s": 6,
    "des": "\"I threw this together after wondering if blue cheese and tofu would go together well. The results were delicious! Non-blue cheese lovers can omit the cheese and still have a tasty dish.\"",
    "ins": "Bring the rice and water to a boil in a pot. Cover, reduce heat to low, and simmer 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Place the walnuts on a baking dish, and bake 10 minutes, stirring frequently, until lightly toasted. Remove from heat.\nMelt the butter in a skillet over medium heat, and cook the onion until tender. Mix in garlic, and cook 1 minute. Stir in the broth, and season with sage, tarragon, salt, and pepper. Continue cooking 10 minutes, stirring often.\nHeat the oil in a separate skillet. Dredge the tofu in the toasted walnuts, and cook in the skillet about 4 minutes on each side, until lightly browned. Mix any remaining walnuts and the onion and broth mixture into the skillet. Cook until heated through. Serve over rice, and top with blue cheese.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "1464686.jpg",
    "o": "",
    "st": "allrecipes"
}