{
    "id": 79831,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups canned cherry pie filling",
        "1/2 cup butter, softened",
        "2 cups white sugar",
        "2 eggs",
        "2 1/2 cups all-purpose flour",
        "1 1/2 teaspoons baking soda",
        "1 1/2 teaspoons ground nutmeg",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon ground allspice",
        "2 (8 ounce) packages cream cheese, softened",
        "1 cup butter, softened",
        "3 tablespoons milk",
        "1 tablespoon vanilla extract",
        "8 cups sifted confectioners' sugar"
    ],
    "nut": [
        "Calories > 706 kcal",
        "Carbs > 110.8 g",
        "Cholesterol > 100 mg",
        "Fat > 28.1 g",
        "Protein > 5.3 g",
        "Sodium > 339 mg"
    ],
    "n": "Cherry Spice Cake",
    "a": "Barbara Pohozoff",
    "r": "0",
    "s": 16,
    "des": "\"An elegant three layer cake that is moist and spicy and frosted with a delicious cream cheese frosting. This is a family favorite at Christmas in our household! I cut red and green candied cherries in half and decorate the top in a wreath pattern.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour three 9 inch round cake pans. Place the cherry pie filling into the container of a food processor. Pulse until roughly chopped.\nIn a large bowl, mix butter and white sugar until light and fluffy. Add eggs one at a time, mixing well after each one. In a separate bowl, sift together the flour, baking soda, nutmeg, cinnamon, cloves and allspice. Alternate stirring in the dry ingredients and cherry pie filling. Stir just until blended. Divide the batter evenly between the three pans.\nBake for 30 to 35 minutes in the preheated oven, or until a toothpick inserted into the center of the cake comes out clean. Cool in the pans on a wire rack. When the cakes have cooled enough to handle, tap them out of the pans and allow them to cool completely on the wire rack.\nTo make the frosting, combine the cream cheese, 1 cup butter, milk and vanilla in a large mixing bowl. Beat with an electric mixer until blended. Gradually mix in the sugar, stirring until smooth.  Spread frosting between the layers and onto the sides and top of the cake.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "262744.jpg",
    "o": "",
    "st": "allrecipes"
}