{
    "id": 80051,
    "old_rating": "4.47368",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups uncooked wild rice",
        "6 cups water",
        "6 slices bacon",
        "4 pounds ground pork",
        "2 tablespoons butter",
        "1 medium onion, chopped",
        "1/2 cup celery, chopped",
        "1/2 cup flour",
        "3 1/2 cups half and half",
        "1 (18 ounce) can ready to serve cream of mushroom soup",
        "1 (8 ounce) can sliced mushrooms, drained, liquid reserved",
        "1 cup slivered almonds",
        "1 (2 ounce) jar diced pimento",
        "1/4 cup chopped fresh parsley",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 598 kcal",
        "Carbs > 27.5 g",
        "Cholesterol > 146 mg",
        "Fat > 38.9 g",
        "Protein > 35.1 g",
        "Sodium > 663 mg"
    ],
    "n": "Pork and Wild Rice Casserole",
    "a": "kathleen",
    "r": "0",
    "s": 12,
    "des": "\"This recipe is a delicious use of wild rice. Just be sure to season your ground pork if you don't buy it preseasoned (usually labeled as pork sausage). Fresh Italian sausage can also be used, just cut open the casing. Works great prepared a day ahead and re-heated for 20 minutes at serving time.\"",
    "ins": "Place rice and water in a pot and bring to a boil. Reduce heat to low, cover, and cook 45 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nPlace bacon in a large skillet over medium-high heat and cook until evenly brown. Drain, crumble, and set aside. Place pork in skillet and cook until evenly brown. Drain and set aside.\nReduce skillet heat to medium and melt butter. Stir in onion and celery, and cook until tender; set aside. Mix flour into remaining butter until smooth. In a bowl, mix the reserved mushroom liquid and half and half; stir into the skillet and cook until thickened. Stir in the soup. Mix in 6 cups cooked rice, cooked bacon, cooked pork, mushrooms, almonds, pimento, parsley, salt, and pepper. Transfer to a 9x13 inch casserole dish.\nBake 40 minutes in the preheated oven.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "296436.jpg",
    "o": "",
    "st": "allrecipes"
}