{
    "id": 8035,
    "old_rating": "4.0566",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 eggs",
        "1 1/4 cups white sugar",
        "2 1/2 tablespoons water",
        "1 1/2 cups cake flour",
        "1/2 teaspoon baking powder",
        "1 1/2 teaspoons almond extract",
        "1/4 cup confectioners' sugar for dusting"
    ],
    "nut": [
        "Calories > 193 kcal",
        "Carbs > 37.6 g",
        "Cholesterol > 93 mg",
        "Fat > 2.7 g",
        "Protein > 4.6 g",
        "Sodium > 56 mg"
    ],
    "n": "Chinese Steamed Cake",
    "a": "Kevin Ryan",
    "r": "0",
    "s": 12,
    "des": "\"Although real Chinese dinners usually end with a piece of fruit, Western influence has caused a few changes. This cake uses Chinese techniques to make a French inspired, and extremely moist, sponge cake.\"",
    "ins": "Arrange a large bamboo steamer or a large vegetable steamer over simmering water.  Make sure it is large enough to hold the baking pan.  Line a 9 inch square pan with waxed paper.\nSeparate the eggs.  Place the yolks in a large bowl along with the sugar and water.  Beat with an electric mixer on medium speed until the mixture has increased about three times in volume.  Whisk together the flour and the baking powder; sift this over the egg mixture, and fold in gently. Blend in the extract.\nWhip the egg whites in a clean bowl to stiff, not dry, peaks.  Fold into yolk base.  Pour the batter into the prepared pan, and smooth out to edges.  Rap the pan on the counter to get rid of large air bubbles.\nPlace the pan into the steamer. Cover the top of the steamer with a kitchen towel, and place the lid on top; the towel will absorb any steam that collects on top from dripping onto the cake.  Steam for about 20 minutes, or until a toothpick inserted into the center comes out clean.  Cool on a wire rack. Dust with confectioner's sugar.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "19996.jpg",
    "o": "",
    "st": "allrecipes"
}