{
    "id": 80446,
    "old_rating": "3.69091",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter, softened",
        "2 cups brown sugar",
        "1 teaspoon pure vanilla extract",
        "5 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1 teaspoon baking soda",
        "1/4 cup milk",
        "Icing:",
        "1 cup butter, very soft",
        "1 teaspoon pure vanilla extract",
        "confectioners' sugar",
        "splash of milk"
    ],
    "nut": [
        "Calories > 75 kcal",
        "Carbs > 9.3 g",
        "Cholesterol > 10 mg",
        "Fat > 3.9 g",
        "Protein > 0.7 g",
        "Sodium > 54 mg"
    ],
    "n": "Brown Sugar Cut-Out Cookies and Icing",
    "a": "MGRIFFIN1",
    "r": "0",
    "s": 96,
    "des": "\"These cookies are great for a rainy day activity with the kids. Also great for Christmas gifts. This was handed down since at least my great grandmother and are YUMMY!\"",
    "ins": "In a large bowl, stir together 1 cup butter and brown sugar until smooth and creamy. Stir in 1 teaspoon vanilla. In a separate bowl, combine the flour, salt, and baking soda; stir into creamed mixture. Mix in milk, stirring until a soft dough forms. Cover, and chill for 1 hour.\nPreheat oven to 365 degrees F (185 degrees C). On a floured surface, roll out dough to 1/4 inch thick. Cut into desired shapes using cookie cutters. Place cookies 2 inches apart on ungreased cookie sheets.\nBake in a preheated oven for 6 minutes. Cool on wire racks.\nMeanwhile, in a large bowl, stir together 1 cup butter and 1 teaspoon vanilla until it becomes smooth and creamy. Gradually stir in sugar, one cup at a time, beating well after each addition. Beat in a splash of milk, and continue mixing until light and fluffy. Keep icing covered until ready to decorate. Spread icing on top of cookies.",
    "pt": "25 m",
    "ct": "6 m",
    "tt": "1 h ",
    "i": "5333.jpg",
    "o": "",
    "st": "allrecipes"
}