{
    "id": 8095,
    "old_rating": "4.47368",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 1/8 cups all-purpose flour",
        "2 cups white sugar",
        "3/4 cup unsweetened cocoa powder",
        "1 1/2 teaspoons baking powder",
        "3/4 teaspoon baking soda",
        "3/4 teaspoon salt",
        "3 eggs",
        "1 cup milk",
        "1/2 cup vegetable oil",
        "1 tablespoon vanilla extract",
        "2 (20 ounce) cans pitted sour cherries",
        "1 cup white sugar",
        "1/4 cup cornstarch",
        "1 teaspoon vanilla extract",
        "3 cups heavy whipping cream",
        "1/3 cup confectioners' sugar"
    ],
    "nut": [
        "Calories > 662 kcal",
        "Carbs > 86.9 g",
        "Cholesterol > 130 mg",
        "Fat > 33.9 g",
        "Protein > 7.5 g",
        "Sodium > 342 mg"
    ],
    "n": "Black Forest Cake I",
    "a": "Linda Greer",
    "r": "0",
    "s": 12,
    "des": "\"This recipe delivers a classic version of the original Black Forest cake with whipped cream frosting and cherry toping.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).  Grease and flour two 9 inch, round, cake pans; cover bottoms with waxed paper.\nIn a large bowl, combine flour, 2 cups sugar, cocoa, baking powder, baking soda, and salt.  Add eggs, milk, oil, and 1 tablespoon vanilla; beat until well blended.  Pour batter into prepared pans.\nBake for 35 minutes,  or until wooden toothpick inserted in centers comes out clean. Cool layers in pans on wire racks 10 minutes. Loosen edges, and remove to racks to cool completely.\nDrain cherries, reserving 1/2 cup juice. Combine reserved juice, cherries, 1 cup sugar and cornstarch in a 2 quart saucepan. Cook over low heat until thickened, stirring constantly. Stir in 1 teaspoon vanilla. Cool before using.\nCombine whipping cream and confectioner's sugar in a chilled medium bowl.  Beat with an electric mixer at high speed until stiff peaks form.\nWith long serrated knife, split each cake layer horizontally in half. Tear one split layer into crumbs; set aside.   Reserve 1 1/2 cups Frosting for decorating cake; set aside.  Gently brush loose crumbs off top and side of each cake layer with pasty brush or hands.  To assemble, place one cake layer on cake plate. Spread with 1 cup frosting; top with 3/4 cup cherry topping.  Top with second cake layer; repeat layers of frosting and cherry topping.  Top with third cake layer.  Frost side of cake.  Pat reserved crumbs onto frosting on side of cake.  Spoon reserved frosting into pastry bag fitted with star decorator tip.  Pipe around top and bottom edges of cake. Spoon remaining cherry topping onto top of cake.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "4541569.jpg",
    "o": "4541569.jpg,4539927.jpg,4532149.jpg,4516228.jpg,4515893.jpg,4513455.jpg",
    "st": "allrecipes"
}