{
    "id": 81026,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 teaspoons lemon juice",
        "2 teaspoons sherry vinegar",
        "1 tablespoon white wine",
        "1/8 teaspoon red pepper flakes",
        "1/8 teaspoon ground black pepper",
        "1/8 teaspoon salt",
        "2 skinless, boneless chicken breast halves - cubed",
        "2 cups dried penne pasta",
        "1/4 cup extra virgin olive oil, divided",
        "1 clove garlic, chopped",
        "1 cup white wine",
        "1 tablespoon sherry vinegar",
        "1 (14.5 ounce) can diced tomatoes",
        "1 (15 ounce) can cannellini beans, rinsed and drained",
        "1/2 cup torn fresh basil",
        "2 cups torn arugula leaves",
        "1/8 teaspoon red pepper flakes",
        "salt and freshly ground black pepper to taste",
        "freshly grated Romano cheese"
    ],
    "nut": [
        "Calories > 507 kcal",
        "Carbs > 47.3 g",
        "Cholesterol > 38 mg",
        "Fat > 18.6 g",
        "Protein > 24 g",
        "Sodium > 573 mg"
    ],
    "n": "Chicken and Tomato Stew with Arugula and Cannellini",
    "a": "amanda1432",
    "r": "0",
    "s": 4,
    "des": "\"A hearty tomato and white wine-based stew for cold winter nights.  For lovers of the peppery arugula plant!\"",
    "ins": "In a medium bowl, stir together 2 teaspoons of lemon juice, 2 teaspoons of sherry vinegar, 1 tablespoon of white wine, 1/8 teaspoon of red pepper flakes, and 1/8 teaspoon of salt. Add the chicken cubes, and stir to coat. Set aside to marinate for at least 20 minutes.\nBring a pot of lightly salted water to a boil. Add the pasta, and cook until tender, about 8 minutes. Drain, and set aside.\nHeat 1 tablespoon of olive oil in a Dutch oven or deep skillet over medium-high heat. Add the chicken, and cook, stirring occasionally, until browned, about 5 minutes. Remove from the pan, and set aside.\nPour in the remaining olive oil, and add the garlic. Cook and stir until fragrant. Mix in 1 cup of white wine, 1 tablespoon of sherry vinegar, tomatoes, and cannellini beans. Stir in the chicken, and reduce heat to low. Cover, and simmer for 15 minutes.\nStir in the pasta, basil, arugula, and red pepper flakes. Cover, and turn off heat. Let sit until the arugula and basil have wilted, about 5 minutes. Season with salt and pepper.  Ladle into serving bowls, and top with Romano cheese to serve.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "1493221.jpg",
    "o": "",
    "st": "allrecipes"
}