{
    "id": 81056,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound small Yukon Gold potatoes",
        "1 medium onion, cut into chunks",
        "6 cloves garlic",
        "4 sprigs fresh thyme",
        "3 sprigs fresh rosemary",
        "1/3 cup water",
        "1/2 cup extra virgin olive oil",
        "salt and pepper to taste",
        "1 small head cauliflower, cut into florets",
        "1 (8 ounce) package dry penne pasta",
        "grated Parmesan cheese for topping (optional)"
    ],
    "nut": [
        "Calories > 321 kcal",
        "Carbs > 35.9 g",
        "Cholesterol > 4 mg",
        "Fat > 16.2 g",
        "Protein > 8.1 g",
        "Sodium > 92 mg"
    ],
    "n": "Roasted Potato Cauliflower Pasta",
    "a": "SandyT",
    "r": "0",
    "s": 8,
    "des": "\"My husband recently became a vegan, so I devised this recipe one cold night so both of us could eat well. This is based on traditional pasta dishes from Chez Panisse and Zuni in the Bay Area of California. Sourdough breadcrumbs sauteed in olive oil until crisp would be a tasty alternative to Parmesan.\"",
    "ins": "Preheat oven to 375  degrees F (190 degrees C). Line a medium baking pan with heavy duty aluminum foil, and spray foil with cooking spray.\nPlace potatoes in the prepared pan. Mix with onion, garlic, thyme, and rosemary. Drizzle with 1/3 cup water and 1/4 cup olive oil. Season with salt and pepper. Seal pan with aluminum foil.\nBake potatoes 30 minutes in the preheated oven, or until tender. Remove foil, mix in cauliflower, and drizzle with remaining oil. Cover, and continue baking 15 minutes. Increase oven temperature to 425 degrees F (220 degrees C), remove foil, and continue baking 10 minutes, or until potatoes are crisp and cauliflower is lightly browned.\nBring a large pot of lightly salted water to a boil. Place pasta in the pot. Cook for 8 to 10 minutes, until al dente, and drain.\nIn a large bowl, gently toss the potato mixture with the cooked pasta. Serve topped with Parmesan cheese.",
    "pt": "15 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "1129323.jpg",
    "o": "",
    "st": "allrecipes"
}