{
    "id": 8126,
    "old_rating": "4.73306",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 eggs",
        "1 cup white sugar",
        "2/3 cup canned pumpkin",
        "1 teaspoon lemon juice",
        "3/4 cup all-purpose flour",
        "2 teaspoons ground cinnamon",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground nutmeg",
        "1 cup chopped walnuts",
        "6 ounces cream cheese, softened",
        "1 cup confectioners' sugar",
        "1/4 cup butter, softened",
        "1/2 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 228 kcal",
        "Carbs > 27 g",
        "Cholesterol > 54 mg",
        "Fat > 12.4 g",
        "Protein > 3.9 g",
        "Sodium > 193 mg"
    ],
    "n": "Pumpkin Roll Cake",
    "a": "Stephanie",
    "r": "0",
    "s": 16,
    "des": "\"A thin pumpkin cake, rolled around in a white cream filling, then in nuts. Can be frozen and served chilled. Dust with confectioners' sugar, if desired.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C).\nIn a mixing bowl, beat eggs on high for 5 minutes. Gradually beat in white sugar until thick and lemon-colored. Add pumpkin and lemon juice.\nIn another bowl combine flour, cinnamon, baking powder, salt, and nutmeg; fold into the pumpkin mixture.\nGrease a 15x10x1 inch baking pan; line with waxed paper. Grease and flour the paper. Spread batter into pan; sprinkle with walnuts.\nBake at 375 degrees F (190 degrees C) for 15 minutes or until cake springs back when lightly touched.\nImmediately turn out onto a linen towel dusted with confectioners' sugar. Peel off paper and roll cake up in the towel, starting with the short end. Cool.\nMeanwhile, in a mixing bowl, beat cream cheese, 1 cup confectioners' sugar, butter, and vanilla until fluffy.\nCarefully unroll the cake. Spread filling over cake to within 1 inch of edges. Roll up again. Cover and chill until serving. Dust with additional confectioners' sugar, if desired.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "3816695.jpg",
    "o": "3816695.jpg,3519087.jpg,2959032.jpg,2884869.jpg,2861129.jpg,2747193.jpg",
    "st": "allrecipes"
}