{
    "id": 81297,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (1 pound) loaf round bread",
        "3 slices bacon, diced",
        "1 small onion, finely chopped",
        "1 (4 ounce) can sliced mushrooms, drained",
        "1/2 cup chopped sun-dried tomatoes",
        "2 (8 ounce) packages cream cheese, at room temperature",
        "2 (10 ounce) packages frozen chopped spinach, thawed and squeezed dry",
        "1 (11 ounce) can refrigerated soft bread stick dough"
    ],
    "nut": [
        "Calories > 433 kcal",
        "Carbs > 44.5 g",
        "Cholesterol > 55 mg",
        "Fat > 22.9 g",
        "Protein > 13 g",
        "Sodium > 891 mg"
    ],
    "n": "Warm Spinach and Bacon Cob Loaf",
    "a": "aussietracey",
    "r": "0",
    "s": 10,
    "des": "\"A fantastic and easy appetizer that everyone will enjoy. I am always asked to bring this to parties so I don't know if I'm invited or just the dip. Simply add more ingredients for larger parties or make two, there will not be leftovers.\"",
    "ins": "Preheat the oven to 400 degrees F (200 degrees C).\nPlace bacon in a large skillet over medium-high heat. When the bacon starts to brown, add the onion and mushrooms. Cook and stir until everything is tender and browned. Remove from heat. Transfer to a medium bowl. Use a wooden spoon to stir in the sun-dried tomatoes, cream cheese and spinach until well blended. Set aside.\nMake a well in the loaf of bread by cutting an oval hole in the top, and pulling out the bread inside, leaving a 1 1/2 to 2 inch shell. This is your serving bowl. Spoon the cream cheese mixture into the bread. Place on a baking tray. Cut the breadstick dough into 3 inch fingers, and place them on the baking sheet also.\nBake for about 15 minutes in the preheated oven, until the breadsticks are golden, and the loaf is heated through. To serve, place the loaf of bread with the dip onto the center of a serving tray, and arrange the breadsticks around it. After all the breadsticks are gone, simply eat the bread bowl. No mess!",
    "pt": "6 m",
    "ct": "15 m",
    "tt": "21 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}