{
    "id": 8193,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "3 (1 ounce) squares unsweetened chocolate",
        "6 tablespoons butter",
        "2 eggs",
        "1 1/3 cups white sugar",
        "3/4 cup all-purpose flour",
        "3/4 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/2 cup butterscotch schnapps, divided",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon almond extract",
        "1/4 cup semisweet chocolate chips",
        "1/2 cup butterscotch chips",
        "1/4 cup slivered almonds",
        "1 cup heavy whipping cream",
        "2 cups semisweet chocolate chips",
        "2 tablespoons amaretto liqueur"
    ],
    "nut": [
        "Calories > 641 kcal",
        "Carbs > 74.2 g",
        "Cholesterol > 88 mg",
        "Fat > 36.4 g",
        "Protein > 6 g",
        "Sodium > 242 mg"
    ],
    "n": "Chocolate Butterschnapps Cake",
    "a": "bk",
    "r": "0",
    "s": 10,
    "des": "\"A two-layer, glazed, chocolate cake with butterscotch schnapps and butterscotch chips.\"",
    "ins": "Melt unsweetened chocolate and butter or margarine in the top of a double boiler or in a bowl in the microwave. Stir until smooth. Set aside to cool.\nIn a large bowl, beat eggs well.  Gradually add sugar, and beat until fluffy.  Add cooled chocolate mixture slowly; mix well.  Stir in 1/4 cup schnapps, almond extract, and vanilla.  Briefly stir together flour, baking powder, and salt; gradually add flour mixture to chocolate mixture.  Mix only to combine.  Stir in chips with spatula.  Divide batter into two greased and floured, 8 inch, round cake pans.\nBake at 350 degrees F (175 degrees C) for 20 to 25 minutes, or until the cake tests done.  Cool for 10 minutes in the pans.\nMeanwhile, bring the cream to a boil in a medium saucepan.  Remove from heat, and stir in 12 ounces chocolate chips.  Cover, and let stand 10 minutes.  Remove lid, and stir in amaretto.\nRemove layers from pans.  Brush with remaining schnapps.  Place one layer on a serving plate. Pour 1/3 of the glaze over the layer, and then place the second layer over the first.  Pour remaining glaze over the whole cake.   Decorate with slivered almonds.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}