{
    "id": 8207,
    "old_rating": "3.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 eggs",
        "1/4 cup vegetable oil",
        "1 cup unsweetened applesauce",
        "1 cup frozen apple juice concentrate, thawed",
        "2 1/4 cups all-purpose flour",
        "1 tablespoon baking soda",
        "1 teaspoon ground ginger",
        "1 1/2 cups ground almonds",
        "2 Macintosh apples - peeled, cored and finely chopped",
        "1 (8 ounce) package cream cheese",
        "3 tablespoons unsweetened apple butter",
        "2 tablespoons frozen apple juice concentrate, thawed"
    ],
    "nut": [
        "Calories > 402 kcal",
        "Carbs > 40.6 g",
        "Cholesterol > 67 mg",
        "Fat > 23.5 g",
        "Protein > 10.2 g",
        "Sodium > 375 mg"
    ],
    "n": "Sugar Free Applesauce Cake",
    "a": "Lynn",
    "r": "0",
    "s": 12,
    "des": "\"Moist apple cake with only the natural goodness of apples for sweetener. Great for kids and people watching their refined sugar intake.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9 inch square baking pan.\nBeat the eggs until they drop like ribbons from the beaters. Continue beating and add the oil in a thin stream. Beat in the  1 cup applesauce and the 1 cup unsweetened apple juice concentrate.\nBeat in the flour gradually until well blended. Add the baking soda, ground ginger, ground almonds and apples, mix to combine.\nPour the batter into the prepared pan and bake at 350 degrees F (175 degrees C) for about 40 minutes or until the cake tests done. Let cake cool on a rack for 15 minutes before turning out of pan. Cool completely before frosting.\nCarefully slice the cake in half horizontally with a long serrated knife. Fill and frost with Apple Butter Frosting.\nTo Make Apple Butter Frosting: Beat the cream cheese until soft and fluffy. Gradually beat in the apple butter and remaining 2 tablespoons apple juice concentrate.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}