{
    "id": 82160,
    "old_rating": "4.64062",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds ground beef",
        "2 (16 ounce) packages kielbasa sausage, sliced into 1/2 inch pieces",
        "2 cloves garlic, chopped",
        "1 onion, chopped",
        "2 (14.5 ounce) cans peeled and diced tomatoes, drained",
        "4 medium baking potatoes, peeled and diced",
        "2 (15 ounce) cans pinto beans, with liquid",
        "2 (15.2 ounce) cans whole kernel corn, with liquid",
        "1 (14.5 ounce) can diced tomatoes with green chile peppers, with liquid",
        "1 (10 ounce) package frozen mixed vegetables",
        "4 cups water",
        "2 teaspoons ground cumin",
        "2 teaspoons chili powder",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 677 kcal",
        "Carbs > 52.2 g",
        "Cholesterol > 115 mg",
        "Fat > 37.1 g",
        "Protein > 35.3 g",
        "Sodium > 1620 mg"
    ],
    "n": "Texas Cowboy Stew",
    "a": "Glenda Beall",
    "r": "0",
    "s": 10,
    "des": "\"Hearty, filling and man-pleasing describes this stew. Link sausage, cumin, chilies, and chili powder is what gives this soup its Southwest flavor. This dish is quick, easy, and tastes best when it simmers in a slow cooker or even on the stove all day. Bake some Mexican cornbread, toss a simple green salad, and you have a great meal.\"",
    "ins": "Crumble the ground beef into a large skillet over medium-high heat. Add the sausage, garlic and onion; cook and stir until the meat is no longer pink. Drain off grease, and transfer the contents of the skillet to a large pot.\nPour the tomatoes into the pot with the meat, and stir in the potatoes, pinto beans, corn, diced tomatoes with chilies, mixed vegetables and water. Season with cumin, chili powder, salt and pepper. Cover, and simmer over medium-low heat for at least 1 hour. Stir occasionally. The longer this stew cooks, the better it gets.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "3037166.jpg",
    "o": "",
    "st": "allrecipes"
}