{
    "id": 8222,
    "old_rating": "4.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup white sugar",
        "1/4 cup shortening",
        "1/4 teaspoon salt",
        "1 egg",
        "1 (0.6 ounce) cake compressed fresh yeast",
        "1/2 cup warm milk",
        "2 1/2 cups all-purpose flour",
        "1 tablespoon vanilla extract",
        "2 1/2 cups white sugar",
        "1 cup butter, softened",
        "1/8 teaspoon salt",
        "1 egg",
        "1/4 cup light corn syrup",
        "2 1/4 cups all-purpose flour",
        "1/4 cup water",
        "1 tablespoon vanilla extract"
    ],
    "nut": [
        "Calories > 287 kcal",
        "Carbs > 45 g",
        "Cholesterol > 36 mg",
        "Fat > 10.6 g",
        "Protein > 3.4 g",
        "Sodium > 102 mg"
    ],
    "n": "Phila Butter Cake",
    "a": "shirleyo",
    "r": "0",
    "s": 24,
    "des": "\"Here it is, a cake with a ooey gooey buttery topping. Bet it will bring back the memories or make some new ones.\"",
    "ins": "Combine 1/4 cup white sugar, shortening and 1/4 teaspoon salt. Beat in the egg and mix for one minute or until well blended\nDissolve the yeast in the warm milk. Add the milk and yeast mixture, vanilla and 2 1/2 cups flour to the shortening mixture. Mix for 3 minutes with a dough hook or with hands.\nTurn dough out on a floured board and knead for one minute. Place dough in a medium size lightly greased bowl, cover and set in a warm place to rise for 1 hour.\nWhile dough is rising prepare gooey butter topping. Combine the remaining sugar, butter and salt. Add the egg and corn syrup. Mix until just combined. Add the flour, water and vanilla and mix to combine. Set aside.\nGrease two 9x9 inch square baking pans.\nDivide dough into two pieces and place them into the prepared pans. Crimp the edges halfway up the sides of the pans to prevent the topping from running underneath. With a fork poke wholes into he bottom of the dough. Divide the topping into two equal parts and spread over the dough in each pan. Let the cakes stand for 20 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nBake cakes for 30 minutes. Do not overbake, the topping should stay gooey. After the cakes have cooled sprinkle tops with confectioners' sugar.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}