{
    "id": 82242,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 medium eggplants",
        "1 large red bell pepper, halved and seeded",
        "4 large tomatoes, seeded and diced",
        "1 clove chopped fresh garlic",
        "1 lime, juiced",
        "salt and pepper to taste",
        "1/4 cup chopped fresh cilantro",
        "1/4 cup olive oil",
        "1 (10 ounce) package pita bread rounds",
        "1/4 cup butter, melted"
    ],
    "nut": [
        "Calories > 149 kcal",
        "Carbs > 20.5 g",
        "Cholesterol > 8 mg",
        "Fat > 6.9 g",
        "Protein > 3.6 g",
        "Sodium > 120 mg"
    ],
    "n": "Eggplant Salsa and Homemade Pita Chips",
    "a": "PREGOCOOK",
    "r": "0",
    "s": 16,
    "des": "\"I was in the produce aisle admiring the beautiful eggplants and I kinda said out loud 'hmmm... wonder what I could do with those?' and a woman answered, 'I always make salsa!'  SALSA??? So I figured I give it a shot.. and scribbled down her recipe!  YUM!\"",
    "ins": "Preheat the oven to 400 degrees F (200 degrees C). Slice the tops off of the eggplants, and place on a baking sheet with the red pepper halves. Drizzle with olive oil to lightly coat.\nBake for about 40 minutes in the preheated oven, until eggplant is tender. Remove from the oven, and place the eggplant and peppers into a large resealable bag. Seal, and let sit for 15 minutes to loosen the skin. Remove from the bag, peel off the skins, and dice the eggplants and pepper. Transfer to a large bowl.\nPlace the tomatoes, and garlic in to the bowl with the roasted vegetables, and season with salt, pepper and cilantro. Mix until well blended. Set aside.\nSet the oven to 300 degrees F (150 degrees C).\nPeel apart the pita breads into two thin circles. You may cut off the edges to make it easier. Brush melted butter onto what used to be the inside, and stack together. Cut into strips, then cut across at a diagonal to make diamond shapes. If you have kitchen scissors, it will be easy. Place them on a baking sheet.\nBake the pita chips for 5 to 10 minutes in the preheated oven, until lightly toasted. Stir occasionally if they overlap.",
    "pt": "1 h",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "276296.jpg",
    "o": "",
    "st": "allrecipes"
}