{
    "id": 82380,
    "old_rating": "4.63309",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup honey",
        "3 tablespoons soy sauce",
        "seasoned salt to taste",
        "1 (5 pound) beef brisket",
        "1 cup apple cider",
        "seasoned salt to taste",
        "3/4 cup ketchup",
        "1/4 cup packed brown sugar",
        "2 tablespoons Worcestershire sauce",
        "1/4 cup apple cider vinegar",
        "seasoned salt to taste",
        "1/2 teaspoon garlic powder, or to taste"
    ],
    "nut": [
        "Calories > 615 kcal",
        "Carbs > 35.6 g",
        "Cholesterol > 117 mg",
        "Fat > 39.2 g",
        "Protein > 30 g",
        "Sodium > 799 mg"
    ],
    "n": "Oklahoma Brisket",
    "a": "Susan",
    "r": "0",
    "s": 8,
    "des": "\"This is absolutely fabulous and so easy.  Brisket that isn't dried out can be so good.  The bar-b-que sauce is also wonderful and can be used for other meat dishes.\"",
    "ins": "Preheat the oven to 300 degrees F (150 degrees C). Season the brisket all over with seasoned salt, and place in a roasting pan. Pour the apple juice over it, and cover tightly with aluminum foil.\nRoast the brisket for 3 hours in the preheated oven. Don't peek.\nPrepare a grill for low heat. In a small bowl, stir together the honey and soy sauce, and season with seasoned salt.\nWhen the roast comes out of the oven, place it on the preheated grill. Grill for 30 minutes, turning frequently and basting with the honey sauce.\nMeanwhile, in a saucepan over low heat, make a barbeque sauce by combining  the ketchup, brown sugar, Worcestershire sauce, cider vinegar, seasoned salt, and garlic powder. Cook and stir over low heat for 15 minutes without allowing the sauce to boil. If you boil the sauce, it becomes very vinegary.\nLet the brisket rest for about 10 minutes after it comes off the grill. Slice and serve with the barbeque sauce.",
    "pt": "30 m",
    "ct": "4 h",
    "tt": "4 h ",
    "i": "1077104.jpg",
    "o": "3782024.jpg,3618755.jpg,3067637.jpg,2479404.jpg,2479401.jpg,2132916.jpg",
    "st": "allrecipes"
}