{
    "id": 8254,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Fresh Coconut Cake:",
        "2 cups coconut, drained and meat grated",
        "1 cup milk, or as needed",
        "3 cups all-purpose flour",
        "3 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/2 cup butter, room temperature",
        "1/2 cup shortening",
        "2 cups white sugar",
        "4 eggs, room temperature",
        "1 teaspoon vanilla extract",
        "Coconut Frosting:",
        "1/4 cup water",
        "1 cup white sugar",
        "1/8 teaspoon cream of tartar",
        "1 pinch salt",
        "2 egg whites",
        "1 teaspoon vanilla extract",
        "2/3 cup butter, room temperature",
        "2 cups grated fresh coconut"
    ],
    "nut": [
        "Calories > 675 kcal",
        "Carbs > 79.5 g",
        "Cholesterol > 111 mg",
        "Fat > 37.7 g",
        "Protein > 7.7 g",
        "Sodium > 393 mg"
    ],
    "n": "Fresh Coconut Cake",
    "a": "Lynne",
    "r": "0",
    "s": 12,
    "des": "\"This delicious cake is made with fresh coconut. This one makes three 9-inch layers.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9-inch round baking pans. Reserve coconut juice and add enough milk to make 1 cup; set aside.\nIn a small bowl, sift together flour, baking powder, and salt. Set aside.\nBeat the butter, shortening, and 2 cups sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the vanilla with the last egg. Pour in the flour mixture alternately with the coconut-milk mixture, mixing until just incorporated. Fold in 2 cups grated coconut, mixing just enough to evenly combine. Pour the batter into prepared pans.\nBake in the preheated oven until the cake is golden and a tester inserted in the center comes out clean, 30 to 35 minutes. Cool completely on wire racks.\nTo Make Icing: In a saucepan, combine 1/4 cup water, 1 cup sugar, cream of tartar, and pinch of salt. Bring to a boil, stirring occasionally. Stop stirring once mixture is boiling. Cook until sugar syrup reaches soft ball stage on a candy thermometer (240 degrees F or 115 degrees C). If you don't have a thermometer, drop a little sugar syrup into a cup of cold water; when the syrup is ready, it will form a soft ball that holds its shape.\nWhile syrup is boiling, whip egg whites at medium-high speed until stiff but not dry. Carefully pour the hot syrup down the side of the bowl, beating constantly at high speed. Keep beating until mixture is cool to the touch.\nDrop butter, a tablespoon at a time, into egg white mixture, beating constantly. The mixture will deflate as butter is added; just keep mixing. When all of the butter is incorporated, frosting will fluff up again. Blend in vanilla.\nSpread buttercream between, around and on top of each layer. Sprinkle grated coconut on top of each frosted layer.",
    "pt": "45 m",
    "ct": "30 m",
    "tt": "2 h ",
    "i": "13347.jpg",
    "o": "",
    "st": "allrecipes"
}