{
    "id": 82659,
    "old_rating": "4.78819",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 large onion, cut into 1/4-inch slices",
        "1 1/4 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon salt",
        "1 egg",
        "1 cup milk, or as needed",
        "3/4 cup dry bread crumbs",
        "seasoned salt to taste",
        "1 quart oil for frying, or as needed"
    ],
    "nut": [
        "Calories > 641 kcal",
        "Carbs > 68.3 g",
        "Cholesterol > 69 mg",
        "Fat > 34.6 g",
        "Protein > 14.3 g",
        "Sodium > 1272 mg"
    ],
    "n": "Old Fashioned Onion Rings",
    "a": "JeanieMomof3",
    "r": "0",
    "s": 3,
    "des": "\"This is an actual recipe from a former employee of a popular drive-in restaurant. Crispy coated onion rings like the pro's make!\"",
    "ins": "Heat the oil in a deep-fryer to 365 degrees F (185 degrees C).\nSeparate the onion slices into rings, and set aside. In a small bowl, stir together the flour, baking powder and salt.\nDip the onion slices into the flour mixture until they are all coated; set aside. Whisk the egg and milk into the flour mixture using a fork. Dip the floured rings into the batter to coat, then place on a wire rack to drain until the batter stops dripping. The wire rack may be placed over a sheet of aluminum foil for easier clean up. Spread the bread crumbs out on a plate or shallow dish. Place rings one at a time into the crumbs, and scoop the crumbs up over the ring to coat. Give it a hard tap as you remove it from the crumbs. The coating should cling very well. Repeat with remaining rings.\nDeep fry the rings a few at a time for 2 to 3 minutes, or until golden brown. Remove to paper towels to drain. Season with seasoning salt, and serve.",
    "pt": "15 m",
    "ct": "3 m",
    "tt": "18 m",
    "i": "4537754.jpg",
    "o": "4537754.jpg,4537326.jpg,4536988.jpg,4530164.jpg,4529616.jpg,4529434.jpg",
    "st": "allrecipes"
}