{
    "id": 82700,
    "old_rating": "4.79817",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 eggs",
        "3 tablespoons butter, melted and cooled",
        "1 1/4 cups all-purpose flour",
        "1/4 teaspoon baking powder",
        "1 teaspoon salt"
    ],
    "nut": [
        "Calories > 254 kcal",
        "Carbs > 30.1 g",
        "Cholesterol > 116 mg",
        "Fat > 11.5 g",
        "Protein > 7.3 g",
        "Sodium > 701 mg"
    ],
    "n": "Grandma's Butter Noodles",
    "a": "MOMOFADDY",
    "r": "0",
    "s": 4,
    "des": "\"This is my late mother-in-laws recipe for noodles -- her favorite for flavor and because they don't spring back when you roll them.  At every family gathering she'd make the best Chicken and Noodles, dropping her prepared noodles into homemade chicken broth along with shredded cooked chicken, then serving them over mashed potatoes.  I've made them many times and everyone loves them.  When making multiple batches, and lacking counter space, I hang the rounds on clean plastic hangers to dry.\"",
    "ins": "In a large bowl, whisk the eggs and melted butter together with a fork. Stir in the flour, baking powder and salt until dough becomes stiff. Knead on a lightly floured surface or in the bowl for a few minutes to blend completely. Divide the dough into thirds. On a lightly floured surface, roll each piece into a sheet about 1/16 of an inch thick. Place each sheet onto a dry cloth and set aside for 30 to 45 minutes to partially dry.\nWhen the noodle sheets are somewhat dry, roll up one at a time into a loose spiral and cut into strips as wide as you want using a sharp knife. Spread out the noodles to dry for about 1 hour before cooking or storing in freezer containers. To use frozen noodles, thaw in the container before using.\nTo cook the noodles, drop into rapidly boiling water or broth, and cook until tender, 7 to 10 minutes.",
    "pt": "30 m",
    "ct": "10 m",
    "tt": "2 h ",
    "i": "3303344.jpg",
    "o": "2932508.jpg,1981596.jpg,1817030.jpg,771879.jpg,587975.jpg,562667.jpg",
    "st": "allrecipes"
}