{
    "id": 82810,
    "old_rating": "0",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup Worcestershire sauce",
        "1 teaspoon liquid smoke flavoring",
        "1/2 teaspoon lemon pepper",
        "1 1/4 pounds cubed lamb stew meat",
        "1 tablespoon creamy salad dressing (such as Miracle Whipâ„¢)",
        "1 tablespoon thousand island salad dressing",
        "1 teaspoon Worcestershire sauce",
        "1 teaspoon yellow mustard",
        "1 teaspoon ketchup",
        "1/2 teaspoon onion powder"
    ],
    "nut": [
        "Calories > 77 kcal",
        "Carbs > 8.8 g",
        "Cholesterol > 6 mg",
        "Fat > 4.2 g",
        "Protein > 1 g",
        "Sodium > 494 mg"
    ],
    "n": "Marinated Lamb Chislick",
    "a": "TIMMYSTER",
    "r": "0",
    "s": 4,
    "des": "\"Lamb tidbits are given a flavorful marinade, then broiled to perfection in this appetizer.\"",
    "ins": "Whisk together 1/2 cup of Worcestershire sauce, liquid smoke, and lemon pepper in a bowl. and pour into a resealable plastic bag. Add the lamb cubes, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 1 hour. Prepare the dipping sauce by whisking together the salad dressings, 1 teaspoon Worcestershire sauce, mustard, ketchup, and onion powder in a small bowl. Refrigerate until ready to serve.\nPreheat the oven's broiler and set the oven rack in the middle of the oven. Spray a broiler pan with nonstick cooking spray.\nDrain the lamb cubes in a colander in the sink, discarding the marinade. Place the lamb cubes onto the prepared broiler pan. Cook in the preheated oven until the lamb has cooked to your desired degree of doneness, 10 to 15 minutes for medium.\nPlace the lamb cubes on a plate covered with paper towels. serve hot with the dipping sauce using toothpicks. Do not reheat as lamb tends to lose flavor when reheated.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}