{
    "id": 82896,
    "old_rating": "4.23529",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/2 tablespoons olive oil",
        "3/4 cup chopped onion",
        "2 cloves garlic, chopped",
        "1 (5 ounce) can solid white tuna packed in water, drained",
        "1 (14.5 ounce) can whole peeled tomatoes, chopped",
        "1 (4.25 ounce) can black olives, drained and halved",
        "1/2 teaspoon dried basil",
        "1/4 teaspoon dried oregano",
        "freshly ground black pepper to taste",
        "1 (28 ounce) can tomato puree",
        "1 (16 ounce) package uncooked angel hair pasta",
        "1/2 cup grated Parmesan cheese for topping"
    ],
    "nut": [
        "Calories > 308 kcal",
        "Carbs > 44.9 g",
        "Cholesterol > 9 mg",
        "Fat > 9.2 g",
        "Protein > 14.3 g",
        "Sodium > 794 mg"
    ],
    "n": "Delicious Angel Hair in Tomato, Tuna and Olive Sauce",
    "a": "AIRAMA",
    "r": "0",
    "s": 8,
    "des": "\"You'll love this blend of tomatoes, tuna and black olives in a homemade tomato sauce. My mom would make this during Lent for the family, but you'll want to make it all year round. My husband (who hates tuna), raves about this dish. It's different and very delicious. Tastes even better heated the next day. Serve with some garlic bread and a salad and you have a complete dinner.\"",
    "ins": "Heat olive oil in a skillet over medium heat. Stir in onion and garlic, and cook until tender. Mix in tuna and peeled tomatoes; cook until heated through. Mix in olives. Season with basil, oregano and pepper. Cook and stir 5 minutes. Stir in tomato puree. Cover, reduce heat to low and simmer 30 minutes, stirring occasionally.\nBring a large pot of lightly salted water to a boil. Place angel hair pasta in pot and cook 4 minutes, or until al dente. Serve topped with the sauce and sprinkled with Parmesan cheese.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "50 m",
    "i": "3163740.jpg",
    "o": "",
    "st": "allrecipes"
}