{
    "id": 82953,
    "old_rating": "4.0303",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 pounds russet potatoes",
        "1/2 cup all-purpose flour",
        "1 egg",
        "1 tablespoon chopped fresh parsley",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly ground nutmeg",
        "1/4 cup lard or other cooking fat"
    ],
    "nut": [
        "Calories > 215 kcal",
        "Carbs > 27.9 g",
        "Cholesterol > 39 mg",
        "Fat > 9.6 g",
        "Protein > 4.4 g",
        "Sodium > 213 mg"
    ],
    "n": "Badische Schupfnudeln (Potato Noodles)",
    "a": "Seb",
    "r": "0",
    "s": 6,
    "des": "\"Typical of Baden-Baden and the Baden-Wurttemberg state in southwestern Germany,  schupfnudeln is a kind of spaeztle (homemade pasta) that gets its name from the Upper German word 'Schupfen,' meaning 'to shove, push, throw or chuck.' They are traditionally handmade by rolling out potato dough on a board and cutting the dough into noodles. Simple and easy to make, they are delicious and go well with almost anything: roast pork, racks of lamb, bits of bacon, sauerkraut, and any cabbage dishes.\"",
    "ins": "Place whole potatoes in their skins into a large pot of  boiling water; boil for 25 to 30 minutes. Remove potatoes, and discard water. When cool enough to handle, peel potatoes, and place on a lightly floured surface. Mash potatoes with a rolling pin.\nPlace mashed potatoes into a large bowl. Stir in flour, egg, parsley, salt, and nutmeg. Knead well to form a smooth dough. Then roll out the dough to a thickness of about 1/2 inch. Cut flattened dough into thin strips, about 1 1/2 inches long. Gently roll out the strips, or stretch them until the ends taper. Set aside for 15 minutes.\nIn a large skillet, heat lard over medium heat. Place the potato strips into the skillet, and fry until golden brown on both sides.",
    "pt": "30 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "316078.jpg",
    "o": "",
    "st": "allrecipes"
}