{
    "id": 83204,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons vegetable oil",
        "2 onions, chopped",
        "2 cloves garlic, chopped",
        "2 pounds ground beef",
        "12 ounces carrots, chopped",
        "1 green bell pepper, seeded and chopped",
        "1 pound zucchini, diced",
        "1/3 cup raisins",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon ground black pepper",
        "1 1/2 cups whole kernel corn",
        "1 3/4 cups baked beans",
        "6 tablespoons butter",
        "3/4 cup all-purpose flour",
        "3 3/4 cups milk",
        "1 cup grated Cheddar cheese",
        "4 egg yolks"
    ],
    "nut": [
        "Calories > 866 kcal",
        "Carbs > 64.4 g",
        "Cholesterol > 291 mg",
        "Fat > 49.6 g",
        "Protein > 45.7 g",
        "Sodium > 1330 mg"
    ],
    "n": "Ohio Meat Pie",
    "a": "MSKYEWOLF",
    "r": "0",
    "s": 6,
    "des": "\"My mom used to make this comfort stew for us when we were kids - always loved it!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nHeat the oil in a large pot or Dutch oven over medium-high heat. Add the onions and garlic; cook and stir until tender. Crumble in the ground beef, and cook until evenly browned. Drain off grease, and reduce the heat to medium-low.\nAdd the carrots, bell pepper,  zucchini, and raisins, and season with salt and pepper. Simmer, stirring occasionally, until tender, about 10 minutes. Stir in the beans and corn, remove from the heat, and pour into a casserole dish. Set aside.\nMelt the butter in a saucepan over medium heat. Whisk in the flour using a fork until smooth. Cook for a few minutes, then gradually whisk in the milk and egg yolks so that no lumps form. Bring to a gentle simmer, then stir in the cheese, and remove from the heat. Pour over the meat and vegetables in the casserole dish.\nBake for 25 minutes in the preheated oven, until the sauce is thick and bubbly, and everything is heated through.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}