{
    "id": 8324,
    "old_rating": "4.48485",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (18.25 ounce) package yellow cake mix",
        "3 eggs",
        "1 (21 ounce) can cherry pie filling",
        "2 teaspoons vanilla extract",
        "1 (8 ounce) package cream cheese, softened",
        "1/2 cup butter, softened",
        "4 cups confectioners' sugar",
        "1 (21 ounce) can light cherry pie filling"
    ],
    "nut": [
        "Calories > 609 kcal",
        "Carbs > 101.9 g",
        "Cholesterol > 88 mg",
        "Fat > 20.5 g",
        "Protein > 5.3 g",
        "Sodium > 429 mg"
    ],
    "n": "Cartoon Cake",
    "a": "Jeff Gillman",
    "r": "0",
    "s": 12,
    "des": "\"A double-layer cake made with cherry pie filling, topped with cream cheese frosting and cherry pie filling. Very moist and dense and cherry-licious. You can also put it in a 9 x 13 inch pan if you don't want to store the two layer cake\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9 inch round cake pans.\nIgnore instructions on cake box. In a large bowl, beat eggs, add 1 can pie filling and combine. Add cake mix and beat until well mixed. The batter will be stiff.\nPour half of the batter into each pan and spread evenly. Bake at 350 degrees F (175 degrees C) for about 25 minutes, or until a toothpick inserted into the center of cake comes out clean. Cool a couple of minutes, then turn layers out onto cooling rack. Cool completely before icing.\nFor the icing: Beat butter, cream cheese, and vanilla until smooth. Add confectioners sugar and continue beating until smooth.\nIce a layer, add the second layer, and finish icing the cake. Refrigerate until time to serve.  Just before serving, pour the cherry pie filling on top and spread it gently to the edges. A few of the cherries will roll down the sides. That's what you want.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2154901.jpg",
    "o": "",
    "st": "allrecipes"
}