{
    "id": 8336,
    "old_rating": "4.225",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups self-rising flour",
        "2 cups white sugar",
        "1 cup water",
        "1/2 cup butter",
        "1/2 cup shortening",
        "4 tablespoons unsweetened cocoa powder",
        "1/2 cup buttermilk",
        "1 teaspoon baking soda",
        "1 teaspoon vanilla extract",
        "2 eggs",
        "1/2 cup whiskey",
        "4 fluid ounces strong brewed coffee",
        "1/2 cup butter",
        "1/3 cup buttermilk",
        "3 tablespoons unsweetened cocoa powder",
        "3/4 cup confectioners' sugar",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 247 kcal",
        "Carbs > 29.5 g",
        "Cholesterol > 36 mg",
        "Fat > 12.8 g",
        "Protein > 2.2 g",
        "Sodium > 254 mg"
    ],
    "n": "Secret Midnight Moon Better than Chocolate Sex Cake",
    "a": "GG",
    "r": "0",
    "s": 24,
    "des": "\"This recipe was modified from several that I found at the Cake Recipe   site, some of it is taken from the recipe for Secret Cake, but it  has other random ingredients. It's very, very nice, moist and   chocolaty. And the name is a random conglomeration of words from the  various recipes that I used to come up with this one.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan with cooking spray.\nCombine flour and white sugar in a large bowl and set aside.\nPut 1/2 cup buttermilk into a large glass and add baking soda, stir until combined, set aside.\nIn medium sauce pan over medium heat combine water, shortening, 1/2 cup butter and 4 tablespoons cocoa.  Stir until shortening and butter are melted. Allow to boil on medium heat for 5 minutes.\nAdd chocolate mixture to dry ingredients and mix until well combined. Add buttermilk baking soda mixture, stir until blended. Add eggs and mix. Add the whiskey and the espresso and keep mixing. Add 1 teaspoon vanilla and mix well. Pour into a 9 x 13 inch pan that has been sprayed with cooking spray.\nBake at 350 degrees F (175 degrees C) for 25 minutes.\nTo Make Frosting:  Combine 1/2 cup butter, 1/3 cup buttermilk, and 3 tablespoons cocoa in medium sauce pan, allow to come to a boil over medium heat.  Remove from heat and add confectioners sugar and mix well, add 1 teaspoon vanilla and chopped nuts. Pour over hot cake. Allow cake to cool. The longer this sets, the better it gets!",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "993672.jpg",
    "o": "",
    "st": "allrecipes"
}