{
    "id": 83419,
    "old_rating": "4.45909",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 slices bacon",
        "4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness",
        "1 (10 ounce) package frozen chopped spinach, thawed and squeezed dry",
        "1 cup crumbled blue cheese",
        "2 tablespoons all-purpose flour",
        "1/8 teaspoon ground black pepper",
        "1/4 teaspoon salt",
        "2 tablespoons olive oil"
    ],
    "nut": [
        "Calories > 444 kcal",
        "Carbs > 7.1 g",
        "Cholesterol > 113 mg",
        "Fat > 27.4 g",
        "Protein > 41.6 g",
        "Sodium > 1154 mg"
    ],
    "n": "Chicken Breast Stuffed with Spinach Blue Cheese and Bacon",
    "a": "Judy",
    "r": "0",
    "s": 4,
    "des": "\"This is a recipe I came up with while trying to use up some leftovers from another recipe. You can add more or less pepper depending on your taste.  My family liked it hope you do to.\"",
    "ins": "Cook bacon until crisp. I prefer to use an indoor grill. Bacon can also be cooked in a skillet over medium-high heat, or the microwave at about 1 minute per slice. Drain on paper towels, and set aside.\nPreheat the oven to 350 degrees F (175 degrees C). In a medium bowl, stir together the spinach and blue cheese. Crumble in the bacon, and stir to distribute.\nLay the chicken breast halves out on a clean surface, and distribute the spinach mixture evenly onto the centers of them. Fold the chicken over the filling, and secure with toothpicks.  Stir together the flour, salt and pepper on a dinner plate. Roll the chicken in the flour to coat.\nHeat the oil in a skillet over medium-high heat. Quickly brown each piece of chicken on top and bottom. Remove to a lightly greased baking dish, and cover with a lid or aluminum foil.\nBake for 30 minutes in the preheated oven, until chicken juices run clear, and filling is hot.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "796779.jpg",
    "o": "3490532.jpg,3429624.jpg,3407523.jpg,3407460.jpg,3279701.jpg,2307946.jpg",
    "st": "allrecipes"
}