{
    "id": 83556,
    "old_rating": "4.64778",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 skinless, boneless chicken breast halves - pounded thin",
        "1 (8 ounce) bottle Italian-style salad dressing",
        "8 slices of stale wheat bread, torn",
        "3/4 cup grated Parmesan cheese",
        "1 teaspoon chopped fresh thyme",
        "1/8 teaspoon pepper",
        "1 1/2 cups feta cheese, crumbled",
        "1/2 cup sour cream",
        "1 tablespoon vegetable oil",
        "3 cloves garlic, minced",
        "4 cups chopped fresh spinach",
        "1 bunch green onions, chopped",
        "1 cup mushrooms, sliced",
        "1 (8 ounce) jar oil-packed sun-dried tomatoes, chopped"
    ],
    "nut": [
        "Calories > 622 kcal",
        "Carbs > 34.7 g",
        "Cholesterol > 119 mg",
        "Fat > 35.2 g",
        "Protein > 43.4 g",
        "Sodium > 1517 mg"
    ],
    "n": "Chicken Breasts Stuffed with Perfection",
    "a": "PREGOCOOK",
    "r": "0",
    "s": 6,
    "des": "\"What's not to love about anything with feta, spinach, sun-dried tomatoes, garlic and mushrooms in it? The best thing about these is that they are easily prepared a day ahead or frozen and eaten later. These are perfect to have for company along with a nice salad and the Chocolate Lava Cakes for dessert.\"",
    "ins": "Place chicken breasts in a large resealable plastic bag. Pour in Italian dressing, seal tightly, and refrigerate at least 1 hour.\nPlace the stale bread, Parmesan, thyme, and pepper into a food processor. Pulse until the bread is processed into crumbs. Seat aside.\nIn a large bowl, stir together the feta and sour cream. Set aside.\nHeat the oil in a large skillet over medium heat. Stir in the garlic. Then add the spinach, and cook until it wilts. Stir in green onions, cook 2 minutes. Remove spinach to a plate, and leave any liquid in the pan. Stir in mushrooms, and saute until soft. Remove mushrooms to plate with spinach. Allow to cool briefly, then combine spinach and mushrooms with feta and sour cream mixture.\nStir the sun-dried tomatoes into the mixture, and spread onto a large cookie sheet. Place in the freezer for about 30 minutes.\nPreheat the oven to 400 degrees F (200 degrees C).\nPlace chicken breasts on a cookie sheet, and place about 3 tablespoons of the filling mixture in the center of each breast. Roll the breasts, and secure with a toothpick. Transfer chicken breasts to a baking dish, and sprinkle breadcrumb mixture over chicken breasts.\nBake, uncovered, in a preheated oven for 25 minutes.",
    "pt": "1 h",
    "ct": "45 m",
    "tt": "2 h ",
    "i": "4483195.jpg",
    "o": "4483195.jpg,4477959.jpg,4477958.jpg,4328562.jpg,3368459.jpg,3240897.jpg",
    "st": "allrecipes"
}