{
    "id": 8362,
    "old_rating": "3",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 potatoes, peeled and halved",
        "2 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/4 teaspoon ground cloves",
        "1 teaspoon ground cinnamon",
        "1 cup butter, room temperature",
        "2 cups white sugar",
        "4 egg yolks",
        "1/2 cup heavy whipping cream",
        "1 cup ground almonds",
        "4 (1 ounce) squares semisweet chocolate, grated",
        "1 tablespoon grated lemon zest",
        "4 egg whites"
    ],
    "nut": [
        "Calories > 574 kcal",
        "Carbs > 68.6 g",
        "Cholesterol > 123 mg",
        "Fat > 31 g",
        "Protein > 9.6 g",
        "Sodium > 218 mg"
    ],
    "n": "Potato Chocolate Torte",
    "a": "Marsha",
    "r": "0",
    "s": 12,
    "des": "\"Ground almonds, cinnamon, lemon zest, and mashed ('riced') potatoes are the key to this moist chocolate torte.\"",
    "ins": "To rice potatoes: place potatoes in a saucepan with water to cover.  Bring to a boil, and cook for 20 minutes, or until tender. Drain potatoes, and cool slightly. Hold the ricer over a bowl and force the potatoes through the sieve until completely processed. You will need 1 cup riced potatoes for the recipe.\nPreheat oven to 325 degrees F (165 degrees C).\nSift together flour, baking powder, cloves and cinnamon; set aside.\nBeat butter and sugar with an electric mixer until light and fluffy. Add yolks, one at a time, beating well with each addition. Add 1 cup riced/mashed potatoes, heavy cream, ground almonds, grated chocolate, and lemon zest and mix well.\nBlend in flour mixture and mix until combined. Beat egg whites with an electric mixer until medium-stiff peaks form.\nFold 1/3 of the egg whites into batter to lighten it, then fold in remaining egg whites until no streaks remain.\nPour batter into a 9-inch springform pan. Bake in preheated oven until a toothpick inserted into the center of cake comes out clean, about 1 1/2 hours. Let cool, then frost with chocolate frosting.",
    "pt": "1 h",
    "ct": "1 h ",
    "tt": "2 h ",
    "i": "808286.jpg",
    "o": "",
    "st": "allrecipes"
}