{
    "id": 83819,
    "old_rating": "4.56075",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Filling:",
        "2/3 cup sugar",
        "1/3 cup cornstarch",
        "2 cups chopped rhubarb",
        "1 (10 ounce) package frozen sliced strawberries, thawed",
        "2 tablespoons lemon juice",
        "Cake:",
        "3 cups all-purpose flour",
        "1 cup sugar",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1 cup cold butter or margarine",
        "2 eggs",
        "1 cup buttermilk",
        "1 teaspoon vanilla extract",
        "Topping:",
        "3/4 cup sugar",
        "1/2 cup all-purpose flour",
        "1/4 cup cold butter or margarine"
    ],
    "nut": [
        "Calories > 506 kcal",
        "Carbs > 75.8 g",
        "Cholesterol > 83 mg",
        "Fat > 20.6 g",
        "Protein > 6 g",
        "Sodium > 307 mg"
    ],
    "n": "Strawberry Rhubarb Coffee Cake",
    "a": "ARKBUCKS",
    "r": "0",
    "s": 12,
    "des": "\"Strawberries and rhubarb combine to make a sweet, fruity filling in this cake. The crumb topping adds a little crunch; it would probably be good with some nuts sprinkled on top.\"",
    "ins": "Combine sugar and cornstarch in a large saucepan; stir in rhubarb and strawberries and bring to a simmer over medium heat. Cook until thickened, about two minutes. Remove from heat, stir in lemon juice, and let cool.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch pan.\nCombine 3 cups flour, 1 cup sugar, baking powder, and baking soda in a large bowl. Cut in butter until mixture resembles coarse crumbs. Beat together eggs, buttermilk, and vanilla in a separate bowl. Stir egg mixture into flour until just moistened. Spoon two-thirds of the batter into  prepared pan; evenly spread on the cooled filling, then cover with remaining batter.\nIn a small bowl, combine 3/4 cup sugar and 1/2 cup flour, and cut in butter until the mixture resembles coarse crumbs; sprinkle crumb topping over the batter.\nBake in preheated oven until topping is golden brown and a tester inserted in the center comes out clean, 45 to 50 minutes. Cool on a wire rack.",
    "pt": "40 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "410858.jpg",
    "o": "4524755.jpg,4521853.jpg,2316422.jpg,1125755.jpg,1033624.jpg,974975.jpg",
    "st": "allrecipes"
}