{
    "id": 83844,
    "old_rating": "4.74275",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 (3 pound) corned beef briskets with spice packets",
        "2 (12 fluid ounce) bottles beer",
        "2 bay leaves",
        "1/4 cup peppercorns",
        "1 bulb garlic cloves, separated and peeled"
    ],
    "nut": [
        "Calories > 229 kcal",
        "Carbs > 4.2 g",
        "Cholesterol > 78 mg",
        "Fat > 15.1 g",
        "Protein > 15 g",
        "Sodium > 904 mg"
    ],
    "n": "Slow Cooked Corned Beef for Sandwiches",
    "a": "Suze Knisley",
    "r": "0",
    "s": 15,
    "des": "\"This is an excellent recipe for party sandwiches.  I always make 2 (and sometimes 3) briskets because it goes so fast. The meat should cook slowly for a minimum of 4 hours--cooking longer will just make it more tender. It sounds like a LOT of garlic, but no one has ever complained that it tasted too garlicky.  Serve with brown mustard on rye or kaiser rolls. Can also add cole slaw to the sandwich for a uniquely delicious sandwich.\"",
    "ins": "Place the corned beef briskets into a large pot. Sprinkle in one of the spice packets, and discard the other one or save for other uses. Pour in the beer, and fill the pot with enough water to cover the briskets by 1 inch. Add the bay leaves, peppercorns and garlic cloves. Cover, and bring to a boil.\nOnce the liquid comes to a boil, reduce the heat to medium-low, and simmer for 4 to 5 hours, checking hourly, and adding more water if necessary to keep the meat covered.\nCarefully remove the meat from the pot, as it will be extremely tender. Set on a cutting board, and allow it to rest until it firms up a bit, about 10 minutes. Slice or shred to serve. I discard the cooking liquid, but it can be used to cook cabbage and other vegetables if desired.",
    "pt": "15 m",
    "ct": "4 h",
    "tt": "4 h ",
    "i": "67832.jpg",
    "o": "2613133.jpg,1262544.jpg,1113297.jpg,1112502.jpg,995608.jpg,811406.jpg",
    "st": "allrecipes"
}