{
    "id": 84099,
    "old_rating": "4.50584",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "6 cups cabbage, shredded",
        "1 carrot, shredded",
        "1/2 cup fresh bean sprouts",
        "1 celery stalk, diced",
        "2 tablespoons chopped onion (optional)",
        "1 (4 ounce) can shrimp, drained",
        "2 tablespoons soy sauce",
        "1/8 teaspoon garlic powder",
        "black pepper to taste",
        "1 egg, beaten",
        "cornstarch",
        "20 egg roll wrappers",
        "vegetable oil for frying"
    ],
    "nut": [
        "Calories > 208 kcal",
        "Carbs > 17.7 g",
        "Cholesterol > 49 mg",
        "Fat > 12.3 g",
        "Protein > 7.2 g",
        "Sodium > 396 mg"
    ],
    "n": "Awesome Egg Rolls",
    "a": "ROUVER",
    "r": "0",
    "s": 8,
    "des": "\"They are a little time consuming, but they're definitely worth the effort. You can substitute  shredded chicken or pork in this recipe. Serve with hot mustard.\"",
    "ins": "In a large bowl, mix together cabbage, carrots, sprouts, celery, and onion. Stir in shrimp, soy sauce, garlic powder, and black pepper.\nPour beaten egg into a skillet placed over medium heat; cook flat and thin, flipping once, until done. Remove from skillet, cool, and chop finely. Stir egg into cabbage mixture. Sprinkle top with cornstarch, mix, and allow to sit 10 minutes.\nMix 1 tablespoon cornstarch with 2 tablespoons cold water. Set aside.\nPlace 2 or 3 tablespoons of the shrimp mixture into the center of an egg roll skin. Dip a spoon into the water and cornstarch mixture, and moisten all corners but the bottom corner. Fold the egg roll skin from the bottom over the mixture, making a tight tube of the shrimp mixture. Fold corners in from the sides, and press to stick against folded roll. Then roll the rest of the way. Repeat with remaining egg roll wrappers.\nPour vegetable oil into a deep frying pan to a depth of 3 or 4 inches, and heat oil to 350 degrees F (175 degrees C). Carefully place egg rolls into hot oil, and fry until golden brown. Remove to paper towels.",
    "pt": "30 m",
    "ct": "15 m",
    "tt": "45 m",
    "i": "1385110.jpg",
    "o": "4520064.jpg,4484280.jpg,4009838.jpg,2571701.jpg,1524507.jpg,1454538.jpg",
    "st": "allrecipes"
}