{
    "id": 84109,
    "old_rating": "4.07584",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup uncooked orzo pasta",
        "2 tablespoons olive oil",
        "2 cloves garlic",
        "1/4 teaspoon crushed red pepper",
        "2 skinless, boneless chicken breast halves - cut into bite-size pieces",
        "salt to taste",
        "1 tablespoon chopped fresh parsley",
        "2 cups fresh spinach leaves",
        "grated Parmesan cheese for topping"
    ],
    "nut": [
        "Calories > 351 kcal",
        "Carbs > 40.4 g",
        "Cholesterol > 38 mg",
        "Fat > 10.6 g",
        "Protein > 22.3 g",
        "Sodium > 164 mg"
    ],
    "n": "Garlic Chicken with Orzo Noodles",
    "a": "VBRAUER671",
    "r": "0",
    "s": 4,
    "des": "\"This is a simple recipe with a spicy kick for garlic lovers. It is my combination of a much loved linguine and clam sauce dish and a recent introduction to orzo pasta. I have several variations for this recipe.  Add more red pepper for extra spice.  Substitute the chicken for clams or shrimp.  Substitute the spinach leaves for diced tomatoes.  I've also added spices such as basil, rosemary and oregano bringing a distinct Italian flavor to the dish.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Add orzo pasta, cook for 8 to 10 minutes, until al dente, and drain.\nHeat the oil in a skillet over medium-high heat, and cook the garlic and red pepper 1 minute, until garlic is golden brown. Stir in chicken, season with salt, and cook 2 to 5 minutes, until lightly browned and juices run clear. Reduce heat to medium, and mix in the parsley and cooked orzo. Place spinach in the skillet. Continue cooking 5 minutes, stirring occasionally, until spinach is wilted. Serve topped with Parmesan cheese.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "825212.jpg",
    "o": "4540729.jpg,4540001.jpg,4535153.jpg,4535120.jpg,4534818.jpg,4534481.jpg",
    "st": "allrecipes"
}