{
    "id": 8429,
    "old_rating": "4.55827",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (10 ounce) jar maraschino cherries, drained",
        "1/4 cup butter",
        "1/2 cup packed brown sugar",
        "1/2 cup flaked coconut",
        "1 (8 ounce) can sliced pineapple, drained with juice reserved",
        "1 (8 ounce) can crushed pineapple, drained with juice reserved",
        "1 (18.25 ounce) package yellow cake mix"
    ],
    "nut": [
        "Calories > 322 kcal",
        "Carbs > 57.7 g",
        "Cholesterol > 11 mg",
        "Fat > 9.8 g",
        "Protein > 2.2 g",
        "Sodium > 324 mg"
    ],
    "n": "Pineapple Upside-Down Cake V",
    "a": "Donna",
    "r": "0",
    "s": 12,
    "des": "\"This recipe makes a two-layer pineapple upside-down cake using cake mix and canned pineapple.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Coat the bottoms and sides of each 9 inch round cake pan with 2 tablespoons of melted butter. Sprinkle the bottom of each pan with 1/4 cup of brown sugar.\nIn one of the pans, sprinkle coconut over the brown sugar. Lay pineapple rings in a single layer on top of coconut. Place a cherry in the center of each ring. In the other pan, spread the drained crushed pineapple.\nMix the cake as directed on package, but substitute reserved pineapple juice in place of water. Divide batter between the 2 pans. Remember which pan has the pineapple rings in it.\nBake for 40 to 50 minutes in the preheated oven, or until a toothpick inserted into cake comes out clean. Cool in pans for 20 minutes.\nWhile the bottoms of the cake pans are still warm to the touch, invert the layer with the crushed pineapple out onto a serving dish, then gently invert the layer with the pineapple rings on top of it for a dazzling two layer pineapple upside down cake.",
    "pt": "10 m",
    "ct": "40 m",
    "tt": "1 h ",
    "i": "4531891.jpg",
    "o": "4531890.jpg,4504905.jpg,4484540.jpg,4481410.jpg,4461102.jpg,4285699.jpg",
    "st": "allrecipes"
}