{
    "id": 84327,
    "old_rating": "4.05263",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1 cup milk",
        "1 (9 ounce) can tuna, drained and flaked",
        "1 (10 ounce) package frozen chopped broccoli, thawed",
        "1 cup shredded Cheddar cheese, divided",
        "1 (2.8 ounce) can French-fried onions",
        "6 (7 inch) flour tortillas",
        "1 medium tomato, chopped"
    ],
    "nut": [
        "Calories > 440 kcal",
        "Carbs > 39.9 g",
        "Cholesterol > 36 mg",
        "Fat > 20.5 g",
        "Protein > 23.2 g",
        "Sodium > 829 mg"
    ],
    "n": "Tuna Broccoli Roll Up Casserole",
    "a": "PIDGE",
    "r": "0",
    "s": 6,
    "des": "\"This Tuna Broccoli Roll Up Casserole is a great alternative to the common tuna casserole.  It's colorful and the flavors blend together to make a yummy complete meal. It's one of my husbands favorite recipes.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a medium bowl, stir together the cream of mushroom soup and milk. Set aside. In another bowl, stir together the tuna, broccoli, 1/2 cup of Cheddar cheese and half of the French fried onions. Stir in 3/4 cup of the soup.\nDivide the tuna mixture evenly between the tortillas, and roll up. Place rolls seam side down in a lightly greased 9x13 inch baking dish. Pour the remaining soup over the rolls, and spread evenly using the back of a spoon. It will be a thin layer. Sprinkle the rest of the French fried onions over the soup, then the tomato, and finally the remaining Cheddar cheese. Cover with nonstick or lightly greased aluminum foil.\nBake for 30 minutes in the preheated oven. Remove the aluminum foil, and bake for 5 more minutes to allow the cheese to melt and brown slightly.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "45 m",
    "i": "120422.jpg",
    "o": "2511404.jpg,1129543.jpg,655963.jpg,222971.jpg,74244.jpg,74242.jpg",
    "st": "allrecipes"
}