{
    "id": 84445,
    "old_rating": "4.14286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil",
        "1 teaspoon sesame oil",
        "2 cloves garlic, chopped",
        "1 green onion, chopped",
        "1 tablespoon miso paste",
        "1 cup heavy cream",
        "1/4 cup sake",
        "1/4 cup fresh lime juice",
        "1 1/2 cups dry bread crumbs",
        "1 (7 ounce) can salmon, drained and flaked",
        "1/3 cup chopped onion",
        "1/4 cup chopped fresh cilantro",
        "1 egg",
        "1 tablespoon soy sauce",
        "1 tablespoon water",
        "2 tablespoons vegetable oil"
    ],
    "nut": [
        "Calories > 406 kcal",
        "Carbs > 24.4 g",
        "Cholesterol > 100 mg",
        "Fat > 27.1 g",
        "Protein > 13.9 g",
        "Sodium > 602 mg"
    ],
    "n": "Asian Salmon Cakes with Creamy Miso and Sake Sauce",
    "a": "HUNNY OH",
    "r": "0",
    "s": 6,
    "des": "\"A tasty flavorful appetizer, or great as a meal that uses lots of wonderful Asian flavors!  You can also easily substitute for the ingredients and use leftovers too such as corn instead of onions, leftover salmon (BBQ'd, broiled or baked) instead of fresh or canned - and they still turn out great!  A plus crowd pleaser!\"",
    "ins": "Heat the vegetable oil and sesame oil in a large skillet over medium heat. Add the green onion and garlic, and cook until tender. Stir in the miso paste and sake until blended. Bring to a simmer then stir in the cream and lime juice. Return to a simmer and cook until thickened, about 7 minutes. Remove from heat and set aside.\nIn a medium bowl, stir together the bread crumbs, salmon, onion, and cilantro. IN a small bowl, whisk together the egg, soy sauce and water using a fork. Stir about half of this into the salmon mixture, and if it seems dry, stir in a little more until the salmon mixture will stick together in patties.\nHeat the oil in a large skillet over medium-high heat. Form the salmon mixture into 2 inch patties for appetizers, or 4 inch patties for a main dish. Fry patties for about 4 minutes per side, or until golden brown. Serve with the sauce drizzled over, or separately for dipping.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "41378.jpg",
    "o": "",
    "st": "allrecipes"
}