{
    "id": 8459,
    "old_rating": "4.74341",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 eggs",
        "1 cup white sugar",
        "2/3 cup canned pumpkin",
        "3/4 cup all-purpose flour",
        "1/2 teaspoon ground cinnamon",
        "1 teaspoon baking soda",
        "1/2 cup chopped walnuts",
        "confectioners' sugar for dusting",
        "1 cup confectioners' sugar",
        "3/4 teaspoon vanilla extract",
        "2 tablespoons butter, softened",
        "8 ounces cream cheese"
    ],
    "nut": [
        "Calories > 203 kcal",
        "Carbs > 26.3 g",
        "Cholesterol > 54 mg",
        "Fat > 9.8 g",
        "Protein > 3.5 g",
        "Sodium > 169 mg"
    ],
    "n": "Pumpkin Roll II",
    "a": "BUCHKO",
    "r": "0",
    "s": 16,
    "des": "\"This is the best pumpkin roll I've ever tasted. Everyone who tastes it always ask for the recipe. Note: One 29 ounce can of pumpkin will make 5 pumpkin rolls. Dust with additional confectioners' sugar, if desired.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease a 15x10x1 inch baking pan and line with parchment paper. Grease and flour the paper.\nIn a large bowl, beat eggs on high for five minutes. Gradually add white sugar and pumpkin. Add flour, cinnamon, and baking soda. Spread batter evenly in pan. Sprinkle walnuts evenly on top.\nBake at 375 degrees F (190 degrees C) for 15 minutes or until cake springs back when lightly touched. Immediately turn out onto a linen towel dusted with confectioners sugar. Peel off paper and roll cake up in the towel, starting with the short end. Cool.\nTo Make Filling: Mix confectioners sugar, vanilla, butter or margarine, and cream cheese together till smooth.\nCarefully unroll the cake. Spread filling over cake to within 1 inch of edges. Roll up again. Cover and chill until serving. Dust with additional confectioners' sugar, if desired.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "2 h",
    "i": "4204151.jpg",
    "o": "4204151.jpg,4106589.jpg,2869097.jpg,2861245.jpg,2617204.jpg,1889910.jpg",
    "st": "allrecipes"
}