{
    "id": 84594,
    "old_rating": "3.71429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (15 ounce) package pastry for a 9 inch double crust pie",
        "4 cups chopped fresh rhubarb",
        "3 tablespoons all-purpose flour",
        "2 cups white sugar",
        "4 egg yolks, beaten",
        "1 cup half-and-half cream",
        "1/2 teaspoon almond extract",
        "1 tablespoon half-and-half cream",
        "1 tablespoon white sugar"
    ],
    "nut": [
        "Calories > 538 kcal",
        "Carbs > 80.4 g",
        "Cholesterol > 114 mg",
        "Fat > 22.2 g",
        "Protein > 6.1 g",
        "Sodium > 273 mg"
    ],
    "n": "Rockin' Rhubarb Pie",
    "a": "CALLALILLIE",
    "r": "0",
    "s": 8,
    "des": "\"This is a two-crust, custard-type rhubarb pie with a hint of almond.  Serve warm with vanilla ice cream, and be prepared for ecstasy!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C).\nPlace one of the pie crusts into the bottom of a 10 inch pie plate or 9 inch deep dish pie plate. Put the rhubarb in the pie shell. In a small bowl, stir together the flour and 2 cups of sugar. In a medium bowl, whisk together the egg yolks, 1 cup half-and-half, and almond extract. Stir in the sugar and flour until well blended.\nPour the sauce over the rhubarb - it may not all fit into the pan, so just discard any remaining mixture. Place the top pie crust over the filling, seal the edges and flute. Brush the top crust with the remaining half-and-half, and sprinkle with remaining sugar. Cut  a few small slits in the top crust for ventilation. Place the pie onto a cookie sheet to catch any drips.\nBake for 45 minutes in the preheated oven, or until puffed up in the middle and golden brown on the top. A knife should easily pierce the rhubarb. Cool until just warm before serving to allow the custard to set.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}