{
    "id": 84921,
    "old_rating": "4.52941",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tablespoons vegetable oil",
        "1 1/2 pounds cubed pork stew meat",
        "2 tablespoons all-purpose flour",
        "1 (4.5 ounce) can diced green chile peppers, drained",
        "1/2 (3.5 ounce) can chopped jalapeno peppers",
        "1/2 medium onion, chopped",
        "5 tablespoons tomato sauce",
        "3 1/2 cups water",
        "onion salt to taste",
        "garlic salt to taste",
        "salt and black pepper to taste"
    ],
    "nut": [
        "Calories > 308 kcal",
        "Carbs > 5 g",
        "Cholesterol > 68 mg",
        "Fat > 21.5 g",
        "Protein > 22.5 g",
        "Sodium > 578 mg"
    ],
    "n": "Pork Green Chile",
    "a": "DEONNE1",
    "r": "0",
    "s": 6,
    "des": "\"A simple and, in my opinion, authentic version, this recipe comes down at least 3 or 4 generations of my family. You will know it's done when the sauce has a medium thickness. Remember, the longer it cooks, the better it will taste. You can serve smothered over burritos or with warm tortillas, beans and/or fried potatoes. Also delicious with fried eggs (Huevos rancheros). Substitute 4 or 5 chopped roasted chiles for green chiles and jalapenos if you prefer.\"",
    "ins": "Heat oil in a large cast iron skillet over medium-high heat. Stir in cubed pork, and cook until nicely browned and cooked through, about 15 minutes. Remove skillet from heat, and allow to cool briefly.\nSprinkle flour over pork. With a wooden spoon, stir pork to coat, scraping the bottom of the skillet to loosen browned bits. Add chile peppers, jalapenos, and onions. Stir in tomato sauce and water. Season to taste with onion salt, garlic salt, and salt and pepper.\nReturn skillet to medium heat. Bring to a simmer, cover, and cook 30 minutes, stirring occasionally. Remove cover, and cook 10 minutes more.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "1950734.jpg",
    "o": "",
    "st": "allrecipes"
}