{
    "id": 85031,
    "old_rating": "4.73077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "24 fresh green chile peppers",
        "1/4 cup olive oil, or as needed",
        "3 cooked, shredded chicken breast halves",
        "4 cups shredded Cheddar cheese, divided",
        "3 cups enchilada sauce, divided",
        "1 (2.25 ounce) can black olives",
        "1 (8 ounce) container sour cream"
    ],
    "nut": [
        "Calories > 423 kcal",
        "Carbs > 12.7 g",
        "Cholesterol > 98 mg",
        "Fat > 33 g",
        "Protein > 21.2 g",
        "Sodium > 373 mg"
    ],
    "n": "Chicken Stuffed Chiles",
    "a": "PALS",
    "r": "0",
    "s": 12,
    "des": "\"You can make this as spicy and hot or as mild as you like depending on the enchilada sauce you use. We like it mild, so I use the kind in an envelope and mix it with tomato sauce and some extra chicken broth. Others might use the can sauce, or use the envelope kind but no added chicken broth, or make your own. Serve with Spanish rice and a salad to complete the meal.\"",
    "ins": "Preheat the oven broiler. Brush peppers with oil and arrange on a baking sheet. Broil peppers 5 minutes, turning occasionally, until scorched on all sides. Remove from heat, cool slightly, and peel. Reduce oven temperature to 350 degrees F (175 degrees C).\nIn a bowl, mix the shredded chicken, 2 cups cheese, and 1 cup enchilada sauce. Cut a slit in each roasted chile pepper, and stuff each with about 1 tablespoon of the chicken mixture. Arrange stuffed chiles in a single layer in a large baking dish. Cover with the remaining enchilada sauce.\nBake 35 minutes in the 350 degrees F (175 degrees C) oven, until bubbly. Sprinkle with remaining cheese, and continue baking 5 minutes, or until cheese is melted. Garnish with olives and sour cream to serve.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "2707865.jpg",
    "o": "",
    "st": "allrecipes"
}