{
    "id": 85185,
    "old_rating": "4.52263",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 ounces chorizo sausage",
        "8 (6 inch) corn tortillas",
        "6 eggs",
        "1/4 cup milk",
        "1/2 teaspoon pepper",
        "1/2 teaspoon salt",
        "1 cup shredded Monterey Jack cheese",
        "1 dash hot pepper sauce (e.g. Tabascoâ„¢), or to taste",
        "1/2 cup salsa"
    ],
    "nut": [
        "Calories > 537 kcal",
        "Carbs > 27.7 g",
        "Cholesterol > 343 mg",
        "Fat > 34.1 g",
        "Protein > 30.6 g",
        "Sodium > 1298 mg"
    ],
    "n": "Authentic Mexican Breakfast Tacos",
    "a": "BEARNESTA",
    "r": "0",
    "s": 4,
    "des": "\"Quick Easy and Delicious!  I learned this recipe from many years of eating with the Mexican cooks at my restaurant. They like to sneak in breakfast before we open.  I've grown to LOVE this breakfast.  If you like spicy food, you will love this.\"",
    "ins": "Crumble the sausage into a skillet over medium-high heat. Cook and stir until evenly brown. Set aside.\nHeat one skillet over medium heat, and heat another skillet over high heat. The skillet over high heat is for warming tortillas. In a medium bowl, whisk together the eggs, milk, salt and pepper. Spray the medium heat skillet with some cooking spray, and pour in the eggs. Cook and stir until almost firm. Add the sausage, and continue cooking and stirring until firm.\nMeanwhile, warm tortillas for about 45 seconds per side in the other skillet, so they are hot and crispy on the edges, but still pliable.\nSprinkle a little shredded cheese onto each tortilla while it is still hot. Top with some of the scrambled egg and sausage, then add hot pepper sauce and salsa to your liking.",
    "pt": "5 m",
    "ct": "10 m",
    "tt": "15 m",
    "i": "4516130.jpg",
    "o": "4516130.jpg,4130259.jpg,2566491.jpg,2526580.jpg,2275481.jpg,1321950.jpg",
    "st": "allrecipes"
}