{
    "id": 85313,
    "old_rating": "4.4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter",
        "2 cloves garlic, crushed",
        "2 large onions, chopped",
        "1 1/2 cups chopped green bell pepper",
        "1/2 pound sliced fresh mushrooms",
        "1/4 cup all-purpose flour",
        "1/2 cup dry white wine",
        "1 cup half-and-half cream",
        "1 pound jalapeno cheese food (such as VelveetaÂ® Mexican Mild), shredded",
        "2 (16 ounce) packages cooked and peeled whole crawfish tails",
        "1/2 teaspoon Creole seasoning (such as Tony Chachere'sÂ®)",
        "salt and ground black pepper to taste",
        "1/2 cup Parmesan cheese, or to taste",
        "1 (16 ounce) package fettuccini pasta"
    ],
    "nut": [
        "Calories > 511 kcal",
        "Carbs > 38.3 g",
        "Cholesterol > 159 mg",
        "Fat > 28.5 g",
        "Protein > 26.9 g",
        "Sodium > 726 mg"
    ],
    "n": "Crawfish Fettuccine",
    "a": "SELINAG",
    "r": "0",
    "s": 12,
    "des": "\"I LOVE CRAWFISH!!!!  If you love crawfish and creamy pasta meals - you'll love this recipe. I made it for my husband and I ended up making it for his crew at work too!\"",
    "ins": "Preheat an oven to 350 degrees F (175 degrees C).\nMelt the butter in a large pot over medium-high heat. Stir in the garlic, onion, bell pepper, mushrooms, and flour. Cook and stir until the onion has softened and turned translucent, about 8 minutes. Pour in the wine, half-and-half, and jalapeno cheese food. Bring to a simmer; add the crawfish tails and reduce heat to medium-low. Cover and simmer 15 minutes. Season with Creole seasoning, salt, and pepper. Pour the mixture into a 9x13 inch casserole dish, and sprinkle with Parmesan cheese.\nBake in the preheated oven until the cheese has melted and the dish is bubbly, about 20 minutes.\nWhile the crawfish is baking, fill a large pot with lightly-salted water and bring to a rolling boil. Stir in the fettuccini and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink. Serve the crawfish over the hot pasta.",
    "pt": "25 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "971584.jpg",
    "o": "",
    "st": "allrecipes"
}