{
    "id": 85635,
    "old_rating": "4.26158",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil",
        "3/4 cup chopped onion",
        "4 cloves garlic, minced",
        "2 (16 ounce) cans crushed tomatoes",
        "3 (6 ounce) cans tomato paste",
        "1 cup water",
        "1/2 cup sugar",
        "1/4 cup chopped fresh oregano, divided",
        "1 dried bay leaf",
        "salt and pepper to taste",
        "1 pound ground round",
        "1/2 cup Italian seasoned bread crumbs",
        "1/4 cup chopped fresh parsley",
        "2 eggs, lightly beaten",
        "1/2 cup grated Parmesan cheese",
        "1 (16 ounce) package uncooked spaghetti"
    ],
    "nut": [
        "Calories > 572 kcal",
        "Carbs > 80.1 g",
        "Cholesterol > 87 mg",
        "Fat > 17 g",
        "Protein > 27.7 g",
        "Sodium > 1177 mg"
    ],
    "n": "Jenn's Out Of This World Spaghetti and Meatballs",
    "a": "JENNGOETZ",
    "r": "0",
    "s": 8,
    "des": "\"This authentic spaghetti and meatballs recipe is made with fresh oregano and parsley. Because the meatballs are cooked in the sauce, they are tender and savory.\"",
    "ins": "Heat the olive oil in a large saucepan over medium heat, and cook the onion until lightly brown. Mix in 2 cloves garlic, and cook 1 minute. Stir in crushed tomatoes, tomato paste, water, sugar, 1/2 the oregano, and bay leaf. Season with salt and pepper. Bring to a boil, reduce heat to low, and simmer while preparing meatballs.\nIn a bowl, mix the ground round, bread crumbs, remaining oregano, remaining garlic, parsley, eggs, and cheese. Season with salt and pepper. Roll into 1 inch balls, and drop into the sauce. Cook 40 minutes in the sauce, or until internal temperature of meatballs reaches a minimum of 160 degrees F (72 degrees C).\nBring a large pot of lightly salted water to a boil, and stir in the spaghetti. Cook 8 to 10 minutes, until al dente, and drain. Serve the meatballs and sauce over the cooked spaghetti.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "754675.jpg",
    "o": "4458375.jpg,3151109.jpg,2083395.jpg,1129691.jpg,1124495.jpg,1073999.jpg",
    "st": "allrecipes"
}