{
    "id": 86019,
    "old_rating": "4.55224",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound farfalle (bow tie) pasta",
        "4 tablespoons olive oil, divided",
        "1 egg",
        "2 tablespoons water",
        "1 cup Italian seasoned bread crumbs",
        "1 pound skinless, boneless chicken breast halves - cut into bite-size pieces",
        "1 clove garlic, minced",
        "1 onion, chopped",
        "1/2 green bell pepper, chopped",
        "1/2 red bell pepper, chopped",
        "1/2 yellow bell pepper, chopped",
        "1/2 cup chopped fresh mushrooms",
        "1 cup Greek salad dressing",
        "1/2 pint grape tomatoes",
        "1/2 cup grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 552 kcal",
        "Carbs > 57.8 g",
        "Cholesterol > 62 mg",
        "Fat > 23.8 g",
        "Protein > 26.2 g",
        "Sodium > 565 mg"
    ],
    "n": "Chicken Pasta - Shannon Style",
    "a": "SPHIPPS44",
    "r": "0",
    "s": 8,
    "des": "\"Everyone I make this for just raves about it. My boyfriend even eats it cold the next day and says it is even better than the night before!\"",
    "ins": "Bring a large pot of lightly salted water to a boil, and stir in the pasta. Cook 8 to 10 minutes, until al dente, and drain.\nHeat 3 tablespoons olive oil in a skillet over medium heat. Whisk together the egg and water in a bowl. Place bread crumbs in a separate bowl. Dip chicken pieces first into the egg mixture, then into the bread crumbs to coat. Place coated chicken pieces in the skillet, and cook 5 minutes on each side, or until coating is golden brown and juices run clear. Drain on paper towels.\nHeat remaining 1 tablespoon olive oil in a separate skillet over medium heat. Mix in garlic, onion, green bell pepper, red bell pepper, yellow bell pepper, and mushrooms. Cook and stir until vegetables are tender.\nIn a large bowl, toss the pasta, chicken, and vegetables with the Greek dressing. Serve topped with tomatoes and Parmesan cheese.",
    "pt": "15 m",
    "ct": "20 m",
    "tt": "35 m",
    "i": "29494.jpg",
    "o": "",
    "st": "allrecipes"
}