{
    "id": 86093,
    "old_rating": "4.375",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 skinless, boneless chicken breast halves",
        "paprika to taste",
        "seasoned salt to taste",
        "ground black pepper to taste",
        "1 fresh pineapple - peeled, cored and cubed",
        "1 orange, sliced",
        "1 lemon, sliced",
        "1 red bell pepper, diced",
        "3 (6.8 ounce) packages Spanish-style rice mix",
        "2 (11 ounce) cans black bean soup, undiluted"
    ],
    "nut": [
        "Calories > 478 kcal",
        "Carbs > 75.8 g",
        "Cholesterol > 67 mg",
        "Fat > 4.6 g",
        "Protein > 35.2 g",
        "Sodium > 2130 mg"
    ],
    "n": "Kat's Island Chicken",
    "a": "KRAZYKAT82",
    "r": "0",
    "s": 8,
    "des": "\"If you've ever been to the Bahamas you'll love this dish.... It takes you back there. It's EASY, filling, well balanced, and good for a larger family or small gathering.\"",
    "ins": "Preheat oven to 375  degrees F (190 degrees C). Lightly grease a medium glass baking dish.\nPlace the chicken breasts in the prepared baking dish, and season with paprika, seasoned salt, and pepper. Arrange the pineapple, orange, lemon, and red bell pepper around the chicken, reserving a few slices of each for serving.\nBake chicken uncovered 20 minutes in the preheated oven. Turn, season again with paprika, seasoned salt, and pepper, and continue baking 10 minutes, or until chicken juices run clear.\nWhile chicken is baking, prepare the Spanish rice according to package directions and heat the undiluted black bean soup in a pot over medium heat. Serve each chicken breast and some of the cooked fruit and red bell pepper over equal portions of the Spanish rice, and topped with a few spoonfuls black bean soup. Arrange the reserved uncooked fruit and pepper slices around the rice.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "407866.jpg",
    "o": "",
    "st": "allrecipes"
}