{
    "id": 86162,
    "old_rating": "3.57143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/2 tablespoons vegetable oil",
        "1 pod cardamom",
        "1 clove",
        "1 cinnamon stick",
        "4 medium onions, chopped",
        "3 tablespoons chopped fresh garlic",
        "1/4 teaspoon chopped fresh ginger",
        "1 pound boneless skinless chicken breasts, cut into cubes",
        "chili powder to taste",
        "1 1/2 medium tomatoes, chopped",
        "16 ounces plain yogurt",
        "3 tablespoons water",
        "lemon juice, to taste",
        "3 cups white rice",
        "1 teaspoon butter",
        "salt to taste",
        "1 bunch fresh mint, chopped",
        "1 bunch chopped cilantro"
    ],
    "nut": [
        "Calories > 860 kcal",
        "Carbs > 135.4 g",
        "Cholesterol > 75 mg",
        "Fat > 14.1 g",
        "Protein > 44.9 g",
        "Sodium > 185 mg"
    ],
    "n": "Authentic South Indian Biryani",
    "a": "su",
    "r": "0",
    "s": 4,
    "des": "\"The deep flavors and piquant aromas of southern Indian cooking come to life in this recipe. Chicken simmers in a yogurt and tomato sauce rich with herbs and spices. This recipe calls for chicken, but you can use whatever meat you prefer. It can be a vegetarian dish, too. Just add vegetables instead of meat.\"",
    "ins": "Preheat  oven to 400 degrees F (200 degrees C).\nHeat oil in a large oven-proof pot over medium heat. Add cardamom, clove, and cinnamon stick. Stir in chopped onions, and fry until golden brown. Stir in garlic and ginger. Stir in chicken pieces, and fry about 3 minutes. Stir in chili powder, and cook several minutes. Stir in tomatoes, and cook about 5 minutes. Mix yogurt with 3 tablespoons water and lemon juice; stir into sauce.\nCover pot, and bake in a preheated oven until the sauce is somewhat thickened and concentrated, about 15 minutes.\nMeanwhile, cook rice in enough salted water to cover. Bring to a boil, and cook until it is half cooked, about 7 minutes. Drain rice, and stir into chicken and sauce. Stir in butter, season to taste with salt, cover pot, and bake 1 hour. Stir in mint and cilantro immediately before serving.",
    "pt": "15 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "762883.jpg",
    "o": "",
    "st": "allrecipes"
}