{
    "id": 8620,
    "old_rating": "4.59804",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 skinless, boneless chicken breasts",
        "2 green chile peppers, cut into 8 strips",
        "1 (8 ounce) package Monterey Jack cheese, cut into 8 slices",
        "1/2 cup butter, melted",
        "1 cup Italian-style seasoned bread crumbs",
        "1 1/2 tablespoons grated Parmesan cheese",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ground black pepper"
    ],
    "nut": [
        "Calories > 400 kcal",
        "Carbs > 11.4 g",
        "Cholesterol > 125 mg",
        "Fat > 22.5 g",
        "Protein > 36.8 g",
        "Sodium > 684 mg"
    ],
    "n": "Mexican Chicken Kiev",
    "a": "Erin Clifton",
    "r": "0",
    "s": 8,
    "des": "\"This is a wonderful slightly spicy version of the classic Chicken Kiev. The kick of green chilies will make your family want more! You have to use sliced green chilies, not chopped.\"",
    "ins": "Place 1 chicken breast between two sheets of wax paper. Working from the center to the edges, pound with a meat mallet until flat and rectangular shaped. Repeat with remaining breasts.\nWrap the green chili strips around the cheese, then wrap the flattened chicken breasts around the chili and cheese. Secure with toothpicks or uncooked spaghetti noodles.\nCombine the bread crumbs, parmesan cheese, salt, cumin and pepper.\nRoll the secured chicken pieces in the melted butter and then in the bread crumb mixture. Place chicken breasts in a 13x9 inch baking dish; don't let them crowd. Drizzle the remaining butter over all eight of the breasts. Refrigerate for 1 hour, or freeze to bake later (baking time will be increased by about 5 to 10 minutes)\nBake in a preheated 400 degrees F (200 degrees C) oven for 25 to 30 minutes, or until chicken is no longer pink and juices run clear.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "2 h",
    "i": "399418.jpg",
    "o": "",
    "st": "allrecipes"
}