{
    "id": 86347,
    "old_rating": "4.24742",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds ground chuck",
        "2 tablespoons chili powder",
        "2 tablespoons paprika",
        "1 1/2 teaspoons cumin",
        "1 teaspoon salt",
        "1/2 teaspoon garlic powder",
        "2 cloves garlic, chopped",
        "1/2 medium green bell pepper, chopped",
        "1/2 medium onion, chopped",
        "12 (6 inch) corn tortillas",
        "12 ounces queso asadero (white Mexican cheese)",
        "1 (8 ounce) container sour cream",
        "1 large tomato, diced",
        "2 cups shredded lettuce"
    ],
    "nut": [
        "Calories > 629 kcal",
        "Carbs > 33 g",
        "Cholesterol > 128 mg",
        "Fat > 39.1 g",
        "Protein > 38.4 g",
        "Sodium > 868 mg"
    ],
    "n": "Tacos De Matamoros",
    "a": "RHONDA35",
    "r": "0",
    "s": 6,
    "des": "\"A staple dish in Matamoros, Mexico, this simple recipe starts with ground beef mixed with spices that you already have in your kitchen and turns into a great family dinner! Perfect to 'make ahead' on busy days. Serve with warm corn or flour tortillas, Spanish rice, and beans-a-la-charra.\"",
    "ins": "Place the ground chuck in a large skillet, and season with chili powder, paprika, cumin, salt, garlic powder, and garlic. Pour in enough water to cover. Bring to a boil. Reduce heat to low, and simmer 1 hour. Add more water as necessary during cook time, and break the meat into small pieces.\nMix the bell pepper and onion into the skillet, and continue to simmer 30 minutes. Drain and reserve juices. Skim the fat off the juices(or, if not preparing the tacos right away, place juices in the freezer until fat may be easily removed from the top). Mix 5 tablespoons of the remaining juices back into the skillet with the beef, and cook until heated through.\nServe the beef on the tortillas. Garnish with queso asadero, sour cream, tomato, and lettuce.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "2 h",
    "i": "526870.jpg",
    "o": "4039325.jpg,2463212.jpg,2073869.jpg,1461141.jpg,875252.jpg,712019.jpg",
    "st": "allrecipes"
}