{
    "id": 8638,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (3 pound) whole chicken",
        "1/2 cup olive oil",
        "1 cup red wine",
        "1 teaspoon salt",
        "1 leek, bulb only, chopped",
        "1/4 cup chopped fresh dill weed",
        "1/3 cup saturei (dried rose petals)",
        "2 tablespoons ground coriander seed",
        "1/2 teaspoon ground black pepper",
        "2 tablespoons olive oil",
        "salt to taste",
        "1/2 cup syrup from canned figs"
    ],
    "nut": [
        "Calories > 1137 kcal",
        "Carbs > 14 g",
        "Cholesterol > 255 mg",
        "Fat > 85.7 g",
        "Protein > 64.4 g",
        "Sodium > 829 mg"
    ],
    "n": "Pullum Frontonianum (Apicus Chicken)",
    "a": "GODGIFU",
    "r": "0",
    "s": 4,
    "des": "\"When I was preparing this dish, I was certain I would never do it again because I disliked handling the chicken so much. After tasting it, however, I'm certain I'm going to make it again, as it is some of the best chicken I've ever had. This is an ancient Roman recipe from the book of Apicus, so some ingredients are hard to find or I am uncertain as to what they actually are.  For Saturei I used dried rose petals, for Liquamen I used 1 cup wine plus 1 tbs salt, and instead of Defritum (fig syrup), you can use sweet and tangy steak sauce.\"",
    "ins": "Mix together 1/2 cup olive oil, wine mixed with salt, chopped leek, dill, rose petals, coriander, and black pepper.\nHeat 2 tablespoons olive oil in a large pan.  Fry whole chicken over medium heat.  Add about half of the seasoning mixture, and continue to fry until chicken just starts to change color.\nPlace chicken in a baking dish large enough to hold it along with the seasoning mixture--both what was in the pan and what you didn't use.  Rub the bird with the mixture for a minute or so.\nBake at 425 degrees F (220 degrees C) for 1 hour, occasionally basting with the seasoning mixture. The chicken will look almost burnt when done. Moisten a plate with fig syrup, place chicken on it.  Season with salt and pepper.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}