{
    "id": 86515,
    "old_rating": "4.53962",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (12 ounce) package penne pasta",
        "1 yellow squash, chopped",
        "1 zucchini, chopped",
        "1 carrot, cut into matchsticks",
        "1/2 red bell peppers, cut into matchsticks",
        "1/2 pint grape tomatoes",
        "1 cup fresh green beans, trimmed and cut into 1 inch pieces",
        "5 spears asparagus, trimmed and cut into 1 inch pieces",
        "1/4 cup olive oil, divided",
        "1 tablespoon Italian seasoning",
        "1/2 tablespoon lemon juice",
        "1/4 teaspoon salt",
        "1/4 teaspoon coarsely ground black pepper",
        "1 tablespoon butter",
        "1/4 large yellow onion, thinly sliced",
        "2 cloves garlic, thinly sliced",
        "2 teaspoons lemon zest",
        "1/3 cup chopped fresh basil leaves",
        "1/3 cup chopped fresh parsley",
        "3 tablespoons balsamic vinegar",
        "1/2 cup grated Romano cheese"
    ],
    "nut": [
        "Calories > 406 kcal",
        "Carbs > 54.4 g",
        "Cholesterol > 15 mg",
        "Fat > 15.4 g",
        "Protein > 13.6 g",
        "Sodium > 252 mg"
    ],
    "n": "No-Cream Pasta Primavera",
    "a": "amanda1432",
    "r": "0",
    "s": 6,
    "des": "\"Spring veggies benefit from a quick roasting in olive oil and herbs before being tossed with penne. No cream here, just the fresh flavors of olive oil, balsamic vinegar, and lemon. A beautiful dish.\"",
    "ins": "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil.\nBring a large pot of lightly salted water to a boil. Add penne pasta and cook until tender yet firm to the bite, 10 to 12 minutes; drain.\nToss squash, zucchini, carrot, red bell pepper, tomatoes, green beans, and asparagus together in a bowl with 2 tablespoons olive oil, salt, pepper, lemon juice, and Italian seasoning. Arrange vegetables on the lined baking sheet.\nRoast vegetables in preheated oven until tender, about 15 minutes.\nHeat remaining olive oil and butter in a large skillet. Cook onion and garlic in hot oil until tender, 5 to 7 minutes. Mix cooked pasta, lemon zest, basil, parsley, and balsamic vinegar into the onion mixture. Gently toss and cook until heated through, 3 to 5 minutes. Remove from heat and transfer to a large bowl. Toss with roasted vegetables and sprinkle with Romano cheese.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "396567.jpg",
    "o": "4531728.jpg,4527344.jpg,4526141.jpg,4523803.jpg,4502222.jpg,4497891.jpg",
    "st": "allrecipes"
}