{
    "id": 86529,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (4 ounce) salmon fillets",
        "2 tablespoons chopped fresh tarragon",
        "1 dash red wine",
        "4 tiger prawns, peeled and deveined",
        "1 (8 ounce) package uncooked spaghetti",
        "8 spears asparagus, trimmed and cut into 1 inch pieces",
        "1 tablespoon vegetable oil",
        "1/2 cup sliced fresh mushrooms",
        "1/4 cup chopped onion",
        "2 cloves garlic, minced",
        "1/2 cup red wine",
        "1/4 cup whipping cream",
        "2 tablespoons grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 458 kcal",
        "Carbs > 46.6 g",
        "Cholesterol > 74 mg",
        "Fat > 16.9 g",
        "Protein > 23.6 g",
        "Sodium > 84 mg"
    ],
    "n": "Salmon and Prawn Spaghetti",
    "a": "CLEM1",
    "r": "0",
    "s": 4,
    "des": "\"This is a lovely salmon spaghetti dish made with red wine, cream and garlic. It tastes like it came from a restaurant but it's really simple and tastes stunning.\"",
    "ins": "Preheat the oven to 400 degrees F (200 degrees C). Place the salmon into a baking dish, and season with the tarragon and a dash of red wine. Cover with a lid or aluminum foil.\nBake the salmon for about 5 minutes, then remove the lid, and add the prawns to the dish. Cover, and return to the oven. Cook for 10 minutes, or until salmon flakes with a fork, and prawns are pink.\nMeanwhile bring a large pot of lightly salted water to a boil. Add the spaghetti, and cook for 7 minutes, or until tender. After the first 2 minutes, add the asparagus spears they will be done at the same time.\nAs you wait for the pasta, heat the oil in a large skillet over medium-high heat. Add the onion and mushrooms; cook and stir for a few minutes, then add the garlic. Cook until garlic is fragrant, then add the wine. Cook and stir to remove any bits stuck to the pan, then reduce the heat to low and stir in the cream.\nDrain the spaghetti and asparagus, and mix into the skillet with the cream sauce. Flake the salmon and mix it in too. Pour onto a serving dish, and place the prawns on top. Garnish with grated Parmesan cheese, and serve.",
    "pt": "10 m",
    "ct": "15 m",
    "tt": "25 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}