{
    "id": 86543,
    "old_rating": "4.59091",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 medium onion, chopped",
        "3 cloves garlic, minced",
        "4 tablespoons olive oil",
        "1 pound Portuguese chourico, broken into large chunks",
        "2 (15 ounce) cans kidney beans, drained",
        "1 (15 ounce) can garbanzo beans, drained",
        "5 Yukon Gold potatoes, cubed",
        "2 pork chops",
        "salt and pepper",
        "3 tablespoons Pimenta Moida (Portuguese hot chopped peppers)",
        "1 bunch kale - washed, dried, and shredded",
        "1/2 head savoy cabbage, shredded"
    ],
    "nut": [
        "Calories > 348 kcal",
        "Carbs > 33 g",
        "Cholesterol > 36 mg",
        "Fat > 17.1 g",
        "Protein > 17.3 g",
        "Sodium > 618 mg"
    ],
    "n": "Kale Soup",
    "a": "Scotty",
    "r": "0",
    "s": 12,
    "des": "\"I merged the best of two family recipes, then fiddled a bit.  Pretty easy.  Very Spicy if you use hot Portuguese sausage.  Both the sausage(chourico or linguica) and jarred peppers (Pimenta Moida) are available online if you don't have a Portuguese market in your town.  I prefer linguica for flavoring soups because is has just a little more fat.  If you are trying to limit the fat, stick with chourico.\"",
    "ins": "In a large soup pot, cook onion and garlic in olive oil over medium heat until soft. Mix in choirico, beans, and potatoes, and then add pork chops to the pot. Season with salt and pepper, and add enough water to the pan to cover all of the ingredients. Bring to a boil, then reduce heat, and simmer until potatoes are tender.\nOnce potatoes are tender, taste soup,  add Pimenta Moida and more salt and pepper.  Stir in kale and cabbage, and increase heat  to gently boil.  Kale only needs about 5 minutes.  You may add some water if the soup got too thick, I like this soup on the brothy side.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "4301916.jpg",
    "o": "4301916.jpg,3636269.jpg,1097829.jpg,761503.jpg,582026.jpg,285329.jpg",
    "st": "allrecipes"
}