{
    "id": 86593,
    "old_rating": "4.39765",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "1 (4 pound) whole chicken",
        "salt and pepper to taste",
        "1 teaspoon dried thyme",
        "2 carrots, cut in chunks",
        "paprika to taste",
        "8 slices bacon",
        "2 cups beef broth"
    ],
    "nut": [
        "Calories > 495 kcal",
        "Carbs > 2.4 g",
        "Cholesterol > 153 mg",
        "Fat > 32 g",
        "Protein > 46.6 g",
        "Sodium > 713 mg"
    ],
    "n": "Bacon Roasted Chicken",
    "a": "RioChick",
    "r": "0",
    "s": 6,
    "des": "\"My family loves this chicken!  It is always so tender and moist and is a perfect Sunday dinner.  The bacon helps to 'baste' the chicken while it cooks.  Recipe can be adjusted to any size whole chicken.\"",
    "ins": "Preheat the oven to 450 degrees F (220 degrees C).\nRub butter over the entire chicken. Season with salt, pepper and thyme. Place the carrots inside the cavity, and tie the legs together. Place the chicken breast side up in a roasting pan. Lay bacon strips across the top of the chicken, and secure with toothpicks. Sprinkle with paprika. Pour the beef broth into the roasting pan - do not pour over the bacon.\nRoast for 15 minutes in the preheated oven, the reduce the heat to 350 degrees F (175 degrees C). Baste with some of the broth. Continue to roast for 1 hour and 15 minutes, or until the internal temperature is 180 degrees F (82 degrees C) when taken in the thickest part of the thigh. Baste every 15 minutes with the broth.\nRemove the bacon and discard toothpicks. Roast the chicken for 15 more minutes to brown the skin. Transfer to a serving platter, and remove the ties. You may eat the bacon, but it is best to discard the carrots.",
    "pt": "30 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "10727.jpg",
    "o": "3264797.jpg,3154376.jpg,926156.jpg,871317.jpg,760051.jpg,760050.jpg",
    "st": "allrecipes"
}