{
    "id": 86751,
    "old_rating": "4.20833",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 large Granny Smith apples - peeled, cored and chopped",
        "2 tablespoons white sugar",
        "1/2 cup butter",
        "2 tablespoons white sugar",
        "1 egg",
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/4 cup custard powder",
        "3/4 cup white sugar",
        "3/4 cup butter",
        "1 1/4 cups all-purpose flour",
        "2 teaspoons ground cinnamon",
        "1/3 cup shredded coconut",
        "1/3 cup rolled oats"
    ],
    "nut": [
        "Calories > 660 kcal",
        "Carbs > 92.2 g",
        "Cholesterol > 100 mg",
        "Fat > 31 g",
        "Protein > 7.4 g",
        "Sodium > 286 mg"
    ],
    "n": "Best Apple Crumble",
    "a": "RANDOM804",
    "r": "0",
    "s": 8,
    "des": "\"Personal recipe... the way I make it in Australia. Apple crumble pie with coconut and rolled oats. Cut up and serve with hot or cold custard!\"",
    "ins": "Place apples in a large pot with enough water to cover, and bring to a boil. Reduce heat to low, and simmer 15 minutes, or until soft. Drain, and cool. Place in a large bowl, and toss with 2 tablespoons sugar to evenly coat.\nIn a large bowl, whip together the 1/2 cup butter and 2 tablespoons sugar until fluffy. Mix in the egg. In a separate bowl, mix 2 cups flour, baking powder, and custard powder. Mix dry ingredients into the bowl with butter and sugar. Press crust into the bottom and up the sides of a 9 inch springform pan.\nPreheat oven to 400 degrees F (200 degrees C).\nDrain apples and place into the crust. Cut together 3/4 cup sugar, 3/4 cup butter, 1 1/4 cups flour, and cinnamon. Mix in coconut and oats. Sprinkle over the apples.\nBake 1 hour in the preheated oven, until golden brown. Remove sides from pan and allow crumble to cool before serving.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "446505.jpg",
    "o": "",
    "st": "allrecipes"
}