{
    "id": 86782,
    "old_rating": "4.45161",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon vegetable oil",
        "2 pounds skinless, boneless chicken breast halves - cut into 1 inch pieces",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon chili powder",
        "1 (19 ounce) can enchilada sauce",
        "2 cups shredded iceberg lettuce",
        "2 cups shredded Colby cheese",
        "1 (12 ounce) package corn tortillas",
        "1 onion, chopped",
        "1/2 cup sour cream (optional)",
        "6 fried eggs (optional)"
    ],
    "nut": [
        "Calories > 670 kcal",
        "Carbs > 35.7 g",
        "Cholesterol > 321 mg",
        "Fat > 34.5 g",
        "Protein > 53.7 g",
        "Sodium > 707 mg"
    ],
    "n": "Enchiladas - New Mexico Style",
    "a": "PIPERCAT99",
    "r": "0",
    "s": 6,
    "des": "\"These enchiladas are stacked like pancakes, not baked in oven.  This is a family recipe handed down two generations. Quick, easy and definitely delicious. Use your favorite kind of meat in this dish - it also works well for leftover meat.\"",
    "ins": "Heat the oil in a large skillet over medium heat. Add the chicken pieces, and cook until browned. Season with cumin and chili powder.  Pour in the enchilada sauce, and simmer for about 15 minutes. Stir occasionally.\nIn a separate skillet over medium heat, warm the tortillas. Don't fry them, just warm them until they are flexible.\nTo assemble the enchiladas, dip a tortilla in the enchilada sauce, and place it on a serving plate. Spoon some of the meat and sauce on, then add shredded lettuce, cheese, onion and sour cream. Top with another tortilla that has been dipped in the sauce. You may repeat the layering as many times as you wish depending on your appetite. Make additional stacks for each person. Top stacks with a fried egg, if desired.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "3593223.jpg",
    "o": "",
    "st": "allrecipes"
}