{
    "id": 8681,
    "old_rating": "4.35734",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package uncooked farfalle pasta",
        "2 skinless, boneless chicken breasts",
        "1 pound hot Italian turkey sausage, casings removed",
        "1 tablespoon olive oil",
        "2 cloves garlic, sliced",
        "1 (14.5 ounce) can crushed tomatoes",
        "1/2 cup red wine",
        "2 tablespoons chopped fresh basil",
        "1 teaspoon dried rosemary"
    ],
    "nut": [
        "Calories > 382 kcal",
        "Carbs > 47.6 g",
        "Cholesterol > 51 mg",
        "Fat > 9.1 g",
        "Protein > 24 g",
        "Sodium > 526 mg"
    ],
    "n": "Chicken and Sausage with Bowties",
    "a": "Patricia Rogers",
    "r": "0",
    "s": 8,
    "des": "\"Necessity is the mother of invention. This recipe was created by me because I had a 1 1/2 hour commute to/from work. I have two teenage boys who require a hearty meal to sustain them for at least 1 hour (maybe less). This recipe can be varied; use pork italian sausage if you like (cook longer), veal or pork cutlets or cubes (be careful to cook pork products thoroughly). Serve as a sandwich, skip the pasta, mix with leftover cooked rice; add small green peas or broccoli. I doubt if anything you try will go wrong. Mangia!\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nWash chicken breasts and cut into large bite-size pieces. Cut sausages into large pieces. In a large, deep skillet over medium low heat, combine oil and garlic; and cook just enough to flavor the oil. Remove garlic from oil.\nAdd chicken and sausage to skillet and brown both lightly until they are opaque. Add the tomatoes and the wine. Bring to a boil and let simmer for 20 minutes. Season sauce mixture with basil, rosemary and salt and pepper to taste. Add cooked, drained pasta to the skillet mixture. Toss and serve.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "4532741.jpg",
    "o": "4532741.jpg,4517884.jpg,4470609.jpg,3913867.jpg,3046780.jpg,2987622.jpg",
    "st": "allrecipes"
}