{
    "id": 86828,
    "old_rating": "4.40924",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (6 ounce) containers plain yogurt",
        "2 teaspoons kosher salt",
        "1 teaspoon black pepper",
        "1/2 teaspoon ground cloves",
        "2 tablespoons freshly grated ginger",
        "3 cloves garlic, minced",
        "4 teaspoons paprika",
        "2 teaspoons ground cumin",
        "2 teaspoons ground cinnamon",
        "2 teaspoons ground coriander",
        "16 chicken thighs",
        "olive oil spray"
    ],
    "nut": [
        "Calories > 349 kcal",
        "Carbs > 5.4 g",
        "Cholesterol > 120 mg",
        "Fat > 20.5 g",
        "Protein > 34.2 g",
        "Sodium > 618 mg"
    ],
    "n": "Grilled Chicken Thighs Tandoori",
    "a": "DIANA F",
    "r": "0",
    "s": 8,
    "des": "\"Moist, luscious, and delicious. Just the right blend of spices make this chicken dish one of my most-requested. Great hot or cold. If using thighs with skin, you can put over direct medium heat for the last few minutes to crisp skin.\"",
    "ins": "In a medium bowl, stir together yogurt, salt, pepper, cloves, and ginger. Mix in garlic, paprika, cumin, cinnamon, and coriander. Set aside.\nRinse chicken under cold water, and pat dry with paper towels. Place chicken in a large resealable plastic bag. Pour yogurt mixture over chicken, press air out of bag, and seal. Turn the bag over several times to distribute marinade. Place bag in a bowl, and refrigerate 8 hours, or overnight, turning bag occasionally.\nPreheat an outdoor grill for direct medium heat.\nRemove chicken from bag, and discard marinade. With paper towels, wipe off excess marinade. Spray chicken pieces with olive oil spray.\nPlace chicken on the grill, and cook about 2 minutes. Turn, and cook 2 minutes more. Then arrange the chicken to receive indirect heat, and cook approximately 35 to 40 minutes, to an internal temperature of 180 degrees F.",
    "pt": "10 m",
    "ct": "45 m",
    "tt": "8 h ",
    "i": "122209.jpg",
    "o": "3476441.jpg,2317089.jpg,1877270.jpg,1130171.jpg,1067380.jpg,971148.jpg",
    "st": "allrecipes"
}