{
    "id": 8685,
    "old_rating": "4.51667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 skinless, boneless chicken breast halves",
        "1/2 cup all-purpose flour",
        "1 teaspoon poultry seasoning",
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "1/4 cup Marsala wine",
        "1 cup chopped portobello mushrooms",
        "1 cup chopped onion",
        "1 teaspoon dried rosemary",
        "4 slices mozzarella cheese"
    ],
    "nut": [
        "Calories > 492 kcal",
        "Carbs > 20.1 g",
        "Cholesterol > 162 mg",
        "Fat > 13.9 g",
        "Protein > 64 g",
        "Sodium > 352 mg"
    ],
    "n": "Richard's Chicken Breasts",
    "a": "CINDER",
    "r": "0",
    "s": 4,
    "des": "\"These are the plumpest, juiciest chicken breasts you ever ate. You can change the recipe by changing the sauces (for example, add fruit jams or jellies, add hot peppers, everything I like goes well with this recipe!)\"",
    "ins": "Season flour with poultry seasoning. Dredge the chicken breasts in the seasoned flour. Melt the butter with the oil in a medium skillet over medium-high heat, fry the chicken in the hot butter mixture for about 5 minutes each side, depending on the thickness. Remove the chicken and set aside (keep warm.)\nDeglaze pan with Marsala wine (deglazing is swirling or stirring a liquid in a pan to dissolve cooked food particles remaining on the bottom). Add the chopped mushrooms, chopped onions and rosemary. Saute for 5 minutes over high heat.\nReturn the chicken breasts to the skillet, baste with drippings, put cheese on the breasts and cook for another 2 1/2 minutes with the lid on tightly. Don't touch the lid! Remove from heat and let stand for 10 minutes, until the breasts cook through. Check the seasoning and adjust. You will have the plumpest, juiciest chicken breasts you can imagine!",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "100715.jpg",
    "o": "4483148.jpg,4020263.jpg,3669945.jpg,3379044.jpg,3252548.jpg,2783343.jpg",
    "st": "allrecipes"
}