{
    "id": 86853,
    "old_rating": "4.65217",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "8 cups quick-cooking oats",
        "1 cup oat bran",
        "1 cup unsweetened flaked coconut",
        "3/4 cup chopped almonds",
        "1/2 cup coconut milk",
        "1/4 cup virgin coconut oil",
        "1/4 cup vegetable oil",
        "1/2 cup barley malt syrup or maltose syrup",
        "1/2 cup honey",
        "1 teaspoon vanilla extract",
        "1/2 cup dried cranberries"
    ],
    "nut": [
        "Calories > 267 kcal",
        "Carbs > 36.4 g",
        "Cholesterol > 0 mg",
        "Fat > 12.3 g",
        "Protein > 6.1 g",
        "Sodium > 7 mg"
    ],
    "n": "Coconut Granola",
    "a": "Molly T.",
    "r": "0",
    "s": 24,
    "des": "\"A quick, easy, and very delicious recipe that can be eaten for cold cereal, topping on yogurt or even for a snack. Because it does a better job than honey, I use part maltose syrup (purchased at Asian markets) to help bind the ingredients together instead of using all honey. Virgin coconut oil has many healthy properties and enhances the taste of the granola, but if that cannot be found you can substitute it with any other oil. Enjoy!\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). In a large bowl, stir together the oats, oat bran, coconut and almonds. Divide between two large baking sheets, and spread into an even layer.\nBake for 7 or 8 minutes in the preheated oven, until lightly toasted. Allow to cool for a few minutes, then return to the large bowl.\nWhile the oats are toasting, combine the coconut milk, coconut oil, vegetable oil, malt syrup and honey in a saucepan. Cook over medium heat, stirring until it comes to a boil. Boil for 2 minutes. Remove from heat, and stir in the vanilla. Pour the syrup over the granola in the bowl, and stir until the dry ingredients are fully coated. Divide between the two baking sheets, and spread evenly.\nBake for 8 minutes in the preheated oven, or until fragrant and toasted. Cool in the pans, then mix in the dried cranberries. Store in an airtight container at room temperature.",
    "pt": "20 m",
    "ct": "16 m",
    "tt": "36 m",
    "i": "427593.jpg",
    "o": "",
    "st": "allrecipes"
}