{
    "id": 86937,
    "old_rating": "4.21739",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil, divided",
        "3 ounces pancetta bacon, diced",
        "1 medium onion, chopped",
        "1 clove garlic, minced",
        "1/4 teaspoon crushed red pepper flakes",
        "5 ounces fresh mushrooms, sliced",
        "1/2 cup dry white wine",
        "1/2 cup frozen green peas",
        "12 cherry tomatoes, halved",
        "5 ounces baby spinach",
        "2 (5 ounce) cans solid white tuna packed in water, drained",
        "1 tablespoon lemon juice",
        "salt and pepper to taste",
        "1 pound penne pasta",
        "freshly grated Parmesan cheese"
    ],
    "nut": [
        "Calories > 354 kcal",
        "Carbs > 47.1 g",
        "Cholesterol > 15 mg",
        "Fat > 9 g",
        "Protein > 19.7 g",
        "Sodium > 183 mg"
    ],
    "n": "Penne with Pancetta, Tuna, and White Wine",
    "a": "senoritapupnstuff",
    "r": "0",
    "s": 8,
    "des": "\"This is a fresh-tasting pasta dish loaded with good stuff! Pancetta, peas, mushrooms, spinach, flaked tuna, and cherry tomatoes are cooked in a bright-tasting white wine and lemon juice sauce. This recipe calls for canned tuna, but it is also a great way to use leftover tuna steaks.\"",
    "ins": "Heat 1 tablespoon olive oil in a skillet over medium heat. Stir in pancetta, and cook until browned. Remove to paper towels.\nReturn skillet to medium heat, and pour in 2 tablespoons olive oil. Stir in onion, garlic, and crushed red pepper. Cook until soft, about 5 minutes. Stir in mushrooms. Cook until they begin to give off juices.\nTurn the heat up to medium high, and pour in wine. Cook about 3 minutes.\nReduce heat to medium low. Stir in peas, cherry tomatoes, and spinach. Flake in tuna, drizzle in lemon juice, and season with salt and pepper. Stir to combine, and cook until warmed through.\nMeanwhile, bring a large pot of salted water to boil. Cook penne until al dente, about 8 to 10 minutes. Drain, and stir into tuna mixture. Top with freshly grated Parmesan.",
    "pt": "20 m",
    "ct": "25 m",
    "tt": "45 m",
    "i": "436449.jpg",
    "o": "",
    "st": "allrecipes"
}