{
    "id": 87013,
    "old_rating": "4.40041",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (2 pound) package frozen hash brown potatoes, thawed",
        "1 pound pork sausage",
        "1 small onion, diced",
        "5 eggs",
        "1/2 cup milk",
        "1/2 teaspoon onion powder",
        "1/8 teaspoon garlic powder",
        "salt and ground black pepper to taste",
        "12 ounces shredded Cheddar cheese"
    ],
    "nut": [
        "Calories > 616 kcal",
        "Carbs > 30.4 g",
        "Cholesterol > 259 mg",
        "Fat > 48.9 g",
        "Protein > 33.5 g",
        "Sodium > 1142 mg"
    ],
    "n": "Hash Brown and Egg Casserole",
    "a": "MELISSAKOVACS07",
    "r": "0",
    "s": 6,
    "des": "\"This is my family's recipe that has been handed down through the years.  We've always used the maple flavored pork sausage but any kind is good.  This casserole is a nice and cozy breakfast or brunch meal that everyone will enjoy.  It's got the perfect taste with lots of cheese. Yum! Be sure to use a baking dish that is deep enough to cover with aluminum foil.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart baking dish. Place the hash brown potatoes in the bottom of the baking dish.\nHeat a skillet over medium heat and cook and stir the sausage and onion until the sausage is crumbly, evenly browned, and no longer pink; drain. Meanwhile, whisk together the eggs, milk, onion powder, garlic powder, salt, and pepper, and pour over the potatoes. Layer with half the Cheddar cheese, the sausage mixture, and the remaining Cheddar cheese. Cover with aluminum foil.\nBake in the preheated oven for 1 hour. Remove cover; return casserole to the oven and bake until a knife inserted into the center comes out clean, about 10 minutes. Let stand for 5 minutes before serving.",
    "pt": "15 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "4535948.jpg",
    "o": "4535948.jpg,4487324.jpg,4475622.jpg,4473376.jpg,4393979.jpg,4387749.jpg",
    "st": "allrecipes"
}