{
    "id": 87059,
    "old_rating": "4.26923",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (6 pound) whole chicken, skin removed and cut into pieces",
        "1 medium onion, chopped",
        "2 cinnamon sticks",
        "4 carrots, peeled and cut into large chunks",
        "1 1/4 cups canola oil",
        "4 1/2 cups long grain rice, rinsed and drained",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground black pepper",
        "salt to taste",
        "5 cups chicken broth",
        "3/4 cup chopped almonds",
        "3/4 cup canola oil, divided",
        "1/4 cup pine nuts"
    ],
    "nut": [
        "Calories > 777 kcal",
        "Carbs > 64.1 g",
        "Cholesterol > 62 mg",
        "Fat > 44.5 g",
        "Protein > 28.8 g",
        "Sodium > 108 mg"
    ],
    "n": "Upside Down Chicken Rice",
    "a": "ROSE90",
    "r": "0",
    "s": 12,
    "des": "\"This is a Mediterranean recipe. You can make it with carrots, rose flower or eggplant. I explain it using carrots. Serve the rice with a salad or plain yogurt.\"",
    "ins": "Trim any fat off the chicken and wash with water. Place the chicken, onion, cinnamon sticks, and carrots in a pot; fill with water, and boil until the chicken and carrots are done. Reserve the broth, chicken, and carrots.\nRemove bones from chicken. Warm 1 1/4 cup canola oil in a large pot over medium-high heat. Place chicken and carrots in the pot; fry for 2 minutes.\nIn a bowl, stir together the rice, ground cinnamon, pepper, and salt. Pour the rice mixture evenly across the top of the chicken without stirring into the chicken. Pour in the chicken broth. Bring to a boil. Cover, reduce heat to medium, and simmer until rice is tender, 20 to 35 minutes.\nHeat 1/2 cup canola oil in a skillet over medium heat. Stir in chopped almonds, and fry until golden. Remove almonds to paper towels, and drain oil.\nHeat 1/4 cup canola oil in a skillet over medium heat. Stir in pine nuts, and cook until golden. Drain oil, and remove pine nuts to paper towels.\nOver a large dish or tray, flip the rice pot upside down, and release the contents onto the tray or dish. Arrange the almonds and pine nuts on top.",
    "pt": "45 m",
    "ct": "",
    "tt": "",
    "i": "3596399.jpg",
    "o": "",
    "st": "allrecipes"
}