{
    "id": 8707,
    "old_rating": "4.42424",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds skinless, boneless chicken breast halves - cooked and diced",
        "1 (10.75 ounce) can condensed cream of celery soup",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "1 (10 ounce) can enchilada sauce",
        "1 (14.5 ounce) can diced tomatoes with green chile peppers",
        "1 (4 ounce) can diced green chiles",
        "1 onion, chopped",
        "1 pinch garlic powder",
        "1 cup chicken broth",
        "1 teaspoon chili powder",
        "16 ounces processed cheese spread",
        "10 (6 inch) corn tortillas"
    ],
    "nut": [
        "Calories > 533 kcal",
        "Carbs > 30.5 g",
        "Cholesterol > 139 mg",
        "Fat > 24.9 g",
        "Protein > 46.6 g",
        "Sodium > 2043 mg"
    ],
    "n": "Chicken Enchilada Casserole I",
    "a": "PANZER33",
    "r": "0",
    "s": 8,
    "des": "\"A delicious recipe that is easy to make, and can be prepared the day before and baked the next day. These enchiladas are almost like a Mexican lasagna!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).\nIn a 5 quart pot combine the chicken, cream of celery soup, cream of chicken soup, enchilada sauce, diced tomatoes and green chiles, onion, garlic, chicken broth, chili powder and cheese. Heat over medium high until the cheese is melted and all of the ingredients are mixed together well.\nIn a 9x13 inch baking dish, layer the mixture and the tortillas like you would lasagna. Make sure to put a thin layer of the mixture on the bottom of the baking dish to prevent sticking. After layering, place dish in the preheated oven and bake for 45 minutes to 1 hour, until cheese starts to brown and bubble. Let stand and cool for at least 10 minutes before serving!",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "47911.jpg",
    "o": "3359002.jpg,2978125.jpg,2926222.jpg,2663220.jpg,2484168.jpg,1706748.jpg",
    "st": "allrecipes"
}