{
    "id": 87249,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup uncooked brown rice",
        "2 cups water",
        "2 tablespoons olive oil, divided",
        "1 onion, chopped",
        "1 teaspoon dried thyme",
        "1/2 teaspoon ground black pepper, divided",
        "1 cup frozen shelled edamame (green soybeans)",
        "4 (4 ounce) tuna steaks",
        "1/4 teaspoon salt",
        "1 bulb shallots, peeled and chopped",
        "3/4 cup water",
        "1 tablespoon minced fresh chives",
        "1/4 teaspoon grated orange zest",
        "1 tablespoon orange juice"
    ],
    "nut": [
        "Calories > 432 kcal",
        "Carbs > 40.5 g",
        "Cholesterol > 51 mg",
        "Fat > 13.2 g",
        "Protein > 38 g",
        "Sodium > 200 mg"
    ],
    "n": "Tuna with Rice Pilaf",
    "a": "SLLVERGRL",
    "r": "0",
    "s": 4,
    "des": "\"A simply delicious meal! Sure to make your kitchen smell amazing! This recipe is very versatile, as well.  For example, you may find it easier to use lima beans instead of edamame. Also you could use a different type of fish if you don't like tuna. You could even use fresh herbs for a burst of flavor! Feel free to experiment. Enjoy!\"",
    "ins": "Place the rice and 2 cups water in a pot, and bring to a boil. Cover, reduce heat to low, and simmer 45 minutes.\nHeat 1 tablespoon olive oil in a skillet over medium heat. Stir in onion, and cook until tender. Season with thyme and 1/4 teaspoon pepper. Gently stir into the cooked rice.\nPlace the edamame in separate pot with enough water to cover, and bring to a boil. Cook 5 minutes, or until tender. Mix into the rice.\nHeat remaining olive oil in a skillet. Rub tuna with remaining 1/4 teaspoon pepper and salt. Place tuna in the skillet, and cook to desired doneness. Set aside, and keep warm.\nPlace shallots in skillet. Increase heat to high, and pour in 3/4 cup water. Cook until liquid is reduced to about 1/2 cup, then stir in chives, orange zest and orange juice. Arrange fish over the rice and drizzle with the sauce to serve.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "375086.jpg",
    "o": "",
    "st": "allrecipes"
}