{
    "id": 87286,
    "old_rating": "4.51613",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups long grain white rice",
        "2 1/2 cups water",
        "3 teaspoons chicken bouillon granules",
        "1 pound fresh tomatillos, husks removed",
        "3 jalapeno peppers, cut into large pieces",
        "1 clove garlic",
        "1 tablespoon salt, or to taste",
        "1 tablespoon corn oil",
        "1/2 cup chopped onion",
        "1 1/2 pounds swai fish",
        "1 clove garlic, minced",
        "3 tablespoons chopped fresh cilantro",
        "1 tablespoon fresh lime juice"
    ],
    "nut": [
        "Calories > 379 kcal",
        "Carbs > 43.9 g",
        "Cholesterol > 53 mg",
        "Fat > 12.2 g",
        "Protein > 22.2 g",
        "Sodium > 1416 mg"
    ],
    "n": "Basa Fillets in Tomatillo Sauce",
    "a": "ANGELICA682",
    "r": "0",
    "s": 6,
    "des": "\"This is a recipe that I tried and my husband and I really liked it. I made it spicy, but you can control the heat.\"",
    "ins": "Combine the rice, water and bouillon in a saucepan. Bring to a boil, then cover and reduce the heat to low. Simmer for 15 minutes or until rice is tender and water has been absorbed. Set aside.\nMeanwhile, in a large pot, bring about 2 inches of water to a boil. Add jalapenos, and cook for 5 minutes, then add the tomatillos. Boil for 5 more minutes. Remove the tomatillos with a slotted spoon, and transfer to a blender. Add 1 clove of garlic, salt and 1 or 2 jalapenos. Puree until liquid, then taste, and blend in more jalapeno as desired. Set aside.\nHeat the corn oil in a large skillet over medium heat. Add the onions and 1 clove of garlic; cook and stir until fragrant. Add the fish fillets, and cook for about 2 minutes per side. Pour in the tomatillo sauce, and mix in the cilantro and lime juice. Simmer for a few minutes, or place under a broiler until fish flakes easily with a fork.\nServe fish immediately on a bed of rice. Spoon sauce over the top. Enjoy with your favorite ice cold beverage. Buen Apetito!",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "1406733.jpg",
    "o": "",
    "st": "allrecipes"
}