{
    "id": 87320,
    "old_rating": "4.7",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (7 pound) 3 rib prime rib beef roast",
        "1/4 cup black pepper",
        "1/4 cup garlic powder",
        "1/4 cup salt",
        "1 large onion, sliced",
        "1 pound sliced bacon",
        "1 tablespoon Cajun seasoning, or to taste"
    ],
    "nut": [
        "Calories > 1086 kcal",
        "Carbs > 10 g",
        "Cholesterol > 224 mg",
        "Fat > 87.5 g",
        "Protein > 61.3 g",
        "Sodium > 5610 mg"
    ],
    "n": "Cajun Prime Rib",
    "a": "MATHTUTORRITA",
    "r": "0",
    "s": 6,
    "des": "\"Don't be afraid of all the salt and spice.  They provide full flavor through out the meat.  The kick comes from the Cajun seasoning that is put on just before grilling.  For diners who like less heat you may omit the Cajun seasoning. A great company roast, and everyone can have their meat cooked to their preferred doneness.\"",
    "ins": "Carefully slice the fat cap from the top of the prime rib roast, being careful not to slice into the meat. Set the fat aside. Completely cover the roast with black pepper, then with garlic powder, then with salt. Cover the layer of salt with sliced onion. You may have to secure some of the onion with toothpicks. Lay the fat cap back in place over the onions, and secure to the roast with toothpicks. Use bacon to cover the rest of the onions, and secure with toothpicks as well. Wrap tightly in aluminum foil, and refrigerate overnight.\nIn the morning, preheat the oven to 550 degrees F (285 degrees C) - basically all the way up! open all of the windows and turn on all your fans. Unwrap the roast, and pierce with a knife several times. Rewrap, and place in a shallow baking dish.\nRoast for 35 minutes in the preheated oven. Remove from the oven, and let cool slightly - no longer than 30 minutes. Return to the refrigerator for at least 3 hours.\nPreheat a grill for high heat. Remove the fat cap and bacon, and scrape off the onions and seasoning. Use a sharp knife to slice the roast into steaks. Each rib will yield 2 steaks, one with a bone, and one without. Season steaks with your desired amount of Cajun seasoning. Bacon may be grilled, or set aside for other uses.\nLightly oil the grill grate. Grill steaks to your desired degree of doneness.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "4 h",
    "i": "",
    "o": "",
    "st": "allrecipes"
}