{
    "id": 87673,
    "old_rating": "3.84615",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 (.25 ounce) envelopes active dry yeast",
        "1/2 cup warm water",
        "1/2 cup shortening",
        "1 cup boiling water",
        "1 cup canned evaporated milk",
        "2 eggs, beaten",
        "1/2 teaspoon ground nutmeg",
        "1/2 cup white sugar",
        "2 teaspoons salt",
        "8 1/2 cups all-purpose flour",
        "1 quart oil for frying, or as needed",
        "3/4 cup confectioners' sugar",
        "1 tablespoon water, or as needed"
    ],
    "nut": [
        "Calories > 577 kcal",
        "Carbs > 43.3 g",
        "Cholesterol > 19 mg",
        "Fat > 42.6 g",
        "Protein > 6.2 g",
        "Sodium > 212 mg"
    ],
    "n": "Long Johns",
    "a": "DONNAE3",
    "r": "0",
    "s": 24,
    "des": "\"These doughnuts are a classic breakfast item. Flavor your glaze with chocolate or maple spread for different flavors.\"",
    "ins": "In a small bowl, dissolve the yeast in 1/2 cup lukewarm water. Set aside until  bubbly, about 10 minutes. In a large bowl, dissolve shortening in 1 cup of boiling water. Cool to lukewarm.\nMix the evaporated milk, eggs, nutmeg, sugar and salt into the shortening and water. Stir in the yeast mixture and one cup of the flour until well blended. Gradually mix in remaining flour 1 cup at a time until dough is firm enough to remove from the bowl. Knead for about 5 minutes on a lightly floured surface, or until smooth. Let rest for 10 minutes.\nRoll the dough out on a floured surface to 1/4 inch thick. Cut into strips 1 inch wide and 6 inches long. Place onto waxed paper, and let rise until doubled in size, about 1 hour.\nHeat oil in a deep-fryer or large heavy skillet to 350 degrees F (175 degrees C). Carefully remove the Long Boys from the waxed paper and place a few at a time in the hot oil. Fry for about 3 minutes per side, or until light brown. Set over wire racks to drain. Drizzle with glaze.\nTo make the glaze, mix the confectioners' sugar with enough water to make it able to drizzle in a long strand. Adjust amounts if necessary.",
    "pt": "15 m",
    "ct": "6 m",
    "tt": "1 h ",
    "i": "482989.jpg",
    "o": "",
    "st": "allrecipes"
}