{
    "id": 87880,
    "old_rating": "4.1",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup raisins",
        "2 1/2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "3/4 cup shortening",
        "2 tablespoons plain yogurt",
        "1/2 cup cold water",
        "4 large ripe bananas, coarsely chopped",
        "1/2 teaspoon ground cinnamon, or to taste",
        "1 tablespoon cold water",
        "1 egg white"
    ],
    "nut": [
        "Calories > 393 kcal",
        "Carbs > 49.8 g",
        "Cholesterol > < 1 mg",
        "Fat > 19.9 g",
        "Protein > 5.6 g",
        "Sodium > 157 mg"
    ],
    "n": "Banana Empanadas",
    "a": "AUKALOU",
    "r": "0",
    "s": 8,
    "des": "\"I love banana empanadas and I wanted to see if I could make them.  This is what I came up with and I wanted to share.  They're pocket pies.  You can make them with other fresh fruits (peaches, apples, apricots, pears, etc.) or with canned fruit filling.  The good thing about bananas is that you don't have to add any sugar and the empanadas still taste great.  If you use other fresh fruits you may want to consider adding about 1 tablespoon of sugar to the inside of each pocket. You may also sprinkle them with cinnamon-sugar as soon as they come out of the oven.\"",
    "ins": "Soak raisins in hot water for 30 minutes. Preheat the oven to 425 degrees F (220 degrees C).\nIn a large bowl, mix together the flour and salt. Mix in shortening using a fork, until the entire mixture is in pea-sized pellets. Stir in yogurt, and just enough of the 1/2 cup of cold water to hold it together in a dough.\nRoll out dough to a square 1/8 inch in thickness. Use a knife to cut into four 8x8 inch squares. Don't worry if they aren't perfect. Drain the raisins, and mix with the cinnamon and chopped bananas. Spoon some of the banana mixture onto half of each square, leaving at least 1/2 inch of dough exposed at the edge to seal the edges. Fold the dough over the fruit, and pinch the edges together. Make sure that they are secure.  I like to roll the excess dough up around the edges and then pinch it until it's thin again.  You'll want to have about a 1/2 inch closure in the end.  You can trim the edges a bit to make them more aesthetically pleasing. Place empanadas on a baking sheet. Whisk together 1 tablespoon of cold water and egg white; brush over the tops.\nBake for 30 minutes in the preheated oven, or until golden brown.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "3930853.jpg",
    "o": "",
    "st": "allrecipes"
}