{
    "id": 87901,
    "old_rating": "4.7037",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 (6 ounce) skinless, boneless chicken breast halves",
        "teriyaki marinade",
        "8 green onions, chopped",
        "1 teaspoon salt",
        "1 teaspoon pepper",
        "1/2 cup sugar",
        "3/4 cup rice vinegar",
        "1 cup olive oil",
        "1/2 (14 ounce) package wonton wrappers",
        "oil for frying",
        "1 head iceberg lettuce, chilled, and torn into bite-size pieces",
        "1 (4 ounce) can sliced water chestnuts, drained",
        "1/4 cup toasted sesame seeds",
        "1/2 cup toasted sliced almonds",
        "1 (10 ounce) can mandarin orange segments, drained"
    ],
    "nut": [
        "Calories > 886 kcal",
        "Carbs > 50.7 g",
        "Cholesterol > 68 mg",
        "Fat > 63 g",
        "Protein > 32.6 g",
        "Sodium > 1107 mg"
    ],
    "n": "Grilled Wonton Chicken Salad",
    "a": "Penny Allen",
    "r": "0",
    "s": 6,
    "des": "\"Great for summer! Crispy fried wonton strips and grilled chicken top lettuce, almonds, sesame seeds, and mandarin oranges; finished with a delicious green onion-based dressing.\"",
    "ins": "Place chicken breasts in a bowl, pour teriyaki sauce over them, and coat well. Cover, and refrigerate for 1 hour.\nPreheat an outdoor grill for direct heat.\nFor the dressing, place green onions, salt, pepper, and sugar in a blender. Pour in olive oil and rice vinegar. Blend until smooth. Remove to a bowl, cover, and refrigerate until ready to serve.\nGrill chicken, turning, until done. Remove to a cutting board, and cut into strips.\nIn a large skillet or wok, warm oil over medium-high heat. Cut wonton wrappers into strips. Fry wonton strips until crisp. Remove to paper towels.\nIn a large bowl, toss together lettuce, water chestnuts, sesame seeds, sliced almonds, and mandarin oranges. Pour dressing over salad, and toss gently. Top with fried wontons and grilled chicken strips.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "1 h ",
    "i": "2256950.jpg",
    "o": "",
    "st": "allrecipes"
}