{
    "id": 87980,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 medium eggplant, peeled and thinly sliced",
        "1 (16 ounce) package dry ziti pasta",
        "1 (15 ounce) container ricotta cheese",
        "2 eggs, beaten",
        "1 pound mozzarella cheese, shredded",
        "1/2 cup grated Pecorino Romano cheese",
        "1 (26 ounce) jar spaghetti sauce, or your favorite recipe",
        "1 pinch salt and pepper to taste"
    ],
    "nut": [
        "Calories > 570 kcal",
        "Carbs > 63.5 g",
        "Cholesterol > 109 mg",
        "Fat > 19.9 g",
        "Protein > 33.5 g",
        "Sodium > 902 mg"
    ],
    "n": "Eggplant-Ziti Parmesan",
    "a": "MOMMULL1214",
    "r": "0",
    "s": 8,
    "des": "\"I come from a big Italian family, my mom made this all the time.  Very delicious and very hardy.  A great anytime meal. The secret to good eggplant is to peel and drain it, so it's not soggy.  Serve with crusty italian bread, and a tossed salad, and you have a hearty meal.  It seems like a lot of work but it's not.  I hope you enjoy your meal.\"",
    "ins": "Place the eggplant slices in a bowl, and sprinkle with salt. Let drain over a bowl in the refrigerator for at least an hour. I like to do this overnight.\nPreheat the oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Add ziti pasta, and cook for about 6 minutes, or until almost tender. It will cook the rest of the way in the oven. Drain. Mix together the ricotta cheese and eggs in a small bowl. Stir in half of the mozzarella cheese and Pecorino Romano cheese.\nSpread a thin layer of sauce in the bottom of a 9x13 inch baking dish. Arrange layers of eggplant, cheese, ziti pasta, and more sauce all the way to the top of the pan. Top with remaining mozzarella cheese.\nBake for 45 minutes in the preheated oven, until heated through and cheese is lightly browned.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "32295.jpg",
    "o": "",
    "st": "allrecipes"
}