{
    "id": 8818,
    "old_rating": "4.7052",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 tomatoes, diced",
        "1 onion, finely chopped",
        "2 limes, juiced",
        "2 tablespoons chopped fresh cilantro",
        "1 jalapeno pepper, seeded and minced",
        "salt and pepper to taste",
        "2 tablespoons olive oil, divided",
        "2 skinless, boneless chicken breast halves - cut into strips",
        "1/2 onion, thinly sliced",
        "1 green bell pepper, thinly sliced",
        "2 cloves garlic, minced",
        "4 (12 inch) flour tortillas",
        "1 cup shredded Monterey Jack cheese",
        "1/4 cup sour cream, for topping"
    ],
    "nut": [
        "Calories > 673 kcal",
        "Carbs > 72.8 g",
        "Cholesterol > 65 mg",
        "Fat > 29.1 g",
        "Protein > 31 g",
        "Sodium > 979 mg"
    ],
    "n": "Pico de Gallo Chicken Quesadillas",
    "a": "Tony Cortez",
    "r": "0",
    "s": 4,
    "des": "\"Flour tortillas filled with chicken breast, onions, peppers, pico de gallo and Monterey Jack cheese.\"",
    "ins": "In a small bowl, combine tomatoes, onion, lime juice, cilantro,  jalapeno, salt and pepper. Set aside.\nIn a large skillet, heat 1 tablespoon olive oil. Add chicken and saute until cooked through and juices run clear. Remove chicken from skillet and set aside.\nPut the remaining 1 tablespoon of olive oil in the hot skillet and saute the sliced onion and green pepper until tender. Stir in the minced garlic and saute until the aroma is strong.  Mix in half of the pico de gallo and chicken breast meat. Set aside; keep warm.\nIn a heavy skillet, heat one flour tortilla. Spread 1/4 cup shredded cheese on the tortilla and top with 1/2 the chicken mixture. Sprinkle another 1/4 cup cheese over the chicken and top with another tortilla. When bottom tortilla is lightly brown and cheese has started to melt, flip quesadilla and cook on the opposite side. Remove quesadilla from skillet and cut into quarters. Repeat with remaining ingredients. Serve quesadillas with sour cream and remaining pico de gallo.",
    "pt": "25 m",
    "ct": "30 m",
    "tt": "55 m",
    "i": "4519403.jpg",
    "o": "4519403.jpg,4510955.jpg,4487900.jpg,4485205.jpg,3796019.jpg,3778555.jpg",
    "st": "allrecipes"
}