{
    "id": 8824,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 bone-in chicken breast halves, with skin",
        "2 (10.75 ounce) cans  fat free condensed cream of mushroom soup",
        "1 (10 ounce) can diced tomatoes with green chile peppers, drained",
        "1 (14.5 ounce) package low-fat baked tortilla chips",
        "3 cups shredded Cheddar cheese",
        "1 (6 ounce) can black olives",
        "2 cups shredded lettuce",
        "1 large tomato, chopped",
        "1 cup reduced fat sour cream",
        "1/4 cup chopped fresh chives"
    ],
    "nut": [
        "Calories > 560 kcal",
        "Carbs > 54.8 g",
        "Cholesterol > 88 mg",
        "Fat > 26.5 g",
        "Protein > 28.6 g",
        "Sodium > 1545 mg"
    ],
    "n": "King Ranch Chicken Casserole II",
    "a": "Annette Shaw",
    "r": "0",
    "s": 8,
    "des": "\"A tasty chicken casserole, using shredded chicken and crumbled tortilla chips. Be the king or queen of your 'ranch' by serving up this treat for dinner!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Place chicken breasts in a pot of boiling water. Cook until meat shreds easily with a fork, about 20 to 25 minutes. Remove from water, and cool slightly. Remove meat and skin from bones, and shred.\nIn a medium bowl, combine the cream of mushroom soup and canned tomatoes and mix together.\nLightly coat a 9x13 inch baking dish with cooking spray. In dish begin layering: 1/3 of the chicken, 1/3 of the soup mixture, then crumble tortilla chips on top. Repeat layers twice, ending with tortilla chips and a sprinkle of cheese on top. Bake in the preheated oven for 30 to 45 minutes, until bubbly. Remove from oven and let cool for 5 minutes.\nTop casserole with lettuce, chopped tomato, olives, a couple of dollops of sour cream and a sprinkling of chives. Serve.",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "11659.jpg",
    "o": "",
    "st": "allrecipes"
}