{
    "id": 8833,
    "old_rating": "4.39744",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/2 cup butter",
        "1/2 tablespoon chopped fresh parsley",
        "1/2 tablespoon chopped fresh chives",
        "1 tablespoon lemon juice",
        "6 skinless, boneless chicken breast halves",
        "salt and pepper to taste",
        "2 cups dried bread crumbs",
        "3 eggs, lightly beaten",
        "3 tablespoons water",
        "2 quarts vegetable oil for frying"
    ],
    "nut": [
        "Calories > 704 kcal",
        "Carbs > 26.4 g",
        "Cholesterol > 202 mg",
        "Fat > 50.5 g",
        "Protein > 35.4 g",
        "Sodium > 485 mg"
    ],
    "n": "Chicken Kiev",
    "a": "William Anatooskin",
    "r": "0",
    "s": 6,
    "des": "\"Chicken Kiev is a dish consisting of a boneless chicken breast wrapped around a piece of herbed/seasoned butter, breaded and deep fried. Here's a recipe for the real deal. Say 'da' and enjoy!\"",
    "ins": "In a small bowl, combine the butter/margarine, parsley, chives and lemon juice. Blend all together and refrigerate.\nPlace chicken breasts between 2 pieces of wax paper and pound well to flatten. Remove paper and season breasts with salt and pepper to taste.\nRemove seasoned butter from refrigerator and divide it into 6 portions. Place one portion in the center of each chicken breast. Fold the short ends of the breasts into the center, then fold in the sides. Secure each breast with a wooden toothpick.\nAdd the water to the eggs and beat together. Coat each rolled breast with bread crumbs, dip into egg/water mixture, then into bread crumbs again, coating well. Chill breasts for one hour.\nIn a deep fryer, heat oil to 365 degrees F (185 degrees C). Carefully lower breasts into hot oil. Fry for 8 minutes or until golden brown. Drain on paper toweling and serve.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "343806.jpg",
    "o": "",
    "st": "allrecipes"
}