{
    "id": 88557,
    "old_rating": "4.53846",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups semolina flour",
        "1/3 teaspoon baking powder",
        "1 cup white sugar",
        "1 cup sweetened flaked coconut",
        "1/4 cup butter, melted",
        "1 cup plain yogurt",
        "1/4 cup milk, or as needed",
        "1/4 cup whole almonds",
        "1 cup water",
        "1 cup white sugar",
        "1 tablespoon lemon juice"
    ],
    "nut": [
        "Calories > 432 kcal",
        "Carbs > 78.9 g",
        "Cholesterol > 16 mg",
        "Fat > 10.4 g",
        "Protein > 7.5 g",
        "Sodium > 95 mg"
    ],
    "n": "Basboosa II",
    "a": "Felicia Manocchio",
    "r": "0",
    "s": 9,
    "des": "\"This is a traditional Middle Eastern dessert made of semolina flour, yogurt, and coconut. To adjust the sweetness, you can half or double the amount of sugar in the lemon syrup.\"",
    "ins": "Preheat the oven to 350 degrees F (175 degrees C). Grease an 8 inch square baking dish.\nIn a large bowl, mix together the semolina flour, baking powder, 1 cup sugar, coconut and butter. Add the yogurt and milk; mix until moistened but not runny or liquid. If you see that it is too dry, add more milk. Spread into a greased 8 inch square baking dish, smoothing the top as much as possible. Decorate the top with whole almonds.\nBake for 40 to 45 minutes in the preheated oven, until golden brown. While the basboosa is baking, combine the water, 1 cup of sugar and lemon juice in a small saucepan. Bring to a boil, and cook for at least 5 minutes.\nWhen the basboosa has finished baking, pour the syrup over it as evenly as possible. Place it back in the oven for about 5 minutes, or until the syrup has been fully absorbed. Let rest for about 20 minutes before cutting into pieces and serving.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "4538771.jpg",
    "o": "",
    "st": "allrecipes"
}