{
    "id": 88573,
    "old_rating": "4.67742",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup shelled pistachio nuts",
        "4 tablespoons olive oil",
        "4 skinless, boneless chicken breast halves",
        "garlic powder to taste",
        "black pepper to taste",
        "1 (10 ounce) package baby spinach leaves, rinsed and drained",
        "1 pint cherry tomatoes",
        "1 avocado - peeled, pitted and sliced",
        "1 yellow bell pepper, julienned",
        "2 green onions, sliced",
        "grated Parmesan cheese for topping",
        "bottled balsamic salad dressing, to taste"
    ],
    "nut": [
        "Calories > 616 kcal",
        "Carbs > 31.2 g",
        "Cholesterol > 74 mg",
        "Fat > 38.8 g",
        "Protein > 40.5 g",
        "Sodium > 860 mg"
    ],
    "n": "Spinach Salad with Pistachio Chicken",
    "a": "Sara",
    "r": "0",
    "s": 4,
    "des": "\"This is a tasty dinner salad, topped with tender slices of pistachio encrusted chicken. To save time, buy pistachios with the shells already removed. If you don't care for spinach, you can substitute field greens. Serve with crusty French bread.\"",
    "ins": "Place pistachio in a food processor or blender, and pulse until finely diced. Sprinkle half of diced pistachios onto a large plate.\nWarm oil in a skillet over medium-high heat. Press chicken breast halves into the pistachio pieces, adding more diced nuts to the plate as needed. Sprinkle chicken breasts with garlic powder and black pepper. Place in the skillet, and cook until golden brown. Reduce heat to medium low, and cook  for about 3 to 5 minutes on each side, until the chicken is no longer pink inside. Remove chicken to a cutting board, and slice into thin slices.\nInto four bowls, place equal amounts of spinach leaves, tomatoes, avocado, bell pepper, and green onions. Place chicken slices on top. Sprinkle with Parmesan, pour on Balsamic vinegar, and season with black pepper.",
    "pt": "10 m",
    "ct": "10 m",
    "tt": "20 m",
    "i": "658621.jpg",
    "o": "1954716.jpg,1826085.jpg,1525289.jpg,1149582.jpg,1060277.jpg,944217.jpg",
    "st": "allrecipes"
}