{
    "id": 88768,
    "old_rating": "4.31496",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (16 ounce) package extra-firm tofu, drained and pressed",
        "2 cups vegetable broth",
        "3 tablespoons vegetable oil",
        "1/2 cup all-purpose flour",
        "3 tablespoons nutritional yeast",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 teaspoon sage",
        "1/2 teaspoon cayenne pepper"
    ],
    "nut": [
        "Calories > 285 kcal",
        "Carbs > 18.9 g",
        "Cholesterol > 0 mg",
        "Fat > 17.5 g",
        "Protein > 16.3 g",
        "Sodium > 823 mg"
    ],
    "n": "Breaded, Fried, Softly Spiced Tofu",
    "a": "Miss Sriri",
    "r": "0",
    "s": 4,
    "des": "\"This tofu recipe is completely gorgeous. A former roommate introduced me to some basics with tofu, and over the past few years, I've settled on this ratio of spices and other breading ingredients. The crust on the tofu sticks is tasty and the texture is really wonderful. Serve with a relish or a dip of some sort (I love this with plain yogurt mixed with eggplant brinjal). I usually make this with a cumin-scented rice dish and a garlicky broccoli side.\"",
    "ins": "Cut pressed tofu into 1/2-inch thick slices; then cut again into 1/2-inch wide sticks. Place tofu in a bowl, and pour broth over the top. Set aside to soak.\nIn a separate bowl, stir together flour, yeast, salt, pepper, sage, and cayenne.\nWarm oil in a large skillet over medium-high heat.\nRemove tofu sticks from broth, and squeeze most (but not all) of the liquid from them. Roll sticks in breading.  (You may have to roll sticks twice to end up with a fairly dry outer layer of breading.) Place tofu in hot oil; fry until crisp and browned on all sides. Add more oil if necessary.",
    "pt": "15 m",
    "ct": "15 m",
    "tt": "30 m",
    "i": "370100.jpg",
    "o": "1029237.jpg,467307.jpg,257721.jpg,234713.jpg,216887.jpg,119174.jpg",
    "st": "allrecipes"
}