{
    "id": 88912,
    "old_rating": "4.22951",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup water",
        "1/2 cup uncooked long grain white rice",
        "16 large cabbage leaves",
        "2 tablespoons olive oil",
        "1 pound ground turkey",
        "1/3 cup chopped onion",
        "1 egg, beaten",
        "1 (8 ounce) can tomato sauce",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 (8 ounce) can tomato sauce",
        "2/3 (6 ounce) can tomato paste",
        "1 cup water",
        "3 tablespoons brown sugar",
        "2 teaspoons lemon juice",
        "1 teaspoon Worcestershire sauce",
        "2 cups baby carrots, sliced lengthwise (optional)"
    ],
    "nut": [
        "Calories > 245 kcal",
        "Carbs > 28.1 g",
        "Cholesterol > 68 mg",
        "Fat > 9.1 g",
        "Protein > 14.1 g",
        "Sodium > 660 mg"
    ],
    "n": "Turkey Cabbage Rolls",
    "a": "DHANO923",
    "r": "0",
    "s": 8,
    "des": "\"This is my version of cabbage rolls using ground turkey instead of ground beef. This dish freezes well, so you can have half for dinner and freeze the other half for another time. Mashed potatoes make a good side dish.\"",
    "ins": "In a pot, bring 1 cup water and rice to a boil. Reduce heat to low, cover and simmer for 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Butter a 9x13 inch casserole dish.\nBring a large pot of water to boil. Reduce heat to low and place cabbage leaves in pot. Simmer 4 to 5 minutes, until tender. Drain leaves and set aside.\nHeat oil in a skillet over medium heat and cook turkey and onion until turkey is brown and onion is tender. Transfer turkey and onion to a bowl, cool slightly, and mix in cooked rice, egg and 1 can tomato sauce. Season with salt and pepper.\nIn a separate bowl, mix 1 can tomato sauce, tomato paste, water, brown sugar, lemon juice and Worcestershire sauce.\nScatter carrot slices evenly over bottom of casserole dish. Spread cabbage leaves on a flat surface and place about 2 tablespoons turkey mixture in the center of each leaf. Fold edges of leaves over filling, then roll into logs. Place cabbage rolls seam side down in dish over carrots. Pour sauce evenly over rolls.\nCover and bake 1 hour in the preheated oven. Remove cover during last 10 minutes of cook time. Allow to sit 5 minutes before serving.",
    "pt": "25 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "267751.jpg",
    "o": "4153563.jpg,3489939.jpg,3101789.jpg,2116555.jpg,49693.jpg,28887.jpg",
    "st": "allrecipes"
}