{
    "id": 88919,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 tablespoons olive oil",
        "1 teaspoon chopped onion",
        "1 teaspoon celery, chopped",
        "1 chopped carrot",
        "2 cloves garlic, pressed",
        "4 ounces chicken livers, rinsed and sliced into strips",
        "4 ounces lamb or pork livers, rinsed and cut into strips",
        "1/2 cup red wine",
        "1 tablespoon tomato puree",
        "2 tablespoons chopped fresh parsley",
        "3 anchovy fillets, chopped",
        "2 tablespoons chicken stock or water",
        "salt and pepper to taste",
        "1 tablespoon butter, or as needed",
        "1 tablespoon capers"
    ],
    "nut": [
        "Calories > 224 kcal",
        "Carbs > 2.5 g",
        "Cholesterol > 212 mg",
        "Fat > 16.1 g",
        "Protein > 11.7 g",
        "Sodium > 273 mg"
    ],
    "n": "Crostini Alla Fiorentina",
    "a": "nostatic",
    "r": "0",
    "s": 4,
    "des": "\"This is a traditional Italian appetizer that is, essentially, liver pate served on toasted, rustic bread.  This is a nice recipe for cocktail parties and wine tastings. For vegetarians in attendance, you can also prepare a version with finely chopped (and drained) herbed tomatoes as it is equally delicious. You can serve the dish hot or cold on toasted Italian bread.\"",
    "ins": "Heat the oil in a skillet over low heat. Add the onion, celery, carrot and garlic; cook and stir for about 5 minutes until onions are soft.\nPat the chicken and lamb liver dry, and add to the skillet. Fry over low heat until all sides are browned. Pour the red wine over the liver, and let it vaporize for a minute. Stir in the tomato puree, half of the parsley, anchovies, chicken stock, salt and pepper. Cover, and simmer for about 20 minutes.\nUse a hand-held blender to puree the liver mixture. If you don't have one, transfer to a food processor, and process until smooth. Return to the skillet, and stir in the butter, capers and remaining parsley.",
    "pt": "5 m",
    "ct": "20 m",
    "tt": "25 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}