{
    "id": 88924,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon olive oil",
        "3 skinless, boneless chicken breast halves",
        "1 tablespoon ground black pepper, or to taste",
        "3 tablespoons onion powder, or to taste",
        "1 (28 ounce) can chopped stewed tomatoes, 1/2 the liquid reserved",
        "1 (14 ounce) can chicken broth",
        "1 (10 ounce) package frozen mixed vegetables",
        "1/4 cup water"
    ],
    "nut": [
        "Calories > 325 kcal",
        "Carbs > 36.2 g",
        "Cholesterol > 64 mg",
        "Fat > 8.3 g",
        "Protein > 30 g",
        "Sodium > 1302 mg"
    ],
    "n": "Tender Tomato Chicken Breasts",
    "a": "Erin",
    "r": "0",
    "s": 3,
    "des": "\"This is a light, juicy, flavorful dish. Being a mom of a 7 month old, I've learned to take a lot of shortcuts and still be able to cook quality food. This is quick, easy, and tasty. If you absolutely must use fresh veggies, that's ok, but frozen veggies, in my opinion, work a little bit better. Serve with rice, if desired. To kick it up a bit, add chopped green peppers in with the tomatoes.\"",
    "ins": "Heat the oil in a skillet over medium heat. Season chicken breasts on both sides with pepper and onion powder, and arrange in the skillet. Cook 2 minutes on each side, just until browned. Pour tomatoes and reserved liquid over the chicken. Pour in broth. Cover skillet, and continue cooking 15 minutes on each side, until chicken juices run clear.\nWhile the chicken is cooking, place the frozen mixed vegetables and water in a pot. Scoop about 3/4 cup liquid from the skillet, and mix into the pot. Bring to a boil, and cook 5 minutes, or until vegetables are tender; drain. Arrange chicken breasts over the vegetables, and drizzle with liquid from the skillet to serve.",
    "pt": "10 m",
    "ct": "35 m",
    "tt": "45 m",
    "i": "17567.jpg",
    "o": "4457832.jpg,3242771.jpg,1283948.jpg,1129841.jpg,1102849.jpg,1027504.jpg",
    "st": "allrecipes"
}