{
    "id": 89281,
    "old_rating": "3.90909",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (2 pound) roasting chicken",
        "8 cups water, or as needed",
        "1 (28 ounce) can low fat, low sodium chicken broth",
        "3 large baking potatoes, peeled",
        "1 (10 ounce) package wide egg noodles",
        "1 teaspoon salt-free seasoning blend",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 658 kcal",
        "Carbs > 66.5 g",
        "Cholesterol > 153 mg",
        "Fat > 25.2 g",
        "Protein > 39.9 g",
        "Sodium > 401 mg"
    ],
    "n": "Simple Stovetop Amish Chicken",
    "a": "IamPatSajak",
    "r": "0",
    "s": 6,
    "des": "\"In my family, we call this simple stove top recipe for chicken Chicken Pot Pie. It is not very pie like, but a very classic German/Amish dish. This is one of my very favorites, I learned to make it with my mom when I was little, this will be the first time I wrote it down! I have had it before with carrots, which I do enjoy, but I prefer it best when it is very simple. This is a very inexpensive dish.\"",
    "ins": "Place the chicken into a large pot, and fill with enough water to cover it. Bring to a boil, cover, and cook over high heat until chicken is easily removed from the bone, about 35 minutes. Turn the chicken over once during this time so it will cook evenly. Cutting the chicken into pieces can speed up the cooking process a bit.\nWhile the chicken is cooking, cut two of the potatoes into large chunks, and the other potato into very small cubes.\nWhen the chicken is cooked, remove it from the water. Pull off the skin, and place all of the chicken meat in a separate dish. Pull the meat apart in long shreds. Reserve the cooking water in a separate container. Discard chicken skin and bones.\nPour the chicken broth into the pot, and add potatoes, chicken, salt, and pepper. Pour in 2 to 3 cups of the reserved water. Bring to a boil, and cook for about 15 minutes, until potatoes start to soften. Add 3 more cups of the chicken water, and the noodles. Season with salt-free seasoning blend, salt, and pepper. Cover, and simmer over medium-low heat until the noodles are tender and small potato pieces have dissolved.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4006745.jpg",
    "o": "",
    "st": "allrecipes"
}