{
    "id": 89417,
    "old_rating": "4.16216",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1 cup shortening",
        "1/2 cup cold water",
        "3 tablespoons sugar",
        "2 tablespoons cornstarch",
        "2 cups sliced fresh peaches",
        "1 cup fresh blackberries"
    ],
    "nut": [
        "Calories > 509 kcal",
        "Carbs > 45.4 g",
        "Cholesterol > 0 mg",
        "Fat > 34.7 g",
        "Protein > 4.7 g",
        "Sodium > 197 mg"
    ],
    "n": "No Skill Fruit Tart",
    "a": "EBSEPKE",
    "r": "0",
    "s": 6,
    "des": "\"Just like a seasonal fruit pie--wonderful for people who have trouble making the perfect crust. My favorite is blackberries with peaches, but you can use pretty much any seasonal fruit that you love. This one's a no-brainer!\"",
    "ins": "Preheat the oven to 450 degrees F (220 degrees C).\nIn a medium bowl, stir together the flour and salt. Cut in shortening by rubbing between your fingers until the mixture resembles oatmeal. Gradually stir in water until dough is just wet enough to hold together. Knead briefly, just so the dough holds together without crumbling. Place in the refrigerator while preparing the fruit.\nIn a medium bowl, stir together the sugar and cornstarch. Add the peaches and blackberries, and toss gently to coat. Set aside.\nRoll out the crust dough into a rough circle about the size of a dinner plate, and place on a flat baking sheet. Pile the fruit into a level mound in the center of the dough, leaving 1 to 2 inches of exposed dough around the edge. Throw out any juices that may have accumulated in the fruit bowl. Fold the dough up over the fruit - the edges should cover some of the fruit and berries, but not reach the center of the tart.\nBake for 25 to 30 minutes in the preheated oven, until the fruit is bubbly and the crust is golden brown. Let cool completely before cutting into wedges and serving.",
    "pt": "15 m",
    "ct": "30 m",
    "tt": "45 m",
    "i": "161150.jpg",
    "o": "4515705.jpg,668039.jpg,217891.jpg,178997.jpg,67729.jpg,15276.jpg",
    "st": "allrecipes"
}