{
    "id": 89691,
    "old_rating": "3.66667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 pounds fresh young black walnuts (in shell)",
        "3/4 cup salt",
        "4 cups malt vinegar",
        "2 1/8 cups packed brown sugar",
        "1 teaspoon ground allspice",
        "1 teaspoon ground cloves",
        "1/2 teaspoon ground cinnamon",
        "1 tablespoon grated fresh ginger root"
    ],
    "nut": [
        "Calories > 419 kcal",
        "Carbs > 23.1 g",
        "Cholesterol > 0 mg",
        "Fat > 33.5 g",
        "Protein > 13.7 g",
        "Sodium > 2631 mg"
    ],
    "n": "Sweet Pickled Walnuts",
    "a": "DCREWS21",
    "r": "0",
    "s": 32,
    "des": "\"Sweet pickled black walnuts take three weeks to make but they last for ages. Pick the walnuts in summer before the hard nut forms inside the green shell.\"",
    "ins": "Use rubber gloves to handle the young walnuts and pierce each one a few times with the tines of a fork. Watch out for the clear juice this produces. It stains a dark, espresso brown and is a natural dye. Place the walnuts into a bucket and fill with enough water to cover. Stir in 3/4 cup of salt to make a brine. Soak walnuts for 1 week, then drain and make the brine again. Soak for 1 more week.\nAfter the second week, drain the walnuts and lay them out on trays to dry in an airy place. In a couple of days they will turn black. Once they have all turned black, they are ready to pickle.\nIn a large pot, stir together the malt vinegar, brown sugar, allspice, cloves, cinnamon and ginger. Bring to a boil and then add the walnuts. Simmer over medium heat for 15 minutes. Remove from heat and allow to cool.\nSpoon the walnuts into sterile jars and fill with the syrup to within 1/2 inch of the top. Seal with lids and rings. Store in the refrigerator or process in a hot water bath for 10 minutes. Cool to room temperature and store in a cool dark place.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "21 d ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}