{
    "id": 89721,
    "old_rating": "4.02326",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 tablespoon butter",
        "1 pound ground beef",
        "1/4 cup chopped onion",
        "2 tablespoons chopped fresh parsley",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon dried dill weed",
        "1 pinch ground nutmeg",
        "2 large red potatoes, grated",
        "2 cups shredded Cheddar cheese",
        "2 cups all-purpose flour",
        "1 teaspoon salt",
        "3/4 cup shortening",
        "6 tablespoons sour cream"
    ],
    "nut": [
        "Calories > 1204 kcal",
        "Carbs > 80 g",
        "Cholesterol > 145 mg",
        "Fat > 78.9 g",
        "Protein > 43.9 g",
        "Sodium > 1044 mg"
    ],
    "n": "Swedish Meat Pies",
    "a": "Emily Dunaway",
    "r": "0",
    "s": 4,
    "des": "\"This is a very close knock-off of the Swedish meat pies served at the Scandinavian Festival in Junction City, Oregon. It is not exact, but we like this version better than the Loven Oven pies!\"",
    "ins": "Melt the butter in a large skillet over medium heat. Crumble in the ground beef and add onion, parsley, allspice, dill, nutmeg and grated potatoes. Cook and stir until the meat is browned. Drain any excess grease. Turn off the heat and stir in the cheese until melted. Set aside to cool.\nPreheat the oven to 400 degrees F (200 degrees C).\nIn a medium bowl, mix together the flour and salt. Mix in the shortening with a fork or pastry cutter until only pea sized lumps remain. Stir in sour cream a little bit at a time until the dough holds together. Knead briefly on a lightly floured surface. Divide into four equal portions, and pat into balls.\nRoll out each ball of dough to about 1/8 inch thickness. Place a heaping 1/2 cup of filling onto each one. Fold over into half circles, and seal by moistening the edges with warm water and pressing together. Place on a baking sheet.\nBake for 20 minutes in the preheated oven, until golden brown.",
    "pt": "40 m",
    "ct": "",
    "tt": "",
    "i": "1031734.jpg",
    "o": "1486652.jpg,958534.jpg,695247.jpg,126182.jpg,126181.jpg,123715.jpg",
    "st": "allrecipes"
}