{
    "id": 89723,
    "old_rating": "4.50323",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound ground beef",
        "1/2 cup chopped onion",
        "1 teaspoon dried rosemary",
        "1 teaspoon dried basil",
        "1 (8 ounce) can tomato sauce",
        "1 (14.5 ounce) can diced tomatoes, drained",
        "2 (15 ounce) cans mixed vegetables, drained",
        "2 pounds red potatoes",
        "1/2 cup butter",
        "1/2 cup grated Romano cheese",
        "2 tablespoons minced garlic",
        "1 teaspoon salt",
        "1 teaspoon dried oregano",
        "1/3 cup milk"
    ],
    "nut": [
        "Calories > 392 kcal",
        "Carbs > 33.4 g",
        "Cholesterol > 74 mg",
        "Fat > 20.9 g",
        "Protein > 18.2 g",
        "Sodium > 889 mg"
    ],
    "n": "Easy Shepherd's Pie with Garlic Romano Potatoes",
    "a": "HEATHER C",
    "r": "0",
    "s": 8,
    "des": "\"This is a very easy shepherd's (cottage) pie that's topped with wonderful garlic and Romano potatoes. You can change the ingredients to add almost anything you like. Kids love this, and it's even better after sitting for a day. You should have most of the ingredients on hand so no trips to the grocery! You can substitute any cheese for the Romano, as well.\"",
    "ins": "Preheat oven to 375  degrees F (190 degrees C). Lightly grease a medium baking dish.\nPlace the beef and onion in a skillet over medium heat. Season with rosemary and basil. Cook until beef is evenly brown; drain grease. Mix in tomato sauce, diced tomatoes, and mixed vegetables. Cook and stir until vegetables are heated through. Transfer to the baking dish.\nPlace potatoes in a pot with enough water to cover, and bring to a boil. Cook 10 minutes, or until tender. Remove from heat and drain. Mix butter, Romano cheese, garlic, salt, oregano, and milk into the pot. Mash together with a potato masher. Top beef and vegetables with the mashed potatoes.\nBake 30 minutes in the preheated oven. Turn oven to broil, and continue cooking 3 minutes, until potatoes are golden brown.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "14984.jpg",
    "o": "3986518.jpg,2443493.jpg,1808022.jpg,1787182.jpg,1787173.jpg,1787156.jpg",
    "st": "allrecipes"
}