{
    "id": 9001,
    "old_rating": "3.77273",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "10 saltine crackers, crushed",
        "1/2 teaspoon Italian seasoning",
        "2 skinless, boneless chicken breasts",
        "1/4 cup egg substitute",
        "1/2 cup julienned red bell pepper",
        "1/2 cup julienned yellow bell pepper",
        "1/2 cup julienned green bell pepper",
        "1 small onion, cut into wedges",
        "1 clove crushed garlic",
        "1 1/2 tablespoons butter",
        "1/2 cup chicken broth",
        "1/2 tablespoon all-purpose flour"
    ],
    "nut": [
        "Calories > 343 kcal",
        "Carbs > 21.1 g",
        "Cholesterol > 92 mg",
        "Fat > 13.1 g",
        "Protein > 34 g",
        "Sodium > 358 mg"
    ],
    "n": "Three Pepper Chicken",
    "a": "LEMONADE63",
    "r": "0",
    "s": 2,
    "des": "\"'Ring my bell (peppers)!' This is a quick, healthy recipe that serves two persons. A good way to use up the plentiful bell peppers in the fall that we are blessed with in Iowa!\"",
    "ins": "In a shallow dish or bowl, mix together cracker crumbs and seasoning. Put egg substitute in a separate dish or bowl. Dip each chicken breast in the egg substitute, then coat with cracker mixture. Set aside.\nIn a large skillet saute bell peppers, onion and garlic in butter or margarine over medium heat, until just crisp and tender. Remove pepper mixture from skillet and set aside, keeping warm.\nIn the same skillet, saute coated chicken breasts in remaining butter or margarine until browned on both sides. Remove browned chicken breasts from skillet and keep warm.\nCombine the chicken broth and flour and mix together. Pour broth mixture into pan drippings and heat through until mixture thickens and begins to boil. Stir in bell pepper mixture and heat through, stirring together. If desired, serve by placing chicken breast on a bed of hot cooked pasta and pouring bell pepper mixture over the top.",
    "pt": "25 m",
    "ct": "35 m",
    "tt": "1 h",
    "i": "3969283.jpg",
    "o": "",
    "st": "allrecipes"
}