{
    "id": 9024,
    "old_rating": "4.21111",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 medium head garlic",
        "1 tablespoon olive oil",
        "4 skinless, boneless chicken breasts",
        "1/2 cup white wine",
        "2 tablespoons butter",
        "1 cup milk",
        "1 tablespoon all-purpose flour",
        "1/4 cup grated Parmesan cheese",
        "1 tablespoon chopped fresh parsley"
    ],
    "nut": [
        "Calories > 317 kcal",
        "Carbs > 10.1 g",
        "Cholesterol > 93 mg",
        "Fat > 13.3 g",
        "Protein > 32.4 g",
        "Sodium > 224 mg"
    ],
    "n": "Broiled Chicken with Roasted Garlic Sauce",
    "a": "Kara Laskowski",
    "r": "0",
    "s": 4,
    "des": "\"This is a fairly low-fat cream sauce. Roasting the garlic makes it sweet and slightly nutty - don't be afraid to use the whole head! Serve with hot cooked rice or pasta.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nSlice the top of the head of garlic, just enough to remove paper and expose the tops of the cloves. Drizzle with olive oil and roast in preheated oven, either in a clay garlic roaster or wrapped in aluminum foil. Roast for 20 minutes or until cloves are soft and slip from skins when pushed. Change oven setting to broil (375 degrees F, 190 degrees C). Let garlic cool.\nTo prepare chicken, place in a 9x13 inch baking dish and splash both sides with white wine. Broil for 25 minutes or until chicken is cooked through and juices run clear.\nMeanwhile, place butter or margarine and milk in a large skillet and heat over medium heat until warm. Stir in the flour and cheese. Stir over medium heat until sauce begins to thicken. Slip cooled garlic cloves from skin and add to the sauce (if desired, mince first). Add chopped parsley. Bring nearly to a boil; reduce heat and stir to control thickening. If desired, pour sauce over cooked rice or pasta and top with broiled chicken. Enjoy!",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "820713.jpg",
    "o": "",
    "st": "allrecipes"
}