{
    "id": 90285,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "6 tablespoons unsalted butter, divided",
        "1/2 cup finely chopped onion",
        "6 cloves garlic, coarsely chopped",
        "1 cup chicken stock",
        "2 tablespoons chopped fresh rosemary",
        "1 (16 ounce) package spaghetti",
        "1/4 cup grated Parmesan cheese",
        "kosher salt and cracked black pepper to taste"
    ],
    "nut": [
        "Calories > 305 kcal",
        "Carbs > 43.9 g",
        "Cholesterol > 26 mg",
        "Fat > 10.3 g",
        "Protein > 8.8 g",
        "Sodium > 214 mg"
    ],
    "n": "Rosemary Pasta in Roasted Garlic Sauce",
    "a": "kelcampbell",
    "r": "0",
    "s": 8,
    "des": "\"My mother has been making this dish for as long as I can remember. Lots of rosemary and garlic - what more could you ask for?\"",
    "ins": "Melt 4 tablespoons of butter in a large skillet over low heat. Add the onions; cook and stir until they turn a deep brown, about 10 minutes. Stir in the garlic, and cook for 2 minutes, until fragrant. Mix in the chicken stock and rosemary, and increase the heat to medium-high. Cook until reduced by 1/3, about 8 minutes.\nMeanwhile, bring a large pot of lightly salted water to a boil. Add the spaghetti pasta, and cook until tender, about 8 minutes. Drain, then add noodles to the sauce in the skillet. Stir in the remaining butter and Parmesan cheese. Season with salt and pepper.\nServe in a large bowl family style, or place about 1 cup of pasta in a large mug or small bowl. Insert a dinner fork in the center of the pasta and twirl the fork around, holding the mug steady. The pasta will wind up tighter and tighter as you turn. Remove the fork and immediately turn the pasta out onto a dinner plate or shallow bowl. Garnish with extra cheese and rosemary sprigs.",
    "pt": "10 m",
    "ct": "20 m",
    "tt": "30 m",
    "i": "4271148.jpg",
    "o": "2398319.jpg,1121616.jpg,729324.jpg,400092.jpg,228064.jpg,123328.jpg",
    "st": "allrecipes"
}