{
    "id": 90396,
    "old_rating": "4.56198",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 pounds large shrimp - peeled, deveined and chopped",
        "3/4 cup fresh lime juice",
        "5 roma (plum) tomatoes, diced",
        "1 white onion, chopped",
        "1/2 cup chopped fresh cilantro",
        "1 tablespoon Worcestershire sauce",
        "1 tablespoon ketchup",
        "1 teaspoon hot pepper sauce",
        "salt and pepper to taste",
        "1 avocado - peeled, pitted and diced",
        "16 saltine crackers"
    ],
    "nut": [
        "Calories > 352 kcal",
        "Carbs > 24.3 g",
        "Cholesterol > 346 mg",
        "Fat > 10.9 g",
        "Protein > 40.5 g",
        "Sodium > 691 mg"
    ],
    "n": "Avocado Shrimp Ceviche-Estillo Sarita",
    "a": "cafe luna Antigua",
    "r": "0",
    "s": 4,
    "des": "\"A tried and true ceviche recipe to be enjoyed for a Sunday brunch in our cafe. It is believed by most Latinos that the best time to eat ceviche is on a sunny day. Rainy days cause stomach cramps and nightmares. Of course most Latinos (especially my wife) can make a good ceviche blindfolded on any day rain or shine, in my opinion. Excellent for an appetizer in smaller portions or as a meal itself. Personally I enjoy this with an ice cold beer on the side.\"",
    "ins": "Place the shrimp and lime juice into a large bowl, and stir to coat. Let stand for about 5 minutes, or until shrimp are opaque. The lime juice will cook them. Mix in the tomatoes, onion, and cilantro until coated with lime juice; cover and refrigerate for 1 hour.\nRemove from the refrigerator, and mix in the Worcestershire sauce, ketchup, hot sauce, salt and pepper. We have our own hot sauce recipe, but you can use whatever hot sauce you like, or leave it out and let people add their own when serving.\nServe in glass tumblers and top with avocado pieces. Set out extra Worcestershire sauce, ketchup, lime wedges and hot sauce for people to individualize their dish. Serve with saltine crackers.",
    "pt": "1 h ",
    "ct": "",
    "tt": "",
    "i": "3830180.jpg",
    "o": "3830180.jpg,3741387.jpg,3706928.jpg,2473640.jpg,2428230.jpg,2314614.jpg",
    "st": "allrecipes"
}