{
    "id": 90451,
    "old_rating": "4.69828",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (8 ounce) beef rib-eye steaks, cut 3/4 inch thick",
        "1 teaspoon steak seasoning",
        "3 thick slices bacon",
        "2 teaspoons butter",
        "1/4 teaspoon Worcestershire sauce",
        "3/4 teaspoon Dijon mustard",
        "1/2 cup thinly sliced red bell pepper",
        "8 ounces small mushrooms, quartered",
        "2 tablespoons crumbled blue cheese"
    ],
    "nut": [
        "Calories > 665 kcal",
        "Carbs > 7.5 g",
        "Cholesterol > 137 mg",
        "Fat > 53.8 g",
        "Protein > 37.3 g",
        "Sodium > 1204 mg"
    ],
    "n": "Men Love This Steak",
    "a": "KLEVEAR",
    "r": "0",
    "s": 2,
    "des": "\"If you are looking for a special steak for your sweetie, look no further. This takes less than thirty minutes from start to finish; less if you choose to broil instead of BBQ. Flavorful and easy, this steak is tough to beat. I serve this with brown-and-serve sourdough bread or rolls. If you're really hungry, crumble some additional bacon and add a baked potato. Add candles and a bottle of full bodied red wine (like a cabernet from the Alexander Valley) for a romantic evening.\"",
    "ins": "Prepare an outdoor grill using charcoal briquettes stacked 2 to 3 deep. Season the steaks on both sides with steak seasoning.\nWhile the charcoal heats up, fry the bacon in a skillet over medium-high heat until crisp. Remove from the skillet and drain on paper towels. Leave grease in the pan.\nWhen the charcoal is covered with gray ashes, put the steaks on the grill. Cook for 12 minutes, turning once, or to your desired degree of doneness.\nWhile the steaks are cooking, stir the butter, Worcestershire sauce and mustard into the bacon grease. Cook and stir over medium-high heat until butter has melted. Add the red bell pepper and mushrooms; cook and stir until tender.\nTo serve, place steaks onto plates. Top with bacon, then blue cheese and then the vegetables. Serve immediately.",
    "pt": "10 m",
    "ct": "14 m",
    "tt": "24 m",
    "i": "843118.jpg",
    "o": "4480676.jpg,4464282.jpg,4055467.jpg,2903727.jpg,2490918.jpg,2376186.jpg",
    "st": "allrecipes"
}