{
    "id": 9048,
    "old_rating": "4.66387",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons vegetable oil",
        "2 cloves garlic, minced",
        "2 cups chopped onion",
        "1 red bell pepper, chopped",
        "1 green bell pepper, chopped",
        "2 cups chopped celery",
        "1 cup julienned carrots",
        "1 cup minced leek (optional)",
        "4 cups chicken stock",
        "salt and pepper to taste",
        "1/4 teaspoon hot pepper sauce",
        "1/4 teaspoon soy sauce (optional)",
        "6 ounces spinach, rinsed",
        "1/2 cup egg noodles",
        "1/2 pound skinless, boneless chicken breast halves, cut into bite size pieces"
    ],
    "nut": [
        "Calories > 198 kcal",
        "Carbs > 20 g",
        "Cholesterol > 30 mg",
        "Fat > 7.3 g",
        "Protein > 14.5 g",
        "Sodium > 649 mg"
    ],
    "n": "Lloyd's Healthy Chicken Zoopa",
    "a": "Lloyd Newman",
    "r": "0",
    "s": 5,
    "des": "\"This is a throw together soup that is satisfying and maybe even healthy. When you first saute the veggies in oil, you are making a 'moughe'. This is my own word, actually stolen from my daughter Amy (then 3 years old)!\"",
    "ins": "Heat oil in a large soup pot over medium heat. Add garlic, onion, red bell pepper, green bell pepper, celery, carrot and leek. Saute until onions are translucent and balance of veggies has been tossed through with hot oil. Add stock and season with salt and pepper to taste. If using hot pepper sauce and soy sauce, add now. Bring soup to a simmer and allow to simmer over low heat for about 40 minutes.\nAdd spinach and cover pot. (Note: Volume of spinach will appear to be too great for the pot; don't worry, just put it in - within a few minutes it will be reduced to size). Stir soup; add noodles. Stir again and add chicken strips. Make sure soup is still simmering. Exactly 5 minutes later, you will have a terrific hot soup. Serve hot!",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "3506360.jpg",
    "o": "4446185.jpg,3973029.jpg,3696263.jpg,3527201.jpg,3104861.jpg,2070011.jpg",
    "st": "allrecipes"
}