{
    "id": 90530,
    "old_rating": "4.26829",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 tablespoon olive oil",
        "1 small onion, finely chopped",
        "1 egg",
        "1 pound ground beef chuck",
        "1 cup plain dry bread crumbs",
        "1 teaspoon garlic salt",
        "1 teaspoon ground coriander",
        "1 teaspoon ground nutmeg",
        "2 tablespoons chopped fresh parsley",
        "ground black pepper to taste",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "2 tablespoons water, or as needed"
    ],
    "nut": [
        "Calories > 270 kcal",
        "Carbs > 18.2 g",
        "Cholesterol > 65 mg",
        "Fat > 15.8 g",
        "Protein > 13.3 g",
        "Sodium > 796 mg"
    ],
    "n": "The Meatball that Fell Off the Table",
    "a": "Karin Landers",
    "r": "0",
    "s": 6,
    "des": "\"Ok, so there are a ton of meatball recipes on this site. But nothing is quite like this one. Try it if you like savory, big meatballs to serve with whipped potatoes or egg noodles.\"",
    "ins": "Heat the oil in a large skillet over medium-high heat. Add onions; cook and stir until tender and lightly browned.\nWhisk the egg in a large bowl. Add the onion, ground beef, bread crumbs, garlic salt, coriander, nutmeg, parsley and pepper; mix well using your hands. Shape into meatballs using your hands or an ice cream scoop.\nPlace the meatballs into the skillet, and set over medium-high heat. Cover, and cook until browned on the bottom. Turn, and continue cooking covered, until meatballs are browned on all sides and no longer pink in the center, about 20 minutes. Drain on a paper towel, and pour excess grease out of the skillet.\nPour the cream of mushroom soup into the skillet, and stir in enough water so that it is still a fairly thick gravy. Return the meatballs to the skillet, and stir until coated. Serve over potatoes or egg noodles.",
    "pt": "30 m",
    "ct": "30 m",
    "tt": "1 h",
    "i": "85850.jpg",
    "o": "3636838.jpg,3636775.jpg,2571586.jpg,2350632.jpg,1056666.jpg,573626.jpg",
    "st": "allrecipes"
}