{
    "id": 9064,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 3/4 cups sifted all-purpose flour",
        "2 ounces grated Parmesan cheese",
        "2/3 cup butter, diced",
        "1 egg, beaten",
        "1 tablespoon olive oil",
        "8 ounces fresh mushrooms, sliced",
        "3 ounces Parma ham",
        "1/2 (14 ounce) can artichoke hearts, drained",
        "7/8 cup creme fraiche",
        "4 eggs",
        "1 teaspoon chopped flat leaf parsley",
        "1/3 cup milk",
        "salt to taste",
        "ground black pepper to taste"
    ],
    "nut": [
        "Calories > 615 kcal",
        "Carbs > 35.1 g",
        "Cholesterol > 279 mg",
        "Fat > 45.1 g",
        "Protein > 20.6 g",
        "Sodium > 839 mg"
    ],
    "n": "Artichoke, Mushroom and Parma Ham Tart",
    "a": "Christine L.",
    "r": "0",
    "s": 6,
    "des": "\"This dish can be served warm or at room temperature.  Use as an appetizer if the turkey is taking longer to roast than you had envisioned, or as a side dish with the meal. Originally submitted to ThanksgivingRecipe.com.\"",
    "ins": "Place flour, parmesan cheese, butter, and a pinch of salt in food processor.  Process briefly.  Add the egg and 1 tablespoon oil through feeder tube, adding extra oil if necessary; you should be able to bring the dough together in your hands.  Wrap in plastic, and chill for 1 hour.\nRoll out to fit a 9 inch quiche pan with a loose bottom.  Prick all over.  Chill for at least 2 hours, preferably overnight.\nLine pastry with foil, and cover bottom with uncooked beans.  Bake at 375 degrees F (190 degrees C) for 15 minutes.  Remove foil and beans, and cook for 5 more minutes.  Remove and cool.\nSaute; mushrooms in 1 tablespoon olive oil for 10 minutes.  Drain and cool.\nLay ham over the pastry base, and top with mushrooms and artichokes.  Beat together creme fraiche, eggs, parsley, and milk.  Season well with black pepper and salt; pour mixture over the ham and vegetables.  Bake for 40 minutes, until golden.  Serve warm or cold.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "259471.jpg",
    "o": "",
    "st": "allrecipes"
}