{
    "id": 9066,
    "old_rating": "4.33554",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1 cup mayonnaise",
        "1 egg, beaten",
        "1/4 cup finely chopped onion",
        "3 (10 ounce) packages frozen chopped broccoli",
        "8 ounces shredded sharp Cheddar cheese",
        "salt to taste",
        "ground black pepper to taste",
        "2 pinches paprika"
    ],
    "nut": [
        "Calories > 387 kcal",
        "Carbs > 9.5 g",
        "Cholesterol > 63 mg",
        "Fat > 34.1 g",
        "Protein > 11.3 g",
        "Sodium > 619 mg"
    ],
    "n": "Awesome Broccoli-Cheese Casserole",
    "a": "Stacy M. Polcyn",
    "r": "0",
    "s": 8,
    "des": "\"My mom used to make this easy recipe every Thanksgiving when I was little. We kids could never get enough! It was our very favorite Thanksgiving vegetable. If you have children, or have some coming to visit you as guests this Thanksgiving, I guarantee that they will eat (and enjoy) this veggie dish! Even though I rarely cook with canned condensed soups, I still make this yummy broccoli casserole during the holiday season. It's fabulous with a Christmas ham and potatoes au gratin too. (Note:  Be sure to use sharp Cheddar cheese for a nice full flavor.)  Mmmmmmm!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Butter a 9x13 inch baking dish.\nIn a medium bowl, whisk together condensed cream of mushroom soup, mayonnaise, egg and onion.\nPlace frozen broccoli into a very large mixing bowl. (I like to use my large stainless steel bowl to mix this recipe thoroughly.) Break up the frozen broccoli. Using a rubber spatula, scrape soup-mayonnaise mixture on top of broccoli, and mix well. Sprinkle on cheese and mix well. Spread mixture into prepared baking dish, and smooth top of casserole. Season to taste with salt, pepper and paprika.\nBake for 45 minutes to 1 hour in the preheated oven.",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4533558.jpg",
    "o": "4533558.jpg,4520312.jpg,4520311.jpg,4464067.jpg,3988615.jpg,2879956.jpg",
    "st": "allrecipes"
}