{
    "id": 9087,
    "old_rating": "4.61225",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "5 1/2 cups all-purpose flour",
        "3 tablespoons white sugar",
        "2 teaspoons salt",
        "1 1/2 teaspoons active dry yeast",
        "1 1/2 cups milk",
        "1/2 cup water",
        "5/8 cup butter"
    ],
    "nut": [
        "Calories > 97 kcal",
        "Carbs > 14.5 g",
        "Cholesterol > 8 mg",
        "Fat > 3.2 g",
        "Protein > 2.2 g",
        "Sodium > 141 mg"
    ],
    "n": "Buttery Pan Rolls",
    "a": "Charlotte",
    "r": "0",
    "s": 40,
    "des": "\"These are delicious. They take a little time to make but they are worth the effort. Originally submitted to ThanksgivingRecipe.com.\"",
    "ins": "Combine 3 cups of the flour, the sugar, salt and yeast in a large bowl. Stir well and set aside.\nCombine milk, water and 1/4 coup of the butter in a saucepan and cook over medium heat until butter melts, stirring occasionally. Remove from heat and let mixture cool to 120 to 130 degrees F (49 to 54 degrees C).\nGradually add milk to flour mixture and beat at low speed of an electric mixer for 30 seconds. Then beat for 2 minutes at high speed. Gradually stir in the remaining flour to make a soft dough.\nTurn dough out onto a lightly floured surface and knead for about 8 to 10 minutes or until dough is smooth and elastic. Place dough in a well greased bowl, turning to grease top. Cover and let rise in a warm place for about 1 hour and 15 minutes. Punch dough down, cover and let rest for 10 minutes.\nMelt remaining 1/4 cup plus 2 tablespoons butter.\nShape dough into 40 balls and dip each one in the melted butter. Place the balls in two greased  9 inch square baking pans. Cover and let rise for 45 minutes.\nBake in a preheated 375 degrees F (190 degrees C) oven for 15 minutes or until rolls are golden. Brush warm rolls with any remaining melted butter.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "182489.jpg",
    "o": "",
    "st": "allrecipes"
}