{
    "id": 9119,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups all-purpose flour",
        "2 cups cornmeal",
        "2 tablespoons baking powder",
        "1 teaspoon salt",
        "4 tablespoons white sugar",
        "5 eggs, beaten",
        "6 tablespoons butter, melted",
        "3 cups buttermilk",
        "2 tablespoons salt",
        "2 teaspoons ground white pepper",
        "2 teaspoons ground black pepper",
        "2 teaspoons cayenne pepper",
        "2 teaspoons onion powder",
        "4 teaspoons dried oregano",
        "2 teaspoons dried thyme",
        "6 tablespoons chopped fresh basil",
        "4 bay leaves",
        "1 cup minced onion",
        "1 cup chopped green onions",
        "1 cup chopped fresh parsley",
        "2 cups red bell pepper, chopped",
        "2 jalapeno pepper, seeded and minced",
        "2 tablespoons minced garlic",
        "1 cup butter",
        "2 cups chicken stock",
        "1 tablespoon hot pepper sauce",
        "2 cups evaporated milk",
        "7 eggs, beaten"
    ],
    "nut": [
        "Calories > 320 kcal",
        "Carbs > 29.8 g",
        "Cholesterol > 154 mg",
        "Fat > 18.6 g",
        "Protein > 9.8 g",
        "Sodium > 1184 mg"
    ],
    "n": "Creole Cornbread Stuffing",
    "a": "Kevin Ryan",
    "r": "0",
    "s": 20,
    "des": "\"This stuffing is chock full of spices to really make this recipe sing. This is enough for one turkey.\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Butter one 13x9 inch pan.\nPrepare the cornbread by combining the flour, cornmeal, baking powder, 1 teaspoon salt, and sugar; mix well.\nMix together the 5 eggs, 6 tablespoons melted butter, and buttermilk. Add wet to dry ingredients and mix until no dry ingredients remain. Pour into prepared pan.\nBake until top is browned and a toothpick comes out clean, about 55 minutes. Allow to cool completely.\nIn a small bowl combine the 2 tablespoons salt with the white pepper, black pepper, cayenne pepper, onion powder, oregano, thyme, basil, and bay leaves.\nIn another bowl combine the minced onions, green onions, parsley, red or green peppers, chili peppers, and garlic.\nMelt 1 cup butter in a large fry pan. Add the spices and cook for a few minutes. Add the vegetables and cook about 5 minutes. Do not allow the vegetables to brown. Add the stock and hot pepper sauce. Stir and cook 5 minutes more. Crumble the cornbread into the skillet and mix. Add the evaporated milk and 7 eggs OFF THE HEAT. Make sure to stir well when adding the eggs. Return to low heat and cook, stirring, for about 2 minutes. Remove the bay leaves. Place stuffing in a bowl and cover. Cool before stuffing turkey.",
    "pt": "35 m",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "",
    "o": "",
    "st": "allrecipes"
}