{
    "id": 91192,
    "old_rating": "4.73195",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 tablespoons butter",
        "1 teaspoon salt",
        "2 large red onions, thinly sliced",
        "2 large sweet onions, thinly sliced",
        "1 (48 fluid ounce) can chicken broth",
        "1 (14 ounce) can beef broth",
        "1/2 cup red wine",
        "1 tablespoon Worcestershire sauce",
        "2 sprigs fresh parsley",
        "1 sprig fresh thyme leaves",
        "1 bay leaf",
        "1 tablespoon balsamic vinegar",
        "salt and freshly ground black pepper to taste",
        "4 thick slices French or Italian bread",
        "8 slices Gruyere or Swiss cheese slices, room temperature",
        "1/2 cup shredded Asiago or mozzarella cheese, room temperature",
        "4 pinches paprika"
    ],
    "nut": [
        "Calories > 618 kcal",
        "Carbs > 39.5 g",
        "Cholesterol > 114 mg",
        "Fat > 35.9 g",
        "Protein > 29.7 g",
        "Sodium > 3336 mg"
    ],
    "n": "French Onion Soup Gratinee",
    "a": "Jersey Tomato",
    "r": "0",
    "s": 4,
    "des": "\"About as good as it gets! This is the version of French Onion Soup that people seek when they go to restaurants. I have been making it for 30 years and it never fails to please. It makes an exquisite presentation, too!\"",
    "ins": "Melt butter in a large pot over medium-high heat. Stir in salt, red onions and sweet onions. Cook 35 minutes, stirring frequently, until onions are caramelized and almost syrupy.\nMix chicken broth, beef broth, red wine and Worcestershire sauce into pot. Bundle the parsley, thyme, and bay leaf with twine and place in pot.  Simmer over medium heat for 20 minutes, stirring occasionally. Remove and discard the herbs. Reduce the heat to low, mix in vinegar and season with salt and pepper. Cover and keep over low heat to stay hot while you prepare the bread.\nPreheat oven broiler. Arrange bread slices on a baking sheet and broil 3 minutes, turning once, until well toasted on both sides. Remove from heat; do not turn off broiler.\nArrange 4 large oven safe bowls or crocks on a rimmed baking sheet. Fill each bowl 2/3 full with hot soup. Top each bowl with 1 slice toasted bread, 2 slice Gruyere cheese and 1/4 of the Asiago or mozzarella cheese. Sprinkle a little bit of paprika over the top of each one.\nBroil 5 minutes, or until bubbly and golden brown. As it softens, the cheese will cascade over the sides of the crock and form a beautifully melted crusty seal. Serve immediately!",
    "pt": "15 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "4539333.jpg",
    "o": "4539333.jpg,4536612.jpg,4517134.jpg,4516059.jpg,4515433.jpg,4514713.jpg",
    "st": "allrecipes"
}