{
    "id": 9148,
    "old_rating": "4.25",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 artichokes, uncooked and trimmed to the heart",
        "2 bulbs fennel bulbs, trimmed and quartered",
        "2 carrots",
        "1 baking potato",
        "1/2 head romaine lettuce",
        "1 medium head Belgian endive",
        "1 tomato",
        "2 ounces fontina cheese",
        "4 tablespoons olive oil",
        "2 tablespoons red wine vinegar",
        "1 teaspoon Dijon-style prepared mustard",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 315 kcal",
        "Carbs > 31.5 g",
        "Cholesterol > 16 mg",
        "Fat > 18.8 g",
        "Protein > 9.6 g",
        "Sodium > 280 mg"
    ],
    "n": "Insalata Cotta e Cruda",
    "a": "Christine L.",
    "r": "0",
    "s": 4,
    "des": "\"This elegant salad is best saved for the grownup table. If you feel like a change from fontina cheese, give Gruyere a go! Originally submitted to ThanksgivingRecipe.com.\"",
    "ins": "Cook the artichoke hearts, fennel, and carrots in salted boiling water until tender but firm, about 8 minutes. Drain. When cool, cut the artichoke hearts and fennel into thin wedges. Cut the carrots on the diagonal into thin slices. Boil the potato in water to cover until tender but firm. Drain, and when cool enough to handle, peel and cut into medium dice.\nCut the romaine into thin strips crosswise. Cut the endive into thin strips lengthwise. Core the tomato, and cut into medium dice.\nTrim the rind from the Fontina, and cut cheese into small matchsticks.\nMound the lettuces in a shallow bowl, and sprinkle with the tomato. Arrange the vegetables over the top. Sprinkle with the Fontina.\nIn a small bowl combine the olive oil, vinegar, and mustard. Salt and pepper to taste. Beat lightly with a fork. Drizzle the dressing over the salad, and toss.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}