{
    "id": 9153,
    "old_rating": "4.89474",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup apricot nectar",
        "1 cup apricot preserves",
        "2 tablespoons minced fresh ginger root",
        "1 tablespoon honey",
        "3/4 cup unsalted butter, softened",
        "3 tablespoons chopped fresh sage",
        "1 1/2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "2 tablespoons unsalted butter",
        "3 onions, thinly sliced",
        "6 ounces thinly sliced shallots",
        "22 pounds whole turkey",
        "1 (14.5 ounce) can chicken broth",
        "1 teaspoon chopped fresh thyme",
        "1 teaspoon dried sage",
        "1 (14.5 ounce) can chicken broth",
        "salt and pepper to taste"
    ],
    "nut": [
        "Calories > 808 kcal",
        "Carbs > 14.8 g",
        "Cholesterol > 287 mg",
        "Fat > 39.4 g",
        "Protein > 93.2 g",
        "Sodium > 507 mg"
    ],
    "n": "Ma Lipo's Apricot-Glazed Turkey with Roasted Onion and Shallot Gravy",
    "a": "Christine L.",
    "r": "0",
    "s": 22,
    "des": "\"The glaze give a wonderful sheen to the bird. A great addition to the menu is wild mushroom stuffing, cranberry sauce with raspberry vinegar, mashed sweet potatoes, rutabaga and parsnip casserole, green beans with walnuts, date and onion relish, pear chutney, and of course, pumpkin pie and butterscotch pie. If you don't have fresh thyme, substitute 1/2 teaspoon dried thyme. Originally submitted to ThanksgivingRecipe.com.\"",
    "ins": "For Glaze: Combine apricot nectar, preserves, ginger, and honey in a heavy small saucepan and bring to boil. Reduce heat to medium-low, and simmer until thickened and reduced to 1-1/4 cups, about 15 minutes.\nFor Herb Butter: Blend 3/4 cup unsalted butter at room temperature, 3 tablespoons chopped fresh sage, salt, and pepper in small bowl. Set aside.\nFor Onion Mixture: Melt 2 tablespoons unsalted butter in heavy large skillet over medium heat. Add onions and shallots: saute until very soft and light brown, about 20 minutes.\nGlaze, herb butter, and onion mixture can be prepared 1 day ahead. Cover separately and chill. Bring herb butter to room temperature before continuing.\nPosition rack in lowest third of oven. Preheat to 400 degrees F (205 degrees C).\nPat turkey dry with paper towels. Season turkey cavity with salt and pepper.  Place turkey on rack, and set in large roasting pan. Slide hand under skin of turkey breast to loosen skin. Spread half of herb butter over breast under skin. If stuffing turkey, spoon stuffing into main cavity. Place remaining herb butter in small saucepan. Stir over low heat until melted. Brush butter over outside of turkey. Tie legs together loosely to hold shape of turkey.\nRoast turkey for 30 minutes. Reduce oven temperature to 325 degrees F (165 degrees C). Roast turkey 1 hour 30 minutes, basting occasionally with pan drippings. Tent turkey with heavy duty foil; roast 45 minutes longer. Add onion mixture, 1 can broth, thyme, and 1/2 teaspoon chopped fresh sage to pan.  Roast 15 minutes.  Brush 1/2 cup hot glaze over turkey. Continue to roast turkey uncovered until meat thermometer inserted into thickest part of thigh registers 180 degrees F, or until juices run clear when thickest part of thigh is pierced with skewer  Brush occasionally with glaze, and add more broth to pan if liquid evaporates.  Bake about 40 minutes longer for unstuffed turkey, and about 1 hour 10 minutes longer for stuffed turkey.  Place turkey on platter, tent with foil.  Let stand 30 minutes.  Reserve mixture in pan for gravy.\nPour contents of roasting pan into strainer set over large bowl.  Spoon fat from pan juices in bowl. Transfer onion mixture to blender.  Add 1 cup pan juices to blender, and puree until smooth, adding more pan juices and chicken broth if necessary to thin sauce to desired consistency.  Transfer sauce to heavy large saucepan, and bring to boil.  Cook until color deepens, skimming off any foam,  about 5 minutes.  Season with salt and pepper.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "4461732.jpg",
    "o": "",
    "st": "allrecipes"
}