{
    "id": 91765,
    "old_rating": "4.16667",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "Homemade Mayonnaise:",
        "2 egg yolks, room temperature",
        "1 clove garlic, pressed",
        "1/2 cup vegetable oil",
        "1 pinch salt and pepper to taste",
        "2 tablespoons red wine vinegar, or to taste",
        "12 eggs",
        "1 shallot, minced",
        "1 (6 ounce) can salmon, drained and flaked",
        "1 pinch salt and pepper to taste"
    ],
    "nut": [
        "Calories > 94 kcal",
        "Carbs > 0.7 g",
        "Cholesterol > 113 mg",
        "Fat > 7.9 g",
        "Protein > 5.1 g",
        "Sodium > 61 mg"
    ],
    "n": "Salmon Deviled Eggs with Homemade Mayonnaise",
    "a": "DCTINK",
    "r": "0",
    "s": 24,
    "des": "\"This is a recipe my mother, who is French, has used for years.  It is awesome and easy.  A delicious twist on the traditional deviled eggs.\"",
    "ins": "To make the mayonnaise, beat the egg yolks in a medium bowl with an electric mixer or hand blender. Slowly blend in the oil, one tablespoon at a time while mixing constantly. Continue to add oil until the consistency is a little thicker than regular mayonnaise. Pierce the garlic clove, and stir it around in the mixture until it releases its juice. Remove the garlic and season with salt and pepper. Mix in the red wine vinegar 1 teaspoon at a time. Go slow, this will thin the mayonnaise a bit.\nPlace the eggs in a large pot with enough water to cover. Bring to a boil, then simmer for 10 minutes. Remove from the heat, drain and cool. Peel off the shells, and cut eggs in half lengthwise. Remove the yolks, and place them into a medium bowl. Place the egg whites on a serving plate.\nTo the yolks, add shallot, salmon, 1/2 cup of the mayonnaise, salt and pepper. Mix until well blended. If the mixture seems dry, stir in more mayonnaise. Spoon into the egg white halves and chill or serve.",
    "pt": "20 m",
    "ct": "20 m",
    "tt": "40 m",
    "i": "3929896.jpg",
    "o": "",
    "st": "allrecipes"
}