{
    "id": 91837,
    "old_rating": "4.29032",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "8 medium red potatoes, scrubbed",
        "1 pound clams in shell, scrubbed",
        "1 pound mussels, cleaned and debearded",
        "1/2 pound unpeeled large shrimp",
        "1 (48 fluid ounce) can chicken broth",
        "1/4 cup dry vermouth (optional)",
        "1 1/2 cups butter, divided",
        "1 loaf French bread"
    ],
    "nut": [
        "Calories > 1383 kcal",
        "Carbs > 137.4 g",
        "Cholesterol > 294 mg",
        "Fat > 74.1 g",
        "Protein > 41.6 g",
        "Sodium > 3133 mg"
    ],
    "n": "Clam Bake",
    "a": "DENISEK1",
    "r": "0",
    "s": 4,
    "des": "\"This is the most fun you can have with your seafood. It started with the idea of a fun get-together clam bake then took off with a life of its own. This recipe is a general guide. Have fun, mix and match your favorite seafood. I would ask your fish monger what is fresh, and then decide what seafood to add. I've even added a whole octopus before. Serve with a nice white wine, turn on some music and have fun. Great outdoor meal.\"",
    "ins": "Place a potatoes in a layer in the bottom of a large pot. Cover with a layer of clams, then mussels, and finally the shrimp. Pour in the vermouth and enough chicken broth to fill the pot halfway. You may not need all of the broth, depending on the size of your pot. Cut a half cup of the butter into cubes and place on top of the seafood. Cover with a lid, and seal tightly with aluminum foil.\nBring to a boil, then simmer over medium-low heat for 45 minutes. Remove from the heat, and carefully remove the foil and lid. Remove the seafood and potatoes from the liquid and serve on a large platter, family-style.\nMelt 1/2 cup of reserved butter, and divide into 4 individual dishes for dipping. Serve with French bread and remaining softened butter for the bread.",
    "pt": "20 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "37314.jpg",
    "o": "",
    "st": "allrecipes"
}