{
    "id": 91954,
    "old_rating": "4.21429",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 medium eggplant, thinly sliced",
        "1/4 cup vegetable oil",
        "2 tablespoons butter",
        "1 large onion, chopped",
        "1 clove garlic, chopped",
        "1 pound ground veal",
        "salt and pepper to taste",
        "1 tablespoon tomato paste",
        "2 tablespoons chopped fresh parsley",
        "1/2 cup beef stock",
        "1/4 cup bread crumbs",
        "2 tablespoons all-purpose flour",
        "2 tablespoons butter",
        "1 egg yolk, beaten",
        "1 cup milk",
        "1/2 cup feta cheese"
    ],
    "nut": [
        "Calories > 408 kcal",
        "Carbs > 21.4 g",
        "Cholesterol > 130 mg",
        "Fat > 27.4 g",
        "Protein > 21 g",
        "Sodium > 476 mg"
    ],
    "n": "Veal and Eggplant Moussaka",
    "a": "Tina Marie",
    "r": "0",
    "s": 6,
    "des": "\"This Greek dish is fantastic served with any kind of potatoes as a main dish or makes a great appetizer as well.  Guaranteed to be a hit with guests!\"",
    "ins": "Preheat your oven's broiler. Grease a 9 inch square baking dish.\nBrush the eggplant slices with oil, and place on a baking sheet. Broil until browned on one side, about 5 minutes. Set oven to 350 degrees F (175 degrees C).\nMelt 2 tablespoons of  butter in a large skillet over medium heat. Add onions and garlic; cook and stir until softened. Crumble in the veal, and cook until evenly browned. Season with salt and pepper, and stir in the tomato paste, parsley and beef stock. Simmer over low heat for 15 minutes. Stir in the bread crumbs, reserving 1 tablespoon for later, remove from the heat and set aside.\nMelt the remaining butter in a small saucepan over medium heat. Stir in the flour until smooth, then gradually stir in the milk so that no lumps form. Simmer, stirring constantly, until thickened. Remove from the heat and whisk in the egg yolk.\nPlace a layer of eggplant on the bottom of the prepared baking dish. Top with half of the veal mixture, and half of the feta cheese. Repeat the layers, then place remaining eggplant in a layer on top. Pour the sauce over all, and sprinkle with reserved bread crumbs.\nBake for 45 minutes, uncovered, in the preheated oven, or until browned and bubbly.",
    "pt": "30 m",
    "ct": "45 m",
    "tt": "1 h ",
    "i": "1115763.jpg",
    "o": "",
    "st": "allrecipes"
}