{
    "id": 92584,
    "old_rating": "4.44444",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 eggs, beaten",
        "1 cup Italian seasoned dry bread crumbs",
        "1/2 cup Parmesan cheese",
        "ground black pepper to taste",
        "1 1/2 pounds skinless, boneless chicken breast halves - cut into cubes",
        "1/4 cup olive oil",
        "1 pound fresh mushrooms, sliced",
        "1 large onion, chopped",
        "1/2 cup white wine",
        "1/2 cup pepperoncini, or amount desired"
    ],
    "nut": [
        "Calories > 599 kcal",
        "Carbs > 30.8 g",
        "Cholesterol > 206 mg",
        "Fat > 26.4 g",
        "Protein > 53.6 g",
        "Sodium > 1406 mg"
    ],
    "n": "Chicken Pepperoncini",
    "a": "GECCOFOXX",
    "r": "0",
    "s": 4,
    "des": "\"When I was a kid, my mom used to make this as my birthday dinner. Now, I make it every chance I get. It's a fantastic dish that is one of my family's favorites. If you like things spicy, add an extra pepperoncini or two. If not, use a little less. Try it, You'll love it!\"",
    "ins": "Place the eggs in a shallow dish. Stir the bread crumbs, Parmesan cheese, and pepper together in a second shallow dish. Dip the chicken cubes first into the eggs, then coat evenly with the bread crumbs.\nHeat about half of the oil in a large skillet over medium heat. Stir in the chicken, and cook until browned on all sides, about 10 minutes. Remove the chicken and drain on a paper towel-covered plate. Add more oil to the skillet if needed. Stir in the mushrooms, onion, and wine. Cook and stir until the mushrooms are tender and have cooked down. This may take a good 15 minutes.\nReturn the chicken to the skillet and stir into the mushroom mixture. Use scissors to cut the pepperoncini into slices over the skillet to retain the pepper juices. Discard any stems. Simmer the chicken mixture, stirring occasionally, 5 to 10 minutes more before serving.",
    "pt": "15 m",
    "ct": "45 m",
    "tt": "1 h",
    "i": "21070.jpg",
    "o": "",
    "st": "allrecipes"
}