{
    "id": 9263,
    "old_rating": "4.78",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups chopped dried mixed fruit",
        "1 cup roughly chopped glace cherries",
        "1/4 cup candied mixed citrus peel",
        "1/2 cup chopped walnuts",
        "1 1/2 cups white sugar",
        "3/4 cup butter",
        "1 cup milk",
        "1 teaspoon mixed spice",
        "1/2 teaspoon baking soda",
        "2 2/3 cups sifted self-rising flour",
        "2 eggs"
    ],
    "nut": [
        "Calories > 558 kcal",
        "Carbs > 92.1 g",
        "Cholesterol > 76 mg",
        "Fat > 19.6 g",
        "Protein > 7.2 g",
        "Sodium > 625 mg"
    ],
    "n": "Boiled Fruitcake",
    "a": "Mark Richards",
    "r": "0",
    "s": 10,
    "des": "\"This recipe produces a really moist fruitcake. It was given to me by my mom, and it's really easy. My mom uses it for Christmas cake by icing it. I use it for birthdays, Christmas, or just for a treat. If mixed spice is unavailable, substitute with a pinch each of cinnamon, coriander, cloves, nutmeg, and ginger.\"",
    "ins": "Preheat oven to 325 degrees F (160 degrees C). Line one 8x3 inch round cake tin with parchment paper.\nIn a medium saucepan, combine mixed fruit, cherries, citrus peel, walnuts, sugar, butter, milk, mixed spice, and baking soda. Bring to a boil, and simmer for 5 minutes. Let the mixture cool to room temperature.\nStir in flour and eggs. Pour into the prepared pan. Wrap outside of pan with brown paper or newspaper.\nBake at 325 degrees F (160 degrees C) for 40 minutes, then reduce temperature to 300 degrees F (150 degrees C), and continue to baking cake for 1 1/2 hours. Remove cake from oven, and allow to cool in the tin for 5 minutes, then turn it out onto a cooling rack, remove paper, and cool completely. Cake can be stored for up to 6 months wrapped in foil and in an airtight tin.",
    "pt": "20 m",
    "ct": "2 h ",
    "tt": "2 h ",
    "i": "809713.jpg",
    "o": "",
    "st": "allrecipes"
}