{
    "id": 92634,
    "old_rating": "4.65686",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (5 pound) boneless rib-eye roast, left at room temperature for 2 hours before cooking",
        "2 tablespoons olive oil",
        "1 tablespoon salt",
        "2 tablespoons ground black pepper (you can grind whole peppercorns in a blender)",
        "8 large garlic cloves, minced",
        "2 tablespoons minced fresh rosemary",
        "1/2 teaspoon minced fresh rosemary for the sauce",
        "2 (8 ounce) packages baby bella or domestic white mushrooms, sliced",
        "1 cup chicken broth",
        "3/4 cup red wine",
        "1 tablespoon Dijon mustard",
        "1 teaspoon cornstarch dissolved in",
        "2 teaspoons water"
    ],
    "nut": [
        "Calories > 355 kcal",
        "Carbs > 6 g",
        "Cholesterol > 99 mg",
        "Fat > 17.8 g",
        "Protein > 36.4 g",
        "Sodium > 1151 mg"
    ],
    "n": "Boneless Garlic and Rosemary Rubbed Prime Rib with Red Wine Mushroom Sauce",
    "a": "USA WEEKEND columnist Pam Anderson",
    "r": "0",
    "s": 8,
    "des": "\"Anchor dinner with a festive rib roast. For great color and flavor, sear it first in a skillet, then rub the meat all over with minced garlic and rosemary before popping it in the oven.\"",
    "ins": "Adjust oven rack to center position and heat oven to 250 degrees F.\nHeat a large (12-inch) skillet over medium-high heat. Rub roast on all sides with oil, salt and pepper. Turn on exhaust fan, add roast to hot skillet and brown on all sides, about 10 minutes total. Transfer roast to a plate. When cool enough to handle, rub garlic and rosemary all over.\nMeanwhile, pour off all but 2 Tbs. of the beef drippings. Add mushrooms to hot skillet and saute until well browned, about 8 minutes. Mix broth, wine and mustard; add to mushrooms and simmer to blend flavors and reduce slightly, about 3 minutes. Pour mushroom sauce into a bowl; set aside.\nSet a wire rack over the skillet and set roast on rack. Slow-roast in oven until roast reaches an internal temperature of 135 degrees F for medium-rare and 140 degrees F for medium, 2 1/2 to 3 hours.\nTransfer roast to a cutting board; remove rack from skillet. Pour off excess fat, if any. Set skillet over medium-high heat; return mushroom sauce to pan heat to a simmer. Add cornstarch and continue to simmer until sauce thickens slightly, about a minute. Carve meat and serve with the sauce.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "11411.jpg",
    "o": "4425710.jpg,4389698.jpg,4374873.jpg,4369560.jpg,2526196.jpg,1080105.jpg",
    "st": "allrecipes"
}