{
    "id": 9265,
    "old_rating": "4.69149",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 (8 ounce) containers candied cherries",
        "1 (8 ounce) container candied mixed citrus peel",
        "2 cups raisins",
        "1 cup dried currants",
        "1 cup dates, pitted and chopped",
        "2 (2.25 ounce) packages blanched slivered almonds",
        "1/2 cup brandy",
        "1/2 cup all-purpose flour",
        "2 cups all-purpose flour",
        "1/2 teaspoon baking soda",
        "1 teaspoon ground cloves",
        "1 teaspoon ground allspice",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon salt",
        "1 cup butter",
        "2 cups packed brown sugar",
        "6 eggs",
        "3/4 cup molasses",
        "3/4 cup apple juice"
    ],
    "nut": [
        "Calories > 645 kcal",
        "Carbs > 113.4 g",
        "Cholesterol > 100 mg",
        "Fat > 17.8 g",
        "Protein > 7.4 g",
        "Sodium > 256 mg"
    ],
    "n": "Christmas Cake",
    "a": "Carol",
    "r": "0",
    "s": 16,
    "des": "\"This cake is a rich, dark, moist fruit cake, very flavorful at Christmas. Try icing with almond paste for a more festive touch. This recipe is started in October or November so as to let it mellow before the holidays. I remember very well my mother storing her fruit cake in an old butter churn that belonged to my grandmother and great grandmother. I wish that I had that old crock.\"",
    "ins": "In a medium bowl, combine cherries, citrus peel, raisins, currants, dates, and almonds. Stir in brandy; let stand 2 hours, or overnight. Dredge soaked fruit with 1/2 cup flour.\nPreheat oven to 275 degrees F (135 degrees C). Grease an 8x8x3 inch fruit cake pan, line with parchment paper, and grease again. In a small bowl, mix  together 2 cups flour, baking soda, cloves, allspice, cinnamon, and salt; set aside.\nIn a large bowl, cream butter until light. Gradually blend in brown sugar and eggs.  Mix together molasses and apple juice. Beat into butter mixture alternately with flour mixture, making 4 dry and 3 liquid additions. Fold in floured fruit. Turn batter into prepared pan.\nBake in preheated oven for 3 to 3 1/2 hours, or until a toothpick inserted into the center of cake comes out clean. Remove from pan, and lift off paper. Cool cake completely, then wrap loosely in waxed paper. Store in an airtight container.",
    "pt": "30 m",
    "ct": "3 h ",
    "tt": "6 h",
    "i": "146343.jpg",
    "o": "2994463.jpg,2994329.jpg,2924323.jpg,2313703.jpg,1779257.jpg,941280.jpg",
    "st": "allrecipes"
}