{
    "id": 9298,
    "old_rating": "4.4878",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup butter, melted",
        "1 1/4 cups vanilla wafer crumbs",
        "1/4 cup white sugar",
        "3 (8 ounce) packages cream cheese, softened",
        "1 (14 ounce) can sweetened condensed milk",
        "3 eggs",
        "1/4 cup dark rum",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon ground nutmeg",
        "1 tablespoon cornstarch",
        "1 cup water",
        "2 tablespoons butter, melted",
        "1/3 cup packed light brown sugar",
        "2 tablespoons dark rum",
        "1/2 cup chopped pecans"
    ],
    "nut": [
        "Calories > 550 kcal",
        "Carbs > 44.2 g",
        "Cholesterol > 134 mg",
        "Fat > 36.3 g",
        "Protein > 9.7 g",
        "Sodium > 325 mg"
    ],
    "n": "Eggnog Cheesecake I",
    "a": "Eleanor Johnson",
    "r": "0",
    "s": 12,
    "des": "\"A simple easy-to-make cheesecake served with a yummy Pecan Caramel Sauce. It's perfect for holiday get-togethers.\"",
    "ins": "Preheat oven to 300 degrees F (150 degrees C).\nIn a large bowl, combine 1/4 cup butter, wafer crumbs, and white sugar. Press firmly on the bottom of a 9 inch springform pan.\nIn a large bowl, beat the cream cheese until fluffy. Gradually beat in the sweetened condensed milk until smooth. Mix in the eggs. Stir in 1/4 cup rum, vanilla extract, and nutmeg.  Pour into the prepared pan.\nBake in preheated oven for 40 to 50 minutes, or until center of cake springs back when lightly touched. Allow to cool, then chill.\nTo Make The Pecan Caramel Sauce: In a small bowl, dissolve the cornstarch in 1 cup of water. In a medium saucepan, melt 2 tablespoons butter. Stir in brown sugar and the cornstarch mixture. Bring to a boil, stirring constantly. Reduce heat, and simmer for 10 minutes. Remove from heat, and add 2 tablespoons dark rum.  Allow to cool. Just before serving, stir the pecans into the sauce.\nRemove the sides of the springform pan from the cooled cheesecake. Serve with the Pecan Caramel Sauce.",
    "pt": "40 m",
    "ct": "1 h ",
    "tt": "6 h",
    "i": "1851191.jpg",
    "o": "",
    "st": "allrecipes"
}