{
    "id": 9303,
    "old_rating": "4.64655",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 eggs",
        "1 cup white sugar",
        "2/3 cup solid pack pumpkin puree",
        "1 teaspoon lemon juice",
        "3/4 cup all-purpose flour",
        "2 teaspoons ground cinnamon",
        "1/2 teaspoon salt",
        "1 teaspoon baking powder",
        "1 teaspoon ground ginger",
        "1 cup chopped pecans",
        "1 cup confectioners' sugar",
        "1/2 teaspoon vanilla extract",
        "4 tablespoons butter",
        "8 ounces cream cheese"
    ],
    "nut": [
        "Calories > 383 kcal",
        "Carbs > 43.4 g",
        "Cholesterol > 93 mg",
        "Fat > 22 g",
        "Protein > 5.8 g",
        "Sodium > 326 mg"
    ],
    "n": "Pumpkin Roll",
    "a": "Tammy Elliott",
    "r": "0",
    "s": 10,
    "des": "\"This is a great dessert, especially nice for holidays, but it can be served anytime of the year.  The resulting pumpkin roll slices will impress your guests.  The pumpkin roll is not as hard to make as it sounds.  Be sure and use plain canned pumpkin and not pumpkin pie mix. Originally submitted to CakeRecipe.com.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).  Grease and flour a jellyroll pan (large cookie sheet with sides).\nIn a mixing bowl, beat eggs on high for five minutes.  Gradually add white sugar, pumpkin, and lemon juice.  Add flour, cinnamon, salt, baking powder, and ginger.  Spread batter evenly in pan.  Sprinkle pecans evenly on top, and press lightly into batter.\nBake for 12 to 15 minutes, or until it springs back when touched.  Loosen edges with a knife.  Turn out on two dishtowels that have been sprinkled with powdered sugar.  Roll up cake, and let cool for about 20 minutes.\nTo Make Filling:  Mix confectioners' sugar, vanilla, butter or margarine, and cream cheese together till smooth.\nUnroll pumpkin cake when cool, and spread with filling.   Reroll, and push aside the dishtowel.  Unroll long sheet of waxed paper.  Put pumpkin roll on waxed paper.  Dust pumpkin roll with powdered sugar.  Twist ends of waxed paper like a piece of candy.  Put pumpkin roll in refrigerator and chill overnight.  Before slicing, dust with powdered sugar.  Serve chilled.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "944541.jpg",
    "o": "4254983.jpg,4206701.jpg,4103705.jpg,4033125.jpg,3047393.jpg,3040923.jpg",
    "st": "allrecipes"
}