{
    "id": 9307,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 teaspoon white sugar",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "2 (.25 ounce) packages active dry yeast",
        "1/2 cup white sugar",
        "1/2 cup butter, melted",
        "2 teaspoons salt",
        "1 teaspoon lemon zest",
        "6 cups all-purpose flour",
        "4 eggs",
        "1/2 cup candied mixed fruit",
        "1 cup raisins",
        "3/4 cup pine nuts",
        "1 cup confectioners' sugar",
        "1 1/2 tablespoons water",
        "1/2 teaspoon vanilla extract (optional)",
        "1 cup cherries"
    ],
    "nut": [
        "Calories > 307 kcal",
        "Carbs > 51.5 g",
        "Cholesterol > 49 mg",
        "Fat > 8.7 g",
        "Protein > 7 g",
        "Sodium > 281 mg"
    ],
    "n": "Sugarplum Bread",
    "a": "Carol",
    "r": "0",
    "s": 20,
    "des": "\"What a lovely bread to serve at Christmas time--visions of sugar plums. I make a lot of sweet breads at the holidays and my family enjoys them. Baking is one of my hobbies which I cherish dearly. Slivered almonds can be substituted for pine nuts.\"",
    "ins": "Dissolve 1 teaspoon sugar in 1 cup warm water in large mixer bowl. Sprinkle in yeast. Let stand 10 minutes, then stir well.\nAdd 1/2 cup sugar, melted butter or margarine, salt, lemon rind, and 2 cups flour. Beat for 2 minutes at medium speed with electric mixer.  Add 2 cups more flour and eggs; beat 3 minutes. Stir in almost all remaining flour, using enough flour to make a soft dough.\nKnead dough on floured board until smooth and elastic, about 8 minutes. Place in lightly greased bowl.  Cover with greased waxed paper and a tea towel. Let rise in warm place 75 - 85 degrees F (25 - 30 degrees C)until doubled in volume, about 2 hours.\nPunch down dough.  Turn out onto a lightly floured board, and knead in raisins, candied fruit, and nuts.  Shape into two round loaves.  Place each in a well greased, 9 inch, round cake pan.  Cover with tea towel.  Let rise in warm place until doubled, 1 - 1 1/2 hours.\nBake at 350 degrees F ( 175 degrees C) for 45 to 55 minutes.  Remove from pans immediately. Cool on wire racks.\nMix together confectioners sugar, 1 1/2 tablespoons  water, and 1/2 teaspoon vanilla.  Spoon onto loaves. Decorate with cherries or almonds.  Alternatively, dust loaves with confectioners sugar.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "679321.jpg",
    "o": "",
    "st": "allrecipes"
}