{
    "id": 93109,
    "old_rating": "4.66304",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "5 large Granny Smith apples",
        "wooden craft sticks",
        "1 (14 ounce) package individually wrapped caramels, unwrapped",
        "2 tablespoons water",
        "7 ounces chocolate candy bar, broken into pieces",
        "2 tablespoons shortening, divided",
        "1 cup colored candy coating melts"
    ],
    "nut": [
        "Calories > 831 kcal",
        "Carbs > 131.6 g",
        "Cholesterol > 22 mg",
        "Fat > 34.8 g",
        "Protein > 8.1 g",
        "Sodium > 249 mg"
    ],
    "n": "Gourmet Caramel Apples",
    "a": "happiness05",
    "r": "0",
    "s": 5,
    "des": "\"These are the easiest and funnest gifts for anytime of season!  And they are delicious to eat too!\"",
    "ins": "Bring a large pot of water to a boil. Dip apples into boiling water briefly, using a slotted spoon, to remove any wax that may be present. Wipe dry, and set aside to cool. Insert sticks into the apples through the cores.\nLine a baking sheet with waxed paper and coat with cooking spray. Place the unwrapped caramels into a microwave-safe medium bowl along with 2 tablespoons of water. Cook on high for 2 minutes, then stir and continue cooking and stirring at 1 minute intervals until caramel is melted and smooth.\nHold apples by the stick, and dip into the caramel to coat. Set on waxed paper; refrigerate for about 15 minutes to set.\nHeat the chocolate with 1 tablespoon of shortening in a microwave-safe bowl until melted and smooth. Dip apples into the chocolate to cover the layer of caramel. Return to the waxed paper to set.\nMelt the candy melts in the microwave with the remaining shortening, stirring every 30 seconds until smooth. Use a fork or wooden stick to flick colored designs onto your apples for a finishing touch. Refrigerate until set, overnight is even better.",
    "pt": "5 m",
    "ct": "45 m",
    "tt": "50 m",
    "i": "496021.jpg",
    "o": "4069149.jpg,3267123.jpg,2850857.jpg,1051152.jpg,1012843.jpg,1012842.jpg",
    "st": "allrecipes"
}