{
    "id": 9317,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups cooked wild rice ",
        "2/3 cup chopped toasted hazelnuts",
        "2 Granny Smith apples - peeled, cored and chopped",
        "1/2 cup chopped onion",
        "2 teaspoons ground savory",
        "3 tablespoons chopped fresh parsley",
        "1 (12 pound) fresh goose",
        "4 cups water",
        "salt to taste",
        "1 1/2 tablespoons all-purpose flour",
        "freshly ground black pepper"
    ],
    "nut": [
        "Calories > 589 kcal",
        "Carbs > 17.6 g",
        "Cholesterol > 142 mg",
        "Fat > 38.3 g",
        "Protein > 42.6 g",
        "Sodium > 114 mg"
    ],
    "n": "Roast Goose with Wild Rice Stuffing",
    "a": "Christine L.",
    "r": "0",
    "s": 12,
    "des": "\"Another great roasted goose recipe. Perfect for Christmas dinner!\"",
    "ins": "Mix together the cooked rice, nuts, apples, onion, and herbs.  Season to taste with salt and pepper.\nRemove the neck, heart, and gizzard from the goose.  Wash the bird inside and out.  Pat dry.  Fill the cavity of the goose with the stuffing, skewer closed, and lace string around the skewers.  Truss the bird.\nRoast in a preheated 325 degree F (165 degree C) oven, breast side down, for 1 1/2 hours.  Draw off the fat as it accumulates.  Turn, and roast another 1 1/2 hours.  When done, the juices should run clear when the bird is pricked where the thigh attaches to the body.  Remove trussing strings and skewers before carving.\nWhile the goose is roasting, place the neck, heart, and gizzard in a saucepan with water. Let simmer gently, partially covered, for several hours, until reduced to slightly less than 2 cups. Season the broth to taste with salt.\nPour off all but 1 tablespoon of the fat from the roasting pan.  Sprinkle a little flour over the bottom, 1 to 2 tablespoons, depending on how thick you like your gravy.  Set the pan over low heat.  Stir for 2 minutes, scraping up all the browned bits.  Add the reserved goose broth to the pan, and whisk until smooth. Taste and season with salt and pepper.  Serve in a gravy boat alongside the bird.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "3427496.jpg",
    "o": "",
    "st": "allrecipes"
}