{
    "id": 93220,
    "old_rating": "4.6",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 split pieces of alder wood ",
        "4 acorn squash, halved and seeded",
        "8 ounces sliced maple cured bacon",
        "1 cup butter",
        "1 quart chicken stock",
        "1 quart water",
        "salt to taste",
        "1 tablespoon cumin",
        "4 cups sour cream",
        "1 cup parsley",
        "2 cups chopped fresh cilantro",
        "1 tablespoon paprika",
        "1/4 teaspoon cayenne pepper"
    ],
    "nut": [
        "Calories > 557 kcal",
        "Carbs > 26.7 g",
        "Cholesterol > 105 mg",
        "Fat > 48.7 g",
        "Protein > 8.2 g",
        "Sodium > 698 mg"
    ],
    "n": "Alder Wood-Smoked Acorn Squash Soup",
    "a": "The Kilted Hare",
    "r": "0",
    "s": 10,
    "des": "\"This is a very Pacific NW-American soup that once made, tastes better after a few days in the fridge. Make a lot because the smoking time is an hour to two. This recipe can be cut in half if need be.\"",
    "ins": "Prepare charcoal for smoking: Light and wait for the gray ash to cover at least 90 percent of the coals. Place the split wood on the coals and wait about 10 minutes before reducing the air flow to make it burn slower.\nArrange the squash halves cut side down on the grilling surface and close the lid. Slow smoke for 2 hours or less if you prefer them less smoky - as long as they are tender.\nPlace bacon in a skillet over medium heat. Cook until browned and crisp; remove and drain on paper towels.\nOnce the squash are smoked, scoop the flesh out of the skins with a large spoon and transfer to a food processor. Process until smooth, adding butter and half of the water. Transfer to a soup pot and stir in the chicken broth and remaining water. Season with cumin, parsley and paprika; simmer over low heat for 40 minutes.\nTo serve, ladle soup into bowls and top with a dollop of sour cream, a generous amount of crumbled bacon and cilantro. Dust lightly with cayenne pepper.",
    "pt": "30 m",
    "ct": "2 h",
    "tt": "2 h ",
    "i": "636108.jpg",
    "o": "",
    "st": "allrecipes"
}