{
    "id": 93330,
    "old_rating": "4.37931",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 1/2 pounds lean ground pork",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground cinnamon",
        "1 large onion, chopped",
        "1 teaspoon salt",
        "1 stalk celery, chopped",
        "1 bay leaf",
        "3 cups water",
        "4 baking potatoes, peeled and cubed",
        "2 (15 ounce) packages refrigerated pie crusts"
    ],
    "nut": [
        "Calories > 437 kcal",
        "Carbs > 32.6 g",
        "Cholesterol > 46 mg",
        "Fat > 26.4 g",
        "Protein > 16.8 g",
        "Sodium > 440 mg"
    ],
    "n": "Tourtiers (French Pork Pie)",
    "a": "tldesjar",
    "r": "0",
    "s": 16,
    "des": "\"This is the recipe my grandmother used to make.  It only uses pork for the pie and is delicious.  I make one for my father every Christmas Eve and he loves it!\"",
    "ins": "In a large saucepan, mix together the ground pork, cloves, cinnamon, onion, salt, celery, bay leaf and water. The water will help break up the raw pork. Simmer over medium-low heat for about 3 hours, or until the water has evaporated. Remove from the heat and discard the bay leaf.\nTowards the end of the pork cooking time, place the potatoes into a separate saucepan and fill with enough water to cover. Bring to a boil and cook until tender, about 10 minutes. Drain and mash potatoes. When the pork is done, stir the mashed potatoes into that pan until evenly blended.\nPreheat the oven to 375 degrees F (190 degrees C). Line two 9 inch pie plates with bottom crusts. Spoon equal amounts of the pork filling into each crust. Cover with top crusts and flute the edges to seal.\nBake for 45 minutes in the preheated oven, or until crust is golden brown.",
    "pt": "15 m",
    "ct": "4 h",
    "tt": "4 h ",
    "i": "239326.jpg",
    "o": "4404500.jpg,4389252.jpg,3029687.jpg,1453112.jpg,921745.jpg,921742.jpg",
    "st": "allrecipes"
}