{
    "id": 9346,
    "old_rating": "4.71106",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups chocolate sandwich cookie crumbs",
        "2 tablespoons butter, melted",
        "1/4 cup packed brown sugar",
        "1 teaspoon ground cinnamon",
        "2 pounds cream cheese, softened",
        "1 1/4 cups white sugar",
        "1/3 cup heavy whipping cream",
        "2 tablespoons all-purpose flour",
        "1 teaspoon vanilla extract",
        "4 eggs",
        "1 1/2 cups chocolate sandwich cookie crumbs",
        "16 ounces sour cream",
        "1/4 cup white sugar",
        "1 teaspoon vanilla extract",
        "1 cup heavy whipping cream",
        "1 1/2 cups semisweet chocolate chips",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 753 kcal",
        "Carbs > 62.9 g",
        "Cholesterol > 174 mg",
        "Fat > 52 g",
        "Protein > 11.2 g",
        "Sodium > 348 mg"
    ],
    "n": "Chocolate Cookie Cheesecake",
    "a": "Millie Ellis",
    "r": "0",
    "s": 14,
    "des": "\"I don't know what to say about this recipe other than it is decadent and addictive.\"",
    "ins": "Combine 2 cups cookie crumbs, melted butter, brown sugar, and cinnamon in a medium bowl; firmly press mixture evenly onto bottom and 1 inch up sides of a 10-inch springform pan. Bake at 350 degrees F (175 degrees C) for 5 minutes; set aside.\nIn a large bowl, beat cream cheese until smooth. Gradually mix in 1 1/4 cups sugar, 1/3 cup whipping cream, flour, and 1 teaspoon vanilla. Beat in eggs, one at a time, beating after each addition. Pour 1/3 of batter into prepared pan. Top with 1 1/2 cups cookie pieces; pour in remaining batter.\nBake at 350 degrees F (175 degrees C) for 45 minutes. Remove cake from oven. Combine sour cream, 1/4 cup sugar, and 1 teaspoon vanilla; spread evenly on cheesecake. Continue baking for 7 minutes. Turn oven off and leave in oven 30 minutes. Remove cheesecake, and let cool completely on a wire rack.\nCombine 1 cup whipping cream and chocolate chips in a saucepan; stir over low heat until chocolate melts,  and then stir in 1 teaspoon vanilla. Pour mixture over cheesecake while still warm. Refrigerate until serving time. Should be at least 8 hours for refrigerator time, remove about 1/2 hour to 1 hour before serving, remove ring from springform pan, decorate to choice and get out your fork!",
    "pt": "30 m",
    "ct": "1 h",
    "tt": "11 h",
    "i": "4504447.jpg",
    "o": "4504447.jpg,4504445.jpg,4215816.jpg,4034738.jpg,3908753.jpg,3852391.jpg",
    "st": "allrecipes"
}