{
    "id": 9349,
    "old_rating": "4.42105",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 tablespoons butter",
        "1 cup fresh sage",
        "1 1/2 tablespoons freshly ground black pepper",
        "2 teaspoons freshly ground cumin seed",
        "1 (3 pound) boneless pork loin roast - trimmed, rolled, and tied",
        "2 tablespoons olive oil",
        "3 bulbs fennel, trimmed, tops reserved",
        "1 1/2 cups orange juice",
        "4 red onions with peel, halved",
        "1/2 cup chicken stock",
        "1 tablespoon balsamic vinegar",
        "salt to taste"
    ],
    "nut": [
        "Calories > 311 kcal",
        "Carbs > 14.7 g",
        "Cholesterol > 73 mg",
        "Fat > 17.4 g",
        "Protein > 23.9 g",
        "Sodium > 191 mg"
    ],
    "n": "Roasted Pork, Fennel, and Onions",
    "a": "Christine L.",
    "r": "0",
    "s": 10,
    "des": "\"Great for big feasts! Olive oil can be substituted for butter, if you'd rather eat olive oil than butter.\"",
    "ins": "Preheat oven to 400 degrees F (200 degrees C).\nMelt butter in a skillet over medium-high heat. Add 1/2 cup sage. Cook and stir until leaves are slightly crisp, about 1 minute. Remove leaves with a slotted spoon, and drain on paper towels. Cool, wrap in paper towels, and seal in a plastic bag. Set aside. Reserve the butter.\nMix the pepper and cumin in a small bowl. Rinse roast and pat dry; rub evenly with the pepper and cumin. Tuck remaining 1/2 cup sage leaves under the strings on the smooth (fattiest) side of the roast. Set the pork, herb side up, on a rack in a roasting pan.\nSpread olive oil in the bottom of a medium baking dish. Thickly slice fennel and place in the dish. Toss to coat with the olive oil, and drizzle with 3/4 cup orange juice. Place onions in the dish cut side down.\nPlace roast on the center rack in the preheated oven. Place fennel and onions on lower rack. Bake the pork and vegetables 1 hour, or until pork reaches a minimum internal temperature of 145 degrees F (63 degrees C) and vegetables are tender. Turn fennel once during bake time. Reserving drippings, transfer meat to a platter and keep warm; let stand at least 10 minutes. Keep the vegetables warm in the baking dish.\nPlace the roasting pan with reserved drippings over high heat on the stove top, and mix in the reserved butter from Step 1, the remaining 3/4 cup orange juice, stock, and vinegar. Bring to a boil, and stir to scrape up any browned bits in the pan. Cook, stirring often, 10 minutes, or until reduced by about 1/2.\nArrange onions and fennel around the pork. Garnish with fennel tops, sprinkle with the fried sage leaves, and season with salt to serve.",
    "pt": "30 m",
    "ct": "1 h ",
    "tt": "1 h ",
    "i": "70923.jpg",
    "o": "",
    "st": "allrecipes"
}