{
    "id": 9359,
    "old_rating": "3.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/2 cup sifted cake flour",
        "1/4 cup unsweetened cocoa powder",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/2 cup white sugar",
        "3 eggs, separated",
        "1/4 cup milk",
        "1/8 cup confectioners' sugar",
        "1 1/2 cups whipped cream",
        "2 cups heavy whipping cream",
        "8 (1 ounce) squares semisweet chocolate, melted",
        "1/4 cup butter, softened",
        "1/8 cup confectioners' sugar",
        "1/2 teaspoon green food coloring",
        "8 ounces marzipan"
    ],
    "nut": [
        "Calories > 540 kcal",
        "Carbs > 49.3 g",
        "Cholesterol > 141 mg",
        "Fat > 37.5 g",
        "Protein > 7.7 g",
        "Sodium > 196 mg"
    ],
    "n": "Classic Yule Log",
    "a": "AUTUMN/FALL",
    "r": "0",
    "s": 10,
    "des": "\"A festive holiday cake. Merry Christmas! You will need cinnamon red hard candies and snowmen candy for decorations.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a 15x10-inch jelly roll pan. Line with waxed paper. Grease paper.\nSift together flour, cocoa, baking powder, and salt.\nBeat together sugar and egg yolks at high speed until light and fluffy. At low speed, alternately beat milk and flour mixture into egg mixture.\nUsing clean beaters, beat egg whites at high speed until stiff, but not dry, peaks form. Fold one third of beaten whites into batter. Fold in remaining whites. Spread batter in prepared pan; smooth top.\nBake cake at 350 degrees F (175 degrees C) until set, 12 minutes.\nDust a clean cloth with confectioners' sugar. Turn cake out onto prepared cloth. Remove waxed paper. Trim cake edges. Starting with a long side, roll up cake, jelly-roll style. Transfer, seam-side down, to a wire rack to cool for 30 minutes.\nUnroll cake; remove cloth. Spread whipped cream over cake to within 1 inch of edges. Re-roll cake. Place, seam-side down, on serving plate.\nTo prepare frosting, in a small saucepan, bring heavy cream, melted chocolate, and butter to a boil over medium heat, stirring vigorously until blended. Remove from heat. Let stand until set. Spread frosting over top and sides of cake.\nTo prepare garnish, dust work surface with confectioners' sugar. Knead food coloring into marzipan until blended. Using a rolling pin dusted with confectioners' sugar, roll marzipan to a 1/8-inch thickness. Using a small knife, cut out leaves. Arrange leaves, cinnamon candies, and snowmen on top of cake and around plate. Dust with confectioners' sugar. Enjoy!",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "4370593.jpg",
    "o": "",
    "st": "allrecipes"
}