{
    "id": 9369,
    "old_rating": "4.52747",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 (18.25 ounce) package white cake mix",
        "3 egg whites",
        "1 1/3 cups buttermilk",
        "2 tablespoons vegetable oil",
        "1 (9 ounce) package yellow cake mix",
        "1/2 cup buttermilk",
        "1 egg",
        "1 1/2 tablespoons unsweetened cocoa powder",
        "2 tablespoons red food coloring",
        "1 teaspoon cider vinegar",
        "1 (8 ounce) package cream cheese, softened",
        "1 cup margarine, softened",
        "2 (16 ounce) packages confectioners' sugar",
        "2 teaspoons peppermint extract"
    ],
    "nut": [
        "Calories > 810 kcal",
        "Carbs > 126.9 g",
        "Cholesterol > 38 mg",
        "Fat > 31.7 g",
        "Protein > 7.2 g",
        "Sodium > 711 mg"
    ],
    "n": "Santa's Favorite Cake",
    "a": "Debbie Rowe",
    "r": "0",
    "s": 12,
    "des": "\"This cake is a red velvet cake with a peppermint twist, and a delicious peppermint cream cheese frosting.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9 inch round cake pans.\nIn a large bowl, combine white cake mix, 3 egg whites, 1 1/3 cups buttermilk, and 2 tablespoons vegetable oil. Mix with an electric mixer for 2 minutes on high speed. In a separate bowl, combine yellow cake mix, 1/2 cup buttermilk, 1 egg, cocoa, red food coloring, and vinegar. Use an electric mixer to beat for 2 minutes on high speed.\nSpoon white batter alternately with red batter into the prepared cake pans. Swirl batter gently with a knife to create a marbled effect.\nBake in preheated oven for 22 to 25 minutes, or until a wooden pick inserted into the centers comes out clean. Let cool in pans for at least 10 minutes before turning out onto a wire rack to cool completely.\nIn a large bowl, beat cream cheese and margarine until smooth. Gradually blend in sugar until incorporated and smooth. Stir in peppermint extract. Spread peppermint cream cheese frosting between layers, and on top and sides of cake.",
    "pt": "45 m",
    "ct": "25 m",
    "tt": "2 h ",
    "i": "175495.jpg",
    "o": "943009.jpg,759931.jpg,759930.jpg,748318.jpg,599961.jpg,566995.jpg",
    "st": "allrecipes"
}