{
    "id": 9371,
    "old_rating": "3.9697",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 large potatoes, peeled and quartered",
        "5 eggs",
        "1/4 cup heavy whipping cream",
        "3/4 teaspoon salt",
        "3/4 cup shredded sharp Cheddar cheese",
        "3/4 cup shredded Swiss cheese",
        "1/2 onion, chopped",
        "3 teaspoons baking powder",
        "1/2 cup butter, melted",
        "1/2 cup sour cream",
        "1/2 cup chopped green onions"
    ],
    "nut": [
        "Calories > 295 kcal",
        "Carbs > 20 g",
        "Cholesterol > 135 mg",
        "Fat > 20.1 g",
        "Protein > 9.9 g",
        "Sodium > 470 mg"
    ],
    "n": "Kartoshnik with Cheese and Onions",
    "a": "William Anatooskin",
    "r": "0",
    "s": 11,
    "des": "\"Looks like a cake when baked, but is eaten like a potato. Serve as part of a main course.\"",
    "ins": "In a medium pot, add potatoes, cover with water and boil until cooked. When done, drain water and discard. Mash potatoes and set aside.\nPreheat oven to 450 degrees F (230 degrees C). Prepare a 9x9-inch oven-proof baking dish by spraying with a no-stick vegetable spray or rub inside with butter or margarine.\nIn a separate bowl, beat eggs, add whipping cream and salt, and whisk until blended. Add mashed potatoes and mix until well blended. Add both cheeses and onions and stir well. Add baking powder and mix well. Pour potato mixture into prepared baking dish and level.\nBake at 450 degrees F (230 degrees C) for 35 minutes or until top has a nice light brown color. Remove from oven and let cool for 5 minutes. (The Kartoshnik will rise when cooking, but will settle when removed from oven and cooled slightly.)\nIn a small pot, melt butter or margarine.\nCut Kartoshnik into 3x3-inch squares and serve with melted butter or margarine, a dollop of sour cream, and a sprinkling of green onions. You can also use plain yogurt, or low fat sour cream.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "29514.jpg",
    "o": "",
    "st": "allrecipes"
}