{
    "id": 9414,
    "old_rating": "3.38462",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound salt",
        "1 gallon water",
        "2 pounds cauliflower, broken into small florets",
        "2 pounds cucumber, peeled and diced",
        "2 pounds pearl onions, halved",
        "9 ounces white sugar",
        "3 teaspoons mustard powder",
        "1 1/2 teaspoons ground ginger",
        "6 cups distilled white vinegar",
        "1 1/2 ounces all-purpose flour",
        "2 tablespoons ground turmeric"
    ],
    "nut": [
        "Calories > 27 kcal",
        "Carbs > 6.3 g",
        "Cholesterol > 0 mg",
        "Fat > 0.1 g",
        "Protein > 0.6 g",
        "Sodium > 2228 mg"
    ],
    "n": "Piccalilli",
    "a": "Ruth",
    "r": "0",
    "s": 80,
    "des": "\"Growing up in England, Piccalilli was commercially available, but none were as good as my grandmother's recipe. This was always a favorite with cheese. It is a good relish to have on hand and would be tasty in a ham sandwich.\"",
    "ins": "Dissolve the salt in the water, and add the cucumber, onions and cauliflower. Cover and leave for 24 hours.  Drain the vegetables.\nIn a large pan, blend the sugar, mustard and ginger with 5 cups of vinegar. Stir in salt and vegetable mixture, bring to the boil, and simmer for 20 minutes.\nBlend the flour and turmeric with the remaining 1 cup of vinegar and stir into the cooked vegetables.  Bring to the boil and cook for 1 to 2 minutes. Pour into sterilized canning jars.\nIn a large stock pot, pour water half way to top with boiling water. Using a holder, carefully lower jars into pot. Leave a 2-inch space between jars. Add more boiling water to cover them, about 2 inches above the tops.  Bring to a boil and cover, processing for 15 minutes. Remove jars from pot. Put jars on a wood or cloth surface, several inches apart and allow to cool. Jars will be sealed.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "27220.jpg",
    "o": "",
    "st": "allrecipes"
}