{
    "id": 9440,
    "old_rating": "4.5511",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter",
        "1 cup white sugar",
        "2 eggs",
        "1/2 teaspoon vanilla extract",
        "3 1/4 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 cup shortening",
        "1 pound confectioners' sugar",
        "5 tablespoons water",
        "1/4 teaspoon salt",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon butter flavored extract"
    ],
    "nut": [
        "Calories > 112 kcal",
        "Carbs > 16.1 g",
        "Cholesterol > 14 mg",
        "Fat > 5 g",
        "Protein > 0.9 g",
        "Sodium > 68 mg"
    ],
    "n": "Sugar Cookies with Buttercream Frosting",
    "a": "Diane",
    "r": "0",
    "s": 60,
    "des": "\"These cookies are melt-in-your-mouth delicious. They are simple to make and kids love to lick the frosting off the tops. Butter flavoring is in the buttercream for added flavor. You can find it in most supermarkets, in the baking aisle, where there are other flavorings such as vanilla.\"",
    "ins": "In a large bowl, mix together butter, sugar, eggs, and vanilla with an electric mixer until light and fluffy.  Combine the flour, baking powder, baking soda, and salt; gradually stir  flour mixture into butter mixture until well blended using a sturdy spoon. Chill dough for 2 hours.\nPreheat the oven to 400 degrees F (200 degrees C). On a lightly floured surface, roll out the dough to 1/4 inch thickness. Cut into desired shapes using cookie cutters. Place cookies 2 inches apart onto ungreased cookie sheets.\nBake for 4 to 6 minutes in the preheated oven. Remove cookies from pan and cool on wire racks.\nUsing an electric mixer, beat shortening, confectioners sugar, water, salt, vanilla extract, and butter flavoring until fluffy. Frost cookies after they have cooled completely.",
    "pt": "15 m",
    "ct": "5 m",
    "tt": "2 h ",
    "i": "2371242.jpg",
    "o": "4419654.jpg,4365736.jpg,4323567.jpg,4306734.jpg,4072846.jpg,4023508.jpg",
    "st": "allrecipes"
}