{
    "id": 9442,
    "old_rating": "4.5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1/4 cup unsalted butter",
        "3 tablespoons heavy cream",
        "4 (1 ounce) squares semisweet chocolate, chopped",
        "2 tablespoons orange liqueur ",
        "1 teaspoon grated orange zest",
        "4 (1 ounce) squares semisweet chocolate, chopped",
        "1 tablespoon vegetable oil"
    ],
    "nut": [
        "Calories > 159 kcal",
        "Carbs > 11.8 g",
        "Cholesterol > 15 mg",
        "Fat > 12.4 g",
        "Protein > 1.5 g",
        "Sodium > 2 mg"
    ],
    "n": "Chocolate Orange Truffles",
    "a": "Terry",
    "r": "0",
    "s": 12,
    "des": "\"Use orange liqueur or orange juice to flavor these dipped truffles. This is a very easy recipe, requiring no candy thermometer and no sensitive tempering of the chocolate.\"",
    "ins": "In a medium saucepan over medium-high heat, combine butter and cream. Bring to a boil, and remove from heat. Stir in 4 ounces chopped chocolate, orange liqueur, and orange zest; continue stirring until smooth. Pour truffle mixture into a shallow bowl or a 9X5 in loaf pan. Chill until firm, about 2 hours.\nLine a baking sheet with waxed paper. Shape chilled truffle mixture by rounded teaspoons into small balls (a melon baller also works well for this part).  Place on prepared baking sheet. Chill until firm, about 30 minutes.\nIn the top of a double boiler over lightly simmering water, melt remaining 4 ounces chocolate with the oil, stirring until smooth. Cool to lukewarm.\nDrop truffles, one at a time, into melted chocolate mixture. Using 2 forks, lift truffles out of the chocolate, allowing any excess chocolate to drip back into the pan before transferring back onto baking sheet. Chill until set.",
    "pt": "40 m",
    "ct": "20 m",
    "tt": "5 h ",
    "i": "62642.jpg",
    "o": "1867183.jpg,1823635.jpg,270412.jpg,242121.jpg,242119.jpg,225736.jpg",
    "st": "allrecipes"
}