{
    "id": 9454,
    "old_rating": "4.83116",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (16 ounce) package phyllo dough",
        "1 pound chopped nuts",
        "1 cup butter",
        "1 teaspoon ground cinnamon",
        "1 cup water",
        "1 cup white sugar",
        "1 teaspoon vanilla extract",
        "1/2 cup honey"
    ],
    "nut": [
        "Calories > 393 kcal",
        "Carbs > 37.5 g",
        "Cholesterol > 27 mg",
        "Fat > 25.9 g",
        "Protein > 6.1 g",
        "Sodium > 196 mg"
    ],
    "n": "Baklava",
    "a": "NEONWILLIE",
    "r": "0",
    "s": 18,
    "des": "\"A Greek favorite that makes everyone think you are a master chef and is sooo easy to make!! I taught a Greek friend how to make apple pie and she taught me this fabulous recipe. The phyllo dough for this recipe is found in the freezer section of most grocery stores.  Add a little lemon zest to the sugar sauce, if desired.\"",
    "ins": "Preheat oven to 350 degrees F(175 degrees C). Butter the bottoms and sides of a 9x13 inch pan.\nChop nuts and toss with cinnamon. Set aside. Unroll phyllo dough.  Cut whole stack in half to fit pan.  Cover phyllo with a dampened cloth to keep from drying out as you work. Place two sheets of dough in pan, butter thoroughly.  Repeat until you have 8 sheets layered. Sprinkle 2 - 3 tablespoons of nut mixture on top. Top with two sheets of dough, butter, nuts, layering as you go. The top layer should be about 6 - 8 sheets deep.\nUsing a sharp knife cut into diamond or square shapes all the way to the bottom of the pan. You may cut into 4 long rows the make diagonal cuts. Bake for about 50 minutes until baklava is golden and crisp.\nMake sauce while baklava is baking.  Boil sugar and water until sugar is melted.  Add vanilla and honey.  Simmer for about 20 minutes.\nRemove baklava from oven and immediately spoon sauce over it.  Let cool.  Serve in cupcake papers.  This freezes well. Leave it uncovered as it  gets soggy if it is wrapped up.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "4535242.jpg",
    "o": "4535242.jpg,4528176.jpg,4526388.jpg,4523687.jpg,4511426.jpg,4508528.jpg",
    "st": "allrecipes"
}