{
    "id": 94757,
    "old_rating": "4.73684",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 pound ground pork",
        "1 cup finely chopped raw shrimp",
        "1/2 cup finely chopped onion",
        "1/2 cup grated carrots",
        "1/4 cup finely chopped green onions",
        "3 tablespoons soy sauce",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 teaspoon monosodium glutamate (MSG) (optional)",
        "1 (16 ounce) package spring roll wrappers",
        "1 egg white, beaten",
        "1 quart vegetable oil for frying"
    ],
    "nut": [
        "Calories > 43 kcal",
        "Carbs > 3.7 g",
        "Cholesterol > 7 mg",
        "Fat > 2.1 g",
        "Protein > 2.1 g",
        "Sodium > 115 mg"
    ],
    "n": "Lumpia - Filipino Shrimp and Pork Egg Rolls",
    "a": "Elise",
    "r": "0",
    "s": 75,
    "des": "\"The traditional Filipino egg roll is small in size, but big on taste. More shrimp can be added to your taste, or omitted altogether. They can also be frozen for later consumption. Serve with store-bought sweet and sour sauce or spring roll sauce (available in Asian grocery stores).\"",
    "ins": "Mix the ground pork, shrimp, onion, carrots, green onions, soy sauce, salt, pepper, and MSG in a bowl until well combined.\nPull a wrapper off the stack, and cover the remaining wrappers with a damp cloth. Place the wrapper on a work surface. Place a thin line, about the width of your little finger, across one side of the wrapper, 1/2 inch from the edge of the wrapper. Roll the wrapper tightly around the filling, and seal the edges with egg white. Repeat making rolls with the remaining wrappers and filling, and cut the rolls into thirds.\nHeat the oil in a heavy pan or deep fryer to 375 degrees F (190 degrees C). Deep-fry 3 or 4 lumpia at a time, turning once, until the rolls float and turn golden brown, about 3 minutes. Serve hot.",
    "pt": "1 h",
    "ct": "30 m",
    "tt": "1 h ",
    "i": "683798.jpg",
    "o": "",
    "st": "allrecipes"
}