{
    "id": 95047,
    "old_rating": "4.08333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 pound bite-size whole wheat pasta, such as rigatoni or penne",
        "1 tablespoon Salt",
        "1 medium head cauliflower, trimmed and cut into bite-size florets",
        "3 tablespoons olive oil",
        "1/2 red bell pepper, cut into medium dice",
        "1/2 yellow bell pepper, cut into medium dice",
        "3 cloves garlic, minced",
        "1 cup canned crushed tomatoes",
        "1 teaspoon Italian seasoning",
        "1/4 cup coarsely chopped pitted kalamata olives",
        "4 cups factory-washed arugula or spinach",
        "3/4 cup crumbled feta cheese, divided",
        "1 pinch Freshly ground black pepper"
    ],
    "nut": [
        "Calories > 404 kcal",
        "Carbs > 60.9 g",
        "Cholesterol > 17 mg",
        "Fat > 13.6 g",
        "Protein > 15.7 g",
        "Sodium > 1550 mg"
    ],
    "n": "Whole Wheat Rigatoni and Cauliflower, Wilted Arugula, Feta & Olives",
    "a": "USA WEEKEND columnist Pam Anderson",
    "r": "0",
    "s": 6,
    "des": "\"This convenient recipe makes getting two meals on the table a snap.\"",
    "ins": "Bring a generous 2 quarts of water and salt to a boil in a large soup kettle; add pasta and cook, partially covered, for 4 minutes. Add cauliflower and cook, partially covered, until pasta and cauliflower are tender, about 6 minutes longer. Reserve 1 cup of cooking liquid, drain pasta and return top pot.\nMeanwhile, heat oil in a 10-inch skillet. Add peppers, and saute until tender, about 4 minutes. Add garlic; continue to saute until golden and fragrant, about 1 minute longer. Add tomatoes, seasoning and olives; simmer sauce about 5 minutes. Add sauce to pasta, along with reserved cooking liquid, arugula and 1/2 cup feta. Toss, seasoning to taste with pepper. Serve with additional feta.\nFor lunch, pack pasta and extra feta in leakproof containers. Warm pasta in microwave and top with feta.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "788535.jpg",
    "o": "",
    "st": "allrecipes"
}