{
    "id": 9534,
    "old_rating": "4.7193",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 cups white sugar",
        "1 cup water",
        "3/4 cup light corn syrup",
        "1/2 teaspoon peppermint extract",
        "1 drop red food coloring (optional)",
        "1/8 cup confectioners' sugar"
    ],
    "nut": [
        "Calories > 116 kcal",
        "Carbs > 30.2 g",
        "Cholesterol > 0 mg",
        "Fat > 0 g",
        "Protein > 0 g",
        "Sodium > 8 mg"
    ],
    "n": "Old Fashioned Hard Candy",
    "a": "Tami L. Smith",
    "r": "0",
    "s": 20,
    "des": "\"This is an old recipe from my childhood.  Many people have memories of cutting this candy with their mother's and grandmothers.  I have passed it on and am now posting here for all to share in this classic Christmas tradition!\"",
    "ins": "In a heavy 2 quart saucepan, combine the sugar, water and corn syrup. Cook, stirring constantly until the sugar is dissolved; then cook without stirring, lowering the heat and cooking more slowly during the last few minutes, to the hard crack stage (300 degrees F), If sugar crystals form on sides of pan, wipe them off with a damp brush.\nRemove from heat, add oil flavoring and enough food coloring to color; stir only to mix. Pour into 2 well buttered 9 inch pans. Set one pan of candy over a sauce pan containing hot water (unless you have a helper to help cut the candy). As soon as the other pan of candy is cool enough to handle, cut it with scissors into 1-inch strips. Then snip the strips into pieces. Work fast. Drop the pieces onto a buttered baking sheet. If the candy cools too quickly, set it on a saucepan over hot water to soften it, but if it gets sticky, return at once to the work counter.\nToss in a small amount of powdered sugar to keep from sticking together. Repeat with the second pan of candy.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "294113.jpg",
    "o": "4341343.jpg,1035274.jpg,908200.jpg,629564.jpg,629560.jpg,629554.jpg",
    "st": "allrecipes"
}