{
    "id": 9550,
    "old_rating": "4.23077",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups cranberries",
        "1 1/2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon baking soda",
        "1/3 cup boiling water",
        "1/2 cup molasses",
        "1 cup white sugar",
        "1/2 cup butter, softened",
        "1/2 cup heavy whipping cream",
        "1 teaspoon vanilla extract"
    ],
    "nut": [
        "Calories > 327 kcal",
        "Carbs > 49.6 g",
        "Cholesterol > 41 mg",
        "Fat > 13.8 g",
        "Protein > 2.4 g",
        "Sodium > 256 mg"
    ],
    "n": "Cranberry Pudding",
    "a": "Jerri",
    "r": "0",
    "s": 10,
    "des": "\"This is a great holiday treat. I've made it for years and have passed it on to friends and family. Good eating!\"",
    "ins": "Lightly grease a 2-quart metal pudding mold or a clean 1-pound coffee can. Pick over whole cranberries; wash and drain.\nSift together the flour and salt; dredge cranberries in flour mixture.\nDissolve soda into boiling water and add molasses. Stir and allow to foam up.\nAdd to the flour and cranberry mixture. Mix together until well blended. Spoon into prepared mold or pan; cover with a double layer of aluminum foil and fasten with heavy elastic band or string.\nPlace into a deep saucepan and fill with water up to about the halfway mark on the pudding can. Cover saucepan and place over high heat. Bring water to boil, reduce heat, and simmer for 1 hour. Remove from water and allow to cool.\nPrepare the sauce by mixing together the sugar, butter and cream. Cook over medium heat until thick, stirring constantly. Remove from heat and add vanilla.\nWhen ready to serve the pudding, invert pan or open bottom of can and push through. Slice in 1/2-inch pieces. Pour sauce over individual slices of pudding.",
    "pt": "25 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "150716.jpg",
    "o": "",
    "st": "allrecipes"
}