{
    "id": 95558,
    "old_rating": "4",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1/4 cup all-purpose flour",
        "1 teaspoon ground black pepper",
        "1 teaspoon cayenne pepper",
        "3 skinless, boneless chicken breast halves - cut into 1 inch pieces",
        "2 tablespoons olive oil",
        "1 red bell pepper, seeded and chopped",
        "1 onion, chopped",
        "1 clove garlic, minced",
        "1/2 jalapeno pepper, seeded and minced",
        "3/4 cup chicken broth",
        "2 teaspoons Worcestershire sauce",
        "1/2 cup milk",
        "1 tablespoon all-purpose flour",
        "1/2 cup sour cream",
        "1 cup shredded Monterey Jack cheese",
        "1 (12 ounce) package uncooked linguini pasta"
    ],
    "nut": [
        "Calories > 468 kcal",
        "Carbs > 51.5 g",
        "Cholesterol > 61 mg",
        "Fat > 16.9 g",
        "Protein > 28.2 g",
        "Sodium > 181 mg"
    ],
    "n": "Chicken with Pepper Cheese Sauce",
    "a": "JLILLY19",
    "r": "0",
    "s": 6,
    "des": "\"A cheesy, creamy pasta dish that has just a bit of a bite. Reduce the jalapeno according to how spicy you like it. This goes great with garlic toast.\"",
    "ins": "Bring a large pot of lightly salted water to a boil. Add linguine pasta and cook for 8 minutes, or until tender. Drain.\nMeanwhile, in a shallow dish, mix together 1/4 cup flour, black pepper and cayenne pepper. Coat the chicken in the flour mixture, shaking off the excess. Heat the oil in a large skillet over medium heat. Add chicken pieces and cook until browned on the outside and no longer pink inside. Remove to a plate and keep warm.\nAdd the bell pepper, onion, garlic and jalapeno pepper to the skillet; cook and stir over medium heat for about 5 minutes. Stir in the chicken broth, Worcestershire sauce and milk. Bring to a simmer. Stir in 1 tablespoon of flour and simmer over medium-low heat until the sauce starts to thicken.\nRemove from the heat and stir in sour cream and Monterey Jack cheese until melted. Return chicken to the pan and stir to coat with sauce. Serve chicken and sauce over pasta.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "56187.jpg",
    "o": "",
    "st": "allrecipes"
}