{
    "id": 9569,
    "old_rating": "4.49451",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup butter, softened",
        "1 1/2 cups white sugar",
        "1 egg",
        "1 teaspoon vanilla extract",
        "2 1/2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/2 teaspoon almond extract",
        "5 drops red food coloring",
        "1 (1 ounce) square unsweetened chocolate, melted",
        "1/2 cup chopped walnuts"
    ],
    "nut": [
        "Calories > 63 kcal",
        "Carbs > 7.7 g",
        "Cholesterol > 9 mg",
        "Fat > 3.4 g",
        "Protein > 0.7 g",
        "Sodium > 46 mg"
    ],
    "n": "Neapolitan Cookies I",
    "a": "missy",
    "r": "0",
    "s": 72,
    "des": "\"This cute refrigerator cookie resembles the popular ice cream flavor. There are chocolate, pink and white stripes.\"",
    "ins": "In a medium bowl, cream together the butter and sugar. Stir in the eggs and vanilla. Combine the flour, baking powder, and salt; stir into the creamed mixture. Divide dough equally into three small bowls. Add almond extract and red food coloring to one portion; stir until thoroughly mixed. Mix chocolate into second bowl, and walnuts into the third bowl.\nLine a 9x5 inch loaf pan with waxed paper, and spread almond dough evenly in the bottom of the pan. Spread the walnut dough evenly over the almond layer, and top with chocolate dough layer. Cover layered dough with waxed paper, and place  in the refrigerator until firm, about 4 hours.\nPreheat oven to 350 degrees F (175 degrees C). Turn out chilled dough by inverting pan; peel off waxed paper. With sharp knife, cut dough lengthwise in half. Slice each half of dough crosswise into 1/4 inch slices. Place slices on cookie sheet one inch apart.\nBake 10 to 12 minutes in the preheated oven, until light brown. Remove to wire racks to cool.",
    "pt": "45 m",
    "ct": "12 m",
    "tt": "5 h ",
    "i": "4277346.jpg",
    "o": "4277346.jpg,3245046.jpg,1894545.jpg,1101139.jpg,1012567.jpg,641390.jpg",
    "st": "allrecipes"
}