{
    "id": 9573,
    "old_rating": "3.8961",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 1/2 cups white sugar",
        "2/3 cup shortening",
        "2 eggs",
        "2 tablespoons milk",
        "1 teaspoon vanilla extract",
        "3 1/4 cups all-purpose flour",
        "2 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 egg white (optional)"
    ],
    "nut": [
        "Calories > 337 kcal",
        "Carbs > 51.3 g",
        "Cholesterol > 31 mg",
        "Fat > 12.6 g",
        "Protein > 4.9 g",
        "Sodium > 217 mg"
    ],
    "n": "My Favorite Sugar Cookies",
    "a": "d. shepard",
    "r": "0",
    "s": 12,
    "des": "\"This sugar cookie recipe is great for Christmas cut-out cookies.\"",
    "ins": "Combine sugar and shortening in a mixing bowl. Beat at low speed just until smooth. Mix in eggs, milk, and vanilla.\nIn separate bowl, whisk flour, baking soda and salt. Pour into sugar mixture and blend until combined.\nShape dough into a ball and wrap with waxed paper or plastic wrap. Refrigerate 2 to 3 hours until easy to handle.\nPreheat oven to 400 degrees F (200 degrees C). Lightly grease cookie sheets or line them with parchment paper.\nRoll out half of the dough at a time on a lightly floured surface. Keep the remaining dough refrigerated. For crisp cookies, roll paper-thin. For softer cookies, roll 1/8 to 1/4 inch thick.\nWith floured cookie cutters, cut dough into various shapes. Re-roll dough trimmings into a ball, cover and refrigerate, and continue to cut shapes with chilled dough.\nPlace cookies 1/2 inch apart on greased cookie sheets. To glaze, brush tops of cookies with heavy or whipping cream or with an egg white slightly beaten with 1 tablespoon of water.\nSprinkle cookies with your choice of toppings; bake 8 minutes or until very light brown. Remove cookies and cool completely.",
    "pt": "30 m",
    "ct": "8 m",
    "tt": "2 h ",
    "i": "622398.jpg",
    "o": "",
    "st": "allrecipes"
}