{
    "id": 9603,
    "old_rating": "4.17742",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/2 cups blanched whole almonds",
        "2 cups all-purpose flour",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1/8 teaspoon salt",
        "7/8 cup white sugar",
        "2 cups semisweet chocolate chips",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "2 tablespoons whiskey"
    ],
    "nut": [
        "Calories > 261 kcal",
        "Carbs > 34.6 g",
        "Cholesterol > 21 mg",
        "Fat > 12.4 g",
        "Protein > 5.6 g",
        "Sodium > 78 mg"
    ],
    "n": "Chocolate and Almond Biscotti",
    "a": "C. Anderson",
    "r": "0",
    "s": 18,
    "des": "\"Lots of chocolate chips make this biscotti irresistible.\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C).  Toast the almonds in a shallow pan for 12 to 15 minutes, shaking the pan a few times, until almonds are lightly colored.  Set aside to cool.\nPreheat oven to 375 degrees F (190 degrees C).  Line 2 or 3 cookie sheets with aluminum foil, shiny side up.\nIn a large bowl, stir together the flour, baking soda, baking powder, salt and sugar. Place 1/2 cup of these dry ingredients into the bowl of a food processor.  Add about a half cup of the toasted almonds and process for about 30 seconds.\nReturn the mixture to the bowl of dry ingredients and stir in the remaining almonds and chocolate chips. In a large measuring cup, beat the eggs, vanilla and whiskey with a fork to blend. Stir into the dry ingredients until moistened. Wet your hands and divide the dough into four portions.  Keeping hands wet, form each quarter into strips about 9 inches long, 2 inches wide and 1/2 inch high.  Round the ends. Place two strips crosswise on each of the cookie sheets.\nBake for 25 minutes in the preheated oven. If baking more that one sheet at a time, reverse the sheets top to bottom halfway through cooking time.\nUsing a metal spatula remove the slabs from cookie sheets and let cool for 20 minutes on cutting board.  Reduce oven temperature to 275 degrees F.\nWith a serrated knife, carefully cut at an angle into slices about 1/2 inch wide.  Place the slices, cut side down, onto cookie sheets.\nBake 25 to 30 minutes in the preheated oven, until the biscotti is crispy and lightly toasted.\nTurn oven off and open the oven door, allowing the biscotti to cool in the oven.  When cool, store in an airtight container.",
    "pt": "25 m",
    "ct": "50 m",
    "tt": "1 h ",
    "i": "2730808.jpg",
    "o": "357301.jpg,173002.jpg,172561.jpg,172556.jpg,100797.jpg,34782.jpg",
    "st": "allrecipes"
}