{
    "id": 96542,
    "old_rating": "4.15385",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 cups water",
        "2 red beets, trimmed and washed",
        "1 1/2 pounds tomatoes, chopped",
        "4 ounces tomato puree",
        "2 tablespoons butter",
        "2 red onions, chopped",
        "2 cups chopped mushrooms",
        "2 carrots, chopped",
        "2 stalks celery, chopped",
        "1/4 cup chopped fresh dill, divided",
        "1 cube vegetable bouillon",
        "2 large yellow potatoes, cubed",
        "1 (15.25 ounce) can kidney beans",
        "6 cups water",
        "1/2 head green cabbage, chopped",
        "1 lemon, juiced",
        "salt and pepper to taste",
        "1 cup sour cream, for topping"
    ],
    "nut": [
        "Calories > 235 kcal",
        "Carbs > 32.6 g",
        "Cholesterol > 20 mg",
        "Fat > 9.6 g",
        "Protein > 8 g",
        "Sodium > 304 mg"
    ],
    "n": "Vibrant Vegetarian Purple Borscht",
    "a": "Anin",
    "r": "0",
    "s": 8,
    "des": "\"While many traditional borscht recipes come out a muted red, this recipe produces a bright purple soup that is delicious, hearty, satisfying, and beautiful. Excellent served as a main course or with blinchiki on the side.\"",
    "ins": "Place the beets into a large pot and cover with 4 cups of water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, 20 to 40 minutes. Meanwhile, place the tomatoes and tomato puree in a blender and blend until smooth. Set aside.\nMeanwhile, heat the butter in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the mushrooms and cook until tender, about 10 minutes. Stir in the carrots, celery, tomato mixture, half of the dill, and the vegetable bouillon. Continue cooking and stirring until the carrots are tender, about 10 minutes.\nRemove the beets from the cooking liquid and place them in the freezer in a bowl. Stir the mushroom mixture, potatoes, kidney beans, including the liquid, and 6 cups of water into the beet water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until the potatoes are tender, about 20 minutes.\nPeel, then grate the chilled beets. Stir the beets, cabbage, and remaining dill into the soup. Cover and simmer until the cabbage is tender, about 5 minutes. Stir in lemon juice and season with salt and pepper. Remove from heat and allow soup to rest for at least 2 hours. Bring soup to a boil, and serve hot with a dollop of sour cream.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "3 h ",
    "i": "358877.jpg",
    "o": "",
    "st": "allrecipes"
}