{
    "id": 97018,
    "old_rating": "4.33333",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup all-purpose flour",
        "1/2 cup chopped pecans",
        "1/2 cup softened butter",
        "1 (8 ounce) package cream cheese, softened",
        "1 1/2 cups confectioners' sugar",
        "1 (8 ounce) container frozen whipped topping, thawed, divided",
        "2 cups white sugar",
        "6 tablespoons cornstarch",
        "1/4 teaspoon salt",
        "2 cups water",
        "3 eggs, beaten",
        "1/4 cup distilled white vinegar",
        "1/4 cup lemon juice",
        "1 tablespoon butter",
        "1 teaspoon lemon extract"
    ],
    "nut": [
        "Calories > 394 kcal",
        "Carbs > 52.7 g",
        "Cholesterol > 72 mg",
        "Fat > 19.6 g",
        "Protein > 3.9 g",
        "Sodium > 150 mg"
    ],
    "n": "Granny's Lemon Yum Yum",
    "a": "MANDY1975",
    "r": "0",
    "s": 15,
    "des": "\"My granny used to make this for us for birthdays and special occasion. Hope you enjoy!\"",
    "ins": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.\nCombine the flour and pecans in a mixing bowl. Mix in the softened butter until the mixture is evenly moistened and no clumps of butter remain. Press the crust evenly over the prepared baking sheet.\nBake in the preheated oven until golden brown, 10 to 15 minutes. Remove from the oven and allow to cool completely.\nBeat the cream cheese and confectioners' sugar in a bowl until light and fluffy. Fold in 1 1/2 cups of the whipped topping, then spread the mixture over the cooled crust. Chill in the refrigerator.\nStir the sugar, cornstarch, and salt together in a saucepan along with enough water to make a paste. Stir in the eggs until smooth, then add the remaining water, vinegar, and lemon juice. Cook and stir over medium-low heat until thick and smooth, about 10 minutes. Remove from the heat and stir in 1 tablespoon of butter and the lemon extract. Chill the mixture until cold.\nSpread the cold lemon mixture evenly over the cream cheese layer. Top with the remaining whipped topping.",
    "pt": "25 m",
    "ct": "20 m",
    "tt": "2 h ",
    "i": "265015.jpg",
    "o": "",
    "st": "allrecipes"
}