{
    "id": 97806,
    "old_rating": "4.41935",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "2 1/4 pounds potatoes, peeled and quartered",
        "2 chicken bouillon cubes",
        "1 cup warm milk",
        "1/4 cup melted butter",
        "1 tablespoon cooking oil",
        "8 links pork sausage",
        "1 large onion, sliced and separated into rings",
        "2 (10.25 ounce) cans homestyle beef gravy",
        "2 teaspoons crumbled dried oregano"
    ],
    "nut": [
        "Calories > 628 kcal",
        "Carbs > 61.5 g",
        "Cholesterol > 61 mg",
        "Fat > 35.4 g",
        "Protein > 18.3 g",
        "Sodium > 2001 mg"
    ],
    "n": "Classic Bangers and Mash",
    "a": "Amystar79",
    "r": "0",
    "s": 4,
    "des": "\"This is a delicious and irresistible recipe that everyone loves. It pairs creamy potatoes, crunchy onions, smooth gravy, and yummy sausages!!\"",
    "ins": "Place the potatoes in a pan, and add enough water to cover. Bring to a boil, and cook until tender, about 20 minutes. Drain, leaving the potatoes in the pan.\nMeanwhile, stir the bouillon cubes into the warm milk until dissolved. Stir the milk mixture and butter into the potatoes. Mash the potatoes until smooth and creamy.\nHeat the cooking oil in a skillet over medium-high heat. Prick the sausages in a few places with a fork, and place them into the skillet. Cook, turning often, until golden brown and juices run clear, 12 to 15  minutes depending on thickness. Remove from the skillet and drain on paper towels.\nUsing the same skillet, add the onion rings. Cook and stir over medium heat until the onions are golden, but still crisp, about 5 minutes.\nHeat the gravy in a pan over medium heat.\nTo serve, scoop the potatoes onto a large serving plate. Arrange the sausages over the potatoes, top with the onions, drizzle with gravy, and sprinkle with oregano.",
    "pt": "20 m",
    "ct": "35 m",
    "tt": "55 m",
    "i": "255177.jpg",
    "o": "",
    "st": "allrecipes"
}