{
    "id": 9793,
    "old_rating": "4.75484",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "2 cups white sugar",
        "1 cup butter, softened",
        "4 eggs",
        "4 1/2 cups all-purpose flour",
        "4 teaspoons baking powder",
        "3/4 teaspoon salt",
        "1/3 cup brandy",
        "1 1/2 teaspoons anise extract",
        "1 teaspoon vanilla extract",
        "1 cup almonds",
        "2 tablespoons anise seed"
    ],
    "nut": [
        "Calories > 111 kcal",
        "Carbs > 14.5 g",
        "Cholesterol > 21 mg",
        "Fat > 4.7 g",
        "Protein > 2 g",
        "Sodium > 88 mg"
    ],
    "n": "Anise Biscotti",
    "a": "Laria Tabul",
    "r": "0",
    "s": 60,
    "des": "\"Delicious, with a hint of licorice flavor.  You can store these in an airtight container for over a month.\"",
    "ins": "Preheat oven to 350 degrees F.  Line 2 cookie sheets with parchment paper or foil.\nIn large mixing bowl, beat sugar and butter until light and fluffy.  Add eggs one at a time, beating well after each addition. Combine brandy, anise extract and vanilla in a small bowl or measuring cup. In a medium bowl, combine flour, baking powder and salt. Alternately add dry ingredients and brandy mixture to the butter mixture, beginning and ending with the dry ingredients. Stir in the almonds and aniseed.\nDrop dough by spoonfuls onto prepared sheet, forming two 2 x 13-inch long strips on each sheet.  Smooth dough into logs with moistened fingertips.\nBake about30 to 35 minutes or until golden and firm to the touch. Place cookie sheets on racks and cool completely. Reduce the oven temperature to 300 degrees F.\nCut cooled logs on the diagonal into 3/4-inch thick slices using a serrated knife.  Place slices on cookie sheets.\nBake for about 20 minutes, turning after 10 minutes, until dry and slightly brown. Remove to a rack and cool.",
    "pt": "20 m",
    "ct": "1 h",
    "tt": "1 h ",
    "i": "939103.jpg",
    "o": "4468231.jpg,2812670.jpg,2509745.jpg,931146.jpg,705640.jpg,557855.jpg",
    "st": "allrecipes"
}