{
    "id": 9817,
    "old_rating": "4.14286",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup butter, softened",
        "6 ounces cream cheese, softened",
        "2 tablespoons white sugar",
        "2 cups all-purpose flour",
        "3/4 cup dried apricots",
        "1 1/2 cups water",
        "3/4 cup white sugar"
    ],
    "nut": [
        "Calories > 674 kcal",
        "Carbs > 71.9 g",
        "Cholesterol > 113 mg",
        "Fat > 41.1 g",
        "Protein > 7.3 g",
        "Sodium > 304 mg"
    ],
    "n": "Apricot Kolaches",
    "a": "Mollie Nagel",
    "r": "0",
    "s": 6,
    "des": "\"Kolaches are a Czech recipe that are traditionally made with a yeast dough and fruit filling.  In this version a non-yeasted dough is used. Variations include:  cottage cheese, prune and apricot.  All are somewhat sweet and can be drizzled with a light powder sugar/milk frosting, but traditionally kolaches are not frosted.  I hope this is what you were looking for !!  If ever in Oklahoma, check out the Czech Festival in Yukon, OK.  The ladies of the community make about 2000 plus dozen Kolaches for sale during the festivities !!!\"",
    "ins": "To make Filling:  Combine apricots and water in heavy saucepan and cook covered over medium heat for 10 minutes or until apricots are soft. Cook UNCOVERED 5 to 10 minutes or until most of the water has been absorbed.\nMash apricots, stir in 2 tablespoons of sugar and let filling cool.  Set aside.\nTo make Dough:   Cream butter and cream cheese until fluffy; add 3/4 cup sugar and beat well.  Add flour and mix well. Shape dough into ball and chill 1 hour.\nTurn dough onto well-floured surface, working with only half the dough.  Roll into 1/8 inch thickness and cut into 2 inch squares. Spoon 1/2 teaspoon of apricot filling into the center of the square. Bring four corners to center, pinching to seal.\nBake at 400 degrees F for about 15 minutes. Optional - you may baste with butter halfway thru baking period.\nOptional - drizzle LIGHTLY with powdered sugar/milk frosting if you desire sweeter kolaches.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "",
    "o": "",
    "st": "allrecipes"
}