{
    "id": 9836,
    "old_rating": "4.2",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "3 cups all-purpose flour",
        "1 1/2 teaspoons ground cinnamon",
        "1 teaspoon ground cloves",
        "1 teaspoon ground ginger",
        "1/8 teaspoon baking powder",
        "1/8 teaspoon salt",
        "1 cup butter, softened",
        "1 1/4 cups packed brown sugar",
        "1 egg",
        "1/2 cup sliced almonds"
    ],
    "nut": [
        "Calories > 368 kcal",
        "Carbs > 47.6 g",
        "Cholesterol > 56 mg",
        "Fat > 18.1 g",
        "Protein > 4.8 g",
        "Sodium > 152 mg"
    ],
    "n": "Speculaas",
    "a": "ICECATS",
    "r": "0",
    "s": 12,
    "des": "\"I believe another name for Windmill Cookies is Speculaas. The spices \"speculaaskruiden\" make this cookie so distinctive and were imported centuries ago from the far east.  \"",
    "ins": "In a medium-sized bowl, mix the flour with spices, baking powder and salt.\nIn a large bowl, beat butter and sugar at high speed until light and fluffy. Beat in the egg and mix well.\nStir in by hand half the flour mixture, then add the remaining flour and almonds.  Mix with a wooden spoon or knead with hands.\nDivide dough into four parts, wrap in plastic and refrigerate for several hours.  (If you  are using a mold, chill it as well.)\nPreheat oven to 350 degrees F (180 degrees C) and grease two cookie sheets.\nRemove one quarter of the dough from the refrigerator and flatten it with your hands.  Oil your mold and lightly flour it.  Using your fingers, press dough firmly into the mold.  Trim any excess dough from the mold with a knife.\nTransfer the cookies onto greased cookie sheets with a spatula, spacing about  one inch apart.\nRefrigerate dough trimming to be rerolled later.  Lightly flour but do not re-oil cookie mold.\nRepeat process with remaining dough.  When cookie sheets are full, bake cookies for 20 - 25 minutes or until golden brown around the edges.  Store in a covered tin.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "2933181.jpg",
    "o": "",
    "st": "allrecipes"
}