{
    "id": 9874,
    "old_rating": "4.39024",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 cup white sugar",
        "1/2 cup butter, softened",
        "1 (16 ounce) can chocolate syrup",
        "4 eggs",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon salt",
        "1 cup all-purpose flour",
        "2 1/2 cups confectioners' sugar",
        "1/2 cup butter, melted",
        "3 tablespoons creme de menthe liqueur",
        "1 cup semisweet chocolate chips",
        "6 tablespoons butter"
    ],
    "nut": [
        "Calories > 598 kcal",
        "Carbs > 84.6 g",
        "Cholesterol > 118 mg",
        "Fat > 27.5 g",
        "Protein > 4.8 g",
        "Sodium > 299 mg"
    ],
    "n": "Chocolate Mint Brownies",
    "a": "S. Hynek",
    "r": "0",
    "s": 12,
    "des": "\"Moist brownies are topped with a layer of mint creme and a rich chocolate glaze for a tempting treat any time of year.\"",
    "ins": "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x13 inch baking pan.\nIn a large bowl, mix together 1 cup of white sugar and 1/2 cup of butter until smooth. Beat in the eggs one at a time, then stir in the vanilla and chocolate syrup. Combine the salt and flour; mix into the batter just until blended. Spread the batter evenly in the prepared pan.\nBake for 25 minutes in the preheated oven, until the brownies begin to pull away from the sides of the pan. Let cool.\nIn a medium bowl, mix together 1/2 cup melted butter and confectioners' sugar until smooth. Stir in creme de menthe liqueur. Spread over the cooled brownies and allow to cool completely.\nCombine the chocolate chips and remaining butter in a microwave safe dish. Heat for 1 minute in the microwave, stir, then continue to heat at 30 second intervals, stirring each time, until melted and smooth. Spread over the top of the brownies. Allow to cool completely before cutting into 2 inch squares.",
    "pt": "",
    "ct": "",
    "tt": "",
    "i": "10621.jpg",
    "o": "",
    "st": "allrecipes"
}