{
    "id": 98974,
    "old_rating": "4.70103",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 (15 ounce) container ricotta cheese",
        "2 eggs",
        "2 cups shredded Cheddar cheese",
        "1 cup shredded mozzarella cheese",
        "1 cup grated Parmesan cheese",
        "1 medium onion, minced",
        "1 tablespoon minced garlic",
        "2 tablespoons chopped fresh parsley",
        "1 teaspoon freshly ground black pepper",
        "2 (16 ounce) jars Alfredo pasta sauce",
        "16 no-boil lasagna noodles",
        "2 pounds cooked and cubed lobster meat",
        "1 (10 ounce) package baby spinach leaves"
    ],
    "nut": [
        "Calories > 553 kcal",
        "Carbs > 20.4 g",
        "Cholesterol > 160 mg",
        "Fat > 36.5 g",
        "Protein > 36.8 g",
        "Sodium > 1376 mg"
    ],
    "n": "Maine Lobster Lasagna",
    "a": "Shelak",
    "r": "0",
    "s": 12,
    "des": "\"I made up this recipe because my hubby wanted to try a lasagna made with lobster meat.  I combine tender steamed Maine lobster chunks in between pasta, jarred or homemade Alfredo Sauce and fresh spinach and ricotta, Cheddar and Parmesan cheeses. Serve with a tossed garden salad and oven toasted garlic bread.\"",
    "ins": "Preheat the oven to 375 degrees F (190 degrees C). Grease a 9x13 inch baking dish.\nIn a large bowl, stir together the ricotta cheese, eggs, half of the Cheddar, half of the mozzarella cheese and half of the Parmesan cheese. Mix in the onion, garlic, parsley and pepper.\nSpread 1 1/2 cups of Alfredo sauce in the bottom of the prepared baking dish. Top with a layer of lasagna noodles. Arrange 1/3 of the lobster meat over the noodles, cover with 1/3 of the ricotta cheese mixture, then 1/3 of the spinach and then another layer of Alfredo sauce. Repeat this process two more times ending with sauce on top. Sprinkle the remainder of the Cheddar, mozzarella and Parmesan cheeses over the top. Give the whole pan a gentle shake to get everything settled in.\nBake, covered loosely with aluminum foil, for 45 minutes in the preheated oven. Remove the foil and continue baking for an additional 10 minutes or until the top is browned. Let stand for 10 minutes before serving.",
    "pt": "1 h",
    "ct": "55 m",
    "tt": "1 h ",
    "i": "3808983.jpg",
    "o": "4481499.jpg,3820123.jpg,2625683.jpg,1549851.jpg,555859.jpg,14751.jpg",
    "st": "allrecipes"
}