{
    "id": 9920,
    "old_rating": "4.71555",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "1",
    "ing": [
        "1 cup shortening",
        "1 cup peanut butter",
        "1 cup packed brown sugar",
        "1 cup white sugar",
        "2 eggs",
        "1/4 cup milk",
        "2 teaspoons vanilla extract",
        "3 1/2 cups all-purpose flour",
        "2 teaspoons baking soda",
        "1 teaspoon salt",
        "1/2 cup white sugar for decoration",
        "2 (9 ounce) bags milk chocolate candy kisses, unwrapped"
    ],
    "nut": [
        "Calories > 116 kcal",
        "Carbs > 14.3 g",
        "Cholesterol > 6 mg",
        "Fat > 6 g",
        "Protein > 1.9 g",
        "Sodium > 79 mg"
    ],
    "n": "Peanut Blossoms II",
    "a": "Rosemarie Magee",
    "r": "0",
    "s": 84,
    "des": "\"I make these every year for our annual cookie open house. We make about 15 to 20 different kinds of cookies and have a 4 hour open house with friends.  We then prepare cookie trays to take to shut ins and freeze the rest to enjoy all year long. My husband helps with this four day project! He's retired ... and I'm partially retired. It has been a long standing tradition that we enjoy every year!\"",
    "ins": "Preheat oven to 375 degrees F (190 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the shortening, peanut butter, brown sugar, and 1 cup white sugar until smooth. Beat in the eggs one at a time, and stir in the milk and vanilla. Combine the flour, baking soda, and salt; stir into the peanut butter mixture until well blended. Shape tablespoonfuls of dough into balls, and roll in remaining white sugar. Place cookies 2 inches apart on the prepared cookie sheets.\nBake for 10 to12 minutes in the preheated oven. Remove from oven, and immediately press a chocolate kiss into each cookie. Allow to cool completely;  the kiss will harden as it cools.",
    "pt": "30 m",
    "ct": "12 m",
    "tt": "1 h ",
    "i": "4538196.jpg",
    "o": "4538196.jpg,4511763.jpg,4475506.jpg,4454825.jpg,4385491.jpg,4378128.jpg",
    "st": "allrecipes"
}