{
    "id": 99204,
    "old_rating": "4.32143",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "1 1/4 cups water",
        "1 cup uncooked glutinous white rice (sushi rice)",
        "3 tablespoons rice vinegar",
        "1 pinch salt",
        "4 sheets nori (dry seaweed)",
        "1/2 cucumber, sliced into thin strips",
        "1 avocado - peeled, pitted and sliced"
    ],
    "nut": [
        "Calories > 171 kcal",
        "Carbs > 28.7 g",
        "Cholesterol > 0 mg",
        "Fat > 5.1 g",
        "Protein > 3 g",
        "Sodium > 6 mg"
    ],
    "n": "Cucumber and Avocado Sushi",
    "a": "Lexi S.",
    "r": "0",
    "s": 6,
    "des": "\"Cucumber and avocado sushi! These rolls are easy to make and you can add either fake crab or smoked salmon. Serve with teriyaki or soy sauce and wasabi!\"",
    "ins": "Combine the water and rice in a saucepan and bring to a boil. Cover, reduce heat to low and simmer for 20 minutes, or until rice is tender and water has been absorbed. Remove from the heat and stir in the vinegar and a pinch of salt. Set aside to cool.\nCover a bamboo sushi mat with plastic wrap to keep the rice from sticking. Place a sheet of seaweed over the plastic. Use your hands to spread the rice evenly onto the sheet, leaving about 1/2 inch of seaweed empty at the bottom. Arrange strips of cucumber and avocado across the center of the rice. Lift the mat and roll over the vegetables once and press down. Unroll, then roll again towards the exposed end of the seaweed sheet to make a long roll. You may moisten with a little water to help seal. Set aside and continue with remaining nori sheets, rice and fillings.\nUse a sharp wet knife to slice the rolls into 5 or 6 slices. Serve cut side up with your favorite sushi condiments.",
    "pt": "35 m",
    "ct": "25 m",
    "tt": "1 h",
    "i": "118948.jpg",
    "o": "4220259.jpg,3737024.jpg,3176704.jpg,1130320.jpg,1039733.jpg,973317.jpg",
    "st": "allrecipes"
}