{
    "id": 99236,
    "old_rating": "5",
    "comments": "0",
    "favorites": "0",
    "likes": "0",
    "myfcm_type": "0",
    "ing": [
        "4 large fresh poblano chile peppers",
        "4 lobster tails",
        "4 tablespoons butter, divided",
        "1/2 small sweet onion, minced",
        "4 cloves garlic, minced",
        "1 egg, beaten"
    ],
    "nut": [
        "Calories > 283 kcal",
        "Carbs > 6.7 g",
        "Cholesterol > 220 mg",
        "Fat > 14.5 g",
        "Protein > 31.5 g",
        "Sodium > 554 mg"
    ],
    "n": "Jungle Lobster",
    "a": "NAVILLUS1",
    "r": "0",
    "s": 4,
    "des": "\"This is something I came up with while staying at a guest house at the Jungle Place located south of Playa del Carmen, Mexico. You can squeeze either a little fresh lime juice or lemon juice on top.  A very easy side is a half avocado sliced and arranged in fan style, drizzled with olive oil, lemon, oregano, salt and pepper.\"",
    "ins": "Roast the poblano peppers whole over a hot grill, under a broiler or on a gas stove flame, turning frequently until evenly blackened. Place in a bowl when done, and cover. Leave them to sweat for about 10 minutes to loosen the burnt skin. When cool enough to handle, peel the skin off by rubbing with your hands, leaving the chilies intact. Rinse off the peppers. Cut a slit down one side and open to remove the seeds and stem. Set aside.\nBring a large pot of water to a rolling boil. Add the lobster tails and cook for about 10 minutes, until bright red. Drain and cool slightly. Cut the shell lenghtwise and remove the tail meat in one piece. Set aside.\nMelt 2 tablespoons of the butter in a skillet over medium heat. Add onion and garlic; cook and stir until tender and golden.\nSlit the lobster tails lengthwise about halfway through. Fill the pocket with sauteed onion and garlic. Wrap each tail in one of the peppers so that the openings do not match up. Dip in egg to seal.\nHeat the remaining butter in the same skillet over medium-high heat. Place the stuffed peppers in the pan with the seam side down to seal. Fry on each side just until golden. Serve immediately.",
    "pt": "20 m",
    "ct": "30 m",
    "tt": "50 m",
    "i": "",
    "o": "",
    "st": "allrecipes"
}